{
	"id": "270C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.11",
	"title": "270C.11 TAX EXPENDITURE BUDGET.",
	"text": "State governmental policy objectives are sought to be achieved both by direct expenditure of governmental funds and by the granting of special and selective tax relief or tax expenditures. Both direct expenditures of governmental funds and tax expenditures have an effect on the ability of the state and local governments to lower tax rates or to increase expenditures. As a result, tax expenditures should receive a regular and comprehensive review by the legislature as to (1) their total cost, (2) their effectiveness in achieving their objectives, (3) their effect on the fairness and equity of the distribution of the tax burden, and (4) the public and private cost of administering tax expenditure financed programs. This section is intended to facilitate a regular review of the state and local tax expenditure budget by the legislature by providing for the preparation of a regular biennial tax expenditure budget.\nThe commissioner shall prepare a tax expenditure budget for the state. The tax expenditure budget report shall be submitted to the legislature by November 1 of each even-numbered year.\nThe report shall include estimates of annual tax expenditures for, at a minimum, a three-year period including the two-year period covered in the governor's budget submitted in the preceding January pursuant to section 16A.11.\n(a) The report shall detail for each tax expenditure item:\n(1) the amount of tax revenue forgone;\n(2) a citation of the statutory or other legal authority for the expenditure;\n(3) the year in which it was enacted or the tax year in which it became effective;\n(4) the purpose of the expenditure, as identified in the enacting legislation in accordance with section 3.192 or by the Tax Expenditure Review Commission;\n(5) the incidence of the expenditure, if it is a significant sales or income tax expenditure; and\n(6) the revenue-neutral amount by which the relevant tax rate could be reduced if the expenditure were repealed.\n(b) The report may contain additional information which the commissioner considers relevant to the legislature's consideration and review of individual tax expenditure items. This may include but is not limited to analysis of whether the expenditure is achieving that objective and the effect of the expenditure on the administration of the tax system.\nUpon reasonable notice from the chair of the house of representatives or senate tax committee that a bill is scheduled for hearing, the commissioner shall prepare an estimate of the effect on the state's tax revenues which would result from the passage of a legislative bill establishing, extending, or restricting a tax expenditure. These revenue estimates shall contain the same information as provided in subdivision 4 for expenditure items contained in the tax expenditure budget, as appropriate.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"business tax credit\" means:\n(i) a credit against the corporate franchise tax claimed by a C corporation; or\n(ii) a credit against the individual or fiduciary income tax claimed by a pass-through entity that is allocated to its partners, members, or shareholders;\n(2) \"pass-through entity\" means a partnership, limited liability corporation, or S corporation;\n(3) \"significant tax expenditure\" means a tax expenditure, but excluding any tax expenditure that:\n(i) is incorporated into state law by reference to a federal definition of income;\n(ii) results in a revenue reduction of less than $10,000,000 per biennium; or\n(iii) is a business tax credit;\n(4) \"tax expenditure\" means a tax provision which provides a gross income definition, deduction, exemption, credit, or rate for certain persons, types of income, transactions, or property that results in reduced tax revenue, but excludes provisions used to mitigate tax pyramiding;\n(5) \"tax\" means any tax of statewide application or any tax authorized by state law to be levied by local governments generally. It does not include a special local tax levied pursuant to special law or to a special local tax levied pursuant to general authority that is no longer applicable to local governments generally; and\n(6) \"tax pyramiding\" means imposing sales taxes under chapter 297A on intermediate business-to-business transactions rather than sales to final consumers.",
	"repealed": false
}