{
	"id": "274.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/274.13",
	"title": "274.13 COUNTY BOARD OF APPEAL AND EQUALIZATION.",
	"text": "The county commissioners, or a majority of them, with the county auditor, or, if the auditor cannot be present, the deputy county auditor, or, if there is no deputy, the court administrator of the district court, shall form a board for the equalization of the assessment of the property of the county, including the property of all cities whose charters provide for a board of equalization. This board shall be referred to as the county board of appeal and equalization. The board shall meet annually, on the date specified in section 274.14, at the office of the auditor. Each member shall take an oath to fairly and impartially perform duties as a member. Members shall not participate in any actions of the board which result in market value adjustments or classification changes to property owned by the board member, the spouse, parent, stepparent, child, stepchild, grandparent, grandchild, brother, sister, uncle, aunt, nephew, or niece of a board member, or property in which a board member has a financial interest. The relationship may be by blood or marriage. The board shall examine and compare the returns of the assessment of property of the towns or districts, and equalize them so that each tract or lot of real property and each article or class of personal property is entered on the assessment list at its market value, subject to the following rules:\n(1) The board shall raise the valuation of each tract or lot of real property which in its opinion is returned below its market value to the sum believed to be its market value. The board must first give notice of intention to raise the valuation to the person in whose name it is assessed, if the person is a resident of the county. The notice must fix a time and place for a hearing.\n(2) The board shall reduce the valuation of each tract or lot which in its opinion is returned above its market value to the sum believed to be its market value.\n(3) The board shall raise the valuation of each class of personal property which in its opinion is returned below its market value to the sum believed to be its market value. It shall raise the aggregate value of the personal property of individuals, firms, or corporations, when it believes that the aggregate valuation, as returned, is less than the market value of the taxable personal property possessed by the individuals, firms, or corporations, to the sum it believes to be the market value. The board must first give notice to the persons of intention to do so. The notice must set a time and place for a hearing.\n(4) The board shall reduce the valuation of each class of personal property that is returned above its market value to the sum it believes to be its market value. Upon complaint of a party aggrieved, the board shall reduce the aggregate valuation of the individual's personal property, or of any class of personal property for which the individual is assessed, which in its opinion has been assessed at too large a sum, to the sum it believes was the market value of the individual's personal property of that class.\n(5) The board must not reduce the aggregate value of all the property of its county, as submitted to the county board of equalization, with the additions made by the auditor under this chapter, by more than one percent of its whole valuation. The board may raise the aggregate valuation of real property, and of each class of personal property, of the county, or of any town or district of the county, when it believes it is below the market value of the property, or class of property, to the aggregate amount it believes to be its market value.\n(6) The board shall change the classification of any property which in its opinion is not properly classified.\n(7) The board does not have the authority to grant an exemption or to order property removed from the tax rolls.\n(8) The board may not make an individual market value adjustment or classification change that would benefit property if the owner or other person having control over the property has refused the assessor access to inspect the property and the interior of any buildings or structures as provided in section 273.20.\nIf a person, other than a public utility, mining company, or the metropolitan airports commission for which the original assessments are determined by the commissioner of revenue, fails to appear in person, by counsel, or by written communication before the county board after being duly notified of the board's intent to raise the assessment of the person's property, or if a person fails to appeal a decision of the board of review as described in section 274.01 after appearing before the local board, the person may not appear before the commissioner of revenue under section 270C.92, subdivisions 1 and 2, to contest the valuation.\nNo changes in valuation or classification that are intended to correct errors in judgment by the county assessor may be made by the county assessor after the county board of equalization has adjourned; however, corrections of errors that are merely clerical in nature or changes that extend homestead treatment to property are permitted after adjournment until the tax extension date for that assessment year. The changes must be fully documented and maintained in the assessor's office and must be available for review by any person.\nThe county shall notify taxpayers whose town or city elected to transfer its powers and duties under section 274.01 to the county. Prior to the time of the county board of equalization, the county shall make available to those taxpayers a procedure for a review of its assessments, including, but not limited to, open book meetings. This alternative review process shall take place in April and May.\nThe board of equalization for any county may appoint a special board of equalization and may delegate to it the powers and duties in subdivision 1. The special board of equalization shall serve at the direction and discretion of the appointing county board, subject to the restrictions imposed by law on the appointing board. The appointing board may determine the number of members to be appointed to the special board, the compensation and expenses to be paid, and the term of office of each member. At least one member of the special board of equalization must be an appraiser, real estate broker, or other person familiar with property valuations in the county. The county auditor is a nonvoting member and serves as the recorder for the special board. The special board is subject to the quorum requirements for county boards and the training requirements for county boards in section 274.135, subdivision 2.",
	"repealed": false
}