{
	"id": "116C.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.99",
	"title": "116C.99 SILICA SAND MINING MODEL STANDARDS AND CRITERIA.",
	"text": "The definitions in this subdivision apply to sections 116C.99 to 116C.992.\n(a) \"Local unit of government\" means a county, statutory or home rule charter city, or town.\n(b) \"Mining\" means excavating silica sand by any process, including digging, excavating, drilling, blasting, tunneling, dredging, stripping, or by shaft.\n(c) \"Processing\" means washing, cleaning, screening, crushing, filtering, sorting, processing, stockpiling, and storing silica sand, either at the mining site or at any other site.\n(d) \"Silica sand\" means well-rounded, sand-sized grains of quartz (silicon dioxide), with very little impurities in terms of other minerals. Specifically, the silica sand for the purposes of this section is commercially valuable for use in the hydraulic fracturing of shale to obtain oil and natural gas. Silica sand does not include common rock, stone, aggregate, gravel, sand with a low quartz level, or silica compounds recovered as a by-product of metallic mining.\n(e) \"Silica sand project\" means the excavation and mining and processing of silica sand; the washing, cleaning, screening, crushing, filtering, drying, sorting, stockpiling, and storing of silica sand, either at the mining site or at any other site; the hauling and transporting of silica sand; or a facility for transporting silica sand to destinations by rail, barge, truck, or other means of transportation.\n(f) \"Temporary storage\" means the storage of stockpiles of silica sand that have been transported and await further transport.\n(g) \"Transporting\" means hauling and transporting silica sand, by any carrier:\n(1) from the mining site to a processing or transfer site; or\n(2) from a processing or storage site to a rail, barge, or transfer site for transporting to destinations.\nBy October 1, 2013, the Environmental Quality Board, in consultation with local units of government, shall develop model standards and criteria for mining, processing, and transporting silica sand. These standards and criteria may be used by local units of government in developing local ordinances. The standards and criteria shall be different for different geographic areas of the state. The unique karst conditions and landforms of southeastern Minnesota shall be considered unique when compared with the flat scoured river terraces and uniform hydrology of the Minnesota Valley. The standards and criteria developed shall reflect those differences in varying regions of the state. The standards and criteria must include:\n(1) recommendations for setbacks or buffers for mining operation and processing, including:\n(i) any residence or residential zoning district boundary;\n(ii) any property line or right-of-way line of any existing or proposed street or highway;\n(iii) ordinary high-water levels of public waters;\n(iv) bluffs;\n(v) designated trout streams, class 2A water as designated in the rules of the Pollution Control Agency, or any perennially flowing tributary of a designated trout stream or class 2A water;\n(vi) calcareous fens;\n(vii) wellhead protection areas as defined in section 103I.005;\n(viii) critical natural habitat acquired by the commissioner of natural resources under section 84.944; and\n(ix) a natural resource easement paid wholly or in part by public funds;\n(2) standards for hours of operation;\n(3) groundwater and surface water quality and quantity monitoring and mitigation plan requirements, including:\n(i) applicable groundwater and surface water appropriation permit requirements;\n(ii) well-sealing requirements;\n(iii) annual submission of monitoring well data; and\n(iv) stormwater runoff rate limits not to exceed two-, ten-, and 100-year storm events;\n(4) air monitoring and data submission requirements;\n(5) dust control requirements;\n(6) noise testing and mitigation plan requirements;\n(7) blast monitoring plan requirements;\n(8) lighting requirements;\n(9) inspection requirements;\n(10) containment requirements for silica sand in temporary storage to protect air and water quality;\n(11) containment requirements for chemicals used in processing;\n(12) financial assurance requirements;\n(13) road and bridge impacts and requirements; and\n(14) reclamation plan requirements as required under the rules adopted by the commissioner of natural resources.\nBy October 1, 2013, the Environmental Quality Board shall assemble a silica sand technical assistance team to provide local units of government, at their request, with assistance with ordinance development, zoning, environmental review and permitting, monitoring, or other issues arising from silica sand mining and processing operations. The technical assistance team may be chosen from representatives of the following entities: the Department of Natural Resources, the Pollution Control Agency, the Board of Water and Soil Resources, the Department of Health, the Department of Transportation, the University of Minnesota, the Minnesota State Colleges and Universities, and federal agencies. A majority of the members must be from a state agency and all members must have expertise in one or more of the following areas: silica sand mining, hydrology, air quality, water quality, land use, or other areas related to silica sand mining.\n(a) When the technical assistance team, at the request of the local unit of government, assembles findings or makes a recommendation related to a proposed silica sand project for the protection of human health and the environment, a local government unit must consider the findings or recommendations of the technical assistance team in its approval or denial of a silica sand project. If the local government unit does not agree with the technical assistance team's findings and recommendations, the detailed reasons for the disagreement must be part of the local government unit's record of decision.\n(b) Silica sand project proposers must cooperate in providing local government unit staff and members of the technical assistance team with information regarding the project.\n(c) When a local unit of government requests assistance from the silica sand technical assistance team for environmental review or permitting of a silica sand project, the local unit of government may assess the project proposer for reasonable costs of the assistance and use the funds received to reimburse the entity providing that assistance.",
	"repealed": false
}