{
	"id": "518A.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.80",
	"title": "518A.80 MOTION TO TRANSFER TO TRIBAL COURT.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Case participant\" means a person who is a party to the case.\n(c) \"District court\" means a district court of the state of Minnesota.\n(d) \"Party\" means a person or entity named or admitted as a party or seeking to be admitted as a party in the district court action, including the county IV-D agency, regardless of whether the person or entity is named in the caption.\n(e) \"Tribal court\" means a tribal court of a federally recognized Indian tribe located in Minnesota that is receiving funding from the federal government to operate a child support program under United States Code, title 42, chapter 7, subchapter IV, part D, sections 654 to 669b.\n(f) \"Tribal IV-D agency\" has the meaning given in Code of Federal Regulations, title 45, part 309.05.\n(g) \"Title IV-D child support case\" has the meaning given in section 518A.26, subdivision 10.\nUnder this section, a postjudgment child support, custody, or parenting time action is eligible for transfer to a Tribal court. This section does not apply to a child protection action or a dissolution action involving a child.\n(a) A party's or Tribal IV-D agency's motion to transfer a child support, custody, or parenting time action to a Tribal court shall include:\n(1) the address of each case participant;\n(2) the Tribal affiliation of each case participant, if applicable;\n(3) the name, Tribal affiliation if applicable, and date of birth of each living minor or dependent child of a case participant who is subject to the action; and\n(4) the legal and factual basis for the court to find that the district court and a Tribal court have concurrent jurisdiction in the case.\n(b) A party or Tribal IV-D agency bringing a motion to transfer a child support, custody, or parenting time action to a Tribal court must file the motion with the district court and serve the required documents on each party and the Tribal IV-D agency, regardless of whether the Tribal IV-D agency is a party to the action.\n(c) A party's or Tribal IV-D agency's motion to transfer a child support, custody, or parenting time action to a Tribal court must be accompanied by an affidavit setting forth facts in support of the motion.\n(d) When a party other than the Tribal IV-D agency has filed a motion to transfer a child support, custody, or parenting time action to a Tribal court, an affidavit of the Tribal IV-D agency stating whether the Tribal IV-D agency provides services to a party must be filed and served on each party within 15 days from the date of service of the motion to transfer the action.\n(a) Unless a district court holds a hearing under subdivision 6, upon motion of a party or a Tribal IV-D agency, a district court must transfer a postjudgment child support, custody, or parenting time action to a Tribal court when the district court finds that:\n(1) the district court and Tribal court have concurrent jurisdiction of the action;\n(2) a case participant in the action is receiving services from the Tribal IV-D agency; and\n(3) no party or Tribal IV-D agency files and serves a timely objection to transferring the action to a Tribal court.\n(b) When the district court finds that each requirement of this subdivision is satisfied, the district court is not required to hold a hearing on the motion to transfer the action to a Tribal court. The district court's order transferring the action to a Tribal court must include written findings that describe how each requirement of this subdivision is met.\n(a) To object to a motion to transfer a child support, custody, or parenting time action to a Tribal court, a party or Tribal IV-D agency must file with the court and serve on each party and the Tribal IV-D agency a responsive motion objecting to the motion to transfer within 30 days of the motion to transfer's date of service.\n(b) If a party or Tribal IV-D agency files with the district court and properly serves a timely objection to the motion to transfer a child support, custody, or parenting time action to a Tribal court, the district court must hold a hearing on the motion.\nIf a district court holds a hearing under this section, the district court must evaluate and make written findings about all relevant factors, including:\n(1) whether an issue requires interpretation of Tribal law, including the Tribal constitution, statutes, bylaws, ordinances, resolutions, treaties, or case law;\n(2) whether the action involves Tribal traditional or cultural matters;\n(3) whether the tribe is a party to the action;\n(4) whether Tribal sovereignty, jurisdiction, or territory is an issue in the action;\n(5) the Tribal membership status of each case participant in the action;\n(6) where the claim arises that forms the basis of the action;\n(7) the location of the residence of each case participant in the action and each child who is a subject of the action;\n(8) whether the parties have by contract chosen a forum or the law to be applied in the event of a dispute;\n(9) the timing of any motion to transfer the action to a Tribal court, each party's expenditure of time and resources, the court's expenditure of time and resources, and the district court's scheduling order;\n(10) which court will hear and decide the action more expeditiously;\n(11) the burden on each party if the court transfers the action to a Tribal court, including costs, access to and admissibility of evidence, and matters of procedure; and\n(12) any other factor that the court determines to be relevant.\nNothing in this section shall be construed to limit the district court's exercise of jurisdiction when the Tribal court waives jurisdiction, transfers the action back to district court, or otherwise declines to exercise jurisdiction over the action.\nWhen a party or Tribal IV-D agency brings a motion to transfer a child support, custody, or parenting time action to the Red Lake Nation Tribal Court, the court must transfer the action to the Red Lake Nation Tribal Court if the case participants and child resided within the boundaries of the Red Lake Reservation for six months preceding the motion to transfer the action to the Red Lake Nation Tribal Court.",
	"repealed": false
}