{
	"id": "179A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.06",
	"title": "179A.06 EMPLOYEE RIGHTS AND OBLIGATIONS.",
	"text": "(a) Sections 179A.01 to 179A.25 do not affect the right of any public employee or the employee's representative to express or communicate a view, grievance, complaint, or opinion on any matter related to the conditions or compensation of public employment or their betterment, so long as this is not designed to and does not interfere with the full faithful and proper performance of the duties of employment or circumvent the rights of the exclusive representative. Sections 179A.01 to 179A.25 do not require any public employee to perform labor or services against the employee's will.\n(b) If no exclusive representative has been certified, any public employee individually, or group of employees through their representative, has the right to express or communicate a view, grievance, complaint, or opinion on any matter related to the conditions or compensation of public employment or their betterment, by meeting with their public employer or the employer's representative, so long as this is not designed to and does not interfere with the full, faithful, and proper performance of the duties of employment.\n(a) Public employees have the right to form and join labor or employee organizations, and have the right not to form and join such organizations. Public employees in an appropriate unit have the right by secret ballot to designate an exclusive representative to negotiate grievance procedures and the terms and conditions of employment with their employer. Confidential employees of the state, confidential court employees, and confidential University of Minnesota employees are excluded from bargaining. Supervisory and managerial court employees are excluded from bargaining. Supervisory, managerial, and confidential employees of Hennepin Healthcare System, Inc., are excluded from bargaining. Other confidential employees, supervisory employees, principals, and assistant principals may form their own organizations. An employer shall extend exclusive recognition to a representative of or an organization of supervisory or confidential employees, or principals and assistant principals, for the purpose of negotiating terms or conditions of employment, in accordance with sections 179A.01 to 179A.25, applicable to essential employees.\n(b) Supervisory or confidential employee organizations shall not participate in any capacity in any negotiations which involve units of employees other than supervisory or confidential employees. Except for organizations which represent supervisors who are: (1) firefighters, emergency medical service employees certified under section 144E.28, 911 system public safety dispatchers, peace officers subject to licensure under sections 626.84 to 626.863, guards at correctional facilities, or employees at hospitals other than state hospitals; and (2) not state or University of Minnesota employees, a supervisory or confidential employee organization which is affiliated with another employee organization which is the exclusive representative of nonsupervisory or nonconfidential employees of the same public employer shall not be certified, or act as, an exclusive representative for the supervisory or confidential employees. For the purpose of this subdivision, affiliation means either direct or indirect and includes affiliation through a federation or joint body of employee organizations.\n(a) An exclusive representative may require employees who are not members of the exclusive representative to contribute a fair share fee for services rendered by the exclusive representative. The fair share fee must be equal to the regular membership dues of the exclusive representative, less the cost of benefits financed through the dues and available only to members of the exclusive representative. In no event may the fair share fee exceed 85 percent of the regular membership dues. The exclusive representative shall provide advance written notice of the amount of the fair share fee to the employer and to unit employees who will be assessed the fee. The employer shall provide the exclusive representative with a list of all unit employees.\n(b) A challenge by an employee or by a person aggrieved by the fee must be filed in writing with the commissioner, the public employer, and the exclusive representative within 30 days after receipt of the written notice. All challenges must specify those portions of the fee challenged and the reasons for the challenge. The burden of proof relating to the amount of the fair share fee is on the exclusive representative. The commissioner shall hear and decide all issues in these challenges.\n(c) The employer shall deduct the fee from the earnings of the employee and transmit the fee to the exclusive representative 30 days after the written notice was provided. If a challenge is filed, the deductions for a fair share fee must be held in escrow by the employer pending a decision by the commissioner.\nProfessional employees have the right to meet and confer under section 179A.08 with public employers regarding policies and matters other than terms and conditions of employment.\nPublic employees, through their certified exclusive representative, have the right and obligation to meet and negotiate in good faith with their employer regarding grievance procedures and the terms and conditions of employment, but this obligation does not compel the exclusive representative to agree to a proposal or require the making of a concession.\n(a) A public employee may request payroll deduction for the exclusive representative that represents the employee's position and its associated political fund under section 10A.12. If no exclusive representative represents an employee's position, the public employee may request payroll deduction for the organization of the employee's choice. A public employer must provide payroll deduction according to any public employee's request under this paragraph.\n(b) A public employer must rely on a certification from an exclusive representative requesting remittance of a deduction that the organization has and will maintain an authorization signed, either by hand or electronically according to section 325L.02, paragraph (h), by the public employee from whose salary or wages the deduction is to be made. An exclusive representative making a certification is not required to provide the public employer a copy of the authorization unless a dispute arises about the authorization's existence or terms.\n(c) A payroll deduction authorization is effective until the exclusive representative notifies the employer that a public employee has changed or canceled the employee's authorization in writing in accordance with the terms of the original authorization. When determining whether deductions have been properly changed or canceled, a public employer must rely on information from the exclusive representative receiving remittance of the deduction.\n(d) Deduction authorization under this section is:\n(1) independent from the public employee's membership status in the organization to which payment is remitted; and\n(2) effective regardless of whether a collective bargaining agreement authorizes the deduction.\n(e) An employer must:\n(1) begin deductions within 30 days after an exclusive representative submits a certification under paragraph (b); and\n(2) remit the deductions to the exclusive representative within 30 days of the deduction.\n(f) An exclusive representative must indemnify a public employer:\n(1) for any successful employee claim for unauthorized employer deductions made by relying on an exclusive representative's certification under paragraph (b); and\n(2) for any successful employee claim for unauthorized employer deductions made by relying on information for changing or canceling deductions under paragraph (c), with indemnification including any reasonable attorney fees and litigation costs.\n(g) Any dispute under this subdivision must be resolved through an unfair labor practice proceeding under section 179A.13. It is an unfair labor practice if an employer fails to comply with paragraph (e), and the employer must reimburse deductions that should have been made or remitted based on a valid authorization given by the employee or employees.\nPublic employees have the right to engage in concerted activities for the purpose of collective bargaining or other mutual aid or protection.",
	"repealed": false
}