{
	"id": "61A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.29",
	"title": "61A.29 FOREIGN INVESTMENTS.",
	"text": "In addition to the Canadian investments permitted by this chapter, a domestic life insurance company may make foreign investments authorized by subdivision 2, subject to the limitations contained in subdivision 3. Investments authorized by this section are restricted to countries where the obligations of the sovereign government are rated in one of the two highest rating categories by at least one nationally recognized statistical rating organization in the United States. All investments must be made as provided under foreign investment guidelines established and maintained by the company under section 60A.112.\nA company may invest in (i) foreign assets denominated in United States dollars; (ii) foreign assets denominated in foreign currency; and (iii) United States assets denominated in foreign currency. The investments may be made in any combination of the following:\n(a) Obligations of sovereign governments and political subdivisions thereof and obligations issued or fully guaranteed by a supranational bank or organization, other than those described in section 61A.28, subdivision 2, paragraph (e), provided that the obligations are rated in one of the two highest rating categories by at least one nationally recognized statistical rating organization in the United States. For purposes of this section, \"supranational bank\" means a bank owned by a number of sovereign nations and engaging in international borrowing and lending.\n(b) Obligations of a foreign business entity, provided that the obligation (i) is rated in one of the four highest rating categories by at least one nationally recognized statistical rating organization in the United States or by a similarly recognized statistical rating organization, as approved by the commissioner, in the country where the investment is made; or (ii) is rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners.\n(c) Stock or stock equivalents issued by a foreign entity if the stock or stock equivalents are regularly traded and subject to oversight by the government of the country in which the regular trading occurs.\n(d) Financial transactions for the sole purpose of managing the foreign currency risk of investments made under this subdivision, provided that the financial transactions are entered into under a detailed plan maintained by the company. For purposes of this paragraph, \"financial transactions\" include, but are not limited to, the purchase or sale of currency swaps, forward agreements, and currency futures.\nInvestments authorized by subdivision 2 are subject to the following limitations:\n(a) A company shall not make an investment under this section if the investment causes the company's aggregate investments authorized under this section to exceed ten percent of its total admitted assets.\n(b) Investments made under subdivision 2 must be aggregated with United States investments in determining compliance with percentage concentration limitations, if any, contained in this chapter.\n(c) A company shall not invest in the obligations of one issuer under subdivision 2 in an amount greater than authorized for investments of the same class under this chapter. A company shall not invest more than two percent of its total admitted assets in the direct or guaranteed obligations of a sovereign government or political subdivision thereof, or of a supranational bank.",
	"repealed": false
}