{
	"id": "524.5-602",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-602",
	"title": "524.5-602 DEFINITIONS.",
	"text": "(a) The definitions in this section apply to sections 524.5-602 to 524.5-903.\n(b) \"Adult\" means an individual who has attained 18 years of age.\n(c) \"Conservator\" means a person appointed by the court to administer the property of an adult, including a person appointed under sections 524.5-101 to 524.5-502.\n(d) \"Guardian\" means a person appointed by the court to make decisions regarding the person of an adult, including a person appointed under sections 524.5-101 to 524.5-502.\n(e) \"Guardianship order\" means an order appointing a guardian.\n(f) \"Guardianship proceeding\" means a judicial proceeding in which an order for the appointment of a guardian is sought or has been issued.\n(g) \"Incapacitated person\" means an adult for whom a guardian has been appointed.\n(h) \"Party\" means the respondent, petitioner, guardian, conservator, or any other person allowed by the court to participate in a guardianship or protective proceeding.\n(i) \"Person,\" except in the term incapacitated person or protected person, means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, public corporation, government or governmental subdivision, agency, or instrumentality, or any other legal or commercial entity.\n(j) \"Protected person\" means an adult for whom a protective order has been issued.\n(k) \"Protective order\" means an order appointing a conservator or any other order related to management of an adult's property.\n(l) \"Protective proceeding\" means a judicial proceeding in which a protective order is sought or has been issued.\n(m) \"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(n) \"Respondent\" means an adult for whom a protective order or the appointment of a guardian is sought.\n(o) \"State\" means a state of the United States, the District of Columbia, the commonwealth of Puerto Rico, the United States Virgin Islands, a federally recognized Indian tribe, or any territory or insular possession subject to the jurisdiction of the United States.",
	"repealed": false
}