{
	"id": "145.4712",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.4712",
	"title": "145.4712 EMERGENCY CARE TO SEXUAL ASSAULT VICTIMS.",
	"text": "(a) It shall be the standard of care for all hospitals and other health care providers that provide emergency care to, at a minimum:\n(1) provide each female sexual assault victim with medically and factually accurate and unbiased written and oral information about emergency contraception from the American College of Obstetricians and Gynecologists and distributed to all hospitals by the Department of Health;\n(2) orally inform each female sexual assault victim of the option of being provided with emergency contraception at the hospital or other health care facility; and\n(3) immediately provide emergency contraception to each sexual assault victim who requests it provided it is not medically contraindicated and is ordered by a legal prescriber. Emergency contraception shall be administered in accordance with current medical protocols regarding timing and dosage necessary to complete the treatment.\n(b) A hospital or health care provider may administer a pregnancy test. If the pregnancy test is positive, the hospital or health care provider does not have to comply with the provisions in paragraph (a).\nIt shall be the standard of care for all hospitals and health care providers that provide emergency care to, at a minimum:\n(1) provide each sexual assault victim with factually accurate and unbiased written and oral medical information about prophylactic antibiotics for treatment of sexually transmitted infections;\n(2) orally inform each sexual assault victim of the option of being provided prophylactic antibiotics for treatment of sexually transmitted infections at the hospital or other health care facility; and\n(3) immediately provide prophylactic antibiotics for treatment of sexually transmitted infections to each sexual assault victim who requests it, provided it is not medically contraindicated and is ordered by a legal prescriber.",
	"repealed": false
}