{
	"id": "325G.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.50",
	"title": "325G.50 MEMBERSHIP TRAVEL CONTRACTS; CANCELLATION.",
	"text": "(a) For purposes of this section and sections 325G.501 and 325G.505, the following terms have the meanings given them:\n(1) \"Membership travel contract\" or \"contract\" means an agreement offered or sold in this state evidencing a buyer's right to make travel arrangements from or through a membership travel operator and includes a membership that provides for this use.\n(2) \"Membership travel operator\" means a person offering or selling membership travel contracts paid for by a fee or periodic payments.\n(3) \"Travel arrangements\" means travel reservations or accommodations, tickets for domestic or foreign travel by air, rail, ship, bus, or other medium of transportation, or hotel or other lodging accommodations for members.\n(4) \"Date of consummation of service\" means the date on which the buyer of the contract is provided with all materials necessary to allow the buyer to make travel arrangements that are the subject of the contract and is provided all materials explaining the buyer's rights, obligations, benefits, and restrictions under the membership travel contract.\n(5) \"Gift\" means a prize, award, rebate, bonus, coupon, credit, voucher, or other item of value offered or provided to a consumer as part of the solicitation to purchase a membership travel contract.\n(b) The definitions in paragraph (a) do not apply to the offer, sale, exchange, or other use of a timeshare interest, as defined in section 83.20, subdivision 13.\nIn addition to other rights the buyer may have, the buyer may cancel a membership travel contract until midnight of the tenth business day after the date of consummation of service for the contract.\nTo be effective, a notice of cancellation must be given by the buyer in writing to the membership travel operator at the operator's address. This address must be included in the membership travel contract. The notice, if given by mail, is effective upon deposit in a mailbox, properly addressed to the operator and postage prepaid. The notice is sufficient if it shows, by any form of written expression, the buyer's intention not to be bound by the membership travel contract.\nCancellation is without liability on the part of the buyer and the buyer is entitled to a refund, within ten days after notice of cancellation is given, of the entire consideration paid for the contract. Rights of cancellation may not be waived or otherwise surrendered.\nA copy of the contract must be delivered to the buyer at the time the contract is signed. The contract must be in writing, must be signed by the buyer, must designate the date on which the buyer signed the contract, and must state, clearly and conspicuously, in boldface type of a minimum size of 14 points immediately adjacent to the buyer's signature, the following:\n\"MEMBERS' RIGHT TO CANCEL\nIf you wish to cancel this contract, you may cancel by delivering or mailing a written notice to the membership travel operator. The notice must say that you do not wish to be bound by the contract and must be delivered or mailed before midnight of the tenth business day after you sign this contract. The notice must be delivered or mailed to: (Insert name and mailing address of membership travel operator). If you cancel, the membership travel operator will return, within ten days of the date on which you give notice of cancellation, any payments you have made. Your right to cancel continues until midnight of the tenth business day after the day on which you are provided with all materials necessary to allow you to make travel arrangements and all materials that explain your rights, obligations, benefits, and restrictions under the contract.\"\nAt the time the contract is signed by the buyer, the membership travel operator shall orally inform the buyer of the buyer's right to cancel the contract described in subdivision 2.\n(a) A contract which does not contain the notice specified in subdivision 3 may be canceled by the buyer at any time by giving notice of cancellation by any means.\n(b) If the oral notice required by subdivision 3a has not been given to the buyer at the time the contract was signed, the buyer may cancel the contract at any time by giving notice of cancellation by any means.\n(c) If the buyer has a continuing right to cancel under this subdivision, the membership travel operator, or any affiliate or successor to the membership travel operator, shall not solicit the buyer to enter into a new contract, unless before the solicitation, the membership travel operator provides the following:\n(1) at the same time as the initial written solicitation to enter a new contract, a written notice on a separate sheet of paper that in boldface type of a minimum size of 14 points states the following:\n\"RIGHT TO CANCEL\nYou have the right to cancel the contract that you previously entered with (name of membership travel operator). If you cancel the contract with (name of membership travel operator), you have the right to receive a refund of all money paid for the contract. You also will not be required to make any further payments under that contract.\nThis is an attempt to solicit you to enter a new contract.\nIf you would like more information concerning Minnesota laws governing membership travel contracts, please contact the Minnesota Attorney General's Office at (the Minnesota Attorney General's Office address and telephone number).\"; and\n(2) at the same time as the initial oral solicitation to enter a new contract, an oral notice that clearly reiterates the statement contained in clause (1).\nThe attorney general shall provide a number for insertion into this notice on request of the membership travel operator.",
	"repealed": false
}