{
	"id": "17.498",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.498",
	"title": "17.498 RULES; FINANCIAL ASSURANCE.",
	"text": "(a) The commissioner of the Pollution Control Agency, after consultation and cooperation with the commissioners of agriculture and natural resources, shall present proposed rules to the Pollution Control Agency board prescribing water quality permit requirements for aquaculture facilities by May 1, 1992. The rules must consider:\n(1) best available proven technology, best management practices, and water treatment practices that prevent and minimize degradation of waters of the state considering economic factors, availability, technical feasibility, effectiveness, and environmental impacts;\n(2) classes, types, sizes, and categories of aquaculture facilities;\n(3) temporary reversible impacts versus long-term impacts on water quality;\n(4) effects on drinking water supplies that cause adverse human health concerns; and\n(5) aquaculture therapeutics, which shall be regulated by the Pollution Control Agency.\n(b) Net pen aquaculture and other aquaculture facilities with similar effects must submit an annual report to the commissioner of the Pollution Control Agency analyzing changes in water quality trends from previous years, documentation of best management practices, documentation of costs to restore the waters used for aquaculture to the trophic state existing before aquatic farming was initiated, and documentation of financial assurance in an amount adequate to pay for restoration costs. The trophic state, which is the productivity of the waters measured by total phosphorus, dissolved oxygen, algae abundance as chlorophyll-a, and secchi disk depth of light penetration, and the condition of the waters measured by raw drinking water parameters, shall be determined to the extent possible before aquatic farming is initiated. The financial assurance may be a trust fund, letter of credit, escrow account, surety bond, or other financial assurance payable to the commissioner for restoration of the waters if the permittee cannot or will not restore the waters after termination of aquatic farming operations or revocation of the permit.\n(c) Information received as part of a permit application or as otherwise requested must be classified according to chapter 13. Information about processes, aquatic farming procedures, feed and therapeutic formulas and rates, and tests on aquatic farming products that have economic value is nonpublic data under chapter 13, if requested by the applicant or permittee.",
	"repealed": false
}