{
	"id": "3A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/3A.01",
	"title": "3A.01 DEFINITIONS.",
	"text": "Each of the terms defined in this section, for the purposes of this chapter has the meaning ascribed.\n(a) \"Actuarial equivalent\" means the condition of one allowance or benefit having an equal actuarial present value to another allowance or benefit, determined by the actuary retained under section 356.214 as of a given date at a specified age with each actuarial present value based on the mortality table applicable for the plan and approved under section 356.215, subdivision 18, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used, rather than the investment return specified in section 356.215, subdivision 8.\n\"Average monthly salary\" means the average of the member's highest five successive years of salary that was received as a member of the legislature and upon which the member has made contributions under section 3A.03, subdivision 1, or for which the member of the legislature has made payments for past service under Minnesota Statutes 2004, section 3A.02, subdivision 2, or has made, before July 1, 1994, payments in lieu of contributions under Minnesota Statutes 1992, section 3A.031.\n\"Constitutional officer\" means a person who was duly elected, qualifies for, and serves as the governor, the lieutenant governor, the attorney general, the secretary of state, or the state auditor of the state of Minnesota.\n(a) \"Dependent child\" means any natural or adopted child of a deceased member of the legislature or a former legislator who is under the age of 18, or who is under the age of 22 and is a full-time student, and who, in either case, is unmarried and was actually dependent for more than one-half of support upon the legislator for a period of at least 90 days immediately before the legislator's death.\n(b) The term also includes any child of the member of the legislature or former legislator who was conceived during the lifetime of, and who was born after the death of, the member or former legislator.\n[Repealed, 2006 c 271 art 10 s 33]\n[Repealed, 2006 c 271 art 10 s 33]\n[Repealed, 1971 c 928 s 11]\n\"Director\" means the executive director of the Minnesota State Retirement System who was appointed under section 352.03, subdivision 5.\n[Repealed, 2006 c 271 art 10 s 33]\n\"Former legislator\" means a legislator who has ceased to be a member of the legislature for any reason, including, but not limited to, the expiration of the term for which a member of the legislature was elected or the death of the member.\n\"Member of the legislature\" means a person who was a member of the house of representatives or of the senate of the state of Minnesota who has subscribed to the oath of office after July 1, 1965, and who was first elected to a legislative office before July 1, 1997, and retained coverage by the plan under Laws 1997, chapter 233, article 2, section 15.\n[Repealed, 2006 c 271 art 10 s 33]\n\"Normal retirement age\" means the age of 62 years.\n\"Retirement\" means the period of time after which a former legislator is entitled to a retirement allowance.\n(a) \"Salary\" means the regular compensation payable under law to a member of the legislature and paid to the person for service as a legislator.\n(b) The term includes the monthly compensation paid to the member of the legislature and the per diem payments paid during a regular or special session to the member of the legislature.\n(c) The term does not include per diem payments paid to a member of the legislature other than during the regular or special session; additional compensation attributable to a leadership position under section 3.099, subdivision 3; living expense payments under section 3.101; and special session living expense payments under section 3.103.",
	"repealed": false
}