{
	"id": "317A.821",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.821",
	"title": "317A.821 INITIAL CORPORATE REGISTRATION WITH SECRETARY OF STATE.",
	"text": "(a) Before February 1, 1990, the secretary of state shall mail a corporate registration form by first-class mail to each corporation at its last registered office address listed in the records of the secretary of state. The form must include the exact legal corporate name and registered office address currently on file with the secretary of state.\n(b) A corporation that is subject to chapter 317 shall file an initial corporate registration with the secretary of state between January 1, 1990, and December 31, 1990. The registration must include the exact legal corporate name and registered office address of the corporation and must be signed by an authorized person. If the current registered office address listed in the records of the secretary of state is not in compliance with section 317A.011, subdivision 2, or if the corporation has changed its registered office address to an address other than that listed with the secretary of state, the corporation shall list a new registered office address that complies with section 317A.011, subdivision 2, on the registration form. A fee of $35 must be paid for filing the registered office address change, provided that a fee may not be charged if the registered office address is being changed only because of failure to comply with section 317A.011, subdivision 2. The new registered office address must have been approved by the board.\nA corporation that does not file the initial corporate registration required under subdivision 1 with the secretary of state on or before December 31, 1990, loses its good standing. To regain its good standing, the corporation must file the initial corporate registration. If, as a part of the initial corporate registration process the corporation needs to bring its registered office address into compliance with section 317A.011, subdivision 2, the fees stated in subdivision 1, paragraph (b), apply.\nIf a corporation fails to regain its good standing under subdivision 2 on or before December 31, 1997, the corporation is dissolved under section 317A.827. After December 31, 1997, the corporate existence of a corporation dissolved under this subdivision may be extended by filing the initial corporate registration with the secretary of state and payment of a $25 fee. The extension relates back to December 31, 1997.\n[Repealed, 1989 c 304 s 139]",
	"repealed": false
}