{
	"id": "246.595",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.595",
	"title": "246.595 SOUTHERN CITIES COMMUNITY HEALTH CLINIC.",
	"text": "The Direct Care and Treatment executive board shall offer medically necessary psychiatric and dental services to developmentally disabled clients in the Faribault service area through the Southern Cities Community Health Clinic. For purposes of this requirement, the Faribault service area is expanded to also include geographic areas of the state within 100 miles of Faribault.\nThe Direct Care and Treatment executive board shall consult with providers of psychiatric and dental services to developmentally disabled clients, family members of developmentally disabled clients, the chairs of the house of representatives and senate committees with jurisdiction over health and human services fiscal issues, and the exclusive representatives when considering policy changes related to:\n(1) the future of the Southern Cities Community Health Clinic;\n(2) the services currently provided by that clinic to developmentally disabled clients in the Faribault regional center catchment area; and\n(3) changes in the model for providing those services.\n(a) Direct Care and Treatment shall guarantee the provision of medically necessary psychiatric and dental services to developmentally disabled clients in the Faribault service area through the Southern Cities Community Health Clinic until or unless other appropriate arrangements have been made to provide those clients with those services and the requirements of paragraph (b) are met.\n(b) The executive board shall notify the chairs of the house of representatives and senate committees with jurisdiction over health and human services fiscal issues of plans to use other arrangements to provide medically necessary psychiatric and dental services to developmentally disabled clients in the Faribault service area. The executive board must not implement these arrangements unless a regular legislative session has convened and adjourned since the date notice was given under this paragraph.",
	"repealed": false
}