{
	"id": "97C.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.001",
	"title": "97C.001 EXPERIMENTAL WATERS.",
	"text": "(a) Experimental waters are lakes and streams where special regulations are used and evaluated to meet a specific fisheries objective.\n(b) The commissioner may designate any waters of the state having free access to the public as experimental waters. The designated experimental waters may not exceed 200 lakes and 50 streams at one time. For all experimental waters, the commissioner shall develop an evaluation plan and specify a termination date. On the termination date, the commissioner shall vacate or extend the experimental waters designation, or designate the experimental waters as special management waters under section 97C.005. The commissioner shall by rule establish methods and criteria for public initiation of experimental waters designation and for public participation in the evaluation of the waters designated.\n(c) Designation of experimental waters under this section is not subject to chapter 14.\n(a) Before the commissioner designates, or vacates or extends the designation of, experimental waters, notice of the proposed change must be provided in the county where the largest portion of the waters is located, a virtual or in-person meeting must be held, and opportunity to submit public comment must be offered.\n(b) Before the year that the designation is to become effective, the commissioner must give notice of the proposed designation, vacation, or extension. The notice must summarize the proposed action and invite public comment. Public comments must be accepted at least through September 30, and the commissioner must consider any public comments received in making a final decision. Notice must include:\n(1) signs of the proposed changes and instructions for submitting comments posted at publicly maintained access points on the water by June 1;\n(2) a list of proposed changes posted on the department's website by June 1, summarizing the proposed actions and inviting public comment; and\n(3) a news release issued by the commissioner by July 1, a notice published in a newspaper of general circulation in the area where the waters are located by August 20, and at least one more digital media communication published by August 31.\n(c) A virtual or in-person meeting must be held before September 20 where public comment must be accepted. An in-person meeting, where public comment must be accepted, must be held in the county where the largest portion of the waters is located if:\n(1) a water or connected waters to be designated is over 5,000 acres or a stream or river reach is over ten miles; or\n(2) a request for an in-person meeting is submitted to the commissioner by August 20 before the year that the designation is to become effective.\n(d) The notices required in this subdivision must summarize the proposed action, invite public comment, and specify a deadline for the receipt of public comments. The commissioner shall mail a copy of each required notice to persons who have registered their names with the commissioner for this purpose. The commissioner shall consider any public comments received in making a final decision.\n(e) If a water to be designated is a lake with a water area of more than 1,500 acres, or is a stream or river with a reach of more than six miles, a public meeting must also be held in the seven-county metropolitan area unless a virtual meeting is held and notice of the meeting is published in a newspaper of general circulation in the seven-county metropolitan area.\nThe commissioner may, in accordance with the procedures in subdivision 2 or by rule under chapter 14, establish open seasons, limits, methods, and other requirements for taking fish on experimental waters.",
	"repealed": false
}