{
	"id": "299F.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.19",
	"title": "299F.19 FLAMMABLE LIQUIDS AND EXPLOSIVES.",
	"text": "The commissioner of public safety shall adopt rules for the safekeeping, storage, handling, use, or other disposition of blasting agents and explosives. Loads carried in or on vehicles transporting these products upon public highways within this state are governed by the uniform vehicle size and weights provisions in sections 169.80 to 169.88 and the transportation of hazardous materials provisions of section 221.033.\nFor the purposes of this section and the rules adopted pursuant to this section:\n(a) \"Blasting agent\" means any material or mixture, consisting of a fuel and oxidizer, intended for blasting, not otherwise classified as an explosive and in which none of the ingredients is classified as an explosive; providing that, the finished product, as mixed and packaged for use or shipment, cannot be detonated by means of a number 8 test blasting cap when unconfined. \"Blasting agent\" does not include flammable liquids or flammable gases.\n(b) \"Explosive\" means any chemical compound, mixture, or device, the primary or common purpose of which is to function by explosion. The term includes, but is not limited to, dynamite, black powder, pellet powder, initiating explosives, detonators, safety fuses, squibs, detonating cord, igniter cord, igniters, display fireworks, and class 1.3G fireworks (formerly classified as Class B special fireworks). \"Explosive\" includes any material determined to be within the scope of United States Code, title 18, chapter 40, and also includes any material classified as an explosive other than consumer fireworks, 1.4G (Class C, Common), by the hazardous materials regulations of the United States Department of Transportation (DOTn) in Code of Federal Regulations, title 49.\n(c) Explosives are divided into four categories and are defined as follows:\n(1) High explosive: explosive material, such as dynamite, that can be caused to detonate by means of a number 8 test blasting cap when unconfined.\n(2) Low explosive: explosive material that will burn or deflagrate when ignited, characterized by a rate of reaction that is less than the speed of sound, including, but not limited to, black powder, safety fuse, igniters, igniter cord, fuse lighters, class 1.3G fireworks (formerly classified as Class B special fireworks), and class 1.3C propellants.\n(3) Mass-detonating explosives: division 1.1, 1.2, and 1.5 explosives alone or in combination, or loaded into various types of ammunition or containers, most of which can be expected to explode virtually instantaneously when a small portion is subjected to fire, severe concussion, impact, the impulse of an initiating agent, or the effect of a considerable discharge of energy from without. Materials that react in this manner represent a mass explosion hazard. Such an explosive will normally cause severe structural damage to adjacent objects. Explosive propagation could occur immediately to other items of ammunition and explosives stored sufficiently close to and not adequately protected from the initially exploding pile with a time interval short enough so that two or more quantities must be considered as one for quantity-distance purposes.\n(4) United Nations/United States Department of Transportation (UN/DOTn) Class 1 explosives: the hazard class of explosives that further defines and categorizes explosives under the current system applied by DOTn for all explosive materials into further divisions as follows, with the letter G identifying the material as a pyrotechnic substance or article containing a pyrotechnic substance and similar materials:\n(i) Division 1.1 explosives have a mass explosion hazard. A mass explosion is one that affects almost the entire load instantaneously.\n(ii) Division 1.2 explosives have a projection hazard but not a mass explosion hazard.\n(iii) Division 1.3 explosives have a fire hazard and either a minor blast hazard or a minor projection hazard or both, but not a mass explosion hazard.\n(iv) Division 1.4 explosives pose a minor explosion hazard. The explosive effects are largely confined to the package and no projection of fragments of appreciable size or range is to be expected. An external fire must not cause virtually instantaneous explosion of almost the entire contents of the package.\n(v) Division 1.5 explosives are very insensitive and are comprised of substances that have a mass explosion hazard, but are so insensitive that there is very little probability of initiation or of transition from burning to detonation under normal conditions of transport.\n(vi) Division 1.6 explosives are extremely insensitive and do not have a mass explosion hazard, comprised of articles that contain only extremely insensitive detonating substances and that demonstrate a negligible probability of accidental initiation or propagation.\nNo local government shall enact any regulation or ordinance which is inconsistent with the rules adopted by the commissioner of public safety pursuant to this section. Nothing in this section shall be construed to affect the power of any local government, when so authorized by law, to regulate the use of land by zoning. Any city in which there is no comprehensive zoning ordinance in effect may prohibit the installation or erection of flammable liquid bulk plants within areas which are predominantly residential or in areas used predominantly for retail mercantile purposes. Any city may prescribe routes for the transportation of flammable liquids through such city by motor vehicle transport.\nThe fire marshal of each city of the first class, the chief of the fire department of each other city in which a fire department is established, the mayor of each city in which no fire department exists, the president of the statutory city board of each statutory city in which no fire department exists, and the town clerk of each town without the limits of any city shall enforce within their respective jurisdictions all rules adopted pursuant to this section and shall render such other assistance as may be requested.\nAny violation of a rule shall constitute a misdemeanor.\nThe code and all amendments thereto shall be adopted in accordance with the procedures of the Administrative Procedure Act.",
	"repealed": false
}