{
	"id": "122A.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.72",
	"title": "122A.72 TEACHER CENTERS.",
	"text": "For the purposes of this section, \"teacher\" has the meaning given it in section 179A.03, subdivision 18.\nA teacher center may be established by one or more school boards and the exclusive representatives of the teachers. The teacher center shall serve at least ten districts or 3,000 teachers.\nRepresentatives of exclusive representatives and representatives of the school boards shall mutually determine the composition of the policy board according to the guidelines in this subdivision. A majority of the policy board must be teachers. The number of policy board members from each participating district must be in proportion to the number of teachers in each district. The board shall be composed of elementary teachers, secondary teachers, and other teachers, parents, and representatives of school boards, postsecondary education, business, and labor. At least one teacher from each participating district shall be a member of the board.\nThe policy board shall develop policy, designate a fiscal agent, adopt a budget, expend funds to accomplish the purposes of the center, contract for technical and other assistance, and perform other managerial or supervisory activities consistent with the rules of the commissioner of education. The policy board may employ staff or contract with consultants for services.\n(a) A teacher center shall perform functions according to this subdivision. The center shall assist teachers, diagnose learning needs, experiment with the use of multiple instructional approaches, assess pupil outcomes, assess staff development needs and plans, and teach school personnel about effective pedagogical approaches. The center shall develop and produce curricula and curricular materials designed to meet the educational needs of pupils being served, by applying educational research and new and improved methods, practices, and techniques. The center shall provide programs to improve the skills of teachers to meet the special educational needs of pupils. The center shall provide programs to familiarize teachers with developments in curriculum formulation and educational research, including how research can be used to improve teaching skills. The center shall facilitate sharing of resources, ideas, methods, and approaches directly related to classroom instruction and improve teachers' familiarity with current teaching materials and products for use in their classrooms. The center shall provide in-service programs.\n(b) Each teacher center must provide a professional development program to train interested and qualified elementary, middle, and secondary teachers, selected by the employing school district, to assist other teachers in that district with mathematics and science curriculum, standards, and instruction so that all teachers have access to:\n(1) high quality professional development programs in mathematics and science that address curriculum, instructional methods, alignment of standards, and performance measurements, enhance teacher and student learning, and support state mathematics and science standards; and\n(2) research-based mathematics and science programs and instructional models premised on best practices that inspire teachers and students and have practical classroom application.",
	"repealed": false
}