{
	"id": "256B.064",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.064",
	"title": "256B.064 SANCTIONS; MONETARY RECOVERY.",
	"text": "The commissioner may terminate payments under this chapter to any person or facility that, under applicable federal law or regulation, has been determined to be ineligible for payments under title XIX of the Social Security Act.\n(a) The commissioner may impose sanctions against any individual or entity that receives payments from medical assistance or provides goods or services for which payment is made from medical assistance for any of the following: (1) fraud, theft, or abuse in connection with the provision of goods and services to recipients of public assistance for which payment is made from medical assistance; (2) a pattern of presentment of false or duplicate claims or claims for services not medically necessary; (3) a pattern of making false statements of material facts for the purpose of obtaining greater compensation than that to which the individual or entity is legally entitled; (4) suspension or termination as a Medicare vendor; (5) refusal to grant the state agency access during regular business hours to examine all records necessary to disclose the extent of services provided to program recipients and appropriateness of claims for payment; (6) failure to repay an overpayment or a fine finally established under this section; (7) failure to correct errors in the maintenance of health service or financial records for which a fine was imposed or after issuance of a warning by the commissioner; and (8) any reason for which an individual or entity could be excluded from participation in the Medicare program under section 1128, 1128A, or 1866(b)(2) of the Social Security Act. For the purposes of this section, goods or services for which payment is made from medical assistance includes but is not limited to care and services identified in section 256B.0625 or provided pursuant to any federally approved waiver.\n(b) The commissioner may impose sanctions against a pharmacy provider for failure to respond to a cost of dispensing survey under section 256B.0625, subdivision 13e, paragraph (h).\nThe commissioner may impose the following sanctions for the conduct described in subdivision 1a: suspension or withholding of payments to an individual or entity and suspending or terminating participation in the program, or imposition of a fine under subdivision 2, paragraph (g). When imposing sanctions under this section, the commissioner shall consider the nature, chronicity, or severity of the conduct and the effect of the conduct on the health and safety of persons served by the individual or entity. The commissioner shall suspend an individual's or entity's participation in the program for a minimum of five years if the individual or entity is convicted of a crime, received a stay of adjudication, or entered a court-ordered diversion program for an offense related to a provision of a health service under medical assistance, including a federally approved waiver, or health care fraud. Regardless of imposition of sanctions, the commissioner may make a referral to the appropriate state licensing board.\n(a) The commissioner may obtain monetary recovery from an individual or entity that has been improperly paid by the department either as a result of conduct described in subdivision 1a or as a result of an error by the individual or entity submitting the claim or by the department, regardless of whether the error was intentional. Patterns need not be proven as a precondition to monetary recovery of erroneous or false claims, duplicate claims, claims for services not medically necessary, or claims based on false statements.\n(b) The commissioner may obtain monetary recovery using methods including but not limited to the following: assessing and recovering money improperly paid and debiting from future payments any money improperly paid. The commissioner shall charge interest on money to be recovered if the recovery is to be made by installment payments or debits, except when the monetary recovery is of an overpayment that resulted from a department error. The interest charged shall be the rate established by the commissioner of revenue under section 270C.40.\nThe commissioner may seek recovery of investigative costs from any individual or entity that willfully submits a claim for reimbursement for services that the individual or entity knows, or reasonably should have known, is a false representation and that results in the payment of public funds for which the individual or entity is ineligible. Billing errors that result in unintentional overcharges shall not be grounds for investigative cost recoupment.\n(a) The commissioner shall determine any monetary amounts to be recovered and sanctions to be imposed upon an individual or entity under this section. Except as provided in paragraphs (b) and (d), neither a monetary recovery nor a sanction will be imposed by the commissioner without prior notice and an opportunity for a hearing, according to chapter 14, on the commissioner's proposed action, provided that the commissioner may suspend or reduce payment to an individual or entity, except a nursing home or convalescent care facility, after notice and prior to the hearing if in the commissioner's opinion that action is necessary to protect the public welfare and the interests of the program.\n(b) Except when the commissioner finds good cause not to suspend payments under Code of Federal Regulations, title 42, section 455.23(e) or (f), the commissioner shall withhold or reduce payments to an individual or entity without providing advance notice of such withholding or reduction if either of the following occurs:\n(1) the individual or entity is convicted of a crime involving the conduct described in subdivision 1a; or\n(2) the commissioner determines there is a credible allegation of fraud for which an investigation is pending under the program. Allegations are considered credible when they have an indicium of reliability and the state agency has reviewed all allegations, facts, and evidence carefully and acts judiciously on a case-by-case basis. A credible allegation of fraud is an allegation which has been verified by the state, from any source, including but not limited to:\n(i) fraud hotline complaints;\n(ii) claims data mining; and\n(iii) patterns identified through provider audits, civil false claims cases, and law enforcement investigations.\n(c) The commissioner must send notice of the withholding or reduction of payments under paragraph (b) within five days of taking such action unless requested in writing by a law enforcement agency to temporarily withhold the notice. The notice must:\n(1) state that payments are being withheld according to paragraph (b);\n(2) set forth the general allegations as to the nature of the withholding action, but need not disclose any specific information concerning an ongoing investigation;\n(3) except in the case of a conviction for conduct described in subdivision 1a, state that the withholding is for a temporary period and cite the circumstances under which withholding will be terminated;\n(4) identify the types of claims to which the withholding applies; and\n(5) inform the individual or entity of the right to submit written evidence for consideration by the commissioner.\n(d) The withholding or reduction of payments will not continue after the commissioner determines there is insufficient evidence of fraud by the individual or entity, or after legal proceedings relating to the alleged fraud are completed, unless the commissioner has sent notice of intention to impose monetary recovery or sanctions under paragraph (a). Upon conviction for a crime related to the provision, management, or administration of a health service under medical assistance, a payment held pursuant to this section by the commissioner or a managed care organization that contracts with the commissioner under section 256B.035 is forfeited to the commissioner or managed care organization, regardless of the amount charged in the criminal complaint or the amount of criminal restitution ordered.\n(e) The commissioner shall suspend or terminate an individual's or entity's participation in the program without providing advance notice and an opportunity for a hearing when the suspension or termination is required because of the individual's or entity's exclusion from participation in Medicare. Within five days of taking such action, the commissioner must send notice of the suspension or termination. The notice must:\n(1) state that suspension or termination is the result of the individual's or entity's exclusion from Medicare;\n(2) identify the effective date of the suspension or termination; and\n(3) inform the individual or entity of the need to be reinstated to Medicare before reapplying for participation in the program.\n(f) Upon receipt of a notice under paragraph (a) that a monetary recovery or sanction is to be imposed, an individual or entity may request a contested case, as defined in section 14.02, subdivision 3, by filing with the commissioner a written request of appeal. The appeal request must be received by the commissioner no later than 30 days after the date the notification of monetary recovery or sanction was mailed to the individual or entity. The appeal request must specify:\n(1) each disputed item, the reason for the dispute, and an estimate of the dollar amount involved for each disputed item;\n(2) the computation that the individual or entity believes is correct;\n(3) the authority in statute or rule upon which the individual or entity relies for each disputed item;\n(4) the name and address of the person or entity with whom contacts may be made regarding the appeal; and\n(5) other information required by the commissioner.\n(g) The commissioner may order an individual or entity to forfeit a fine for failure to fully document services according to standards in this chapter and Minnesota Rules, chapter 9505. The commissioner may assess fines if specific required components of documentation are missing. The fine for incomplete documentation shall equal 20 percent of the amount paid on the claims for reimbursement submitted by the individual or entity, or up to $5,000, whichever is less. If the commissioner determines that an individual or entity repeatedly violated this chapter, chapter 254B or 245G, or Minnesota Rules, chapter 9505, related to the provision of services to program recipients and the submission of claims for payment, the commissioner may order an individual or entity to forfeit a fine based on the nature, severity, and chronicity of the violations, in an amount of up to $5,000 or 20 percent of the value of the claims, whichever is greater.\n(h) The individual or entity shall pay the fine assessed on or before the payment date specified. If the individual or entity fails to pay the fine, the commissioner may withhold or reduce payments and recover the amount of the fine. A timely appeal shall stay payment of the fine until the commissioner issues a final order.\n(a) The commissioner shall maintain and publish a list of each excluded individual and entity that was convicted of a crime related to the provision, management, or administration of a medical assistance health service, or suspended or terminated under subdivision 2. Medical assistance payments cannot be made by an individual or entity for items or services furnished either directly or indirectly by an excluded individual or entity, or at the direction of excluded individuals or entities.\n(b) The entity must check the exclusion list on a monthly basis and document the date and time the exclusion list was checked and the name and title of the person who checked the exclusion list. The entity must immediately terminate payments to an individual or entity on the exclusion list.\n(c) An entity's requirement to check the exclusion list and to terminate payments to individuals or entities on the exclusion list applies to each individual or entity on the exclusion list, even if the named individual or entity is not responsible for direct patient care or direct submission of a claim to medical assistance.\n(d) An entity that pays medical assistance program funds to an individual or entity on the exclusion list must refund any payment related to either items or services rendered by an individual or entity on the exclusion list from the date the individual or entity is first paid or the date the individual or entity is placed on the exclusion list, whichever is later, and an entity may be subject to:\n(1) sanctions under subdivision 2;\n(2) a civil monetary penalty of up to $25,000 for each determination by the department that the vendor employed or contracted with an individual or entity on the exclusion list; and\n(3) other fines or penalties allowed by law.\n(a) The department shall serve the notice required under subdivision 2 using a signature-verified confirmed delivery method to the address submitted to the department by the individual or entity. Service is complete upon mailing.\n(b) The department shall give notice in writing to a recipient placed in the Minnesota restricted recipient program under section 256B.0646 and Minnesota Rules, part 9505.2200. The department shall send the notice by first class mail to the recipient's current address on file with the department. A recipient placed in the Minnesota restricted recipient program may contest the placement by submitting a written request for a hearing to the department within 90 days of the notice being mailed.\n(a) A person who makes a good faith report is immune from any civil or criminal liability that might otherwise arise from reporting or participating in the investigation. Nothing in this subdivision affects an individual's or entity's responsibility for an overpayment established under this subdivision.\n(b) A person employed by a lead investigative agency who is conducting or supervising an investigation or enforcing the law according to the applicable law or rule is immune from any civil or criminal liability that might otherwise arise from the person's actions, if the person is acting in good faith and exercising due care.\n(c) For purposes of this subdivision, \"person\" includes a natural person or any form of a business or legal entity.\n(d) After an investigation is complete, the reporter's name must be kept confidential. The subject of the report may compel disclosure of the reporter's name only with the consent of the reporter or upon a written finding by a district court that the report was false and there is evidence that the report was made in bad faith. This subdivision does not alter disclosure responsibilities or obligations under the Rules of Criminal Procedure, except that when the identity of the reporter is relevant to a criminal prosecution the district court shall conduct an in-camera review before determining whether to order disclosure of the reporter's identity.",
	"repealed": false
}