{
	"id": "204B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.11",
	"title": "204B.11 CANDIDATES; FILING FEES; PETITION IN PLACE OF FILING FEE.",
	"text": "(a) Except as provided by subdivision 2, a filing fee shall be paid by each candidate who files an affidavit of candidacy. The fee shall be paid at the time the affidavit is filed. The amount of the filing fee shall vary with the office sought as follows:\n(1) for the office of governor, lieutenant governor, attorney general, state auditor, secretary of state, representative in Congress, judge of the supreme court, judge of the court of appeals, or judge of the district court, $300;\n(2) for the office of senator in Congress, $400;\n(3) for office of senator or representative in the legislature, $100;\n(4) for a county office, $50; and\n(5) for the office of soil and water conservation district supervisor, $20.\n(b) For the office of presidential elector, and for those offices for which no compensation is provided, no filing fee is required.\n(c) The filing fees received by the county auditor shall immediately be paid to the county treasurer. The filing fees received by the secretary of state shall immediately be paid to the commissioner of management and budget.\n(d) When an affidavit of candidacy has been filed with the appropriate filing officer and the requisite filing fee has been paid, the filing fee shall not be refunded. If a candidate's filing fee is paid with a check, draft, or similar negotiable instrument for which sufficient funds are not available or that is dishonored, notice to the candidate of the worthless instrument must be sent by the filing officer via registered mail no later than immediately upon the closing of the filing deadline with return receipt requested. The candidate will have five days from the time the filing officer receives proof of receipt to issue a check or other instrument for which sufficient funds are available. The candidate issuing the worthless instrument is liable for a service charge pursuant to section 604.113. If adequate payment is not made, the name of the candidate must not appear on any official ballot and the candidate is liable for all costs incurred by election officials in removing the name from the ballot.\nAt the time of filing an affidavit of candidacy, a candidate may present a petition in place of the filing fee. The petition may be signed by any individual eligible to vote for the candidate. A nominating petition filed pursuant to section 204B.07 is effective as a petition in place of a filing fee if the nominating petition includes a prominent statement informing the signers of the petition that it will be used for that purpose.\nThe number of signatures on a petition in place of a filing fee shall be as follows:\n(a) for a state office voted on statewide, or for president of the United States, or United States senator, 2,000;\n(b) for a congressional office, 1,000;\n(c) for a county or legislative office, or for the office of district judge, 500; and\n(d) for any other office which requires a filing fee as prescribed by law, municipal charter, or ordinance, the lesser of 500 signatures or five percent of the total number of votes cast in the municipality, ward, or other election district at the preceding general election at which that office was on the ballot.\nAn official with whom petitions are filed shall make sample forms for petitions in place of filing fees available upon request.",
	"repealed": false
}