{
	"id": "103F.614",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.614",
	"title": "103F.614 EMINENT DOMAIN ACTIONS.",
	"text": "An agency of the state, a public benefit corporation, a local government, or any other entity with the power of eminent domain under chapter 117, except a public utility as defined in section 216B.02, a municipal electric or gas utility, a municipal power agency, a cooperative electric association organized under chapter 308A, or a pipeline operating under the authority of the Natural Gas Act, United States Code, title 15, sections 717 to 717z, shall follow the procedures in this section before:\n(1) acquiring land or an easement in land with a total area over ten acres within a wetland preservation area; or\n(2) advancing a grant, loan, interest subsidy, or other funds for the construction of dwellings, commercial or industrial facilities, or water or sewer facilities that could be used to serve structures in areas that are not for agricultural use, that require an acquisition of land or an easement in a wetland preservation area.\nAt least 60 days before an action described in subdivision 1, notice of intent must be filed with the Environmental Quality Board containing information and in the manner and form required by the Environmental Quality Board. The notice of intent must contain a report justifying the proposed action, including an evaluation of alternatives that would not affect land within a wetland preservation area.\nThe Environmental Quality Board, in consultation with affected local governments, shall review the proposed action to determine its effect on the preservation and enhancement of wetlands and the relationship to local and regional comprehensive plans. If the Environmental Quality Board finds that the proposed action might have an unreasonable effect on a wetland preservation area, the Environmental Quality Board shall issue an order within the 60-day period under subdivision 2 for the party to refrain from the proposed action for an additional 60 days.\nDuring the additional 60 days, the Environmental Quality Board shall hold a public hearing concerning the proposed action at a place within the affected wetland preservation area or easily accessible to the wetland preservation area. Notice of the hearing must be published in a newspaper having a general circulation within the area. Individual written notice must be given to the local governments with jurisdiction over the wetland preservation area, the agency, corporation or government proposing to take the action, the owner of land in the wetland preservation area, and any public agency having the power of review or approval of the action.\nThe review process required in this section may be conducted jointly with any other environmental impact review by the Environmental Quality Board.\nThe Environmental Quality Board may suspend an eminent domain action for up to one year if it determines that the action is contrary to wetland preservation and that there are feasible and prudent alternatives that may have a less negative impact on the wetland preservation area.\nThe benefits and limitations of a wetland preservation area, including the restrictive covenant for the portion of the wetland preservation area taken, end on the date title and possession of the property is obtained.\nThe Environmental Quality Board may request the attorney general to bring an action to enjoin an agency, corporation, or government from violating this section.\nThis section does not apply to an emergency project that is immediately necessary for the protection of life and property.",
	"repealed": false
}