{
	"id": "142G.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.63",
	"title": "142G.63 NONDISPLACEMENT IN WORK ACTIVITIES.",
	"text": "For job assignments under jobs programs established under this chapter or chapter 256 or 256D, the county agency must provide written notification to and obtain the written concurrence of the appropriate exclusive bargaining representatives with respect to job duties covered under collective bargaining agreements and ensure that no work assignment under this chapter or chapter 256 or 256D results in:\n(1) termination, layoff, or reduction of the work hours of an employee for the purpose of hiring an individual under this section;\n(2) the hiring of an individual if any other person is on layoff, including seasonal layoff, from the same or a substantially equivalent job;\n(3) any infringement of the promotional opportunities of any currently employed individual;\n(4) the impairment of existing contract for services of collective bargaining agreements; or\n(5) a participant filling an established unfilled position vacancy, except for on-the-job training.\nThe written notification must be provided to the appropriate exclusive bargaining representatives at least 14 days in advance of placing recipients in temporary public service employment. The notice must include the number of individuals involved, their work locations and anticipated hours of work, a summary of the tasks to be performed, and a description of how the individuals will be trained and supervised.\n(a) If there is a dispute between an exclusive bargaining representative and a county provider or employer over whether job duties are within the scope of a collective bargaining unit, the exclusive bargaining representative, the county, the provider, or the employer may petition the Bureau of Mediation Services to determine if the job duties are within the scope of a collective bargaining unit, and the bureau shall render a binding decision.\n(b) In the event of a dispute under this section, the parties may:\n(1) use a grievance and arbitration procedure of an existing collective bargaining agreement to process a dispute over whether a violation of the nondisplacement provisions has occurred; or\n(2) if no grievance and arbitration procedure is in place, either party may submit the dispute to the bureau. The commissioner of the Bureau of Mediation Services shall establish a procedure for a neutral, binding resolution of the dispute.\nA participant may not work in a temporary public service or community service job for a public employer for more than 67 working days or 536 hours, whichever is greater, as part of a work program established under this chapter or chapter 256 or 256D. A participant who exceeds the time limits in this subdivision is a public employee, as that term is used in chapter 179A. Upon the written request of the exclusive bargaining representative, a county or public service employer shall make available to the affected exclusive bargaining representative a report of hours worked by participants in temporary public service or community service jobs.",
	"repealed": false
}