{
	"id": "169.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.801",
	"title": "169.801 IMPLEMENT OF HUSBANDRY.",
	"text": "Except as provided in this section and section 169.82, the provisions of sections 169.80 to 169.88 that govern size, weight, and load do not apply to an implement of husbandry while operated in compliance with this section.\n(a) An implement of husbandry that is not self-propelled and is equipped with pneumatic tires may not be operated on a public highway with a maximum wheel load that exceeds 500 pounds per inch of tire width.\n(b) A person operating or towing an implement of husbandry on a bridge must comply with the gross weight limitations provided in section 169.824.\nA towed implement of husbandry must be equipped with (1) safety chains that meet the requirements of section 169.82, subdivision 3, paragraph (b); (2) a regulation fifth wheel and kingpin assembly approved by the commissioner of public safety; or (3) a hitch pin or other hitching device with a retainer that prevents accidental unhitching.\nDespite subdivision 2, a person operating or towing an implement of husbandry must comply with a sign that limits the maximum weight allowed on a bridge.\nA person operating or towing an implement of husbandry that is higher than 13 feet six inches or wider than allowed under section 169.80, subdivision 2, must ensure that the operation or transportation does not damage a highway structure, utility line or structure, or other fixture adjacent to or over a public highway.\nNo person may operate or tow an implement of husbandry at a speed of more than 30 miles per hour.\n(a) An implement of husbandry may not be operated or towed on an interstate highway.\n(b) An implement of husbandry may be operated or towed to the left of the center of a roadway only if the operation does not extend into the left half of the roadway more than is necessary and:\n(1) the operation is for the purpose of avoiding an obstacle on the right-hand side of the road and the following requirements are met:\n(i) the implement crosses the center line for as brief a period of time as necessary to avoid the obstacle;\n(ii) the implement returns to the right half of the roadway immediately after passing the obstacle and when safe to do so; and\n(iii) no other vehicles are approaching from the opposite direction such that the approaching vehicle would be within the immediate vicinity of the implement before the implement returns to the right-hand side of the road; or\n(2) the implement is escorted at the front by a vehicle displaying hazard warning lights visible in normal sunlight.\n(c) An implement of husbandry, when operating in compliance with the requirements of this section and under paragraph (b), is not subject to the escort requirements in section 169.812, subdivision 2.\nAn implement of husbandry must be equipped with lights that comply with section 169.55, subdivisions 2 and 3.\nAn implement of husbandry must comply with section 169.522.\nNotwithstanding section 169.67:\n(a) A self-propelled implement of husbandry must be equipped with brakes adequate to control its movement and to stop and hold it and any vehicle it is towing.\n(b) A towed implement of husbandry must be equipped with brakes adequate to control its movement and to stop and hold it, unless the implement of husbandry is in a combination of vehicles that meets the requirements of section 169.67, subdivision 5.\n(c) If a towed implement of husbandry with a gross vehicle weight of more than 6,000 pounds, or more than 3,000 pounds if manufactured after January 1, 2011, is required under paragraph (b) to have brakes, it must also be equipped with brakes adequate to stop and hold it if it becomes detached from the towing vehicle.",
	"repealed": false
}