{
	"id": "15.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.012",
	"title": "15.012 STATE AGENCIES; DESIGNATION BY TYPE.",
	"text": "A multimember state agency hereafter created whose membership includes two or more appointed members shall be named according to the following:\n(a) An agency in the executive branch, other than a department, whose primary purpose is to perform prescribed official or representative functions shall be designated a \"board.\" To be classified as a board, an agency must have at least one of the following powers: (i) the power to perform administrative acts, which may include the expenditure of state money, (ii) the power to issue and revoke licenses or certifications, (iii) the power to make rules, or (iv) the power to adjudicate contested cases or appeals.\n(b) An agency in the executive branch whose primary purpose is to advise state officers, departments, boards, or other agencies shall be designated a \"committee.\" To be classified as a committee, an agency must have none of the powers available to boards other than the power to compensate its members.\n(c) A committee of which at least one-half of the members are required to be certain officers or representatives of specified businesses, occupations, industries, political subdivisions, organizations, or other groupings of persons other than geographical regions shall be designated a \"council.\"\n(d) An agency in the legislative branch composed exclusively of members of the legislature shall be designated a \"legislative commission.\"\n(e) An agency in the executive branch other than a department whose primary purpose is to issue bonds for the financing, ownership and development of facilities within the state shall be designated an \"authority.\"\n(f) A committee or council scheduled upon its creation to expire two years after the effective date of the act creating it or the date of appointment of its members, whichever is later, unless a shorter term is specified in statute, shall be designated an \"advisory task force.\"",
	"repealed": false
}