{
	"id": "275.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.14",
	"title": "275.14 CENSUS.",
	"text": "The population of a school district must be as certified by the Department of Education from the most recent federal census. In any year in which no federal census is taken pursuant to law in any school district affected by sections 124D.20 and 124D.531 a population estimate may be made and submitted to the state demographer for approval as hereinafter provided. The school board of a school district, in case it desires a population estimate, shall pass a resolution by July 1 containing a current estimate of the population of the school district and shall submit the resolution to the state demographer. The resolution shall describe the criteria on which the estimate is based and shall be in a form and accompanied by the data prescribed by the state demographer. The state demographer shall determine whether or not the criteria and process described in the resolution provide a reasonable basis for the population estimate and shall inform the school district of that determination within 30 days of receipt of the resolution. If the state demographer determines that the criteria and process described in the resolution do not provide a reasonable basis for the population estimate, the resolution shall be of no effect. If the state demographer determines that the criteria and process do provide a reasonable basis for the population estimate, the estimate shall be treated as the population of the school district for the purposes of sections 124D.20 and 124D.531 until the population of the school district has been established by the next federal census or until a more current population estimate is prepared and approved as provided herein, whichever occurs first. The state demographer shall establish guidelines for acceptable population estimation criteria and processes. The state demographer shall issue advisory opinions upon request in writing to cities or school districts as to proposed criteria and processes prior to their implementation in an estimation. The advisory opinion shall be final and binding upon the demographer unless the demographer can show cause why it should not be final and binding.\nIn the event that a census tract employed in taking a federal or local census overlaps two or more school districts, the county auditor shall, on the basis of the best information available, allocate the population of said census tract to the school districts involved.",
	"repealed": false
}