{
	"id": "349.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.15",
	"title": "349.15 USE OF GROSS PROFITS.",
	"text": "(a) Gross profits from lawful gambling may be expended only for lawful purposes or allowable expenses as authorized by the membership of the conducting organization at a monthly meeting of the organization's membership.\n(b) For each 12-month period beginning July 1, a licensed organization will be evaluated by the board to determine a rating based on the percentage of annual lawful purpose expenditures when compared to available gross profits for the same period. The rating will be used to determine the organization's profitability percent and is not a rating of the organization's lawful gambling operation. An organization will be evaluated according to the following criteria:\n(1) an organization that expends 50 percent or more of gross profits on lawful purposes will receive a five-star rating;\n(2) an organization that expends 40 percent or more but less than 50 percent of gross profits on lawful purposes will receive a four-star rating;\n(3) an organization that expends 30 percent or more but less than 40 percent of gross profits on lawful purposes will receive a three-star rating;\n(4) an organization that expends 20 percent or more but less than 30 percent of gross profits on lawful purposes will receive a two-star rating; and\n(5) an organization that expends less than 20 percent of gross profits on lawful purposes will receive a one-star rating.\n(c) An organization that fails to expend a minimum of 30 percent annually of gross profits on lawful purposes, or 20 percent annually for organizations that conduct lawful gambling in a location where the primary business is bingo, is automatically on probation effective July 1 for a period of one year. The organization must increase its rating to the required minimum or be subject to sanctions by the board. If an organization fails to meet the minimum after a one-year probation, the board may suspend the organization's license or impose a civil penalty as follows:\n(1) in determining any suspension or penalty for a violation of this paragraph, the board must consider any unique factors or extraordinary circumstances that caused the organization to not meet the minimum rate of profitability. Unique factors or extraordinary circumstances include, but are not limited to, the purchase of capital assets necessary to conduct lawful gambling; road or other construction causing impaired access to the lawful gambling premises; and flood, tornado, or other catastrophe that had a direct impact on the continuing lawful gambling operation; and\n(2) notwithstanding section 349.151, subdivision 4, paragraph (a), clause (10), the board may impose a civil penalty under this subdivision up to $10,000.\nAn organization may expend net profits from lawful gambling to relieve the effects of a disaster as defined in section 12.03, subdivision 2, without the prior approval of its membership if:\n(1) the contribution is a lawful purpose under section 349.12, subdivision 25, paragraph (a);\n(2) the contribution is authorized by the organization's chief executive officer and gambling manager; and\n(3) the contribution is approved by the membership of the organization at its next regularly scheduled monthly meeting.\nIf the contribution is not approved by the membership of the organization at its next regularly scheduled monthly meeting, the organization shall reimburse its gambling account in the amount of the contribution.\nIn computing gross profit to determine maximum amounts which may be expended for allowable expenses under subdivision 1, an organization may not reduce its gross receipts by any cash shortages. An organization may report cash shortages to the board only as an allowable expense. An organization may not report cash shortages for each 12-month period beginning July 1, that in total exceed three-tenths of one percent of the organization's gross receipts from lawful gambling at each permitted premises where the organization conducts lawful gambling.\nMS 2010 [Repealed, 2012 c 299 art 4 s 66]\nMS 2008 [Repealed, 2009 c 124 s 60]\nMS 2008 [Repealed, 2009 c 124 s 60]",
	"repealed": false
}