{
	"id": "116S.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/116S.02",
	"title": "116S.02 CORPORATION; MEMBERS; BOARD OF DIRECTORS; POWERS.",
	"text": "Minnesota Business Finance, Inc. is a public corporation of the state and is not subject to the laws governing a state agency except as provided in this chapter. The business of the corporation must be conducted under the name \"Minnesota Business Finance, Inc.\"\nThe purpose of the corporation is to engage in economic development activities throughout Minnesota and to provide access to capital for commercial borrowers throughout Minnesota primarily through the Small Business Administration section 503 program, United States Code, title 15, section 697, as amended.\nThe corporation is governed by a board of 14 directors. The membership terms, compensation, removal, and filling of vacancies of public members of the board are governed by section 15.0575 except that the terms of the public members are concurrent. The membership of the board consists of the commissioner of employment and economic development or the commissioner's designee and 13 members who are:\n(1) involved in economic development within the state of Minnesota;\n(2) selected by the membership of the corporation in accordance with section 116S.04, subdivision 3; and\n(3) representative of government, private-sector lending institutions, community organizations, and business organizations as described in Code of Federal Regulations, title 13, section 108.503-1(b)(2), as amended.\nThe board of directors shall adopt bylaws and publish the bylaws and amendments to the bylaws in the State Register.\nThe board shall locate and maintain the corporation's places of business within the state.\n(a) The board shall meet at least twice a year and may hold additional meetings upon giving notice in accordance with the bylaws of the corporation. Except as provided in subdivision 7, board meetings are subject to chapter 13D.\n(b) A conference among directors by any means of communication through which the directors may simultaneously hear each other during the conference constitutes a board meeting if the number of directors participating in the conference is sufficient to constitute a quorum for the meeting. Participation in a meeting by that means constitutes presence in person at the meeting.\nThe board of directors may by a majority vote in a public meeting decide to hold a closed meeting for purposes of discussing data described in subdivision 8 or security information, trade secret information, or labor relations information, as defined in section 13.37, subdivision 1. The time and place of the closed meeting must be announced at the public meeting. A written roll of members present at the closed meeting must be made available to the public after the closed meeting. The proceedings of a closed meeting must be tape recorded. The data on the tape are nonpublic data or private data on individuals as defined in section 13.02, subdivision 9 or 12, whichever is applicable.\nFinancial data, statistics, and information furnished to the corporation in connection with assistance or proposed assistance, including credit reports, financial statements, statements of net worth, income tax returns, either personal or corporate, and any other business and personal financial records are private data with regard to data on individuals under section 13.02, subdivision 12, or as nonpublic data with regard to data not on individuals under section 13.02, subdivision 9.\nA director, employee, or officer of the corporation may not participate in or vote on a decision of the board relating to an organization in which the director has either a direct or indirect financial interest or a conflict of interest as described in section 10A.07.\nThe corporation is a state agency for purposes of section 3.736.\nThe corporation is subject to chapter 13 and sections 15.17 and 138.163 to 138.226.",
	"repealed": false
}