{
	"id": "16B.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.58",
	"title": "16B.58 STATE PARKING FACILITIES.",
	"text": "No person may park a motor vehicle, either privately or publicly owned, upon any parking lot or facility owned or operated by the state except as authorized by this section. The commissioner shall operate and supervise all state parking lots and facilities associated with buildings described in section 16B.24, subdivision 1, or when the commissioner considers it advisable and practicable, any other parking lots or facilities owned or rented by the state for the use of a state agency or state employees. The commissioner may also provide employee shuttle service and promote alternative transportation modes, including initiatives to increase the number of multi-occupancy vehicles. The commissioner may fix and collect rents, charges, or fees in connection with and for the use of any state parking lot or facility within the cities of St. Paul and Minneapolis except for any state lot or facility the control of which is vested by law in a state agency other than the Department of Administration.\nCopies of the commissioner's rules under this section must be provided to all contract parkers. Each parking lot or facility must be posted with notice of who is entitled to park there.\nA motor vehicle parked on a state parking lot or facility in violation of the rules of the commissioner is a public nuisance and the commissioner shall provide for the abatement of the nuisance by rules, including provision for the removal and impounding of the motor vehicle. The cost of the removal and impounding is a lien against the motor vehicle until paid.\nA person, elective or appointed state official, firm, association, or corporation which violates any of the provisions of this section or any rule made by the commissioner under this section is guilty of a misdemeanor.\nMoney collected by the commissioner as rents, charges, or fees in connection with and for the use of a parking lot or facility is appropriated to the commissioner for the purpose of operating, maintaining, improving, and replacing parking lots or facilities owned or operated by the state, including providing necessary and suitable uniforms for employees, and to carry out the purposes of this section.\nThe provisions of this section do not affect rules of parking adopted by resolution of the legislature during legislative sessions.\n[Repealed, 2001 c 162 s 10]\n[Repealed, 1997 c 202 art 2 s 64]\nThe commissioner may require that a user of a charging station located on the State Capitol complex used to charge an electric vehicle pay an electric service fee as determined by the commissioner.",
	"repealed": false
}