{
	"id": "260B.130",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.130",
	"title": "260B.130 EXTENDED JURISDICTION JUVENILE PROSECUTIONS.",
	"text": "A proceeding involving a child alleged to have committed a felony offense is an extended jurisdiction juvenile prosecution if:\n(1) the child was 14 to 17 years old at the time of the alleged offense, a certification hearing was held, and the court designated the proceeding an extended jurisdiction juvenile prosecution;\n(2) the child was 16 or 17 years old at the time of the alleged offense; the child is alleged to have committed an offense for which the Sentencing Guidelines and applicable statutes presume a commitment to prison or to have committed any felony in which the child allegedly used a firearm; and the prosecutor designated in the delinquency petition that the proceeding is an extended jurisdiction juvenile prosecution; or\n(3) the child was 14 to 17 years old at the time of the alleged offense, the prosecutor requested that the proceeding be designated an extended jurisdiction juvenile prosecution, a hearing was held on the issue of designation, and the court designated the proceeding an extended jurisdiction juvenile prosecution.\nWhen a prosecutor requests that a proceeding be designated an extended jurisdiction juvenile prosecution, the court shall hold a hearing under section 260B.163 to consider the request. The hearing must be held within 30 days of the filing of the request for designation, unless good cause is shown by the prosecution or the child as to why the hearing should not be held within this period in which case the hearing shall be held within 90 days of the filing of the request. If the prosecutor shows by clear and convincing evidence that designating the proceeding an extended jurisdiction juvenile prosecution serves public safety, the court shall grant the request for designation. In determining whether public safety is served, the court shall consider the factors specified in section 260B.125, subdivision 4. The court shall decide whether to designate the proceeding an extended jurisdiction juvenile prosecution within 15 days after the designation hearing is completed, unless additional time is needed, in which case the court may extend the period up to another 15 days.\nA child who is the subject of an extended jurisdiction juvenile prosecution has the right to a trial by jury and to the effective assistance of counsel, as described in section 260B.163, subdivision 4.\n(a) If an extended jurisdiction juvenile prosecution results in a guilty plea or finding of guilt, the court shall:\n(1) impose one or more juvenile dispositions under section 260B.198; and\n(2) impose an adult criminal sentence, the execution of which shall be stayed on the condition that the offender not violate the provisions of the disposition order and not commit a new offense.\n(b) If a child prosecuted as an extended jurisdiction juvenile after designation by the prosecutor in the delinquency petition is convicted of an offense after trial that is not an offense described in subdivision 1, clause (2), the court shall adjudicate the child delinquent and order a disposition under section 260B.198. If the extended jurisdiction juvenile proceeding results in a guilty plea for an offense not described in subdivision 1, clause (2), the court may impose a disposition under paragraph (a) if the child consents.\n[See Note.]\n(a) When it appears that a person convicted as an extended jurisdiction juvenile has violated the conditions of the stayed sentence, or is alleged to have committed a new offense, the court may, without notice, revoke the stay and probation and direct that the offender be taken into immediate custody. The court shall notify the offender in writing of the reasons alleged to exist for revocation of the stay of execution of the adult sentence. If the offender challenges the reasons, the court shall hold a summary hearing on the issue at which the offender is entitled to be heard and represented by counsel.\n(b) If a person described in paragraph (a) is taken into custody, the person may be detained in a secure juvenile detention facility. If there is no secure juvenile detention facility or existing acceptable detention alternative available for juveniles within the county, the child may be detained up to 24 hours, excluding Saturdays, Sundays, and holidays, or for up to six hours in a standard metropolitan statistical area, in a jail, lockup, or other facility used for the confinement of adults who have been charged with or convicted of a crime. In this instance, the person must be confined in quarters separate from any adult confined in the facility that allow for complete sight and sound separation for all activities during the period of the detention, and the adult facility must be approved for the detention of juveniles by the commissioner of corrections.\nIf the person is 18 years of age or older and is to be detained prior to the revocation hearing, the person may be detained in a local adult correctional facility without the need for sight and sound separation.\n(c) After the hearing, if the court finds that reasons exist to revoke the stay of execution of sentence, the court shall treat the offender as an adult and order any of the adult sanctions authorized by section 609.14, subdivision 3, except that no credit shall be given for time served in juvenile facility custody prior to a summary hearing. If the offender was convicted of an offense described in subdivision 1, clause (2), and the court finds that reasons exist to revoke the stay, the court must order execution of the previously imposed sentence unless the court makes written findings regarding the mitigating factors that justify continuing the stay.\n(d) Upon revocation, the offender's extended jurisdiction status is terminated and juvenile court jurisdiction is terminated. The ongoing jurisdiction for any adult sanction, other than commitment to the commissioner of corrections, is with the adult court.\n[See Note.]\nThis section does not apply to a child excluded from the definition of delinquent child under section 260B.007, subdivision 6, paragraph (b).",
	"repealed": false
}