{
	"id": "357.182",
	"url": "https://www.revisor.mn.gov/statutes/cite/357.182",
	"title": "357.182 COUNTY FEES AND RECORDING STANDARDS FOR RECORDING OF REAL ESTATE DOCUMENTS.",
	"text": "Unless otherwise specified in this section and notwithstanding any other law to the contrary, effective August 1, 2005, this section applies to each county in Minnesota. Documents presented for recording within 60 days after July 1, 2005, and that are acknowledged, sworn to before a notary, or certified before July 1, 2005, must not be rejected for failure to include the new filing fee.\nNotwithstanding any local law or ordinance to the contrary, no county may charge or collect any fee, special or otherwise, or however described, other than a fee denominated or prescribed by state law, for any service, task, or step performed by any county officer or employee in connection with the receipt, recording, and return of any recordable instrument by the county recorder or registrar of titles, whether received by mail, in person, or by electronic delivery, including, but not limited to, opening mail; handling, transferring, or transporting the instrument; certifying no-delinquent property taxes; payment of state deed tax, mortgage registry tax, or conservation fee; recording of approved plats, subdivision splits, or combinations; or any other prerequisites to recording, and returning the instrument by regular mail or in person to the person identified in the instrument for that purpose.\nEach county recorder and registrar of titles shall, within 15 business days after any instrument in recordable form accompanied by payment of applicable fees by customary means is delivered to the county for recording or is otherwise received by the county recorder or registrar of titles for that purpose, record and index the instrument in the manner provided by law and return it by regular mail or in person to the person identified in the instrument for that purpose, if the instrument does not require certification of no-delinquent taxes, payment of state deed tax, mortgage registry tax, or conservation fee. Each county must establish a policy for the timely handling of instruments that require certification of no-delinquent taxes, payment of state deed tax, mortgage registry tax, or conservation fee and that policy may allow up to an additional five business days at the request of the office or offices responsible to complete the payment and certification process.\nFor calendar years 2009 and 2010, the maximum time allowed for completion of the recording process for documents presented in recordable form will be 15 business days.\nFor calendar year 2011 and thereafter, the maximum time allowed for completion of the recording process for documents presented in recordable form will be ten business days.\nInstruments recorded electronically must be returned no later than five business days after receipt by the county in a recordable format.\nFor calendar year 2007, a county is in compliance with the recording requirements prescribed by subdivision 3 if at least 60 percent of all recordable instruments described in subdivision 3 and received by the county in that year are recorded and returned within the time limits prescribed in subdivision 3. In calendar year 2008, at least 70 percent of all recordable instruments must be recorded and returned in compliance with the recording requirements; for calendar year 2009, at least 80 percent of all recordable instruments must be recorded and returned in compliance with the recording requirements; and for calendar year 2010 and later years, at least 90 percent of all recordable instruments must be recorded and returned in compliance with the recording requirements.\nCompliance with the requirements of subdivision 4 may be suspended for up to six months when a county undertakes material enhancements to its systems for receipt, handling, paying of deed and mortgage tax and conservation fees, recording, indexing, certification, and return of instruments. The six-month suspension may be extended for up to an additional six months if a county board finds by resolution that the additional time is necessary because of the difficulties of implementing the enhancement.\nEffective beginning in 2007 for the 2008 county budget and in each year thereafter, the county recorder and registrar of titles for each county shall file with the county commissioners, as part of their budget request, a report that establishes the status for the previous year of their compliance with the requirements established in subdivision 3. If the office has not achieved compliance with the recording requirements, the report must include an explanation of the failure to comply, recommendations by the recorder or registrar to cure the noncompliance and to prevent a recurrence, and a proposal identifying actions, deadlines, and funding necessary to bring the county into compliance.\nNotwithstanding any law to the contrary, for county budgets adopted after January 1, 2006, each county shall segregate the additional unallocated fee authorized by sections 357.18, 508.82, and 508A.82 from the application of the provisions of chapters 386, 507, 508, and 508A, in an appropriate account. This money is available as authorized by the Board of County Commissioners for supporting enhancements to the recording process, including electronic recording, to fund compliance efforts specified in subdivision 5 and for use in undertaking data integration and aggregation projects. Money remains in the account until expended for any of the authorized purposes set forth in this subdivision. This money must not be used to supplant the normal operating expenses for the office of county recorder or registrar of titles.",
	"repealed": false
}