{
	"id": "582.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.041",
	"title": "582.041 FORECLOSURE OF MORTGAGE THAT INCLUDES HOMESTEAD.",
	"text": "If a mortgage on real property is foreclosed and the property contains a portion of a homestead, the person in possession of the real property must be notified by the foreclosing mortgagee that the homestead may be sold and redeemed separately from the remaining property. The notice in subdivision 2 must be served with the notice of foreclosure that is served on the person in possession of the real property with the requirements in section 580.03 or for a foreclosure by action under chapter 581, in the summons and complaint served on the person in possession of the real property.\n(a) The following notice must be served with the foreclosure notice of property containing a homestead that is served on the person in possession of the real property under section 580.03. The notice is not to be published. The notice must be in 10-point capitalized letters.\n\"IF PART OF THE PROPERTY TO BE SOLD CONTAINS YOUR HOUSE, YOU MAY DESIGNATE AN AREA AS A HOMESTEAD TO BE SOLD AND REDEEMED SEPARATELY.\nYOU MAY DESIGNATE THE HOUSE YOU OCCUPY AND ANY AMOUNT OF THE PROPERTY AS A HOMESTEAD. THE DESIGNATED HOMESTEAD PROPERTY MUST CONFORM TO THE LOCAL ZONING ORDINANCES AND BE COMPACT SO THAT IT DOES NOT UNREASONABLY REDUCE THE VALUE OF THE REMAINING PROPERTY.\nYOU MUST PROVIDE THE PERSON FORECLOSING ON THE PROPERTY, THE SHERIFF, AND THE COUNTY RECORDER WITH A COPY OF THE LEGAL DESCRIPTION OF THE HOMESTEAD YOU HAVE DESIGNATED BY TEN BUSINESS DAYS BEFORE THE DATE THE PROPERTY IS TO BE SOLD.\"\n(b) The following notice must be served with the summons and complaint in an action to foreclose a mortgage of property containing a homestead under chapter 581. The notice must be in 10-point capitalized letters and is not to be published with the summons if the summons is published.\n\"IF PART OF THE PROPERTY TO BE SOLD CONTAINS YOUR HOUSE, YOU MAY DESIGNATE AN AREA AS A HOMESTEAD TO BE SOLD AND REDEEMED SEPARATELY.\nYOU MAY DESIGNATE THE HOUSE YOU OCCUPY AND ANY AMOUNT OF THE PROPERTY AS A HOMESTEAD. THE DESIGNATED HOMESTEAD PROPERTY MUST CONFORM TO THE LOCAL ZONING ORDINANCES AND BE COMPACT SO THAT IT DOES NOT UNREASONABLY REDUCE THE VALUE OF THE REMAINING PROPERTY.\nYOU MUST PROVIDE THE COURT WITH A LEGAL DESCRIPTION OF THE HOMESTEAD YOU HAVE DESIGNATED.\"\nThe person who is homesteading the property must designate a legal description of the homestead property to be sold separately. The homestead property designated may include any amount of the property. The designation must conform to local zoning, include the dwelling occupied by the person homesteading the property, and be compact so that it does not unreasonably affect the value of the remaining property. The person homesteading the property must serve a copy of the designation on the foreclosing mortgagee, the sheriff, and the county recorder or registrar of titles by ten business days before the sale is scheduled, or for a foreclosure by action under chapter 581, a copy of the designation must be provided to the court.\nIf the sheriff receives a homestead property designation under subdivision 3, or is ordered by the court, the sheriff must offer and sell the designated homestead property, and the remaining property, separately.\nA party who has a right of redemption may redeem the designated homestead, the remaining property, or the entire property including the homestead. The period of redemption is the period for the entire property including the designated homestead.",
	"repealed": false
}