{
	"id": "13.598",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.598",
	"title": "13.598 EMPLOYMENT AND ECONOMIC DEVELOPMENT DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2a to 12 are codified outside this chapter and include classification of employment and economic development data as other than public, place restrictions on access to government data, or involve data sharing.\n[Repealed, 2003 c 128 art 13 s 40]\nData maintained by the commissioner of employment and economic development are classified under sections 268.19 and 469.154, subdivision 2.\nData on a tape of a closed board meeting of Enterprise Minnesota, Inc. are classified under section 116O.03, subdivision 6. Certain data disclosed to the board or employees of Enterprise Minnesota, Inc. are classified under section 116O.03, subdivision 7.\n[Repealed, 2016 c 158 art 4 s 5]\nVarious data held by Minnesota Business Finance, Inc. are classified under section 116S.02, subdivision 8.\n(a) Preliminary information. Access to preliminary information submitted to the commissioner of employment and economic development under sections 469.142 to 469.151 or sections 469.152 to 469.165 is limited under section 469.154, subdivision 2.\n(b) Enterprise zones. Data sharing between the commissioner of revenue and the commissioner of employment and economic development or a municipality receiving an enterprise zone designation is governed by section 469.173, subdivision 5.\n(c) Tax incentives. Disclosure of data by the Department of Revenue to determine eligibility for tax incentives available under section 272.0212, 469.1732, or 469.1734, is governed by section 469.1733, subdivision 1.\nProgram data collected on individuals are classified by section 116J.401, subdivision 3.\nDisclosure of unemployment insurance hearing data is governed by section 268.105, subdivision 5.\nData on individuals under the Minnesota youth program are classified under section 116L.561, subdivision 7.\nData sharing of employment and training program data between the commissioner of employment and economic development, the commissioner of human services, state agency personnel, and other users of the inventory, referral and intake system, is governed by section 116L.86, subdivision 3.\nDisclosure of data obtained by the Department of Employment and Economic Development regarding the vocational rehabilitation of an injured or disabled employee is governed by section 268A.05.\nThe department may disseminate an employer's name, address, industry code, and the number of employees by ranges of not less than 100 for the purpose of assisting individuals using the Minnesota Workforce Center system in obtaining employment.\nDisclosure of deployment data provided by a broadband provider to the Office of Broadband Development is governed by section 116J.397.",
	"repealed": false
}