{
	"id": "347.541",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.541",
	"title": "347.541 DISPOSITION OF SEIZED ANIMALS.",
	"text": "The owner of any dog declared dangerous has the right to a hearing by an impartial hearing officer.\nA person claiming an interest in a seized dog may prevent disposition of the dog by posting security in an amount sufficient to provide for the dog's actual cost of care and keeping. The security must be posted within seven days of the seizure inclusive of the date of the seizure.\nThe authority declaring the dog dangerous shall give notice of this section by delivering or mailing it to the owner of the dog, or by posting a copy of it at the place where the dog is kept, or by delivering it to a person residing on the property, and telephoning, if possible. The notice must include:\n(1) a description of the seized dog; the authority for and purpose of the dangerous dog declaration and seizure; the time, place, and circumstances under which the dog was declared dangerous; and the telephone number and contact person where the dog is kept;\n(2) a statement that the owner of the dog may request a hearing concerning the dangerous dog declaration and, if applicable, prior potentially dangerous dog declarations for the dog, and that failure to do so within 14 days of the date of the notice will terminate the owner's right to a hearing under this section;\n(3) a statement that if an appeal request is made within 14 days of the notice, the owner must immediately comply with the requirements of section 347.52, paragraphs (a) and (c), and until such time as the hearing officer issues an opinion;\n(4) a statement that if the hearing officer affirms the dangerous dog declaration, the owner will have 14 days from receipt of that decision to comply with all other requirements of sections 347.51, 347.515, and 347.52;\n(5) a form to request a hearing under this subdivision; and\n(6) a statement that all actual costs of the care, keeping, and disposition of the dog are the responsibility of the person claiming an interest in the dog, except to the extent that a court or hearing officer finds that the seizure or impoundment was not substantially justified by law.\nAny hearing must be held within 14 days of the request to determine the validity of the dangerous dog declaration. The hearing officer must be an impartial employee of the local government or an impartial person retained by the local government to conduct the hearing. In the event that the dangerous dog declaration is upheld by the hearing officer, actual expenses of the hearing up to a maximum of $1,000 will be the responsibility of the dog's owner. The hearing officer shall issue a decision on the matter within ten days after the hearing. The decision must be delivered to the dog's owner by hand delivery or registered mail as soon as practical and a copy must be provided to the animal control authority.",
	"repealed": false
}