{
	"id": "137.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.64",
	"title": "137.64 CONDITIONS FOR PAYMENTS TO UNIVERSITY.",
	"text": "Before the commissioner may make any payments authorized in this section to the Board of Regents for a biomedical science research facility project, the commissioner must certify that the board has, by board resolution, approved the maximum project cost for the project and complied with the requirements of section 137.63. For each project approved by the board, the board must certify to the commissioner the amount of the annual payments of principal and interest required to service each series of bonds issued by the University of Minnesota for the project, and the actual amount of the state's annual payment to the University of Minnesota under subdivision 2. The annual payment must not exceed the amount required to pay debt service on the bonds issued to finance 75 percent of the project costs of biomedical science research facilities authorized before 2019. The annual payment may additionally be for the amount required to pay debt service on the bonds issued to finance 100 percent of the costs of the clinical research facility.\nOn July 15 of each year after the certification under subdivision 1, but no earlier than July 15, 2009, and for so long thereafter as any bonds issued by the board for a project, or any refunding bonds issued under subdivision 7, are outstanding, the state must transfer to the board annual payments as certified under subdivision 1, up to the maximum amounts in the appropriation schedule under subdivision 3. Payments under this section are to reimburse the Board of Regents for the state's share of the project costs for the biomedical science research facility projects, provided that the principal amount of bonds issued by the University of Minnesota to pay the state's share of the costs must not exceed $219,000,000.\nAnnual appropriations are made from the general fund to the commissioner of management and budget for transfer to the Board of Regents, as follows:\n(1) up to $850,000 is appropriated in fiscal year 2010;\n(2) up to $3,650,000 is appropriated in fiscal year 2011;\n(3) up to $7,825,000 is appropriated in fiscal year 2012;\n(4) up to $12,100,000 is appropriated in fiscal year 2013;\n(5) up to $14,825,000 is appropriated in fiscal year 2014;\n(6) up to $15,550,000 is appropriated in fiscal year 2015 and each year thereafter through fiscal year 2020; and\n(7) up to $13,930,000 is appropriated in fiscal year 2021 and each year thereafter through fiscal year 2039.\nThe Board of Regents must report to the committees of the legislature with responsibility for capital investment by January 15 of each even-numbered year on the biomedical science research facility projects authorized under this section. The report must at a minimum include, for each project, the total cost, the number of researchers, research grants, and the amount of debt issued by the board.\nThe Board of Regents must, to the extent permitted under federal law and University of Minnesota policies, place a priority on reducing the state's share of project costs by dedicating a share of the proceeds from any commercialization or licensing revenues attributable to research conducted in the biomedical science facilities to reducing the appropriations needed under subdivision 3.\nConsistent with its mission and governing policies and the requirements for tax-exempt bonds, the university shall make available laboratory and other services on a fee-for-service basis to individuals and firms in the bioscience industry in Minnesota. The university will not assert patent rights when providing services that do not involve its innovative intellectual contributions.\n(a) The board may issue bonds in one or more series to refund bonds that were issued for a project before January 1, 2019, if refunding is determined by the board to be in the best interest of the university. The principal amount of bonds issued in each refunding must not exceed the amount necessary to defease the associated bonds outstanding immediately prior to refunding. The amount of the state's annual payment to the university required for the debt service on the refunded bonds, or original bonds if not yet refunded, or a combination of the two, shall be up to the maximum annual appropriation under subdivision 3 for all series.\n(b) The amount of the annual appropriation under subdivision 3 that is not needed to pay the annual debt service under paragraph (a) is appropriated to the Board of Regents of the University of Minnesota to pay the annual debt service amount on bonds issued by the university to pay the costs of design, land acquisition, site preparation, and preconstruction services of the clinical research facility.\n(c) In any year that the state general fund appropriation authorized in this section exceeds the amount needed to pay debt service on bonds issued by the university for purposes specified in sections 137.61 to 137.65, the excess amount is canceled to the state general fund.",
	"repealed": false
}