{
	"id": "473.595",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.595",
	"title": "473.595 COMMISSION FINANCES.",
	"text": "The commission shall by resolution impose and maintain a ten percent admission tax upon the granting, issuance, sale, or distribution, by any private or public person, association, or corporation, of the privilege of admission to activities at the Metrodome. No other tax, surcharge, or governmental imposition, except the taxes imposed by chapter 297A, may be levied by any other unit of government upon any such sale or distribution. The admission tax shall be stated and charged separately from the sales price so far as practicable and shall be collected by the grantor, seller, or distributor from the person admitted and shall be a debt from that person to the grantor, issuer, seller, or distributor, and the tax required to be collected shall constitute a debt owed by the grantor, issuer, seller, or distributor to the commission, which shall be recoverable at law in the same manner as other debts. Every person granting, issuing, selling, or distributing tickets for such admissions may be required, as provided in resolutions of the commission, to secure a permit, to file returns, to deposit security for the payment of the tax, and to pay such penalties for nonpayment and interest on late payments, as shall be deemed necessary or expedient to assure the prompt and uniform collection of the tax.\nNotwithstanding any other provisions of this subdivision, the imposition of an admission tax upon a national superbowl football game conducted at the Metrodome is discretionary with the commission.\nThe commission shall impose a ten percent admission tax on all tickets sold, issued, granted, or distributed for the privilege of admission to the basketball and hockey arena. In addition, the commission shall impose a surcharge in an amount to be determined by the commission, but not less than $1 per ticket, on all tickets sold, issued, granted, or distributed for the privilege of admission to activities at the basketball and hockey arena. The sales price shall include the price of the ticket and any service or other charge imposed by the grantor, issuer, seller, or distributor upon the reservation, processing, distribution, delivery, or sale of the ticket. No other tax, surcharge, or governmental imposition, except the taxes imposed by chapter 297A, may be levied by any other unit of government upon such a sale or distribution. The admission tax and surcharge for the privilege of admission to activities at the basketball and hockey arena shall be charged and added to the sales price of the ticket, and imposed and collected in the same manner provided for the Metrodome pursuant to subdivision 1. The tax and surcharge provided for in this subdivision shall be effective from and after the date of the commission's acquisition of the basketball and hockey arena.\nRentals, fees, and charges provided for in use agreements at the Metrodome and basketball and hockey arena entered into by the commission shall be those estimated by the commission to be necessary and feasible to produce so far as possible, with commission revenues from other sources, the amounts needed for current operation, maintenance, and debt service. The commission shall with respect to the Met Center, the Metrodome, and the basketball and hockey arena meet and confer with any public body, authority, or agency owning or operating an entertainment or sports complex, or indoor sports arena, in the metropolitan area, for the purpose of undertaking measures or agreements maximizing revenues and eliminating unnecessary operational expenditures.\nThe commission shall prepare a proposed budget by August 1 of each year. The budget shall include operating revenues and expenditures for operation, administration, and maintenance. In addition, the budget must show for each year:\n(a) The estimated operating revenues from all sources including funds on hand at the beginning of the year, and estimated expenditures for costs of operation, administration, maintenance, and debt service;\n(b) Capital improvement funds estimated to be on hand at the beginning of the year and estimated to be received during the year from all sources and estimated cost of capital improvements to be paid out or expended during the year; all in such detail and form as the council may prescribe; and\n(c) The estimated source and use of pass-through funds.\nAs early as practicable before August 15 of each year, the commission shall hold a public hearing on a draft of the proposed budget. Along with the draft, the commission shall publish a report on user charges. The report must include an estimate and analysis of the changes in user charges, rates, and fees that will be required by the commission's budget. Not less than 14 days before the hearing, the commission shall publish notice of the hearing in a newspaper having general circulation in the metropolitan area, stating the date, time, and place of hearing, and the place where the proposed budget and report on user charges may be examined by any interested person. Following the hearing, the commission shall publish a report of the hearing that summarizes the comments received and the commission's response. The council shall approve or disapprove the entire budget by October 1 of each year. Before December 15 of each year, the commission shall by resolution adopt a final budget. The commission shall file its final budget with the council on or before December 20 of each year. The council shall file the budgets with the secretary of the senate and the clerk of the house of representatives not later than January 1 of each year.\nExcept in an emergency, for which procedures must be established by the commission, the commission and its officers, agents, and employees may not spend money for any purpose, other than debt service, without an appropriation by the commission, and no obligation to make such an expenditure shall be enforceable except as the obligation of the person or persons incurring it. The creation of any debt obligation or the receipt of any federal or state grant is a sufficient appropriation of the proceeds for the purpose for which it is authorized, and of the tax or other revenues pledged to pay the obligation and interest on it whether or not specifically included in any annual budget. After obtaining approval of the council, the commission may amend the budget at any time by transferring any appropriation from one purpose to another, except appropriations of the proceeds of bonds issued for a specific purpose.\nThe commission shall comply with the provisions of section 473.164.\nThe legislative auditor shall make an independent audit of the commission's books and accounts once each year or as often as the legislative auditor's funds and personnel permit. The costs of the audits shall be paid by the commission pursuant to section 3.9741. The council may examine the commission's books and accounts at any time.\nThe commission shall receive and account for all tax and other revenue of the commission and from the revenue shall provide, contract, and pay for proper operation, administration, and maintenance of all of its property and facilities and shall maintain, as authorized by resolutions of the council, reserves for major repairs, replacements, and improvements and for working capital. The commission shall remit to the council for deposit in its Metrodome debt service funds, at the times required by resolution of the council, the net revenue attributable to the Metrodome in excess of these requirements and for deposit in its basketball and hockey arena debt service fund or funds, at the times required by resolution of the council, the net revenue attributable to the basketball and hockey arena in excess of these requirements.\nThe commission may sell seats in any multipurpose sports facility constructed after June 30, 1979 at prices and subject to conditions consistent with this section. Ownership of a seat shall give the owner first preference for purchase of a season ticket of admission for professional sports exhibitions with a right to be seated in the owned seat. An owner may sell or otherwise transfer the rights on whatever terms the owner chooses. Rights to a seat may not be divided. No fee may be charged for a transfer of ownership of a seat. The commission may charge a maintenance fee not exceeding $10 per year for each seat.",
	"repealed": false
}