{
	"id": "123B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.04",
	"title": "123B.04 SITE DECISION MAKING; INDIVIDUALIZED LEARNING AGREEMENT; OTHER AGREEMENTS.",
	"text": "\"Education site\" means a separate facility. A program within a facility or within a district is an education site if the school board recognizes it as a site.\nTo promote individualized learning and instruction and improve student achievement under subdivisions 4 and 4a, a participating school board under this section may consider how to:\n(1) assist a school site to adapt instruction to the needs and aptitudes of individual students, and establish goals and standards for individual students in addition to the state academic standards applicable to all students;\n(2) coordinate the pace of instruction and learning with the needs and aptitudes of individual students at a school site;\n(3) provide useful data and assist with research in developing and improving innovative, cost-effective, research-based individualized learning, instruction, and assessment under this section and chapter 124E;\n(4) demonstrate and help evaluate instructional alternatives to age-based grade progression;\n(5) more effectively motivate students and teachers; and\n(6) expand use of learning technology to support individualized learning, instruction, assessment, and achievement.\n(a) The school board and a school site may enter into an agreement under this section solely to develop and implement an individualized learning and achievement contract under subdivision 4.\n(b) Upon the request of 60 percent of the licensed employees of a site or a school site decision-making team, the school board shall enter into discussions to reach an agreement concerning the governance, management, or control of the school. A school site decision-making team may include the school principal, teachers in the school or their designee, other employees in the school, representatives of pupils in the school, or other members in the community. A school site decision-making team must include at least one parent of a pupil in the school. For purposes of formation of a new site, a school site decision-making team may be a team of teachers that is recognized by the board as a site. The school site decision-making team shall include the school principal or other person having general control and supervision of the school. The site decision-making team must reflect the diversity of the education site. At least one-half of the members shall be employees of the district, unless an employee is the parent of a student enrolled in the school site, in which case the employee may elect to serve as a parent member of the site team.\n(c) School site decision-making agreements must delegate powers, duties, and broad management responsibilities to site teams and involve staff members, students as appropriate, and parents in decision making.\n(d) An agreement shall include a statement of powers, duties, responsibilities, and authority to be delegated to and within the site.\n(e) An agreement may include:\n(1) an achievement contract according to subdivision 4;\n(2) a mechanism to allow principals, a site leadership team, or other persons having general control and supervision of the school, to make decisions regarding how financial and personnel resources are best allocated at the site and from whom goods or services are purchased;\n(3) a mechanism to implement parental involvement programs under section 124D.895 and to provide for effective parental communication and feedback on this involvement at the site level;\n(4) a provision that would allow the team to determine who is hired into licensed and nonlicensed positions;\n(5) a provision that would allow teachers to choose the principal or other person having general control;\n(6) an amount of revenue allocated to the site under subdivision 3; and\n(7) any other powers and duties determined appropriate by the board.\nThe school board of the district remains the legal employer under clauses (4) and (5).\n(f) Any powers or duties not delegated to the school site management team in the school site management agreement shall remain with the school board.\n(g) Approved agreements shall be filed with the commissioner. If a school board denies a request or the school site and school board fail to reach an agreement to enter into a school site management agreement, the school board shall provide a copy of the request and the reasons for its denial to the commissioner.\n(h) A site decision-making grant program is established, consistent with this subdivision, to allow sites to implement an agreement that at least:\n(1) notwithstanding subdivision 3, allocates to the site all revenue that is attributable to the students at that site;\n(2) includes a provision, consistent with current law and the collective bargaining agreement in effect, that allows the site team to decide who is selected from within the district for licensed and nonlicensed positions at the site and to make staff assignments in the site; and\n(3) includes a completed performance agreement under subdivision 4.\nThe commissioner shall establish the form and manner of the application for a grant and annually, at the end of each fiscal year, report to the house of representatives and senate committees having jurisdiction over education on the progress of the program.\nRevenue for a fiscal year received or receivable by the district shall be allocated to education sites based on the agreement between the school board and the site decision-making team. Revenue shall remain allocated to each site until used by the site. The site teams and the board may enter an agreement that permits the district to provide services and retain the revenue required to pay for the services provided. The district remains responsible for legally entering into contracts and expending funds. For the purposes of this subdivision, \"allocation\" means that the determination of the use of the revenue shall be under the control of the site. The district may charge the accounts of each site the actual costs of goods and services from the general or capital funds attributable to the site.\nA school board may enter a written education site achievement contract with each site decision-making team for: (1) setting individualized learning and achievement measures and short- and long-term educational goals for each student at that site that may include site-based strategies for English language instruction targeting the teachers of English learners and all teachers and school administrators; (2) recognizing each student's educational needs and aptitudes and levels of academic attainment, whether on grade level or above or below grade level, so as to improve student performance through such means as a cost-effective, research-based formative assessment system designed to promote individualized learning and assessment; (3) using student performance data to diagnose a student's academic strengths and weaknesses and indicate to the student's teachers the specific skills and concepts that need to be introduced to the student and developed through academic instruction or applied learning, organized by strands within subject areas and linked to state and local academic standards during the next year, consistent with the student's short- and long-term educational goals; and (4) assisting the education site if progress in achieving student or contract goals or other performance expectations or measures agreed to by the board and the site decision-making team are not realized or implemented.\nA school board that enters into a written education achievement contract with a school site under subdivision 4 where the student performance data at the site demonstrate at least three consecutive school years of improved student achievement consistent with the terms of the achievement contract may seek to establish a similar achievement contract with other school sites in the district.\nThe commissioner of education, in consultation with appropriate educational organizations, shall:\n(1) upon request, provide technical support for districts and sites with agreements under this section;\n(2) conduct and compile research on the effectiveness of site decision making; and\n(3) periodically report on and evaluate the effectiveness of site management agreements on a statewide basis.",
	"repealed": false
}