{
	"id": "256B.0926",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0926",
	"title": "256B.0926 ADMISSION REVIEW TEAM; INTERMEDIATE CARE FACILITIES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them in this subdivision.\n(b) \"Provider\" means a provider of community-based intermediate care facility services for persons with developmental disabilities.\n(c) \"Facility\" means a community-based intermediate care facility for persons with developmental disabilities.\n(d) \"Person\" means a person with a developmental disability who is applying for admission to an intermediate care facility for persons with developmental disabilities.\n(a) Before a person is admitted to a facility, an admission review team must assure that the provider can meet the needs of the person as identified in the person's individual service plan required under section 256B.092, subdivision 1, unless authorized by the commissioner for admittance to a state-operated services facility.\n(b) The admission review team must be assembled pursuant to Code of Federal Regulations, title 42, section 483.440(b)(2). The composition of the admission review team must meet the definition of an interdisciplinary team in Code of Federal Regulations, title 42, section 483.440. In addition, the admission review team must meet any conditions agreed to by the provider and the county where services are to be provided.\n(c) The county in which the facility is located may establish an admission review team which includes at least the following:\n(1) a qualified developmental disability professional, as defined in Code of Federal Regulations, title 42, section 483.440;\n(2) a representative of the county in which the provider is located;\n(3) at least one professional representing one of the following professions: nursing, psychology, physical therapy, or occupational therapy; and\n(4) a representative of the provider.\nIf the county in which the facility is located does not establish an admission review team, the provider shall establish a team whose composition meets the definition of an interdisciplinary team in Code of Federal Regulations, title 42, section 483.440. The provider shall invite a representative of the county agency where the facility is located to be a member of the admission review team.\n(a) The determination of the team to admit a person to the facility must include, but is not limited to, consideration of the following:\n(1) the preferences of the person and the person's guardian or family for services of an intermediate care facility for persons with developmental disabilities;\n(2) the ability of the provider to meet the needs of the person according to the person's individual service plan and the admission criteria established by the provider;\n(3) the availability of a bed in the facility and of nonresidential services required by the person as specified in the person's individual service plan; and\n(4) the need of the person for the services in the facility to prevent placement of the person in a more restrictive setting.\n(b) When there is more than one qualified person applying for admission to the facility, the admission review team shall determine which applicant shall be offered services first, using the criteria established in this subdivision. The admission review team shall document the factors that resulted in the decision to offer services to one qualified person over another. In cases of emergency, a review of the admission by the admission review team must occur within the first 14 days of placement.\nThe provider must establish admission criteria based on the level of service that can be provided to persons seeking admission to that facility and must provide the admission review team with the following information:\n(1) a copy of the admission and level of care criteria adopted by the provider; and\n(2) a written description of the services that are available to the person seeking admission, including day services, professional support services, emergency services, available direct care staffing, supervisory and administrative supports, quality assurance systems, and criteria established by the provider for discharging persons from the facility.\nWhen a county agency decides to establish admission review teams for the intermediate care facilities for persons with developmental disabilities located in the county, the county agency shall notify the providers of the county agency's intent at least 60 days prior to establishing the teams.",
	"repealed": false
}