{
	"id": "48A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.08",
	"title": "48A.08 INCIDENTAL INVESTMENTS, POWERS, AND LIMITATIONS.",
	"text": "A trust company, or a bank that holds a certificate as provided in section 48.37, may exercise the powers and privileges set forth in this section.\n(a) The bank or trust company may acquire, use, and improve, and for that purpose mortgage, lease, sell, and convey, real and personal property that is necessary for the transaction of its business.\n(b) The bank or trust company may sell or continue to hold and use for its interests or those of the estate or trust to which it belongs an estate or interest in real estate that the bank or trust company acquires through foreclosure of a mortgage, trust deed, or other security, or by the settlement of an obligation or otherwise in the course of its business.\n(c) The bank or trust company may become the purchaser at a foreclosure or judicial sale to which it is a party as trustee or otherwise.\n(d) The bank or trust company may accept or make a deed, mortgage, or other instrument necessary for the transaction of its business. It may loan money and secure the loans by mortgage, trust deed or pledge, and/or purchase. It may sell and assign notes, bonds, mortgages, and other evidences of indebtedness, and securities, and convert them into cash or into other authorized securities, or securities and property not expressly prohibited by this chapter.\n(e) The investment of funds owned by the trust company, as distinguished from funds held by it in trust, are restricted to authorized securities.\n(f) The bank or trust company may guarantee a title to securities sold and transferred by it.\n(g) The bank or trust company may become sole surety upon a bond. For trust companies organized after April 10, 1965, the bond must pertain to its own fiduciary activities.\n(h) The bank or trust company may maintain and operate safe deposit vaults.\n(i) The bank or trust company shall not invest its capital or surplus in real estate except as authorized. It shall not invest deposits, trust funds, or property except as authorized, or under or by virtue of an express contract, judgment, or other instrument conferring or imposing special power and authority so to do.\nThe bank or trust company is subject at all times to the orders, judgments, and decrees of a court of record from which it has accepted a trust, appointment, or commission as to the trust. It shall provide to the court itemized and verified accounts, statements, and reports required by law, or as the court orders as to a particular trust. The bank or trust company is subject to the general jurisdiction and authority of the district court of the county of its principal place of business.",
	"repealed": false
}