{
	"id": "390.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.005",
	"title": "390.005 ELECTION OR APPOINTMENT, ELIGIBILITY; VACANCIES; REMOVAL.",
	"text": "Each county must have a coroner or medical examiner. A coroner may be elected, as prescribed by section 382.01, or appointed in each county. A medical examiner must be appointed by the county board. The term of an appointed coroner or medical examiner must not be longer than four years.\nThe board of county commissioners may, by resolution, state its intention to fill the office of coroner by appointment. The resolution must be adopted at least six months before the end of the term of the incumbent coroner, if elected. After the resolution is adopted, the board shall fill the office by appointing a person not less than 30 days before the end of the incumbent's term. The appointed coroner shall serve for a term of office determined by the board beginning upon the expiration of the term of the incumbent. The term must not be longer than four years.\nIf there is a vacancy in the elected office, the board may by resolution, state its intention to fill the office by appointment. When the resolution is adopted, the board shall fill the office by appointment immediately. The coroner shall serve for a term determined by the board. The term must not be longer than four years.\n(a) The medical examiner must be a forensic pathologist who is certified or eligible for certification by the American Board of Pathology. The medical examiner is an appointed public official in a system of death investigation in which the administrative control, the determination of the extent of the examination, need for autopsy, and the filing of the cause and manner of death information with the state registrar pursuant to section 144.221 are all under the control of the medical examiner.\n(b) The coroner must be a physician with a valid license in good standing under chapter 147, to practice medicine as defined under section 147.081, subdivision 3. The coroner is a public official, elected or appointed, whose duty is to make inquiry into deaths in certain categories, determine the cause and manner of death, and file the information with the state registrar pursuant to section 144.221. The coroner must obtain additional training in medicolegal death investigation, such as training by the American Board of Medicolegal Death Investigators, within four years of taking office, unless the coroner has already obtained this training.\n(c) The coroner or medical examiner need not be a resident of the county.\nAn incumbent coroner or medical examiner in office on July 1, 2006, is hereby deemed to meet the qualifications prescribed by this section for the purpose of continuance in the office of coroner until the end of the current term of office, after which this statute will apply.\nVacancies in the office of coroner or medical examiner shall be filled according to sections 375.08 and 382.02, or under subdivision 1. The medical examiner or appointed coroner may be removed by the county board during a term of office for cause shown after a hearing upon due notice of written charges. The hearing shall be conducted in accordance with that county's human resources policy.\nEvery coroner or medical examiner in office on or after July 1, 2015, shall maintain and make publicly available, a statement of policy or principles to be used for communicating with families during a death investigation.",
	"repealed": false
}