{
	"id": "62S.266",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.266",
	"title": "62S.266 NONFORFEITURE BENEFIT REQUIREMENT.",
	"text": "This section does not apply to life insurance policies or riders containing accelerated long-term care benefits.\n(a) An insurer must offer each prospective policyholder a nonforfeiture benefit in compliance with the following requirements:\n(1) a policy or certificate offered with nonforfeiture benefits must have coverage elements, eligibility, benefit triggers, and benefit length that are the same as coverage to be issued without nonforfeiture benefits. The nonforfeiture benefit included in the offer must be the benefit described in subdivision 5; and\n(2) the offer must be in writing if the nonforfeiture benefit is not otherwise described in the outline of coverage or other materials given to the prospective policyholder.\n(b) When a group long-term care insurance policy is issued, the offer required in paragraph (a) shall be made to the group policyholder. However, if the policy is issued as group long-term care insurance as defined in section 62S.01, subdivision 15, clause (4), other than to a continuing care retirement community or other similar entity, the offering shall be made to each proposed certificate holder.\nIf the offer required to be made under subdivision 2 is rejected, the insurer shall provide the contingent benefit upon lapse described in this section.\n(a) After rejection of the offer required under subdivision 2, for individual and group policies without nonforfeiture benefits issued after July 1, 2001, the insurer shall provide a contingent benefit upon lapse.\n(b) If a group policyholder elects to make the nonforfeiture benefit an option to the certificate holder, a certificate shall provide either the nonforfeiture benefit or the contingent benefit upon lapse.\n(c) The contingent benefit on lapse must be triggered every time an insurer increases the premium rates to a level which results in a cumulative increase of the annual premium equal to or exceeding the percentage of the insured's initial annual premium based on the insured's issue age provided in this paragraph, and the policy or certificate lapses within 120 days of the due date of the premium increase. Unless otherwise required, policyholders shall be notified at least 30 days prior to the due date of the premium reflecting the rate increase.\n(d) A contingent benefit on lapse must also be triggered for policies with a fixed or limited premium paying period every time an insurer increases the premium rates to a level that results in a cumulative increase of the annual premium equal to or exceeding the percentage of the insured's initial annual premium set forth below based on the insured's issue age, the policy or certificate lapses within 120 days of the due date of the premium so increased, and the ratio in paragraph (f), clause (2), is 40 percent or more. Unless otherwise required, policyholders shall be notified at least 30 days prior to the due date of the premium reflecting the rate increase.\nThis provision shall be in addition to the contingent benefit provided by paragraph (c) and where both are triggered, the benefit provided must be at the option of the insured.\n(e) On or before the effective date of a substantial premium increase as defined in paragraph (c), the insurer shall:\n(1) offer to reduce policy benefits provided by the current coverage without the requirement of additional underwriting so that required premium payments are not increased;\n(2) offer to convert the coverage to a paid-up status with a shortened benefit period according to the terms of subdivision 5. This option may be elected at any time during the 120-day period referenced in paragraph (c); and\n(3) notify the policyholder or certificate holder that a default or lapse at any time during the 120-day period referenced in paragraph (c) is deemed to be the election of the offer to convert in clause (2).\n(f) On or before the effective date of a substantial premium increase as defined in paragraph (d), the insurer shall:\n(1) offer to reduce policy benefits provided by the current coverage without the requirement of additional underwriting so that required premium payments are not increased;\n(2) offer to convert the coverage to a paid-up status where the amount payable for each benefit is 90 percent of the amount payable in effect immediately prior to lapse times the ratio of the number of completed months of paid premiums divided by the number of months in the premium paying period. This option may be elected at any time during the 120-day period referenced in paragraph (d); and\n(3) notify the policyholder or certificate holder that a default or lapse at any time during the 120-day period referenced in paragraph (d) shall be deemed to be the election of the offer to convert in clause (2) if the ratio is 40 percent or more.\n(a) Benefits continued as nonforfeiture benefits, including contingent benefits upon lapse, must be as described in this subdivision.\n(b) For purposes of this subdivision, \"attained age rating\" is defined as a schedule of premiums starting from the issue date which increases with age at least one percent per year prior to age 50, and at least three percent per year beyond age 50.\n(c) For purposes of this subdivision, the nonforfeiture benefit must be of a shortened benefit period providing paid-up, long-term care insurance coverage after lapse. The same benefits, amounts, and frequency in effect at the time of lapse, but not increased thereafter, will be payable for a qualifying claim, but the lifetime maximum dollars or days of benefits must be determined as specified in paragraph (d).\n(d) The standard nonforfeiture credit will be equal to 100 percent of the sum of all premiums paid, including the premiums paid prior to any changes in benefits. The insurer may offer additional shortened benefit period options, so long as the benefits for each duration equal or exceed the standard nonforfeiture credit for that duration. However, the minimum nonforfeiture credit must not be less than 30 times the daily nursing home benefit at the time of lapse. In either event, the calculation of the nonforfeiture credit is subject to the limitation of this subdivision.\n(e) The nonforfeiture benefit must begin not later than the end of the third year following the policy or certificate issue date. The contingent benefit upon lapse must be effective during the first three years as well as thereafter.\n(f) Notwithstanding paragraph (e), for a policy or certificate with attained age rating, the nonforfeiture benefit must begin on the earlier of:\n(1) the end of the tenth year following the policy or certificate issue date; or\n(2) the end of the second year following the date the policy or certificate is no longer subject to attained age rating.\n(g) Nonforfeiture credits may be used for all care and services qualifying for benefits under the terms of the policy or certificate, up to the limits specified in the policy or certificate.\nAll benefits paid by the insurer while the policy or certificate is in premium-paying status and in the paid-up status will not exceed the maximum benefits which would be payable if the policy or certificate had remained in premium-paying status.\nThere must be no difference in the minimum nonforfeiture benefits as required under this section for group and individual policies.\nThis section becomes effective January 1, 2002, and applies as follows:\n(a) Except as provided in paragraph (b), this section applies to any long-term care policy issued in this state on or after January 1, 2002.\n(b) For certificates issued on or after January 1, 2002, under a group long-term care insurance policy that was in force on January 1, 2002, the provisions of this section do not apply.\nPremiums charged for a policy or certificate containing nonforfeiture benefits or a contingent benefit on lapse are subject to the loss ratio requirements of section 62A.48, subdivision 4, or 62S.26, treating the policy as a whole, except for policies or certificates that are subject to sections 62S.021, 62S.081, and 62S.265 and that comply with those sections.\nTo determine whether contingent nonforfeiture upon lapse provisions are triggered under subdivision 4, paragraph (c) or (d), a replacing insurer that purchased or otherwise assumed a block or blocks of long-term care insurance policies from another insurer shall calculate the percentage increase based on the initial annual premium paid by the insured when the policy was first purchased from the original insurer.\nA nonforfeiture benefit for qualified long-term care insurance contracts that are level premium contracts must be offered that meets the following requirements:\n(1) the nonforfeiture provision must be appropriately captioned;\n(2) the nonforfeiture provision must provide a benefit available in the event of a default in the payment of any premiums and must state that the amount of the benefit may be adjusted subsequent to being initially granted only as necessary to reflect changes in claims, persistency, and interest as reflected in changes in rates for premium paying contracts approved by the commissioner for the same contract form; and\n(3) the nonforfeiture provision must provide at least one of the following:\n(i) reduced paid-up insurance;\n(ii) extended term insurance;\n(iii) shortened benefit period; or\n(iv) other similar offerings approved by the commissioner.",
	"repealed": false
}