{
	"id": "474A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.02",
	"title": "474A.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section shall have the meanings given them.\n\"Aggregate bond limitation\" means up to 55 percent of the reasonably expected aggregate basis of a residential rental project and the land on which the project is or will be located.\n\"AMI\" means the area median income for the applicable county or metropolitan area as published by the Department of Housing and Urban Development, as adjusted for household size.\n\"Annual volume cap\" means the aggregate dollar amount of obligations constituting \"private activity bonds\" under federal tax law and bearing interest excluded from gross income for purposes of federal income taxation which, under the provisions of federal tax law, may be issued in one year by issuers. The commissioner shall administer the volume cap allocations for obligations permitted under the federal American Recovery and Reinvestment Act of 2009, whether taxable or tax-exempt, in accordance with orders of the commissioner.\n\"Bonding authority\" means all or a portion of the annual volume cap.\n\"Carryforward\" means the ability to issue obligations in a year subsequent to the year in which an allocation of bonding authority was obtained under this chapter as provided in section 146(f) of federal tax law.\nMS 1987 Supp [Repealed, 1986 c 465 art 1 s 32]\n\"City\" means a statutory or home rule charter city.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\n\"Commissioner\" means the commissioner of management and budget.\n\"Department\" means the Department of Management and Budget.\n\"Entitlement issuer\" means an issuer to which an allocation is made under section 474A.03, subdivision 2a.\n\"Federal tax law\" means those provisions of the Internal Revenue Code of 1986, as amended, that limit the aggregate amount of obligations of a specified type or types which may be issued by an issuer during a calendar year whose interest is excluded from gross income for purposes of federal income taxation.\n\"Housing pool\" means the amount of the annual volume cap allocated under section 474A.061 which is available for mortgage credit certificates or the issuance of residential rental project bonds or mortgage bonds.\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\n\"Issuer\" means any entitlement issuer, state issuer, or other issuer.\n\"LIHTC\" means low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\n\"Small issue pool\" means the amount of the annual volume cap allocated under section 474A.061, that is available for the issuance of enterprise zone facility bonds authorized under Public Law 103-66, section 13301, small issue bonds to finance manufacturing projects, the agricultural development bond beginning farmer and agricultural business enterprise loan program authorized in sections 41C.01 to 41C.13, and student loan bonds issued by the Minnesota Office of Higher Education.\n\"Manufacturing project\" means any facility which is used in the manufacturing or production of tangible personal property, including the processing resulting in a change in the condition of the property, or in the manufacturing, creation, or production of intangible property, including any patent, copyright, formula, process, design, know-how, format, or other similar item.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\nMS 1987 Supp [Repealed, 1986 c 465 art 1 s 32]\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\n\"Notice of entitlement allocation\" means a notice provided to an entitlement issuer under section 474A.04, subdivision 5.\n\"Other issuer\" means an entity other than an entitlement issuer or state issuer which may issue obligations subject to an annual volume cap, including the University of Minnesota, a city, town, federally recognized American Indian tribe or subdivision located in Minnesota, housing and redevelopment authority referred to in sections 469.001 to 469.047, or a body authorized to exercise the powers of a housing and redevelopment authority, a port authority referred to in sections 469.048 to 469.089, or a body authorized to exercise the powers of a port authority, an economic development authority referred to in sections 469.090 to 469.108, an area or municipal redevelopment agency referred to in sections 469.109 to 469.123, a county, or municipal authority or agency established under special law, or an entity issuing on behalf of the foregoing.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\nObligations are \"permanently issued\" if either (1) the obligations have been issued under terms and conditions such that the proceeds are available for the purpose for which they were issued, or (2) ten percent of the proceeds of the obligations, excluding costs of issuance, have been disbursed for the purpose for which they were issued.\n\"Preliminary resolution\" means a resolution adopted by the governing body or board of the issuer, or by the commissioner of Iron Range resources and rehabilitation. The resolution must express a preliminary intention of the issuer to issue obligations for a specific project, identify the proposed project, and disclose the proposed amount of qualified bonds to be issued. Preliminary resolutions for mortgage bonds and student loan bonds need not identify a specific project.\n\"Preservation project\" means any residential rental project, regardless of whether or not the project is restricted to persons of a certain age or older, that is expected to generate low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended, and (1) receives federal project-based rental assistance, or (2) is funded through a loan from or guaranteed by the United States Department of Agriculture's Rural Development Program. In addition, to qualify as a preservation project, the amount of bonds requested in the application must not exceed the aggregate bond limitation.\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\n\"Public facilities pool\" means the amount of the annual volume cap allocated under section 474A.061, which is available for the issuance of public facility bonds.\n\"Public facilities project\" means a facility, whether publicly or privately owned, that is eligible to be financed with the proceeds of public facilities bonds as defined under section 474A.02, subdivision 23a.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\n\"Qualified bonds\" means the specific type or types of obligations that are subject to the annual volume cap. Qualified bonds include the following types of obligations as defined in federal tax law:\n(a) \"public facility bonds\" means \"exempt facility bonds\" as defined in federal tax law, except for residential rental project bonds. New bonds and other obligations are ineligible to receive state allocations or entitlement authority for public facility projects under this section if they have been issued:\n(1) for the purpose of refinancing, refunding, or otherwise defeasing existing debt; and\n(2) more than one calendar year prior to the date of application;\n(b) \"residential rental project bonds\" which are those obligations issued to finance qualified residential rental projects;\n(c) \"mortgage bonds\";\n(d) \"small issue bonds\" issued to finance manufacturing projects and the acquisition or improvement of agricultural real or personal property under sections 41C.01 to 41C.13;\n(e) \"student loan bonds\" issued by or on behalf of the Minnesota Office of Higher Education;\n(f) \"redevelopment bonds\";\n(g) \"governmental bonds\" with a nonqualified amount in excess of $15,000,000 as set forth in section 141(b)5 of federal tax law; and\n(h) \"enterprise zone facility bonds\" issued to finance facilities located within empowerment zones or enterprise communities, as authorized under Public Law 103-66, section 13301.\n\"Rent\" means the total monthly cost of occupancy payable directly by the tenant and the cost of any utilities, other than telephone. It does not include a charge for a service that is not required as a condition of occupancy.\n\"Single-room occupancy unit\" means an enclosed dwelling space which does not include within the space a separate bedroom and is suitable for occupancy by one individual person capable of independent living.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\n\"State issuer\" means the state of Minnesota; the commissioner of Iron Range resources and rehabilitation; or other agency, department, board, or commission of the state, that is authorized to issue obligations and has statewide jurisdiction.\n\"Unified pool\" means the amount of the annual volume cap allocated under section 474A.091 that is available for the issuance of qualified bonds.\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\nMS 1986 [Repealed, 1987 c 268 art 16 s 45]\n\"30 percent AMI residential rental project\" means a residential rental project that does not otherwise qualify as a preservation project, is expected to generate low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended, from 100 percent of its residential units, and in which:\n(1) all the residential units of the project:\n(i) are reserved for tenants whose income, on average, is 30 percent of AMI or less;\n(ii) are rent-restricted in accordance with section 42(g)(2) of the Internal Revenue Code of 1986, as amended; and\n(iii) are subject to rent and income restrictions for a period of not less than 30 years; or\n(2)(i) is located outside of the metropolitan area as defined in section 473.121, subdivision 2, and within a county or metropolitan area that has a current median area gross income that is less than the statewide area median income for Minnesota;\n(ii) all of the units of the project are rent-restricted in accordance with section 42(g)(2) of the Internal Revenue Code of 1986, as amended; and\n(iii) all of the units of the project are subject to the applicable rent and income restrictions for a period of not less than 30 years.\nIn addition, to qualify as a 30 percent AMI residential project, the amount of bonds requested in the application must not exceed the aggregate bond limitation.\nFor purposes of this subdivision, \"on average\" means the average of the applicable income limitation level for a project determined on a unit-by-unit basis for example, a project with one-half of its units subject to income limitations of not greater than 20 percent AMI and one-half subject to income limitations of not greater than 40 percent AMI would be subject to an income limitation on average of not greater than 30 percent AMI.\n\"50 percent AMI residential rental project\" means a residential rental project that does not qualify as a preservation project or 30 percent AMI residential rental project, is expected to generate low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended, from 100 percent of its residential units, and in which all the residential units of the project:\n(1) are reserved for tenants whose income, on average, is 50 percent of AMI or less;\n(2) are rent-restricted in accordance with section 42(g)(2) of the Internal Revenue Code of 1986, as amended; and\n(3) are subject to rent and income restrictions for a period of not less than 30 years.\nIn addition, to qualify as a 50 percent AMI residential rental project, the amount of bonds requested in the application must not exceed the aggregate bond limitation.\nFor purposes of this subdivision, \"on average\" means the average of the applicable income limitation level for a project determined on a unit-by-unit basis for example, a project with one-half of its units subject to income limitations of not greater than 40 percent AMI and one-half subject to income limitations of not greater than 60 percent AMI would be subject to an income limitation on average of not greater than 50 percent AMI.\n\"100 percent LIHTC project\" means a residential rental project that is expected to generate low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended, from 100 percent of its residential units and does not otherwise qualify as a preservation project, 30 percent AMI residential rental project, or 50 percent AMI residential rental project. In addition, to qualify as a 100 percent LIHTC project, the amount of bonds requested in the application must not exceed the aggregate bond limitation.\n\"20 percent LIHTC project\" means a residential rental project that is expected to generate low-income housing tax credits under section 42 of the Internal Revenue Code of 1986, as amended, from at least 20 percent of its residential units and does not otherwise qualify as a preservation project, 30 percent AMI residential rental project, 50 percent AMI residential rental project, or 100 percent LIHTC project. In addition, to qualify as a 20 percent LIHTC project, the amount of bonds requested in the application must not exceed the aggregate bond limitation.",
	"repealed": false
}