{
	"id": "142A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.43",
	"title": "142A.43 GRANTS-IN-AID TO YOUTH INTERVENTION PROGRAMS.",
	"text": "The commissioner may make grants to nonprofit agencies administering youth intervention programs in communities where the programs are or may be established.\n\"Youth intervention program\" means a nonresidential community-based program providing advocacy, education, counseling, mentoring, and referral services to youth and their families experiencing personal, familial, school, legal, or chemical problems with the goal of resolving the present problems and preventing the occurrence of the problems in the future. The intent of the youth intervention program is to provide an ongoing stable funding source to community-based early intervention programs for youth. Program design may be different for the grantees depending on youth service needs of the communities being served.\nApplications for a grant-in-aid shall be made by the administering agency to the commissioner.\nThe grant-in-aid is contingent upon the agency having obtained from the community in which the youth intervention program is established local matching money equal to the amount of the grant that is sought. The matching requirement is intended to leverage the investment of state and community dollars in supporting the efforts of the grantees to provide early intervention services to youth and their families.\nThe commissioner shall provide the application form, procedures for making application form, criteria for review of the application, and kinds of contributions in addition to cash that qualify as local matching money. No grant to any agency may exceed $75,000.\nUp to five percent of the appropriations to the grants-in-aid to the youth intervention program may be used for a grant to the Minnesota Youth Intervention Programs Association for expenses in providing collaboration, program development, professional development training, technical assistance, tracking, and analyzing and reporting outcome data for the community-based grantees of the program. The Minnesota Youth Intervention Programs Association is not required to meet the match obligation under subdivision 2.\nOn or before March 31 of each year, the Minnesota Youth Intervention Programs Association shall report to the chairs and ranking minority members of the committees and divisions with jurisdiction over public safety policy and finance on the implementation, use, and administration of the grant program created under this section. The report shall include information sent by agencies administering youth intervention programs to the Minnesota Youth Intervention Programs Association and the Office of Justice Programs. At a minimum, the report must identify:\n(1) the grant recipients;\n(2) the geographic location of the grant recipients;\n(3) the total number of individuals served by all grant recipients, disaggregated by race, ethnicity, and gender;\n(4) the total number of individuals served by all grant recipients who successfully completed programming, disaggregated by age, race, ethnicity, and gender;\n(5) the total amount of money awarded in grants and the total amount remaining to be awarded from each appropriation;\n(6) the amount of money granted to each recipient;\n(7) grantee workplan objectives;\n(8) how the grant was used based on grantee quarterly narrative reports and financial reports; and\n(9) summarized relevant youth intervention program outcome survey data measuring the developmental assets of participants, based on Search Institute's Developmental Assets Framework.\nThe commissioner may use up to ten percent of the biennial appropriation for grants-in-aid to the youth intervention program to pay costs incurred by the department in administering the youth intervention program.",
	"repealed": false
}