{
	"id": "256D.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.425",
	"title": "256D.425 ELIGIBILITY CRITERIA.",
	"text": "A person who is aged, blind, or 18 years of age or older and disabled and who is receiving supplemental security benefits under Title XVI on the basis of age, blindness, or disability (or would be eligible for such benefits except for excess income) is eligible for a payment under the Minnesota supplemental aid program, if the person's net income is less than the standards in section 256D.44. A person who is receiving benefits under the Minnesota supplemental aid program in the month prior to becoming eligible under section 1619(b) of the Social Security Act is eligible for a payment under the Minnesota supplemental aid program while they remain in section 1619(b) status. Persons who are not receiving Supplemental Security Income benefits under Title XVI of the Social Security Act or disability insurance benefits under Title II of the Social Security Act due to exhausting time limited benefits are not eligible to receive benefits under the MSA program. Persons who are not receiving Social Security or other maintenance benefits for failure to meet or comply with the Social Security or other maintenance program requirements are not eligible to receive benefits under the MSA program. Persons who are found ineligible for Supplemental Security Income because of excess income, but whose income is within the limits of the Minnesota supplemental aid program, must have blindness or disability determined by the state medical review team.\n(a) For persons receiving Supplemental Security Income benefits, the resource standards and restrictions for supplemental aid under this section shall be those used to determine eligibility for individuals with a disability in the Supplemental Security Income program.\n(b) For persons not receiving Supplemental Security Income benefits due to excess income or resources, but whose income and resources are within the limits of the Minnesota supplemental aid program, the resource standards shall be those in section 256P.02.\n[Repealed, 1995 c 207 art 5 s 40; 1995 c 248 art 17 s 7]\nTo be eligible for the Minnesota supplemental aid program, applicants and recipients must cooperate with the state and local agency to identify potentially liable third-party payors and assist the state in obtaining third-party payments. Cooperation includes identifying any third party who may be liable for benefits provided under this chapter to the applicant, recipient, or any other family member for whom application is made, and providing relevant information to assist the state in pursuing a potentially liable third party.",
	"repealed": false
}