{
	"id": "168A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.17",
	"title": "168A.17 SECURITY INTEREST.",
	"text": "Unless excepted by section 168A.16, a security interest in a vehicle of a type for which a certificate of title is required is not valid against creditors of the owner or subsequent transferees or secured parties of the vehicle unless perfected as provided in sections 168A.01 to 168A.31.\nNotwithstanding any other provision of sections 168A.01 to 168A.31 or other law, in the case of a lease agreement with respect to a vehicle other than a vehicle used primarily for personal, family, or household purposes, the determination whether the lease agreement constitutes a lease and does not create a conditional sale or security interest shall be governed by the stated intent of the parties set forth in the lease agreement, unless it can be shown by a preponderance of the evidence that the terms of the lease agreement cannot be reconciled with the stated intent. In no event shall the lease agreement be deemed to create a conditional sale or security interest merely because it permits or requires the amount of rental payments to be adjusted upward or downward by reference to the amount realized by the lessor upon sale or disposition of the vehicle.\nA security interest is perfected by the delivery to the department of the existing certificate of title, if any, an application for a certificate of title containing the name and address of the secured party, the date of the secured party's security agreement and the required fee. A security interest is perfected as of the time of the delivery.\nMS 2000 [Repealed, 2001 c 195 art 1 s 25]\nWhen a security interest in a vehicle sold by a dealer licensed under section 168.27 is perfected under subdivision 2, the dealer may provide a statement of perfection to the secured party on a form provided by the department. The statement must certify compliance with subdivision 2 and contain the date of delivery to the department. The information provided in the dealer's statement is considered prima facie evidence of the facts contained in it.",
	"repealed": false
}