{
	"id": "13B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/13B.01",
	"title": "13B.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given them.\n\"Benefit program\" means a program administered by a public entity or agent of a public entity that provides cash or in-kind assistance in the form of payments, grants, subsidies, loans, loan guarantees, or any other form of financial assistance to individuals.\n\"Front end verification\" means a computerized procedure operated by a public entity that checks the accuracy and truthfulness of data provided by an individual as part of an application with the public entity.\n\"Government data\" has the meaning given the term in section 13.02, subdivision 7.\n\"Individual\" has the meaning given the term in section 13.02, subdivision 8.\n\"Law enforcement agency\" means an agency of the state, a political subdivision, or the University of Minnesota with the power to conduct criminal investigations or make arrests or an attorney authorized by law to prosecute or participate in the prosecution of criminal offenses.\n\"Matching program\" means a computerized comparison of government data to government or nongovernment data for use by a public entity for purposes of determining the eligibility of individuals for a license, privilege, benefit program, or employment. Matching program does not include a comparison performed:\n(1) by a public entity if all data used in the comparison are government data of one responsible authority within the public entity, other than personnel or payroll data;\n(2) by a law enforcement agency after initiation of a law enforcement investigation for gathering evidence for a law enforcement proceeding against an identified individual;\n(3) to produce aggregate statistical data without data that identify individuals in the final product; or\n(4) to support a research or statistical project, the specific data of which may not be used to make decisions concerning the rights, benefits, or privileges of specific individuals.\n\"Public entity\" means a state agency or statewide system as those terms are defined in section 13.02.\n\"Responsible authority\" has the meaning given in section 13.02, subdivision 16.",
	"repealed": false
}