{
	"id": "197.455",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.455",
	"title": "197.455 VETERANS PREFERENCE APPLIED.",
	"text": "(a) This section shall govern preference of a veteran under the civil service laws, charter provisions, ordinances, rules or regulations of a county, home rule charter or statutory city, town, school district, or other municipality or political subdivision of this state. Any provision in a law, charter, ordinance, rule or regulation contrary to the applicable provisions of this section is void to the extent of such inconsistency.\n(b) Sections 197.46 to 197.481 also apply to a veteran who is an incumbent in a classified appointment in the state civil service and has completed the probationary period for that position, as defined under section 43A.16. In matters of dismissal from such a position, a qualified veteran has the irrevocable option of using the procedures described in sections 197.46 to 197.481, or the procedures provided in the collective bargaining agreement applicable to the person, but not both. For a qualified veteran electing to use the procedures of sections 197.46 to 197.481, the matters governed by those sections must not be considered grievances under a collective bargaining agreement, and if a veteran elects to appeal the dispute through those sections, the veteran is precluded from making an appeal under the grievance procedure of the collective bargaining agreement.\n(c) A county, home rule charter or statutory city, town, school district, or other municipality or political subdivision may require a veteran to complete an initial hiring probationary period, as defined under section 43A.16. In matters of dismissal, a veteran employed by a county, home rule charter or statutory city, town, school district, or other municipality or political subdivision is entitled to the same rights and legal protections that state employees receive under paragraph (b).\nRecognizing that training and experience in the military services of the government and loyalty and sacrifice for the government are qualifications of merit which cannot be readily assessed by examination, a veteran's preference shall be available to a veteran as defined in section 197.447.\n[Repealed, 2005 c 95 s 1; 2005 c 156 art 4 s 12]\nThere shall be added to the competitive open examination rating of a nondisabled veteran, who so elects, a credit of ten points provided that the veteran obtained a passing rating on the examination without the addition of the credit points.\nThere shall be added to the competitive open examination rating of a disabled veteran, who so elects, a credit of 15 points provided that the veteran obtained a passing rating on the examination without the addition of the credit points. There shall be added to the competitive promotional examination rating of a disabled veteran, who so elects, a credit of five points provided that (1) the veteran obtained a passing rating on the examination without the addition of the credit points; and (2) the veteran is applying for a first promotion after securing public employment.\n(a) Any public school under the state's Education Code that chooses at any time to use a 100-point hiring method to evaluate applicants for teaching positions is subject to the requirements of subdivisions 4 and 5 for determining veterans preference points.\n(b) Any public school under the state's Education Code opting at any time not to use a 100-point hiring method to evaluate applicants for teaching positions is exempt from the requirements of subdivisions 4 and 5 for determining veterans preference points, but must instead grant to any veteran who applies for a teaching position and who has proper licensure for that position an interview for that position.\nFor the purpose of the preference to be used in securing appointment from a competitive open examination, \"disabled veteran\" means a person who has a compensable service-connected disability as adjudicated by the United States Veterans Administration, or by the retirement board of one of the several branches of the armed forces, which disability is existing at the time preference is claimed. For purposes of the preference to be used in securing appointment from a competitive promotional examination, \"disabled veteran\" means a person who, at the time of election to use a promotional preference, is entitled to disability compensation under laws administered by the Veterans Administration for a permanent service-connected disability rated at 50 percent or more.\nA preference available pursuant to this section may be used by the surviving spouse of a deceased veteran and by the spouse of a disabled veteran who because of the disability is unable to qualify.\nAn eligible with a rating augmented by veteran's preference shall be entered on an eligible list ahead of a nonveteran with the same rating.\nA governmental agency, when notifying eligibles that they have passed examinations, shall show the final examination ratings and preference credits and shall notify eligibles that they may elect to use veteran's preference to augment passing ratings.\nIf the appointing authority rejects a certified eligible who has received veteran's preference, the appointing authority shall notify the eligible in writing of the reasons for the rejection and file the notice with the appropriate local personnel officer.",
	"repealed": false
}