{
	"id": "257E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/257E.10",
	"title": "257E.10 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given.\n\"Assisted reproduction\" means a method of causing pregnancy other than sexual intercourse. The term includes:\n(1) intrauterine, intracervical, or vaginal insemination;\n(2) donation of gametes;\n(3) donation of embryos;\n(4) in vitro fertilization and transfer of embryos; and\n(5) intracytoplasmic sperm injection.\nAssisted reproduction does not include a pregnancy under a surrogacy agreement, the pregnancy of a surrogate, the transfer of an embryo to a surrogate, or when a child is conceived pursuant to a surrogacy agreement. For purposes of this subdivision, \"surrogate\" means an individual who agrees to become pregnant but who does not intend to be legally bound as a parent of the child.\n\"Birth\" includes fetal deaths reportable under section 144.222.\n\"Determination of parentage\" means the establishment of a parent-child relationship by a judicial proceeding or signing of a valid recognition of parentage under section 257.75.\n\"Donor\" means an individual who provides gametes intended for use in assisted reproduction, whether or not for consideration. The term does not include a parent or an intended parent.\n\"Gamete\" means a sperm or an egg.\n\"Genetic testing\" means an analysis of genetic markers to identify or exclude a genetic relationship.\n\"Intended parent\" means an individual, married or unmarried, who manifests an intent to be legally bound as a parent of a child conceived by assisted reproduction.\n\"Parent\" means an individual who is the legal parent of a child under the laws of the state.\n\"Parentage\" or \"parent-child relationship\" means the legal relationship between a child and a parent of the child.\n\"Presumed parent\" means an individual who under sections 257.51 to 257.74 is presumed to be a parent of a child, unless the requirements of section 257.57, subdivision 2, are met; the presumption is overcome in a judicial proceeding; a valid denial of parentage is made under this chapter; or a court adjudicates the individual to be a parent.\n\"Transfer\" means a procedure for assisted reproduction by which an embryo or sperm is placed in the body of the individual who will give birth to the child.",
	"repealed": false
}