{
	"id": "375A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.04",
	"title": "375A.04 EFFECT OF COUNTY MANAGER AND ELECTED EXECUTIVE PLANS.",
	"text": "In any county which has adopted either the elected executive or county manager plan there shall be no community health board as defined in section 145A.02, subdivision 5, library board, park board, hospital board, nursing committee, extension committee, welfare board, community mental health board, day care center board, sheltered workshop board or nursing home board if there be any in the county, or any other administrative board, committee or commission, except for the administration of a function jointly with another political subdivision. The county board shall itself be and perform the duties and exercise the powers of each board, committee or commission enumerated in this subdivision and shall govern and administer the functions of such boards, committees and commissions as fully as other county functions for the administration of which no independent boards, committees or commissions are authorized by statute for counties generally. The county board at its discretion may create boards or commissions to advise the county board with respect to any county function or activity or to investigate any subject of interest to the county. Any such boards, committees or commissions in existence in any county when either the elected executive or county manager plan is adopted shall continue to operate in all respects as formerly until the election and qualification of the first elected county executive or the qualification of the first county manager, at which time they shall cease to exist and their powers shall be vested in the county board. Any existing civil service commission shall not be affected by the change. After abandonment of either the elected executive or county manager plans any board, committee or commission authorized by statute in counties generally may be established as provided by law.\nNotwithstanding other provisions of law to the contrary, when a county has adopted either the elected executive or county manager plan, the offices of county auditor, county treasurer, and county recorder are abolished and the offices of county coroner and county surveyor shall be made appointive, unless the changes here enumerated have previously been accomplished or the office in question has been abolished or terminated. Each of the officers whose office has been made appointive shall serve until the officer's term of office expires, or upon the expiration of the officer's present term until the successor is appointed and qualifies. Each of the officers whose office has been abolished shall serve as the head of any department created to perform the functions formerly performed by this office until the end of the officer's term or the first Monday in January following the next general election after the adoption of the elected executive or county manager plan, whichever occurs first.",
	"repealed": false
}