{
	"id": "290.0123",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0123",
	"title": "290.0123 STANDARD DEDUCTION.",
	"text": "A taxpayer's standard deduction equals:\n(1) for a married joint filer or a surviving spouse, $27,650;\n(2) for a head of household filer, $20,800; or\n(3) for any other filer, one-half the amount in clause (1); plus\n(4) the additional amount for the taxpayer under subdivision 2.\nA taxpayer's standard deduction amount is reduced in accordance with subdivision 5.\n(a) The additional amount equals the sum of the following amounts:\n(1) $1,450 if the taxpayer has attained age 65 before the close of the taxable year or $1,850 for such a taxpayer who is not married or a surviving spouse;\n(2) $1,450 for the spouse of the taxpayer if the spouse has attained the age of 65 before the close of the taxable year and qualifies for an exemption under section 151(b) of the Internal Revenue Code;\n(3) $1,450 if the taxpayer is blind at the close of the taxable year or $1,850 for such a taxpayer who is not married or a surviving spouse; and\n(4) $1,450 for the spouse of the taxpayer if the spouse is blind as of the close of the taxable year and qualifies for an exemption under section 151(b) of the Internal Revenue Code.\n(b) The commissioner must disregard section 151(d)(5) of the Internal Revenue Code when determining if the taxpayer's spouse is eligible for an exemption under paragraph (a).\nFor an individual who is a dependent, as defined in sections 151 and 152 of the Internal Revenue Code, of another taxpayer for a taxable year beginning in the calendar year in which the individual's taxable year begins, the standard deduction for that individual is limited to the greater of:\n(1) $1,200; or\n(2) the lesser of: (i) the sum of $350 and that individual's earned income; or (ii) the standard deduction amount allowed under subdivision 1, clause (3).\nThe standard deduction is zero for: (1) a married individual filing a separate return if either spouse itemizes deductions; (2) an individual making a return for a period of less than twelve months on account of changes in the annual accounting period; and (3) a nonresident alien individual, except as allowed under a United States income tax treaty.\n(a) The standard deduction of a taxpayer with adjusted gross income over $220,650 is reduced by the lesser of:\n(1) three percent of the excess of the taxpayer's adjusted gross income over $220,650 but not over $304,970; plus ten percent of the taxpayer's adjusted gross income over $304,970; or\n(2) 80 percent of the standard deduction otherwise allowable under this section.\n(b) Notwithstanding paragraph (a), for a taxpayer with adjusted gross income over $1,000,000, the standard deduction is reduced by 80 percent of the standard deduction otherwise allowable under this section.\n(c) For a married individual filing a separate return, the reduction under paragraph (a) must be calculated using one-half of the adjusted gross income amounts specified in that paragraph.\nFor taxable years beginning after December 31, 2023, the commissioner must adjust for inflation the standard deduction amounts in subdivision 1, the additional amounts in subdivision 2, the amounts in subdivision 3, and the adjusted gross income amounts in subdivision 5 as provided in section 270C.22. The statutory year is taxable year 2023. The amounts as adjusted must be rounded down to the nearest $50 amount. The standard deduction amount for married individuals filing separate returns is one-half of the adjusted amount for married individuals filing joint returns.",
	"repealed": false
}