{
	"id": "299A.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.292",
	"title": "299A.292 OFFICE OF DRUG POLICY AND VIOLENCE PREVENTION.",
	"text": "The Office of Drug Policy and Violence Prevention is an office in the Department of Public Safety, headed by the commissioner. The commissioner may appoint other employees. The commissioner shall coordinate the violence prevention activities and the prevention and supply reduction activities of state and local agencies and use the resources of the office to conduct activities related to crime prevention and enforcement as deemed necessary.\n(a) The commissioner shall:\n(1) gather, develop, and make available throughout the state information and educational materials on preventing and reducing violence in the family and in the community, both directly and by serving as a clearinghouse for information and educational materials from schools, state and local agencies, community service providers, and local organizations;\n(2) foster collaboration among schools, state and local agencies, community service providers, and local organizations that assist in violence intervention or prevention;\n(3) assist schools, state and local agencies, service providers, and organizations, on request, with training and other programs designed to educate individuals about violence and reinforce values that contribute to ending violence;\n(4) after consulting with all state agencies involved in preventing or reducing violence within the family or community, develop a statewide strategy for preventing and reducing violence that encompasses the efforts of those agencies and takes into account all money available for preventing or reducing violence from any source;\n(5) submit the strategy to the governor by January 15 of each calendar year, along with a summary of activities occurring during the previous year to prevent or reduce violence experienced by children, young people, and their families;\n(6) assist appropriate professional and occupational organizations, including organizations of law enforcement officers, prosecutors, and educators, in developing and operating informational and training programs to improve the effectiveness of activities to prevent or reduce violence within the family or community; and\n(7) take other actions deemed necessary to reduce the incidence of crime.\nThe commissioner also may, through this program, support activities and strategies of the Violent Crime Coordinating Council as specified in section 299A.642.\n(b) The commissioner shall gather and make available information on prevention and supply reduction activities throughout the state, foster cooperation among involved state and local agencies, and assist agencies and public officials in training and other programs designed to improve the effectiveness of prevention and supply reduction activities.\n(c) The commissioner shall coordinate the distribution of funds received by the state of Minnesota through the federal Anti-Drug Abuse Act. The commissioner shall determine recipients of grants under section 299A.33, after consultation with the Chemical Abuse Prevention Resource Council.\n(d) The commissioner shall:\n(1) after consultation with all state agencies involved in prevention or supply reduction activities, develop a state chemical abuse and substance use disorder strategy encompassing the efforts of those agencies and taking into account all money available for prevention and supply reduction activities, from any source;\n(2) submit the strategy to the governor by January 15 of each year, along with a summary of prevention and supply reduction activities during the preceding calendar year;\n(3) assist appropriate professional and occupational organizations, including organizations of law enforcement officers, prosecutors, and educators, in developing and operating informational and training programs to improve the effectiveness of prevention and supply reduction activities;\n(4) provide information, including information on drug trends, and assistance to state and local agencies, both directly and by functioning as a clearinghouse for information from other agencies;\n(5) facilitate cooperation among drug program agencies; and\n(6) in coordination with the Chemical Abuse Prevention Resource Council, review, approve, and coordinate the administration of prevention, criminal justice, and treatment grants.",
	"repealed": false
}