{
	"id": "326B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.48",
	"title": "326B.48 RECIPROCITY WITH OTHER STATES.",
	"text": "(a) The commissioner may enter into reciprocity agreements for personal licenses with another state if approved by the board. Once approved by the board, the commissioner may issue a plumber's license without requiring the applicant to pass an examination provided the applicant:\n(1) submits an application under section 326B.49;\n(2) pays the fee required under section 326B.49; and\n(3) holds a valid comparable license in the state participating in the agreement.\n(b) Agreements are subject to the following:\n(1) The parties to the agreement must administer a statewide licensing program that includes examination and qualifying experience or training comparable to Minnesota's.\n(2) The experience and training requirements under which an individual applicant qualified for examination in the qualifying state must be deemed equal to or greater than required for an applicant making application in Minnesota at the time the applicant acquired the license in the qualifying state.\n(3) The applicant must have acquired the license in the qualifying state through an examination deemed equivalent to the same class of license examination in Minnesota. A lesser class of license may be granted where the applicant has acquired a greater class of license in the qualifying state and the applicant otherwise meets the conditions of this section.\n(4) At the time of application, the applicant must hold a valid license in the qualifying state and have held the license continuously for at least one year before making application in Minnesota.\n(5) An applicant is not eligible for a license under this section if the applicant has failed the same or greater class of license examination in Minnesota, or if the applicant's license of the same or greater class has been revoked or suspended.\n(6) An applicant who has failed to renew a plumber's license for two years or more after its expiration is not eligible for a license under this section.",
	"repealed": false
}