{
	"id": "356.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.311",
	"title": "356.311 COVERAGE BY MORE THAN ONE PLAN.",
	"text": "(a) Any person who has been a member of two or more of the retirement plans listed in paragraph (b) is entitled, when qualified, to an annuity from each fund if:\n(1) the person's combined service in any two or more retirement plans equals or exceeds the vesting requirement of the fund with the longest vesting requirement; and\n(2) the person has not taken a refund from any of the retirement plans.\n(b) This section applies to any defined benefit plan administered by the Minnesota State Retirement System, including the State Patrol Retirement Plan; the Public Employees Retirement Association, including the public employees police and fire plan; the Teachers Retirement Association; and the St. Paul Teachers Retirement Fund Association, except as noted in paragraph (c).\n(c) This section does not apply to plans providing benefits for police officers or firefighters under sections 424A.091 to 424A.096 or the Bloomington Fire Department Relief Association.\n(d) No portion of the service upon which the retirement annuity from one retirement plan is based shall be again used in the computation of a retirement annuity from another plan. The annuity from each plan must be determined under the laws applicable to that plan except that the requirement that a person meet the vesting requirement in any particular plan shall not apply, provided the combined service in any two or more plans equals or exceeds the vesting requirement of the plan with the longest vesting requirement.\n(e) Any deferred annuity payable under this section shall be subject to augmentation under the laws applicable to the deferred annuity.\n(f) Any person to whom an annuity is not payable under this section because the person took a refund from one of the funds shall be entitled to repay the refund in accordance with the laws governing the refund. Upon repayment, the person is entitled to annuities under this section, if the person would otherwise be entitled.",
	"repealed": false
}