{
	"id": "412.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.501",
	"title": "412.501 CITY OF 1,000 MAY HAVE OR CONTINUE PARK BOARD; FORMALITIES.",
	"text": "The council of any city of more than 1,000 population may by ordinance establish a park board and it may by ordinance adopted by unanimous vote of all members of the council abolish any board thus established. Any park board now in existence in any city shall hereafter operate as a park board under this chapter until abolished as provided in this section. The park board shall consist of three, five, seven or nine members as determined by resolution or ordinance of the council, appointed by the mayor with the consent of the council. If the board consists of three members, one member of the original board shall serve for a term of one year, one for a term of two years, and one for a term of three years. If the board consists of five members, one member of the original board shall serve a term of one year, two for a term of two years and two for a term of three years. If the board consists of seven members, two members of the original board shall serve a term of one year, two for a term of two years and three for a term of three years. If the board consists of nine members, three members of the original board shall serve a term of one year, three for a term of two years and three for a term of three years. After the terms of the original board members expire, members shall be appointed for terms of three years. The number of members may be increased or decreased within the permitted three, five, seven or nine members by subsequent resolution or ordinance. The resolution or ordinance shall include a provision for maintaining staggered terms for board members, provided that if the number of members is reduced the reduction shall be effected in such a manner that all incumbent members are permitted to serve their full terms.\nNo action to change the size of the board shall be taken except upon a two-thirds vote of all the members of the city council, and no such action shall be taken until at least three years after establishment of the board or until at least three years after the last resolution or ordinance modifying the size of the board. Vacancies shall be filled for the remainder of the original terms. Each member shall serve until a successor is appointed and qualifies. Members shall serve without compensation unless the council authorizes compensation. Any member may be removed by the mayor with the consent of the council for cause after a hearing. The board shall choose one of its members as chair and may select a secretary either from among its own members or otherwise and fix the secretary's compensation at not to exceed $500 per year. The board may adopt and from time to time amend rules of procedure. It shall make quarterly reports of its activities to the council. The city attorney, if there is one, shall act as attorney for the board. An annual statement of its receipts and disbursements shall be filed with the clerk immediately after the close of the calendar year and shall be included as part of the annual financial report or statement of the clerk in conformity with section 471.697 or 471.698.",
	"repealed": false
}