{
	"id": "156.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.125",
	"title": "156.125 MENTAL EXAMINATION; ACCESS TO MEDICAL DATA.",
	"text": "If the board has probable cause to believe that grounds exist under section 156.081, subdivision 2, clause (3) or (13), against a regulated person, the executive director may authorize the issuance of an order directing the regulated person to submit to a mental or physical examination or substance use disorder evaluation. For the purpose of this section, every regulated person is considered to have consented to submit to a mental or physical examination or substance use disorder evaluation when ordered to do so and to have waived all objections to the admissibility of the examiner's or evaluator's testimony or reports on the grounds that the testimony or reports constitute a privileged communication. An order for examination under this chapter is private data on an individual.\nFailure to submit to or complete an examination or evaluation, unless the failure was due to circumstances beyond the control of the regulated person, constitutes an admission that grounds exist under section 156.081, subdivision 2, clause (3) or (13), against the regulated person, based on the factual specifications in the examination or evaluation order, and may result in an application being denied or, after a contested case hearing as described in this subdivision, a disciplinary order. The only issues to be determined at the hearing are whether the executive director had probable cause to authorize the examination or evaluation order and whether the failure to submit was due to circumstances beyond the control of the regulated person. Neither the record of a proceeding under this subdivision nor the orders entered by the board are admissible, subject to subpoena, or to be used against the regulated person in a proceeding in which the board is not a party.\nIn addition to ordering a physical or mental examination and notwithstanding sections 13.384, 144.291 to 144.298, 144.651, or 595.02, or any other law limiting access to medical or other health records, the board may authorize obtaining data and health records relating to a regulated person without the regulated person's consent if the executive director has probable cause to believe that grounds exist under section 156.081, subdivision 2, clause (3) or (13), against the regulated person. A regulated person, insurance company, health care facility, provider as defined in section 144.291, subdivision 2, paragraph (i), or government agency shall comply with any written request under this subdivision and is not liable in any action for damages for releasing the data requested if the data are released in accordance with a written request made under this subdivision. Information on individuals obtained under this subdivision is investigative data under section 13.41.",
	"repealed": false
}