{
	"id": "34A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/34A.07",
	"title": "34A.07 ADMINISTRATIVE PENALTIES.",
	"text": "(a) In determining the amount of the administrative penalty, the commissioner shall consider the economic gain received by the person allowing or committing the violation, the gravity of the violation in terms of actual or potential damage to human or animal health and the environment, the willfulness of the violation, number of violations, history of past violations, and other factors justice may require, if the additional factors are specifically identified in the inspection report. For a violation after an initial violation, the commissioner shall also consider the similarity of the most recent previous violation and the violation to be penalized, the time elapsed since the last violation, the number of previous violations, and the response of the person to the most recent previous violation identified.\n(b) The commissioner may issue an administrative citation assessing an administrative penalty of up to $1,500 for each violation of this chapter. Each day a violation continues is a separate violation. The citation must describe the nature of the violation, the statute or rule alleged to have been violated, the time for correction, if applicable, and the amount of any proposed fine. The citation must advise the person to notify the commissioner in writing within 20 days, or another time period mutually agreed to by the commissioner and the person subject to the citation, if the person wishes to appeal the citation, and that if the person fails to appeal the citation, the citation is the final order and not subject to further review.\n(c) An administrative penalty may be assessed if the person subject to a written order does not comply with the order in the time provided in the order.\n(a) If a person subject to an administrative penalty fails to pay the penalty, which must be part of a final citation by the commissioner, by 30 days after the final order is issued, the commissioner may commence a civil action for double the assessed penalty plus attorney fees and costs.\n(b) An administrative penalty may be recovered in a civil action in the name of the state brought in the district court of the county where the violation is alleged to have occurred or the district court where the commissioner has an office.",
	"repealed": false
}