{
	"id": "256K.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.10",
	"title": "256K.10 GRANTS FOR PERSONS WITH SERIOUS AND PERSISTENT MENTAL ILLNESS.",
	"text": "The commissioner shall establish a statewide program to assist counties in providing services to persons with serious and persistent mental illness as defined in section 245.462, subdivision 20. The commissioner shall make grants to counties to establish, operate, or contract with private providers to provide services designed to help persons with serious and persistent mental illness remain and function in their own communities. Grants received pursuant to this section may be used to fund community support services programs as specified in section 245.462, subdivision 6, and case management activities that cannot be billed to the medical assistance program under sections 256B.02, subdivision 8, and 256B.0625.\nTo apply for a grant a county board shall submit an application and budget for the use of the money in the form specified by the commissioner. The commissioner shall make grants only to counties whose applications and budgets are approved by the commissioner. A county receiving a grant under this section shall finance at least ten percent of the cost of services for persons with serious and persistent mental illness from local resources, which may include private contributions and federal money.\nThe commissioner shall allocate grants under this section to finance up to 90 percent of each county's costs for services to persons with serious and persistent mental illness. The commissioner shall promulgate permanent rules to govern grant applications, approval of applications, allocation of grants, and maintenance of financial statements by grant recipients. The commissioner shall specify requirements for reports, including quarterly fiscal reports, according to section 256.01, subdivision 2, paragraph (p). The commissioner shall require collection of data and periodic reports as the commissioner deems necessary to demonstrate the effectiveness of the services in helping persons with serious and persistent mental illness remain and function in their own communities.\nFor calendar year 1992 and all subsequent years, the commissioner shall allocate the money appropriated under this section on a calendar year basis. The commissioner may continue to allocate part of the money on a state fiscal year basis for special projects.",
	"repealed": false
}