{
	"id": "157.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.16",
	"title": "157.16 LICENSES REQUIRED; FEES.",
	"text": "A license is required annually for every person, firm, or corporation engaged in the business of conducting a food and beverage service establishment, youth camp, hotel, motel, lodging establishment, public pool, or resort. Any person wishing to operate a place of business licensed in this section shall first make application, pay the required fee specified in this section, and receive approval for operation, including plan review approval. Special event food stands are not required to submit plans. Nonprofit organizations operating a special event food stand with multiple locations at an annual one-day event shall be issued only one license. Application shall be made on forms provided by the commissioner and shall require the applicant to state the full name and address of the owner of the building, structure, or enclosure, the lessee and manager of the food and beverage service establishment, hotel, motel, lodging establishment, public pool, or resort; the name under which the business is to be conducted; and any other information as may be required by the commissioner to complete the application for license. All fees collected under this section shall be deposited in the state government special revenue fund.\nInitial and renewal licenses for all food and beverage service establishments, youth camps, hotels, motels, lodging establishments, public pools, and resorts shall be issued on an annual basis. Any person who operates a place of business after the expiration date of a license or without having submitted an application and paid the fee shall be deemed to have violated the provisions of this chapter and shall be subject to enforcement action, as provided in the Health Enforcement Consolidation Act, sections 144.989 to 144.993. In addition, a penalty of $60 shall be added to the total of the license fee for any food and beverage service establishment operating without a license as a mobile food unit, a seasonal temporary or seasonal permanent food stand, or a special event food stand, and a penalty of $120 shall be added to the total of the license fee for all restaurants, food carts, hotels, motels, lodging establishments, youth camps, public pools, and resorts operating without a license for a period of up to 30 days. A late fee of $360 shall be added to the license fee for establishments operating more than 30 days without a license.\nAn applicant for certification or certification renewal as a food manager must submit to the commissioner a $35 nonrefundable certification fee payable to the Department of Health. The commissioner shall issue a duplicate certificate to replace a lost, destroyed, or mutilated certificate if the applicant submits a completed application on a form provided by the commissioner for a duplicate certificate and pays $20 to the department for the cost of duplication.\n(a) The following fees are required for food and beverage service establishments, youth camps, hotels, motels, lodging establishments, public pools, and resorts licensed under this chapter. Food and beverage service establishments must pay the highest applicable fee under paragraph (d), clause (1), (2), (3), or (4). The license fee for new operators previously licensed under this chapter for the same calendar year is one-half of the appropriate annual license fee, plus any penalty that may be required. The license fee for operators opening on or after October 1 is one-half of the appropriate annual license fee, plus any penalty that may be required.\n(b) All food and beverage service establishments, except special event food stands, and all hotels, motels, lodging establishments, public pools, and resorts shall pay an annual base fee of $165.\n(c) A special event food stand shall pay a flat fee of $55 annually. \"Special event food stand\" means a fee category where food is prepared or served in conjunction with celebrations, county fairs, or special events from a special event food stand as defined in section 157.15.\n(d) In addition to the base fee in paragraph (b), each food and beverage service establishment, other than a special event food stand and a school concession stand, and each hotel, motel, lodging establishment, public pool, and resort shall pay an additional annual fee for each fee category, additional food service, or required additional inspection specified in this paragraph:\n(1) Category 1 establishment, $110. \"Category 1 establishment\" means a fee category that provides one or more of the following items or is one of the listed establishments or facilities:\n(i) serves prepackaged food that is served in the package;\n(ii) serves a continental breakfast such as rolls, coffee, juice, milk, and cold cereal;\n(iii) serves soft drinks, coffee, or nonalcoholic beverages;\n(iv) provides cleaning for eating, drinking, or cooking utensils, when the only food served is prepared off site;\n(v) a food establishment where the method of food preparation meets the definition of a low-risk establishment in section 157.20; or\n(vi) operates as a child care facility licensed under section 142B.05 and Minnesota Rules, chapter 9503.\n(2) Category 2 establishment, $245. \"Category 2 establishment\" means an establishment that is not a Category 1 establishment and is either:\n(i) a food establishment where the method of food preparation meets the definition of a medium-risk establishment in section 157.20; or\n(ii) an elementary or secondary school as defined in section 120A.05.\n(3) Category 3 establishment, $385. \"Category 3 establishment\" means an establishment that is not a Category 1 or Category 2 establishment and is either:\n(i) a food establishment where the method of food preparation meets the definition of a high-risk establishment in section 157.20; or\n(ii) an establishment where 500 or more meals are prepared per day and served at one or more separate locations.\n(4) Other food and beverage service, including food carts, mobile food units, seasonal temporary food stands, and seasonal permanent food stands, $85.\n(5) Lodging per sleeping accommodation unit, $11, including hotels, motels, lodging establishments, and resorts, up to a maximum of $1,100. \"Lodging per sleeping accommodation unit\" means a fee category including the number of guest rooms, cottages, or other rental units of a hotel, motel, lodging establishment, or resort; or the number of beds in a dormitory.\n(6) First public pool, $355; each additional public pool, $200. \"Public pool\" means a fee category that has the meaning given in section 144.1222, subdivision 4.\n(7) First spa, $200; each additional spa, $110. \"Spa pool\" means a fee category that has the meaning given in Minnesota Rules, part 4717.0250, subpart 9.\n(8) Private sewer or water, $60. \"Individual private water\" means a fee category with a water supply other than a community public water supply as defined in Minnesota Rules, chapter 4720. \"Individual private sewer\" means a fee category with an individual sewage treatment system which uses subsurface treatment and disposal.\n(9) Additional food service, $175. \"Additional food service\" means a location at a food service establishment, other than the primary food preparation and service area, used to prepare or serve beverages or food to the public. Additional food service does not apply to school concession stands.\n(10) Additional inspection fee, $250. \"Additional inspection fee\" means a fee to conduct the second inspection each year for elementary and secondary education facility school lunch programs when required by the Richard B. Russell National School Lunch Act.\n(11) HACCP verification, $175. \"HACCP verification\" means an annual fee category for a business that performs one or more specialized process that requires an HACCP plan as required in chapter 31 and Minnesota Rules, chapter 4626.\n(e) A fee for review of construction plans must accompany the initial license application for restaurants, hotels, motels, lodging establishments, resorts, seasonal food stands, and mobile food units. A fee for review of an HACCP plan for specialized processing must be submitted and approved prior to preparing and serving the specialized processed food for human consumption. The fees for construction plan reviews and HACCP plan reviews are as follows:\n(f) When existing food and beverage service establishments, hotels, motels, lodging establishments, resorts, seasonal food stands, and mobile food units are extensively remodeled, a fee must be submitted with the remodeling plans. The fee for this construction plan review is as follows:\n(g) Special event food stands are not required to submit construction or remodeling plans for review.\n(h) Youth camps shall pay an annual single fee for food and lodging as follows:\n(1) camps with up to 99 campers, $325;\n(2) camps with 100 to 199 campers, $550; and\n(3) camps with 200 or more campers, $750.\n(i) A youth camp which pays fees under paragraph (d) is not required to pay fees under paragraph (h).\nEvery person, firm, or corporation that operates a licensed boarding establishment, food and beverage service establishment, seasonal temporary or permanent food stand, special event food stand, mobile food unit, food cart, resort, hotel, motel, or lodging establishment in Minnesota must submit to the commissioner a $40 annual statewide hospitality fee for each licensed activity. The fee for establishments licensed by the Department of Health is required at the same time the licensure fee is due. For establishments licensed by local governments, the fee is due by July 1 of each year.\nEvery food and beverage service establishment, for-profit youth camp, hotel, motel, lodging establishment, public pool, or resort must have the original license posted in a conspicuous place at the establishment.",
	"repealed": false
}