{
	"id": "383B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.49",
	"title": "383B.49 SUPPLEMENTAL RETIREMENT BENEFITS; REDEMPTION OF SHARES.",
	"text": "When requested to do so, in writing, on forms provided by the Minnesota State Retirement System, by a participant, surviving spouse, a guardian of a surviving child or a personal representative, whichever is applicable, the Minnesota State Retirement System shall on behalf of Hennepin County redeem shares in the investments standing in a participant's share account record under the following circumstances and in accordance with the laws and regulations governing the applicable investment:\n(1) A participant who is no longer employed by the county of Hennepin is entitled to receive the cash realized on the redemption of the shares to the credit of the participant's share account record of the person. The participant may request the redemption of all or a portion of the shares in the participant's share account record of the person, but may not request more than one redemption in any one calendar year. If only a portion of the shares in the participant's share account record is requested to be redeemed the person may request to redeem not less than 20 percent of the shares in any one calendar year and the redemption must be completed in no more than five years. The person may select annual redemption in a single lump sum or in monthly payments. An election is irrevocable except that a participant may request an amendment of the election to redeem all of the person's remaining shares. All requests under this paragraph are subject to application to and approval of the Minnesota State Retirement System upon verification by Hennepin County through the county administrator of the recipient's eligibility to redeem funds.\n(2) In the event of the death of a participant leaving a surviving spouse, the surviving spouse is entitled to receive the cash realized on the redemption of all or a portion of the shares in the participant's share account record of the deceased spouse, but in no event may the spouse request more than one redemption in each calendar year. If only a portion of the shares in the participant's share account record is requested to be redeemed, the surviving spouse may request the redemption of not less than 20 percent of the shares in any one calendar year. The surviving spouse may elect annual redemption in a single lump-sum payment or in monthly payments. Redemption must be completed in no more than five years. An election is irrevocable except that the surviving spouse may request an amendment of the election to redeem all of the participant's remaining shares. All requests under this paragraph are subject to application to and approval of the Minnesota State Retirement System upon verification by Hennepin County through the county administrator of the recipient's eligibility to redeem funds. Upon the death of the surviving spouse, any shares remaining in the participant's share account record must be redeemed on behalf of Hennepin County by the Minnesota State Retirement System and the cash realized from the redemption distributed to the estate of the surviving spouse.\n(3) In the event of the death of a participant leaving no surviving spouse, but leaving a minor surviving child or minor surviving children, the guardianship estate of the minor child is, or the guardianship estates of the minor children are, entitled to receive the cash realized on the redemption of all shares to the credit of the participant's share account record of the deceased participant. In the event of minor surviving children, the cash realized must be paid in equal shares to the guardianship estates of the minor surviving children.\n(4) In the event of the death of a participant leaving no surviving spouse and no minor surviving children, the estate of the deceased participant is entitled to receive the cash realized on the redemption of all shares to the credit of the participant's share account record of the deceased participant.",
	"repealed": false
}