{
	"id": "125A.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.48",
	"title": "125A.48 STATE INTERAGENCY AGREEMENT.",
	"text": "(a) The commissioners of children, youth, and families; education; health; and human services must enter into an agreement to implement this section and Part C, Public Law 108-446, and as required by Code of Federal Regulations, title 34, section 303.523, to promote the development and implementation of interagency, coordinated, multidisciplinary state and local early childhood intervention service systems for serving eligible young children with disabilities, birth through age two, and their families and to ensure the meaningful involvement of underserved groups, including children with disabilities from minority, low-income, homeless, and rural families, and children with disabilities who are wards of the state. The agreement must be reviewed annually.\n(b) The state interagency agreement must outline at a minimum the conditions, procedures, purposes, and responsibilities of the participating state and local agencies for the following:\n(1) membership, roles, and responsibilities of a state interagency committee for the oversight of priorities and budget allocations under Part C, Public Law 108-446, and other state allocations for this program;\n(2) child find;\n(3) establishment of local interagency agreements;\n(4) review by a state interagency committee of the allocation of additional state and federal early intervention funds by local agencies;\n(5) fiscal responsibilities of the state and local agencies;\n(6) intra-agency and interagency dispute resolution;\n(7) payor of last resort;\n(8) maintenance of effort;\n(9) procedural safeguards, including mediation;\n(10) complaint resolution;\n(11) quality assurance;\n(12) data collection;\n(13) an annual summary to the state Interagency Coordinating Council regarding conflict resolution activities including disputes, due process hearings, and complaints; and\n(14) other components of the state and local early intervention system consistent with Public Law 108-446.\nWritten materials must be developed for parents, IEIC's, and local service providers that describe procedures developed under this section as required by Code of Federal Regulations, title 34, section 303.",
	"repealed": false
}