{
	"id": "116J.418",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.418",
	"title": "116J.418 OFFICE OF CHILD CARE COMMUNITY PARTNERSHIPS.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Child care\" means the care of children while parents or guardians are at work or absent for another reason.\n(c) \"Local unit of government\" has the meaning given in section 116G.03, subdivision 3.\n(d) \"Office\" means the Office of Child Care Community Partnerships established in subdivision 2, paragraph (a).\n(a) An Office of Child Care Community Partnerships is established within the Department of Employment and Economic Development. The department may employ a director and staff necessary to carry out the office's duties under subdivision 4.\n(b) The purpose of the office is to support child care businesses within the state in order to:\n(1) increase the quantity of quality child care available; and\n(2) improve accessibility to child care for underserved communities and populations.\nThe office shall consist of a director of the Office of Child Care Community Partnerships, as well as any staff necessary to carry out the office's duties under subdivision 4.\nThe office shall have the power and duty to:\n(1) coordinate with state, regional, local, and private entities to promote investment in increasing the quantity of quality child care in Minnesota;\n(2) coordinate with other agencies including but not limited to Minnesota Management and Budget, the Department of Human Services, and the Department of Education to develop, recommend, and implement solutions to increase the quantity of quality child care openings;\n(3) administer the child care economic development grant program and other appropriations to the department for this purpose;\n(4) monitor the child care business development efforts of other states and countries;\n(5) provide support to the governor's Children's Cabinet;\n(6) provide an annual report, as required by subdivision 5; and\n(7) perform any other activities consistent with the office's purpose.\n(a) Beginning January 15, 2024, and each year thereafter, the Office of Child Care Community Partnerships shall report to the legislative committees with jurisdiction over child care policy and finance on the office's activities during the previous year.\n(b) The report shall contain, at a minimum:\n(1) an analysis of the current access to child care within the state;\n(2) an analysis of the current shortage of child care workers within the state;\n(3) a summary of the office's activities;\n(4) any proposed legislative and policy initiatives; and\n(5) any other information requested by the legislative committees with jurisdiction over child care, or that the office deems necessary.\n(c) The report may be submitted electronically and is subject to section 3.195, subdivision 1.",
	"repealed": false
}