{
	"id": "260C.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.125",
	"title": "260C.125 CASE TRANSFER PROCESS.",
	"text": "This section pertains to the transfer of responsibility for the placement and care of an Indian child in out-of-home placement from the responsible social services agency to a tribal title IV-E agency or an Indian tribe in and outside of Minnesota with a title IV-E agreement.\nThe responsible social services agency shall establish and maintain procedures, in consultation with Indian tribes, for the transfer of responsibility for placement and care of a child to a tribal agency. Transfer of a child's case under this section shall not affect the child's title IV-E and Medicaid eligibility.\nIf a child's title IV-E eligibility has not been determined by the responsible social services agency by the time of transfer, it shall be established at the time of the transfer by the responsible social services agency.\nEssential documents and information shall be transferred to a tribal agency, including but not limited to:\n(1) district court judicial determinations to the effect that continuation in the home from which the child was removed would be contrary to the welfare of the child and that reasonable efforts were made to ensure placement prevention and family reunification pursuant to section 260.012;\n(2) documentation related to the child's permanency proceeding under sections 260C.503 to 260C.521;\n(3) documentation from the responsible social services agency related to the child's title IV-E eligibility;\n(4) documentation regarding the child's eligibility or potential eligibility for other federal benefits;\n(5) the child's case plan, developed pursuant to the Social Security Act, United States Code, title 42, sections 675(1) and 675a, including health and education records of the child pursuant to the Social Security Act, United States Code, title 42, section 675(1)(c); and section 260C.212, subdivision 1, and information; and\n(6) documentation of the child's placement setting, including a copy of the most recent provider's license.",
	"repealed": false
}