{
	"id": "273.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.113",
	"title": "273.113 TAX CREDIT FOR PROPERTY IN PROPOSED BOVINE TUBERCULOSIS MODIFIED ACCREDITED ZONE.",
	"text": "For the purposes of this section, the following terms have the meanings given to them:\n(1) \"bovine tuberculosis modified accredited zone\" means the modified accredited zone designated by the Board of Animal Health under section 35.244;\n(2) \"located within\" means that the herd is kept in the area for at least a part of calendar year 2006, 2007, or 2008; and\n(3) \"animal\" means cattle, bison, goats, and farmed Cervidae.\nAgricultural and rural vacant land classified under section 273.13, subdivision 23, located within a bovine tuberculosis modified accredited zone is eligible for a property tax credit equal to the greater of: (1) $5 per acre on the first 160 acres of the property where the herd had been located; or (2) an amount equal to $5 per acre times five acres times the highest number of animals tested on the property for bovine tuberculosis in a whole-herd test as reported by the Board of Animal Health in 2006, 2007, or 2008. The amount of the credit cannot exceed the property tax payable on the property where the herd had been located, excluding any tax attributable to residential structures. To begin to qualify for the tax credit, the owner shall file an application with the county by December 1 of the levy year. The credit must be given for each subsequent taxes payable year until the credit terminates under subdivision 4. The assessor shall indicate the amount of the property tax reduction on the property tax statement of each taxpayer receiving a credit under this section. The credit paid pursuant to this section shall be deducted from the tax due on the property as provided in section 273.1393.\nThe county auditor shall certify to the commissioner of revenue under section 270C.85, subdivision 2, clause (4), the amount of tax lost to the county from the property tax credit under subdivision 2. Any prior year adjustments must also be certified. The commissioner of revenue shall review the certifications to determine their accuracy. The commissioner may make the changes in the certification that are considered necessary or return a certification to the county auditor for corrections. The commissioner shall reimburse each taxing district, other than school districts, for the taxes lost. The payments must be made at the time provided in section 473H.10 for payment to taxing jurisdictions in the same proportion that the ad valorem tax is distributed. Reimbursements to school districts must be made as provided in section 273.1392. The amount necessary to make the reimbursements under this section is annually appropriated from the general fund to the commissioner of revenue.\nThe credits provided under this section cease to be available beginning with taxes payable in the year following the date when the Board of Animal Health has certified that the state is free of bovine tuberculosis.",
	"repealed": false
}