{
	"id": "360.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.071",
	"title": "360.071 BOARD OF ADJUSTMENT.",
	"text": "All airport zoning regulations adopted under sections 360.011 to 360.076 shall provide for a board of adjustment to have and exercise the following powers:\n(1) to hear and decide appeals from any order, requirement, decision, or determination made by the administrative agency in the enforcement of the airport zoning regulations, as provided in section 360.068;\n(2) to hear and decide any special exceptions to the terms of the airport zoning regulations upon which such board may be required to pass under such regulations; and\n(3) to hear and decide specific variances under section 360.067, subdivision 2.\n(a) Where a zoning board of appeals or adjustment already exists, it may be appointed as the board of adjustment. Otherwise, the board of adjustment shall consist of five members, each to be appointed for a term of three years by the authority adopting the regulations and to be removable by the appointing authority for cause, upon written charges and after public hearing. The length of initial appointments may be staggered.\n(b) In the case of a Metropolitan Airports Commission, five members shall be appointed by the commission chair from the area in and for which the commission was created, any of whom may be members of the commission. In the case of an airport owned or operated by the state of Minnesota, the board of commissioners of the county, or counties, in which the airport hazard area is located shall constitute the airport board of adjustment and shall exercise the powers and duties of such board as provided herein.\nThe concurring vote of a majority of the members of the board of adjustment shall be sufficient to reverse any order, requirement, decision, or determination of the administrative agency, or to decide in favor of the applicant on any matter upon which it is required to pass under the airport zoning regulations, or to effect any variation in such regulations.\nThe board shall adopt rules in accordance with the provisions of the ordinance or resolution by which it was created. Meetings of the board shall be held at the call of the chair and at such other times as the board may determine. The chair, or if absent, the acting chair, may administer oaths and compel the attendance of witnesses. All hearings of the board shall be public. The board shall keep minutes of its proceedings, showing the vote of each member upon each question, or, if absent or failing to vote, indicating such fact, and shall keep records of its examinations and other official actions, all of which shall immediately be filed in the office of the board and shall be a public record. Upon their appointment the members of any board of adjustment shall select a chair to act at the pleasure of the board.",
	"repealed": false
}