{
	"id": "297A.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.99",
	"title": "297A.99 LOCAL SALES TAXES.",
	"text": "(a) A political subdivision of this state may impose a general sales tax (1) under section 297A.9915, (2) under section 297A.992, (3) under section 297A.9925, (4) under section 297A.993, (5) if permitted by special law, or (6) if the political subdivision enacted and imposed the tax before January 1, 1982, and its predecessor provision.\n(b) This section governs the imposition of a general sales tax by the political subdivision. The provisions of this section preempt the provisions of any special law:\n(1) enacted before June 2, 1997, or\n(2) enacted on or after June 2, 1997, that does not explicitly exempt the special law provision from this section's rules by reference.\n(c) This section does not apply to or preempt a sales tax on motor vehicles. Beginning July 1, 2019, no political subdivision may impose a special excise tax on motor vehicles unless it is imposed under section 297A.993.\n(d) A political subdivision may not advertise or expend funds for the promotion of a referendum to support imposing a local sales tax and may only spend funds related to imposing a local sales tax to:\n(1) conduct the referendum;\n(2) disseminate information included in the resolution adopted under subdivision 2, but only if the disseminated information includes a list of specific projects and the cost of each individual project;\n(3) provide notice of, and conduct public forums at which proponents and opponents on the merits of the referendum are given equal time to express their opinions on the merits of the referendum;\n(4) provide facts and data on the impact of the proposed local sales tax on consumer purchases; and\n(5) provide facts and data related to the individual programs and projects to be funded with the local sales tax.\nLocal sales taxes are to be used instead of traditional local revenues only for construction and rehabilitation of capital projects when a clear regional benefit beyond the taxing jurisdiction can be demonstrated. Use of local sales tax revenues for local projects decreases the benefits to taxpayers of the deductibility of local property taxes and the state assistance provided through the property tax refund system and increases the fiscal inequities between similar communities.\n(a) Before the governing body of a political subdivision requests legislative approval to impose a local sales tax authorized by a special law, it shall adopt a resolution indicating its approval of the tax. The resolution must include the following information:\n(1) the proposed tax rate;\n(2) a detailed description of no more than five capital projects that will be funded with revenue from the tax;\n(3) documentation of the regional significance of each project, including the share of the economic benefit to or use of each project by persons residing, or businesses located, outside of the jurisdiction;\n(4) the amount of local sales tax revenue that would be used for each project and the estimated time needed to raise that amount of revenue; and\n(5) the total revenue that will be raised for all projects before the tax expires, and the estimated length of time that the tax will be in effect if all proposed projects are funded.\n(b) The jurisdiction seeking authority to impose a local sales tax by special law must submit the resolution in paragraph (a) along with underlying documentation indicating how the benefits under paragraph (a), clause (3), were determined, to the chairs and ranking minority members of the legislative committees with jurisdiction over taxes no later than January 31 of the year in which the jurisdiction is seeking a special law authorizing the tax.\n(c) The special legislation granting local sales tax authority is not required to allow funding for all projects listed in the resolution with the revenue from the local sales tax, but must not include any projects not contained in the resolution.\n(d) For purposes of this section, a \"capital project\" or \"project\" means:\n(1) a single building or structure including associated infrastructure needed to safely access or use the building or structure;\n(2) improvements within a single park or named recreation area; or\n(3) a contiguous trail.\n(a) A political subdivision must receive legislative authority to impose a local sales tax before submitting the tax for approval by voters of the political subdivision. Imposition of a local sales tax is subject to approval by voters of the political subdivision at a general election. The election must be conducted at a general election within the two-year period after the governing body of the political subdivision has received authority to impose the tax. If the authorizing legislation allows the tax to be imposed for more than one project, there must be a separate question approving the use of the tax revenue for each project. Notwithstanding the authorizing legislation, a project that is not approved by the voters may not be funded with the local sales tax revenue and the termination date of the tax set in the authorizing legislation must be reduced proportionately based on the share of that project's cost to the total costs of all projects included in the authorizing legislation.\n(b) The proceeds of the tax must be dedicated exclusively to payment of the construction and rehabilitation costs and associated bonding costs related to the specific capital improvement projects that were approved by the voters under paragraph (a).\n(c) The tax must terminate after the revenues raised are sufficient to fund the projects approved by the voters under paragraph (a).\n(d) After a sales tax imposed by a political subdivision has expired or been terminated, the political subdivision is prohibited from imposing a local sales tax for a period of one year.\n(e) Notwithstanding paragraph (a), if a political subdivision received voter approval to seek authority for a local sales tax at the November 6, 2018, general election and is granted authority to impose a local sales tax before January 1, 2021, the tax may be imposed without an additional referendum provided that it meets the requirements of subdivision 2 and the list of specific projects contained in the resolution does not conflict with the projects listed in the approving referendum.\n(f) If a tax is terminated because sufficient revenues have been raised, any amount of tax collected under subdivision 9, after sufficient revenues have been raised and before the quarterly termination required under subdivision 12, paragraph (a), that is greater than the average quarterly revenues collected over the immediately preceding 12 calendar months must be retained by the commissioner for deposit in the general fund.\n(a) Notwithstanding subdivisions 1, 2, and 3, until after May 31, 2025, a political subdivision may not engage in any of the following activities in connection with imposing a new local sales and use tax or modifying an existing local sales and use tax:\n(1) any activity described in subdivision 1, paragraph (d);\n(2) adopt a resolution; or\n(3) seek voter approval.\n(b) Paragraph (a) does not apply to new local sales and use taxes or modifications to existing local sales and use taxes authorized in May, 2023.\n(c) This subdivision expires June 1, 2025.\n(a) The tax applies to sales taxable under this chapter that occur within the political subdivision.\n(b) Taxable goods or services are subject to a political subdivision's sales tax, if they are sourced to the political subdivision pursuant to section 297A.668.\n(a) The tax rate is as specified in the special law authorization and as imposed by the political subdivision.\n(b) The full political subdivision rate applies to any sales that are taxed at a state rate, and the political subdivision must not have more than one local sales tax rate or more than one local use tax rate. This paragraph does not apply to sales or use taxes imposed on electricity, piped natural or artificial gas, or other heating fuels delivered by the seller, or the retail sale or transfer of motor vehicles, aircraft, watercraft, modular homes, manufactured homes, or mobile homes.\nA compensating use tax applies, at the same rate as the sales tax, on the use, storage, distribution, or consumption of tangible personal property or taxable services.\n(a) All goods or services that are otherwise exempt from taxation under this chapter are exempt from a political subdivision's tax.\n(b) All mobile transportation equipment, and parts and accessories attached to or to be attached to the equipment are exempt, if purchased by a holder of a motor carrier direct pay permit under section 297A.90.\nIf a person paid sales or use tax to another political subdivision of this state on an item subject to tax under this section, a credit applies against the tax imposed under this section. The credit equals the tax the person paid to the other political subdivision for the item.\n(a) The commissioner of revenue shall collect the taxes subject to this section. The commissioner may collect the tax with the state sales and use tax. All taxes under this section are subject to the same penalties, interest, and enforcement provisions as apply to the state sales and use tax.\n(b) A request for a refund of state sales tax paid in excess of the amount of tax legally due includes a request for a refund of the political subdivision taxes paid on the goods or services. The commissioner shall refund to the taxpayer the full amount of the political subdivision taxes paid on exempt sales or use.\n(c) A political subdivision shall incur a legal debt to the state for refunds of local sales taxes made by the commissioner after a tax has terminated when the amount of the refunds exceeds the amount of local sales taxes collected for but not remitted to the political subdivision. The commissioner of revenue shall bill the political subdivision for this difference. The commissioner shall deposit the money in the state treasury and credit it to the general fund.\nThe lowest combined tax rate imposed in the zip code area applies if the area includes more than one tax rate in any level of taxing jurisdictions. If a nine-digit zip code designation is not available for a street address or if a seller is unable to determine the nine-digit zip code designation of a purchaser after exercising due diligence to determine the designation, the seller may apply the rate for the five-digit zip code area. For the purposes of this subdivision, there is a rebuttable presumption that a seller has exercised due diligence if the seller has attempted to determine the nine-digit zip code designation by utilizing software approved by the governing board that makes this designation from the street address and the five-digit zip code of the purchaser. Notwithstanding subdivision 13, this subdivision applies to all local sales taxes without regard to the date of authorization. This subdivision does not apply when the purchased product is received by the purchaser at the business location of the seller.\nThe commissioner shall remit the proceeds of the tax, less refunds and a proportionate share of the cost of collection, at least quarterly, to the political subdivision. The commissioner shall deduct from the proceeds remitted an amount that equals\n(1) the direct and indirect costs of the department to administer, audit, and collect the political subdivision's tax, plus\n(2) the political subdivision's proportionate share of the indirect cost of administering all taxes under this section, plus\n(3) the cost of constructing and maintaining a zip code or geo-code database necessary for local sales tax collections under the Streamlined Sales and Use Tax Agreement in section 297A.995.\nThe initial cost of constructing a database under clause (3) shall be distributed among the cities with a local sales tax based on each city's population. The commissioner shall develop a method for distributing the cost of maintaining the database among the cities with a local sales tax based on the number of boundary changes for each city.\n(a) A political subdivision may impose a tax under this section starting only on the first day of a calendar quarter. A political subdivision may repeal a tax under this section stopping only on the last day of a calendar quarter.\n(b) The political subdivision shall notify the commissioner of revenue at least 90 days before imposing, changing the rate of, or repealing a tax under this section.\n(c) The political subdivision shall change the rate of tax imposed under this section starting only on the first day of a calendar quarter, and only after the commissioner has notified sellers at least 60 days prior to the change.\n(d) The political subdivision shall apply the rate change for sales tax imposed under this section to purchases from printed catalogs, wherein the purchaser computed the tax based upon local tax rates published in the catalog, starting only on the first day of a calendar quarter, and only after the commissioner has notified sellers at least 120 days prior to the change.\n(e) The political subdivision shall apply local jurisdiction boundary changes to taxes imposed under this section starting only on the first day of a calendar quarter, and only after the commissioner has notified sellers at least 60 days prior to the change.\nAny political subdivision imposing a local sales and use tax, which maintains an official website, must display on its main home page a link to a notice that residents and businesses in the political subdivision may owe a local use tax on purchases of goods and services made outside of the political subdivision limits. The notice must provide information, including a link to any relevant Department of Revenue website, on how the taxpayer may get information and forms necessary for calculating and paying the tax. If the political subdivision provides and bills for sewer, water, garbage collection, or other public utility services, the billing statement must also include at least once per year a notice that residents and businesses may owe a local use tax on purchases made outside of the political subdivision limits and provide information on how the taxpayer may get information and forms necessary for calculating and paying the tax.\nThis section applies to all local sales taxes that were authorized before, on, or after June 2, 1997.",
	"repealed": false
}