{
	"id": "144.1476",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1476",
	"title": "144.1476 RURAL PHARMACY PLANNING AND TRANSITION GRANT PROGRAM.",
	"text": "(a) For the purposes of this section, the following definitions apply.\n(b) \"Eligible rural community\" means:\n(1) a Minnesota community that is located in a rural area, as defined in the federal Medicare regulations, Code of Federal Regulations, title 42, section 405.1041; or\n(2) a Minnesota community that has a population of less than 10,000, according to the United States Bureau of Statistics, and that is outside the seven-county metropolitan area, excluding the cities of Duluth, Mankato, Moorhead, Rochester, and St. Cloud.\n(c) \"Health care provider\" means a hospital, clinic, pharmacy, long-term care institution, or other health care facility that is licensed, certified, or otherwise authorized by the laws of this state to provide health care.\n(d) \"Pharmacist\" means an individual with a valid license issued under chapter 151 to practice pharmacy.\n(e) \"Pharmacy\" has the meaning given under section 151.01, subdivision 2.\n(a) The commissioner of health shall establish a program to award grants to eligible rural communities or health care providers in eligible rural communities for planning, establishing, keeping in operation, or providing health care services that preserve access to prescription medications and the skills of a pharmacist according to sections 151.01 to 151.40.\n(b) To be eligible for a grant, an applicant must develop a strategic plan for preserving or enhancing access to prescription medications and the skills of a pharmacist. At a minimum, a strategic plan must consist of:\n(1) a needs assessment to determine what pharmacy services are needed and desired by the community. The assessment must include interviews with or surveys of area and local health professionals, local community leaders, and public officials;\n(2) an assessment of the feasibility of providing needed pharmacy services that identifies priorities and timelines for potential changes; and\n(3) an implementation plan.\n(c) A grant may be used by a recipient that has developed a strategic plan to implement transition projects to modify the type and extent of pharmacy services provided, in order to reflect the needs of the community. Grants may also be used by recipients:\n(1) to develop pharmacy practices that integrate pharmacy and existing health care provider facilities; or\n(2) to establish a pharmacy provider cooperative or initiatives that maintain local access to prescription medications and the skills of a pharmacist.\nIn determining which applicants shall receive grants under this section, the commissioner of health shall appoint a committee comprised of members with experience and knowledge about rural pharmacy issues including, but not limited to, two rural pharmacists with a community pharmacy background, two health care providers from rural communities, one representative from a statewide pharmacist organization, and one representative of the Board of Pharmacy. A representative of the commissioner may serve on the committee in an ex officio status. In determining who shall receive a grant, the committee shall take into account:\n(1) improving or maintaining access to prescription medications and the skills of a pharmacist;\n(2) changes in service populations;\n(3) the extent community pharmacy needs are not currently met by other providers in the area;\n(4) the financial condition of the applicant;\n(5) the integration of pharmacy services into existing health care services; and\n(6) community support.\nThe commissioner may also take into account other relevant factors.\n(a) The commissioner shall establish a deadline for receiving applications and must make a final decision on the funding of each application within 60 days of the deadline. An applicant must apply no later than March 1 of each fiscal year for grants awarded for that fiscal year.\n(b) Any grant awarded must not exceed $50,000 a year. Notwithstanding any law to the contrary, funds awarded to grantees in a grant agreement do not lapse until expended by the grantee.\n(c) Applicants may apply to the program each year they are eligible.\n(d) Project grants may not be used to retire debt incurred with respect to any capital expenditure made prior to the date on which the project is initiated.\nThe commissioner shall evaluate the overall effectiveness of the grant program and may collect progress reports and other information from grantees needed for program evaluation. An academic institution that has the expertise in evaluating rural pharmacy outcomes may participate in the program evaluation if asked by a grantee or the commissioner. The commissioner shall compile summaries of successful grant projects and other model community efforts to preserve access to prescription medications and the skills of a pharmacist, and make this information available to Minnesota communities seeking to address local pharmacy issues.",
	"repealed": false
}