{
	"id": "260C.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.621",
	"title": "260C.621 JURISDICTION AND VENUE.",
	"text": "(a) The juvenile court has original jurisdiction for all adoption proceedings involving the adoption of a child under the guardianship of the commissioner, including when the commissioner approves the placement of the child through the Interstate Compact on the Placement of Children under section 260.851 for adoption outside the state of Minnesota and an adoption petition is filed in Minnesota.\n(b) The receiving state also has jurisdiction to conduct an adoption proceeding for a child under the guardianship of the commissioner when the adopting home was approved by the receiving state through the interstate compact.\n(a) Venue for the adoption of a child committed to the guardianship of the commissioner of children, youth, and families shall be the court conducting reviews in the matter according to section 260C.607.\n(b) Upon request of the responsible social services agency, the court conducting reviews under section 260C.607 may order that filing an adoption petition involving a child under the guardianship of the commissioner be permitted in the county where the adopting parent resides upon determining that:\n(1) there is no motion for an order for adoptive placement of the child that has been filed or is reasonably anticipated by the responsible social services agency to be filed; and\n(2) filing the petition in the adopting parent's county of residence will expedite the proceedings and serve the best interests of the child.\n(c) When the court issues an order under paragraph (b), a copy of the court order shall be filed together with the adoption petition in the court of the adopting parent's county of residence.\n(d) The court shall notify the court conducting reviews under section 260C.607 when the adoption is finalized so that the court conducting reviews under section 260C.607 may close its jurisdiction and the court record, including the court's electronic case record, in the county conducting the reviews shall reflect that adoption of the child was finalized.",
	"repealed": false
}