{
	"id": "79A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.06",
	"title": "79A.06 THIRD-PARTY ADMINISTRATOR.",
	"text": "No person, firm, or corporation, other than an insurer admitted to transact workers' compensation insurance in this state, shall contract to administer claims of self-insured employers as a third-party administrator unless qualified to do so pursuant to section 60A.23, subdivision 8.\nA third-party administrator who contracts to administer claims of a self-insured employer shall maintain an office in the state of Minnesota and shall be subject to regulation under this chapter and chapters 60A and 72A with respect to the adjustment, administration, and management of workers' compensation claims for any self-insured employer.\nA third-party administrator retained by a self-insured employer to administer the employer's workers' compensation claims shall estimate the total accrued liability of the employer for the payment of compensation for the employer's annual report to the commissioner and shall make the estimate both in good faith and with the exercise of a reasonable degree of care. The use of a third-party administrator does not discharge or alter the employer's responsibilities with respect to the report.\nFailure to submit reports to the commissioner as required by this chapter may result in the assessment of a penalty which shall not exceed $3,000 for each month or fraction thereof the report is past due. Failure to submit reports required by statute within 60 days from the due date without written consent of the commissioner shall result in the revocation of the certificate to self-insure. Penalties shall be deposited in the self-insurers' security fund.\n(a) Private employers who have ceased to be private self-insurers shall discharge their continuing obligations to secure the payment of compensation which is accrued during the period of self-insurance, for purposes of Laws 1988, chapter 674, sections 1 to 21, by compliance with all of the following obligations of current certificate holders:\n(1) Filing reports with the commissioner to carry out the requirements of this chapter;\n(2) Depositing and maintaining a security deposit for accrued liability for the payment of any compensation which may become due, pursuant to chapter 176. However, if a private employer who has ceased to be a private self-insurer purchases an insurance policy from an insurer authorized to transact workers' compensation insurance in this state which provides coverage of all claims for compensation arising out of injuries occurring during the entire period the employer was self-insured, whether or not reported during that period, the policy will:\n(i) discharge the obligation of the employer to maintain a security deposit for the payment of the claims covered under the policy;\n(ii) discharge any obligation which the self-insurers' security fund has or may have for payment of all claims for compensation arising out of injuries occurring during the period the employer was self-insured, whether or not reported during that period; and\n(iii) discharge the obligations of the employer to pay any future assessments to the self-insurers' security fund; provided, however, that a member that terminates its self-insurance authority on or after August 1, 2010, shall be liable for an assessment under paragraph (b). The actuarial opinion shall not take into consideration any transfer of the member's liabilities to an insurance policy if the member obtains a replacement policy as described in this subdivision within one year of the date of terminating its self-insurance.\nA private employer who has ceased to be a private self-insurer may instead buy an insurance policy described above, except that it covers only a portion of the period of time during which the private employer was self-insured; purchase of such a policy discharges any obligation that the self-insurers' security fund has or may have for payment of all claims for compensation arising out of injuries occurring during the period for which the policy provides coverage, whether or not reported during that period.\nA policy described in this clause may not be issued by an insurer unless it has previously been approved as to the insurer, form, and substance by the commissioner; and\n(3) Paying within 30 days all assessments of which notice is sent by the security fund, for a period of seven years from the last day its certificate of self-insurance was in effect. Thereafter, the private employer who has ceased to be a private self-insurer may either: (i) continue to pay within 30 days all assessments of which notice is sent by the security fund until it has no incurred liabilities for the payment of compensation arising out of injuries during the period of self-insurance; or (ii) pay the security fund a cash payment equal to four percent of the net present value of all remaining incurred liabilities for the payment of compensation under sections 176.101 and 176.111 as certified by a member of the casualty actuarial society. Assessments shall be based on the benefits paid by the employer during the calendar year immediately preceding the calendar year in which the employer's right to self-insure is terminated or withdrawn.\n(b) With respect to a self-insurer who terminates its self-insurance authority after April 1, 1998, that member shall obtain and file with the commissioner an actuarial opinion of its outstanding liabilities as determined by an associate or fellow of the Casualty Actuarial Society within 120 days of the date of its termination. If the actuarial opinion is not timely filed, the self-insurers' security fund may, at its discretion, engage the services of an actuary for this purpose. The expense of this actuarial opinion must be assessed against and be the obligation of the self-insurer. The commissioner may issue a certificate of default against the self-insurer for failure to pay this assessment to the self-insurers' security fund as provided by section 79A.04, subdivision 9. The actuarial opinion must not apply a present value discount in computing future liabilities. Within 60 days after notification of approval of the actuarial opinion by the commissioner, the exiting member shall pay to the security fund an amount determined as follows: a percentage will be determined by dividing the security fund's members' deficit as determined by the most recent audited financial statement of the security fund by the total actuarial liability of all members of the security fund as calculated by the commissioner within 30 days of the exit date of the member. This quotient will then be multiplied by that exiting member's total future liability as contained in the exiting member's actuarial opinion. If the payment is not made within 30 days of the notification, interest on it at the rate prescribed by section 549.09 must be paid by the former member to the security fund until the principal amount is paid in full.\n(c) A former member who terminated its self-insurance authority before April 1, 1998, who has paid assessments to the self-insurers' security fund for seven years, and whose annualized assessment is $15,000 or less, may buy out of its outstanding liabilities to the self-insurers' security fund by an amount calculated as follows: 1.35 multiplied by the indemnity case reserves at the time of the calculation, multiplied by the then current self-insurers' security fund annualized assessment rate.\n(d) A former member who terminated its self-insurance authority before April 1, 1998, and who is paying assessments within the first seven years after ceasing to be self-insured under paragraph (a), clause (3), may elect to buy out its outstanding liabilities to the self-insurers' security fund by obtaining and filing with the commissioner an actuarial opinion of its outstanding liabilities as determined by an associate or fellow of the Casualty Actuarial Society. The opinion must separate liability for indemnity benefits from liability for medical benefits. Within 30 days after notification of approval of the actuarial opinion by the commissioner, the member shall pay to the security fund an amount equal to 120 percent of that discounted outstanding indemnity liability, multiplied by the greater of the average annualized assessment rate since inception of the security fund or the annual rate at the time of the most recent assessment.\n(e) A former member who has paid the security fund according to paragraphs (b) to (d) and subsequently receives authority from the commissioner to again self-insure shall be assessed under section 79A.12, subdivision 2, only on indemnity benefits paid on injuries that occurred after the former member received authority to self-insure again; provided that the member furnishes verified data regarding those benefits to the security fund.\n(f) In addition to proceedings to establish liabilities and penalties otherwise provided, a failure to comply may be the subject of a proceeding before the commissioner. An appeal from the commissioner's determination may be taken pursuant to the contested case procedures of chapter 14 within 30 days of the commissioner's written determination.\nAny current or past member of the self-insurers' security fund is subject to service of process on any claim arising out of chapter 176 or this chapter in the manner provided by section 5.25, or as otherwise provided by law. The issuance of a certificate to self-insure to the private self-insured employer shall be deemed to be the agreement that any process which is served in accordance with this section shall be of the same legal force and effect as if served personally within this state.\nPrivate employers who are currently self-insurers may also purchase a policy described in subdivision 5, paragraph (a), clause (2), with the same effect as specified in that clause for the period covered by the policy.\nIn the event of the insolvency of the insurer of a self-insurance group issued a policy under subdivision 5, including a policy covering only a portion of the period of self-insurance, eligibility for chapter 60C coverage under the policy shall be determined by applying the requirements of section 60C.09, subdivision 2, clause (3), to each self-insurance group member, rather than to the net worth of the self-insurance group entity or the aggregate net worth of all members of the self-insurance group entity.",
	"repealed": false
}