{
	"id": "41B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.19",
	"title": "41B.19 GENERAL OBLIGATION BONDS.",
	"text": "For the purpose of developing the state's agricultural resources by providing for the extension of credit on real estate security and to assure the timely payment of the principal of and interest on the bonds or other obligations issued by the Rural Finance Authority, and upon request of the Rural Finance Authority under section 41B.08, the commissioner of management and budget may at the direction of the authority, issue general obligation bonds of the state in a principal amount not exceeding $50,000,000. Additional amounts for the same purpose may be authorized from time to time by law. The bonds must be secured as provided in the Minnesota Constitution, article XI, section 7, and, except as provided in this section, must be issued and secured as provided in section 16A.641. The proceeds of the bonds, except any premium and accrued interest, must be deposited and held in, and disbursed from, a separate account in the bond proceeds fund and used solely for the purposes specified in this section. The authority may use the proceeds of the bonds to make direct loans or to purchase participations in qualified agricultural loans as provided in this chapter. The participations purchased with the bond proceeds must be held as assets of the rural renewal bond account established by subdivision 4 in the state bond fund. The premium and accrued interest, if any, must be deposited in the rural renewal bond account in the state bond fund.\nNotwithstanding any provision of section 16A.641 to the contrary, the commissioner of management and budget may fix the terms of the bonds as provided in sections 475.54, subdivision 5a, and 475.56, paragraph (b), and may enter into on behalf of the state all agreements deemed necessary for this purpose, including those authorized to be entered into by municipalities by that section. The proceeds of the general obligation bonds may be used to reimburse the commissioner of management and budget for the costs of issuance of the bonds and the costs of development of programs authorized in sections 41B.01 to 41B.23.\nIf determined by the commissioner of management and budget to be necessary in order to reduce costs of issuance, to secure a favorable prevailing interest rate, or to receive the bond proceeds by a specified date, or if the terms of the bonds are fixed as provided in sections 475.54, subdivision 5a, and 475.56, paragraph (b), the bonds may be sold by negotiation and without solicitation of sealed bids.\nThe commissioner of management and budget shall maintain in the state bond fund a separate bookkeeping account designated as the rural renewal bond account, to record receipts and disbursements of money transferred to the account to pay bonds issued under this section and to record income from the investment of the money in the account. The income must be credited to the account in each fiscal year in an amount equal to the approximate average return that year on all funds invested by the commissioner of management and budget, as determined by the commissioner of management and budget, times the average balance in the account that year.\nThe commissioner of management and budget shall maintain a separate account designated as the Rural Finance Authority security account, into which must be deposited the proceeds of the rural renewal general obligation bonds issued as provided in this section. The commissioner of management and budget shall maintain a separate bookkeeping account to record receipts and disbursements of money transferred to or from the security account and to record income from the investment of money in the account. Upon the written request of the authority, the commissioner of management and budget shall transfer from the security account to an account or accounts the authority shall designate, a sum of money sufficient in amount, if available, when added to the balances then on hand in the designated accounts, to pay bonds issued by the authority under sections 41B.01 to 41B.23 and the interest on them due and to become due on the next succeeding date for the payment of the principal of and interest on the bonds of the authority or to restore to any debt service reserve fund established in connection with the bonds any amount withdrawn from the debt service reserve account to pay the bonds. When no revenue bonds secured by the security account are outstanding under the resolution authorizing their issuance, the commissioner of management and budget shall transfer all money and securities on hand in the security account to the state bond fund.\n(a) Money from time to time on deposit in the security account must be invested by the State Board of Investment at the request of the authority in any investment authorized by this subdivision. Money on deposit in the security account may be invested in:\n(1) certificates of deposit issued by or interest-bearing time deposits with a national banking association or a bank and trust company organized under the laws of any state;\n(2) deposits secured by obligations of the United States or of the state of a market value equal at all times to the amount of the deposit and all banks and trust companies are authorized to give security for those deposits;\n(3) qualified agricultural loans or in participation interests in qualified agricultural loans; or\n(4) qualified restructured loans.\n(b) The principal amount of the investment under paragraph (a), clause (1), must be fully insured by the Federal Deposit Insurance Corporation or Federal Savings and Loan Insurance Corporation; or if not fully insured, the institution issuing the certificate of deposit or accepting the time deposit must be rated in the AA or a higher category as defined by a nationally recognized bond rating agency or in an equivalent or higher rating category based on any later redefinition.\n(c) If and to the extent money has been transferred from the security account to provide for the timely payment of the principal of and interest on bonds issued by the authority, or to transfer money to a debt service reserve fund established in connection with the bonds, the authority shall transfer to the security account on or before December 1 of each succeeding year an amount equal to that previously transferred from the security account, provided that the authority's obligation to transfer money to the security account is limited to money then on hand in funds or accounts of the authority in excess of those appropriated to other purposes or required to provide for the payment of the principal of and interest on bonds issued by the authority and to pay the costs of issuing, carrying, administering, and securing the bonds of the authority and of administering and implementing the programs of the authority financed by the bonds.\nIn addition to the money required to be transferred to the rural renewal bond account under subdivision 5, and in order to reduce the amount of taxes otherwise required by the Minnesota Constitution to be levied for the state bond fund, the commissioner of management and budget shall transfer from the general fund to the rural renewal bond account, on December 1 in each year, a sum of money sufficient in amount, when added to the balance then on hand in that account, to pay all bonds issued under this section and the interest on them due and to become due to and including July 1 in the second ensuing year. All money to be so credited and all income from its investment is annually appropriated for the payment of the bonds and interest on them, and shall be available in the rural renewal bond account before the levy of the tax in any year required by the Minnesota Constitution, article XI, section 7. The legislature may also appropriate to the rural renewal bond account any other money in the state treasury not otherwise appropriated, for the security of bonds issued under this section in the event that sufficient money is not available in the account from the appropriation in this section, before the levy of the tax in any year. The commissioner of management and budget shall make the appropriate entries in the accounts of the respective funds.\nOn or before December 1 in each year the state auditor shall levy on all taxable property within the state whatever tax may be necessary to produce an amount sufficient, with all money then in the rural renewal bond account, to pay the entire amount of principal and interest due on or before July 1 in the second year thereafter on bonds issued under this section. This tax must be levied upon all real property used for a homestead, as well as other taxable property, notwithstanding section 273.13, subdivision 22. The tax must not be limited in rate or amount until all the bonds and interest on them are fully paid. The proceeds of this tax are appropriated and must be credited to the state bond fund, and the principal and interest on the bonds are payable from all the proceeds. As much of the proceeds as is necessary is appropriated for the payments. If at any time there is insufficient money from the proceeds of the taxes to pay the principal and interest when due on the bonds, the principal and interest must be paid out of the general fund in the state treasury, and the amount necessary for the payment is hereby appropriated.\nThe commissioner of management and budget may covenant and agree with the holders of the bonds issued under this section that the state will comply, insofar as possible, with the provisions of the United States Internal Revenue Code now or hereafter enacted that are applicable to the bonds and that establish conditions under which the interest to be paid on the bonds will not be includable in gross income for federal tax purposes.\nInterest on the bonds authorized by this section may be issued without regard to whether the interest to be paid on them is includable in gross income for federal tax purposes.",
	"repealed": false
}