{
	"id": "256L.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.11",
	"title": "256L.11 PROVIDER PAYMENT.",
	"text": "Payment to providers under this chapter shall be at the same rates and conditions established for medical assistance, except as provided in this section.\nServices provided by federally qualified health centers, rural health clinics, facilities of the Indian Health Service, and certified community behavioral health clinics shall be paid for according to the same rates and conditions applicable to the same service provided by providers that are not federally qualified health centers, rural health clinics, facilities of the Indian Health Service, or certified community behavioral health clinics. The alternative payment methodology described under section 256B.0625, subdivision 30, paragraph (l), shall not apply to services delivered under this chapter by federally qualified health centers, rural health clinics, and facilities of the Indian Health Service. The prospective payment system for certified behavioral health clinics under section 256B.0625, subdivision 5m, shall not apply to services delivered under this chapter.\nMS 2018 [Repealed, 1Sp2019 c 9 art 7 s 47]\nInpatient hospital services provided under section 256L.03, subdivision 3, shall be at the medical assistance rate.\nThe \"medical assistance rate,\" as used in this section to apply to rates for providing inpatient hospital services, means the rates established under sections 256.9685 to 256.9695 for providing inpatient hospital services to medical assistance recipients who receive Minnesota family investment program assistance.\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 2013 c 108 art 1 s 68]\n(a) Effective for dental services provided on or after January 1, 2022, payment rates to dental providers shall equal the payment rates described in section 256B.76, subdivision 2.\n(b) Payments made to prepaid health plans under section 256L.12 shall reflect the payment rates described in this subdivision. The prepaid health plans under contract with the commissioner shall provide payments to dental providers that are at least equal to a rate that includes the payment rate specified in this subdivision, and if applicable to the provider, the rates described under subdivision 7.\n(a) Effective for dental services provided to MinnesotaCare enrollees on or after July 1, 2017, the commissioner shall increase payment rates to dentists and dental clinics deemed by the commissioner to be critical access providers under section 256B.76, subdivision 4, by 20 percent above the payment rate that would otherwise be paid to the provider. The commissioner shall pay the prepaid health plans under contract with the commissioner amounts sufficient to reflect this rate increase.\n(b) Managed care plans and county-based purchasing plans shall increase reimbursement to critical access dental providers by at least the amount specified in paragraph (a). If, for any coverage year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed an amount equal to any increase in rates that results from this provision. If, for any coverage year, federal approval is not received for this paragraph, the commissioner shall not implement this paragraph for subsequent coverage years.",
	"repealed": false
}