{
	"id": "326.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.78",
	"title": "326.78 DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall adopt and begin enforcement of rules necessary to implement sections 326.70 to 326.81. The rules adopted shall not be duplicative of rules adopted by the commissioner of the Department of Labor and Industry. The rules shall include rules in the following areas:\n(1) application, enclosure, removal, and encapsulation procedures;\n(2) license and certificate qualification requirements;\n(3) examinations for obtaining a license and certificate;\n(4) training necessary for individual certification;\n(5) qualifications for managers of asbestos-related work projects;\n(6) asbestos-related work and asbestos management activity specifications;\n(7) any contractor bonding and insurance requirements deemed necessary by the commissioner;\n(8) license and certificate issuance and revocation procedures;\n(9) suspension or revocation of licenses or certificates;\n(10) license and certificate suspension and revocation criteria;\n(11) cleanup standards;\n(12) continuing education requirements; and\n(13) other rules necessary to implement sections 326.70 to 326.81.\nThe commissioner may issue licenses to persons and certificates to individuals who meet the criteria in sections 326.70 to 326.81 and the commissioner's rules. Licenses shall be valid for 12 months. Certificates shall be valid for 12 months after the completion date on the approved training course diploma.\nThe commissioner may, in writing, delegate the inspection and enforcement authority granted in sections 326.70 to 326.81 to other state agencies regulating asbestos.\n[Repealed, 1993 c 206 s 25]\nIn matters under investigation by or pending before the commissioner under sections 326.70 to 326.81, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of papers, books, records, documents, and other relevant evidentiary material. A person failing or refusing to comply with the subpoena or order may, upon application by the commissioner to the district court in any district, be ordered by the court to comply with the order or subpoena. The commissioner may also administer oaths and affirmations to witnesses. Depositions may be taken within or without the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon any person anywhere within the state by an officer authorized to serve subpoenas in civil actions, with the same fees and mileage costs paid, and in the manner as prescribed by law, for process of the state district courts. Fees and mileage and other costs of persons subpoenaed by the commissioner shall be paid in the manner prescribed for proceedings in district court.\n[Repealed, 1993 c 206 s 25]\n[Repealed, 1993 c 206 s 25]\n[Repealed, 1993 c 206 s 25]\nA person who violates any of the requirements of sections 326.70 to 326.81 or any requirement, rule, or order issued under those sections is subject to a civil penalty of not more than $10,000 per day of violation. Penalties may be recovered in a civil action in the name of the state brought by the attorney general.",
	"repealed": false
}