{
	"id": "326B.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.55",
	"title": "326B.55 LICENSING; QUALIFICATIONS; RULES.",
	"text": "(a) Except as provided in paragraph (d), no individual shall perform water conditioning installation or water conditioning servicing unless licensed by the commissioner as a master plumber, journeyworker plumber, water conditioning master, or water conditioning journeyworker, or, in all areas of the state except in cities and towns with a population of more than 5,000 according to the last federal census, as a restricted master plumber or restricted journeyworker plumber.\n(b) Except as provided in paragraph (e), no person shall perform or offer to perform water conditioning installation or water conditioning servicing with or without compensation unless the person obtains a water conditioning contractor's license. A water conditioning contractor's license does not of itself qualify its holder to perform the water conditioning installation or water conditioning servicing authorized by holding a water conditioning master or water conditioning journeyworker license.\n(c) Except as provided in paragraph (d), no person shall engage in or work at the business of water conditioning installation or servicing anywhere in the state unless at all times an individual licensed as a master plumber or water conditioning master by the commissioner, who is responsible for the proper installation and servicing, is in charge of the water conditioning installation and servicing work.\nIf a water conditioning contractor employs a licensed master, restricted master, journeyworker or restricted journeyworker plumber, or a licensed water conditioning master or journeyworker, then the licensed individual does not need a separate water conditioning contractor license to perform water conditioning installation or servicing on behalf of the employer within the scope of the individual's plumber license.\n(d) No water conditioning contractor, water conditioning master, or water conditioning journeyworker license is required:\n(1) for exchanges of portable water conditioning equipment; or\n(2) for an individual to perform water conditioning work that complies with the minimum standards prescribed by the Plumbing Board on premises or that part of premises owned and occupied by the individual as a residence, unless otherwise prohibited by a local ordinance. The scope of work that a master plumber, restricted master plumber, journeyworker plumber, or restricted journeyworker plumber is authorized to perform as an employee of a licensed water conditioning contractor shall be limited to the scope of work that the licensed water conditioning contractor is licensed to perform.\n(a) A water conditioning master license shall be issued only to an individual who has demonstrated skill in planning, superintending, servicing, and installing water conditioning installations, and has successfully passed the examination for water conditioning masters. A water conditioning journeyworker license shall only be issued to an individual other than a water conditioning master who has demonstrated practical knowledge of water conditioning installation, and has successfully passed the examination for water conditioning journeyworkers. A water conditioning journeyworker must successfully pass the examination for water conditioning masters before being licensed as a water conditioning master.\n(b) Each water conditioning contractor must designate a responsible licensed master plumber or a responsible licensed water conditioning master, who shall be responsible for the performance of all water conditioning installation and servicing in accordance with the requirements of sections 326B.50 to 326B.59, all rules adopted under sections 326B.50 to 326B.59, the Minnesota Plumbing Code, and all orders issued under section 326B.082. If the water conditioning contractor is an individual or sole proprietorship, the responsible licensed master must be the individual, proprietor, or managing employee. If the water conditioning contractor is a partnership, the responsible licensed master must be a general partner or managing employee. If the water conditioning contractor is a limited liability company, the responsible licensed master must be a chief manager or managing employee. If the water conditioning contractor is a corporation, the responsible licensed master must be an officer or managing employee. If the responsible licensed master is a managing employee, the responsible licensed master must be actively engaged in performing water conditioning work on behalf of the water conditioning contractor and cannot be employed in any capacity as a water conditioning master or water conditioning journeyworker for any other water conditioning contractor. An individual must not be the responsible licensed master for more than one water conditioning contractor.\n(c) All applications and renewals for water conditioning contractor licenses shall include a verified statement that the applicant or licensee has complied with paragraph (b).\n(d) Each application and renewal for a water conditioning master license, water conditioning journeyworker license, or a water conditioning contractor license shall be accompanied by all fees required by section 326B.092.\nThe commissioner shall:\n(1) license water conditioning contractors, water conditioning masters, and water conditioning journeyworkers; and\n(2) collect the fees required by section 326B.092.\n(a) A plumber's apprentice who is registered under section 326B.47 is authorized to assist in water conditioning installation and water conditioning servicing only while under the direct supervision of a master plumber, journeyworker plumber, restricted master plumber, restricted journeyworker plumber, water conditioning master, or water conditioning journeyworker. The master or journeyworker is responsible for ensuring that all water conditioning work performed by the plumber's apprentice complies with the plumbing code and rules adopted under sections 326B.50 to 326B.59. The supervising master or journeyworker must be licensed and must be employed by the same employer as the plumber's apprentice. Licensed individuals shall not permit plumber's apprentices to perform water conditioning work except under the direct supervision of an individual actually licensed to perform such work. Plumber's apprentices shall not supervise the performance of plumbing work or make assignments of plumbing work to unlicensed individuals.\n(b) Water conditioning contractors employing plumber's apprentices to perform water conditioning work shall maintain records establishing compliance with this subdivision that shall identify all plumber's apprentices performing water conditioning work, and shall permit the department to examine and copy all such records.",
	"repealed": false
}