{
	"id": "17A.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/17A.145",
	"title": "17A.145 CIVIL PENALTY PROCEDURES.",
	"text": "If the commissioner believes that a person has violated this chapter or a rule or order adopted under this chapter, the commissioner shall issue a written citation to the person by personal service or by certified mail. The citation must describe with particularity the nature of the violation, including a reference to the statute, rule, or order alleged to have been violated. In addition, the citation must fix a reasonable time for the abatement of the violation and notify the person of the penalty, if any, proposed to be assessed. The citation must also advise that the person has 30 working days within which to notify the commissioner in writing that the person wishes to contest the citation, proposed penalty assessment, or time allowed for correction. The commissioner may issue notices instead of citations with respect to minor violations if the commissioner believes a notice will best serve the public interest.\nIf within 30 working days after receiving the commissioner's notice or citation the person fails to notify the commissioner in writing that the person intends to contest the citation, proposed penalty, assessment, or time allowed for correction in the citation, the citation and assessment as proposed become a final order and are not subject to further review. For good cause shown the commissioner may extend the time period for responding.\nThe time allowed for correcting a violation does not begin to run until the entry of a final order if the person has initiated review proceedings under this section in good faith. If the commissioner has reason to believe that a person has failed to correct a violation for which a citation has been issued within the time allowed, the commissioner shall notify the person by certified mail of the failure. The notification must state the penalty proposed to be assessed for the failure under section 17A.14 and must state that the person has 30 working days to notify the commissioner in writing that the person wishes to contest the notification or the proposed penalty assessment. If within 30 working days after receiving the notification the person fails to notify the commissioner in writing that the person intends to contest the notification or proposed penalty assessment, the notification and assessment as proposed become a final order and are not subject to further review. For good cause shown the commissioner may extend the time period for responding.\nIf a person who has received a citation or a proposed penalty assessment notifies the commissioner that the person intends to contest the citation or the proposed penalty assessment within the time limits in subdivisions 2 and 3, the commissioner shall file a complaint with the Office of Administrative Hearings and serve a copy on the respondent by first class mail. The complaint must be served and copies filed within 40 days of receiving the notice of contest. The complaint must set forth all alleged violations and proposed penalties that are contested.\nNotwithstanding chapter 14, after an answer has been timely filed the case must be heard as a contested case except that the report of the administrative law judge is the final decision of the Department of Agriculture.",
	"repealed": false
}