{
	"id": "142G.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.18",
	"title": "142G.18 PERSONS INELIGIBLE; VENDOR PAYMENTS.",
	"text": "(a) An individual who has been convicted of a felony level drug offense during the previous ten years from the date of application or recertification is subject to the following:\n(1) Benefits for the entire assistance unit must be paid in vendor form for shelter and utilities during any time the applicant is part of the assistance unit.\n(2) The convicted applicant or participant may be subject to random drug testing. Following any positive test for an illegal controlled substance, the county must provide information about substance use disorder treatment programs to the applicant or participant.\n(b) Applicants requesting only SNAP benefits or participants receiving only SNAP benefits, who have been convicted of a felony-level drug offense during the previous ten years from the date of application or recertification may, if otherwise eligible, receive SNAP benefits. The convicted applicant or participant may be subject to random drug testing. Following a positive test for an illegal controlled substance, the county must provide information about substance use disorder treatment programs to the applicant or participant.\n(c) For the purposes of this subdivision, \"drug offense\" means a conviction that occurred during the previous ten years from the date of application or recertification of sections 152.021 to 152.025, 152.0261, 152.0262, 152.096, or 152.137. Drug offense also means a conviction in another jurisdiction of the possession, use, or distribution of a controlled substance, or conspiracy to commit any of these offenses, if the conviction occurred during the previous ten years from the date of application or recertification and the conviction is for a crime that would be a felony if committed in Minnesota.\n(d) This subdivision does not apply for convictions or positive test results related to cannabis, marijuana, or tetrahydrocannabinols.\nAn individual violating a condition of probation or parole or supervised release imposed under federal law or the law of any state is disqualified from receiving MFIP.\nAn individual who is fleeing to avoid prosecution, or custody, or confinement after conviction for a crime that would be a felony if committed in Minnesota, is disqualified from receiving MFIP.\nAn individual who is convicted in federal or state court of having made a fraudulent statement or representation with respect to the place of residence of the individual in order to receive assistance simultaneously from two or more states is disqualified from receiving MFIP for ten years beginning on the date of the conviction.\nUpon discovery by the county that a unit has been deemed uninhabitable under section 504B.131, the county shall immediately notify the landlord to return the vendor-paid rent under this section for the month in which the discovery occurred. The county shall cease future rent payments for the uninhabitable housing units until the landlord demonstrates the premises are fit for the intended use. A landlord who is required to return vendor-paid rent or is prohibited from receiving future rent under this subdivision may not take an eviction action against anyone in the assistance unit.",
	"repealed": false
}