{
	"id": "144.1461",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1461",
	"title": "144.1461 DIGNITY IN PREGNANCY AND CHILDBIRTH.",
	"text": "This section may be cited as the \"Dignity in Pregnancy and Childbirth Act.\"\n(a) Hospitals with obstetric care and birth centers must develop or access a continuing education curriculum and must make available to direct care employees and contractors who routinely care for patients who are pregnant or postpartum a continuing education course on anti-racism training and implicit bias. The continuing education curriculum and course must:\n(1) be evidence-based;\n(2) to the extent practicable, conform with standards for continuing education established by the applicable health-related licensing boards; and\n(3) include, at a minimum, the following elements:\n(i) education aimed at identifying personal, interpersonal, institutional, structural, and cultural barriers to inclusion;\n(ii) identifying and implementing corrective measures to promote anti-racism practices and decrease implicit bias at the interpersonal and institutional levels, including the facility's ongoing policies and practices;\n(iii) providing information on the ongoing effects of historical and contemporary exclusion and oppression of Black and Indigenous communities with the greatest health disparities in maternal and infant mortality and morbidity;\n(iv) providing information on and discussion of health disparities in the perinatal health care field, including how systemic racism and implicit bias have different impacts on health outcomes for different racial and ethnic communities; and\n(v) soliciting perspectives of diverse local constituency groups and experts on racial, identity, cultural, and provider-community relationship issues.\n(b) In addition to the initial continuing education course made available under paragraph (a), hospitals with obstetric care and birth centers must make available an annual refresher course that reflects current trends on race, culture, identity, and anti-racism principles and institutional implicit bias.\n(c) The commissioner of health, in coordination with the Minnesota Hospital Association, shall monitor implementation of this subdivision by hospitals with obstetric care and birth centers and may inspect course records or require reports from hospitals with obstetric care and birth centers on the continuing education curricula used and courses offered under this subdivision. Initial continuing education courses under this subdivision must be made available by December 31, 2022.\n(d) Hospitals with obstetric care and birth centers must provide a certificate of course completion to another facility or to a course attendee upon request. A facility may accept a course certificate from another facility for a health care provider who works at more than one facility.\n(a) In order to improve maternal and infant health and birth outcomes in groups with the most significant disparities, including Black communities, Indigenous communities, and other communities of color; rural communities; and low-income families, the commissioner of health, in partnership with patient groups and culturally based community organizations, shall:\n(1) identify barriers to obtaining midwife and doula services for groups with the most significant disparities in maternal and infant mortality and morbidity, and develop procedures and services designed to increase the availability of midwife and doula services for these groups;\n(2) promote racial, ethnic, and language diversity in the midwife and doula workforce that better aligns with the childbearing populations in groups with the most significant disparities in maternal and infant mortality and morbidity; and\n(3) explore ways to ensure that midwife and doula training and education are culturally responsive and tailored to the specific needs of groups with the most significant disparities in maternal and infant mortality and morbidity, including trauma-informed care, maternal mood disorders, intimate partner violence, and implicit bias and anti-racism.\n(b) For purposes of this subdivision, midwife and doula services include traditional midwife services as defined in section 147D.03; nurse midwife services as defined in section 148.171, subdivision 10; and doula services as defined in section 148.995, subdivision 4; and the midwife and doula workforce includes traditional midwives, nurse midwives, and certified doulas.",
	"repealed": false
}