{
	"id": "641.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.261",
	"title": "641.261 REGIONAL JAILS.",
	"text": "The purpose of sections 641.261 to 641.266 is to enable counties to cooperate to provide adequate jail facilities with suitable work programs and rehabilitation and treatment services for persons whose commitment to a county jail is authorized by law.\nThe regional jail shall serve as a place of commitment for persons whose commitment to a county jail is authorized by law by a court having jurisdiction within the cooperating counties, subject to admission rules and charges for care as the regional jail board may prescribe. The regional jail board may also accept the commitment of persons whose commitment to a county jail is authorized by law by a court having jurisdiction outside the cooperating counties, subject to admission rules and charges for care as the regional jail board may prescribe.\nThe commissioner of corrections shall promulgate, in the manner provided by law, rules relating to standards for county regional jails in the following matters:\n(1) minimum aggregate population base upon which a county regional jail may be practically operated;\n(2) site and buildings necessary for an adequate regional jail, considering such factors as inmate security, health, and work opportunities;\n(3) qualifications of staff, and ratio of staff to inmate population;\n(4) programs of work, rehabilitation, and treatment. When a county regional jail does not comply with the standards so promulgated, a judge of the district court or the commissioner of corrections may institute condemnation proceedings in the manner provided in Minnesota Statutes 1961, section 641.26.\nUpon certification by the commissioner of corrections to those courts described in subdivision 2 that a regional jail has complied with the provisions of subdivision 3, all persons sentenced to imprisonment in a county jail by such courts for more than seven days, except those sentenced under section 631.425, or subject to detention in a county jail pending trial or other disposition of their cases for periods in excess of 14 days must be committed to or detained in a regional jail in the manner provided in subdivision 2.",
	"repealed": false
}