{
	"id": "79A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.15",
	"title": "79A.15 SURETY BOND FORM.",
	"text": "The form for the surety bond under this chapter shall be:\nSTATE OF MINNESOTA\nDEPARTMENT OF COMMERCE\nSURETY BOND OF SELF-INSURER OF WORKERS' COMPENSATION\na corporation organized under the laws of .................... and authorized to transact a general surety business in the State of Minnesota, as Surety, are held and firmly bound to the State of Minnesota in the penal sum of .................... dollars ($.........) for which payment we bind ourselves, our heirs, executors, administrators, successors, and assigns, jointly and severally, firmly by these presents.\nWHEREAS in accordance with Minnesota Statutes, chapter 176, the principal elected to self-insure, and made application for, or received from the commissioner of commerce of the state of Minnesota, a certificate to self-insure, upon furnishing of proof satisfactory to the commissioner of commerce of ability to self-insure and to compensate any or all employees of said principal for injury or disability, and their dependents for death incurred or sustained by said employees pursuant to the terms, provisions, and limitations of said statute;\nNOW THEREFORE, the conditions of this bond or obligation are such that if principal shall pay and furnish compensation, pursuant to the terms, provisions, and limitations of said statute to its employees for injury or disability, and to the dependents of its employees, then this bond or obligation shall be null and void; otherwise to remain in full force and effect.\nFURTHERMORE, it is understood and agreed that:\n1. This bond may be amended, by agreement between the parties hereto and the commissioner of commerce as to the identity of the principal herein named; and, by agreement of the parties hereto, as to the premium or rate of premium. Such amendment must be by endorsement upon, or rider to, this bond, executed by the surety and delivered to or filed with the commissioner.\n2. The surety does, by these presents, undertake and agree that the obligation of this bond shall cover and extend to all past, present, existing, and potential liability of said principal, as a self-insurer, to the extent of the penal sum herein named without regard to specific injuries, date or dates of injuries, happenings or events.\n3. The penal sum of this bond may be increased or decreased, by agreement between the parties hereto and the commissioner of commerce, without impairing the obligation incurred under this bond for the overall coverage of the said principal, for all past, present, existing, and potential liability, as a self-insurer, without regard to specific injuries, date or dates of injuries, happenings or events, to the extent, in the aggregate, of the penal sum as increased or decreased. Such amendment must be by endorsement.\n4. The aggregate liability of the surety hereunder on all claims whatsoever shall not exceed the penal sum of this bond in any event.\n5. This bond shall be continuous in form and shall remain in full force and effect unless terminated as follows:\n(a) The obligation of this bond shall terminate upon written notice of cancellation from the surety, given by registered or certified mail to the commissioner of commerce, state of Minnesota, save and except as to all past, present, existing, and potential liability of the principal incurred, including obligations resulting from claims which are incurred but not yet reported, as a self-insurer prior to effective date of termination. This termination is effective 60 days after receipt of notice of cancellation by the commissioner of commerce, state of Minnesota.\n(b) This bond shall also terminate upon the revocation of the certificate to self-insure, save and except as to all past, present, existing, and potential liability of the principal incurred, including obligations resulting from claims which are incurred but not yet reported, as a self-insurer prior to effective date of termination. The principal and the surety, herein named, shall be immediately notified in writing by said commissioner, in the event of such revocation.\n6. Where the principal posts with the commissioner of commerce, state of Minnesota, or the commissioner of management and budget, state of Minnesota, a replacement security deposit, in the form of a surety bond, irrevocable letter of credit, cash, securities, or any combination thereof, in the full amount as may be required by the commissioner of commerce, state of Minnesota, to secure all incurred liabilities for the payment of compensation of said principal under Minnesota Statutes, chapter 176, the surety is released from obligations under the surety bond upon the date of acceptance by the commissioner of commerce, state of Minnesota, of said replacement security deposit.\n7. If the said principal shall suspend payment of workers' compensation benefits or shall become insolvent or a receiver shall be appointed for its business, or the commissioner of commerce, state of Minnesota, issues a certificate of default, the undersigned surety will become liable for the workers' compensation obligations of the principal on the date benefits are suspended. The surety shall begin payments within 14 days under paragraph 8, or 30 days under paragraph 10, after receipt of written notification by certified mail from the commissioner of commerce, state of Minnesota, to begin payments under the terms of this bond.\n8. If the surety exercises its option to administer claims, it shall pay benefits due to the principal's injured workers within 14 days of the receipt of the notification by the commissioner of commerce, state of Minnesota, pursuant to paragraph 7, without a formal award of a compensation judge, the commissioner of labor and industry, any intermediate appellate court, or the Minnesota Supreme Court and such payment will be a charge against the penal sum of the bond. Administrative and legal costs and payment of assessments incurred by the surety in discharging its obligations and payment of the principal's obligations for administration and legal expenses and payment of assessments under Minnesota Statutes, chapters 79A and 176, shall also be a charge against the penal sum of the bond.\n9. If any part or provision of this bond shall be declared unenforceable or held to be invalid by a court of proper jurisdiction, such determination shall not affect the validity or enforceability of the other provisions or parts of this bond.\n10. If the surety does not give notice to the (self-insurer's security fund) (commercial self-insurance group security fund) and the commissioner of commerce, state of Minnesota, within five business days of receipt of written notification from the commissioner of commerce, state of Minnesota, pursuant to paragraph 7, to exercise its option to administer claims pursuant to paragraph 8, then the (self-insurer's security fund) (commercial self-insurance security fund) will assume the payments of the workers' compensation obligations of the principal pursuant to Minnesota Statutes, chapter 176. Administrative, legal, actuarial, and other direct costs attributed to the principal shall also be a charge against the penal sum of the bond. The surety shall pay, within 30 days of the receipt of the notification by the commissioner of commerce, state of Minnesota, pursuant to paragraph 7, to the (self-insurer's security fund) (commercial self-insurance group security fund) as an initial deposit an amount equal to 50 percent of the penal sum of the bond, and shall thereafter, upon notification from the (self-insurer's security fund) (commercial self-insurance group security fund) that the balance of the initial deposit, including interest earned as provided below with respect to the segregated account, had fallen to ten percent of the penal sum of the bond, remit to the (self-insurer's security fund) (commercial self-insurance group security fund) an amount equal to an additional ten percent of the penal sum of the bond. All such payments will be a charge against the penal sum of the bond. The initial deposit and all subsequent deposits shall be deposited by the (self-insurer's security fund) (commercial self-insurance group security fund) into a segregated, interest-bearing account. These deposits, together with any interest earned thereon, shall be used to satisfy all obligations of the surety hereunder. Upon determination that there are no remaining reserves for any known claims covered under the bond, the balance of the account, including any interest earned thereon, shall be paid to the surety.\nSaid repayment of the funds to the surety will not discharge the bond, which shall remain in full force and effect as to all past, present, existing, and potential liability of the principal incurred, including obligations resulting from claims which are incurred but not yet reported, as a self-insurer prior to the effective date of termination of the bond.\n11. Disputes concerning the posting, renewal, termination, exoneration, or return of all or any portion of the principal's security deposit or any liability arising out of the posting or failure to post security, or the adequacy of the security or the reasonableness of administrative costs, including legal costs, arising between or among a surety, the issuer of an agreement of assumption and guarantee of workers' compensation liabilities, the issuer of a letter of credit, any custodian of the security deposit, the principal, or the (self-insurer's security fund) (commercial self-insurance group security fund) shall be resolved by the commissioner of commerce pursuant to Minnesota Statutes, chapters 79A and 176.\n12. Written notification to the surety required by this bond shall be sent to:\nWritten notification to the principal required by this bond shall be sent to:\n13. This bond is executed by the surety to comply with Minnesota Statutes, chapter 176, and said bond shall be subject to all terms and provisions thereof.\nThis bond is executed under an unrevoked appointment or power of attorney.\nI certify (or declare) under penalty of perjury under the laws of the state of Minnesota that the foregoing is true and correct.\nA copy of the transcript or record of the unrevoked appointment, power of attorney, bylaws, or other instrument, duly certified by the proper authority and attested by the seal of the insurer entitling or authorizing the person who executed the bond to do so for and in behalf of the insurer, must be filed in the office of the commissioner of commerce or must be included with this bond for such filing.",
	"repealed": false
}