{
	"id": "103I.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.101",
	"title": "103I.101 POWERS AND DUTIES OF COMMISSIONER OF HEALTH.",
	"text": "The commissioner has the powers reasonable and necessary to effectively exercise the authority granted by this chapter.\nThe commissioner shall:\n(1) regulate the drilling, construction, modification, repair, and sealing of wells and borings;\n(2) examine and license:\n(i) well contractors;\n(ii) persons constructing, repairing, and sealing bored geothermal heat exchangers;\n(iii) persons modifying or repairing well casings above the pitless unit or adaptor, well screens, well diameters, and installing well pumps or pumping equipment;\n(iv) persons constructing, repairing, and sealing dewatering wells;\n(v) persons sealing wells or borings; and\n(vi) persons excavating or drilling holes for the installation of elevator borings;\n(3) examine and license environmental well contractors;\n(4) license explorers engaged in exploratory boring and examine individuals who supervise or oversee exploratory boring;\n(5) after consultation with the commissioner of natural resources and the Pollution Control Agency, establish standards for the design, location, construction, repair, and sealing of wells and borings within the state; and\n(6) issue permits for wells, groundwater thermal devices, bored geothermal heat exchangers, and elevator borings.\nThe commissioner shall establish procedures for application, approval, and issuance of permits by rule.\nThe commissioner may inspect, collect water samples, and have access, at all reasonable times, to a well or boring site, including wells or borings drilled, sealed, or repaired.\nThe commissioner shall adopt rules including:\n(1) issuance of licenses for:\n(i) qualified well contractors;\n(ii) persons constructing, repairing, and sealing dewatering wells;\n(iii) persons sealing wells or borings;\n(iv) persons installing, modifying, or repairing well casings, well screens, well diameters, and well pumps or pumping equipment;\n(v) persons constructing, repairing, and sealing bored geothermal heat exchangers;\n(vi) persons constructing, repairing, and sealing elevator borings; and\n(vii) persons constructing, repairing, and sealing environmental wells;\n(2) establishment of conditions for examination and review of applications for license and certification;\n(3) establishment of conditions for revocation and suspension of license and certification;\n(4) establishment of minimum standards for design, location, construction, repair, and sealing of wells and borings to implement the purpose and intent of this chapter;\n(5) establishment of a system for reporting on wells and borings drilled and sealed;\n(6) establishment of standards for the construction, maintenance, sealing, and water quality monitoring of wells in areas of known or suspected contamination;\n(7) establishment of wellhead protection measures for wells serving public water supplies;\n(8) establishment of procedures to coordinate collection of well and boring data with other state and local governmental agencies;\n(9) establishment of criteria and procedures for submission of well and boring logs, formation samples or well or boring cuttings, water samples, or other special information required for and water resource mapping; and\n(10) establishment of minimum standards for design, location, construction, maintenance, repair, sealing, safety, and resource conservation related to borings, including exploratory borings as defined in section 103I.005, subdivision 9.\nThe commissioner shall charge a nonrefundable application fee of $275 to cover the administrative cost of processing a request for a variance or modification of rules adopted by the commissioner under this chapter.",
	"repealed": false
}