{
	"id": "82A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/82A.09",
	"title": "82A.09 ADVERTISING.",
	"text": "[Repealed, 1988 c 493 s 7]\nNo person shall publish or cause to be published in this state any advertisement concerning any membership camping contract after the commissioner has found that the advertisement contains any statement that is false or misleading, or omits to make any statement necessary in order to make the statements made, in light of the circumstances under which they were made, not misleading, and has so notified the person by written order. The order may be issued without prior notice or hearing. Up to 30 days after the issuance of the order, the person desiring to use the advertisement may in writing request a hearing on the order. Upon receipt of a written request, the matter shall be set for hearing to commence within 15 days after the receipt unless the person making the request consents to a later date. After the hearing, which shall be conducted in accordance with the provisions of chapter 14, the commissioner shall, by written order, either affirm, modify, or vacate the order.\nThe following devices or sales presentations, and the use of those devices or presentations, are deceptive or misleading practices:\n(1) An advertisement that offers travel, accommodations, gifts, meals, or entertainment published to induce prospective purchasers to visit a campground or attend a sales presentation and that:\n(i) does not prominently set forth all eligibility requirements;\n(ii) describes offers of travel, accommodations, gifts, meals, or entertainment as \"prizes,\" \"awards,\" or by words of similar import or describes prospective purchasers as \"winners\" or by words of similar import;\n(iii) contains the words \"free\" or \"no obligation\" or similar terms unless the offer is unequivocally without conditions;\n(iv) states or implies that prospective purchasers have been specially selected;\n(v) does not specifically state that gifts will be provided at the time the prospective purchaser visits the campground or attends the sales presentation;\n(vi) does not disclose on its face page the retail market value of the travel, accommodations, gifts, meals, or entertainment provided. For purposes of this subclause, \"retail market value\" means: the retail price the item sells for in Minnesota; or if the item is not sold in Minnesota, the retail price the item sells for in states contiguous to Minnesota; or if the item is not sold in Minnesota or in a state contiguous to this state, the retail price the item sells for anywhere in the United States;\n(vii) does not specifically and prominently disclose that the purpose of the offer of travel, accommodations, gifts, meals, or entertainment is to induce prospective purchasers to visit a campground or attend a sales presentation where they will be encouraged to purchase a membership camping contract;\n(viii) does not completely disclose rules and procedures if travel, accommodations, gifts, meals, or entertainment are offered through a \"sweepstakes,\" \"giveaway,\" or similar contest;\n(ix) does not specifically disclose the odds, as a fraction, using a common denominator, of a prospective purchaser's receiving each gift if the gift is offered through a \"sweepstakes,\" \"giveaway,\" or similar contest; or\n(x) does not clearly and prominently state that gifts may be given to persons outside the state if the advertisement is part of a national advertising campaign.\n(2) An advertisement that does not prominently disclose the name, address, and phone number of the membership camping operator on whose behalf the advertisement is distributed.\n(3) An advertisement prepared on the stationery of a person other than the membership camping operator that creates a likelihood of confusion, misunderstanding, or deception.\n(4) Site and conceptual plans which do not disclose which facilities are and are not currently in existence.\n(5) Pictorial advertising material for off-site distribution, other than site and conceptual plans which are labeled as such, which depicts more than the actual on-site condition of the campgrounds or other areas that are material to the offer or sale of membership camping contracts.",
	"repealed": false
}