{
	"id": "214.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.07",
	"title": "214.07 REPORTS.",
	"text": "The non-health-related licensing boards shall prepare reports according to this subdivision by October 1 of each even-numbered year. Copies of the reports shall be delivered to the governor. The reports shall contain the following information relating to the two-year period ending the previous June 30:\n(a) a general statement of board activities;\n(b) the number of meetings and approximate total number of hours spent by all board members in meetings and on other board activities;\n(c) the receipts and disbursements of board funds;\n(d) the names of board members and their addresses, occupations, and dates of appointment and reappointment to the board;\n(e) the names and job classifications of board employees;\n(f) a brief summary of board rules proposed or adopted during the reporting period with appropriate citations to the State Register and published rules;\n(g) the number of persons having each type of license and registration issued by the board as of June 30 in the year of the report;\n(h) the locations and dates of the administration of examinations by the board;\n(i) the number of persons examined by the board with the persons subdivided into groups showing age categories, sex, and states of residency;\n(j) the number of persons licensed or registered by the board after taking the examinations referred to in clause (h) with the persons subdivided by age categories, sex, and states of residency;\n(k) the number of persons not licensed or registered by the board after taking the examinations referred to in clause (h) with the persons subdivided by age categories, sex, and states of residency;\n(l) the number of persons not taking the examinations referred to in clause (h) who were licensed or registered by the board or who were denied licensing or registration with the reasons for the licensing or registration or denial thereof and with the persons subdivided by age categories, sex, and states of residency;\n(m) the number of persons previously licensed or registered by the board whose licenses or registrations were revoked, suspended, or otherwise altered in status with brief statements of the reasons for the revocation, suspension or alteration;\n(n) the number of written and oral complaints and other communications received by the executive director or executive secretary of the board, a board member, or any other person performing services for the board (1) which allege or imply a violation of a statute or rule which the board is empowered to enforce and (2) which are forwarded to other agencies as required by section 214.10;\n(o) a summary, by specific category, of the substance of the complaints and communications referred to in clause (n) and, for each specific category, the responses or dispositions thereof pursuant to section 214.10 or 214.11;\n(p) any other objective information which the board members believe will be useful in reviewing board activities.\nMS 1998 [Repealed by amendment, Laws 2000 c 284 s 6]\nEach health-related licensing board must prepare a report by October 15 of each even-numbered year. The report must be submitted to the administrative services unit serving the boards. The report must contain the following information for the two-year period ending the previous June 30: (1) the number and type of credentials issued or renewed; (2) the number of complaints received; (3) the number and age of complaints open at the end of the period; (4) receipts, disbursements, and major fees; and (5) such other information that the interests of health occupation regulation require. The report must also contain information showing historical trends. The reports must use a common format and consistent terminology and data.\nThe administrative services unit serving the boards shall prepare a report by December 15 of each even-numbered year. One copy of the administrative services report must be delivered to each of the following: the governor, the commissioner of health, and the chairs of the house of representatives and senate policy and appropriations committees with jurisdiction over health-related licensing boards. The report must be delivered to the Legislative Reference Library as provided by section 3.195. The administrative services report must contain the following information:\n(1) a summary of the information contained in the reports submitted by the health-related licensing boards pursuant to subdivision 1b;\n(2) a description of the health-related licensing boards' cooperative activities during the two-year period ending the previous June 30;\n(3) a description of emerging issues relating to health occupation regulation that affect more than one board or more than one occupation; and\n(4) a copy of each health-related licensing board report submitted to the administrative services unit pursuant to subdivision 1b.",
	"repealed": false
}