{
	"id": "176.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.135",
	"title": "176.135 TREATMENT; APPLIANCES; SUPPLIES.",
	"text": "(a) The employer shall furnish any medical, psychological, chiropractic, podiatric, surgical and hospital treatment, including nursing, medicines, medical, chiropractic, podiatric, and surgical supplies, crutches and apparatus, including artificial members, or, at the option of the employee, if the employer has not filed notice as hereinafter provided, Christian Science treatment in lieu of medical treatment, chiropractic medicine and medical supplies, as may reasonably be required at the time of the injury and any time thereafter to cure and relieve from the effects of the injury. This treatment shall include treatments necessary to physical rehabilitation.\n(b) The employer shall pay for the reasonable value of nursing services provided by a member of the employee's family in cases of permanent total disability.\n(c) Exposure to rabies is an injury and an employer shall furnish preventative treatment to employees exposed to rabies.\n(d) The employer shall furnish replacement or repair for artificial members, glasses or spectacles, artificial eyes, podiatric orthotics, dental bridge work, dentures or artificial teeth, hearing aids, canes, crutches, or wheel chairs damaged by reason of an injury arising out of and in the course of the employment. If an item under this paragraph is customized specifically for the injured worker, the item is the property of the injured worker. For the purpose of this paragraph, \"injury\" includes damage wholly or in part to an artificial member. In case of the employer's inability or refusal to timely provide the items required to be provided under this paragraph, the employer is liable for the reasonable expense incurred by or on behalf of the employee in providing the same, including costs of copies of any medical records or medical reports that are in existence, obtained from health care providers, and that directly relate to the items for which payment is sought under this chapter, limited to the charges allowed by subdivision 7, and attorney fees incurred by the employee.\n(e) Both the commissioner and the compensation judges have authority to make determinations under this section in accordance with sections 176.106 and 176.305.\n(f) An employer may require that the treatment and supplies required to be provided by an employer by this section be received in whole or in part from a managed care plan certified under section 176.1351 except as otherwise provided by that section.\n(g) An employer may designate a pharmacy or network of pharmacies that employees must use to obtain outpatient prescription and nonprescription medications. An employee is not required to obtain outpatient medications at a designated pharmacy unless the pharmacy is located within 15 miles of the employee's place of residence.\n(h) Notwithstanding any fees established by rule adopted under section 176.136, an employer may contract for the cost of medication provided to employees. All requests for reimbursement from the special compensation fund formerly codified under section 176.131 for medication provided to an employee must be accompanied by the dispensing pharmacy's invoice showing its usual and customary charge for the medication at the time it was dispensed to the employee. The special compensation fund shall not reimburse any amount that exceeds the maximum amount payable for the medication under Minnesota Rules, part 5221.4070, subparts 3 and 4, notwithstanding any contract under Minnesota Rules, part 5221.4070, subpart 5, that provides for a different reimbursement amount.\n[See Note.]\n(a) The employer or insurer is required to furnish surgical treatment pursuant to subdivision 1 when the surgery is reasonably required to cure and relieve the effects of the personal injury or occupational disease. An employee may not be compelled to undergo surgery. If an employee desires a second opinion on the necessity of the surgery, the employer shall pay the costs of obtaining the second opinion. Except in cases of emergency surgery, the employer or insurer may require the employee to obtain a second opinion on the necessity of the surgery, at the expense of the employer or insurer, before the employee undergoes surgery. If an employer or insurer receives a request for nonemergency surgery, the employer or insurer must respond in writing no later than seven calendar days after receiving the request from the health care provider or employee by approving the request, denying authorization, requesting additional information, requesting a second opinion under this section, or requesting an examination by the employer's physician under section 176.155.\n(b) An employer or insurer requesting a second opinion must notify the employee and the health care provider of the request for a second opinion within seven calendar days of the request for nonemergency surgery. If the employer or insurer denies authorization within seven calendar days of receiving the second opinion, the health care provider may elect to perform the surgery, subject to a determination of compensability by the commissioner or compensation judge.\n(c) Failure to obtain a second surgical opinion is not reason for nonpayment of the charges for the surgery. The employer or insurer is required to pay the reasonable value of the surgery unless the commissioner or compensation judge determines that the surgery is not reasonably required.\nAny service, article, or supply provided by an unlicensed complementary and alternative health care practitioner as defined in section 146A.01, subdivision 6, is not compensable under this chapter.\nThe commissioner shall adopt rules establishing standards and criteria to be used when a dispute arises over a change of physicians, podiatrists, or chiropractors in the case that either the employee or the employer desire a change. If a change is agreed upon or ordered, the medical expenses shall be borne by the employer upon the same terms and conditions as provided in subdivision 1.\nFor the purposes of this section, the word \"physicians\" shall include persons holding the degree M. D. (Doctor of Medicine) and persons holding the degree D. O. (Doctor of Osteopathic Medicine); and the terms \"medical, surgical and hospital treatment\" shall include professional services rendered by licensed persons who have earned the degree M. D. or the degree D. O.\n[Repealed, 1992 c 510 art 4 s 26]\nAny employee electing to receive Christian Science treatment as provided in subdivision 1 shall notify the employer in writing of the election within 30 days after July 1, 1953, and any person hereafter accepting employment shall give such notice at the time of accepting employment. Any employer may elect not to be subject to the provisions for Christian Science treatment provided for in this section by filing a written notice of such election with the commissioner of the Department of Labor and Industry, in which event the election of the employee shall have no force or effect whatsoever.\nNotwithstanding section 176.66, an employee who has contracted an occupational disease is eligible to receive compensation under this section even if the employee is not disabled from earning full wages at the work at which the employee was last employed.\nPayment of compensation under this section shall be made by the employer and insurer on the date of the employee's last exposure to the hazard of the occupational disease. Reimbursement for medical benefits paid under this subdivision or subdivision 1a is allowed from the employer and insurer liable under section 176.66, subdivision 10, only in the case of disablement.\nAs soon as reasonably possible, and no later than 30 calendar days after receiving the bill, the employer or insurer shall pay the charge or any portion of the charge which is not denied, or deny all or a part of the charge with written notification to the employee and the provider explaining the basis for denial, except that the employer or insurer is not required to notify the employee of payment of charges that have been reduced in accordance with section 176.136, subdivision 1, 1a, or 1b. All or part of a charge must be denied if any of the following conditions exists:\n(1) the injury or condition is not compensable under this chapter;\n(2) the charge or service is excessive under this section or section 176.136;\n(3) the charges are not submitted on the prescribed billing form; or\n(4) additional medical records or reports are required under subdivision 7 to substantiate the nature of the charge and its relationship to the work injury.\nIf payment is denied under clause (3) or (4), the employer or insurer shall reconsider the charges in accordance with this subdivision within 30 calendar days after receiving additional medical data, a prescribed billing form, or documentation of enrollment or certification as a provider.\n(a) Health care providers shall submit to the insurer an itemized statement of charges in the standard electronic transaction format when required by section 62J.536 or, if there is no prescribed standard electronic transaction format, on a billing form prescribed by the commissioner. Health care providers shall also submit copies of medical records or reports that substantiate the nature of the charge and its relationship to the work injury. Pursuant to Minnesota Rules, part 5219.0300, health care providers may charge for copies of any records or reports that are in existence and directly relate to the items for which payment is sought under this chapter. The commissioner shall adopt, by rule, a schedule of reasonable charges that will apply to charges not covered by paragraphs (d) and (e).\nA health care provider shall not collect, attempt to collect, refer a bill for collection, or commence an action for collection against the employee, employer, or any other party until the information required by this section has been furnished.\nA United States government facility rendering health care services to veterans is not subject to the uniform billing form requirements of this subdivision.\n(b) For medical services provided under this section, the codes from the International Classification of Diseases, Tenth Edition, Clinical Modification/Procedure Coding System (ICD-10), must be used to report medical diagnoses and hospital inpatient procedures when required by the United States Department of Health and Human Services for federal programs. The commissioner must replace the codes from the International Classification of Diseases, Ninth Edition, Clinical Modification/Procedure Coding System (ICD-9), with equivalent ICD-10 codes wherever the ICD-9 codes appear in rules adopted under this chapter. The commissioner must use the General Equivalence Mappings established by the Centers for Medicare and Medicaid Services to replace the ICD-9 diagnostic codes with ICD-10 codes in the rules.\n(c) The commissioner shall amend rules adopted under this chapter as necessary to implement the ICD-10 coding system in paragraph (b). The amendments shall be adopted by giving notice in the State Register according to the procedures in section 14.386, paragraph (a). The amended rules are not subject to expiration under section 14.386, paragraph (b).\n(d) The requirements in this paragraph and paragraph (e) apply to each request for copies of existing medical records fulfilled by a health care provider or the health care provider's agent that are required to be maintained in electronic format by state or federal law.\n(1) If an authorized requestor of copies of medical records submits a written request for advance notice of the cost of the copies requested, the health care provider must notify the requestor of the estimated cost before sending the copies. If the requestor approves the cost and copies of the records are provided, the payment is the applicable fee under paragraph (e). If the requestor does not pay for the records, the health care provider may charge a fee, which must not exceed $10.\n(2) A health care provider shall not require prepayment for the cost of copies of medical records under this paragraph or Minnesota Rules, chapter 5219, unless there is an outstanding past-due invoice for the requestor concerning a previous request for records from the health care provider.\n(3) A health care provider shall provide copies of medical records in electronic format.\n(4) The charges under paragraph (e) include any fee for retrieval, download, or other delivery of records.\n(e) For any copies of electronic records provided under paragraph (d), a health care provider or the health care provider's agent may not charge more than a total of:\n(1) $10 if there are no records available;\n(2) $30 for copies of records of up to 25 pages;\n(3) $50 for copies of records of up to 100 pages;\n(4) $50, plus an additional 20 cents per page for pages 101 and above; or\n(5) $500 for any request.\n(f) The commissioner may assess a penalty against a health care provider for each violation of this section by the health care provider or the health care provider's agent of $500, payable to the assigned risk safety account.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"workers' compensation payer\" means a workers' compensation insurer and an employer, or group of employers, that is self-insured for workers' compensation;\n(2) \"clearinghouse\" has the meaning given in section 62J.51, subdivision 11a; and\n(3) \"electronic transactions\" means the health care administrative transactions described in section 62J.536.\n(b) In addition to the requirements of section 62J.536, workers' compensation payers and health care providers must comply with the requirements in paragraphs (c) to (e).\n(c) No later than January 1, 2016, each workers' compensation payer must place the following information in a prominent location on its website or otherwise provide the information to health care providers:\n(1) the name of each clearinghouse with which the workers' compensation payer has an agreement to exchange or transmit electronic transactions, along with the identification number each clearinghouse has assigned to the payer in order to route electronic transactions through intermediaries or other clearinghouses to the payer;\n(2) information about how a health care provider can obtain the claim number assigned by the workers' compensation payer for an employee's claim and how the provider should submit the claim number in the appropriate field on the electronic bill to the payer; and\n(3) the name, phone number, and email address of contact persons who can answer questions related to electronic transactions on behalf of the workers' compensation payer and the clearinghouses with which the payer has agreements.\n(d) No later than January 1, 2017:\n(1) health care providers must electronically submit copies of medical records or reports that substantiate the nature of the charge and its relationship to the work injury using the ASC X12N 5010 version of the ASC X12N 275 transaction (\"Additional Information to Support Health Care Claim or Encounter\"), according to the requirements in the corresponding implementation guide. The ASC X12N 275 transaction is the only one that shall be used to electronically submit attachments unless a national standard is adopted by federal law or rule. If a new version of the attachment transaction is approved, it must be used one year after the approval date;\n(2) workers' compensation payers and all clearinghouses receiving or transmitting workers' compensation bills must accept attachments using the ASC X12N 275 transaction and must respond with the ASC X12N 5010 version of the ASC X12 electronic acknowledgment for the attachment transaction. If a new version of the acknowledgment transaction is approved, it must be used one year after the approval date; and\n(3) if a different national claims attachment or acknowledgment requirement is adopted by federal law or rule, it will replace the ASC X12N 275 transaction, and the new standard must be used on the date that it is required by the federal law or rule.\n(e) No later than September 1, 2015, workers' compensation payers must provide the patient's name and patient control number on or with all payments made to a provider under this chapter, whether payment is made by check or electronic funds transfer. The information provided on or with the payment must be sufficient to allow providers to match the payment to specific bills. If a bulk payment is made to a provider for more than one patient, the check or electronic funds transfer statement must also specify the amount being paid for each patient. For purposes of this paragraph, the patient control number is located on the electronic health care claim 837 transaction, loop 2300, segment CLM01, and on the electronic health care claim payment/advice 835 transaction, loop 2100, CLP01.\n(f) The commissioner may assess a monetary penalty of $500 for each violation of this section, not to exceed $25,000 for identical violations during a calendar year. Before issuing a penalty for a first violation of this section, the commissioner must provide written notice to the noncompliant payer, clearinghouse, or provider that a penalty may be issued if the violation is not corrected within 30 days. Penalties under this paragraph are payable to the commissioner for deposit in the assigned risk safety account.\nEach self-insured employer and insurer shall retain or arrange for the retention of (1) all billing data electronically transmitted by health care providers for payment for the treatment of workers' compensation; and (2) the employer or insurer's electronically transmitted payment remittance advice. The self-insured employer or insurer shall ensure that the data in clauses (1) and (2) shall be retained for seven years in the standard electronic transaction format that is required by rules adopted by the commissioner of the Department of Health under section 62J.536. The data shall be provided in the standard electronic transaction format to the commissioner of labor and industry within 120 days of the commissioner of labor and industry's request, and shall be used to analyze the costs and outcomes of treatment in the workers' compensation system. The data collected by the commissioner of labor and industry under this section is confidential data on individuals and protected nonpublic data, except that the commissioner may publish aggregate statistics and other summary data on the costs and outcomes of treatment in the workers' compensation system.\n(a) For purposes of this subdivision:\n(1) \"clearinghouse\" means a health care clearinghouse as defined in section 62J.51, subdivision 11a, that receives or transmits workers' compensation electronic transactions as described in section 62J.536;\n(2) \"department\" means the Department of Labor and Industry;\n(3) \"hospital\" means a hospital licensed in this state;\n(4) \"payer\" means:\n(i) a workers' compensation insurer;\n(ii) an employer, or group of employers, authorized to self-insure for workers' compensation liability; and\n(iii) a third-party administrator licensed by the Department of Commerce under section 60A.23, subdivision 8, to pay or review workers' compensation medical bills under this chapter; and\n(5) \"submission or payment of medical bills\" includes the submission, transmission, receipt, acceptance, response, adjustment, and payment of medical bills under this chapter.\n(b) Effective November 1, 2017, each payer, hospital, and clearinghouse must provide the department with the name and contact information of a designated employee to answer inquiries related to the submission or payment of medical bills. Payers, hospitals, and clearinghouses must provide the department with the name of a new designated employee within 14 days after the previously designated employee is no longer employed or becomes unavailable for more than 30 days. The name and contact information of the designated employee must be provided on forms and at intervals prescribed by the department. The department must post a directory of the designated employees on the department's website.\n(c) The designated employee under paragraph (b) must:\n(1) complete training, provided by the department, about submission or payment of medical bills; and\n(2) respond within 30 days to written department inquiries related to submission or payment of medical bills.\nThe training requirement in clause (1) does not apply to a payer that has not received any workers' compensation medical bills in the 12 months before the training becomes available.\n(d) The commissioner may assess penalties, payable to the assigned risk safety account, against payers, hospitals, and clearinghouses for violation of this subdivision as provided in clauses (1) to (3):\n(1) for failure to comply with the requirements in paragraph (b), the commissioner may assess a penalty of $50 for each day of noncompliance after the department has provided the noncompliant payer, clearinghouse, or hospital with a 30-day written warning;\n(2) for failure of the designated employee to complete training under paragraph (c), clause (1), within 90 days after the department has notified a payer, clearinghouse, or hospital's designated employee that required training is available, the commissioner may assess a penalty of $3,000;\n(3) for failure to respond within 30 days to a department inquiry related to submission or payment of medical bills under paragraph (c), clause (2), the commissioner may assess a penalty of $3,000. The commissioner shall not assess a penalty under both this clause and section 176.194, subdivision 3, clause (6), for failure to respond to the same department inquiry.",
	"repealed": false
}