{
	"id": "256B.057",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.057",
	"title": "256B.057 ELIGIBILITY REQUIREMENTS FOR SPECIAL CATEGORIES.",
	"text": "(a) An infant less than two years of age is eligible for medical assistance if the infant's countable household income is equal to or less than 283 percent of the federal poverty guideline for the same household size. Medical assistance for an uninsured infant younger than two years of age may be paid with federal funds available under title XXI of the Social Security Act and the state children's health insurance program, for an infant with countable income above 275 percent and equal to or less than 283 percent of the federal poverty guideline for the household size.\n(b) A pregnant woman is eligible for medical assistance if the woman's countable income is equal to or less than 278 percent of the federal poverty guideline for the applicable household size.\n(c) An infant born to a woman who was eligible for and receiving medical assistance on the date of the child's birth shall continue to be eligible for medical assistance without redetermination until the child's first birthday.\n[Repealed, 1998 c 407 art 5 s 48]\n[Repealed, 1Sp2003 c 14 art 12 s 101]\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 1997 c 203 art 4 s 73]\n[Repealed, 1997 c 203 art 4 s 73]\n[Repealed, 1Sp2011 c 9 art 6 s 97]\n(a) A person is eligible for medical assistance reimbursement of Medicare Part A and Part B premiums, Part A and Part B coinsurance and deductibles, and cost-effective premiums for enrollment with a health maintenance organization or a competitive medical plan under section 1876 of the Social Security Act if:\n(1) the person is entitled to Medicare Part A benefits;\n(2) the person's income is equal to or less than 100 percent of the federal poverty guidelines; and\n(3) the person's assets are no more than (i) $10,000 for a single individual, or (ii) $18,000 for a married couple or family of two or more; or, when the resource limits for eligibility for the Medicare Part D extra help low income subsidy (LIS) exceed either amount in item (i) or (ii), the person's assets are no more than the LIS resource limit in United States Code, title 42, section 1396d, subsection (p).\n(b) Reimbursement of the Medicare coinsurance and deductibles, when added to the amount paid by Medicare, must not exceed the total rate the provider would have received for the same service or services if the person were a medical assistance recipient with Medicare coverage. Increases in benefits under Title II of the Social Security Act shall not be counted as income for purposes of this subdivision until July 1 of each year.\nA person who would otherwise be eligible as a qualified Medicare beneficiary under subdivision 3, except the person's income is in excess of the limit, is eligible for medical assistance reimbursement of Medicare Part B premiums if the person's income is less than 120 percent of the official federal poverty guidelines for the applicable family size.\nBeginning July 1, 1998, contingent upon federal funding, a person who would otherwise be eligible as a qualified Medicare beneficiary under subdivision 3, except that the person's income is in excess of the limit, is eligible as a qualifying individual.\nIf the person's income is greater than 120 percent, but less than 135 percent of the official federal poverty guidelines for the applicable family size, the person is eligible for medical assistance reimbursement of Medicare Part B premiums.\nThe commissioner shall limit enrollment of qualifying individuals under this subdivision according to the requirements of Public Law 105-33, section 4732.\nA person who is entitled to Medicare Part A benefits under section 1818A of the Social Security Act; whose income does not exceed 200 percent of the federal poverty guidelines for the applicable family size; whose nonexempt assets do not exceed twice the maximum amount allowable under the Supplemental Security Income program, according to family size; and who is not otherwise eligible for medical assistance, is eligible for medical assistance reimbursement of the Medicare Part A premium.\nA person who is at least 18 years old, who was eligible for Supplemental Security Income benefits on the basis of blindness or disability, who became disabled or blind before reaching the age of 22, and who lost eligibility as a result of becoming entitled to a child's insurance benefits on or after July 1, 1987, under section 202(d) of the Social Security Act, or because of an increase in those benefits effective on or after July 1, 1987, is eligible for medical assistance as long as the person would be entitled to Supplemental Security Income in the absence of child's insurance benefits or increases in those benefits.\nA person who is at least 50 years old who is entitled to disabled widow's or widower's benefits under United States Code, title 42, section 402(e) or (f), who is not entitled to Medicare Part A, and who received Supplemental Security Income or Minnesota supplemental aid in the month before the month the widow's or widower's benefits began, is eligible for medical assistance as long as the person would be entitled to Supplemental Security Income or Minnesota supplemental aid in the absence of the widow's or widower's benefits.\nMS 2020 [Repealed, 2022 c 98 art 2 s 16]\nMS 2018 [Repealed, 2020 c 115 art 3 s 40]\n(a) Medical assistance may be paid for a person who is employed and who:\n(1) but for excess earnings or assets meets the definition of disabled under the Supplemental Security Income program; and\n(2) pays a premium and other obligations under paragraph (d).\n(b) For purposes of eligibility, there is a $65 earned income disregard. To be eligible for medical assistance under this subdivision, a person must have more than $65 of earned income, be receiving an unemployment insurance benefit under chapter 268 that the person began receiving while eligible under this subdivision, or be receiving family and medical leave benefits under chapter 268B that the person began receiving while eligible under this subdivision. A person who is self-employed must file and pay all applicable taxes. Any spousal income shall be disregarded for purposes of eligibility and premium determinations.\n(c) After the month of enrollment, a person enrolled in medical assistance under this subdivision who would otherwise be ineligible and be disenrolled due to one of the following circumstances may retain eligibility for up to four consecutive months after a month of job loss if the person:\n(1) is temporarily unable to work and without receipt of earned income due to a medical condition, as verified by a physician, advanced practice registered nurse, or physician assistant; or\n(2) loses employment for reasons not attributable to the enrollee, and is without receipt of earned income.\nTo receive a four-month extension of continued eligibility under this paragraph, enrollees must verify the medical condition or provide notification of job loss, continue to meet all other eligibility requirements, and continue to pay all calculated premium costs.\n(d) All enrollees must pay a premium to be eligible for medical assistance under this subdivision, except as provided under clause (5).\n(1) An enrollee must pay the greater of a $35 premium or the premium calculated based on the person's gross earned and unearned income and the applicable family size using a sliding fee scale established by the commissioner, which begins at one percent of income at 100 percent of the federal poverty guidelines and increases to 7.5 percent of income for those with incomes at or above 300 percent of the federal poverty guidelines.\n(2) Annual adjustments in the premium schedule based upon changes in the federal poverty guidelines shall be effective for premiums due in July of each year.\n(3) All enrollees who receive unearned income must pay one-half of one percent of unearned income in addition to the premium amount, except as provided under clause (5).\n(4) Increases in benefits under title II of the Social Security Act shall not be counted as income for purposes of this subdivision until July 1 of each year.\n(5) Effective July 1, 2009, American Indians are exempt from paying premiums as required by section 5006 of the American Recovery and Reinvestment Act of 2009, Public Law 111-5. For purposes of this clause, an American Indian is any person who meets the definition of Indian according to Code of Federal Regulations, title 42, section 447.50.\n(e) A person's eligibility and premium shall be determined by the local county agency. Premiums must be paid to the commissioner. All premiums are dedicated to the commissioner.\n(f) Any required premium shall be determined at application and redetermined at the enrollee's 12-month income review or when a change in income or household size is reported. Enrollees must report any change in income or household size within 30 days of when the change occurs. A decreased premium resulting from a reported change in income or household size shall be effective the first day of the next available billing month after the change is reported. Except for changes occurring from annual cost-of-living increases, a change resulting in an increased premium shall not affect the premium amount until the next 12-month review.\n(g) Premium payment is due upon notification from the commissioner of the premium amount required. Premiums may be paid in installments at the discretion of the commissioner.\n(h) Nonpayment of the premium shall result in denial or termination of medical assistance unless the person demonstrates good cause for nonpayment. \"Good cause\" means an excuse for the enrollee's failure to pay the required premium when due because the circumstances were beyond the enrollee's control or not reasonably foreseeable. The commissioner shall determine whether good cause exists based on the weight of the supporting evidence submitted by the enrollee to demonstrate good cause. Except when an installment agreement is accepted by the commissioner, all persons disenrolled for nonpayment of a premium must pay any past due premiums as well as current premiums due prior to being reenrolled. Nonpayment shall include payment with a returned, refused, or dishonored instrument. The commissioner may require a guaranteed form of payment as the only means to replace a returned, refused, or dishonored instrument.\n(i) For enrollees whose income does not exceed 200 percent of the federal poverty guidelines and who are also enrolled in Medicare, the commissioner shall reimburse the enrollee for Medicare part B premiums under section 256B.0625, subdivision 15, paragraph (a).\n(j) The commissioner is authorized to determine that a premium amount was calculated or billed in error, make corrections to financial records and billing systems, and refund premiums collected in error.\n[See Note.]\n(a) Medical assistance may be paid for a person who:\n(1) has been screened for breast or cervical cancer by any Centers for Disease Control and Prevention (CDC) National Breast and Cervical Cancer Early Detection Program (NBCCEDP)-funded breast and cervical cancer control program, and program funds have been used to pay for the person's screening;\n(2) according to the person's treating health professional, needs treatment, including diagnostic services necessary to determine the extent and proper course of treatment, for breast or cervical cancer, including precancerous conditions and early stage cancer;\n(3) meets the income eligibility guidelines for any CDC NBCCEDP-funded breast and cervical cancer control program;\n(4) is under age 65;\n(5) is not otherwise eligible for medical assistance under United States Code, title 42, section 1396a(a)(10)(A)(i); and\n(6) is not otherwise covered under creditable coverage, as defined under United States Code, title 42, section 1396a(aa).\n(b) Medical assistance provided for an eligible person under this subdivision shall be limited to services provided during the period that the person receives treatment for breast or cervical cancer.\n(c) A person meeting the criteria in paragraph (a) is eligible for medical assistance without meeting the eligibility criteria relating to income and assets in section 256B.056, subdivisions 1a to 5a.\nMS 2009 Supp [Expired, 2009 c 79 art 5 s 19; 2009 c 173 art 1 s 18]\nThe commissioner shall establish a process to qualify hospitals that are participating providers under the medical assistance program to determine presumptive eligibility for medical assistance for applicants who may have a basis of eligibility using the modified adjusted gross income methodology as defined in section 256B.056, subdivision 1a, paragraph (b), clause (1).",
	"repealed": false
}