{
	"id": "97B.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.015",
	"title": "97B.015 FIREARMS SAFETY AND WILDLIFE IDENTIFICATION COURSE.",
	"text": "The commissioner shall establish a statewide course in the safe use of firearms and identification of wild mammals and birds. A course may be held in a school district. The courses must be conducted by the commissioner in cooperation with other organizations. The courses must instruct youths in commonly accepted principles of safety in hunting and handling common hunting firearms and identification of various species of wild mammals and birds by sight and other unique characteristics.\n(a) The commissioner shall appoint a qualified person from the Enforcement Division under civil service rules as supervisor of hunting safety and prescribe the duties and responsibilities of the position. The commissioner shall determine and provide the Enforcement Division with the necessary personnel for this section.\n(b) The Enforcement Division may appoint instructors necessary for this section. Instructors shall serve on a voluntary basis without compensation. The Enforcement Division must supply the materials necessary for the course. School districts may cooperate with the commissioner and volunteer instructors to provide space for the classroom portion of the training.\nThe commissioner shall obtain insurance to cover all liability incurred by the county directors and instructors for bodily injury, death, and property damage in the performance of their duties under this section.\nTo defray the expense of the course, the Enforcement Division shall collect a fee from each person that takes the firearm safety course. The commissioner shall establish a fee that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the services. The fee is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The fees shall be deposited in the game and fish fund and the amount thereof is appropriated annually to the Enforcement Division of the Department of Natural Resources for the administration of the program. In addition to the fee established by the commissioner, instructors may charge each person up to the established fee amount for class materials and expenses.\nThe commissioner shall issue a firearms safety certificate to a person that satisfactorily completes the required course of instruction. A person must be at least age 11 to take the firearms safety course and may receive a firearms safety certificate, but the certificate is not valid for hunting until the year the person reaches age 12. A person who is age 11 and has a firearms safety certificate may purchase a license to take big game that will be valid for hunting during the entire regular season for which the license is valid if the person will reach age 12 during that calendar year. A firearms safety certificate issued to a person under age 12 by another state as provided in section 97B.020 is not valid for hunting in Minnesota until the person reaches age 12. The form and content of the firearms safety certificate shall be prescribed by the commissioner.\nNotwithstanding subdivision 5, a person who has successfully completed basic training in the United States armed forces is exempt from the range and shooting exercise portion of the required course of instruction for the firearms safety certificate. The commissioner may require written proof of the person's military training, as deemed appropriate for implementing this subdivision. The commissioner shall publicly announce this exemption from the range and shooting exercise requirement and the availability of the department's online, remote study option for adults seeking firearms safety certification. Military personnel are not exempt from any other requirement of this section for obtaining a firearms safety certificate.\nUpon the recommendation of a course instructor, the commissioner may issue a provisional firearms safety certificate to a person who satisfactorily completes the classroom portion of the firearms safety course but is unable to pass the written or an alternate format exam portion of the course because of a permanent physical disability or developmental disability as defined in section 97B.1055, subdivision 1. The certificate is valid only when used according to section 97B.1055.\nThe commissioner shall collect a fee, to include a $1 issuing fee for licensing agents, for issuing a duplicate firearms safety certificate. The commissioner shall establish a fee that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the service. The fee is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The commissioner may establish the fee notwithstanding section 16A.1283. The duplicate certificate fees, except for the issuing fee for licensing agents under this subdivision, shall be deposited in the game and fish fund and, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, and issuing fees collected by the commissioner, are appropriated annually to the Enforcement Division of the Department of Natural Resources for the administration of the firearm safety course program.",
	"repealed": false
}