{
	"id": "144G.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.52",
	"title": "144G.52 ASSISTED LIVING CONTRACT TERMINATIONS.",
	"text": "For purposes of sections 144G.52 to 144G.55, \"termination\" means:\n(1) a facility-initiated termination of housing provided to the resident under the contract; or\n(2) a facility-initiated termination or nonrenewal of all assisted living services the resident receives from the facility under the contract.\n(a) Before issuing a notice of termination of an assisted living contract, a facility must schedule and participate in a meeting with the resident and the resident's legal representative and designated representative. The purposes of the meeting are to:\n(1) explain in detail the reasons for the proposed termination; and\n(2) identify and offer reasonable accommodations or modifications, interventions, or alternatives to avoid the termination or enable the resident to remain in the facility, including but not limited to securing services from another provider of the resident's choosing that may allow the resident to avoid the termination. A facility is not required to offer accommodations, modifications, interventions, or alternatives that fundamentally alter the nature of the operation of the facility.\n(b) The meeting must be scheduled to take place at least seven days before a notice of termination is issued. The facility must make reasonable efforts to ensure that the resident, legal representative, and designated representative are able to attend the meeting.\n(c) The facility must notify the resident that the resident may invite family members, relevant health professionals, a representative of the Office of Ombudsman for Long-Term Care, a representative of the Office of Ombudsman for Mental Health and Developmental Disabilities, or other persons of the resident's choosing to participate in the meeting. For residents who receive home and community-based waiver services under chapter 256S and section 256B.49, the facility must notify the resident's case manager of the meeting.\n(d) In the event of an emergency relocation under subdivision 9, where the facility intends to issue a notice of termination and an in-person meeting is impractical or impossible, the facility must use telephone, video, or other electronic means to conduct and participate in the meeting required under this subdivision and rules within Minnesota Rules, chapter 4659.\n(a) A facility may initiate a termination of housing because of nonpayment of rent or a termination of services because of nonpayment for services. Upon issuance of a notice of termination for nonpayment, the facility must inform the resident that public benefits may be available and must provide contact information for the Senior LinkAge Line under section 256.975, subdivision 7.\n(b) An interruption to a resident's public benefits that lasts for no more than 60 days does not constitute nonpayment.\nA facility may initiate a termination of the assisted living contract if the resident violates a lawful provision of the contract and the resident does not cure the violation within a reasonable amount of time after the facility provides written notice of the ability to cure to the resident. Written notice of the ability to cure may be provided in person or by first class mail. A facility is not required to provide a resident with written notice of the ability to cure for a violation that threatens the health or safety of the resident or another individual in the facility, or for a violation that constitutes illegal conduct.\n(a) A facility may initiate an expedited termination of housing or services if:\n(1) the resident has engaged in conduct that substantially interferes with the rights, health, or safety of other residents;\n(2) the resident has engaged in conduct that substantially and intentionally interferes with the safety or physical health of facility staff; or\n(3) the resident has committed an act listed in section 504B.171 that substantially interferes with the rights, health, or safety of other residents.\n(b) A facility may initiate an expedited termination of services if:\n(1) the resident has engaged in conduct that substantially interferes with the resident's health or safety;\n(2) the resident's assessed needs exceed the scope of services agreed upon in the assisted living contract and are not included in the services the facility disclosed in the uniform checklist; or\n(3) extraordinary circumstances exist, causing the facility to be unable to provide the resident with the services disclosed in the uniform checklist that are necessary to meet the resident's needs.\nA facility may not terminate the assisted living contract if the underlying reason for termination may be resolved by the resident obtaining services from another provider of the resident's choosing and the resident obtains those services.\n(a) A facility terminating a contract must issue a written notice of termination according to this section. The facility must also send a copy of the termination notice to the Office of Ombudsman for Long-Term Care and, for residents who receive home and community-based waiver services under chapter 256S and section 256B.49, to the resident's case manager, as soon as practicable after providing notice to the resident. A facility may terminate an assisted living contract only as permitted under subdivisions 3, 4, and 5.\n(b) A facility terminating a contract under subdivision 3 or 4 must provide a written termination notice at least 30 days before the effective date of the termination to the resident, legal representative, and designated representative.\n(c) A facility terminating a contract under subdivision 5 must provide a written termination notice at least 15 days before the effective date of the termination to the resident, legal representative, and designated representative.\n(d) If a resident moves out of a facility or cancels services received from the facility, nothing in this section prohibits a facility from enforcing against the resident any notice periods with which the resident must comply under the assisted living contract.\nThe notice required under subdivision 7 must contain, at a minimum:\n(1) the effective date of the termination of the assisted living contract;\n(2) a detailed explanation of the basis for the termination, including the clinical or other supporting rationale;\n(3) a detailed explanation of the conditions under which a new or amended contract may be executed;\n(4) a statement that the resident has the right to appeal the termination by requesting a hearing, and information concerning the time frame within which the request must be submitted and the contact information for the agency to which the request must be submitted;\n(5) a statement that the facility must participate in a coordinated move to another provider or caregiver, as required under section 144G.55;\n(6) the name and contact information of the person employed by the facility with whom the resident may discuss the notice of termination;\n(7) information on how to contact the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities to request an advocate to assist regarding the termination;\n(8) information on how to contact the Senior LinkAge Line under section 256.975, subdivision 7, and an explanation that the Senior LinkAge Line may provide information about other available housing or service options; and\n(9) if the termination is only for services, a statement that the resident may remain in the facility and may secure any necessary services from another provider of the resident's choosing.\n(a) A facility may remove a resident from the facility in an emergency if necessary due to a resident's urgent medical needs or an imminent risk the resident poses to the health or safety of another facility resident or facility staff member. An emergency relocation is not a termination.\n(b) In the event of an emergency relocation, the facility must provide a written notice that contains, at a minimum:\n(1) the reason for the relocation;\n(2) the name and contact information for the location to which the resident has been relocated and any new service provider;\n(3) contact information for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities;\n(4) if known and applicable, the approximate date or range of dates within which the resident is expected to return to the facility, or a statement that a return date is not currently known; and\n(5) a statement that, if the facility refuses to provide housing or services after a relocation, the resident has the right to appeal under section 144G.54. The facility must provide contact information for the agency to which the resident may submit an appeal.\n(c) The notice required under paragraph (b) must be delivered as soon as practicable to:\n(1) the resident, legal representative, and designated representative;\n(2) for residents who receive home and community-based waiver services under chapter 256S and section 256B.49, the resident's case manager; and\n(3) the Office of Ombudsman for Long-Term Care if the resident has been relocated and has not returned to the facility within four days.\n(d) Following an emergency relocation, a facility's refusal to provide housing or services constitutes a termination and triggers the termination process in this section.\nIf a resident is absent from a facility for any reason, including an emergency relocation, the facility shall not refuse to allow a resident to return if a termination of housing has not been effectuated.",
	"repealed": false
}