{
	"id": "299A.465",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.465",
	"title": "299A.465 CONTINUED HEALTH INSURANCE COVERAGE.",
	"text": "(a) This subdivision applies to any peace officer or firefighter:\n(1) who the Public Employees Retirement Association or the Minnesota State Retirement System determines is eligible to receive a duty disability benefit pursuant to section 353.656 or 352B.10, subdivision 1, respectively; or\n(2) who (i) does not qualify to receive disability benefits by operation of the eligibility requirements set forth in section 353.656, subdivision 1, paragraph (b), (ii) retires pursuant to section 353.651, subdivision 4, or (iii) is a member of a local police or salaried firefighters relief association and qualifies for a duty disability benefit under the terms of plans of the relief associations, and the peace officer or firefighter described in item (i), (ii), or (iii) has discontinued public service as a peace officer or firefighter as a result of a disabling injury and has been determined, by the Public Employees Retirement Association, to have otherwise met the duty disability criteria set forth in section 353.01, subdivision 41.\n(b) A determination made on behalf of a peace officer or firefighter described in paragraph (a), clause (2), must be at the request of the peace officer or firefighter made for the purposes of this section. Determinations made in accordance with paragraph (a) are binding on the peace officer or firefighter, employer, and state. The determination must be made by the executive director of the Public Employees Retirement Association or by the executive director of the Minnesota State Retirement System, whichever applies, and is not subject to section 356.96, subdivision 2. Upon making a determination, the executive director shall provide written notice to the peace officer or firefighter and the employer. This notice must include:\n(1) a written statement of the reasons for the determination;\n(2) a notice that the person may petition for a review of the determination by requesting that a contested case be initiated before the Office of Administrative Hearings, the cost of which must be borne by the peace officer or firefighter and the employer; and\n(3) a statement that any person who does not petition for a review within 60 days is precluded from contesting issues determined by the executive director in any other administrative review or court procedure.\nIf, prior to the contested case hearing, additional information is provided to support the claim for duty disability as defined in section 352B.011, subdivision 7, or 353.01, subdivision 41, whichever applies, the executive director may reverse the determination without the requested hearing. If a hearing is held before the Office of Administrative Hearings, the determination rendered by the judge conducting the fact-finding hearing is a final decision and order under section 14.62, subdivision 2a, and is binding on the applicable executive director, the peace officer or firefighter, employer, and state. Review of a final determination made by the Office of Administrative Hearings under this section may only be obtained by writ of certiorari to the Minnesota Court of Appeals under sections 14.63 to 14.68. Only the peace officer or firefighter, employer, and state have standing to participate in a judicial review of the decision of the Office of Administrative Hearings.\n(c) The officer's or firefighter's employer shall continue to provide health coverage for:\n(1) the officer or firefighter; and\n(2) the officer's or firefighter's dependents if the officer or firefighter was receiving dependent coverage at the time of the injury under the employer's group health plan.\n(d) The employer is responsible for the continued payment of the employer's contribution for coverage of the officer or firefighter and, if applicable, the officer's or firefighter's dependents. Coverage must continue for the officer or firefighter and, if applicable, the officer's or firefighter's dependents until the officer or firefighter reaches or, if deceased, would have reached the age of 65. However, coverage for dependents does not have to be continued after the person is no longer a dependent.\n(a) This subdivision applies when a peace officer, firefighter, or volunteer firefighter is killed while on duty and discharging the officer's, firefighter's, or volunteer firefighter's duties as a peace officer, firefighter, or volunteer firefighter.\n(b) The officer's or firefighter's employer shall continue to cover the deceased officer's or firefighter's dependents, including the officer's or firefighter's spouse:\n(1) if the officer, firefighter, or volunteer firefighter was receiving dependent coverage at the time of the officer's, firefighter's, or volunteer firefighter's death under the employer's group health plan; or\n(2) if the officer's, firefighter's, or volunteer firefighter's spouse was not covered as a dependent at the time of the officer's, firefighter's, or volunteer firefighter's death, but at that time was eligible, or afterward becomes eligible, to be a dependent on the employer's group health plan.\n(c) The employer is responsible for the employer's contribution for the coverage of the officer's, firefighter's, or volunteer firefighter's dependents. Subject to subdivision 5, paragraph (b), clause (2), coverage must continue for a dependent of the officer, firefighter, or volunteer firefighter as follows: (1) for a surviving spouse, until the surviving spouse reaches the age of 65; and (2) for each other dependent, until the dependent reaches the age of 26, except as otherwise provided in section 62L.02, subdivision 11.\n(a) This subdivision applies when a volunteer firefighter is killed while on duty and discharging the volunteer firefighter's duties as a volunteer firefighter and the municipality or municipalities that operate the fire department did not offer a group health insurance policy to which a volunteer firefighter was eligible to subscribe.\n(b) The municipality or municipalities that operate the fire department that the volunteer firefighter served with shall, until coverage terminates as provided under subdivision 2, paragraph (c), either: (1) provide health insurance coverage for the volunteer firefighter's dependents that is equivalent to the average benefit provided by the municipality or municipalities to dependents of its employees who are covered by the plan; or (2) reimburse the dependents, if the municipality or municipalities do not offer a group health insurance plan for any employees, for a minimum of 50 percent of the cost of health insurance premiums for coverage selected by the dependents.\nHealth insurance benefits payable to the officer or firefighter and the officer's or firefighter's dependents from any other source provide the primary coverage, and coverage available under this section is secondary.\n(a) A public employer may annually apply by August 1 for the preceding fiscal year to the commissioner of public safety for reimbursement of its costs of complying with this section and sections 352B.102 and 353.032. Except as provided for in paragraph (b), the commissioner shall provide reimbursement to the public employer out of the public safety officer's benefit account.\n(b) Beginning on January 1, 2024, a public employer is not eligible for reimbursement under paragraph (a) unless the employer provides at least one of the following:\n(1) annual wellness training to peace officers and firefighters who either are employed or volunteer for the employer; or\n(2) an employee assistance program or peer support program.\n(c) Wellness training for peace officers under paragraph (b), clause (1), must incorporate the learning objectives established by the Peace Officer Standards and Training Board under section 626.8478. No later than February 1, 2024, the Minnesota Fire Initiative must create a wellness training program for public employers to offer to firefighters to satisfy the requirements of paragraph (b). Training programs established in the Hometown Heroes Assistance Program under section 299A.477, subdivision 2, clause (4), satisfy the requirements of paragraph (b).\nFor purposes of this section:\n(a) \"Peace officer\" or \"officer\" has the meaning given in section 626.84, subdivision 1, paragraph (c).\n(b) \"Dependent\" means a person who: (1) meets the definition of dependent in section 62L.02, subdivision 11, at the time of the officer's or firefighter's injury or death, or at the time of the volunteer firefighter's death; and (2) is not covered under another group health plan. For purposes of this section, the term \"eligible employee\" as defined under section 62L.02, subdivision 13, includes a volunteer firefighter.\n(c) \"Firefighter\" has the meaning given in Minnesota Statutes 2000, section 424.03, but does not include volunteer firefighters.\n(d) \"Volunteer firefighter\" has the meaning given in section 299N.03, subdivision 7, and includes paid per call.\n(e) \"Fire department\" has the meaning given in section 299N.03, subdivision 4.\n(f) For purposes of subdivisions 2 to 5a, \"employer\" includes a municipality or municipalities that operate the fire department in which a volunteer firefighter serves.\nNothing in this section prohibits an employer from providing benefits to survivors of deceased volunteer firefighters that are greater than the benefits required under this section.\nMS 2006 [Expired, 2005 c 136 art 8 s 7]\nMS 2006 [Expired, 2005 c 136 art 8 s 8]",
	"repealed": false
}