{
	"id": "299E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/299E.04",
	"title": "299E.04 ADVISORY COMMITTEE ON CAPITOL AREA SECURITY.",
	"text": "The advisory committee on Capitol Area Security shall consist of six members, appointed as follows:\n(1) the lieutenant governor;\n(2) two senators, including one member from the majority party, appointed by the senate majority leader, and one member from the minority party, appointed by the senate minority leader;\n(3) two members of the house of representatives, including one member appointed by the speaker of the house and one member appointed by the minority leader; and\n(4) the chief justice of the Minnesota Supreme Court or the designee of the chief justice.\nA member may be removed by the appointing authority at any time at the pleasure of the appointing authority.\n(a) The advisory committee shall meet at least quarterly to assess current safety and security risks in the Capitol Area, as defined by section 15B.02, and discuss developments that might affect those risks in the future. The committee shall provide advice and recommendations to the governor and legislature regarding security priorities, strategies for addressing these priorities, and recommendations for funding to implement the strategies. In performing its duties under this section, the committee shall consult with the commissioners of administration and public safety, the Capitol Area Architectural and Planning Board, the director of the Minnesota Historical Society, and the sergeants-at-arms of the senate and house of representatives.\n(b) The committee shall report to the governor, the chairs and ranking minority members of the legislative committees with jurisdiction over the Capitol Area Architectural and Planning Board and the Department of Public Safety, and chief justice of the supreme court by January 15 of each year. This report shall provide a general assessment of the status of security in the Capitol Area, describe improvements implemented, and recommend future improvements. As appropriate, the committee shall offer recommendations for capital or operating expenditures, statutory changes, or other changes in security-related policies or practices. The report shall include draft legislation to implement any recommended changes in law. Spending recommendations shall be made in a timely manner to ensure that they can be considered as part of the state's capital and operating budget processes.\n(a) The lieutenant governor shall serve as the chair of the committee. The committee may elect a vice-chair to convene and conduct meetings when the lieutenant governor is not available.\n(b) Meetings of the committee shall be subject to chapter 13D.\n(c) Administrative support for the committee shall be provided by the commissioners of administration and public safety and the sergeants-at-arms of the senate and house of representatives.\n(d) The committee shall seek advice from at least one person with experience designating and implementing security for a public college or university campus, at least one person with experience designating and implementing security for courts, and at least one person with experience designating and implementing security for a private Minnesota company.\n(a) The committee is subject to the Minnesota Government Data Practices Act, chapter 13. The committee may request access to nonpublic data, as defined in section 13.02, subdivision 9, as necessary to fulfill its responsibilities under this section. A government entity receiving a request under this subdivision must provide nonpublic data requested by the committee if the government entity reasonably determines that the data requested are relevant to the committee's responsibilities under this section.\n(b) Paragraph (a) must not be construed to give the committee access to data classified under section 13.87, subdivision 2, or data on persons who provide the notice described in section 609.66, subdivision 1g, paragraph (b), clause (2).\nThe advisory committee on Capitol Area Security expires June 30, 2036.",
	"repealed": false
}