{
	"id": "149A.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.73",
	"title": "149A.73 FUNERAL INDUSTRY PRACTICES, GOODS, OR SERVICES.",
	"text": "In selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to require that a casket be purchased for alkaline hydrolysis, cremation, or, effective July 1, 2025, natural organic reduction.\nTo prevent unfair or deceptive acts or practices, if funeral providers arrange for alkaline hydrolysis or cremations, they must make an alkaline hydrolysis container or cremation container available for alkaline hydrolysis or cremations.\n(a) In selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to condition the furnishing of any funeral good, funeral service, burial site good, or burial site service to a consumer arranging a funeral upon the purchase of any other funeral good, funeral service, burial site good, or burial site service, except as may be otherwise required by law or to charge any fee as a condition to furnishing any funeral goods, funeral services, burial site goods, or burial site services to a consumer arranging a funeral, other than the fees for services of funeral director and staff, other funeral services, funeral goods, burial site goods, and burial site services selected by the purchaser, and other funeral goods, funeral services, burial site goods, or burial site services required to be purchased, as explained on the itemized statement in accordance with section 149A.72, subdivision 10.\n(b) In selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to charge an increased price for the handling, placing, or setting of a funeral good or burial site good based upon the fact that the good was not purchased from that funeral provider.\nTo prevent unfair or deceptive acts or practices, funeral providers must place the following disclosure in the general price list, immediately above the prices required by section 149A.71, subdivision 2, paragraph (e), clauses (4) to (10): \"The goods and services shown below are those we can provide to our customers. You may choose only the items you desire. If legal or other requirements mean that you must buy any items you did not specifically ask for, we will explain the reason in writing on the statement we provide describing the funeral goods, funeral services, burial site goods, and burial site services you selected.\" However, if the charge for \"services of funeral director and staff\" cannot be declined by the purchaser, the statement shall include the sentence \"However, any funeral arrangements you select will include a charge for our basic services.\" between the second and third sentences of the sentences specified in this subdivision. The statement may include the phrase \"and overhead\" after the word \"services\" if the fee includes a charge for the recovery of unallocated funeral overhead. If the funeral provider does not include this disclosure statement, then the following disclosure statement must be placed in the statement of funeral goods, funeral services, burial site goods, and burial site services selected, as described in section 149A.71, subdivision 2, paragraph (f): \"Charges are only for those items that you selected or that are required. If we are required by law or by a cemetery, alkaline hydrolysis facility, or crematory to use any items, we will explain the reasons in writing below.\" A funeral provider is not in violation of this subdivision by failing to comply with a request for a combination of goods or services which would be impossible, impractical, or excessively burdensome to provide.\nIt is a deceptive act or practice for a funeral provider to require as a condition of providing any funeral good or burial site good that the funeral good or burial site good be purchased by a consumer when rental of the good is practicable.",
	"repealed": false
}