{
	"id": "611A.203",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.203",
	"title": "611A.203 DOMESTIC FATALITY REVIEW TEAMS.",
	"text": "A judicial district may establish a domestic fatality review team to review domestic violence deaths that have occurred in the district. The team may review cases in which prosecution has been completed or the prosecutorial authority has decided not to pursue the case. The purpose of the review team is to assess domestic violence deaths in order to develop recommendations for policies and protocols for community prevention and intervention initiatives to reduce and eliminate the incidence of domestic violence and resulting fatalities.\n\"Domestic violence death\" means a homicide or suicide under any of the following circumstances:\n(1) the alleged perpetrator and victim resided together at any time;\n(2) the alleged perpetrator and victim have a child in common, regardless of whether they were married or lived together at any time;\n(3) the alleged perpetrator and victim were married, separated, or divorced;\n(4) the alleged perpetrator and victim had a sexual relationship or a significant romantic relationship;\n(5) the alleged perpetrator had been harassing or stalking the victim;\n(6) the homicide victim lived in the same household, was present in the workplace of, was in proximity of, or was related by blood or affinity to a victim who experienced or was threatened with domestic abuse by the alleged perpetrator;\n(7) the victim or the perpetrator was a child of a person in a relationship that is described within this definition; or\n(8) any other circumstances that the domestic fatality review team decides fall within the parameters of its mission.\n\"Domestic violence death\" must be interpreted broadly to give the domestic fatality review team discretion to review fatalities that have occurred both directly and peripherally to domestic relationships.\n(a) The chief judge, in consultation with the family violence coordinating council, shall appoint the members of the domestic fatality review team. Membership must reflect a commitment to diversity and relevant professional experience. The review team members must include:\n(1) the medical examiner;\n(2) a judicial court officer (judge or referee);\n(3) a county and city attorney and a public defender;\n(4) the county sheriff and a peace officer;\n(5) a representative from family court services and the Department of Corrections;\n(6) a physician familiar with domestic violence issues;\n(7) a representative from district court administration and the domestic abuse service center;\n(8) a public citizen representative or a representative from a civic organization;\n(9) a mental health professional; and\n(10) domestic violence advocates or shelter workers.\n(b) There must be at least three domestic violence advocates or shelter workers on the domestic fatality review team. No two members may represent the same agency. Members representing advocates or shelters must be selected by the advocacy community. At least one position must be designated for a minority representative and one position must rotate in order to include an advocate from the community in which the fatality under review took place.\n(c) The domestic fatality review team may also invite other relevant persons to serve on an ad hoc basis and participate as full members of the review team for a particular review. These persons may include, but are not limited to:\n(1) individuals with particular expertise that would be helpful to the review panel; or\n(2) representatives of organizations or agencies that had contact with or provided services to the homicide victim, or to the alleged perpetrator, a victim who experienced or was threatened with domestic abuse by the alleged perpetrator, or a family member of one of those individuals.\n(a) The domestic fatality review team shall collect, review, and analyze death certificates and death data, including investigative reports, medical and counseling records, victim service records, employment records, child abuse reports, or other information concerning domestic violence deaths, survivor interviews and surveys, and other information deemed by the team as necessary and appropriate concerning the causes and manner of domestic violence deaths.\n(b) The review team has access to the following not public data, as defined in section 13.02, subdivision 8a, relating to a case being reviewed by the team: inactive law enforcement investigative data under section 13.82; autopsy records and coroner or medical examiner investigative data under section 13.83; hospital, public health, or other medical records of the victim under section 13.384; records under section 13.46, created by social service agencies that provided services to the victim, the alleged perpetrator, or another victim who experienced or was threatened with domestic abuse by the perpetrator; and child maltreatment records under chapter 260E, relating to the victim or a family or household member of the victim. Access to medical records under this paragraph also includes records governed by sections 144.291 to 144.298. The review team has access to corrections and detention data as provided in section 13.85.\n(c) As part of any review, the domestic fatality review team may compel the production of other records by applying to the district court for a subpoena, which will be effective throughout the state according to the Rules of Civil Procedure.\nA person attending a domestic fatality review team meeting may not disclose what transpired at the meeting, except to carry out the purposes of the review team or as otherwise provided in this subdivision. The review team may disclose the names of the victims in the cases it reviewed. The proceedings and records of the review team are confidential data as defined in section 13.02, subdivision 3, or protected nonpublic data as defined in section 13.02, subdivision 13, regardless of their classification in the hands of the person who provided the data, and are not subject to discovery or introduction into evidence in a civil or criminal action against a professional, the state, or a county agency, arising out of the matters the team is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were presented during proceedings of the review team. This section does not limit a person who presented information before the review team or who is a member of the panel from testifying about matters within the person's knowledge. However, in a civil or criminal proceeding, a person may not be questioned about the person's good faith presentation of information to the review team or opinions formed by the person as a result of the review team meetings.\nMembers of the domestic fatality advisory board, members of the domestic fatality review team, and members of each review panel, as well as their agents or employees, are immune from claims and are not subject to any suits, liability, damages, or any other recourse, civil or criminal, arising from any act, proceeding, decision, or determination undertaken or performed or recommendation made by the domestic fatality review team, provided they acted in good faith and without malice in carrying out their responsibilities. Good faith is presumed until proven otherwise and the complainant has the burden of proving malice or a lack of good faith. No organization, institution, or person furnishing information, data, testimony, reports, or records to the domestic fatality review team as part of an investigation is civilly or criminally liable or subject to any other recourse for providing the information.\n(a) Each domestic fatality review team shall develop a system for evaluating the effectiveness of its program and shall focus on identifiable goals and outcomes. An evaluation must include data components as well as input from individuals involved in the review process.\n(b) Each fatality review team shall issue an annual report to the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over public safety issues. The report must consist of the written aggregate recommendations of the domestic fatality review team without reference to specific cases. The report must be available upon request and distributed to the governor, attorney general, supreme court, county board, and district court.",
	"repealed": false
}