{
	"id": "103I.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.235",
	"title": "103I.235 REAL PROPERTY SALE; DISCLOSURE OF LOCATION OF WELLS.",
	"text": "(a) Before signing an agreement to sell or transfer real property, the seller must disclose in writing to the buyer information about the status and location of all known wells on the property, by delivering to the buyer either a statement by the seller that the seller does not know of any wells on the property, or a disclosure statement indicating the legal description and county, and a map drawn from available information showing the location of each well to the extent practicable. In the disclosure statement, the seller must indicate, for each well, whether the well is in use, not in use, or sealed.\n(b) At the time of closing of the sale, the disclosure statement information, name and mailing address of the buyer, and the quartile, section, township, and range in which each well is located must be provided on a well disclosure certificate signed by the seller or a person authorized to act on behalf of the seller.\n(c) A well disclosure certificate need not be provided if the seller does not know of any wells on the property and the deed or other instrument of conveyance contains the statement: \"The Seller certifies that the Seller does not know of any wells on the described real property.\"\n(d) If a deed is given pursuant to a contract for deed, the well disclosure certificate required by this subdivision shall be signed by the buyer or a person authorized to act on behalf of the buyer. If the buyer knows of no wells on the property, a well disclosure certificate is not required if the following statement appears on the deed followed by the signature of the grantee or, if there is more than one grantee, the signature of at least one of the grantees: \"The Grantee certifies that the Grantee does not know of any wells on the described real property.\" The statement and signature of the grantee may be on the front or back of the deed or on an attached sheet and an acknowledgment of the statement by the grantee is not required for the deed to be recordable.\n(e) This subdivision does not apply to the sale, exchange, or transfer of real property:\n(1) that consists solely of a sale or transfer of severed mineral interests; or\n(2) that consists of an individual condominium unit as described in chapters 515 and 515B.\n(f) For an area owned in common under chapter 515 or 515B the association or other responsible person must report to the commissioner by July 1, 1992, the location and status of all wells in the common area. The association or other responsible person must notify the commissioner within 30 days of any change in the reported status of wells.\n(g) If the seller fails to provide a required well disclosure certificate, the buyer, or a person authorized to act on behalf of the buyer, may sign a well disclosure certificate based on the information provided on the disclosure statement required by this section or based on other available information.\n(h) A county recorder or registrar of titles may not record a deed or other instrument of conveyance dated after October 31, 1990, for which a certificate of value is required under section 272.115, or any deed or other instrument of conveyance dated after October 31, 1990, from a governmental body exempt from the payment of state deed tax, unless the deed or other instrument of conveyance contains the statement made in accordance with paragraph (c) or (d) or is accompanied by the well disclosure certificate containing all the information required by paragraph (b) or (d). The county recorder or registrar of titles must not accept a certificate unless it contains all the required information. The county recorder or registrar of titles shall note on each deed or other instrument of conveyance accompanied by a well disclosure certificate that the well disclosure certificate was received. The notation must include the statement \"No wells on property\" if the disclosure certificate states there are no wells on the property. The well disclosure certificate shall not be filed or recorded in the records maintained by the county recorder or registrar of titles. After noting \"No wells on property\" on the deed or other instrument of conveyance, the county recorder or registrar of titles shall destroy or return to the buyer the well disclosure certificate. The county recorder or registrar of titles shall collect from the buyer or the person seeking to record a deed or other instrument of conveyance, a fee of $50 for receipt of a completed well disclosure certificate. By the tenth day of each month, the county recorder or registrar of titles shall transmit the well disclosure certificates to the commissioner of health. By the tenth day after the end of each calendar quarter, the county recorder or registrar of titles shall transmit to the commissioner of health $42.50 of the fee for each well disclosure certificate received during the quarter. The commissioner shall maintain the well disclosure certificate for at least six years. The commissioner may store the certificate as an electronic image. A copy of that image shall be as valid as the original.\n(i) No new well disclosure certificate is required under this subdivision if the buyer or seller, or a person authorized to act on behalf of the buyer or seller, certifies on the deed or other instrument of conveyance that the status and number of wells on the property have not changed since the last previously filed well disclosure certificate. The following statement, if followed by the signature of the person making the statement, is sufficient to comply with the certification requirement of this paragraph: \"I am familiar with the property described in this instrument and I certify that the status and number of wells on the described real property have not changed since the last previously filed well disclosure certificate.\" The certification and signature may be on the front or back of the deed or on an attached sheet and an acknowledgment of the statement is not required for the deed or other instrument of conveyance to be recordable.\n(j) The commissioner in consultation with county recorders shall prescribe the form for a well disclosure certificate and provide well disclosure certificate forms to county recorders and registrars of titles and other interested persons.\n(k) Failure to comply with a requirement of this subdivision does not impair:\n(1) the validity of a deed or other instrument of conveyance as between the parties to the deed or instrument or as to any other person who otherwise would be bound by the deed or instrument; or\n(2) the record, as notice, of any deed or other instrument of conveyance accepted for filing or recording contrary to the provisions of this subdivision.\nUnless the buyer and seller agree to the contrary, in writing, before the closing of the sale, a seller who fails to disclose the existence or known status of a well at the time of sale and knew or had reason to know of the existence or known status of the well, is liable to the buyer for costs relating to sealing of the well and reasonable attorney fees for collection of costs from the seller, if the action is commenced within six years after the date the buyer closed the purchase of the real property where the well is located.\nThis section does not apply to temporary borings or unsuccessful wells that have been sealed by a licensed contractor in compliance with this chapter.",
	"repealed": false
}