{
	"id": "245D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.03",
	"title": "245D.03 APPLICABILITY AND EFFECT.",
	"text": "(a) The commissioner shall regulate the provision of home and community-based services to persons with disabilities and persons age 65 and older pursuant to this chapter. The licensing standards in this chapter govern the provision of basic support services and intensive support services.\n(b) Basic support services provide the level of assistance, supervision, and care that is necessary to ensure the health and welfare of the person and do not include services that are specifically directed toward the training, treatment, habilitation, or rehabilitation of the person. Basic support services include:\n(1) in-home and out-of-home respite care services as defined in section 245A.02, subdivision 15, and under the brain injury, community alternative care, community access for disability inclusion, developmental disabilities, and elderly waiver plans, excluding out-of-home respite care provided to children in a family child foster care home licensed under Minnesota Rules, parts 2960.3000 to 2960.3100, when the child foster care license holder complies with the requirements under section 245D.06, subdivisions 5, 6, 7, and 8, or successor provisions; and section 245D.061 or successor provisions, which must be stipulated in the statement of intended use required under Minnesota Rules, part 2960.3000, subpart 4;\n(2) adult companion services as defined under the elderly waiver plan, excluding adult companion services provided under the Corporation for National and Community Services Senior Companion Program established under the Domestic Volunteer Service Act of 1973, Public Law 98-288;\n(3) 24-hour emergency assistance, personal emergency response as defined under the community access for disability inclusion and developmental disabilities waiver plans;\n(4) night supervision services as defined under the brain injury, community access for disability inclusion, community alternative care, and developmental disabilities waiver plans;\n(5) homemaker services as defined under the community access for disability inclusion, brain injury, community alternative care, developmental disabilities, and elderly waiver plans, excluding providers licensed by the Department of Health under chapter 144A and those providers providing cleaning services only;\n(6) individual community living support under section 256S.13; and\n(7) individualized home supports without training services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans.\n(c) Intensive support services provide assistance, supervision, and care that is necessary to ensure the health and welfare of the person and services specifically directed toward the training, habilitation, or rehabilitation of the person. Intensive support services include:\n(1) intervention services, including:\n(i) positive support services as defined under the brain injury and community access for disability inclusion, community alternative care, and developmental disabilities waiver plans;\n(ii) in-home or out-of-home crisis respite services as defined under the brain injury, community access for disability inclusion, community alternative care, and developmental disabilities waiver plans; and\n(iii) specialist services as defined under the current brain injury, community access for disability inclusion, community alternative care, and developmental disabilities waiver plans;\n(2) in-home support services, including:\n(i) semi-independent living services;\n(ii) individualized home support with training services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans; and\n(iii) individualized home support with family training services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(3) residential supports and services, including:\n(i) community residential services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans provided in a corporate child foster care residence, a community residential setting, or a supervised living facility;\n(ii) family residential services as defined in the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans provided in a family child foster care residence or a family adult foster care residence;\n(iii) residential services provided to more than four persons with developmental disabilities in a supervised living facility, including ICFs/DD; and\n(iv) life sharing as defined in the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(4) day services, including:\n(i) day support services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(ii) day training and habilitation services under sections 252.41 to 252.46; and\n(iii) prevocational services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(5) employment exploration services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(6) employment development services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans;\n(7) employment support services as defined under the brain injury, community alternative care, community access for disability inclusion, and developmental disabilities waiver plans; and\n(8) integrated community support as defined under the brain injury and community access for disability inclusion waiver plans beginning January 1, 2021, and community alternative care and developmental disabilities waiver plans beginning January 1, 2023.\n[See Note.]\nThe home and community-based services standards establish health, safety, welfare, and rights protections for persons receiving services governed by this chapter. The standards recognize the diversity of persons receiving these services and require that these services are provided in a manner that meets each person's individual needs and ensures continuity in service planning, care, and coordination between the license holder and members of each person's support team or expanded support team.\n(a) A license holder governed by this chapter is also subject to the licensure requirements under chapter 245A.\n(b) This chapter does not apply to corporate or family child foster care homes that do not provide services licensed under this chapter.\n(c) A family adult foster care site controlled by a license holder providing services governed by this chapter is exempt from compliance with Minnesota Rules, parts 9555.6185; 9555.6225, subpart 8; 9555.6245; 9555.6255; and 9555.6265. These exemptions apply to family adult foster care homes where at least one resident is receiving residential supports and services licensed according to this chapter. This chapter does not apply to family adult foster care homes that do not provide services licensed under this chapter.\n(d) A license holder providing services licensed according to this chapter in a supervised living facility is exempt from compliance with section 245D.04.\n(e) A license holder providing residential services to persons in an ICF/DD is exempt from compliance with sections 245D.04; 245D.05, subdivision 1b; 245D.06, subdivision 2, clauses (4) and (5); 245D.071, subdivisions 4 and 5; 245D.081, subdivision 2; 245D.09, subdivision 7; 245D.095, subdivision 2; and 245D.11, subdivision 3.\n(f) A license holder providing homemaker services licensed according to this chapter and registered according to chapter 144A is exempt from compliance with section 245D.04.\n(g) Nothing in this chapter prohibits a license holder from concurrently serving persons without disabilities or people who are or are not age 65 and older, provided this chapter's standards are met as well as other relevant standards.\n(h) The documentation required under sections 245D.07 and 245D.071 must meet the individual program plan requirements identified in section 256B.092 or successor provisions.\nIf the conditions in section 245A.04, subdivision 9, are met, the commissioner may grant a variance to any of the requirements in this chapter, except sections 245D.04; 245D.06, subdivision 4, paragraph (b), and subdivision 6, or successor provisions; and provisions governing data practices and information rights of persons.\n[Repealed by amendment, 2013 c 108 art 8 s 23]\nAn applicant or a license holder may apply for program certification as identified in section 245D.33.",
	"repealed": false
}