{
	"id": "216H.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/216H.03",
	"title": "216H.03 FAILURE TO ADOPT GREENHOUSE GAS CONTROL PLAN.",
	"text": "For the purpose of this section, \"new large energy facility\" means a large energy facility, as defined in section 216B.2421, subdivision 2, clause (1), that is not in operation as of January 1, 2007, but does not include a facility that (1) uses natural gas as a primary fuel, (2) is a cogeneration facility or combined heat and power facility located in the electric service area of a public utility, as defined in section 216B.02, subdivision 4, or is designed to provide peaking, intermediate, emergency backup, or contingency services, (3) uses a simple cycle or combined cycle turbine technology, and (4) is capable of achieving full load operations within 45 minutes of start-up for a simple cycle facility, or is capable of achieving minimum load operations within 185 minutes of start-up for a combined cycle facility.\nFor the purpose of this section, \"statewide power sector carbon dioxide emissions\" means the total annual emissions of carbon dioxide from the generation of electricity within the state and all emissions of carbon dioxide from the generation of electricity imported from outside the state and consumed in Minnesota. Emissions of carbon dioxide associated with transmission and distribution line losses are included in this definition. Carbon dioxide that is injected into geological formations to prevent its release to the atmosphere in compliance with applicable laws, and emissions of carbon dioxide associated with the combustion of biomass, as defined in section 216B.2411, subdivision 2, paragraph (c), clauses (1) to (4), are not counted as contributing to statewide power sector carbon dioxide emissions.\nUnless preempted by federal law, until a comprehensive and enforceable state law or rule pertaining to greenhouse gases that directly limits and substantially reduces, over time, statewide power sector carbon dioxide emissions is enacted and in effect, and except as allowed in subdivisions 4 to 7, on and after August 1, 2009, no person shall construct within the state a new large energy facility that would contribute to statewide power sector carbon dioxide emissions.\n(a) The prohibition under subdivision 3 does not apply if the project proponent demonstrates to the Public Utilities Commission's satisfaction that it will offset the new contribution to statewide power sector carbon dioxide emissions with a carbon dioxide reduction project identified in paragraph (b) and in compliance with paragraph (c).\n(b) A project proponent may offset in an amount equal to or greater than the proposed new contribution to statewide power sector carbon dioxide emissions in either, or a combination of both, of the following ways:\n(1) by reducing an existing facility's contribution to statewide power sector carbon dioxide emissions; or\n(2) by purchasing carbon dioxide allowances from a state or group of states that has a carbon dioxide cap and trade system in place that produces verifiable emissions reductions.\n(c) The Public Utilities Commission shall not find that a proposed carbon dioxide reduction project identified in paragraph (b) acceptably offsets a new contribution to statewide power sector carbon dioxide emissions unless the proposed offsets are permanent, quantifiable, verifiable, enforceable, and would not have otherwise occurred. This section does not exempt emissions that have been offset under this subdivision and emissions exempted under subdivisions 5 to 7 from a cap and trade system if adopted by the state.\nThe prohibitions in subdivision 3 do not apply to increases in statewide power sector carbon dioxide emissions from a new steel production project located in a taconite relief area that has filed an application for an air quality permit from the Pollution Control Agency prior to January 1, 2007.\nThe prohibitions in subdivision 3 do not apply to an iron nugget production facility that began construction prior to January 31, 2007, nor to associated mining activities and beneficiation facilities with a concentrate capacity of up to three million tons annually. For the purposes of this subdivision, \"iron nugget\" means a product with at least 90 percent iron content.\nThe prohibition under subdivision 3 does not apply to:\n(1) a new large energy facility under consideration by the Public Utilities Commission pursuant to proposals or applications filed with the Public Utilities Commission before April 1, 2007, or to any power purchase agreement related to a facility described in this clause. The exclusion of pending proposals and applications from the prohibitions in subdivision 3 does not limit the applicability of any other law and is not an expression of legislative intent regarding whether any pending proposal or application should be approved or denied;\n(2) a contract not subject to commission approval that was entered into prior to April 1, 2007, to purchase power from a new large energy facility that was approved by a comparable authority in another state prior to that date, for which municipal or public power district bonds have been issued, and on which construction has begun;\n(3) a new large energy facility located within Minnesota that the Public Utilities Commission has determined is essential to ensure the long-term reliability of Minnesota's electric system, to allow electric service for increased industrial demand, or to avoid placing a substantial financial burden on Minnesota ratepayers. An order of the commission granting an exemption under this clause is stayed until the June 1 following the next regular or annual session of the legislature that begins after the date of the commission's final order; or\n(4) a new large energy facility with a combined electric generating capacity of less than 100 megawatts, which did not require a Minnesota certificate of need, which received an air pollution control permit to construct from an adjoining state before January 1, 2008, and on which construction began before July 1, 2008, or to any power purchase agreement related to a facility described in this clause.\nWhenever the commission or the Department of Commerce determines that any person is violating or about to violate this section, it may refer the matter to the attorney general who shall take appropriate legal action. This section may be enforced by the attorney general on the same basis as a law listed in section 8.31, subdivision 1, except that the remedies provided by section 8.31, subdivision 3a, do not apply to a violation of this section.",
	"repealed": false
}