{
	"id": "89.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.01",
	"title": "89.01 COMMISSIONER; POWERS AND DUTIES.",
	"text": "The commissioner shall ascertain and observe the best methods of reforesting cutover and denuded lands, foresting waste lands, minimizing loss or damage of forest resources by fire, forest pests, or shade tree pests, administering forests on forestry principles, encouraging private owners to preserve and grow trees or timber for commercial or other purposes, and conserving the forests around the head waters of streams and on the watersheds of the state.\n(a) The commissioner shall execute all rules pertaining to forestry and forest protection within the jurisdiction of the state; have charge of the work of protecting all forests and lands from fire, forest pests, and shade tree pests; shall investigate the origin of all forest fires; and prosecute all violators as provided by law; shall prepare and print for public distribution an abstract of the forest fire laws of Minnesota, together with such rules as may be formulated.\n(b) The commissioner shall prepare printed notices calling attention to the dangers from forest fires and cause them to be posted in conspicuous places.\nDamage by fire occurring to state timber, reproduction or lands, when coming to the knowledge of the commissioner, shall be promptly reported to the attorney general, who may either enforce collection of such demands directly or may employ private attorneys therefor on such terms, not contingent, as the attorney general deems for the best interests of the state. The amount so collected, after deducting therefrom the fees of such attorneys, if any, and other necessary expenses incurred in investigation, preparation for trial, and trial, shall be paid into the state treasury and credited to the fund that would have been entitled to receive the sale price of the lands, reproduction, or timber if sold; or, if there be no such fund, then such money shall be credited to the general fund. The attorney general, either in or out of court, may compromise and settle state claims for fire damage to state lands, reproduction, or timber, on such terms as the attorney general deems for the best interests of the state.\nThe commissioner shall cooperate with the several departments of the state and federal governments and with counties, towns, municipalities, corporations, or individuals in the preparation of plans for forest protection and management and planting or replacement of trees in wood lots and community forests or on timber tracts, using such influence as time will permit toward the establishment of scientific forestry principles in the management, protection, and promotion of the forest resources of the state.\nWhen any tract or tracts of land that are included in areas set apart as state forests are found to be more valuable for agriculture than for forestry or other conservation purposes, or when any tract or tracts of land used as a forestry administrative site are found to be no longer needed for administrative purposes, the commissioner by written order may eliminate such lands from state forests whereupon such lands shall be subject to sale the same as other lands not reserved. When any tract or tracts of land that are included in areas set apart as state forests are found to be more valuable for the construction of industrial plants or for purposes including forestry essential to the establishment of or expansion of substantial commercial developments, the commissioner, by written order, with the unanimous approval of the Land Exchange Board may eliminate such lands from state forests whereupon such lands shall be subject to sale the same as other lands not reserved.\nAny state lands included in areas set apart as state forests are eliminated from the state forest upon sale under the provisions of sections 92.06 to 92.08 or 94.09 to 94.16.\nWhen any state lands not reserved or set aside are found by the commissioner to be more valuable for the production of timber than for agriculture the commissioner may by written order designate such lands as state forest or adjust the boundaries of state forests subject to the approval of the state legislature at its next regular session.\n[Repealed, 2014 c 289 s 70]",
	"repealed": false
}