{
	"id": "256.9754",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9754",
	"title": "256.9754 LIVE WELL AT HOME GRANTS.",
	"text": "For purposes of this section, the following terms have the meanings given.\n(a) \"Community\" means a town, township, city, or targeted neighborhood within a city, or a consortium of towns, townships, cities, or targeted neighborhoods within cities.\n(b) \"Core home and community-based services provider\" means a Faith in Action, Living at Home/Block Nurse, congregational nurse, or similar community-based program governed by a board, the majority of whose members reside within the program's service area, that organizes and uses volunteers and paid staff to deliver nonmedical services intended to assist older adults to identify and manage risks and to maintain the older adults' community living and integration in the community.\n(c) \"Long-term services and supports\" means any service available under the elderly waiver program or alternative care grant programs, nursing facility services, transportation services, caregiver support and respite care services, and other home and community-based services identified as necessary either to maintain lifestyle choices for older adults or to support older adults to remain in their own home.\n(d) \"Older adult services\" means any services available under the elderly waiver program or alternative care grant programs; nursing facility services; transportation services; respite services; and other community-based services identified as necessary either to maintain lifestyle choices for older Minnesotans, or to promote independence.\n(e) \"Older adult\" refers to individuals 65 years of age and older.\n(a) The live well at home grants are created under the administration of the commissioner of human services.\n(b) The purpose of projects selected by the commissioner of human services under this section is to make strategic changes in the long-term services and supports system for older adults and people with dementia, including statewide capacity for local service development and technical assistance and statewide availability of home and community-based services for older adult services, caregiver support and respite care services, and other supports in Minnesota. These projects are intended to create incentives for new and expanded home and community-based services in Minnesota in order to:\n(1) reach older adults early in the progression of older adults' need for long-term services and supports, providing them with low-cost, high-impact services that will prevent or delay the use of more costly services;\n(2) support older adults to live in the most integrated, least restrictive community setting;\n(3) support the informal caregivers of older adults;\n(4) develop and implement strategies to integrate long-term services and supports with health care services, in order to improve the quality of care and enhance the quality of life of older adults and older adults' informal caregivers;\n(5) ensure cost-effective use of financial and human resources;\n(6) build community-based approaches and community commitment to delivering long-term services and supports for older adults in their own homes;\n(7) achieve a broad awareness and use of lower-cost in-home services as an alternative to nursing homes and other residential services;\n(8) strengthen and develop additional home and community-based services and alternatives to nursing homes and other residential services; and\n(9) strengthen programs that use volunteers.\n(c) The services provided by these projects are available to older adults who are eligible for medical assistance and the elderly waiver under chapter 256S, the alternative care program under section 256B.0913, or the essential community supports grant under section 256B.0922, and to older adults who have their own money to pay for services.\nThe commissioner shall make community services development grants available to communities, providers of older adult services, or a consortium of providers of older adult services to establish older adult services. Grants may be provided for capital and other costs including, but not limited to, start-up and training costs, equipment, and supplies related to older adult services or other residential or service alternatives to nursing facility care. Grants may also be made to renovate current buildings, provide transportation services, fund programs that would allow older adults or individuals with a disability to stay in their own homes by sharing a home, fund programs that coordinate and manage formal and informal services to older adults in their homes to enable them to live as independently as possible in their own homes as an alternative to nursing home care, or expand state-funded programs in the area.\nThe commissioner of health shall give priority to a grantee selected under subdivision 3 when awarding technology-related grants, if the grantee is using technology as part of the proposal unless that priority conflicts with existing state or federal guidance related to grant awards by the Department of Health. The commissioner of transportation shall give priority to a grantee under subdivision 3 when distributing transportation-related funds to create transportation options for older adults unless that preference conflicts with existing state or federal guidance related to grant awards by the Department of Transportation.\nThe commissioner of health may waive applicable state laws and rules for grantees under subdivision 3 on a time-limited basis if the commissioner of health determines that a participating grantee requires a waiver in order to achieve demonstration project goals.\n(a) The commissioner shall establish projects to expand the availability of caregiver support and respite care services for family and other caregivers. The commissioner shall use a request for proposals to select nonprofit entities to administer the projects. Projects must:\n(1) establish a local coordinated network of volunteer and paid respite workers;\n(2) coordinate assignment of respite care services to caregivers of older adults;\n(3) assure the health and safety of the older adults;\n(4) identify at-risk caregivers;\n(5) provide information, education, and training for caregivers in the designated community; and\n(6) demonstrate the need in the proposed service area, particularly where nursing facility closures have occurred or are occurring or areas with service needs identified by section 144A.351. Preference must be given for projects that reach underserved populations.\n(b) Projects must clearly describe:\n(1) how they will achieve their purpose;\n(2) the process for recruiting, training, and retraining volunteers; and\n(3) a plan to promote the project in the designated community, including outreach to older adults needing the services.\n(c) Money for all projects under this subdivision may be used to:\n(1) hire a coordinator to develop a coordinated network of volunteer and paid respite care services and assign workers to clients;\n(2) recruit and train volunteer providers;\n(3) provide information, training, and education to caregivers;\n(4) advertise the availability of the caregiver support and respite care project; and\n(5) purchase equipment to maintain a system of assigning workers to clients.\n(d) Volunteer and caregiver training must include resources on how to support an individual with dementia.\n(e) Project money may not be used to supplant existing funding sources.\nThe commissioner shall select and contract with core home and community-based services providers for projects to provide services and supports to older adults both with and without family and other informal caregivers using a request for proposals process. Projects must:\n(1) have a credible public or private nonprofit sponsor providing ongoing financial support;\n(2) have a specific, clearly defined geographic service area;\n(3) use a practice framework designed to identify high-risk older adults and help them take action to better manage their chronic conditions and maintain their community living;\n(4) have a team approach to coordination and care, ensuring that the older adult participants, participants' families, and the formal and informal providers are all part of planning and providing services;\n(5) provide information, support services, homemaking services, counseling, and training for the older adults and family caregivers;\n(6) encourage service area or neighborhood residents and local organizations to collaborate in meeting the needs of older adults in their geographic service areas;\n(7) recruit, train, and direct the use of volunteers to provide informal services and other appropriate support to older adults and their caregivers; and\n(8) provide coordination and management of formal and informal services to older adults and older adults' families using less expensive alternatives.\nThe commissioner shall award contracts for grants to public and private nonprofit agencies to establish services that strengthen a community's ability to provide a system of home and community-based services for elderly persons. The commissioner shall use a request for proposals process.\n(a) A current grantee under subdivision 3, 3c, 3d, or 3e may apply to the commissioner to receive on a noncompetitive basis up to two years of additional funding.\n(b) To be eligible for a grant extension, a grant extension applicant must have been awarded a grant under this section within the previous five years and provide at least one eligible service in an underserved community. The grantee must submit to the commissioner a letter of intent to continue providing the eligible service after the expiration of a grant extension provided under this subdivision.\n(c) The commissioner of human services must give priority to submitted letters of intent from grantees who have demonstrated success in providing chore services, homemaker services, transportation services, grocery services, caregiver supports, service coordination, or other home and community-based services to older adults in underserved communities.\n(d) Notwithstanding section 16B.98, subdivision 5, paragraph (b), the commissioner may from within available appropriations extend a grant agreement up to two additional years, not to exceed seven years, for grantees the commissioner determines can successfully sustain the grantee's Live Well at Home project with the additional funds made available through the grant agreement extension.\nGrants may be awarded only to communities and providers or to a consortium of providers that have a local match of 50 percent of the costs for the project in the form of donations, local tax dollars, in-kind donations, fundraising, or other local matches.\nThe commissioner of human services shall give preference when awarding grants under this section to areas where nursing facility closures have occurred or are occurring or areas with service needs identified by section 144A.351. The commissioner may award grants to the extent grant funds are available and to the extent applications are approved by the commissioner. Denial of approval of an application in one year does not preclude submission of an application in a subsequent year. The maximum grant amount is limited to $750,000.",
	"repealed": false
}