{
	"id": "16C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.03",
	"title": "16C.03 COMMISSIONER'S AUTHORITY; POWERS AND DUTIES.",
	"text": "MS 2012 [Renumbered 16C.001]\n(a) Subject to chapter 14, the commissioner may adopt rules, consistent with this chapter and chapter 16B, relating to the following topics:\n(1) procurement process including solicitations and responses to solicitations, bid security, vendor errors, opening of responses, award of contracts, tied bids, and award protest process;\n(2) contract performance and failure to perform;\n(3) authority to debar or suspend vendors, and reinstatement of vendors;\n(4) contract cancellation;\n(5) procurement from rehabilitation facilities;\n(6) organizational conflicts of interest; and\n(7) surplus property acquisition, distribution, and disposal.\n(b) Minnesota Rules, parts 1230.0100 to 1230.4300, adopted under chapter 16B, govern under this chapter until amended, repealed, or superseded by rules adopted under chapter 16B or this chapter. In the event rules adopted under chapter 16B conflict with provisions of this chapter, this chapter governs.\nThe commissioner shall acquire all goods, general services, building construction, and utilities needed by agencies. The commissioner shall make all decisions regarding acquisition activities. The commissioner shall conduct all contracting by, for, and between agencies and perform all contract management and review functions for contracts, except those functions specifically delegated to be performed by the contracting agency, the attorney general, or as otherwise provided for by law.\nThe commissioner is authorized to award construction contracts based on best value pursuant to section 16C.28.\nThe commissioner may require that agency staff participate in the development of enterprise procurements.\nNotwithstanding any law to the contrary, any contract entered into by the Department of Transportation must be approved by the commissioner.\nThe commissioner shall make all decisions regarding agency amendments, cancellations, and protests.\nThe commissioner is authorized to enter into lease purchases or installment purchases for periods not exceeding the anticipated useful life of the items acquired unless otherwise prohibited by law.\nThe commissioner is authorized to enter into lease, lease purchase, rental, or installment agreements for the use or acquisition, whichever is applicable, of real or personal property.\nThe commissioner is authorized to issue policies, procedures, and standards applicable to all acquisition activities by and for agencies.\n[Repealed by amendment, 2014 c 196 art 2 s 2]\nThe commissioner is authorized to enter into a cooperative purchasing agreement for the provision of goods, services, construction, and utilities in accordance with section 16C.105.\n[Repealed by amendment, 2014 c 196 art 2 s 2]\n[Repealed by amendment, 2014 c 196 art 2 s 2]\n[Repealed by amendment, 2014 c 196 art 2 s 2]\nThe commissioner has the authority to provide goods, services, and utilities under this chapter to state legislative and judicial branch agencies, political subdivisions, the Minnesota State Colleges and Universities, the University of Minnesota, and federal government agencies.\nThe commissioner is authorized to charge a fee to cover costs and expenses associated with operating a revolving fund or an enterprise fund to acquire goods, services, construction, and utilities. The fees are appropriated to the commissioner to administer and manage the programs and facilities covered under this section.\nThe commissioner may delegate duties imposed by this chapter to the head of an agency and to any subordinate of the agency head.\n[Repealed by amendment, 2014 c 196 art 2 s 2]\n(a) The commissioner and other agencies to which this section applies and the legislative branch of government shall, subject to paragraph (d), cancel a contract for goods or services from a vendor or an affiliate of a vendor or suspend or debar a vendor or an affiliate of a vendor from future contracts upon notification from the commissioner of revenue that the vendor or an affiliate of the vendor has not registered to collect the sales and use tax imposed under chapter 297A on its sales in Minnesota or to a destination in Minnesota. This subdivision shall not apply to state colleges and universities, the courts, and any agency in the judicial branch of government. For purposes of this subdivision, the term \"affiliate\" means any person or entity that is controlled by, or is under common control of, a vendor through stock ownership or other affiliation.\n(b) Beginning January 1, 2006, each vendor or affiliate of a vendor selling goods or services, subject to tax under chapter 297A, to an agency or the legislature must provide its Minnesota sales and use tax business identification number, upon request, to show that the vendor is registered to collect Minnesota sales or use tax.\n(c) The commissioner of revenue shall periodically provide to the commissioner and the legislative branch a list of vendors who have not registered to collect Minnesota sales and use tax and who are subject to being suspended or debarred as vendors or having their contracts canceled.\n(d) The provisions of this subdivision may be waived by the commissioner or the legislative branch when the vendor is the single source of such goods or services, in the event of an emergency, or when it is in the best interests of the state as determined by the commissioner in consultation with the commissioner of revenue. Such consultation is not a disclosure violation under chapter 270B.\n[Repealed, 2014 c 196 art 2 s 2,16]",
	"repealed": false
}