{
	"id": "358.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.07",
	"title": "358.07 FORMS OF OATH IN VARIOUS CASES.",
	"text": "An oath substantially in the following forms shall be administered to the respective officers and persons hereinafter named:\n(1) To grand jurors:\n\"You each do swear that you will diligently inquire, and true presentment make, of all public offenses committed within this county of which you have legal proof; the counsel of the state and of yourself and fellows you will keep secret; you will present no person through malice or ill-will, nor leave any unpresented through fear or favor, or the receipt or hope of reward, but will present things truly to the best of your understanding and according to law. So help you God.\"\n(2) To petit jurors in civil actions:\n\"You each do swear that you will impartially try the issues in this case, and a true verdict give, according to law and the evidence given you in court; your own counsel and that of your fellows you will duly keep; you will say nothing to any person concerning the case, nor suffer any one to speak to you about it, and will keep your verdict secret until you deliver it in court. So help you God.\"\n(3) To petit juries in criminal cases:\n\"You each do swear that, without respect of persons or favor of any person, you will well and truly try, and true deliverance make, between the state of Minnesota and the defendant, according to law and the evidence given you in court. So help you God.\"\n(4) To officers attending grand juries:\n\"You do swear that, as officer of the grand jury, you will keep their counsel and that of the state, and not disclose anything relative to their proceedings. So help you God.\"\n(5) To same in charge of petit juries:\n\"You do swear that you will keep this jury together, and, so far as may be, secluded, so long as they shall remain in your charge; will suffer no one to communicate with or overhear them while deliberating upon their verdict; and will not by word or sign disclose, except to the court alone, anything that may come to your knowledge concerning their action in this case until they are duly discharged.\"\n(6) Same, in charge during recess:\n\"You do swear that you will keep together this jury until they return into court, and that in the meantime you will suffer no one to speak to them, nor speak to them yourself, concerning the cause on trial, or any matter relating thereto.\"\n(7) To witnesses: \"You do swear that the evidence you shall give relative to the cause now under consideration shall be the whole truth, and nothing but the truth. So help you God.\"\n(8) To interpreters:\n\"You do swear that you will truly and impartially interpret to this witness the oath about to be administered to the witness, and the testimony the witness shall give relative to the cause now under consideration. So help you God.\"\n(9) To attorneys:\n\"You do swear that you will support the Constitution of the United States and that of the state of Minnesota, and will conduct yourself as an attorney and counselor at law in an upright and courteous manner, to the best of your learning and ability, with all good fidelity as well to the court as to the client, and that you will use no falsehood or deceit, nor delay any person's cause for lucre or malice. So help you God.\"\n(10) To affiants:\n\"You do swear that the statements of this affidavit, by you subscribed, are true. So help you God.\"",
	"repealed": false
}