{
	"id": "363A.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.44",
	"title": "363A.44 EQUAL PAY CERTIFICATE.",
	"text": "(a) No department, agency of the state, the Metropolitan Council, or an agency subject to section 473.143, subdivision 1, shall execute a contract for goods or services or an agreement for goods or services in excess of $500,000 with a business that has 40 or more full-time employees in this state or a state where the business has its primary place of business on a single day during the prior 12 months, unless the business has an equal pay certificate or it has certified in writing that it is exempt. A certificate is valid for four years.\n(b) An agency that uses state money to pay for part or all of a capital project is subject to and must comply with the restrictions in this section for contracts exceeding $500,000. A political subdivision that uses state money to pay for part or all of a capital project is subject to and must comply with the restrictions in this section for contracts exceeding $1,000,000. For purposes of this paragraph, \"agency,\" \"political subdivision,\" \"capital project,\" and \"state money\" have the meanings given in section 363A.36, subdivision 1a. This paragraph applies to a capital project or discrete phase of a capital project for which state money has been appropriated on or after January 1, 2022.\n(c) This section does not apply to a business with respect to a specific contract if the commissioner of administration determines that application of this section would cause undue hardship to the contracting entity. This section does not apply to a contract to provide goods and services to individuals under chapters 43A, 62A, 62C, 62D, 62E, 256B, 256I, 256L, and 268A, with a business that has a license, certification, registration, provider agreement, or provider enrollment contract that is prerequisite to providing those goods and services. This section does not apply to contracts entered into by the State Board of Investment for investment options under section 352.965, subdivision 4.\n(a) A business shall apply for an equal pay certificate by paying a $250 filing fee and submitting an equal pay compliance statement to the commissioner. The proceeds from the fees collected under this subdivision shall be deposited in an equal pay certificate special revenue account. Money in the account is appropriated to the commissioner for the purposes of this section. The commissioner shall issue an equal pay certificate of compliance to a business that submits to the commissioner a statement signed by the chairperson of the board or chief executive officer of the business:\n(1) that the business is in compliance with Title VII of the Civil Rights Act of 1964, Equal Pay Act of 1963, Minnesota Human Rights Act, and Minnesota Equal Pay for Equal Work Law;\n(2) that the average compensation for its female employees is not consistently below the average compensation for its male employees within each of the major job categories in the EEO-1 employee information report for which an employee is expected to perform work under the contract, taking into account factors such as length of service, requirements of specific jobs, experience, skill, effort, responsibility, working conditions of the job, or other mitigating factors;\n(3) that the business does not restrict employees of one sex to certain job classifications and makes retention and promotion decisions without regard to sex;\n(4) that wage and benefit disparities are corrected when identified to ensure compliance with the laws cited in clause (1) and with clause (2); and\n(5) how often wages and benefits are evaluated to ensure compliance with the laws cited in clause (1) and with clause (2).\n(b) The equal pay compliance statement shall also indicate whether the business, in setting compensation and benefits, utilizes:\n(1) a market pricing approach;\n(2) state prevailing wage or union contract requirements;\n(3) a performance pay system;\n(4) an internal analysis; or\n(5) an alternative approach to determine what level of wages and benefits to pay its employees. If the business uses an alternative approach, the business must provide a description of its approach.\n(c) Receipt of the equal pay compliance statement by the commissioner does not establish compliance with the laws set forth in paragraph (a), clause (1).\nThe commissioner must issue an equal pay certificate, or a statement of why the application was rejected, within 15 days of receipt of the application. An application may be rejected only if it does not comply with the requirements of subdivision 2.\nAn equal pay certificate for a business may be suspended or revoked by the commissioner when the business fails to make a good-faith effort to comply with the laws identified in subdivision 2, paragraph (a), clause (1), fails to make a good-faith effort to comply with this section, or has multiple violations of this section or the laws identified in subdivision 2, paragraph (a), clause (1). The commissioner may also issue a fine due to lack of compliance with this section of up to $5,000 per calendar year for each contract. The commissioner may suspend or revoke an equal pay certificate until the business has paid all outstanding fines and otherwise complies with this section. Prior to issuing a fine or suspending or revoking a certificate, the commissioner must first have sought to conciliate with the business regarding wages and benefits due to employees.\n(a) If a contract is awarded to a business that does not have an equal pay certificate as required under subdivision 1, or that is not in compliance with subdivision 2, paragraph (a), the commissioner may void the contract on behalf of the state. The contract award entity that is a party to the agreement must be notified by the commissioner prior to the commissioner taking action to void the contract.\n(b) A contract may be abridged or terminated by the contract award entity identified in subdivision 1 upon notice that the commissioner has suspended or revoked the certificate of the business.\n(a) A business may obtain an administrative hearing pursuant to sections 14.57 to 14.69 before the suspension or revocation of its certificate is effective by filing a written request for hearing 20 days after service of notice by the commissioner.\n(b) A business may obtain an administrative hearing pursuant to sections 14.57 to 14.69 before the contract award entity's abridgement or termination of a contract is effective by filing a written request for a hearing 20 days after service of notice by the contract award entity.\nThe commissioner must provide technical assistance to any business that requests assistance regarding this section.\nThe commissioner may audit the business's compliance with this section. As part of an audit, upon request, a business must provide the commissioner the following information with respect to employees expected to perform work under the contract in each of the major job categories in the EEO-1 employee information report:\n(1) number of male employees;\n(2) number of female employees;\n(3) average annualized salaries paid to male employees and to female employees, in the manner most consistent with the employer's compensation system, within each major job category;\n(4) information on performance payments, benefits, or other elements of compensation, in the manner most consistent with the employer's compensation system, if requested by the commissioner as part of a determination as to whether these elements of compensation are different for male and female employees;\n(5) average length of service for male and female employees in each major job category; and\n(6) other information identified by the business or by the commissioner, as needed, to determine compliance with items specified in subdivision 2, paragraph (a).\nData submitted to the commissioner related to equal pay certificates are private data on individuals or nonpublic data with respect to persons other than department employees. The commissioner's decision to issue, not issue, revoke, or suspend or otherwise penalize a certificate holder of an equal pay certificate is public data. Applications, forms, or similar documents submitted by a business seeking an equal pay certificate are public data. The commissioner may disclose data classified as private or nonpublic under this subdivision to other state agencies, statewide systems, and political subdivisions for the purposes of achieving compliance with this section.\nThe commissioner shall report to the governor and the chairs and ranking minority members of the committees in the senate and the house of representatives with primary jurisdiction over the department by January 31 of every even-numbered year, beginning January 31, 2016. The report shall indicate the number of equal pay certificates issued, the number of audits conducted, the processes used by contractors to ensure compliance with subdivision 2, paragraph (a), and a summary of its auditing efforts. The commissioner shall consult with the Legislative Coordinating Commission Office on the Economic Status of Women in preparing the report.",
	"repealed": false
}