{
	"id": "514.977",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.977",
	"title": "514.977 ADDITIONAL REMEDIES.",
	"text": "If an occupant defaults in the payment of rent for the storage space or otherwise breaches the rental agreement, the owner may commence an action to terminate the rental agreement, recover possession of the storage space, remove the occupant, and dispose of the stored personal property. The action shall be conducted in accordance with the Minnesota Rules of Civil Procedure, except as provided in this section.\nThe summons must be served at least seven days before the date of the court appearance as provided in subdivision 3.\nExcept as provided in subdivision 4, in an action filed under this section the appearance shall be not less than seven or more than 14 days from the day of issuing the summons.\nIf the owner files a motion and affidavit stating specific facts and instances in support of an allegation that the occupant is causing a nuisance or engaging in illegal or other behavior that seriously endangers the safety of others, others' property, or the storage facility's property, the appearance shall be not less than three days nor more than seven days from the date the summons is issued. The summons in an expedited hearing shall be served upon the occupant within 24 hours of issuance unless the court orders otherwise for good cause shown.\nAt the court appearance specified in the summons, the defendant may answer the complaint, and the court shall hear and decide the action, unless it grants a continuance of the trial, which may be for no longer than six days, unless all parties consent to longer continuance.\nThe occupant is prohibited from bringing counterclaims in the action that are unrelated to the possession of the storage space. Nothing in this section prevents the occupant from bringing the claim in a separate action.\nJudgment in matters adjudicated under this section shall be in accordance with section 504B.345. Execution of a writ issued under this section shall be in accordance with section 504B.365.",
	"repealed": false
}