{
	"id": "115A.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.86",
	"title": "115A.86 IMPLEMENTING DESIGNATION.",
	"text": "(a) The district or county shall prepare a designation ordinance to implement a designation. The designation ordinance must:\n(1) define the geographic area and the types and quantities of solid waste subject to designation;\n(2) specify the point or points of delivery of the solid waste;\n(3) require that the designated solid waste be delivered to the specified point or points of delivery;\n(4) require the designated facility to accept all designated solid waste delivered to the specified point or points of delivery, unless the facility has notified waste collectors in the designated area that the facility is inoperative;\n(5) set out the procedures and principles to be followed by the county or district in establishing and amending any rates and charges at the designated facility; and\n(6) state any additional regulations governing waste collectors or other matters necessary to implement the designation.\n(b) The designation ordinance must provide an exception for:\n(1) materials that are exempt or excluded from the designation under section 115A.83 or 115A.84, subdivision 4; and\n(2) materials otherwise subject to the designation for which negotiated contractual arrangements exist that will require and effect the delivery of the waste to the facility for the term of the contract.\nA district or county shall submit the designation ordinance, together with any negotiated contracts assuring the delivery of solid waste, to the commissioner for review and approval or disapproval. The commissioner shall complete the review and make a decision within 90 days following submission of the designation for review. The commissioner shall approve the designation if the commissioner determines that the designation procedure specified in section 115A.85 was followed and that the designation is based on a plan approved under section 115A.84. The commissioner may attach conditions to the approval.\nThe designation may not be placed into effect before 60 days after the approval required in subdivision 2. The effective date of the designation must be specified at least 60 days in advance. If the designation is not placed into effect within two years of approval, the designation must be resubmitted to the commissioner for approval or disapproval under subdivision 2, unless bonds have been issued to finance the facility to which the designation applies.\nThe designation is binding on all political subdivisions, landfill operators, solid waste generators, and solid waste collectors in the designation area.\n(a) Except for an amendment authorized under subdivision 6, amendments to a designation ordinance must be submitted to the commissioner for approval. The commissioner shall approve the amendment if the amendment is in the public interest and in furtherance of the state policies and purposes expressed in section 115A.02. If the commissioner finds that the proposed amendment is a substantive change from the existing designation plan, the commissioner may require that the county or solid waste management district submit a revised designation plan to the commissioner for approval. After receiving approval for the designation plan amendment from the commissioner, the county or district shall follow the procedure outlined in section 115A.85 prior to submitting the amended designation ordinance to the commissioner for approval. If the commissioner does not act within 90 days after receiving the proposed amendment to the designation ordinance, the amendment is approved.\n(b) Except for an amendment authorized under subdivision 6, prior to amending an ordinance to designate solid waste to a disposal facility, a county or district shall submit an amended designation plan to the commissioner for approval, and shall follow the procedures outlined in section 115A.85.\n(a) A county may include in its designation ordinance civil and misdemeanor penalties for violation of the ordinance. Subdivision 5 does not govern a designation ordinance amendment adopted under this paragraph.\n(b) A county may by ordinance impose civil and misdemeanor penalties for delivery of mixed municipal solid waste to a processing or disposal facility in the county that is not a facility designated to receive the waste under a designation ordinance adopted by another county under this section.\n(c) A civil penalty adopted under paragraph (a) or (b) must be payable to the county and may not exceed a fine of $10,000 per day of violation plus the cost of mitigating any damages caused by the violation and the attorney fees and court costs incurred by the county to enforce the ordinance.",
	"repealed": false
}