{
	"id": "515A.3-106",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.3-106",
	"title": "515A.3-106 BYLAWS.",
	"text": "The bylaws and any amendments thereto must be recorded to be effective and shall provide:\n(a) The meeting of the members shall be held at least once each year and shall specify an officer who shall, at least 21 days in advance of any annual or regularly scheduled meeting and at least seven days in advance of any other meeting, send to each unit owner notice of the time, place and complete agenda of the meeting. The notice shall be hand delivered or sent by United States mail to all unit owners of record at the address of the respective units and to other addresses as any of them may have designated to the officer.\n(b) No vote in the association of unit owners shall be deemed to inure to any unit during the time when the unit owner is the association.\n(c) For a mechanism to resolve disputes regarding voting among more than one unit owner of a unit in such a way that the vote allocated to the unit is not split or otherwise cast separately by the several unit owners.\n(d) An annual report be prepared by the association and a copy of the report be provided to each unit owner and the report contain a minimum of the following:\n(1) A statement of any capital expenditures in excess of two percent of the current budget or $5,000 whichever is the greater anticipated by the association during the current year or succeeding two fiscal years.\n(2) A statement of the status and amount of any reserve or replacement fund and portion of the fund designated for any specified project by the board of directors.\n(3) A copy of the statement of financial condition for the association for the last fiscal year.\n(4) A statement of the status of any pending suits or judgments to which the association is a party.\n(5) A statement of the insurance coverage provided by the association.\n(6) A statement of any unpaid assessments by the association on individual units identifying the unit number and the amount of the unpaid assessment.",
	"repealed": false
}