{
	"id": "142C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.03",
	"title": "142C.03 APPLICATION PROCEDURES.",
	"text": "The certification of license-exempt child care centers shall be implemented by September 30, 2017. Certification applications shall be received and processed on a phased-in schedule as determined by the commissioner.\nThe commissioner shall provide application instructions and information about the rules and requirements of other state agencies that affect the applicant. The certification application must be submitted in a manner prescribed by the commissioner. Upon implementation of the provider licensing and reporting hub, applicants must use the hub in the manner prescribed by the commissioner. The commissioner shall act on the application within 90 working days of receiving a completed application.\nWhen the commissioner receives an application for initial certification that is incomplete because the applicant failed to submit required documents or is deficient because the documents submitted do not meet certification requirements, the commissioner shall provide the applicant written notice that the application is incomplete or deficient. In the notice, the commissioner shall identify documents that are missing or deficient and give the applicant 45 days to resubmit a second application that is complete. An applicant's failure to submit a complete application after receiving notice from the commissioner is basis for certification denial.\n(a) The applicant may request reconsideration of the denial by notifying the commissioner by certified mail, by personal service, or through the provider licensing and reporting hub. The request must be made in writing. If sent by certified mail, the request must be postmarked and sent to the commissioner within 20 calendar days after the applicant received the order. If a request is made by personal service, it must be received by the commissioner within 20 calendar days after the applicant received the order. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub. The applicant may submit with the request for reconsideration a written argument or evidence in support of the request for reconsideration.\n(b) The commissioner's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\n(a) A certification holder must notify the commissioner, in a manner prescribed by the commissioner, and obtain the commissioner's approval before making any changes:\n(1) to the certification holder as defined in section 142C.01, subdivision 5;\n(2) to the authorized agent as defined in section 142C.01, subdivision 3;\n(3) to the certification holder information on file with the secretary of state or Department of Revenue;\n(4) in the location of the program certified under this chapter;\n(5) to the ages of children served by the program; or\n(6) to the certified center's schedule including its:\n(i) yearly schedule;\n(ii) hours of operation; or\n(iii) days of the week it is open.\n(b) When, for reasons beyond the certification holder's control, a certification holder cannot provide the commissioner with prior notice of the changes in paragraph (a), the certification holder must notify the commissioner by the tenth business day after the change and must provide any additional information requested by the commissioner.\n(c) When a certification holder notifies the commissioner of a change to the certification holder information on file with the secretary of state, the certification holder must provide documentation of the change.\n(d) Upon implementation of the provider licensing and reporting hub, certification holders must enter and update information in the hub in a manner prescribed by the commissioner.",
	"repealed": false
}