{
	"id": "18G.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/18G.10",
	"title": "18G.10 EXPORT CERTIFICATION, INSPECTIONS, CERTIFICATES, PERMITS, AND FEES.",
	"text": "To ensure continued access to foreign and domestic markets, the commissioner shall provide inspection and certification services to ensure that appropriate phytosanitary restrictions or requirements are fully met.\nAll fees and penalties collected under this chapter and interest attributable to the money in the account must be deposited in the state treasury and credited to the nursery and phytosanitary account in the agricultural fund. Money in the account, including interest earned, is appropriated to the commissioner for the administration and enforcement of this chapter.\nThe commissioner may enter into cooperative agreements with federal and state agencies for administration of the export certification program.\nAn exporter of plants or plant products desiring to originate shipments from Minnesota to a foreign country requiring a phytosanitary certificate or export certificate must submit an application to the commissioner. Application for phytosanitary certificates or export certificates must be made on forms provided or approved by the commissioner or the USDA. The commissioner may conduct inspections of plants, plant products, or facilities for persons that have applied for or intend to apply for a phytosanitary certificate or export certificate from the commissioner.\nThe commissioner may issue a phytosanitary certificate or export certificate if the plants or plant products satisfactorily meet the requirements of the importing state or foreign country and the United States Department of Agriculture requirements. The requirements of the destination states or countries must be met by the applicant.\n(a) The commissioner shall assess fees sufficient to recover all costs for the inspection, service, and work performed in carrying out the issuance of a phytosanitary certificate or export certificate.\n(b) If laboratory analysis or other technical analysis is required to issue a certificate, the commissioner must set and collect the fee to recover this additional cost.\n(c) The certificate fee is $75 or a fee amount, not to exceed $300, that is sufficient to recover all processing costs for each phytosanitary or export certificate issued. The certificate fee is in addition to any mileage or inspection time charges that are assessed.\n(d) For services provided for in subdivision 7 that are goods and services provided for the direct and primary use of a private individual, business, or other entity, the commissioner must set and collect the fees to cover the cost of the services provided.\nThe commissioner may deny or cancel the issuance of a phytosanitary or export certificate for any of the following reasons:\n(1) failure of the plants or plant products to meet quarantine, regulations, and requirements imposed by the country, state, or other jurisdiction for which the phytosanitary or export certificate is being requested;\n(2) failure to completely or accurately provide the information requested on the application form;\n(3) failure to ship the exact plants or plant products which were inspected and approved; or\n(4) failure to pay any fees or costs due the commissioner.\n(a) The commissioner may provide inspection, sampling, or certification services to ensure that Minnesota plant treatment processes, plant products, or commodities meet import requirements of other states or countries.\n(b) The state plant regulatory official may issue permits and certificates verifying that various Minnesota agricultural plant treatment processes, products, or commodities meet specified plant health requirements, treatment requirements, or pest absence assurances based on determinations by the commissioner.\n(a) Certificates and permits may not be altered, counterfeited, obtained, or used improperly, for any plant product.\n(b) Certificates and permits are not transferable to another location or another person.",
	"repealed": false
}