{
	"id": "260C.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.451",
	"title": "260C.451 FOSTER CARE BENEFITS PAST AGE 18.",
	"text": "Six months prior to the child's 18th birthday, the responsible social services agency shall provide written notice on a form prescribed by the commissioner of children, youth, and families to any child in foster care under this chapter who cannot reasonably be expected to return home or have another legally permanent family by the age of 18, the child's parents or legal guardian, if any, the child's guardian ad litem, and the child's foster parents of the availability of foster care up to age 21, when the child is eligible under subdivisions 3 and 3a.\nUpon the request of any child in foster care immediately prior to the child's 18th birthday and who is in foster care at the time of the request, the responsible social services agency shall, in conjunction with the child and other appropriate parties, update the independent living plan required under section 260C.212, subdivision 1, paragraph (c), clause (12), related to the child's employment, vocational, educational, social, or maturational needs. The agency shall provide continued services and foster care for the child including those services that are necessary to implement the independent living plan.\nA child in foster care immediately prior to the child's 18th birthday may continue in foster care past age 18 unless:\n(1) the child can safely return home;\n(2) the child is in placement pursuant to the agency's duties under section 256B.092 and Minnesota Rules, parts 9525.0004 to 9525.0016, to meet the child's needs due to a developmental disability or related condition, and the child will be served as an adult under section 256B.092 and Minnesota Rules, parts 9525.0004 to 9525.0016; or\n(3) the child can be adopted or have permanent legal and physical custody transferred to a relative prior to the child's 18th birthday.\nThe child must meet at least one of the following conditions to be considered eligible to continue in or return to foster care and remain there to age 21. The child must be:\n(1) completing secondary education or a program leading to an equivalent credential;\n(2) enrolled in an institution that provides postsecondary or vocational education;\n(3) participating in a program or activity designed to promote or remove barriers to employment;\n(4) employed for at least 80 hours per month; or\n(5) incapable of doing any of the activities described in clauses (1) to (4) due to a medical condition.\nFor children between the ages of 18 and 21, \"foster care benefits\" means payment for those foster care settings defined in section 260C.007, subdivision 18. Additionally, foster care benefits means payment for a supervised setting, approved by the responsible social services agency, in which a child may live independently.\nThe particular foster care setting, including supervised settings, shall be selected by the agency and the child based on the best interest of the child consistent with section 260C.212, subdivision 2. Supervision in approved settings must be determined by an individual determination of the child's needs by the responsible social services agency and consistent with section 260C.212, subdivision 4a.\n(a) Upon request of an individual who had been under the guardianship of the commissioner and who has left foster care without being adopted, the responsible social services agency which had been the commissioner's agent for purposes of the guardianship shall develop with the individual a plan to increase the individual's ability to live safely and independently using the plan requirements of section 260C.212, subdivision 1, paragraph (c), clause (12), and to assist the individual to meet one or more of the eligibility criteria in subdivision 4 if the individual wants to reenter foster care. The responsible social services agency shall provide foster care as required to implement the plan. The responsible social services agency shall enter into a voluntary placement agreement under section 260C.229 with the individual if the plan includes foster care.\n(b) Individuals who had not been under the guardianship of the commissioner of children, youth, and families prior to 18 years of age may ask to reenter foster care after age 18 and the responsible social services agency that had responsibility for planning for the individual before discharge from foster care shall provide foster care or other services to the individual for the purpose of increasing the individual's ability to live safely and independently and to meet the eligibility criteria in subdivision 3a, if the individual:\n(1) was in foster care for the six consecutive months prior to the person's 18th birthday, or left foster care within six months prior to the person's 18th birthday, and was not discharged home, adopted, or received into a relative's home under a transfer of permanent legal and physical custody under section 260C.515, subdivision 4; or\n(2) was discharged from foster care while on runaway status after age 15.\n(c) In conjunction with a qualifying and eligible individual under paragraph (b) and other appropriate persons, the responsible social services agency shall develop a specific plan related to that individual's vocational, educational, social, or maturational needs and provide foster care as required to implement the plan. The responsible social services agency shall enter into a voluntary placement agreement with the individual if the plan includes foster care.\n(d) A child who left foster care while under guardianship of the commissioner of children, youth, and families retains eligibility for foster care for placement at any time prior to 21 years of age.\nIndividuals in foster care pursuant to this section are adults for all purposes except the continued provision of foster care. Any order establishing guardianship under section 260C.325, any legal custody order under section 260C.201, subdivision 1, and any order for legal custody associated with an order for permanent custody under section 260C.515, subdivision 5, terminates on the child's 18th birthday. The responsible social services agency has legal responsibility for the individual's placement and care when the matter continues under court jurisdiction pursuant to section 260C.193 or when the individual and the responsible agency execute a voluntary placement agreement pursuant to section 260C.229.\nWhen a child in foster care between the ages of 18 and 21 ceases to meet one of the eligibility criteria of subdivision 3a, the responsible social services agency shall give the child written notice that foster care will terminate 30 days from the date the notice is sent. The child or the child's guardian ad litem may file a motion asking the court to review the agency's determination within 15 days of receiving the notice. The child shall not be discharged from foster care until the motion is heard. The agency shall work with the child to transition out of foster care as required under section 260C.203, paragraph (d), clause (2). The written notice of termination of benefits shall be on a form prescribed by the commissioner and shall also give notice of the right to have the agency's determination reviewed by the court in the proceeding where the court conducts the reviews required under section 260C.203, 260C.317, or 260C.515, subdivision 5 or 6. A copy of the termination notice shall be sent to the child and the child's attorney, if any, the foster care provider, the child's guardian ad litem, and the court. The agency is not responsible for paying foster care benefits for any period of time after the child actually leaves foster care.\n(a) The court shall conduct reviews at least annually to ensure the responsible social services agency is making reasonable efforts to finalize the permanency plan for the child.\n(b) The court shall find that the responsible social services agency is making reasonable efforts to finalize the permanency plan for the child when the responsible social services agency:\n(1) provides appropriate support to the child and foster care provider to ensure continuing stability and success in placement;\n(2) works with the child to plan for transition to adulthood and assists the child in demonstrating progress in achieving related goals;\n(3) works with the child to plan for independent living skills and assists the child in demonstrating progress in achieving independent living goals; and\n(4) prepares the child for independence according to sections 260C.203, paragraph (d), and 260C.452, subdivision 4.\n(c) The responsible social services agency must ensure that an administrative review that meets the requirements of this section and section 260C.203 is completed at least six months after each of the court's annual reviews.",
	"repealed": false
}