{
	"id": "280.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/280.03",
	"title": "280.03 CERTIFICATE OF SALE.",
	"text": "The county auditor shall execute to the purchaser of each parcel a certificate which may be substantially in the following form:\n\"I, .........., auditor of the county of .........., state of Minnesota, do hereby certify that at the sale of lands pursuant to the real estate tax judgment entered in the district court in the county of .........., on the .......... day of .........., ......., in proceedings to enforce the payment of taxes delinquent on real estate for the years .........., for the county of .........., which sale was held at ..............., in said county of ........, on the ........ day of ........, ......., the following described parcel of land, situate in said county of .........., state of Minnesota: (insert description), was offered for sale to the bidder who should offer to pay the amount for which the same was to be sold, at the lowest annual rate of interest on such amount; and at said sale I did sell the said parcel of land to .......... for the sum of .......... dollars, with interest at .......... percent per annum on such amount, that being the sum for which the same was to be sold, and such rate of interest being the lowest rate percent per annum bid on such sum; and, the sum having been paid, I do therefore, in consideration thereof, and pursuant to the statute in such case made and provided, convey the said parcel of land, in fee simple, subject to easements and restrictions of record at the date of the tax judgment sale, including, but without limitation, permits for telephone and electric power lines either by underground cable or conduit or otherwise, sewer and water lines, highways, railroads, and pipe lines for gas, liquids, or solids in suspension, to said .........., and the heirs and assigns of ......., forever, subject to redemption as provided by law.\nWitness my hand and official seal this ........ day of ........, ....... .\nIf the land shall not be redeemed as provided in chapter 281, such certificate shall pass to the purchaser an estate therein, in fee simple, without any other act or deed whatever subject to easements and restrictions of record at the date of the tax judgment sale, including, but without limitation, permits for telephone and electric power lines either by underground cable or conduit or otherwise, sewer and water lines, highways, railroads, and pipe lines for gas, liquids, or solids in suspension. Such certificate may be recorded, after the time for redemption shall have expired, as other deeds of real estate, and with like effect. If any purchaser at such sale shall purchase more than one parcel, the auditor shall issue to the purchaser a certificate for each parcel so purchased.",
	"repealed": false
}