{
	"id": "115A.1444",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1444",
	"title": "115A.1444 ESTABLISHMENT OF PRODUCER RESPONSIBILITY ADVISORY BOARD.",
	"text": "The Producer Responsibility Advisory Board is established to review all activities conducted by producer responsibility organizations under sections 115A.144 to 115A.1463 and to advise the commissioner and producer responsibility organizations regarding the implementation of sections 115A.144 to 115A.1463.\n(a) By January 1, 2025, the commissioner must establish and appoint the initial membership of the advisory board. The membership of the board must consist of the following:\n(1) two members representing manufacturers of covered materials or a statewide or national trade association representing those manufacturers;\n(2) two members representing recycling facilities that manage covered materials;\n(3) one member representing a waste hauler or a statewide association representing waste haulers;\n(4) one member representing retailers of covered materials or a statewide trade association representing those retailers;\n(5) one member representing a statewide nonprofit environmental organization;\n(6) one member representing a community-based nonprofit environmental justice organization;\n(7) one member representing a waste facility that receives and sorts covered materials and transfers them to another facility for reuse, recycling, or composting;\n(8) one member representing a waste facility that receives compostable materials for composting or a statewide trade association that represents such facilities;\n(9) two members representing an entity that develops or offers for sale covered materials that are designed for reuse or refill and maintained through a reuse or refill system or infrastructure or a statewide or national trade association that represents such entities;\n(10) three members representing organizations of political subdivisions, with at least one member representing a political subdivision outside the metropolitan area;\n(11) two members representing other interested parties or additional members of interests represented under clauses (1) to (10) as determined by the commissioner; and\n(12) one member representing the commissioner.\n(b) In making appointments under paragraph (a), the commissioner:\n(1) may not appoint members who are state legislators or registered lobbyists;\n(2) may not appoint members who are employees of a producer required to be members of a producer responsibility organization in this state under sections 115A.144 to 115A.1463; and\n(3) must endeavor to appoint members from all regions of the state.\nA member of the advisory board appointed under subdivision 2, paragraph (a), clause (12), serves at the pleasure of the commissioner. All other members serve for a term of four years, except that the initial term for nine of the initial appointees must be two years so that membership terms are staggered. Members may be reappointed but may not serve more than eight consecutive years. The removal of members and filling of vacancies is governed by section 15.059, subdivision 4. Except as otherwise provided, chapter 15 does not apply to the board.\nMembers of the board must be compensated according to section 15.059, subdivision 3.\nA majority of the voting board members constitutes a quorum. If there is a vacancy in the membership of the board, a majority of the remaining voting members of the board constitutes a quorum.\nAction by the advisory board requires a quorum and a majority of those present and voting. All members of the advisory board, except the member appointed under subdivision 2, paragraph (a), clause (12), are voting members of the board.\nThe advisory board must meet at least two times per year and may meet more frequently upon ten days' written notice at the request of the chair or a majority of its members.\nMeetings of the board must comply with chapter 13D.\nAt its initial meeting, and every two years thereafter, the advisory board must elect a chair and vice-chair from among its members.\nThe commissioner must provide administrative and operating support to the advisory board, including compensation in accordance with subdivision 4, and may contract with a third-party facilitator to assist in administering the activities of the advisory board, including establishing a website or landing page on the agency website.\nThe commissioner must assist the advisory board in developing policies and procedures governing the disclosure of actual or perceived conflicts of interest that advisory board members may have as a result of their employment or financial holdings with respect to themselves or family members. Each advisory board member is responsible for reviewing the conflict of interest policies and procedures. An advisory board member must disclose any instance of actual or perceived conflicts of interest at each meeting of the advisory board at which recommendations regarding stewardship plans, programs, operations, or activities are made by the advisory board.",
	"repealed": false
}