{
	"id": "290B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/290B.07",
	"title": "290B.07 LIEN; DEFERRED PORTION.",
	"text": "(a) Payment by the state to the county treasurer of property taxes, penalties, interest, or special assessments and interest deferred under this chapter is deemed a loan from the state to the program participant. The commissioner must compute the interest as provided in section 270C.40, subdivision 5, but not to exceed five percent, and maintain records of the total deferred amount and interest for each participant. Interest shall accrue beginning September 1 of the payable year for which the taxes are deferred. Any deferral made under this chapter shall not be construed as delinquent property taxes.\nThe lien created under section 272.31 continues to secure payment by the taxpayer, or by the taxpayer's successors or assigns, of the amount deferred, including interest, with respect to all years for which amounts are deferred. The lien for deferred taxes and interest has the same priority as any other lien under section 272.31, except that liens, including mortgages, recorded or filed prior to the recording or filing of the notice under section 290B.04, subdivision 2, have priority over the lien for deferred taxes and interest. A seller's interest in a contract for deed, in which a qualifying homeowner is the purchaser or an assignee of the purchaser, has priority over deferred taxes and interest on deferred taxes, regardless of whether the contract for deed is recorded or filed. The lien for deferred taxes and interest for future years has the same priority as the lien for deferred taxes and interest for the first year, which is always higher in priority than any mortgages or other liens filed, recorded, or created after the notice recorded or filed under section 290B.04, subdivision 2. The county treasurer or auditor shall maintain records of the deferred portion and shall list the amount of deferred taxes for the year and the cumulative deferral and interest for all previous years as a lien against the property. In any certification of unpaid taxes for a tax parcel, the county auditor shall clearly distinguish between taxes payable in the current year, deferred taxes and interest, and delinquent taxes. Payment of the deferred portion becomes due and owing at the time specified in section 290B.08. Upon receipt of the payment, the commissioner shall issue a receipt for it to the person making the payment upon request and shall notify the auditor of the county in which the parcel is located, within ten days, identifying the parcel to which the payment applies. Upon receipt by the commissioner of revenue of collected funds in the amount of the deferral, the state's loan to the program participant is deemed paid in full.\n(b) If property for which taxes have been deferred under this chapter forfeits under chapter 281 for nonpayment of a nondeferred property tax amount, or because of nonpayment of amounts previously deferred following a termination under section 290B.08, the lien for the taxes deferred under this chapter, plus interest and costs, shall be canceled by the county auditor as provided in section 282.07. However, notwithstanding any other law to the contrary, any proceeds from a subsequent sale of the property under chapter 282 or another law, must be used to first reimburse the county's forfeited tax sale fund for any direct costs of selling the property or any costs directly related to preparing the property for sale, and then to reimburse the state for the amount of the canceled lien. Within 90 days of the receipt of any sale proceeds to which the state is entitled under these provisions, the county auditor must pay those funds to the commissioner of revenue by warrant for deposit in the general fund. No other deposit, use, distribution, or release of gross sale proceeds or receipts may be made by the county until payments sufficient to fully reimburse the state for the canceled lien amount have been transmitted to the commissioner.",
	"repealed": false
}