{
	"id": "473J.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.07",
	"title": "473J.07 MINNESOTA SPORTS FACILITIES AUTHORITY.",
	"text": "The Minnesota Sports Facilities Authority is established as a public body, corporate and politic, and political subdivision of the state. The authority is not a joint powers entity or an agency or instrumentality of the city.\n(a) The authority shall consist of five members.\n(b) The chair and two members shall be appointed by the governor. One member appointed by the governor shall serve until December 31 of the third year following appointment and one member shall serve until December 31 of the fourth year following appointment. Thereafter, members appointed by the governor shall serve four-year terms, beginning January 1. Each member serves until a successor is appointed and takes office. The chair serves at the pleasure of the governor.\n(c) The mayor of the city shall appoint two members to the authority. One member appointed by the mayor of the city shall serve until December 31 of the third year following appointment and one member shall serve until December 31 of the fourth year following appointment. Thereafter, members appointed under this paragraph shall serve four-year terms beginning January 1. Each member serves until a successor is appointed and takes office. Members appointed under this paragraph may reside within the city and may be appointed officials of a political subdivision.\n(d) The initial members of the authority must be appointed not later than June 13, 2012.\nThe authority may compensate its members, other than the chair, as provided in section 15.0575. The chair shall receive, unless otherwise provided by other law, a salary in an amount fixed by the authority, and shall be reimbursed for reasonable expenses to the same extent as a member.\nThe chair presides at all meetings of the authority, if present, and performs all other assigned duties and functions. The authority may appoint from among its members a vice-chair to act for the chair during the temporary absence or disability of the chair, and any other officers the authority determines are necessary or convenient.\nA member, other than the chair, may be removed by the appointing authority only for misfeasance, malfeasance, or nonfeasance in office, upon written charges, and after an opportunity to be heard in defense of the charges.\nThe authority shall adopt bylaws to establish rules of procedure, the powers and duties of its officers, and other matters relating to the governance of the authority and the exercise of its powers. Except as provided in this section, the bylaws adopted under this subdivision must be similar in form and substance to bylaws adopted by the Minnesota Ballpark Authority pursuant to section 473.755.\nThe legislative auditor shall audit the books and accounts of the authority once each year or as often as the legislative auditor's funds and personnel permit. The authority shall pay the total cost of the audit pursuant to section 3.9741.\nThe authority may appoint an executive director to serve as the chief executive officer of the authority. The executive director serves at the pleasure of the authority and receives compensation as determined by the authority. The executive director may be responsible for the operation, management, and promotion of activities of the authority, as prescribed by the authority. The executive director has the powers necessarily incident to the performance of duties required and powers granted by the authority, but does not have authority to incur liability or make expenditures on behalf of the authority without general or specific directions by the authority, as shown by the bylaws or minutes of a meeting of the authority. The executive director is responsible for hiring, supervision, and dismissal of all other employees of the authority.\nThe authority shall establish a website for purposes of providing information to the public concerning all actions taken by the authority. At a minimum, the website must contain a current version of the authority's bylaws, notices of upcoming meetings, minutes of the authority's meetings, and contact telephone, electronic mail, and facsimile numbers for public comments.\nAny three members shall constitute a quorum for the conduct of business and action may be taken upon the vote of a majority of members present at a meeting duly called and held. During the design and construction stages of the stadium, a four-fifths vote of the authority is required for authority decisions related to zoning, land use, exterior design of the stadium, related parking, the plaza area, and the selection of the authority's lead representative during design and construction.",
	"repealed": false
}