{
	"id": "256.484",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.484",
	"title": "256.484 SOCIAL ADJUSTMENT SERVICES TO REFUGEES.",
	"text": "The commissioner of human services shall establish a grant program to provide social adjustment services to refugees residing in Minnesota who experience depression, emotional stress, and personal crises resulting from past trauma and refugee camp experiences.\nFor purposes of this section, the following terms have the meanings given them:\n(a) \"Refugee\" means a refugee or asylee status granted by the United States Citizenship and Immigration Services.\n(b) \"Social adjustment services\" means treatment or services, including psychiatric assessment, chemical therapy, individual or family counseling, support group participation, after care or follow-up, information and referral, and crisis intervention.\nThe commissioner shall select projects for funding under this section. Projects selected must be administered by service providers who have experience in providing bilingual social adjustment services to refugees. Project administrators must present evidence that the service provider's social adjustment services for targeted refugees has historically resolved major problems identified at the time of intake.\nProject proposals selected under this section must:\n(1) use existing resources when possible;\n(2) clearly specify program goals and timetables for project operation;\n(3) identify available support services, social services, and referral procedures to be used in serving the targeted refugees;\n(4) provide bilingual services; and\n(5) identify the training and experience that enable project staff to provide services to targeted refugees, and identify the number of staff with bilingual service expertise.\nSelected service providers must report to the commissioner by June 30 of each year on the number of refugees served, the average cost per refugee served, the number and percentage of refugees who are successfully assisted through social adjustment services, and recommendations for modifications in service delivery for the upcoming year.",
	"repealed": false
}