{
	"id": "524.5-418",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-418",
	"title": "524.5-418 GENERAL POWERS AND DUTIES OF CONSERVATOR WITH RESPECT TO REAL PROPERTY.",
	"text": "This section is applicable only to conservatorships and not to decedents' estates. As used in this section, the word \"mortgage\" includes an extension of an existing mortgage, subject to the provisions of this section, and the word \"lease\" means a lease for one or more years, unless the context indicates otherwise. The conservator shall have the following powers and duties with respect to conservatorship real property.\n(a) The court may direct a sale, mortgage, or lease of any real estate of a person subject to conservatorship when the personal property is insufficient to pay debts and other charges against the estate, or to provide for the support, maintenance, and education of the person subject to conservatorship, a spouse, and dependent children, or when it shall determine the sale, mortgage, or lease to be for the best interest of the person subject to conservatorship. The homestead of a person subject to conservatorship shall not be sold, mortgaged, or leased unless the written consent of the spouse has been filed.\n(b) A conservator may file a petition to sell, mortgage, or lease alleging briefly the facts constituting the reasons for the application and describing the real estate involved therein. The petition may include all the real estate of the person subject to conservatorship or any part or parts thereof. It may apply for different authority as to separate parcels. It may apply in the alternative for authority to sell, mortgage, or lease.\n(1) Upon the filing of such petition, the court shall fix the time and place for the hearing thereof. Notice of the hearing shall be given to interested persons and shall state briefly the nature of the application made by the petition. If publication of notice is required by the court, published notice shall be given by publication once a week for two consecutive weeks in a legal newspaper designated by the petitioner in the county wherein the proceedings are pending, or, if no such designation be made, in any legal newspaper in the county, or, if the city of the residence of the person subject to conservatorship is situated in more than one county, in any legal newspaper in the city. The first publication shall be had within two weeks after the date of the order fixing the time and place for the hearing. Proof of publication and mailing shall be filed before the hearing. No defect in any notice or in the publication or service thereof shall invalidate any proceedings.\n(2) Upon the hearing, the court shall have full power to direct the sale, mortgage, or lease of all the real estate described in the petition, or to direct the sale, mortgage, or lease of any one or more parcels thereof, provided that any such direction shall be within the terms of the application made by the petition. The order shall describe the real estate to be sold, mortgaged, or leased, and may designate the sequence in which the several parcels shall be sold, mortgaged, or leased. If the order be for a sale, it shall direct whether the real estate shall be sold at private sale or public auction. An order to mortgage shall fix the maximum amount of the principal and the maximum rate of interest and shall direct the purpose for which the proceeds shall be used. An order for sale, mortgage, or lease shall remain in force until terminated by the court, but no private sale shall be made after one year from the date of the order unless the real estate shall have been reappraised under order of the court within six months preceding the sale.\n(3) The court may order a sale of real estate for cash, part cash, and a purchase-money mortgage of not more than 50 percent of the purchase price, or on contract for deed. The initial payment under a sale on contract shall not be less than ten percent of the total purchase price, and the unpaid purchase price shall bear interest at a rate of not less than four percent per annum and shall be payable in reasonable monthly, quarterly, semiannual, or annual payments, and the final installment shall become due and payable not later than ten years from the date of the contract. Such contract shall provide for conveyance by conservator's or quitclaim deed, which deed shall be executed and delivered upon full performance of the contract without further order of the court. In the event of termination of the interest of the purchaser and assigns in such contract, the real estate may be resold under the original order and a reappraisal within six months preceding the sale. A sale of the vendor's interest in real estate sold by the conservator on contract may be made under order of the court, with or without notice, upon an appraisal of such interest within six months preceding the sale; no such sale shall be made for less than its value as fixed by such appraisal.\n(4) If a sale at public auction is ordered, two weeks' published notice of the time and place of sale shall be given. Proof of publication shall be filed before the confirmation of the sale. Such publication and sale may be made in the county where the real estate is situated or in the county of the proceedings. If the parcels to be sold are contiguous and lie in more than one county, notice may be given and the sale may be made in either of such counties or in the county of the proceedings. The conservator may adjourn the sale from time to time, if for the best interests of the estate and the persons concerned, but not exceeding six months in all. Every adjournment shall be announced publicly at the time and place fixed for the sale and, if for more than one day, further notice thereof shall be given as the court may direct.\n(5) If a private sale be ordered, the real estate shall be reappraised by two or more disinterested persons under order of the court unless a prior appraisal of the real estate has been made by two or more disinterested persons not more than six months before the sale, which reappraisal shall be filed before the confirmation of the sale. No real estate shall be sold at private sale for less than its value as fixed by such appraisal.\n(6) If the bond is insufficient, before confirmation of a sale or lease, or before execution of a mortgage, the conservator shall file an additional bond in such amount as the court may require.\n(7) Upon making a sale or lease, the conservator shall file a report thereof. Upon proof of compliance with the terms of the order, the court may confirm the sale or lease and order the conservator to execute and deliver the proper instrument.\n(c) When a person subject to conservatorship is entitled under contract of purchase to any interest in real estate, such interest may be sold for the same reasons and in the same manner as other real estate of a person subject to conservatorship. Before confirmation, the court may require the filing of a bond conditioned to save the estate harmless. Upon confirmation, the conservator shall assign the contract and convey by conservator's or quitclaim deed.\n(d) When the estate of a person subject to conservatorship is liable for any charge, mortgage, lien, or other encumbrance upon the real estate therein, the court may refuse to confirm the sale or lease until after the filing of a bond in such amount as the court may direct conditioned to save the estate harmless.\n(e) When any real estate of a person subject to conservatorship is desired by any person, firm, association, corporation, or governmental agency having the power of eminent domain, the conservator may agree, in writing, upon the compensation to be made for the taking, injuring, damaging, or destroying thereof, subject to the approval of the court. When the agreement has been made, the conservator shall file a petition, of which the agreement shall be a part, setting forth the facts relative to the transaction.\n(1) The court, with notice to interested persons, shall hear, determine, and act upon the petition. If publication of notice is required by the court, published notice shall be given by publication once a week for two consecutive weeks in a legal newspaper designated by the petitioner in the county wherein the proceedings are pending, or, if no such designation be made, in any legal newspaper in the county, or, if the city of the residence of the person subject to conservatorship is situated in more than one county, in any legal newspaper in the city. The first publication shall be within two weeks after the date of the order fixing the time and place for the hearing. Proof of publication and mailing shall be filed before the hearing. No defect in any notice or in the publication or service thereof shall invalidate any proceedings.\n(2) If the court approves the agreement, the conservator, upon payment of the agreed compensation, shall convey the real estate sought to be acquired and execute any release which may be authorized.\n(f) When it is for the best interests of the estate of a person subject to conservatorship, real estate may be platted by the conservator under such conditions and upon such notice as the court may order.\n(g) When any person subject to conservatorship is legally bound to make a conveyance or lease, the court, without further notice, may direct the conservator to make the conveyance or lease to the person entitled thereto. The petition may be made by any person claiming to be entitled to the conveyance or lease, or by the conservator, or by any interested person or person claiming an interest in the real estate or contract, and shall show the description of the land and the facts upon which the claim for conveyance or lease is based. Upon proof of the petition, the court may order the conservator to execute and deliver an instrument of conveyance or lease upon performance of the contract.\n(h) A conservator without order of the court may make an extension of an existing mortgage for a period of five years or less, if the extension agreement contains the same prepayment privileges and the rate of interest does not exceed the lowest rate in the mortgage extended.\n(i) No conservator shall be liable personally on any mortgage note or by reason of the covenants in any instrument or conveyance executed in the capacity of conservator.\n(j) No sale, mortgage, lease, or conveyance by a conservator shall be subject to collateral attack on account of any irregularity in the proceedings if the court which ordered the same had jurisdiction of the estate.\n(k) No proceeding to have declared invalid the sale, mortgage, lease, or conveyance by a conservator shall be maintained by any person claiming under or through the person subject to conservatorship unless such proceeding is begun within five years immediately succeeding the date of such sale, mortgage, lease, or conveyance; provided, however, that in case of real estate sold by a conservator, no action for its recovery shall be maintained by or under the person subject to conservatorship unless it is begun within five years after the termination of the protective proceedings and that, in cases of fraud, minors, and others under legal disability to sue when the right of action first accrues may begin such action at any time within five years after the disability is removed.\n(l) After the filing of the petition, a certificate of the district court certified to that fact may be filed for record in the office of the county recorder for abstract property, or with the registrar of titles for registered property, of any county in which any real estate owned by the person proposed to be subject to conservatorship is situated and, if the person subject to conservatorship is a resident of this state, in the county of residence. The certificate shall state that a petition is pending and the name and address of the person for whom a conservator is sought. If a conservator is appointed on the petition, and if the conservatorship order removes or restricts the right of the person subject to conservatorship to transfer property or to contract, then all contracts and all transfers of real property made by the person subject to conservatorship after the filing and before the termination of the conservatorship shall be void.",
	"repealed": false
}