{
	"id": "177.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.255",
	"title": "177.255 PAYROLL CARD ACCOUNTS.",
	"text": "For the purposes of this section, the following terms have the meanings given them in this subdivision.\n(a) \"Payroll card\" means a card issued to an employee by an employer or other payroll card issuer to access funds from the employee's employee payroll card account.\n(b) \"Payroll card account\" means an agreement providing that an employer pays each participating employee's wages by making an electronic fund transfer to an account, and participating employees receive a payroll card to access their funds.\n(c) \"Payroll card issuer\" means an employer that issues a payroll card to an employee or a bank or other entity that issues a payroll card to an employee on behalf of the employer.\n(d) \"Offers a payroll card\" includes both the direct offers by the employer and the employer distribution to employees of material describing a payroll card program prepared by a payroll card issuer other than the employer.\n(e) \"Free\" means no fee is deducted from an employee's payroll card account or charged to the employee by the employer or the payroll card issuer.\n(f) \"Fee\" means any and all fees, charges, surcharges, or costs.\nA payroll card issuer must file with the commissioner a notice containing:\n(1) the entity's true name;\n(2) any other names under which the entity conducts business;\n(3) the entity's address, which may not be a post office box; and\n(4) the entity's telephone number.\nWages paid by electronic funds transferred to an employee's payroll card account must be owned by the employee.\nAn employee who chooses to be paid wages by electronic fund transfer to a payroll card account must be permitted to withdraw by a free transaction from the employee's payroll card account, an amount up to and including the total amount of the employee's entire net pay, as stated on the employee's earnings statement. The free transaction must be available to the employee on and after the employee's regular payday.\nWhen offering an employee the option of being paid wages by electronic fund transfer to a payroll card account, the employer shall provide to the employee written disclosure in plain language of all the employee's wage payment options. The written disclosure shall state the terms and conditions of the payroll card account option, including, but not limited to, the requirements set forth in this section and a complete itemized list of all fees that may be deducted from the employee's payroll card account by the employer or card issuer. The disclosure must also state that third parties may assess transaction fees in addition to the fees assessed by the employee's payroll card issuer or issuers. For fees that may be deducted or charged by the employer or payroll card issuer, the dollar amount of each fee must be stated. A copy of the written disclosure must be provided to the employee.\nThe employer may initiate payment of wages to an employee by electronic fund transfer to a payroll card account only after the employee has voluntarily consented in writing to that method of payment. Consent to payment of wages by electronic fund transfer to a payroll card account shall not be a condition of hire or of continued employment. The written consent signed by the employee must include the terms and conditions of the payroll card account option as provided in subdivision 5. A copy of the signed written consent must be provided to the employee and be retained by the employer.\nThe employer shall provide to the employee, upon the employee's written or oral request, one free transaction history each month that includes all deposits, withdrawals, deductions, or charges by any entity from or to the employee's payroll card account.\nThe payroll card or payroll card account shall not be linked to any form of credit including, but not limited to, a loan against future pay or a cash advance on future pay.\nUnless the employee consents in writing to the use, information generated by the employee's possession or use of a payroll card or payroll card account may only be used to process transactions and administer the payroll card and the payroll card account.\nAn employer who offers a payroll card account option to an employee using materials in a language other than English, shall provide the written disclosure and written consent required by subdivisions 5 and 6, and all payroll card account agreements in that other language.\nAn employee who is being paid wages by electronic fund transfer to a payroll card account may request to be paid wages by another method that is allowed by law. Upon the employee's request to change the wage payment method, the employer shall provide a form on which the employee shall indicate the change. The employer shall, within 14 days of the employee's request, begin payment by a different allowable method.\nAn employer may not charge an employee initiation, participation, loading, or other fees to receive wages payable in an electronic fund transfer to a payroll card account.\nFees imposed by the employer or payroll card issuer that were not disclosed to the employee shall not be deducted from the employee's payroll card account or charged to the employee. Inactivity or dormancy fees shall not be deducted from an employee's payroll card account or charged to the employee.\nA violation of this section is subject to the penalty provided in section 177.32, subdivision 1.",
	"repealed": false
}