{
	"id": "115B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.11",
	"title": "115B.11 STATUTE OF LIMITATIONS.",
	"text": "For the purposes of this section, \"construction\" means actions taken after the selection of remedial action such as excavation, building of structures, installation of equipment or fixtures, and other physical actions to respond to a release or threatened release.\n(a) An action for recovery of response costs under section 115B.04, including recovery of costs and expenses under section 115B.17, subdivision 6, may be commenced any time after costs and expenses have been incurred but must be commenced no later than six years after initiation of physical on-site construction of a response action.\n(b) A party prevailing in an action commenced within the time required under paragraph (a) shall be entitled to a declaratory judgment of liability for all future reasonable and necessary costs incurred by that party to respond to the release or threatened release, including costs and expenses under section 115B.17, subdivision 6.\nNo person may recover damages pursuant to sections 115B.01 to 115B.15 unless the action is commenced within six years from the date when the cause of action accrues. In determining when the cause of action accrues for an action to recover damages for death, personal injury or disease, the court shall consider factors including the following:\n(1) when the plaintiff discovered the injury or loss;\n(2) whether a personal injury or disease had sufficiently manifested itself; and\n(3) when the plaintiff discovered, or using due diligence should have discovered, a causal connection between the injury, disease, or loss and the release of a hazardous substance.\nSubdivisions 1 to 3 apply to actions for recovery of costs commenced on or after April 1, 1998. Response costs incurred before April 1, 1998, are recoverable in an action commenced on or after April 1, 1998, only if physical on-site construction of the response action was initiated not more than six years before the cost recovery action is commenced. Notwithstanding any provision in Laws 1998, chapter 341, to the contrary, the running of the statute of limitations imposed by subdivisions 1 to 3 with respect to cost recovery actions is suspended until July 1, 1999. Subdivisions 1 to 3 shall not apply to any litigation pending in court on March 31, 1998, if the statute of limitations under this chapter has been contested in the litigation. Subdivisions 1 to 3 shall not be offered by any party as evidence of the intent, meaning, or application of the statute of limitations under this chapter.",
	"repealed": false
}