{
	"id": "336.8-102",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.8-102",
	"title": "336.8-102 DEFINITIONS.",
	"text": "(a) In this article:\n(1) \"Adverse claim\" means a claim that a claimant has a property interest in a financial asset and that it is a violation of the rights of the claimant for another person to hold, transfer, or deal with the financial asset.\n(2) \"Bearer form,\" as applied to a certificated security, means a form in which the security is payable to the bearer of the security certificate according to its terms but not by reason of an endorsement.\n(3) \"Broker\" means a person defined as a broker or dealer under the federal securities laws, but without excluding a bank acting in that capacity.\n(4) \"Certificated security\" means a security that is represented by a certificate.\n(5) \"Clearing corporation\" means:\n(i) a person that is registered as a \"clearing agency\" under the federal securities laws;\n(ii) a federal reserve bank; or\n(iii) any other person that provides clearance or settlement services with respect to financial assets that would require it to register as a clearing agency under the federal securities laws but for an exclusion or exemption from the registration requirement, if its activities as a clearing corporation, including promulgation of rules, are subject to regulation by a federal or state governmental authority.\n(6) \"Communicate\" means to:\n(i) send a signed record; or\n(ii) transmit information by any mechanism agreed upon by the persons transmitting and receiving the information.\n(7) \"Entitlement holder\" means a person identified in the records of a securities intermediary as the person having a security entitlement against the securities intermediary. If a person acquires a security entitlement by virtue of section 336.8-501(b)(2) or (3), that person is the entitlement holder.\n(8) \"Entitlement order\" means a notification communicated to a securities intermediary directing transfer or redemption of a financial asset to which the entitlement holder has a security entitlement.\n(9) \"Financial asset,\" except as otherwise provided in section 336.8-103, means:\n(i) a security;\n(ii) an obligation of a person or a share, participation, or other interest in a person or in property or an enterprise of a person, which is, or is of a type, dealt in or traded on financial markets, or which is recognized in any area in which it is issued or dealt in as a medium for investment; or\n(iii) any property that is held by a securities intermediary for another person in a securities account if the securities intermediary has expressly agreed with the other person that the property is to be treated as a financial asset under this article.\nAs context requires, the term means either the interest itself or the means by which a person's claim to it is evidenced, including a certificated or uncertificated security, a security certificate, or a security entitlement.\n(10) (Reserved.)\n(11) \"Endorsement\" means a signature that alone or accompanied by other words is made on a security certificate in registered form or on a separate document for the purpose of assigning, transferring, or redeeming the security or granting a power to assign, transfer, or redeem it.\n(12) \"Instruction\" means a notification communicated to the issuer of an uncertificated security which directs that the transfer of the security be registered or that the security be redeemed.\n(13) \"Registered form,\" as applied to a certificated security, means a form in which:\n(i) the security certificate specifies a person entitled to the security; and\n(ii) a transfer of the security may be registered upon books maintained for that purpose by or on behalf of the issuer, or the security certificate so states.\n(14) \"Securities intermediary\" means:\n(i) a clearing corporation; or\n(ii) a person, including a bank or broker, that in the ordinary course of its business maintains securities accounts for others and is acting in that capacity.\n(15) \"Security,\" except as otherwise provided in section 336.8-103, means an obligation of an issuer or a share, participation, or other interest in an issuer or in property or an enterprise of an issuer:\n(i) which is represented by a security certificate in bearer or registered form, or the transfer of which may be registered upon books maintained for that purpose by or on behalf of the issuer;\n(ii) which is one of a class or series or by its terms is divisible into a class or series of shares, participations, interests, or obligations; and\n(iii) which:\n(A) is, or is of a type, dealt in or traded on securities exchanges or securities markets; or\n(B) is a medium for investment and by its terms expressly provides that it is a security governed by this article.\n(16) \"Security certificate\" means a certificate representing a security.\n(17) \"Security entitlement\" means the rights and property interest of an entitlement holder with respect to a financial asset specified in part 5.\n(18) \"Uncertificated security\" means a security that is not represented by a certificate.\n(b) The following definitions in this article and other articles apply to this article:\n\"Appropriate person,\" section 336.8-107.\n\"Control,\" section 336.8-106.\n\"Controllable account,\" section 336.9-102.\n\"Controllable electronic record,\" section 336.12-102.\n\"Controllable payment intangible,\" section 336.9-102.\n\"Delivery,\" section 336.8-301.\n\"Investment company security,\" section 336.8-103.\n\"Issuer,\" section 336.8-201.\n\"Overissue,\" section 336.8-210.\n\"Protected purchaser,\" section 336.8-303.\n\"Securities account,\" section 336.8-501.\n(c) In addition, article 1 contains general definitions and principles of construction and interpretation applicable throughout this article.\n(d) The characterization of a person, business, or transaction for purposes of this article does not determine the characterization of the person, business, or transaction for purposes of any other law, regulation, or rule.",
	"repealed": false
}