{
	"id": "216C.441",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.441",
	"title": "216C.441 MINNESOTA CLIMATE INNOVATION FINANCE AUTHORITY.",
	"text": "(a) There is created a public body corporate and politic to be known as the \"Minnesota Climate Innovation Finance Authority,\" whose purpose is to accelerate the deployment of clean energy projects, greenhouse gas emissions reduction projects, and other qualified projects through the strategic deployment of public funds in the form of grants, loans, credit enhancements, and other financing mechanisms in order to leverage existing public and private sources of capital to reduce the upfront and total cost of qualified projects and to overcome financial barriers to project adoption, especially in low-income communities.\n(b) The goals of the authority include but are not limited to:\n(1) reducing Minnesota's contributions to climate change by accelerating the deployment of clean energy projects;\n(2) ensuring that all Minnesotans share the benefits of clean and renewable energy and the opportunity to fully participate in the clean energy economy by promoting:\n(i) the creation of clean energy jobs for Minnesota workers, particularly in environmental justice communities and communities in which fossil fuel electric generating plants are retiring; and\n(ii) the principles of environmental justice in the authority's operations and funding decisions; and\n(3) maintaining energy reliability while reducing the economic burden of energy costs, especially on low-income households.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Authority\" means the Minnesota Climate Innovation Finance Authority.\n(c) \"Board\" means the Minnesota Climate Innovation Finance Authority's board of directors established in subdivision 10.\n(d) \"Clean energy project\" has the meaning given to \"qualified project\" in paragraph (n), clauses (1) to (7).\n(e) \"Community navigator\" means an organization that works to facilitate access to clean energy project financing by individuals and community groups.\n(f) \"Credit enhancement\" means a pool of capital set aside to cover potential losses on loans and other investments made by financing entities, including a pool for multistate projects provided that benefits to Minnesota outweigh any contribution from the authority at least two to one. Credit enhancement includes but is not limited to loan loss reserves and loan guarantees.\n(g) \"Energy storage system\" has the meaning given in section 216B.2422, subdivision 1, paragraph (f).\n(h) \"Environmental justice\" means that:\n(1) communities of color, Indigenous communities, and low-income communities have a healthy environment and are treated fairly when environmental statutes, rules, and policies are developed, adopted, implemented, and enforced; and\n(2) in all decisions that have the potential to affect the environment of an environmental justice community or the public health of an environmental justice community's residents, due consideration is given to the history of the area's and the area's residents' cumulative exposure to pollutants and to any current socioeconomic conditions that increase the physical sensitivity of the area's residents to additional exposure to pollutants.\n(i) \"Environmental justice community\" means a community in Minnesota that:\n(1) is defined as a disadvantaged community by the federal source of funding accessed by the authority under this section; or\n(2) based on the most recent data published by the United States Census Bureau, meets one or more of the following criteria:\n(i) 40 percent or more of the community's total population is nonwhite;\n(ii) 35 percent or more of households in the community have an income that is at or below 200 percent of the federal poverty level;\n(iii) 40 percent or more of the community's residents over the age of five have limited English proficiency; or\n(iv) the community is located within Indian country, as defined in United States Code, title 18, section 1151.\n(j) \"Greenhouse gas emissions\" means emissions of carbon dioxide, methane, nitrous oxide, hydrofluorocarbons, perfluorocarbons, and sulfur hexafluoride emitted by anthropogenic sources.\n(k) \"Loan loss reserve\" means a pool of capital set aside to reimburse a private lender if a customer defaults on a loan, up to an agreed-upon percentage of loans originated by the private lender.\n(l) \"Microgrid system\" means an electrical grid that:\n(1) serves a discrete geographical area from distributed energy resources; and\n(2) can operate independently from the central electric grid on a temporary basis.\n(m) \"Project labor agreement\" means a prehire collective bargaining agreement with a council of building and construction trades labor organizations (1) prohibiting strikes, lockouts, and similar disruptions, and (2) providing for a binding procedure to resolve labor disputes on the project.\n(n) \"Qualified project\" means a project, technology, product, service, or measure promoting energy efficiency, clean energy, electrification, or water conservation and quality that:\n(1) substantially reduces greenhouse gas emissions;\n(2) reduces energy use without diminishing the level of service;\n(3) increases the deployment of renewable energy projects, energy storage systems, district heating, smart grid technologies, or microgrid systems;\n(4) replaces existing fossil-fuel-based technology with an end-use electric technology;\n(5) supports the development and deployment of electric vehicle charging stations and associated infrastructure, electric buses, and electric fleet vehicles;\n(6) reduces water use or protects, restores, or preserves the quality of surface waters; or\n(7) incentivizes customers to shift demand in response to changes in the price of electricity or when system reliability is not jeopardized.\n(o) \"Renewable energy\" has the meaning given in section 216B.1691, subdivision 1, paragraph (c), clauses (1), (2), and (4), and includes fuel cells generated from renewable energy.\n(p) \"Securitization\" means the conversion of an asset composed of individual loans into marketable securities.\n(q) \"Smart grid\" means a digital technology that:\n(1) allows for two-way communication between a utility and the utility's customers; and\n(2) enables the utility to control power flow and load in real time.\n(a) For the purpose of exercising the specific powers granted in this section, the authority has the general powers granted in this subdivision.\n(b) The authority may:\n(1) hire an executive director and staff to conduct the authority's operations;\n(2) sue and be sued;\n(3) have a seal and alter the seal;\n(4) acquire, hold, lease, manage, and dispose of real or personal property for the authority's corporate purposes;\n(5) enter into agreements, including cooperative financing agreements, contracts, or other transactions, with a Tribal government, any federal or state agency, county, local unit of government, regional development commission, person, domestic or foreign partnership, corporation, association, or organization;\n(6) acquire by purchase real property, or an interest therein, in the authority's own name where acquisition is necessary or appropriate;\n(7) provide general technical and consultative services related to the authority's purpose;\n(8) promote research and development in matters related to the authority's purpose;\n(9) conduct market analysis to determine where the market is underserved;\n(10) analyze greenhouse gas emissions reduction project financing needs in the state and recommend measures to alleviate any shortage of financing capacity;\n(11) contract with any governmental or private agency or organization, legal counsel, financial advisor, investment banker, or others to assist in the exercise of the authority's powers;\n(12) enter into agreements with qualified lenders or others insuring or guaranteeing to the state the payment of qualified loans or other financing instruments; and\n(13) accept on behalf of the state any gift, grant, or interest in money or personal property tendered to the state for any purpose pertaining to the authority's activities.\n(a) The authority must:\n(1) serve as a financial resource to reduce the upfront and total costs of implementing qualified projects;\n(2) ensure that all financed projects reduce greenhouse gas emissions;\n(3) ensure that financing terms and conditions offered are well-suited to qualified projects;\n(4) strategically prioritize the use of the authority's funds to leverage private investment in qualified projects, with the aim of achieving a high ratio of private to public money invested through funding mechanisms that support, enhance, and complement private lending and investment;\n(5) coordinate with existing federal, state, local, utility, and other programs to ensure that the authority's resources are being used most effectively to add to and complement those programs;\n(6) stimulate demand for qualified projects by:\n(i) contracting with the department to provide, including through subcontracts with community navigators, information to project participants about federal, state, local, utility, and other authority financial assistance for qualifying projects, and technical information on energy conservation and renewable energy measures;\n(ii) forming partnerships with contractors and informing contractors about the authority's financing programs;\n(iii) developing innovative marketing strategies to stimulate project owner interest, especially in underserved communities; and\n(iv) incentivizing financing entities to increase activity in underserved markets;\n(7) finance projects in all regions of the state;\n(8) develop participant eligibility standards and other terms and conditions for financial support provided by the authority;\n(9) develop and administer:\n(i) policies to collect reasonable fees for authority services; and\n(ii) risk management activities to support ongoing authority activities;\n(10) develop consumer protection standards governing the authority's investments to ensure that financial support is provided responsibly and transparently and is in the financial interest of participating project owners;\n(11) develop methods to accurately measure the impact of the authority's activities, particularly on low-income communities and on greenhouse gas emissions reductions;\n(12) hire an executive director and sufficient staff with the appropriate skills and qualifications to carry out the authority's programs, making an affirmative effort to recruit and hire a director and staff who are from, or share the interests of, the communities the authority must serve;\n(13) apply for, either as a direct or subgrantee applicant, and accept Greenhouse Gas Reduction Fund grants authorized by the federal Clean Air Act, United States Code, title 42, section 7434, paragraph (a), clauses (1), (2), and (3). Until the Climate Innovation Finance Authority is established, the commissioner shall apply for and receive funding through Public Law 117-169 in order to leverage state investment, on behalf of the authority. To the extent practicable, applications for these funds by or on behalf of the authority should be made in coordination with other Minnesota applicants;\n(14) acting under its powers as a state energy financing institution under United States Code, title 42, section 16511, collaborate with the United States Department of Energy Loan Programs Office to ensure that authorities made available under the Inflation Reduction Act of 2022, Public Law 117-169, maximally benefit Minnesotans. Until the Climate Innovation Finance Authority is established, the commissioner may engage with the United States Department of Energy Loan Programs Office on behalf of the authority; and\n(15) ensure that authority contracts with all third-party administrators, contractors, and subcontractors contain required covenants, representations, and warranties specifying that contracted third parties are agents of the authority and that all acts of contracted third parties are considered acts of the authority, provided that the act is within the contracted scope of work.\n(b) The authority may:\n(1) employ credit enhancement mechanisms that reduce financial risk for financing entities by providing assurance that a limited portion of a loan or other financial instrument is assumed by the authority via a loan loss reserve, loan guarantee, or other mechanism;\n(2) co-invest in a qualified project by providing senior or subordinated debt, equity, or other mechanisms in conjunction with other investment, co-lending, or financing;\n(3) aggregate small and geographically dispersed qualified projects in order to diversify risk or secure additional private investment through securitization or similar resale of the authority's interest in a completed qualified project;\n(4) expend up to 25 percent of funds appropriated to the authority for start-up purposes, which may be used for financing programs and project investments authorized under this section, prior to adoption of the strategic plan required under subdivision 7 and the investment strategy under subdivision 8; and\n(5) require a specific project to agree to implement a project labor agreement as a condition of receiving financing from the authority.\nThe authority must not provide loans to a single entity in an amount less than $250,000.\n(a) In determining the projects in which the authority will participate, the authority must give preference to projects that:\n(1) maximize the creation of high-quality employment and apprenticeship opportunities for local workers, consistent with the public interest, especially workers from environmental justice communities, labor organizations, and Minnesota communities hosting retired or retiring electric generation facilities, including workers previously employed at retiring facilities;\n(2) utilize energy technologies produced domestically that received an advanced manufacturing tax credit under section 45X of the Internal Revenue Code, as allowed under the federal Inflation Reduction Act of 2022, Public Law 117-169;\n(3) certify, for all contractors and subcontractors, that the rights of workers to organize and unionize are recognized; and\n(4) agree to implement a project labor agreement.\n(b) The authority must require, for all projects for which the authority provides financing, that:\n(1) if the budget is $100,000 or more, all contractors and subcontractors:\n(i) must pay no less than the prevailing wage rate, as defined in section 177.42, subdivision 6; and\n(ii) are subject to the requirements and enforcement provisions under sections 177.27, 177.30, 177.32, 177.41 to 177.43, and 177.45, including the posting of prevailing wage rates, prevailing hours of labor, and hourly basic rates of pay for all trades on the project in at least one conspicuous location at the project site;\n(2) financing is not offered without first ensuring that the participants meet the authority's underwriting criteria; and\n(3) any loan made to a homeowner for a project on the homeowner's residence complies with section 47.59 and the following federal laws:\n(i) the Truth in Lending Act, United States Code, title 15, section 1601 et seq.;\n(ii) the Fair Credit Reporting Act, United States Code, title 15, section 1681;\n(iii) the Equal Credit Opportunity Act, United States Code, title 15, section 1691 et seq.; and\n(iv) the Fair Debt Collection Practices Act, United States Code, title 15, section 1692.\n(c) The authority and any third-party administrator, contractor, subcontractor, or agent that conducts lending, financing, investment, marketing, administration, servicing, or installation of measures in connection with a qualified project financed in whole or in part with authority funds is subject to sections 325D.43 to 325D.48; 325F.67 to 325F.71; 325G.06 to 325G.14; 325G.29 to 325G.37; and 332.37.\n(d) For the purposes of this section, \"local workers\" means Minnesota residents who permanently reside within 150 miles of the location of a proposed project in which the authority is considering to participate.\n(a) By December 15, 2024, and each December 15 in even-numbered years thereafter, the authority must develop and adopt a strategic plan that prioritizes the authority's activities over the next two years. A strategic plan must:\n(1) identify targeted underserved markets for qualified projects in Minnesota;\n(2) develop specific programs to overcome market impediments through access to authority financing and technical assistance; and\n(3) develop outreach and marketing strategies designed to make potential project developers, participants, and communities aware of financing and technical assistance available from the authority, including the deployment of community navigators.\n(b) Elements of the strategic plan must be informed by the authority's analysis of the market for qualified projects, and by the authority's experience under the previous strategic plan, including the degree to which performance targets were or were not achieved by each financing program. In addition, the authority must actively seek input regarding activities that should be included in the strategic plan from stakeholders, environmental justice communities, the general public, and participants, including via meetings required under subdivision 9.\n(c) The authority must establish annual targets in a strategic plan for each financing program regarding the number of projects, level of authority investments, greenhouse gas emissions reductions, and installed generating capacity or energy savings the authority hopes to achieve, including separate targets for authority activities undertaken in environmental justice communities.\n(d) The authority's targets and strategies must be designed to ensure that no less than 40 percent of the direct benefits of authority activities flow to environmental justice communities as defined under subdivision 2, by the United States Department of Energy, or as modified by the department.\n(a) No later than December 15, 2024, and every four years thereafter, the authority must adopt a long-term investment strategy to ensure the authority's paramount goal to reduce greenhouse gas emissions is reflected in all of the authority's operations. The investment strategy must address:\n(1) the types of qualified projects the authority should focus on;\n(2) gaps in current qualified project financing that present the greatest opportunities for successful action by the authority;\n(3) how the authority can best position itself to maximize its impact without displacing, subsidizing, or assuming risk that should be shared with financing entities;\n(4) financing tools that will be most effective in achieving the authority's goals;\n(5) partnerships the authority should establish with other organizations to increase the likelihood of success; and\n(6) how values of equity, environmental justice, and geographic balance can be integrated into all investment operations of the authority.\n(b) In developing an investment strategy, the authority must consult, at a minimum, with similar organizations in other states, lending authorities, state agencies, utilities, environmental and energy policy nonprofits, labor organizations, and other organizations that can provide valuable advice on the authority's activities.\n(c) The long-term investment strategy must contain provisions ensuring that:\n(1) authority investments are not made solely to reduce private risk; and\n(2) private financing entities do not unilaterally control the terms of investments to which the authority is a party.\n(d) The board must submit a draft long-term investment strategy for comment to each of the groups and individuals the board consults under paragraph (b) and to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over energy finance and policy, and must post the draft strategy on the authority's website. The authority must accept written comments on the draft strategy for at least 30 days and must consider the comments in preparing the final long-term investment strategy.\nThe authority must:\n(1) maintain a public website that provides information about the authority's operations, current financing programs, and practices, including rates, terms, and conditions; the number and amount of investments by project type; the number of jobs created; the financing application process; and other information;\n(2) periodically issue an electronic newsletter to stakeholders and the public containing information on the authority's products, programs, and services and key authority events and decisions; and\n(3) hold quarterly meetings accessible online to update the general public on the authority's activities, report progress being made in regard to the authority's strategic plan and long-term investment strategy, and invite audience questions regarding authority programs.\n(a) The Minnesota Climate Innovation Finance Authority Board of Directors shall consist of the following 13 members:\n(1) the commissioner of commerce, or the commissioner's designee;\n(2) the commissioner of labor and industry, or the commissioner's designee;\n(3) the commissioner of the Minnesota Pollution Control Agency, or the commissioner's designee;\n(4) the commissioner of employment and economic development, or the commissioner's designee;\n(5) the commissioner of the Minnesota Housing Finance Agency, or the commissioner's designee;\n(6) the chair of the Minnesota Indian Affairs Council, or the chair's designee; and\n(7) seven additional members appointed by the governor, as follows:\n(i) one member representing either a municipal electric utility or a cooperative electric association;\n(ii) one member, appointed after the governor consults with labor organizations in the state, must be a representative of a labor union with experience working on clean energy projects;\n(iii) one member with expertise in the impact of climate change on Minnesota communities, particularly low-income communities;\n(iv) one member with expertise in financing projects at a community bank, credit union, community development institution, or local government;\n(v) one member with expertise in sustainable development and energy conservation;\n(vi) one member with expertise in environmental justice; and\n(vii) one member with expertise in investment fund management or financing and deploying clean energy technologies.\n(b) At least two members appointed to the board must permanently reside outside the metropolitan area, as defined in section 473.121, subdivision 2. The board must collectively reflect the geographic and ethnic diversity of the state.\n(c) Board members appointed under paragraph (a), clause (7), shall serve a term of four years, except that the initial appointments made under clause (7), items (i) to (iii), shall be for two-year terms, and the initial appointments made under clause (7), items (iv) to (vi), shall be for three-year terms.\n(d) Members appointed to the board must:\n(1) provide evidence of a commitment to the authority's purposes and goals; and\n(2) not hold any personal or professional conflicts of interest related to the authority's activities, including with respect to the member's financial investments and employment or the financial investments and employment of the member's immediate family members.\n(e) The governor must make the appointments required under this section no later than October 1, 2023.\n(f) The initial meeting of the board of directors must be held no later than November 17, 2023. At the initial meeting, the board shall elect a chair and vice-chair by majority vote of the members present.\n(g) The authority shall contract with the department to provide administrative and technical services to the board and to prospective borrowers, especially those serving or located in environmental justice communities.\n(h) Compensation of board members, removal of members, and filling of vacancies are governed by section 15.0575.\n(i) Board members may be reappointed for up to two full terms.\n(j) A majority of board members, excluding vacancies, constitutes a quorum for the purpose of conducting business and exercising powers, and for all other purposes. Action may be taken by the authority upon a vote of a majority of the quorum present.\n(k) Board members and officers are not personally liable, either jointly or severally, for any debt or obligation created or incurred by the authority.\n(a) The Minnesota climate innovation authority account is established as a separate account in the special revenue fund in the state treasury. The authority's board of directors shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund, but remains in the account until expended. The authority's board of directors shall manage the account.\n(b) Money in the account is appropriated to the board of directors of the Minnesota Climate Innovation Finance Authority for the purposes of this section and to reimburse the reasonable costs of the authority to administer this section.\nBeginning February 1, 2024, the authority must annually submit a comprehensive report on the authority's activities during the previous year to the governor and the chairs and ranking minority members of the legislative committees with primary jurisdiction over energy policy. The report must contain, at a minimum, information on:\n(1) the amount of authority capital invested, by project type;\n(2) the amount of private and public capital leveraged by authority investments, by project type;\n(3) the number of qualified projects supported, by project type and location within Minnesota, including in environmental justice communities;\n(4) the estimated number of jobs created for local workers and nonlocal workers, the ratio of projects subject to and exempt from prevailing wage requirements under subdivision 6, paragraph (b), and tax revenue generated as a result of the authority's activities;\n(5) estimated reductions in greenhouse gas emissions resulting from the authority's activities;\n(6) the number of clean energy projects financed in low- and moderate-income households;\n(7) a narrative describing the progress made toward the authority's equity, social, and labor standards goals; and\n(8) a financial audit conducted by an independent party.",
	"repealed": false
}