{
	"id": "17.1017",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.1017",
	"title": "17.1017 GOOD FOOD ACCESS PROGRAM.",
	"text": "(a) For purposes of this section, unless the language or context indicates that a different meaning is intended, the following terms have the meanings given them.\n(b) \"Account\" means the good food access account established in subdivision 3.\n(c) \"Commissioner\" means the commissioner of agriculture.\n(d) \"Economic or community development financial institution (ECDFI)\" means a lender, including but not limited to a community development financial institution (CDFI), an economic development district (EDD), a political subdivision of the state, a microenterprise firm, or a nonprofit community lending organization that has previous experience lending to a food retailer, producer, or another healthy food enterprise in an underserved community in a low-income or moderate-income area, as defined in this section; has been in existence and operating prior to January 1, 2014; has demonstrated the ability to raise matching capital and in-kind services to leverage appropriated money; has the demonstrated ability to underwrite loans and grants; and has partnered previously with nonprofit healthy food access, public health, or related governmental departments or community organizations.\n(e) \"Farmers' market\" means an association of three or more persons who assemble at a defined location that is open to the public for the purpose of selling directly to the consumer the products of a farm or garden occupied and cultivated by the person selling the product.\n(f) \"Financing\" means loans, including low-interest loans, zero-interest loans, forgivable loans, and other types of financial assistance other than grants.\n(g) \"Food hub\" means a centrally located facility with a business management structure that facilitates the aggregation, storage, processing, distribution, marketing, and sale of locally or regionally produced food products, and which may include a small-scale retail grocery operation.\n(h) \"Good Food Access Program Advisory Committee\" means the Good Food Access Program Advisory Committee under section 17.1018.\n(i) \"Grocery store\" means a for-profit, not-for-profit, or cooperative self-service retail establishment that sells primarily meat, fish, seafood, fruits, vegetables, dry groceries, and dairy products and may also sell household products, sundries, and other products. Grocery store includes a supermarket or a large-, mid-, or small-scale retail grocery establishment and may include a mobile food market or a delivery service operation.\n(j) \"Low-income area\" means a census tract as reported in the most recently completed decennial census published by the United States Bureau of the Census that has a poverty rate of at least 20 percent or in which the median family income does not exceed 80 percent of the greater of the statewide or metropolitan median family income.\n(k) \"Moderate-income area\" means a census tract as reported in the most recently completed decennial census published by the United States Bureau of the Census in which the median family income is between 81 percent and 95 percent of the median family income for that area.\n(l) \"Mobile food market\" means a self-contained for-profit, not-for-profit, or cooperative retail grocery operation located in a movable new or renovated truck, bus, or other vehicle that is used to store, prepare, display, and sell primarily meat, fish, seafood, fruits, vegetables, dry groceries, and dairy products and may also be used to sell a nominal supply of cooking utensils and equipment and other household products and sundries.\n(m) \"Program\" means the good food access program established in this section.\n(n) \"Small food retailer\" means a small-scale retail food outlet, other than a grocery store as defined in this section. Small food retailer includes, but is not limited to, a corner store, convenience store, farmers' market, mobile food market, and a retail food outlet operated by an emergency food program or food hub.\n(o) \"Technical assistance\" means needs-based project assistance provided through the program, including sustainability-focused individualized guidance, presentations, workshops, trainings, printed materials, mentorship opportunities, peer-to-peer opportunities, or other guidance and resources on relevant topics such as business planning, sales projections, cash flow, succession planning, financing, fundraising, marketing, food preparation demonstrations, and workforce training.\n(p) \"Underserved community\" means a census tract that is federally designated as a food desert by the United States Department of Agriculture, or a census tract in a low-income or moderate-income area that includes a substantial subpopulation such as the elderly or the disabled that has low supermarket access, regardless of distance, due to lack of transportation.\n(a) A good food access program is established within the Department of Agriculture to increase the availability of and access to affordable, nutritious, and culturally appropriate food, including fresh fruits and vegetables, for underserved communities in low-income and moderate-income areas by providing financial support and sustainable public-private projects to open, renovate, or expand the operations of grocery stores and small food retailers; expanding access to credit and reducing barriers to investment in underserved communities in low- and moderate-income areas; and to provide technical assistance, primarily for small food retailers with demonstrated need, to increase availability and sustainable sales of affordable, nutritious, and culturally appropriate food, including fresh fruits and vegetables, to underserved communities in low-income and moderate-income areas. The commissioner, in cooperation with public and private partners, shall establish and implement the program as provided in this section.\n(b) The good food access program shall be comprised of state or private grants, loans, or other types of financial and technical assistance for the establishment, construction, expansion of operations, or renovation of grocery stores and small food retailers to increase the availability of and access to affordable fresh produce and other nutritious, culturally appropriate food to underserved communities in low-income and moderate-income areas.\nA good food access account is established in the agricultural fund. The account consists of money appropriated by the legislature to the commissioner, as provided by law, and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account, including interest, is appropriated to the commissioner for the purposes of this section, and shall be used, to the extent practicable, to leverage other forms of public and private financing or financial assistance for the projects.\n(a) The commissioner shall be the administrator of the account for auditing purposes and shall establish program requirements and a competitive process for projects applying for financial and technical assistance.\n(b) The commissioner may receive money or other assets from any source, including but not limited to philanthropic foundations and financial investors, for deposit into the account.\n(c) Through issuance of requests for proposals, the commissioner may contract with one or more qualified economic or community development financial institutions to manage the financing component of the program and with one or more qualified organizations or public agencies with financial or other program-related expertise to manage the provision of technical assistance to project grantees.\n(d) Money in the account at the close of each fiscal year shall remain in the account and shall not cancel. In each biennium, the commissioner shall determine the appropriate proportion of money to be allocated to loans, grants, technical assistance, and any other types of financial assistance.\n(e) To encourage public-private, cross-sector collaboration and investment in the account and program and to ensure that the program intent is maintained throughout implementation, the commissioner shall convene and maintain the Good Food Access Program Advisory Committee.\n(f) The commissioner, in cooperation with the Good Food Access Program Advisory Committee, shall manage the program, establish program criteria, facilitate leveraging of additional public and private investment, and promote the program statewide.\n(g) The commissioner, in cooperation with the Good Food Access Program Advisory Committee, shall establish annual monitoring and accountability mechanisms for all projects receiving financing or other financial or technical assistance through this program.\n(a) The commissioner, in cooperation with the program partners and advisers, shall establish project eligibility guidelines and application processes to be used to review and select project applicants for financing or other financial or technical assistance. All projects must be located in an underserved community or must serve primarily underserved communities in low-income and moderate-income areas.\n(b) Projects eligible for financing include, but are not limited to, new construction, renovations, expansions of operations, and infrastructure upgrades of grocery stores and small food retailers to improve the availability of and access to affordable, nutritious food, including fresh fruits and vegetables, and build capacity in areas of greatest need.\n(c) Projects eligible for other types of financial assistance such as grants or technical assistance are primarily projects throughout the state, including, but not limited to, feasibility studies, new construction, renovations, expansion of operations, and infrastructure upgrades of small food retailers.\n(a) An applicant for receipt of financing through an economic or community development financial institution, or an applicant for a grant or other financial or technical assistance, may be a for-profit or not-for-profit entity, including, but not limited to, a sole proprietorship, limited liability company, corporation, cooperative, nonprofit organization, or nonprofit community development organization. Each applicant must:\n(1) demonstrate community engagement in and support for the project;\n(2) demonstrate the capacity to successfully implement the project;\n(3) demonstrate a viable plan for long-term sustainability, including the ability to increase the availability of and access to affordable, nutritious, and culturally appropriate food, including fresh fruits and vegetables, for underserved communities in low-income and moderate-income areas; and\n(4) demonstrate the ability to repay the debt, to the extent that the financing requires repayment.\n(b) Each applicant must also agree to comply with the following conditions for a period of at least five years, except as otherwise specified in this section:\n(1) accept Supplemental Nutrition Assistance Program (SNAP) benefits;\n(2) allocate at least 30 percent of retail space for the sale of affordable, nutritious, and culturally appropriate foods, including fruits and vegetables, low-fat and nonfat dairy, fortified dairy substitute beverages such as soy-based or nut-based dairy substitute beverages, whole grain-rich staple foods, meats, poultry, fish, seafood, and other proteins, consistent with nutrition standards in national guidelines described in the current United States Department of Agriculture Dietary Guidelines for Americans;\n(3) comply with all data collection and reporting requirements established by the commissioner; and\n(4) promote the hiring, training, and retention of local or regional residents from low-income and moderate-income areas that reflect area demographics, including communities of color.\n(c) A selected project that is a small food retailer is not subject to the allocation agreement under paragraph (b), clause (2), and may use financing, grants, or other financial or technical assistance for refrigeration, displays, or onetime capital expenditures for the promotion and sale of perishable foods, including a combination of affordable, nutritious, and culturally appropriate fresh or frozen dairy, dairy substitute products, produce, meats, poultry, and fish, consistent with nutrition standards in national guidelines described in the current United States Department of Agriculture Dietary Guidelines for Americans.\nIn determining which qualified projects to finance, and in determining which qualified projects to provide with grants or other types of financial or technical assistance, the commissioner, in cooperation with any entities with which the commissioner contracts for those purposes and the Good Food Access Program Advisory Committee, shall also consider:\n(1) the level of need in the area to be served;\n(2) the degree to which the project requires an investment of public support, or technical assistance where applicable, to move forward, build capacity, create community impact, or be competitive;\n(3) the likelihood that the project will have positive economic and health impacts on the underserved community, including creation and retention of jobs for local or regional residents from low-income and moderate-income areas that reflect area demographics, including communities of color;\n(4) the degree to which the project will participate in state and local health department initiatives to educate consumers on nutrition, promote healthy eating and healthy weight, and support locally grown food products through programs such as Minnesota Grown; and\n(5) any other criteria that the commissioner, in cooperation with public and private partners, determines to be consistent with the purposes of this chapter.\nFinancing for project loans, including low-interest, zero-interest, and forgivable loans, grants, and other financial or technical assistance, may be used to support one or more of the following purposes:\n(1) site acquisition and preparation;\n(2) predevelopment costs, including but not limited to feasibility studies, market studies, and appraisals;\n(3) construction and build-out costs;\n(4) equipment and furnishings;\n(5) workforce or retailer training; and\n(6) working capital.\nThe commissioner, in cooperation with any economic or community development financial institution and any other entity with which it contracts, shall submit an annual report on the good food access program by January 15 of each year to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over agriculture policy and finance. The annual report shall include, but not be limited to, a summary of the following metrics:\n(1) the number and types of projects financed;\n(2) the amount of dollars leveraged or matched per project;\n(3) the geographic distribution of financed projects;\n(4) the number and types of technical assistance recipients;\n(5) any market or commodity expansion associated with increased access;\n(6) the demographics of the areas served;\n(7) the costs of the program;\n(8) the number of SNAP and WIC dollars spent;\n(9) any increase in retail square footage;\n(10) the number of loans or grants to minority-owned or female-owned businesses; and\n(11) measurable economic and health outcomes, including, but not limited to, increases in sales and consumption of locally sourced and other fresh fruits and vegetables, the number of construction and retail jobs retained or created, and any health initiatives associated with the program.",
	"repealed": false
}