{
	"id": "15.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.56",
	"title": "15.56 STATUS OF EMPLOYEES OF OTHER GOVERNMENTS.",
	"text": "When any unit of government of this state acts as a receiving agency, employees of the sending agency who are assigned under authority of sections 15.51 to 15.57 may be considered to be on detail to the receiving agency.\nAppointments of persons so assigned may be made without regard to the laws or rules governing the selection of employees of the receiving agency. Such person shall be in the unclassified service of the state.\nEmployees who are detailed to the receiving agency shall not by virtue of such detail be considered to be employees thereof, except as provided in subdivision 4. The salary and supervision of the duties of such employees during the period of detail may be governed by agreement between the sending agency and the receiving agency.\nAny employee of a sending agency assigned in this state who suffers disability or death as a result of personal injury arising out of and in the course of such assignment, or sustained in the performance of duties in connection therewith, shall be treated for the purpose of receiving agency's employee compensation program, as an employee, as defined in such act, who has sustained such injury in the performance of such duty, but shall not receive benefits under that act for any period for which the employee elects to receive similar benefits as an employee under the sending agency's employee compensation program.\nSending and receiving agencies may contract for the services of interchanged employees and by contract arrange for the method and amount of payment for employees and other terms of their employment, so far as not governed by sections 15.51 to 15.57. Any interchange of employees contemplated by a department, agency, or instrumentality of the state which is subject to the provisions of chapter 16B, shall be submitted for review to the commissioner of administration before arrangements are entered into for such interchange.\nConsultants who are not full-time employees may be paid by both the sending and receiving agencies, but not for the same work. Sections 15.51 to 15.57 shall not affect the method of paying or employing persons for full-time or part-time service in the military service of the state or the United States.",
	"repealed": false
}