{
	"id": "145B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/145B.03",
	"title": "145B.03 LIVING WILL.",
	"text": "A competent adult may make a living will of preferences or instructions regarding health care. These preferences or instructions may include, but are not limited to, consent to or refusal of any health care, treatment, service, procedure, or placement. A living will may include preferences or instructions regarding health care, the designation of a proxy to make health care decisions on behalf of the declarant, or both.\n(a) A living will is effective only if it is signed by the declarant and two witnesses or a notary public.\n(b) A living will must state:\n(1) the declarant's preferences regarding whether the declarant wishes to receive or not receive artificial administration of nutrition and hydration; or\n(2) that the declarant wishes the proxy, if any, to make decisions regarding the administering of artificially administered nutrition and hydration for the declarant if the declarant is unable to make health care decisions and the living will becomes operative. If the living will does not state the declarant's preferences regarding artificial administration of nutrition and hydration, the living will shall be enforceable as to all other preferences or instructions regarding health care, and a decision to administer, withhold, or withdraw nutrition and hydration artificially shall be made pursuant to section 145B.13. However, the mere existence of a living will or appointment of a proxy does not, by itself, create a presumption that the declarant wanted the withholding or withdrawing of artificially administered nutrition or hydration.\n(c) The living will may be communicated to and then transcribed by one of the witnesses. If the declarant is physically unable to sign the document, one of the witnesses shall sign the document at the declarant's direction.\n(d) Neither of the witnesses can be someone who is entitled to any part of the estate of the declarant under a will then existing or by operation of law. Neither of the witnesses nor the notary may be named as a proxy in the living will. Each witness shall substantially make the following declaration on the document:\n\"I certify that the declarant voluntarily signed this living will in my presence and that the declarant is personally known to me. I am not named as a proxy by the living will.\"\nExcept as otherwise provided in the living will, designation of a proxy is considered a nomination of a guardian for purposes of sections 524.5-101 to 524.5-502.",
	"repealed": false
}