{
	"id": "122A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.26",
	"title": "122A.26 COMMUNITY EDUCATION TEACHERS; LICENSURE REQUIREMENTS.",
	"text": "Notwithstanding the provisions of any law to the contrary and except as otherwise provided in this section, a person who teaches in a community education program established pursuant to sections 124D.18 and 124D.19 is exempt from all licensure requirements.\n(a) A person who teaches in a community education program that qualifies for aid pursuant to section 124D.52 shall continue to meet licensure requirements as a teacher. A person who teaches in an early childhood and family education program that is offered through a community education program and that qualifies for community education aid pursuant to section 142D.11 or early childhood and family education aid pursuant to section 124D.135 shall continue to meet licensure requirements as a teacher. A person who teaches in a community education course that is offered for credit for graduation to persons under 18 years of age shall continue to meet licensure requirements as a teacher.\n(b) A person who teaches a driver training course that is offered through a community education program to persons under 18 years of age shall be licensed by the Professional Educator Licensing and Standards Board or be subject to section 171.35. A license that is required for an instructor in a community education program pursuant to this paragraph shall not be construed to bring an individual within the definition of a teacher for purposes of section 122A.40, subdivision 1, or 122A.41, subdivision 1, paragraph (a).\nNotwithstanding subdivision 2, a person who possesses a bachelor's or master's degree in English as a second language, applied linguistics, or bilingual education, or who possesses a related degree as approved by the commissioner, shall be permitted to teach English as a second language in an adult basic education program that receives funding under section 124D.531.",
	"repealed": false
}