{
	"id": "356.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.91",
	"title": "356.91 VOLUNTARY MEMBERSHIP DUES DEDUCTION.",
	"text": "(a) Upon written authorization of a person receiving an annuity from a public pension fund administered by the Minnesota State Retirement System, the Public Employees Retirement Association, or the Teachers Retirement Association, the executive director of the public pension fund shall deduct from the retirement annuity an amount requested by the annuitant to be paid as membership dues or other payments to any labor organization that is an exclusive bargaining agent representing public employees or an organization representing retired public employees of which the annuitant is a member and shall, on a monthly basis, pay the amount to the organization so designated by the annuitant.\n(b) A pension fund and the plan fiduciaries which authorize or administer deductions of dues payments under paragraph (a) are not liable for failure to properly deduct or transmit the dues amounts, provided that the fund and the fiduciaries have acted in good faith.\n(c) Any labor organization that is an exclusive bargaining agent representing public employees or an organization representing retired public employees may conduct blind mailings to the annuitants of a retirement system specified in paragraph (a) by requesting that the retirement system mail voluntary membership information and dues deduction cards to annuitants. Such mailings shall not be for the purpose of supporting or opposing any candidate, political party, or ballot measure. The organization requesting the blind mailing shall pay all costs associated with these mailings, including but not limited to copying, labeling, mailing, postage, and record keeping. In lieu of administering a blind mailing in-house, a retirement system may transmit annuitant data necessary for conducting a blind mailing to a mail center pursuant to a secure data share agreement with the mail center which provides that neither the organization nor any other entity shall have direct access to the data transmitted by the retirement system. The retirement system shall have no obligation to approve or disapprove, or otherwise be responsible for, the content of the mailings. No organization shall conduct more than two blind mailings per calendar year.",
	"repealed": false
}