{
	"id": "473.757",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.757",
	"title": "473.757 COUNTY ACTIVITIES; BONDS; TAXES.",
	"text": "The county may authorize, by resolution, and make one or more grants to the authority for ballpark development and construction, public infrastructure, reserves for capital improvements, and other purposes related to the ballpark on the terms and conditions agreed to by the county and the authority.\nTo the extent funds are available from collections of the tax authorized by subdivision 10 after payment each year of debt service on the bonds authorized and issued under subdivision 9 and payments for the purposes described in subdivision 1, the county may also authorize, by resolution, and expend or make grants to the authority and to other governmental units and nonprofit organizations in an aggregate amount of up to $4,000,000 annually, increased by up to 1.5 percent annually to fund equally: (1) youth activities and youth and amateur sports within Hennepin County; and (2) the cost of extending the hours of operation of Hennepin County libraries and Minneapolis public libraries.\nThe money provided under this subdivision is intended to supplement and not supplant county expenditures for these purposes as of May 27, 2006.\nHennepin County must provide reports to the chairs of the committees and budget divisions in the senate and the house of representatives that have jurisdiction over education policy and funding, describing the uses of the money provided under this subdivision. The first report must be made by January 15, 2009, and subsequent reports must be made on January 15 of each subsequent odd-numbered year.\nThe amount that the county may grant or expend for ballpark costs shall not exceed $260,000,000. The amount of any grant for capital improvement reserves shall not exceed $1,000,000 annually, subject to the agreement under section 473.759, subdivision 3, and to annual increases according to an inflation index acceptable to the county. The amount of grants or expenditures for land, site improvements, and public infrastructure shall not exceed $90,000,000, excluding capital improvement reserves, bond reserves, capitalized interest, and financing costs. The authority to spend money for land, site improvements, and public infrastructure is limited to payment of amounts incurred or for construction contracts entered into during the period ending five years after the date of the issuance of the initial series of bonds under Laws 2006, chapter 257. Such grant agreements are valid and enforceable notwithstanding that they involve payments in future years and they do not constitute a debt of the county within the meaning of any constitutional or statutory limitation or for which a referendum is required.\nThe county may acquire by purchase, eminent domain, or gift, land, air rights, and other property interests within the development area for the ballpark site and public infrastructure and convey it to the authority with or without consideration, prepare a site for development as a ballpark, and acquire and construct any related public infrastructure. The purchase of property and development of public infrastructure financed with revenues under this section is limited to infrastructure within the development area or within 1,000 feet of the border of the development area. The public infrastructure may include the construction and operation of parking facilities within the development area notwithstanding any law imposing limits on county parking facilities in the city of Minneapolis. The county may acquire and construct property, facilities, and improvements within the stated geographical limits for the purpose of drainage and environmental remediation for property within the development area, walkways and a pedestrian bridge to link the ballpark to Third Avenue distributor ramps, street and road improvements and access easements for the purpose of providing access to the ballpark, streetscapes, connections to transit facilities and bicycle trails, and any utility modifications which are incidental to any utility modifications within the development area.\nTo the extent property parcels or interests acquired are more extensive than the public infrastructure requirements, the county may sell or otherwise dispose of the excess. The proceeds from sales of excess property must be deposited in the debt service reserve fund.\nThe county may review and approve ballpark designs, plans, and specifications to the extent provided in a grant agreement and in order to ensure that the public purposes of the grant are carried out. The county board may delegate responsibility for implementing the terms of an approved grant agreement to the county administrator or other designated officers. Public infrastructure designs must optimize area transit and bicycle opportunities, including connections to existing trails, as determined by the county board.\nThe county may enforce the provisions of any grant agreement by specific performance. Except to require compliance with the conditions of the grant or as may be mutually agreed to by the county and the authority, the county has no interest in or claim to any assets or revenues of the authority.\nThe county may initiate or continue an environmental impact statement as the responsible governmental unit under section 116D.04, pay for any costs in connection with the environmental impact statement or reimburse others for such costs, and conduct other studies and tests necessary to evaluate the suitability of the ballpark site. The county has all powers necessary or convenient for those purposes and may enter into any contract for those purposes.\nThe county may make expenditures or grants for other costs incidental and necessary to further the purposes of Laws 2006, chapter 257, and may by agreement, reimburse in whole or in part, any entity that has granted, loaned, or advanced funds to the county to further the purposes of Laws 2006, chapter 257. The county shall reimburse a local governmental entity within its jurisdiction or make a grant to such a governmental unit for site acquisition, preparation of the site for ballpark development, and public infrastructure. Amounts expended by a local governmental unit with the proceeds of a grant or under an agreement that provides for reimbursement by the county shall not be deemed an expenditure or other use of local governmental resources by the governmental unit within the meaning of any law or charter limitation. Exercise by the county of its powers under this section shall not affect the amounts that the county is otherwise eligible to spend, borrow, tax, or receive under any law.\nIt is the intent of the legislature that, except as expressly limited herein, the county has the authority to acquire and develop a site for the ballpark and public infrastructure, to enter into contracts with the authority and other governmental or nongovernmental entities, to appropriate funds, and to make employees, consultants, and other revenues available for those purposes.\nThe county may, by resolution, authorize, sell, and issue revenue bonds to provide funds to make a grant or grants to the authority and to finance all or a portion of the costs of site acquisition, site improvements, and other activities necessary to prepare a site for development of a ballpark, to construct, improve, and maintain the ballpark and to establish and fund any capital improvement reserves, and to acquire and construct any related parking facilities and other public infrastructure and for other costs incidental and necessary to further the purposes of Laws 2006, chapter 257. The county may also, by resolution, issue bonds to refund the bonds issued pursuant to this section. The bonds must be limited obligations, payable solely from or secured by taxes levied under subdivision 10, and any other revenues to become available under Laws 2006, chapter 257. The bonds may be issued in one or more series and sold without an election. The bonds shall be sold in the manner provided by section 475.60. The bonds shall be secured, bear the interest rate or rates or a variable rate, have the rank or priority, be executed in the manner, be payable in the manner, mature, and be subject to the defaults, redemptions, repurchases, tender options, or other terms, as the county may determine. The county may enter into and perform all contracts deemed necessary or desirable by it to issue and secure the bonds, including an indenture of trust with a trustee within or without the state. The debt represented by the bonds shall not be included in computing any debt limitation applicable to the county. Subject to this subdivision, the bonds must be issued and sold in the manner provided in chapter 475. The bonds shall recite that they are issued under Laws 2006, chapter 257, and the recital shall be conclusive as to the validity of the bonds and the imposition and pledge of the taxes levied for their payment. In anticipation of the issuance of the bonds authorized under this subdivision and the collection of taxes levied under subdivision 10, the county may provide funds for the purposes authorized by Laws 2006, chapter 257, through temporary interfund loans from other available funds of the county which shall be repaid with interest.\n(a) Notwithstanding section 477A.016, or other law, the governing body of the county may by ordinance, impose a sales and use tax at the rate of 0.15 percent for the purposes listed in this section. The taxes authorized under this section and the manner in which they are imposed are exempt from the rules of section 297A.99, subdivisions 2 and 3. The provisions of section 297A.99, except for subdivisions 2 and 3, apply to the imposition, administration, collection, and enforcement of this tax.\n(b) The tax imposed under this section is not included in determining if the total tax on lodging in the city of Minneapolis exceeds the maximum allowed tax under Laws 1986, chapter 396, section 5, as amended by Laws 2001, First Special Session chapter 5, article 12, section 87, or in determining a tax that may be imposed under any other limitations.\n(a) Revenues received from the tax imposed under subdivision 10 may be used:\n(1) to pay costs of collection;\n(2) to pay or reimburse or secure the payment of any principal of, premium, or interest on bonds issued in accordance with Laws 2006, chapter 257, section 12;\n(3) to pay costs and make expenditures and grants described in this section, including financing costs related to them;\n(4) to maintain reserves for the foregoing purposes deemed reasonable and appropriate by the county;\n(5) to pay for operating costs of the ballpark authority other than the cost of operating or maintaining the ballpark; and\n(6) to make expenditures and grants for youth activities and amateur sports and extension of library hours as described in subdivision 2;\nand for no other purpose.\n(b) Revenues from the tax designated for use under paragraph (a), clause (5), must be deposited in the operating fund of the ballpark authority.\n(c) After completion of the ballpark and public infrastructure, the tax revenues not required for current payments of the expenditures described in paragraph (a), clauses (1) to (6), shall be used to (i) redeem or defease the bonds and (ii) prepay or establish a fund for payment of future obligations under grants or other commitments for future expenditures which are permitted by this section. Upon the redemption or defeasance of the bonds and the establishment of reserves adequate to meet such future obligations, the taxes shall terminate and shall not be reimposed. For purposes of this subdivision, \"reserves adequate to meet such future obligations\" means a reserve that does not exceed the net present value of the county's obligation to make grants under paragraph (a), clauses (5) and (6), and to fund the reserve for capital improvements required under section 473.759, subdivision 3, for the 30-year period beginning on the date of the original issuance of the bonds, less those obligations that the county has already paid.",
	"repealed": false
}