{
	"id": "84.0273",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0273",
	"title": "84.0273 ESTABLISHING BOUNDARY LINES RELATING TO CERTAIN STATE LANDHOLDINGS.",
	"text": "(a) To resolve boundary line issues affecting the ownership interests of the state and adjacent landowners, the commissioner of natural resources may, in the name of the state upon terms the commissioner deems appropriate, convey, by a boundary line agreement, quitclaim deed, or management agreement in such form as the attorney general approves, such rights, titles, and interests of the state in state lands for such rights, titles, and interests in adjacent lands as are necessary to establish boundaries. The commissioner must publish a notice of the proposed conveyance and a brief statement of the reason for the conveyance once in the State Register at least 30 days before the conveyance. This paragraph is not intended to replace or supersede laws relating to land exchange or disposal of surplus state property.\n(b) To resolve trespass issues affecting the ownership interests of the state and adjacent landowners, the commissioner of natural resources, in the name of the state, may sell surplus lands not needed for natural resource purposes at private sale to adjoining property owners and leaseholders. The conveyance must be by quitclaim in a form approved by the attorney general for a consideration not less than the value determined according to section 94.10, subdivision 1.\n(c) Paragraph (b) applies to all state-owned lands managed by the commissioner of natural resources, except school trust land as defined in section 92.025. For acquired lands, the commissioner may sell the surplus lands as provided in paragraph (b) notwithstanding the offering to public entities, public sale, and related notice and publication requirements of sections 94.09 to 94.165. For consolidated conservation lands, the commissioner may sell the surplus lands as provided in paragraph (b) notwithstanding the classification and public sale provisions of chapters 84A and 282.",
	"repealed": false
}