{
	"id": "317A.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.621",
	"title": "317A.621 MERGER OF WHOLLY OWNED SUBSIDIARIES.",
	"text": "(a) For the purposes of this section, the terms in paragraphs (b) and (c) have the meanings given.\n(b) \"Parent\" means a corporation that owns, directly or indirectly through one or more wholly owned organizations, all of the rights to distributions and all of the management rights in a wholly owned subsidiary.\n(c) \"Wholly owned subsidiary\" means a limited liability company in which all of the rights to distributions and all of the management rights are owned directly or indirectly by a parent. Wholly owned subsidiary does not include a nonprofit limited liability company organized under or governed by section 322C.1101.\nA corporation that is a parent may merge a wholly owned subsidiary into itself or may merge two or more wholly owned subsidiaries into one of the wholly owned subsidiaries by adoption of a plan of merger that meets the requirements of subdivision 2a and is approved in the manner described in subdivision 3.\nThe plan of merger must contain:\n(1) the name of each wholly owned subsidiary that is a constituent organization in the merger, the name of the parent, and the name of the surviving organization;\n(2) the terms and conditions of the proposed merger; and\n(3) the manner and basis of converting the governance and financial interests of the wholly owned subsidiary into membership interests of the surviving organization, if applicable.\n(a) When a parent has members with voting rights, the board of directors of the parent shall adopt a resolution by the affirmative vote of a majority of all directors approving a proposed plan of merger under this section and directing that the plan be submitted to a vote at a meeting of the members with voting rights. Notice of the meeting must be given to each member with voting rights, accompanied by a copy or summary of the proposed plan. Unless the articles or bylaws require a greater vote, the plan of merger is adopted upon receiving the affirmative vote of a majority of the members with voting rights voting on the action.\n(b) When a parent does not have members with voting rights, and unless the articles or bylaws require a greater vote, a plan of merger under this section is adopted at a meeting of the board of directors of the parent upon receiving the affirmative votes of a majority of the directors. Notice of the meeting must be given, accompanied by a copy of the proposed plan of merger.\nArticles of merger must be prepared that contain:\n(1) the plan of merger;\n(2) a statement that the parent owns directly, or indirectly through related organizations, all of the governance and financial interests of each wholly owned subsidiary that is a constituent organization in the merger;\n(3) a statement that the plan of merger has been approved by the parent under this section; and\n(4) a statement that the notice to the attorney general required by section 317A.811 has been given and the waiting period has expired or has been waived by the attorney general or a statement that section 317A.811 is not applicable.\nThe articles of merger must be signed on behalf of the parent and filed with the secretary of state.\nThe secretary of state shall issue a certificate of merger to the parent or the parent's legal representative or, if a wholly owned subsidiary is the surviving organization in the merger, to the surviving organization or its legal representative.",
	"repealed": false
}