{
	"id": "336.9-208",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-208",
	"title": "336.9-208 ADDITIONAL DUTIES OF SECURED PARTY HAVING CONTROL OF COLLATERAL.",
	"text": "(a) Applicability of section. This section applies to cases in which there is no outstanding secured obligation and the secured party is not committed to make advances, incur obligations, or otherwise give value.\n(b) Duties of secured party after receiving demand from debtor. Within ten days after receiving a signed demand by the debtor:\n(1) a secured party having control of a deposit account under section 336.9-104(a)(2) shall send to the bank with which the deposit account is maintained a signed record that releases the bank from any further obligation to comply with instructions originated by the secured party;\n(2) a secured party having control of a deposit account under section 336.9-104(a)(3) shall:\n(A) pay the debtor the balance on deposit in the deposit account; or\n(B) transfer the balance on deposit into a deposit account in the debtor's name;\n(3) a secured party, other than a buyer, having control under section 336.9-105 of an authoritative electronic copy of a record evidencing chattel paper shall transfer control of the electronic copy to the debtor or a person designated by the debtor;\n(4) a secured party having control of investment property under section 336.8-106(d)(2) or 336.9-106(b) shall send to the securities intermediary or commodity intermediary with which the security entitlement or commodity contract is maintained a signed record that releases the securities intermediary or commodity intermediary from any further obligation to comply with entitlement orders or directions originated by the secured party;\n(5) a secured party having control of a letter of credit right under section 336.9-107 shall send to each person having an unfulfilled obligation to pay or deliver proceeds of the letter of credit to the secured party a signed release from any further obligation to pay or deliver proceeds of the letter of credit to the secured party;\n(6) a secured party having control under section 336.7-106 of an authoritative electronic copy of an electronic document of title shall transfer control of the electronic copy to the debtor or a person designated by the debtor;\n(7) a secured party having control under section 336.9-105A of electronic money shall transfer control of the electronic money to the debtor or a person designated by the debtor; and\n(8) a secured party having control under section 336.12-105 of a controllable electronic record, other than a buyer of a controllable account or controllable payment intangible evidenced by the controllable electronic record, shall transfer control of the controllable electronic record to the debtor or a person designated by the debtor.",
	"repealed": false
}