{
	"id": "145D.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/145D.32",
	"title": "145D.32 REQUIREMENTS FOR NONPROFIT HEALTH COVERAGE ENTITY CONVERSION TRANSACTIONS.",
	"text": "(a) Before entering into a conversion transaction, a nonprofit health coverage entity must notify the attorney general according to section 317A.811. In addition to the elements listed in section 317A.811, subdivision 1, the notice required by this subdivision must also include: (1) an itemization of the nonprofit health coverage entity's public benefit assets and an independent third-party valuation of the nonprofit health coverage entity's public benefit assets; and (2) other information contained in forms provided by the attorney general.\n(b) When the nonprofit health coverage entity provides the attorney general with the notice and other information required under paragraph (a), the nonprofit health coverage entity must also provide a copy of this notice and other information to the applicable commissioner.\nBefore entering into a conversion transaction, a nonprofit health coverage entity must ensure that:\n(1) the proposed conversion transaction complies with chapters 317A and 501B and other applicable laws;\n(2) the proposed conversion transaction does not involve or constitute a breach of charitable trust;\n(3) the nonprofit health coverage entity shall receive full and fair value for its public benefit assets;\n(4) the value of the public benefit assets to be transferred has not been manipulated in a manner that causes or caused the value of the assets to decrease;\n(5) the proceeds of the proposed conversion transaction shall be used in a manner consistent with the public benefit for which the assets are held by the nonprofit health coverage entity; and\n(6) the proposed conversion transaction shall not result in a breach of fiduciary duty.\nThe attorney general or the commissioner may hold public listening sessions or forums and may solicit public comments regarding the proposed conversion transaction.\n(a) Subject to paragraphs (b) and (c), a nonprofit health coverage entity must not enter into a conversion transaction until 60 days after the nonprofit health coverage entity has given written notice as required in subdivision 1.\n(b) The attorney general may waive all or part of the waiting period or may extend the waiting period for an additional 60 days by notifying the nonprofit health coverage entity of the extension in writing.\n(c) The time periods specified in this subdivision shall be suspended while an investigation into the conversion transaction is pending or while a request from the attorney general for additional information is outstanding.\nNothing in this section relieves a nonprofit health coverage entity from complying with requirements for funds that are restricted for a particular purpose. Funds restricted for a particular purpose must continue to be used in accordance with the purpose for which they were restricted under sections 317A.671 and 501B.31. A nonprofit health coverage entity may not convert, transfer, or sell assets if the transaction would result in the use of the assets conflicting with their restricted purpose.",
	"repealed": false
}