{
	"id": "60D.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/60D.24",
	"title": "60D.24 INJUNCTIONS, PROHIBITIONS AGAINST VOTING SECURITIES, SEQUESTRATION OF VOTING SECURITIES.",
	"text": "Whenever it appears to the commissioner that any insurer or any director, officer, employee, or agent of the insurer has committed or is about to commit a violation of this chapter or of any rule or order issued by the commissioner, the commissioner may apply to the district court for the county in which the principal office of the insurer is located or if the insurer has no such office in this state then to the District Court for Ramsey County for an order enjoining the insurer or the director, officer, employee, or agent of the insurer from violating or continuing to violate this chapter or any rule or order, and for other equitable relief as the nature of the case and the interest of the insurer's policyholders or the public requires.\nNo security that is the subject of any agreement or arrangement regarding acquisition, or that is acquired or to be acquired, in contravention of the provisions of this chapter or of any rule or order issued by the commissioner may be voted at any shareholder's meeting, or may be counted for quorum purposes, and any action of shareholders requiring the affirmative vote of a percentage of shares may be taken as though the securities were not issued and outstanding. No action taken at the meeting shall be invalidated by the voting of the securities, unless the action would materially affect control of the insurer or unless the courts of this state have so ordered. If an insurer or the commissioner has reason to believe that any security of the insurer has been or is about to be acquired in contravention of the provisions of this chapter or of any rule or order issued by the commissioner, the insurer or the commissioner may apply to the district court for the county in which the insurer has its principal place of business to enjoin any offer, request, invitation, agreement, or acquisition made in contravention of section 60D.16 or any rule or order issued by the commissioner to enjoin the voting of any security so acquired, to void any vote of the security already cast at any meeting of shareholders and for other equitable relief as the nature of the case and the interest of the insurer's policyholders or the public requires.\nIn any case where a person has acquired or is proposing to acquire any voting securities in violation of this chapter or any rule or order issued by the commissioner, the District Court for Ramsey County or the district court for the county in which the insurer has its principal place of business may, on such notice as the court considers appropriate, upon the application of the insurer or the commissioner seize or sequester any voting securities of the insurer owned directly or indirectly by the person, and issue any order with respect thereto as may be appropriate to effectuate the provisions of this chapter.\nNotwithstanding any other provisions of law, for the purposes of this chapter the sites of the ownership of the securities of domestic insurers shall be considered to be in this state.",
	"repealed": false
}