{
	"id": "142B.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.62",
	"title": "142B.62 CHILD CARE LICENSE HOLDER INSURANCE.",
	"text": "(a) A license holder must provide a written notice to all parents or guardians of all children to be accepted for care prior to admission stating whether the license holder has liability insurance. This notice may be incorporated into and provided on the admission form used by the license holder.\n(b) If the license holder has liability insurance:\n(1) the license holder shall inform parents in writing that a current certificate of coverage for insurance is available for inspection to all parents or guardians of children receiving services and to all parents seeking services from the family child care program;\n(2) the notice must provide the parent or guardian with the date of expiration or next renewal of the policy; and\n(3) upon the expiration of the policy or a change in coverage, the license holder must provide a new written notice informing all parents or guardians of children receiving services of the change and indicating whether the insurance policy has lapsed.\nIf a license holder has a continuous insurance policy that renews each year, the license holder may indicate the policy's renewal date in the initial written notice to parents and guardians. This initial written notice shall remain valid and no further notices are required until the insurance coverage changes or the policy lapses.\n(c) If the license holder does not have liability insurance, the license holder must provide an annual notice, on a form developed and made available by the commissioner, to the parents or guardians of children in care indicating that the license holder does not carry liability insurance.\n(d) The license holder must notify all parents and guardians in writing immediately of any change in insurance status.\n(e) The license holder must make available upon request the certificate of liability insurance to the parents of children in care, to the commissioner, and to county licensing agents.\n(f) The license holder must document, with the signature of the parent or guardian, that the parent or guardian received the notices required by this section.",
	"repealed": false
}