{
	"id": "576.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.46",
	"title": "576.46 SALES FREE AND CLEAR OF LIEN IN GENERAL RECEIVERSHIPS.",
	"text": "(a) The court may order that a general receiver's sale of receivership property is free and clear of all liens, except any lien for unpaid real estate taxes or assessments and liens arising under federal law, and may be free of the rights of redemption of the respondent if the rights of redemption are receivership property and the rights of redemption of the holders of any liens, regardless of whether the sale will generate proceeds sufficient to fully satisfy all liens on the property, unless either:\n(1) the property is (i) real property classified as agricultural land under section 273.13, subdivision 23, or the property is a homestead under section 510.01; and (ii) each of the owners of the property has not consented to the sale following the time of appointment; or\n(2) any owner of the property or holder of a lien on the property serves and files a timely objection, and the court determines that the amount likely to be realized from the sale by the objecting person is less than the objecting person would realize within a reasonable time in the absence of this sale.\n(b) The receiver shall have the burden of proof to establish that the amount likely to be realized by the objecting person from the sale is equal to or more than the objecting person would realize within a reasonable time in the absence of the sale.\n(c) Upon any sale free and clear of liens authorized by this section, all liens encumbering the property conveyed shall transfer and attach to the proceeds of the sale, net of reasonable expenses approved by the court incurred in the disposition of the property, in the same order, priority, and validity as the liens had with respect to the property immediately before the sale. The court may authorize the receiver to satisfy, in whole or in part, any ownership interest or lien out of the proceeds of the sale if the ownership interest or lien of any party in interest would not thereby be impaired.\nIf any receivership property includes an interest as a co-owner of property, the receiver shall have the rights and powers afforded by applicable state or federal law of the respondent, including but not limited to any rights of partition, but may not sell the property free and clear of the co-owner's interest in the property.\nA creditor with a claim secured by a valid and perfected lien against the property to be sold may bid on the property at a sale and may offset against the purchase price part or all of the amount secured by its lien, provided that the creditor tenders cash sufficient to satisfy in full the reasonable expenses, approved by the court, incurred in the disposition of the property and all liens payable out of the proceeds of sale having priority over the lien of that creditor.\nThe reversal or modification on appeal of an authorization to sell property under this section does not affect the validity of a sale to a person that purchased the property in good faith, whether or not the person knew of the pendency of the appeal, unless the authorization and sale is stayed pending the appeal.",
	"repealed": false
}