{
	"id": "181C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/181C.03",
	"title": "181C.03 MINIMUM COMPENSATION.",
	"text": "(a) Minimum compensation of a TNC driver under this paragraph must be adjusted annually as provided under paragraph (f), and must be paid in a per minute, per mile format, as follows:\n(1) $1.28 per mile and $0.31 per minute for any transportation of a rider by a driver;\n(2) if applicable, an additional $0.91 per mile for any transportation of a rider by a driver in a vehicle that is subject to the requirements in sections 299A.11 to 299A.17, regardless of whether a wheelchair securement device is used;\n(3) if a trip request is canceled by a rider or a TNC after the driver has already departed to pick up a rider, 80 percent of any cancellation fee paid by the rider; and\n(4) at minimum, compensation of $5.00 for any transportation of a rider by a driver.\n(b) A TNC must pay a driver the minimum compensation required under this section over a reasonable earnings period not to exceed 14 calendar days. The minimum compensation required under this section guarantees a driver a certain level of compensation in an earnings period that cannot be reduced. Nothing in this section prevents a driver from earning, or a TNC from paying, a higher level of compensation.\n(c) Any gratuities received by a driver from a rider or riders are the property of the driver and are not included as part of the minimum compensation required by this section. A TNC must pay the applicable driver all gratuities received by the driver in an earnings period no later than the driver's next scheduled payment.\n(d) For each earnings period, a TNC must compare a driver's earnings, excluding gratuities, against the required minimum compensation for that driver during the earnings period. If the driver's earnings, excluding gratuities, in the earnings period are less than the required minimum compensation for that earnings period, the TNC must include an additional sum accounting for the difference in the driver's earnings and the minimum compensation no later than during the next earnings period.\n(e) A TNC that uses software or collection technology to collect fees or fares must pay a driver the compensation earned by the driver, regardless of whether the fees or fares are actually collected.\n(f) Beginning January 1, 2027, and each January 1 thereafter, the minimum compensation required under paragraph (a) must be adjusted annually by the same process as the statewide minimum wage under section 177.24, subdivision 1.",
	"repealed": false
}