{
	"id": "583.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/583.27",
	"title": "583.27 GOOD FAITH REQUIRED, COURT SUPERVISED MEDIATION.",
	"text": "(a) The parties must engage in mediation in good faith. Prior to the initial mediation meeting, the director must notify all parties in writing of their obligation to participate in good faith, the consequences of failing to participate in good faith, and that not participating in good faith includes: (1) a failure on a regular or continuing basis to attend and participate in mediation sessions without cause; (2) failure to provide full information no later than the initial mediation meeting regarding the financial obligations of the parties and other creditors including the obligation of a creditor to provide information under section 583.26, subdivision 5, paragraph (d); (3) failure of the creditor to designate a representative to participate in the mediation with authority to make binding commitments within one business day to fully settle, compromise, or otherwise mediate the matter; (4) lack of a written statement of debt restructuring alternatives and a statement of reasons why alternatives are unacceptable to one of the parties; (5) failure of a creditor to release funds from the sale of farm products to the debtor for necessary living and farm operating expenses; or (6) other similar behavior which evidences lack of good faith by the party. A failure to agree to reduce, restructure, refinance, or forgive debt does not, in itself, evidence lack of good faith by the creditor.\n(b) The amount that the creditor is required to release for necessary living expenses under this section is limited to $3,600 per month less the debtor's off-farm income. In 2022 and every five years thereafter, the commissioner of agriculture, in consultation with the director, must report to the legislative committees with jurisdiction over agriculture policy what the monetary limit under this paragraph would be if adjusted using the United States All-Items Consumer Price Index.\n(c) If the debtor and creditor do not agree on the amount of necessary living expenses to be released, the debtor or creditor may petition conciliation court in the county of the debtor's residence to make a determination of the amount to be released. The conciliation court must make the determination within ten days after receiving the petition.\n(d) If the debtor and creditors do not agree on the amount of necessary operating expenses or necessary living and operating expenses to be released, the debtor or a creditor requested to release necessary living or operating expenses may petition the district court of the debtor's residence to make a determination of the amount to be released. The court shall hear and make a determination of the amount of living and operating expenses to be released within ten days after receiving the petition. The court shall also add or subtract up to ten days to the time when the creditor can begin to enforce a proceeding to collect the debt against agricultural property of the debtor and assess costs, including any attorney fees, among the parties to the court proceeding. The court shall equitably adjust the time to begin a creditor's proceeding and the assessment of costs based on the parties' good faith claim to the amount of living and operating expenses to be released.\nIf the mediator determines that either party is not participating in good faith as defined in subdivision 1, the mediator shall file an affidavit indicating the reasons for the finding with the director and with parties to the mediation.\nIf the mediator finds the creditor has not participated in mediation in good faith, the debtor may require court supervised mandatory mediation by filing the affidavit with the district court of the county of the debtor's residence with a request for court supervision of mediation and serving a copy of the request on the creditor. Upon request the court shall require both parties to mediate under the supervision of the court in good faith for a period of not more than 60 days. All creditor remedies must be suspended during this period. The court may issue orders necessary to effect good faith mediation. Following the mediation period, if the court finds the creditor has not participated in mediation in good faith, the court shall by order suspend the creditor's remedies for an additional period of 180 days. A creditor found by the mediator not to have participated in good faith shall pay attorneys' fees and costs of the debtor requesting court-supervision of mediation or additional suspension of creditor's remedies.\n(a) A debtor is not mediating in good faith if the debtor fraudulently conceals, removes, or transfers agricultural property in which the debtor knows there is a security interest. The concealing, removing, or transferring must be in violation of a security agreement without remitting the proceeds to the secured party and must have occurred during the mediation period.\n(b) A creditor may immediately proceed with creditor's remedies upon receipt of a mediator's affidavit of a debtor's lack of good faith notwithstanding any other requirements of sections 583.20 to 583.32.\n(a) After a debtor requests mediation under section 583.26, subdivision 2, a creditor who is participating in the mediation and who has a security agreement relating to agricultural property under the debtor's control may inspect the secured agricultural property during normal business hours on 24 hours' notice to the debtor. For purposes of this subdivision, \"normal business hours\" means 8:00 a.m. to 6:00 p.m. Monday through Saturday but excludes legal Minnesota and United States holidays.\n(b) Failure to permit this inspection by the creditor, or destruction or waste of the property securing the debt, is evidence of the debtor's lack of good faith under subdivision 1, clause (6).\n(a) Upon petition by a debtor or creditor, a court may review a mediator's affidavit of lack of good faith or a mediator's failure to file an affidavit of lack of good faith of a creditor under subdivision 3 or a debtor under subdivision 4. The review is limited to whether the mediator committed an abuse of discretion in filing or failing to file an affidavit of lack of good faith. The petition must be reviewed by the court within ten days after the petition is filed.\n(b) If the court finds that the mediator committed an abuse of discretion in filing, or failing to file, an affidavit of lack of good faith, the court may: (1) reinstate mediation and the stay of creditors' enforcement actions; (2) order court supervised mediation; or (3) allow creditors to proceed immediately with creditors' remedies.\n(c) A mediator may offer testimony but is not required to testify as part of the court's review.\nA debtor who fraudulently conceals, removes, or transfers agricultural property in which the debtor knows there is a security interest is ineligible for mediation under the Farmer-Lender Mediation Act if the concealing, removing, or transferring was in violation of a security agreement without remitting the proceeds to the secured party. The secured party must petition the district court in the county of the debtor's residence for an order permitting the secured party to proceed with the secured party's remedies notwithstanding sections 583.20 to 583.32. The petition must be brought within one year after the concealing, removing, or transferring occurred. The district court shall issue a summons within seven days commanding the person against whom the petition is made to appear before the court on a day and place stated in the summons. The appearance must be no less than seven and no more than 14 days from the issuance of the summons. The district court must deliver findings within ten days after the close of the hearing. A petition under this subdivision cannot be brought after the secured party has served a mediation notice on the debtor under section 583.26.\nIn case of a dispute between the debtor and creditors concerning the market value of real property involved in mediation, the true and acceptable market value must be determined by appraisal as provided in this subdivision. The appraisal to determine true market value must be performed by an accredited appraiser and made within 45 days of the date of the dispute. The accredited appraiser shall be selected as follows:\n(1) the mediator shall submit the names of three accredited appraisers to the principal creditor and debtor;\n(2) the principal creditor and the debtor may each, within a time determined by the mediator, strike the name of one of the appraisers submitted by the mediator;\n(3) the accredited appraiser whose name is not stricken by either the principal creditor or the debtor shall perform an appraisal which shall be the true market value accepted by all parties to the dispute.\nThe cost of the appraisal shall be divided equally between the principal creditor and debtor.",
	"repealed": false
}