{
	"id": "256R.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.50",
	"title": "256R.50 BED RELOCATIONS.",
	"text": "Nursing facility rates for bed relocations must be calculated by comparing the estimated medical assistance costs prior to and after the proposed bed relocation using the calculations in this section. All payment rates are based on a case mix index of 1.0, with other case mix adjusted rates determined accordingly. Nursing facility beds on layaway status that are being moved must be included in the calculation for both the originating and receiving facility and treated as though they were in active status with the occupancy characteristics of the active beds of the originating facility.\nMedical assistance costs of the beds in the originating nursing facilities must be calculated as follows:\n(1) multiply each originating facility's total payment rate for a case mix index of 1.0 by the facility's percentage of medical assistance days on its most recent available cost report;\n(2) take the products in clause (1) and multiply by each facility's average case mix index for medical assistance residents on its most recent available cost report;\n(3) take the products in clause (2) and multiply by the number of beds being relocated, times 365; and\n(4) calculate the sum of the amounts determined in clause (3).\nMedical assistance costs in the receiving facility, prior to the bed relocation, must be calculated as follows:\n(1) multiply the facility's total payment rate for a case mix index of 1.0 by the medical assistance days on the most recent cost report; and\n(2) multiply the product in clause (1) by the facility average case mix index of medical assistance residents on the most recent cost report.\nThe commissioner shall determine the medical assistance costs prior to the bed relocation which must be the sum of the amounts determined in subdivisions 2 and 3.\nThe commissioner shall estimate the medical assistance costs after the bed relocation as follows:\n(1) estimate the medical assistance days in the receiving facility after the bed relocation. The commissioner may use the current medical assistance portion, or if data does not exist, may use the statewide average, or may use the provider's estimate of the medical assistance utilization of the relocated beds;\n(2) estimate the receiving facility's average case mix index of medical assistance residents after the bed relocation. The commissioner may use current facility average case mix index or, if data does not exist, may use the statewide average case mix index, or may use the provider's estimate of the facility average case mix index; and\n(3) multiply the amount determined in clause (1) by the amount determined in clause (2) by the total payment rate for a case mix index of 1.0 that is the highest rate of the facilities from which the relocated beds either originate or to which they are being relocated so long as that rate is associated with ten percent or more of the total number of beds to be in the receiving facility after the bed relocation.\n(a) If the amount determined in subdivision 5 is less than or equal to the amount determined in subdivision 4, the commissioner shall allow a total payment rate equal to the amount used in subdivision 5, clause (3).\n(b) If the amount determined in subdivision 5 is greater than the amount determined in subdivision 4, the commissioner shall allow a rate with a case mix index of 1.0 that when used in subdivision 5, clause (3), results in the amount determined in subdivision 5 being equal to the amount determined in subdivision 4.\n(c) If the commissioner relies upon provider estimates in subdivision 5, clause (1) or (2), then annually, for three years after the rates determined in this section take effect, the commissioner shall determine the accuracy of the alternative factors of medical assistance case load and the facility average case mix index used in this section and shall reduce the total payment rate if the factors used result in medical assistance costs exceeding the amount in subdivision 4. If the actual medical assistance costs exceed the estimates by more than five percent, the commissioner shall also recover the difference between the estimated costs in subdivision 5 and the actual costs according to section 256B.0641. The commissioner may require submission of data from the receiving facility needed to implement this paragraph.\n(d) When beds approved for relocation are put into active service at the destination facility, rates determined in this section must be adjusted by any adjustment amounts that were implemented after the date of the letter of approval.\n(e) Rate adjustments determined under this subdivision expire after three full rate years following the effective date of the rate adjustment. This subdivision expires when the final rate adjustment determined under this subdivision expires.",
	"repealed": false
}