{
	"id": "356.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.46",
	"title": "356.46 APPLICATION FOR RETIREMENT ANNUITY; PROCEDURE FOR ELECTING ANNUITY FORM; MANDATORY JOINT AND SURVIVOR OPTIONAL ANNUITY FORM.",
	"text": "As used in this section, each of the following terms shall have the meaning given.\n(a) \"Annuity form\" means the payment procedure and duration of a retirement annuity or disability benefit available to a member of a public pension plan, based on the period over which a retirement annuity or disability benefit is payable, determined by the number of persons to whom the retirement annuity or disability benefit is payable, and the amount of the retirement annuity or disability benefit which is payable to each person.\n(b) \"Joint and survivor optional annuity\" means an optional annuity form which provides a retirement annuity or disability benefit to a retired member or disabilitant and the spouse of the member or disabilitant on a joint basis during the lifetime of the retired member or disabilitant and all or a portion of the original retirement annuity or disability benefit amount to the surviving spouse in the event of the death of the retired member or disabilitant.\n(c) \"Optional annuity form\" means an annuity form which is elected by a member and is not provided automatically as the standard annuity form of the public pension plan.\n(d) \"Public pension plan\" means a public pension plan as defined under section 356.63, paragraph (b).\n(e) \"Retirement annuity\" means a series of monthly payments to which a former or retired member of a public pension plan is entitled due to attaining a specified age and acquiring credit for a specified period of service, which includes a retirement annuity, retirement allowance, or service pension.\n(f) \"Disability benefit\" means a series of monthly payments to which a former or disabled member of a public pension plan is entitled due to a physical or mental inability to engage in specified employment.\n(a) Every public pension plan which provides for an annuity form other than a single life annuity as an option which can be elected by an active, disabled, or retiring member shall provide as a part of, or accompanying the annuity application form, a written statement summarizing the annuity forms which are available, a general indication of the consequences of selecting one annuity form over another, a calculation of the actuarial reduction in the amount of the retirement annuity which would be required for each optional annuity form, and the procedure to be followed to obtain more information from the public pension plan administration concerning all annuity forms provided by the plan. If the public pension plan offers joint and survivor optional annuity forms, the annuity application and accompanying information must include a statement informing the member and the member's spouse that, notwithstanding any law to the contrary, unless the spouse waives any rights to an optional annuity by a notarized statement on the annuity application or other form provided by the pension plan administration, the public pension plan administration shall assume that the member selected the 50 percent joint and survivor optional annuity form.\n(b) In lieu of the notarized statement requirement referred to in paragraph (a), the pension plan administration may accept a statement which has been verified, including electronic verification, by administrators of the pension plan.\n(a) Every public pension plan administration that provides for a joint and survivor optional retirement or disability annuity potentially applicable to the surviving spouse of a member shall send a copy of the written statement required by subdivision 2 to the spouse of the member before the member's selection of the form of retirement or disability benefit.\n(b) Following the selection of a retirement or disability annuity by the member, a copy of the completed annuity application and annuity beneficiary form, if applicable, must be sent by the executive director of the public pension plan to the spouse of the retiring or disabled member. A signed acknowledgment must be required from the spouse confirming receipt of a copy of the completed annuity application and annuity beneficiary form, unless the spouse's signature acknowledging the annuity form selected is on the annuity application or other form as designated by the plan. If the public pension plan administration has not received from the spouse within 30 days a signed acknowledgment, because the annuity application or other form as designated by the public pension plan administration did not include the spouse's signature, the executive director of the public pension plan must notify the member and the member's spouse that the 50 percent joint and survivor annuity form, or a higher joint and survivor form if selected, shall be paid if the spouse does not acknowledge the annuity form selected by the member by responding to the second notice sent to the spouse within 30 days. The second notice must be sent by certified mail with restricted delivery.\n(c) If a public pension plan administration receives notice that the provisions of this section have not been complied with, or if a member selects a benefit form without the valid consent of the member's spouse, the executive director of the public pension plan shall suspend the payment of monthly benefits and shall take all actions necessary to comply with this subdivision.\n(d) For the Teachers Retirement Association, the statement to the spouse that is required under paragraph (a) must be sent before or upon the member's election of an annuity.\nThis section does not apply to:\n(1) any firefighters relief association to which sections 424A.091 to 424A.096 apply; and\n(2) any plan under which the applicable surviving spouse would receive automatic surviving spouse coverage if a joint and survivor annuity were not elected.\nThis section should not be interpreted as prohibiting payment of a survivor annuity to the spouse of a deceased disabilitant, in lieu of any other annuity, if laws specific to the plan provide for a higher surviving spouse annuity.\nThe requirement to pay a 50 percent joint and survivor annuity is void if there is a court order to the contrary.\nThe pension fund and plan, its employees, and any agent working on behalf of the plan administration are not liable for harm caused by any act of fraud committed by the retiring member or current or previous spouse, or any information withheld from, or incorrect information supplied to the plan administration.",
	"repealed": false
}