{
	"id": "273.1104",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1104",
	"title": "273.1104 IRON ORE, VALUE.",
	"text": "The term value as applied to iron ore in sections 273.165, subdivision 2, and 273.13, subdivision 31, shall be deemed to be the present value of future income or the minimum value as established by the commissioner notwithstanding the provisions of section 273.11. The present value of future income shall be determined by the commissioner of revenue in accordance with professionally recognized mineral valuation practice and procedure. Nothing contained herein shall be construed as requiring any change in the method of determining present value of iron ore utilized by the commissioner prior to the enactment hereof or as limiting any remedy presently available to the taxpayer in connection with the commissioner's determination of present value, or precluding the commissioner from making subsequent changes in the present worth formula.\nOn or before May 1 in each year, the commissioner shall send to each person subject to the tax on unmined iron ores and to each taxing district affected, a notice of the market value of the unmined ores as determined by the commissioner. Said notice shall be sent by mail directed to such person at the address given in the report filed and the assessor of such taxing district, but the validity of the tax shall not be affected by the failure of the commissioner of revenue to mail such notice or the failure of the person subject to the tax to receive it.\nOn the first secular day following May 20, the commissioner of revenue shall hold a hearing which may be adjourned from day to day. All relevant and material evidence having probative value with respect to the issues shall be submitted at the hearing and such hearing shall not be a \"contested case\" within the meaning of section 14.02, subdivision 3. Every person subject to such tax may at such hearing present evidence and argument on any matter bearing upon the validity or correctness of the tax determined to be due, and the commissioner of revenue shall review the determination of such tax.",
	"repealed": false
}