{
	"id": "475A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/475A.06",
	"title": "475A.06 MINNESOTA STATE MUNICIPAL AID BONDS.",
	"text": "For the purpose of providing money appropriated for loans to municipalities from the municipal bond guaranty fund under the provisions of section 475A.05, when authorized by law, the commissioner of management and budget shall issue and sell bonds of the state of Minnesota for the prompt and full payment of which bonds, with interest thereon, the full faith and credit and taxing powers of the state are irrevocably pledged; provided that pending the sale and delivery of such bonds, the commissioner of management and budget may advance temporarily to the municipal bond guaranty fund any money available in the general fund of the state to be reimbursed from the proceeds of the bonds when issued and sold. The proceeds of each issue of such bonds shall be credited to the municipal bond guaranty fund, except that a sum equal to the interest to accrue thereon to July 1 in the second year after such issue shall be credited to the state municipal aid bond account in the state bond fund. No issue of such bonds shall exceed in principal amount a sum equal to (a) $2,000,000 plus (b) the principal amount of loans outstanding and unpaid at the time of such issue, less (c) the balance then on hand in the state municipal bond guaranty fund, less (d) the principal amount of such bonds then outstanding.\nThe bonds shall be issued and sold upon sealed bids and upon such notice, at such price, at such times, in such form and denominations, bearing interest at such rate or rates, maturing in such amounts and on such dates, either without option of prepayment or subject to prepayment upon such notice and at such times and prices, payable at such bank or banks within or outside the state, with such provisions for registration, conversion, and exchange and for the issuance of notes in anticipation of the sale or delivery of definitive bonds, and in accordance with such further rules, as the commissioner of management and budget shall determine, subject to the approval of the attorney general, but not subject to chapter 14, including section 14.386. The bonds shall be executed by the commissioner of management and budget under official seal. The signature of the commissioner on the bonds and any appurtenant interest coupons and the seal may be printed, lithographed, engraved, or stamped thereon, except that each bond shall be authenticated by the manual signature on its face of the commissioner or of an officer of a bank designated by them as authenticating agent. The commissioner of management and budget shall ascertain and certify to the purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota, subject to the approval of the attorney general.\nAll expenses incidental to the sale, printing, execution, and delivery of bonds pursuant to this section, including but not limited to actual and necessary travel and subsistence expenses of state officers and employees for such purposes, shall be paid from the municipal bond guaranty fund, and the amounts necessary therefor are appropriated from that fund; provided that if any amount is specifically appropriated for this purpose in an act authorizing the issuance of bonds pursuant to this section, such expenses shall be limited to the amount so appropriated.\nThe commissioner of management and budget shall maintain in the state bond fund a separate bookkeeping account which shall be designated as the state municipal aid bond account, to record receipts and disbursements of money transferred to the fund to pay Minnesota state municipal aid bonds and income from the investment of such money, which income shall be credited to the account in each fiscal year in an amount equal to the approximate average return that year on all funds invested by the commissioner of management and budget, as determined by the commissioner of management and budget, times the average balance in the account that year.\nIn addition to the money required to be transferred to the state municipal aid bond account under section 475A.05, subdivision 2 and section 475A.06, subdivision 1, and in order to reduce the amount of taxes otherwise required by the constitution to be levied for the state bond fund, there shall also be transferred from the general fund to the state municipal aid bond account, on November 1 in each year, a sum of money sufficient in amount, when added to the balance then on hand therein, to pay all Minnesota state municipal aid bonds and interest thereon due and to become due to and including July 1 in the second ensuing year. All money to be credited and all income from the investment thereof is annually appropriated for the payment of such bonds and interest thereon, and shall be available in the state municipal aid bond account prior to the levy of the tax in any year required by the constitution, article XI, section 7. The legislature may also appropriate to the state municipal aid bond account any other money in the state treasury not otherwise appropriated, for the security of Minnesota state municipal aid bonds in the event that sufficient money should not be available in the account from the sources herein appropriated, prior to the levy of such tax in any year. The commissioner of management and budget is directed to make the appropriate entries in the accounts of the respective funds.\nOn or before December 1 in each year the state auditor shall levy on all taxable property within the state whatever tax may be necessary to produce an amount sufficient, with all money then and theretofore credited to the Minnesota state municipal aid bond account, to pay the entire amount of principal and interest then and theretofore due and principal and interest to become due on or before July 1 in the second year thereafter on Minnesota state municipal aid bonds. This tax shall be subject to no limitation of rate or amount until all such bonds and interest thereon are fully paid. The proceeds of this tax are appropriated and shall be credited to the state bond fund, and the principal of and interest on the bonds are payable from such proceeds, and the whole thereof, or so much as may be necessary, is appropriated for such payments. If at any time there is insufficient money from the proceeds of such taxes to pay the principal and interest when due on Minnesota state municipal aid bonds, such principal and interest shall be paid out of the general fund in the state treasury, and the amount necessary therefor is hereby appropriated.\nThe commissioner of management and budget is authorized to sell and issue Minnesota state municipal aid bonds in an aggregate principal amount not to exceed $1,192,295, the proceeds of which, except as provided in subdivision 1, are appropriated to the state municipal bond guaranty fund for the purpose of providing funds to be loaned to municipalities for the acquisition and betterment of public lands and buildings and other public improvements of a capital nature, when needed to pay the principal of or interest on bonds issued for this purpose or bonds issued to refund such guaranteed bonds, in accordance with the provisions of sections 475A.01 to 475A.06. The bonds shall be sold, issued, and secured as provided in subdivisions 1 to 6 and in article XI, section 7 of the constitution.",
	"repealed": false
}