{
	"id": "252A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/252A.03",
	"title": "252A.03 NOMINATION OF COMMISSIONER AS GUARDIAN.",
	"text": "The commissioner may be nominated in a sworn written request by any one of the following to act as guardian for any person with a developmental disability:\n(1) an interested person;\n(2) the guardian of the person with a developmental disability to act as successor;\n(3) the person with a developmental disability.\nThe commissioner shall accept or reject the nomination in writing within 20 working days of the receipt of a comprehensive evaluation provided for in section 252A.04. The commissioner's acceptance shall be binding upon the commissioner and successors. Acceptance of a nomination shall confer no authority on the commissioner unless affirmed at a judicial hearing. Rejection of a nomination by the commissioner shall not bar the filing of a petition pursuant to section 252A.06.\nThe commissioner shall accept the nomination if:\n(1) the person's assessment confirms that they are a person with a developmental disability under section 252A.02, subdivision 2;\n(2) the person is in need of the supervision and protection of a guardian;\n(3) no qualified person is willing to assume guardianship under sections 524.5-101 to 524.5-502; and\n(4) the person subject to public guardianship was included in the process prior to the submission of the nomination.\n(a) Public guardianship may be imposed only when:\n(1) the person subject to guardianship is impaired to the extent of lacking sufficient understanding or capacity to make personal decisions;\n(2) the person subject to guardianship is unable to meet personal needs for medical care, nutrition, clothing, shelter, or safety, even with appropriate technological and supported decision-making assistance; and\n(3) no acceptable, less restrictive form of guardianship is available.\n(b) The commissioner shall seek parents, near relatives, and other interested persons to assume guardianship for persons with developmental disabilities who are currently under public guardianship. If a person seeks to become a guardian, costs to the person may be reimbursed under section 524.5-502. The commissioner must provide technical assistance to parents, near relatives, and interested persons seeking to become guardians.",
	"repealed": false
}