{
	"id": "270C.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.18",
	"title": "270C.18 SETOFF OF POLITICAL SUBDIVISION DEBTS.",
	"text": "(a) As used in this section, \"political subdivision\" means counties and home rule charter or statutory cities, and \"debts\" means a legal obligation to pay a fixed amount of money, which equals or exceeds $100 and which is due and payable to the claimant political subdivision.\n(b) If one political subdivision owes a debt to another political subdivision, and the debt has not been paid within six months of the date when payment was due, the creditor political subdivision may notify the commissioner of the debt, and shall provide the commissioner with information sufficient to verify the claim. If the commissioner has reason to believe that the claim is valid, and the debt has not been paid, the commissioner shall initiate setoff procedures under this section.\n(c) Within ten days of receipt of the notification from the creditor political subdivision, the commissioner shall send a written notice to the debtor political subdivision, advising it of the nature and amount of the claim. This written notice shall advise the debtor of the creditor political subdivision's intention to request setoff of the refund against the debt. The notice will also advise the debtor that the debt can be set off against a state aid payment, and will advise the debtor of the right to contest the validity of the claim at a hearing. The debtor must assert this right by written request to the commissioner, which request the commissioner must receive within 45 days of the mailing date of the notice.\n(d) If the commissioner receives written notice of a debtor political subdivision's intention to contest at hearing the claim upon which the intended setoff is based, the commissioner shall initiate a hearing according to contested case procedures established in the state Administrative Procedure Act not later than 30 days after receipt of the debtor's request for a hearing. The costs of the hearing shall be paid equally by the political subdivisions that are parties to the hearing. The Office of Administrative Hearings shall separately bill each political subdivision for one-half of the costs.\n(e) If the debtor political subdivision does not object to the claim, or does not prevail in an objection to the claim or at a hearing on the claim, the commissioner shall deduct the amount of the debt from the next payment scheduled to be made to the debtor under section 273.1398 or chapter 477A. The commissioner shall remit the amount deducted to the claimant political subdivision.",
	"repealed": false
}