{
	"id": "332.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.58",
	"title": "332.58 CONTRACT.",
	"text": "Each contract between the buyer and a credit services organization for the purchase of the services of the credit services organization must be in writing, dated, and signed by the buyer and must include the following:\n(1) a conspicuous statement in boldface type, in immediate proximity to the space reserved for the signature of the buyer, as follows: \"If you, the buyer, have been denied credit within the last 30 days, you may obtain a free copy of the consumer credit report from the consumer reporting agency. You also have the right to dispute inaccurate information in a report. You may cancel this contract at any time prior to midnight of the fifth day after the date of the transaction. See the attached notice of cancellation form for an explanation of this right\";\n(2) the terms and conditions of payment, including the total of all payments to be made by the buyer, whether to the credit services organization or to some other person;\n(3) a full and detailed description of the services to be performed by the credit services organization for the buyer, including all guarantees and all promises of full or partial refunds, and the estimated date by which the services are to be performed or the estimated length of time for performing the services;\n(4) the credit services organization's principal business address and the name and address of its agent in this state authorized to receive service of process; and\n(5) with respect to the previous calendar year or the time period the credit services organization has been in business, whichever is shorter, the percentage of the credit services organization's customers for whom the credit services organization has fully and completely performed the services the credit services organization agreed to perform for the buyer.\nThe contract must be accompanied by a completed form in duplicate, captioned \"Notice of Cancellation\" that must be attached to the contract, is easily detachable, and contains in boldface type the following statement written in the same language as used in the contract:\n\"Notice of Cancellation\nYou may cancel this contract without any penalty or obligation within five days from the date the contract is signed.\nIf you cancel this contract, any payment made by you under this contract will be returned within ten days following receipt by the seller of your cancellation notice.\nTo cancel this contract, mail or deliver a signed dated copy of this cancellation notice, or any other written notice to ......(name of seller)...... at ......(address of seller)......, ......(place of business)...... not later than midnight ......(date)......\nI hereby cancel this transaction,\n......(date)......\n...(purchaser's signature)...\"\nThe credit services organization shall give to the buyer a copy of the completed contract and all other documents the credit services organization requires the buyer to sign at the time that they are signed.",
	"repealed": false
}