{
	"id": "299A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.50",
	"title": "299A.50 RESPONSE PLAN.",
	"text": "After consultation with the commissioners of natural resources, agriculture, transportation, and the Pollution Control Agency, the state fire marshal, the Emergency Response Commission, appropriate technical emergency response representatives, and representatives of affected parties, the commissioner shall adopt rules to implement a statewide hazardous materials incident response plan. The plan must include:\n(1) the locations of hazardous materials emergency response teams, based on the location of hazardous materials, response time, proximity to large population centers, and other factors;\n(2) the number and qualifications of members on each team;\n(3) the responsibilities of hazardous materials emergency response teams;\n(4) equipment needed for hazardous materials emergency response teams;\n(5) procedures for selecting and contracting with local governments or nonpublic persons to establish hazardous materials emergency response teams;\n(6) procedures for dispatching teams at the request of local governments;\n(7) a fee schedule for reimbursing local governments or nonpublic persons responding to an incident; and\n(8) coordination with other state departments and agencies, local units of government, other states, Indian tribes, the federal government, and other nonpublic persons.\nThe commissioner may cooperate with and enter into contracts with other state departments and agencies, local units of government, other states, Indian tribes, the federal government, or nonpublic persons to implement the emergency incident response plan.\nWhen a hazardous materials emergency response team has completed its response to an incident, the commissioner shall notify the commissioner of the Pollution Control Agency, which is responsible for assessing environmental damage caused by the incident and providing oversight of monitoring and remediation of that damage from the time the response team has completed its activities.",
	"repealed": false
}