{
	"id": "245A.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.095",
	"title": "245A.095 RULES FOR PROGRAMS SERVING PERSONS WITH MENTAL ILLNESSES.",
	"text": "Residential programs with five or more persons with a mental illness must be licensed under this chapter. To assure that this requirement is met, the commissioner of health, in cooperation with the commissioner of human services, shall monitor licensed boarding care homes, board and lodging houses, and supervised living facilities.\nBy January 1, 1989, the commissioner of health shall recommend to the legislature an appropriate method for enforcing this requirement.\nIn developing rules for serving persons with mental illness, the commissioner of human services shall assure that persons with mental illness are provided with needed treatment or support in the least restrictive, most appropriate environment, that supportive residential care in small homelike settings is available for persons needing that care, and that a mechanism is developed to ensure that no person is placed in a care or treatment setting inappropriate for meeting the person's needs. To the maximum extent possible, the rule shall assure that length of stay is governed solely by client need and shall allow for a variety of innovative and flexible approaches in meeting residential and support needs of persons with mental illness.\nThe commissioner shall:\n(1) provide in rule for additional types of programs and services, including but not limited to supportive small group residential care, semi-independent and apartment living services, and crisis and respite services, to address the residential treatment and support needs of persons with mental illness;\n(2) review category I and II programs established in Minnesota Rules, parts 9520.0500 to 9520.0670 to ensure that the categories of programs provide a continuum of residential service programs for persons with mental illness, including but not limited to programs meeting needs for intensive treatment, crisis and respite care, and rehabilitation and training;\n(3) provide in rule for a definition of the term \"treatment\" as used in relation to persons with mental illness;\n(4) adjust funding mechanisms by rule as needed to reflect the requirements established by rule for services being provided;\n(5) review and recommend staff educational requirements and staff training as needed; and\n(6) review and make changes in rules relating to residential care and service programs for persons with mental illness as the commissioner may determine necessary.\n[Repealed, 1989 c 282 art 4 s 64]",
	"repealed": false
}