{
	"id": "115.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.55",
	"title": "115.55 SUBSURFACE SEWAGE TREATMENT SYSTEMS.",
	"text": "(a) The definitions in this subdivision apply to sections 115.55 to 115.56.\n(b) \"Advisory committee\" means the Advisory Committee on Subsurface Sewage Treatment Systems established under the subsurface sewage treatment system rules. The advisory committee must be appointed to ensure geographic representation of the state and include elected public officials.\n(c) \"Applicable requirements\" means:\n(1) local ordinances that comply with the subsurface sewage treatment system rules, as required in subdivision 2; or\n(2) in areas without compliant ordinances described in clause (1), the subsurface sewage treatment system rules.\n(d) \"Building sewer connected to a subsurface sewage treatment system\" means the pipe that connects a structure to a subsurface sewage treatment system. Building sewers connected to subsurface sewage treatment systems are codefined as both plumbing and subsurface sewage treatment system components.\n(e) \"City\" means a statutory or home rule charter city.\n(f) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(g) \"Dwelling\" means a building or place used or intended to be used by human occupants as a single-family or two-family unit.\n(h) \"Subsurface sewage treatment system\" or \"system\" means a sewage treatment system, or part thereof, that uses subsurface soil treatment and disposal, or a holding tank, serving a dwelling, other establishment, or a group thereof, and that does not require a state permit. Subsurface sewage treatment system includes a building sewer connected to a subsurface sewage treatment system.\n(i) \"Subsurface sewage treatment system professional\" means an inspector, installer, designer, service provider, or maintainer.\n(j) \"Subsurface sewage treatment system rules\" means rules adopted by the agency that establish minimum standards and criteria for the design, location, installation, use, maintenance, and closure of subsurface sewage treatment systems.\n(k) \"Inspector\" means a person who inspects subsurface sewage treatment systems for compliance with the applicable requirements.\n(l) \"Installer\" means a person who constructs or repairs subsurface sewage treatment systems.\n(m) \"Local unit of government\" means a township, city, or county.\n(n) \"Performance-based system\" means a system that is designed specifically for environmental conditions on a site and is designed to adequately protect the public health and the environment and provide consistent, reliable, long-term performance. At a minimum, a performance-based system must ensure that applicable water quality standards are met in both groundwater and surface water that ultimately receive the treated sewage.\n(o) \"Maintainer\" means a person who removes solids and liquids from and maintains and repairs components of subsurface sewage treatment systems including, but not limited to, sewage, aerobic, and holding tanks.\n(p) \"Seasonal dwelling\" means a dwelling that is occupied or used for less than 180 days per year and less than 120 consecutive days.\n(q) \"Septic system tank\" means any covered receptacle designed, constructed, and installed as part of a subsurface sewage treatment system.\n(r) \"Designer\" means a person who:\n(1) investigates soils and site characteristics to determine suitability, limitations, and sizing requirements; and\n(2) designs subsurface sewage treatment systems.\n(s) \"Straight-pipe system\" means a sewage disposal system that transports raw or partially treated sewage directly to a lake, a stream, a drainage system, or ground surface.\n(a) All counties must adopt ordinances that comply with revisions to the subsurface sewage treatment system rules within two years of the final adoption by the agency unless all towns and cities in the county have adopted the ordinances. County ordinances must apply to all areas of the county other than cities or towns that have adopted ordinances that comply with this section and are as strict as the applicable county ordinances.\n(b) A copy of each ordinance adopted under this subdivision must be submitted to the commissioner upon adoption.\n(c) A local unit of government must make available to the public upon request a written list of any differences between its ordinances and rules adopted under this section.\n(a) The agency shall adopt rules containing minimum standards and criteria for the design, location, installation, use, maintenance, and closure of subsurface sewage treatment systems. The rules must include:\n(1) how the agency will ensure compliance under subdivision 2;\n(2) how local units of government shall enforce ordinances under subdivision 2, including requirements for permits and inspection programs;\n(3) how the advisory committee will participate in review and implementation of the rules;\n(4) provisions for nonstandard systems and performance-based systems;\n(5) provisions for handling and disposal of effluent;\n(6) provisions for system abandonment; and\n(7) procedures for variances, including the consideration of variances based on cost and variances that take into account proximity of a system to other systems.\n(b) The agency shall consult with the advisory committee before adopting rules under this subdivision.\n(c) The rules required in paragraph (a) must also address the following:\n(1) a definition of redoximorphic features and other criteria that can be used by system designers and inspectors;\n(2) direction on the interpretation of observed soil features that may be redoximorphic and their relation to zones of periodic saturation; and\n(3) procedures on how to resolve professional disagreements on periodically saturated soils.\n(a) A person who designs, installs, alters, repairs, maintains, pumps, services, inspects, or abandons all or part of a subsurface sewage treatment system shall comply with the applicable requirements.\n(b) Local units of government may enforce, under section 115.071, subdivisions 3 and 4, ordinances that are applicable requirements.\n(a) An inspection shall be required for all new construction or replacement of a system to determine compliance with applicable requirements. The manner and timing of inspection may be determined by the applicable local ordinance.\n(b) A local unit of government may not issue a building permit or variance for the addition of a bedroom on property served by a system unless the system has been inspected to determine compliance with the applicable requirements, as evidenced by a certificate of compliance or notice of noncompliance issued by a licensed inspection business or certified local unit of government inspector. A local unit of government may temporarily waive the inspection requirement for a building permit or variance for which application is made during the period from November 1 to April 30, provided that an inspection of the system is performed by the following June 1 and the applicant submits a certificate of compliance or notice of noncompliance within 15 days of the inspection. This paragraph does not apply if the local unit of government does not have an ordinance requiring a building permit to add a bedroom.\n(c) A certificate of compliance for an existing system is valid for three years from the date of issuance unless the local unit of government finds evidence of an imminent threat to public health or safety requiring removal and abatement under section 145A.04, subdivision 8.\n(d) A certificate of compliance for a new system is valid for five years from the date of issuance unless the local unit of government finds evidence of an imminent threat to public health or safety requiring removal and abatement under section 145A.04, subdivision 8.\n(e) A licensed inspection business that inspects an existing system may subsequently design and install a new system for that property, provided the inspection business is licensed to install subsurface sewage treatment systems.\n(f) No certified professional may use the professional's position with government, either as an employee or a contractor, to solicit business for the individual's private system enterprise.\n(a) An inspection of an existing system must evaluate the criteria in paragraphs (b) to (i).\n(b) If the inspector finds one or more of the following conditions:\n(1) sewage discharge to surface water;\n(2) sewage discharge to ground surface;\n(3) sewage backup; or\n(4) any other situation with the potential to immediately and adversely affect or threaten public health or safety,\nthen the system constitutes an imminent threat to public health or safety and, if not repaired, must be upgraded, replaced, or its use discontinued within ten months of receipt of the notice described in subdivision 5b, or within a shorter period of time if required by local ordinance.\n(c) A system constructed before April 1, 1996, that has none of the conditions in paragraph (b), and has at least two feet of soil separation need not be upgraded, repaired, replaced, or its use discontinued, notwithstanding any local ordinance that is more restrictive.\n(d) Paragraph (c) does not apply to systems in shoreland areas regulated under sections 103F.201 to 103F.221, wellhead protection areas as defined in section 103I.005, or those used in connection with food, beverage, and lodging establishments regulated under chapter 157.\n(e) If the local unit of government with jurisdiction over the system has adopted an ordinance containing local standards pursuant to subdivision 7, the existing system must comply with the ordinance. If the system does not comply with the ordinance, it must be upgraded, replaced, or its use discontinued according to the ordinance.\n(f) If a seepage pit, drywell, cesspool, or leaching pit exists and the local unit of government with jurisdiction over the system has not adopted local standards to the contrary, the system is failing and must be upgraded, replaced, or its use discontinued within the time required by subdivision 3 or local ordinance.\n(g) If the system fails to provide sufficient groundwater protection, then the local unit of government or its agent shall order that the system be upgraded, replaced, or its use discontinued within the time required by rule or the local ordinance.\n(h) The authority to find a threat to public health under section 145A.04, subdivision 8, is in addition to the authority to make a finding under paragraphs (b) to (d).\n(i) Certified inspectors must use the existing system inspection form provided by the agency. The inspection information required by local ordinance may be included as an attachment to the state form. The following language must appear on the standard form: \"If an existing system is not failing as defined in law, and has at least two feet of design soil separation, then the system need not be upgraded, repaired, replaced, or its use discontinued, notwithstanding any local ordinance that is more strict. This does not apply to systems in shoreland areas, wellhead protection areas, or those used in connection with food, beverage, and lodging establishments as defined in law.\"\nIf a system inspected under subdivision 5 is required to be upgraded, replaced, or its use discontinued under subdivision 5a, the certified inspector must issue a notice of noncompliance to the property owner and must provide a copy of the notice to the unit of government with jurisdiction. The notice of noncompliance must specify why the system must be upgraded, replaced, or its use discontinued. A local unit of government must specify the upgrade time period in its ordinance.\n(a) Before signing an agreement to sell or transfer real property, the seller or transferor must disclose in writing to the buyer or transferee information on how sewage generated at the property is managed. The disclosure must be made by delivering a statement to the buyer or transferee that either:\n(1) the sewage goes to a facility permitted by the agency; or\n(2) the sewage does not go to a permitted facility, and is therefore subject to applicable requirements.\n(b) For sewage not sent to a permitted facility, the disclosure must include a description of the system in use, including the legal description of the property, the county in which the property is located, and a map drawn from available information showing the location of the system on the property to the extent practicable. If the seller or transferor has knowledge that an abandoned subsurface sewage treatment system exists on the property, the disclosure must include a map showing its location. The seller or transferor shall disclose to the buyer or transferee what the seller or transferor has knowledge of relative to the compliance status of the subsurface sewage treatment system, and whether, to the best of the seller's knowledge, a straight-pipe system exists. A seller or transferor who has in their possession a previous inspection report completed by a licensed inspection business or certified local government inspector in accordance with subdivision 5 or 5a shall attach a copy to the disclosure statement that is provided to the buyer.\n(c) Unless the buyer or transferee and seller or transferor agree to the contrary in writing before the closing of the sale, a seller or transferor who fails to disclose the existence or known status of a subsurface sewage treatment system at the time of sale, and who knew or had reason to know of the existence or known status of the system, is liable to the buyer or transferee for costs relating to bringing the system into compliance with the subsurface sewage treatment system rules and for reasonable attorney fees for collection of costs from the seller or transferor. An action under this subdivision must be commenced within two years after the date on which the buyer or transferee closed the purchase or transfer of the real property where the system is located.\n(a) Existing systems. Counties may adopt by ordinance local standards that are less restrictive than the agency's rules in order to define an acceptable existing system. The local standards may include soil separation, soil classification, vegetation, system use, localized well placement and construction, localized density of systems and wells, extent of area to be covered by local standards, groundwater flow patterns, and existing natural or artificial drainage systems. The local standards and criteria shall be submitted to the commissioner for comment prior to adoption to demonstrate that, based on local circumstances in that jurisdiction, they adequately protect public health and the environment.\n(b) New or replacement systems. Counties, after providing documentation of conditions listed in this paragraph to the commissioner, may adopt by ordinance local standards that are less restrictive than the agency's rules for new system construction or replacement in areas of sustained and projected low population density where conditions render conformance to applicable requirements difficult or otherwise inappropriate. Documentation may include a map delineating the area of the county to be served by the local standards, a description of the hardship that would result from strict adherence to the agency's rules, and evidence of sustained and projected low population density. The local standards must protect human health and the environment and be based on considerations that may include, but need not be limited to, soil separation, soil classification, vegetation, system use, localized well placement and construction, localized density of systems and wells, extent of area to be covered by local standards, groundwater flow patterns, and existing natural or artificial drainage systems. The local standards must provide cost-effective and long-term treatment alternatives. The draft ordinance incorporating the local standards must be submitted with justification to the commissioner 30 days before adoption for review and comment.\n(c) New or replacement systems; local ordinances. A local unit of government may adopt and enforce ordinances or rules affecting new or replacement subsurface sewage treatment systems that are more restrictive than the agency's rules. A local unit of government may not adopt or enforce an ordinance or rule if its effect is to prevent or delay recording with the county recorder or registrar of titles of a deed or other instrument that is otherwise entitled to be recorded.\n(d) Local standards; conflict with state law. Local standards adopted under paragraph (a) or (b) must not conflict with any requirements under other state laws or rules or local ordinances, including, but not limited to, requirements for:\n(1) systems in shoreland areas, regulated under sections 103F.201 to 103F.221;\n(2) well construction and location, regulated under chapter 103I; and\n(3) systems used in connection with food, beverage, and lodging establishments, regulated under chapter 157.\nAlternative local standards for new or replacement residential systems with flow of 2,500 gallons per day or less may be applied to systems listed in clause (1), provided the alternative standards are no less stringent than provisions of Minnesota Rules, chapter 7080, that went into effect on April 3, 2006. In addition, alternative local standards for new or replacement systems with flow of 2,500 gallons per day or less may be applied to systems listed in clause (3), provided the alternative standards are no less stringent than provisions of Minnesota Rules, chapter 7080, that went into effect on April 3, 2006, except that the waste strength must meet the standards established in Minnesota Rules, part 7080.2150, subpart 3, item K. If additional treatment of waste is needed to meet this standard, the treatment must be in accordance with Minnesota Rules, part 7080.2150, subpart 3, item A. The local standards must include references to applicable requirements under other state laws or rules or local ordinances. Nothing in this paragraph prevents a local subsurface sewage treatment system ordinance from including provisions of the current rule as part of the alternative local standards.\n[Repealed, 1Sp2001 c 2 s 162]\n(a) A subsurface sewage treatment system may be installed provided that it meets all local ordinance requirements and provided the requirements of paragraphs (b) to (e) are met.\n(b) The manufacturer shall provide to the commissioner:\n(1) documentation that the manufacturer's system was designated by the agency as a warrantied system as of June 30, 2001, or the system is a modified version of the system that was designated as a warrantied system and meets the size requirements or other requirements that were the basis for the previous warrantied system classification; or\n(2) documentation showing that a minimum of 50 of the manufacturer's systems have been installed and operated and are under normal use across all major soil classifications for a minimum of three years.\n(c) For each system that meets the requirements of paragraph (b), clause (1) or (2), the manufacturer must provide to the commissioner:\n(1) documentation that the system manufacturer or designer will provide full warranty effective for at least five years from the time of installation, covering design, labor, and material costs to remedy failure to meet performance expectations for systems used and installed in accordance with the manufacturer's or designer's instructions; and\n(2) a commonly accepted financial assurance document or documentation of the manufacturer's or designer's financial ability to cover potential replacement and upgrades necessitated by failure of the system to meet the performance expectations for the duration of the warranty period.\n(d) The manufacturer shall reimburse the agency an amount of $2,000 for staff services needed to review the information submitted pursuant to paragraphs (b) and (c). Reimbursements accepted by the agency shall be deposited in the environmental fund and are appropriated to the agency for the purpose of reviewing information submitted. Reimbursement by the manufacturer shall precede, not be contingent upon, and shall not affect the agency's decision on whether the submittal meets the requirements of paragraphs (b) and (c).\n(e) The manufacturer shall provide to the local unit of government reasonable assurance of performance of the manufacturer's system, engineering design of the manufacturer's system, a monitoring plan that will be provided to system owners, and a mitigation plan that will be provided to system owners describing actions to be taken if the system fails.\n(f) The commissioner may prohibit a subsurface sewage treatment system from qualifying for installation under this subdivision upon a finding of fraud, system failure, failure to meet warranty conditions, or failure to meet the requirements of this subdivision or other matters that fail to meet with the intent and purpose of this subdivision. Prohibition of installation of a system by the commissioner does not alter or end warranty obligations for systems already installed.\n[Repealed, 2009 c 109 s 15]\nAn inspector who discovers the existence of a straight-pipe system shall issue a noncompliance notice to the owner of the straight-pipe system and forward a copy of the notice to the agency. The notice must state that the owner must replace or discontinue the use of the straight-pipe system within ten months of receiving the notice. If the owner does not replace or discontinue the use of the straight-pipe system within ten months after the notice was received, the owner of the straight-pipe system shall be subject to an administrative penalty of $500 per month of noncompliance beyond the ten-month period. Administrative penalty orders may be issued for violations under this subdivision, as provided in section 116.072. One-half of the proceeds collected from an administrative penalty order issued for violating this subdivision shall be remitted to the local unit of government with jurisdiction over the noncompliant straight-pipe system.\nA county may adopt a subsurface sewage treatment system management plan that describes how the county plans on carrying out subsurface sewage treatment system needs.\n(a) By September 1, 2010, the agency shall appoint a Subsurface Sewage Treatment Systems Implementation and Enforcement Task Force in collaboration with the Association of Minnesota Counties, Minnesota Association of Realtors, Minnesota Association of County Planning and Zoning Administrators, and the Minnesota Onsite Wastewater Association. The agency shall work in collaboration with the task force to develop effective and timely implementation and enforcement methods in order to rapidly reduce the number of subsurface sewage treatment systems that are an imminent threat to public health or safety and effectively enforce all violations of the subsurface sewage treatment system rules. The agency shall meet at least three times per year with the task force to address implementation and enforcement issues. The meetings shall be scheduled so that they do not interfere with the construction season.\n(b) The agency, in collaboration with the task force and in consultation with the attorney general, county attorneys, and county planning and zoning staff, shall develop, periodically update, and provide to counties enforcement protocols and a checklist that county inspectors, field staff, and others may use when inspecting subsurface sewage treatment systems and enforcing subsurface sewage treatment system rules.",
	"repealed": false
}