{
	"id": "144G.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.81",
	"title": "144G.81 ADDITIONAL REQUIREMENTS FOR ASSISTED LIVING FACILITIES WITH SECURED DEMENTIA CARE UNITS.",
	"text": "An assisted living facility with dementia care that has a secured dementia care unit must meet the requirements of section 144G.45 and the following additional requirements:\n(1) a hazard vulnerability assessment or safety risk must be performed on and around the property. The hazards indicated on the assessment must be assessed and mitigated to protect the residents from harm; and\n(2) the facility shall be protected throughout by an approved supervised automatic sprinkler system by August 1, 2029.\nMS 2020 [Repealed, 7Sp2020 c 1 art 6 s 26]\n(a) All assisted living facilities with dementia care and a secured dementia care unit must meet the applicable provisions of the 2018 edition of the NFPA Standard 101, Life Safety Code, Healthcare (limited care) chapter. The minimum design standards shall be met for all new licenses or new construction.\n(b) If the commissioner decides to update the Life Safety Code for purposes of this subdivision, the commissioner must notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health care and public safety of the planned update by January 15 of the year in which the new Life Safety Code will become effective. Following notice from the commissioner, the new edition shall become effective for assisted living facilities with dementia care and a secured dementia care unit beginning August 1 of that year, unless provided otherwise in law. The commissioner shall, by publication in the State Register, specify a date by which these facilities must comply with the updated Life Safety Code. The date by which these facilities must comply shall not be sooner than six months after publication of the commissioner's notice in the State Register.\nAn assisted living facility with dementia care providing services in a secured dementia care unit must have an awake person who is physically present in the secured dementia care unit 24 hours per day, seven days per week, who is responsible for responding to the requests of residents for assistance with health and safety needs, and who meets the requirements of section 144G.41, subdivision 1, clause (12).\nA facility may request under section 144G.45, subdivision 7, that the commissioner grant a variance or waiver from the provisions of this section, except subdivision 4.",
	"repealed": false
}