{
	"id": "216B.246",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.246",
	"title": "216B.246 FEDERALLY APPROVED TRANSMISSION LINES; INCUMBENT TRANSMISSION LINEOWNER RIGHTS.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Electric transmission line\" means a high-voltage transmission line with a capacity of 100 kilovolts or more and associated transmission facilities.\n(c) \"Incumbent electric transmission owner\" means any public utility that owns, operates, and maintains an electric transmission line in this state; any generation and transmission cooperative electric association; any municipal power agency; any power district; any municipal utility; or any transmission company as defined under section 216B.02, subdivision 10.\nAn incumbent electric transmission owner has the right to construct, own, and maintain an electric transmission line that has been approved for construction in a federally registered planning authority transmission plan and connects to facilities owned by that incumbent electric transmission owner. The right to construct, own, and maintain an electric transmission line that connects to facilities owned by two or more incumbent electric transmission owners belongs individually and proportionally to each incumbent electric transmission owner, unless otherwise agreed upon in writing. This section does not limit the right of any incumbent electric transmission owner to construct, own, and maintain any transmission equipment or facilities that have a capacity of less than 100 kilovolts.\n(a) If an electric transmission line has been approved for construction in a federally registered planning authority transmission plan, the incumbent electric transmission owner, or owners if there is more than one owner, shall give notice to the commission, in writing, within 60 days of approval, regarding its intent to construct, own, and maintain the electric transmission line. If an incumbent electric transmission owner gives notice of intent to build the electric transmission line then, unless exempt from the requirements of section 216B.243, within 12 months from the date of the notice described in this paragraph, the incumbent electric transmission owner shall file an application for a certificate of need under section 216B.243 or certification under section 216B.2425.\n(b) If the incumbent electric transmission owner indicates that it does not intend to build the transmission line, such notice shall fully explain the basis for that decision. If the incumbent electric transmission owner, or owners, gives notice of intent not to build the electric transmission line, then the commission may determine whether the incumbent electric transmission owner or other entity will build the electric transmission line, taking into consideration issues such as cost, efficiency, reliability, and other factors identified in this chapter.",
	"repealed": false
}