{
	"id": "18E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/18E.03",
	"title": "18E.03 AGRICULTURAL CHEMICAL RESPONSE AND REIMBURSEMENT ACCOUNT.",
	"text": "The agricultural chemical response and reimbursement account is established as an account in the agricultural fund.\n(a) Money in the agricultural chemical response and reimbursement account may only be used:\n(1) to pay for the commissioner's responses to incidents under chapters 18B, 18C, and 18D that are not eligible for payment under section 115B.20, subdivision 2;\n(2) to pay for emergency responses that are otherwise unable to be funded;\n(3) to reimburse and pay corrective action costs under section 18E.04; and\n(4) to reimburse the commissioner for board staff and other administrative costs and the commissioner's incident response program costs related to eligible incident sites, up to $450,000 per fiscal year.\n(b) Money in the agricultural chemical response and reimbursement account is appropriated to the commissioner to make payments as provided in this subdivision.\n(a) The commissioner shall determine the amount of the response and reimbursement fee under subdivision 4 after a public hearing based on:\n(1) the amount needed to maintain an unencumbered balance in the account of $2,000,000;\n(2) the amount estimated to be needed for responses to incidents as provided in subdivision 2, clauses (1) and (2); and\n(3) the amount needed for payment and reimbursement under section 18E.04.\n(b) The commissioner shall determine the response and reimbursement fee so that the total balance in the account does not exceed $6,500,000.\n(c) Money from the response and reimbursement fee shall be deposited in the treasury and credited to the agricultural chemical response and reimbursement account.\n(a) The response and reimbursement fee consists of the surcharges and any adjustments made by the commissioner in this subdivision and shall be collected by the commissioner. The amount of the response and reimbursement fee shall be determined and imposed annually by the commissioner as required to satisfy the requirements in subdivision 3. The commissioner shall adjust the amount of the surcharges imposed in proportion to the amount of the surcharges listed in this subdivision. License application categories under paragraph (d) must be charged in proportion to the amount of surcharges imposed up to a maximum of 50 percent of the license fees set under chapters 18B and 18C.\n(b) The commissioner shall impose a surcharge on pesticides registered under chapter 18B to be collected as a surcharge on the gross sales under section 18B.26, subdivision 3, that is equal to 0.1 percent of sales of the pesticide in the state and sales of pesticides for use in the state during the previous calendar year, except the surcharge may not be imposed on pesticides that are sanitizers or disinfectants as determined by the commissioner. No surcharge is required if the surcharge amount based on percent of annual gross sales of a nonagricultural pesticide is less than $10. Sales of pesticides in the state for use outside of the state are exempt from the surcharge in this paragraph if the registrant, agricultural pesticide dealer, or pesticide dealer properly documents the sale location and the distributors.\n(c) The commissioner shall impose a ten cents per ton surcharge on the inspection fee under section 18C.425, subdivision 6, for fertilizers, soil amendments, and plant amendments.\n(d) The commissioner shall impose a surcharge on the license application of persons licensed under chapters 18B and 18C consisting of:\n(1) a $75 surcharge for each site where pesticides are stored or distributed, to be imposed as a surcharge on pesticide dealer application fees under section 18B.31, subdivision 5, and the agricultural pesticide dealer application fee under section 18B.316, subdivision 10;\n(2) a $75 surcharge for each site where a fertilizer, plant amendment, or soil amendment is distributed, to be imposed on persons licensed under sections 18C.415 and 18C.425;\n(3) a $50 surcharge to be imposed on a structural pest control applicator license application under section 18B.32, subdivision 6, for business license applications only;\n(4) a $20 surcharge to be imposed on commercial applicator license application fees under section 18B.33, subdivision 7; and\n(5) a $20 surcharge to be imposed on noncommercial applicator license application fees under section 18B.34, subdivision 5, except a surcharge may not be imposed on a noncommercial applicator that is a state agency, political subdivision of the state, the federal government, or an agency of the federal government.\n(e) A $1,000 fee shall be imposed on each site where pesticides are stored and sold for use outside of the state unless:\n(1) the distributor properly documents that it has less than $2,000,000 per year in wholesale value of pesticides stored and transferred through the site; or\n(2) the registrant pays the surcharge under paragraph (b) and the registration fee under section 18B.26, subdivision 3, for all of the pesticides stored at the site and sold for use outside of the state.\n(f) Paragraphs (c) to (e) apply to sales, licenses issued, applications received for licenses, and inspection fees imposed on or after July 1, 1990.\n[Repealed, 1993 c 367 s 41]\nRevenue from the following sources must be deposited in the state treasury and credited to the agricultural chemical response and reimbursement account:\n(1) the proceeds of the fees imposed by subdivisions 3 and 4;\n(2) money recovered by the state for expenses paid with money from the account;\n(3) interest attributable to investment of money in the account; and\n(4) money received by the commissioner in the form of gifts, grants other than federal grants, reimbursements, and appropriations from any source intended to be used for the purposes of the account.\nThe amount of the response and reimbursement fee imposed under subdivisions 3 and 4 is appropriated from the general fund to the agricultural chemical response and reimbursement account to be reimbursed when the fee is collected.",
	"repealed": false
}