{
	"id": "245.991",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.991",
	"title": "245.991 PROJECTS FOR ASSISTANCE IN TRANSITION FROM HOMELESSNESS PROGRAM.",
	"text": "The commissioner of human services must establish the projects for assistance in transition from homelessness program to prevent or end homelessness for people with serious mental illness, substance use disorder, or co-occurring substance use disorder and ensure the commissioner achieves the goals of the housing mission statement in section 245.461, subdivision 4.\nAn applicant for a grant under this section must be a nonprofit organization, county, or other entity that provides services to help individuals transition from homelessness.\nGrantees must provide homeless outreach and case management services. Projects may provide clinical assessment, habilitation and rehabilitation services, community mental health services, substance use disorder treatment, housing transition and sustaining services, or direct assistance funding. Services must be provided to individuals with a serious mental illness, or with a co-occurring substance use disorder, and who are homeless or at imminent risk of homelessness. Individuals receiving homeless outreach services may be presumed eligible until a serious mental illness can be verified.\n(a) Grantees must submit an annual report to the commissioner for the purposes of evaluating the effectiveness of the grant program. The report must include:\n(1) the number of individuals to whom the grantee provided homeless outreach services;\n(2) the number of individuals the grantee enrolled in case management services;\n(3) the number of individuals that were able to access mental health and substance use disorder treatment services; and\n(4) the number of individuals that were able to transition from homelessness to housing.\n(b) The commissioner must submit the results of the evaluation to the chairs and ranking minority members of the legislative committees with jurisdiction over mental health and homelessness.\nThe commissioner of human services must comply with all conditions and requirements necessary to receive federal aid or grants with respect to homeless services or programs as specified in section 245.70.",
	"repealed": false
}