{
	"id": "148E.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.145",
	"title": "148E.145 CONTINUING EDUCATION PROVIDERS.",
	"text": "(a) For the board to approve a continuing education provider, the provider must:\n(1) submit a completed application form that the board has provided;\n(2) agree to comply with the requirements of this section;\n(3) submit a signed statement that indicates that the provider agrees to provide documentation of attendance that meets the requirements of section 148E.130, subdivision 11, to each participant in the provider's program; and\n(4) pay the continuing education provider fee specified in section 148E.180.\n(b) An approval is valid for one year from the date that the board receives the application and fee.\n(c) During the one-year period, an approved provider may provide no more than the number of clock hours for which the provider has applied as specified in section 148E.180, subdivision 4. If the provider wishes to offer additional clock hours during the one-year period, the provider must submit another application and fee to the board.\nMS 2018 [Repealed by amendment, 2020 c 79 art 3 s 49]\n(a) An approved provider must ensure that all continuing education activities:\n(1) promote the standards of practice described in sections 148E.195 to 148E.240;\n(2) contribute to the practice of social work as defined in section 148E.010; and\n(3) are presented by individuals with expertise in the material or content.\n(b) An approved provider must provide documentation of completion to each participant that includes the information required by section 148E.130, subdivision 11.\nMS 2018 [Repealed by amendment, 2020 c 79 art 3 s 49]\nAn approved provider must maintain the following information for three years following the end of each program activity:\n(1) the program's title;\n(2) a description of the program's content and objectives;\n(3) the program's date;\n(4) the program's number of clock hours;\n(5) whether the activity was presented as a live interactive activity or continuing education independent learning;\n(6) the names and qualifications of the program's presenters; and\n(7) a list of the program's attendees.\n(a) The board may audit an approved provider to determine compliance with the requirements of this section.\n(b) An approved provider audited by the board must provide the documentation specified in subdivision 5.\nThe board may revoke approval of an approved provider if the board determines the provider failed to meet the requirements of this section.",
	"repealed": false
}