{
	"id": "10A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.28",
	"title": "10A.28 PENALTY FOR EXCEEDING LIMITS.",
	"text": "A candidate subject to the expenditure limits in section 10A.25 who permits the candidate's principal campaign committee to make expenditures or permits approved expenditures to be made on the candidate's behalf in excess of the limits imposed by section 10A.25, as adjusted by section 10A.255, is subject to a civil penalty up to four times the amount by which the expenditures exceeded the limit.\nThe following are subject to a civil penalty of up to four times the amount by which a contribution exceeds the applicable limits:\n(1) a lobbyist, political committee, or political fund that makes a contribution in excess of the limits imposed by section 10A.27, subdivisions 1 and 8;\n(2) a principal campaign committee that makes a contribution in excess of the limits imposed by section 10A.27, subdivision 2;\n(3) a political party unit that makes a contribution in excess of the limits imposed by section 10A.27, subdivisions 2 and 8; or\n(4) a candidate who permits the candidate's principal campaign committee to accept contributions in excess of the limits imposed by section 10A.27.\nIf the board finds that there is reason to believe that excess expenditures have been made or excess contributions accepted contrary to subdivision 1 or 2, the board must make every effort for a period of at least 14 days after its finding to correct the matter by informal methods of conference and conciliation and to enter a conciliation agreement with the person involved. A conciliation agreement under this subdivision is a matter of public record. Unless violated, a conciliation agreement is a bar to any civil proceeding under subdivision 4.\nIf the board is unable after a reasonable time to correct by informal methods a matter where there is reason to believe that excess expenditures have been made or excess contributions accepted contrary to subdivision 1 or 2, the board must make a public finding in the matter. The board may use section 10A.34 to recover fees and penalties or to seek an injunction.",
	"repealed": false
}