{
	"id": "473J.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.09",
	"title": "473J.09 POWERS, DUTIES OF THE AUTHORITY.",
	"text": "The authority may sue and be sued. The authority is a public body and the stadium and stadium infrastructure are public improvements within the meaning of chapter 562. The authority is a municipality within the meaning of chapter 466.\nThe authority may acquire from any public or private entity by lease, purchase, gift, or devise all necessary right, title, and interest in and to real property, air rights, and personal property deemed necessary to the purposes contemplated by this chapter. The authority may acquire, by the exercise of condemnation powers under chapter 117, land, other real property, air rights, personal property, and other right, title, and interest in property, within the stadium site and stadium infrastructure.\nThe authority may sell, lease, or otherwise dispose of any real or personal property acquired by the authority that is no longer required for accomplishment of the authority's purposes. The property may be sold in accordance with the procedures provided by section 469.065, except subdivisions 6 and 7, to the extent the authority deems it to be practical and consistent with this chapter. Title to the stadium must not be transferred or sold by the authority prior to the effective date of enactment of any legislation approving such transfer or sale.\nExcept as otherwise provided in this chapter, the authority is subject to chapters 13 and 13D.\nThe authority may develop, construct, equip, improve, own, operate, manage, maintain, finance, and control the stadium, stadium infrastructure, and related facilities constructed or acquired under this chapter, or may delegate such duties through an agreement, subject to the rights and obligations transferred to and assumed by the authority, the NFL team, other user, third-party manager, or program manager, under the terms of a lease, use agreement, or development agreement.\nThe authority may employ persons and contract for services necessary to carry out its functions, including the utilization of employees and consultants retained by other governmental entities. The authority shall enter into an agreement with the city regarding traffic control for the stadium.\nThe authority may accept monetary contributions, property, services, and grants or loans of money or other property from the United States, the state, any subdivision of the state, any agency of those entities, or any person for any of its purposes, and may enter into any agreement required in connection with the gifts, grants, or loans. The authority shall hold, use, and dispose of the money, property, or services according to the terms of the monetary contributions, grant, loan, or agreement.\nThe authority may lease, license, or enter into use agreements and may fix, alter, charge, and collect rents, fees, and charges for the use, occupation, and availability of part or all of any premises, property, or facilities under its ownership, operation, or control for purposes that will provide athletic, educational, cultural, commercial, or other entertainment, instruction, or activity for the citizens of Minnesota and visitors. The use agreements may provide that the other contracting party has exclusive use of the premises at the times agreed upon, as well as the right to retain some or all revenues from ticket sales, suite licenses, concessions, advertising, naming rights, NFL team designated broadcast/media, club seats, signage, and other revenues derived from the stadium. The lease or use agreement with an NFL team must provide for the payment by the NFL team of an agreed-upon portion of operating and maintenance costs and expenses and provide other terms in which the authority and NFL team agree. In no case may a lease or use agreement permit smoking in the stadium.\nThe authority may conduct research studies and programs; collect and analyze data; prepare reports, maps, charts, and tables; and conduct all necessary hearings and investigations in connection with its functions.\nThe authority may require any employee to obtain and file with the authority an individual bond or fidelity insurance policy. The authority may procure insurance in the amounts the authority considers necessary against liability of the authority or its officers and employees for personal injury or death and property damage or destruction, consistent with chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property.\nThe acquisition and betterment of a stadium and stadium infrastructure by the authority must be conducted pursuant to this chapter and are not subject to sections 473.165 and 473.173. Section 116J.994 does not apply to any transactions of the authority or other governmental entity related to the stadium or stadium infrastructure or to any tenant or other users of the stadium or stadium infrastructure.\nIn addition to the powers expressly granted in this chapter, the authority has all powers necessary or incidental thereto.\nThe authority must report to the chairs and ranking minority members of the legislative committees with jurisdiction over state government finance by January 15 of each year on the following:\n(1) any recommended increases in the rate or dollar amount of tax;\n(2) any recommended increases in the debt of the authority;\n(3) the overall work and role of the authority;\n(4) the authority's proposed operating and capital budgets; and\n(5) the authority's implementation of the operating and capital budgets.\nThe authority shall study the feasibility of conducting a raffle for chances to win a pair or other limited numbers of prime seats (such as lower deck, 50 yard line seats) in the stadium for professional football games for the duration of the lease or use agreement. In conducting the study, the authority must consult with the NFL team. If the authority determines that conducting the raffle is financially feasible, the authority in cooperation with the director of the Gambling Control Board shall conduct the raffle. The proceeds of the raffle must be transmitted to the commissioner of revenue for deposit in the general fund and are appropriated to the commissioner of management and budget for prepayment of principal and interest on appropriation bonds under section 16A.965.",
	"repealed": false
}