{
	"id": "299F.40#stat.299F.40.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.40#stat.299F.40.1",
	"title": "299F.40 LIQUEFIED PETROLEUM OR INDUSTRIAL GAS CONTAINER.",
	"text": "It is the intent of the Minnesota legislature to protect the public welfare and promote safety in the filling and use of pressure vessels containing liquefied petroleum or industrial gases through implementing the regulations of the Interstate Commerce Commission or successor agency, within the state of Minnesota, the rules of the Minnesota state fire marshal, and the national standards of safety on the filling of these containers. It is deemed necessary to insure that containers properly constructed and tested be used and that only liquefied petroleum or industrial gases of suitable and safe vapor pressure be placed in these containers. To attain this end the filling or refilling of liquefied petroleum and industrial gas containers by other than the owner or authorized person must be controlled and specific authority to prevent violation and encourage enforcement be established.\n(a) The term \"person\" shall mean and include any person, persons, firm, firms, corporation, or corporations.\n(b) The term \"owner\" shall mean and include (1) any person who holds a written bill of sale or other instrument under which title to the container was transferred to such person, (2) any person who holds a paid or receipted invoice showing purchase and payment of the container, (3) any person whose name, initials, mark, or other identifying device has been plainly and legibly stamped or otherwise shown upon the surface of the container on or before April 28, 1956, or (4) any manufacturer of a container who has not sold or transferred ownership thereof by written bill of sale or otherwise.\n(c) The term \"liquefied petroleum gas\" as used in this section shall mean and include any material which is composed predominantly of any of the following hydrocarbons or mixtures of the same: propane, propylene, butanes (normal butane and iso-butane), and butylenes.\n(d) The term \"industrial gas\" as used in this section shall mean and include any material which is composed exclusively of any of the following gases or mixtures of them: oxygen, acetylene, nitrogen, argon, and carbon dioxide.\nIf a liquefied petroleum or industrial gas container shall bear upon the surface thereof in plainly legible characters the name, mark, initials, or other identifying device of the owner thereof, it shall be unlawful for any person except the owner or a person authorized in writing by the owner:\n(1) to fill or refill such container with liquefied petroleum or industrial gas or any other gas or compound;\n(2) to buy, sell, offer for sale, give, take, loan, deliver or permit to be delivered, or otherwise use, dispose of, or traffic in any such container; or\n(3) to deface, erase, obliterate, cover up, or otherwise remove or conceal or change any name, mark, initials, or other identifying device of the owner or to place the name, mark, initials, or other identifying device of any person other than the owner on the container.\nThe use of a liquefied petroleum or industrial gas container or containers by any person other than the person whose name, mark, initial, or device shall be or shall have been upon the liquefied petroleum or industrial gas container or containers, without written consent or purchase of the marked and distinguished liquefied petroleum or industrial gas container, for the sale of liquefied petroleum or industrial gas or filling or refilling with liquefied petroleum or industrial gas, or the possession of liquefied petroleum or industrial gas containers by any person other than the person whose name, mark, initial, or other device is thereon, without the written consent of the owner, shall and is hereby declared to be presumptive evidence of the unlawful use, filling or refilling, transition of, or trafficking in liquefied petroleum or industrial gas containers.\nWhenever any person or officer of any corporation mentioned in this section, or the person's or officer's duly authorized agent who has personal knowledge of the facts, makes an oath in writing before any judge, that the party making affidavit has reason to and does believe that any of the person's or the corporation's liquefied petroleum or industrial gas containers marked with the name, initials, mark, or other device of the owner, are in the possession of or being used, filled, refilled, or transferred by any person whose name, initials, mark, or other device does not appear on the containers, and who is in the possession of, filling or refilling, or using the containers without the written consent of the owner of the name, initials, or trade mark, the judge may, when satisfied that there is reasonable cause, issue a search warrant and cause the premises designated to be searched for the purpose of discovering and obtaining the containers. The judge may also order the person in whose possession the containers are found to appear, and inquire into the circumstances of the possession. If the judge finds that the person has been guilty of a violation of this section, the judge shall impose the punishment prescribed, and award the property taken upon the search warrant to its owner.\nAny person who shall fail to comply with any of the foregoing provisions of this section shall be deemed guilty of a misdemeanor for each separate offense.",
	"repealed": false
}