{
	"id": "253B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.04",
	"title": "253B.04 VOLUNTARY TREATMENT AND ADMISSION PROCEDURES.",
	"text": "(a) Voluntary admission is preferred over involuntary commitment and treatment. Any person 16 years of age or older may request to be admitted to a treatment facility or state-operated treatment program as a voluntary patient for observation, evaluation, diagnosis, care and treatment without making formal written application. Any person under the age of 16 years may be admitted as a patient with the consent of a parent or legal guardian if it is determined by independent examination that there is reasonable evidence that (1) the proposed patient has a mental illness, developmental disability, or chemical dependency; and (2) the proposed patient is suitable for treatment. The head of the treatment facility or head of the state-operated treatment program shall not arbitrarily refuse any person seeking admission as a voluntary patient. In making decisions regarding admissions, the treatment facility or state-operated treatment program shall use clinical admission criteria consistent with the current applicable inpatient admission standards established by professional organizations including the American Psychiatric Association, the American Academy of Child and Adolescent Psychiatry, the Joint Commission, and the American Society of Addiction Medicine. These criteria must be no more restrictive than, and must be consistent with, the requirements of section 62Q.53. The treatment facility or head of the state-operated treatment program may not refuse to admit a person voluntarily solely because the person does not meet the criteria for involuntary holds under section 253B.051 or the definition of a person who poses a risk of harm due to mental illness under section 253B.02, subdivision 17a.\n(b) In addition to the consent provisions of paragraph (a), a person who is 16 or 17 years of age who refuses to consent personally to admission may be admitted as a patient for mental illness or chemical dependency treatment with the consent of a parent or legal guardian if it is determined by an independent examination that there is reasonable evidence that the proposed patient is chemically dependent or has a mental illness and is suitable for treatment. The person conducting the examination shall notify the proposed patient and the parent or legal guardian of this determination.\n(c) A person who is voluntarily participating in treatment for a mental illness is not subject to civil commitment under this chapter if the person:\n(1) has given informed consent or, if lacking capacity, is a person for whom legally valid substitute consent has been given; and\n(2) is participating in a medically appropriate course of treatment, including clinically appropriate and lawful use of neuroleptic medication and electroconvulsive therapy. The limitation on commitment in this paragraph does not apply if, based on clinical assessment, the court finds that it is unlikely that the patient will remain in and cooperate with a medically appropriate course of treatment absent commitment and the standards for commitment are otherwise met. This paragraph does not apply to a person for whom commitment proceedings are initiated pursuant to rule 20.01 or 20.02 of the Rules of Criminal Procedure, or a person found by the court to meet the requirements under section 253B.02, subdivision 17.\n(d) Legally valid substitute consent may be provided by a proxy under a health care directive, a guardian or conservator with authority to consent to mental health treatment, or consent to admission under subdivision 1a or 1b.\n(a) A person with a mental illness may seek or voluntarily agree to accept treatment or admission to a state-operated treatment program or treatment facility. If the mental health provider determines that the person lacks the capacity to give informed consent for the treatment or admission, and in the absence of a health care directive or health care power of attorney that authorizes consent, the designated agency or its designee may give informed consent for mental health treatment or admission to a treatment facility or state-operated treatment program on behalf of the person.\n(b) The designated agency shall apply the following criteria in determining the person's ability to give informed consent:\n(1) whether the person demonstrates an awareness of the person's illness, and the reasons for treatment, its risks, benefits and alternatives, and the possible consequences of refusing treatment; and\n(2) whether the person communicates verbally or nonverbally a clear choice concerning treatment that is a reasoned one, not based on delusion, even though it may not be in the person's best interests.\n(c) The basis for the designated agency's decision that the person lacks the capacity to give informed consent for treatment or admission, and that the patient has voluntarily accepted treatment or admission, must be documented in writing.\n(d) A treatment facility or state-operated treatment program that provides treatment in reliance on the written consent given by the designated agency under this subdivision or by a substitute decision maker appointed by the court is not civilly or criminally liable for performing treatment without consent. This paragraph does not affect any other liability that may result from the manner in which the treatment is performed.\n(e) A patient who receives treatment or is admitted to a treatment facility or state-operated treatment program under this subdivision or subdivision 1b has the right to refuse treatment at any time or to be released from a treatment facility or state-operated treatment program as provided under subdivision 2. The patient or any interested person acting on the patient's behalf may seek court review within five days for a determination of whether the patient's agreement to accept treatment or admission is voluntary. At the time a patient agrees to treatment or admission to a treatment facility or state-operated treatment program under this subdivision, the designated agency or its designee shall inform the patient in writing of the patient's rights under this paragraph.\nIf the designated agency or its designee declines or refuses to give informed consent under subdivision 1a, the person who is seeking treatment or admission, or an interested person acting on behalf of the person, may petition the court for appointment of a substitute decision maker who may give informed consent for voluntary treatment and services. In making this determination, the court shall apply the criteria in subdivision 1a, paragraph (b).\nEvery patient admitted for mental illness or developmental disability under this section shall be informed in writing at the time of admission that the patient has a right to leave the treatment facility or state-operated treatment program within 12 hours of making a request, unless held under another provision of this chapter. Every patient admitted for chemical dependency under this section shall be informed in writing at the time of admission that the patient has a right to leave the treatment facility or state-operated treatment program within 72 hours, exclusive of Saturdays, Sundays, and legal holidays, of making a request, unless held under another provision of this chapter. The request shall be submitted in writing to the head of the treatment facility or state-operated treatment program or the person's designee.",
	"repealed": false
}