{
	"id": "25.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/25.33",
	"title": "25.33 DEFINITIONS.",
	"text": "When used in sections 25.31 to 25.43, the terms defined in this section have the meanings given them.\n[Repealed, 1996 c 310 s 1]\n\"Distribute\" means to offer for sale, sell, exchange, barter, or otherwise supply commercial feed. The term distribute shall not include or apply to any feeds manufactured for livestock owned by the distributor.\n\"Distributor\" means any person who distributes commercial feed in this state.\n\"Commercial feed\" means materials or combinations of materials that are distributed or intended to be distributed for use as feed or for mixing in feed, including feed for aquatic animals, unless the materials are specifically exempted. Unmixed whole seeds and physically altered entire unmixed seeds, as identified in the United States grain standards, if the whole or physically altered seeds are not chemically changed, are not labeled as a feed or for use as feed, or are not adulterated within the meaning of section 25.37, paragraph (a), are exempt. The commissioner by rule may exempt from this definition, or from specific provisions of sections 25.31 to 25.43, commodities such as hay, straw, stover, silage, cobs, husks, hulls, and individual chemical compounds or substances if those commodities, compounds, or substances are not intermixed with other materials, are not labeled as a feed or for use as feed, and are not adulterated within the meaning of section 25.37, paragraph (a).\n\"Feed ingredient\" means each of the constituent materials making up a commercial feed.\n\"Mineral feed\" means a commercial feed intended to supply primarily mineral elements or inorganic nutrients.\n\"Drug\" means (1) any article intended for use in the diagnosis, cure, mitigation, treatment, or prevention of disease in animals other than humans; and (2) articles other than feed intended to affect the structure or any function of the animal body.\n\"Customer formula feed\" means commercial feed which consists of a mixture of commercial feeds or feed ingredients or both, each batch of which is manufactured according to the specific instructions of the final purchaser.\n\"Manufacture\" means to grind, mix, blend, process, package, or label a commercial feed for distribution.\n\"Brand name\" means any word, name, symbol, or device, or any combination thereof, identifying the commercial feed of a distributor or license holder and distinguishing it from that of others.\n\"Product name\" means the name of the commercial feed which identifies it as to kind, class, or specific use.\n\"Label\" means a display of written, printed, or graphic matter upon or affixed to the container in which a commercial feed is distributed, or on the invoice or delivery slip with which a commercial feed is distributed.\n\"Labeling\" means all labels and other written, printed, or graphic matter upon a commercial feed or any of its containers or wrapper or accompanying or supporting such commercial feed.\n\"Ton\" means a net weight of 2,000 pounds avoirdupois.\n\"Percent\" or \"percentages\" means percentages by weights.\n\"Official sample\" means a sample of feed taken by the commissioner or the commissioner's agent in accordance with the provisions of section 25.41, subdivision 3, 5, or 6.\n[Repealed, 2012 c 244 art 1 s 83]\n\"Pet food\" means any commercial feed prepared and distributed for consumption by pets.\n\"Pet\" means a domesticated dog or cat normally maintained in or near the household of its owner.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's agent.\n\"Specialty pet\" means a domesticated animal normally maintained in a cage or tank, including, but not limited to, a gerbil, hamster, canary, psittacine bird, mynah, finch, tropical fish, goldfish, snake, or turtle. \"Specialty pet\" does not include a dog, cat, horse, rabbit, or wild bird.\n\"Specialty pet food\" means commercial feed prepared and distributed for consumption by specialty pets.\n\"Quantity statement\" means a statement of the net weight (mass), net volume (liquid or dry), count, or other form of measurement.",
	"repealed": false
}