{
	"id": "245A.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.211",
	"title": "245A.211 PRONE RESTRAINT PROHIBITION.",
	"text": "This section applies to all programs licensed or certified under this chapter, chapters 142C, 245D, 245F, 245G, and sections 245I.20 and 245I.23. The requirements in this section are in addition to any applicable requirements for the use of holds or restraints for each license or certification type.\n(a) \"Mechanical restraint\" means a restraint device that limits the voluntary movement of a person or the person's limbs.\n(b) \"Prone restraint\" means a restraint that places a person in a face-down position with the person's chest in contact with the floor or other surface.\n(c) \"Restraint\" means a physical hold, physical restraint, manual restraint, restraint equipment, or mechanical restraint that holds a person immobile or limits the voluntary movement of a person or the person's limbs.\n(a) A license or certification holder must not use a prone restraint on any person receiving services in a program, except in the instances allowed by paragraphs (b) to (d).\n(b) If a person rolls into a prone position during the use of a restraint, the person must be restored to a nonprone position as quickly as possible.\n(c) If the applicable licensing requirements allow a program to use mechanical restraints, a person may be briefly held in a prone restraint for the purpose of applying mechanical restraints if the person is restored to a nonprone position as quickly as possible.\n(d) If the applicable licensing requirements allow a program to use seclusion, a person may be briefly held in a prone restraint to allow staff to safely exit a seclusion room.\nA license or certification holder must not implement a restraint on a person receiving services in a program in a way that is contraindicated for any of the person's known medical or psychological conditions. Prior to using restraints on a person with a known medical or psychological conditions that restraints are contraindicated for, the license or certification holder must document the contraindication and the type of restraints that will not be used on the person based on this determination.",
	"repealed": false
}