{
	"id": "193.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.143",
	"title": "193.143 STATE ARMORY BUILDING COMMISSION, POWERS.",
	"text": "Such corporation, subject to the conditions and limitations prescribed in sections 193.141 to 193.149, shall possess all the powers of a body corporate necessary and convenient to accomplish the objectives and perform the duties prescribed by sections 193.141 to 193.149, including the following, which shall not be construed as a limitation upon the general powers hereby conferred:\n(1) To acquire by lease, purchase, gift, or condemnation proceedings all necessary right, title, and interest in and to the lands required for a site for a new armory and all other real or personal property required for the purposes contemplated by the Military Code and to hold and dispose of the same, subject to the conditions and limitations herein prescribed; provided that any such real or personal property or interest therein may be so acquired or accepted subject to any condition which may be imposed thereon by the grantor or donor and agreed to by such corporation not inconsistent with the proper use of such property by the state for armory or military purposes as herein provided.\n(2) To exercise the power of eminent domain in the manner provided by chapter 117, for the purpose of acquiring any property which such corporation is herein authorized to acquire by condemnation; provided, that the corporation may take possession of any such property so to be acquired at any time after the filing of the petition describing the same in condemnation proceedings; provided further, that this shall not preclude the corporation from abandoning the condemnation of any such property in any case where possession thereof has not been taken.\n(3) To construct and equip new armories as authorized herein; to pay therefor out of the funds obtained as hereinafter provided and to hold, manage, and dispose of such armory, equipment, and site as hereinafter provided. The total amount of bonds issued on account of such armories shall not exceed the amount of the cost thereof; provided also, that the total bonded indebtedness of the commission shall not at any time exceed the aggregate sum of $15,000,000.\n(4) To provide partnerships with federal and state governments and to match federal and local funds, when available.\n(5) To sue and be sued.\n(6) To contract and be contracted with in any matter connected with any purpose or activity within the powers of such corporations as herein specified; provided, that no officer or member of such corporation shall be personally interested, directly or indirectly, in any contract in which such corporation is interested.\n(7) To employ any and all professional and nonprofessional services and all agents, employees, workers, and servants necessary and proper for the purposes and activities of such corporation as authorized or contemplated herein and to pay for the same out of any portion of the income of the corporation available for such purposes or activities. The officers and members of such corporation shall not receive any compensation therefrom, but may receive their reasonable and necessary expenses incurred in connection with the performance of their duties; provided however, that whenever the duties of any member of the commission require full time and attention the commission may compensate the member therefor at such rates as it may determine.\n(8) To borrow money and issue bonds for the purposes and in the manner and within the limitations herein specified, and to pledge any and all property and income of such corporation acquired or received as herein provided to secure the payment of such bonds, subject to the provisions and limitations herein prescribed, and to redeem any such bonds if so provided therein or in the mortgage or trust deed accompanying the same.\n(9) To use for the following purposes any available money received by such corporation from any source as herein provided in excess of those required for the payment of the cost of such armory and for the payment of any bonds issued by the corporation and interest thereon according to the terms of such bonds or of any mortgage or trust deed accompanying the same:\n(a) to pay the necessary incidental expenses of carrying on the business and activities of the corporation as herein authorized;\n(b) to pay the cost of operating, maintaining, repairing, and improving such new armories;\n(c) if any further excess money remains, to purchase upon the open market at or above or below the face or par value thereof any bonds issued by the corporation as herein authorized, provided that any bonds so purchased shall thereupon be canceled.\n(10) To adopt and use a corporate seal.\n(11) To adopt all needful bylaws and rules for the conduct of business and affairs of such corporation and for the management and use of all armories while under the ownership and control of such corporation as herein provided, not inconsistent with the use of such armory for armory or military purposes.\n(12) Such corporation shall issue no stock.\n(13) No officer or member of such corporation shall have any personal share or interest in any funds or property of the corporation or be subject to any personal liability by reason of any liability of the corporation.\n(14) The Minnesota State Armory Building Commission created under section 193.142 shall keep all money and credits received by it as a single fund, to be designated as the \"Minnesota State Armory Building Commission fund,\" with separate accounts for each armory; and the commission may make transfers of money from funds appertaining to any armory under its control for use for any other such armory; provided such transfers shall be made only from money on hand, from time to time, in excess of the amounts required to meet payments of interest or principal on bonds or other obligations appertaining to the armory to which such funds pertain and only when necessary to pay expenses of construction, operation, maintenance, debt service, and other obligations reasonable and necessary, of such other armory; provided further, no such transfer of any money paid for the support of any armory by the municipality in which such armory is situated shall be made by the commission.\n(15) The corporation created under section 193.142 may designate one or more state or national banks as depositories of its funds, and may provide, upon such conditions as the corporation may determine, that the treasurer of the corporation shall be exempt from personal liability for loss of funds deposited in any such depository due to the insolvency or other acts or omissions of such depository.\n(16) The governor is empowered to apply for grants of money, equipment, and materials which may be made available to the states by the federal government for leasing, building, and equipping armories for the use of the military forces of the state which are reserve components of the armed forces of the United States, whenever the governor is satisfied that the conditions under which such grants are offered by the federal government, are for the best interests of the state and are not inconsistent with the laws of the state relating to armories, and to accept such grants in the name of the state. The Minnesota State Armory Building Commission is designated as the agency of the state to receive such grants and to use them for armory purposes as prescribed in this chapter, and by federal laws, and regulations not inconsistent therewith.",
	"repealed": false
}