{
	"id": "80B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/80B.05",
	"title": "80B.05 FRAUDULENT AND DECEPTIVE PRACTICES.",
	"text": "It is unlawful for any offeror or target company or any controlling person of an offeror or target company or any broker-dealer acting on behalf of an offeror or target company to engage in any fraudulent, deceptive or manipulative acts or practices in connection with a takeover offer. Fraudulent, deceptive and manipulative acts or practices include, without limitation:\n(1) the publication or use in connection with the offer of any false statement of a material fact or the omission to state a material fact necessary to make the statements made not misleading;\n(2) the sale by any controlling shareholders of a target company of any or their equity securities to the offeror for a consideration greater than that to be paid other stockholders pursuant to the offer or the purchase of any of the securities of a controlling shareholder of the target company by the offeror for a consideration greater than that to be paid other shareholders, pursuant to an agreement not disclosed to the other shareholders;\n(3) the refusal by a target company incorporated under the laws of this state to permit an offeror who is a stockholder of record to examine its list of stockholders, and to make extracts therefrom, pursuant to the applicable statutes and rules of this state and the United States, for the purpose of making a takeover offer in compliance with sections 80B.01 to 80B.13, or in lieu thereof, to mail any solicitation materials published by the offeror to its security holders with reasonable promptness after receipt from the offeror of such materials together with the reasonable expenses of postage and handling;\n(4) except for forms of communication described in section 80C.19, subdivision 4, the solicitation of any offeree for acceptance or rejection of a takeover offer or acquisition of any equity security pursuant to a takeover offer before the takeover offer is effective under sections 80B.01 to 80B.13 or while the offer is suspended under sections 80B.01 to 80B.13.\nNotwithstanding any contrary provisions of this chapter, during the time a takeover offer is suspended under sections 80B.01 to 80B.13, the offeror may distribute to offerees who are residents of this state the takeover offer materials, and any amendments to the offer, if the following statement, printed in not less than 10-point boldface type, is affixed by the offeror or with the offeror's consent to the front cover of the materials: \"The commissioner of commerce, state of Minnesota, has suspended the solicitation and effectiveness within the state of Minnesota of the attached offering materials. Until further notice, the attached materials are sent for informative purposes only and are not a solicitation to purchase shares.\" During the time any takeover offer is suspended under sections 80B.01 to 80B.13, if the offeror elects to distribute materials to offerees who are residents of this state for informational purposes, the target company may distribute to offerees who are residents of this state a statement of the target company's position with respect to the takeover offer and the takeover offer materials, if the following statement, printed in not less than 10-point boldface type, is attached to the front cover of the target company's communication: \"The commissioner of commerce, state of Minnesota, has suspended the solicitation and effectiveness within the state of Minnesota of the offer addressed herein. Until further notice, the attached materials are sent for informative purposes only and are not a solicitation to reject or accept the offer.\"",
	"repealed": false
}