{
	"id": "354A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.011",
	"title": "354A.011 DEFINITIONS.",
	"text": "For purposes of this chapter, unless the language or context clearly indicates that a different meaning is intended, the following terms shall have the meanings ascribed to them.\n[Repealed, 1992 c 598 art 6 s 22]\n\"Accumulated contributions\" means the total of member or employee contributions made by salary deductions and assessments or payments made in lieu of salary deductions, if authorized, which are credited by the teachers retirement fund association to the member's individual account.\n\"Actuarial equivalent\" means the condition of one annuity or benefit having an equal actuarial present value as another annuity or benefit, determined as of a given date with each actuarial present value based on the appropriate mortality table adopted by the appropriate board of trustees based on the experience of that retirement fund association as recommended by the actuary retained under section 356.214, and approved under section 356.215, subdivision 18, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\n\"Allowable service\" means any service rendered by a teacher during a period in which the teacher receives salary from which employee contribution salary deductions are made to and credited by the teachers retirement fund association, any service rendered by a person during any period where assessments or payments in lieu of salary deductions were made if authorized by any law or provision of the association's articles of incorporation or bylaws then in effect or pursuant to section 354A.091, 354A.092, 354A.093, or 354A.094.\n\"Annuity\" means the payments made by the teachers retirement fund association in the form of a retirement annuity or an optional annuity.\n\"Approved actuary\" means an actuary who meets the definition in section 356.215, subdivision 1, paragraph (c).\n\"APRN\" means an individual licensed as an advanced practice registered nurse by the Board of Nursing as defined in section 148.171, subdivision 3, who provides services to a member or an applicant that are within the scope of the APRN's professional licensure.\n\"Association\" or \"teachers retirement fund association\" means the St. Paul Teachers Retirement Fund Association established pursuant to this chapter.\n\"Average salary,\" for purposes of computing a normal coordinated program retirement annuity under section 354A.31, subdivision 4 or 4a, means an amount equal to the average salary upon which contributions were made for the highest five successive years of service credit but may not, in any event, include any more than the equivalent of 60 monthly salary payments. Average salary must be based upon all years of service credit if this service credit is less than five years.\n\"Basic member\" means any member of the teachers retirement fund association who is not covered by any agreement or modification made between the state and the Secretary of Health, Education and Welfare.\n\"Benefit\" means the allowance paid or payable by the teachers retirement fund association to a surviving spouse, designated beneficiary, surviving child or estate or in periodic payments to a member or former member who is permanently and totally disabled.\n\"Board\" means the board of trustees of the teachers retirement fund association.\n\"Coordinated member\" means any member of the teachers retirement fund association who is covered by any agreement or modification made between the state and the Secretary of Health, Education and Welfare making the provisions of the federal Old Age, Survivors and Disability Insurance Act applicable to certain teachers.\n\"Coordinated service\" means the allowable service credited by the respective teachers retirement fund association for which the member was covered by the coordinated program of the association.\n\"Dependent child\" means any biological or adopted child of a deceased member who has not reached the age of 20 and is dependent on the member for more than one-half of the child's support at the time of the member's death. It also means a child of the member conceived during the member's lifetime and born after the member's death.\n\"Designated beneficiary\" means the person designated by a member or retiree of the teachers retirement fund association to receive the benefits to which a beneficiary is entitled under this chapter. A beneficiary designation is valid only if it is made on an appropriate form provided by the executive director and the properly completed form is received by the fund postmarked on or before the date of death of the retiree or member. If a retiree or member does not designate such a person or if the person designated predeceases the retiree or member, beneficiary in such cases means the estate of the deceased retiree or member.\n\"Disability\" or \"permanent and total disability\" means the inability of a member to engage in any substantial gainful activity by reason of any medically determinable physical or mental impairment which can be expected to be of long continued and indefinite duration which shall in no event be less than one year.\n\"District\" or \"school district\" means the employing school district or the Board of Trustees of the Minnesota State Colleges and Universities.\nFor purposes of section 354A.36, \"medical expert\" means a licensed physician, licensed chiropractor, an APRN, or a licensed psychologist, in each case working within the scope of the individual's professional licensure.\n\"Member\" for purposes of entitlement to annuities or benefits pursuant to sections 354A.31 to 354A.41 and any other applicable provisions of this chapter means every teacher who is engaged in teaching service and who under section 354A.05 contributes to the respective teachers retirement fund association and who has not retired. \"Member\" for purposes of determining who may participate in the organization and governance of the teachers retirement fund association, including the eligibility to elect members of and to serve as a member of the board of trustees, means every teacher who joins and contributes to the respective teachers retirement fund association and any other person designated as a member by the articles of incorporation or the bylaws of the respective teachers retirement fund association.\n(a) \"Normal retirement age\" means age 65 for a person who first became a member of the coordinated program of the St. Paul Teachers Retirement Fund Association or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989. Through June 30, 2025, for a person who first became a member of the coordinated program of the St. Paul Teachers Retirement Fund Association after June 30, 1989, normal retirement age means the higher of age 65 or retirement age, as defined in United States Code, title 42, section 416(l), as amended, but not to exceed age 66. Beginning July 1, 2025, for all members of the coordinated program of the St. Paul Teachers Retirement Fund Association, normal retirement age means age 65.\n(b) For a person who is a member of the basic program of the St. Paul Teachers Retirement Fund Association, normal retirement age means the age at which a teacher becomes eligible for a normal retirement annuity computed upon meeting the age and service requirements specified in the applicable provisions of the articles of incorporation or bylaws of the teachers retirement fund association.\n\"Normal retirement annuity\" means for a coordinated member the retirement annuity computed pursuant to section 354A.31, subdivision 4, and paid or payable to a member upon meeting the age and service requirements specified in section 354A.31, subdivision 5, and for a basic member the retirement annuity computed pursuant to and paid or payable to a member upon meeting the age and service requirements specified in the applicable provisions of the articles of incorporation or bylaws of the respective teachers retirement fund association.\n\"Optional survivors annuity\" means the payments made by the teachers retirement fund association to a survivor of a former member pursuant to an actuarial equivalent optional annuity form established by the applicable board of trustees under section 354A.32 and selected by the member at or before retirement.\n\"Other than normal school operating funds\" means funds other than those generated as proceeds of property tax levies, state school maintenance cost aids distributed in accordance with statute, state aid to distressed school districts, proceeds from federal forest reserve lands, state transportation aids, receipts from tuition paid by persons or other school districts, any rental charges received, and any other moneys appropriated by the legislature.\n\"Program\" means a separate component plan of the teachers retirement fund association providing a specific set of retirement annuities and disability and survivor benefits for a defined portion of the covered membership of the association.\n\"Reduced retirement annuity\" means for a coordinated member the retirement annuity computed pursuant to section 354A.31, subdivision 4, reduced pursuant to section 354A.31, subdivision 6 or 7, and paid or payable to a member upon meeting the minimum age and service requirements specified in section 354A.31, subdivision 1, but prior to meeting the age and service requirements specified in section 354A.31, subdivision 5, and for a basic member the retirement annuity computed pursuant to and paid or payable to a member upon meeting the minimum age and service requirements specified in but prior to meeting the age and service requirements for a normal retirement annuity specified in the applicable provisions of the articles of incorporation or bylaws of the respective teachers retirement fund association.\n(a) \"Retirement\" means the time after the date of cessation of active teaching service by a teacher who is then entitled to an accrued retirement annuity beginning as designated by the board of trustees and payable upon filing a valid application for an annuity with the board. The applicable provisions of law, articles of incorporation and bylaws in effect on the date of cessation of active teaching service thereafter determine the rights of the person.\n(b) For members of the St. Paul Teachers Retirement Fund Association, a right to a retirement annuity requires a complete and continuous separation for 90 days from employment in any form with Independent School District No. 625, including service provided to the school district as an independent contractor or as an employee of an independent contractor.\n\"Retirement annuity\" means the payments made by the teachers retirement fund association to a retired teacher.\n\"Sabbatical leave\" means an authorized leave of absence period during which the member is compensated at a rate of not less than one-third of the salary which the member received during the plan year immediately preceding the granting of the leave.\n(a) Subject to the limitations of section 356.611, \"salary\" or \"covered salary\" means the entire compensation, upon which member contributions are required and made, that is paid to a teacher before deductions for deferred compensation, supplemental retirement plans, or other voluntary salary reduction programs.\n(b) \"Salary\" does not mean:\n(1) lump-sum annual leave payments;\n(2) lump-sum wellness and sick leave payments;\n(3) employer-paid amounts used by an employee toward the cost of insurance coverage, employer-paid fringe benefits, flexible spending accounts, cafeteria plans, health care expense accounts, day care expenses, or any payments in lieu of any employer-paid group insurance coverage, including the difference between single and family rates that may be paid to a member with single coverage, and certain amounts determined by the executive secretary or director to be ineligible;\n(4) any form of payment that is made in lieu of any other employer-paid fringe benefit or expense;\n(5) any form of severance payments;\n(6) workers' compensation payments;\n(7) disability insurance payments, including self-insured disability payments;\n(8) payments to school principals and all other administrators for services that are in addition to the normal work year contract if these additional services are performed on an extended duty day, Saturday, Sunday, holiday, annual leave day, sick leave day, or any other nonduty day;\n(9) payments under section 356.24, subdivision 1, clause (4)(ii); and\n(10) payments made under section 122A.40, subdivision 12, except for payments for sick leave that are accumulated under the provisions of a uniform school district policy that applies equally to all similarly situated persons in the district.\n(c) Amounts provided to an employee by the employer through a grievance proceeding or a legal settlement are salary only if the settlement is reviewed by the executive director and the amounts are determined by the executive director to be consistent with paragraph (a) and prior determinations.\n\"Service\" means all allowable service credited by the teachers retirement fund association, irrespective of whether the member at the time was covered by the basic program or by the coordinated program.\n\"Spouse\" means the person who was legally married to the member immediately prior to the member's death.\n(a) \"Teacher\" means any person who renders service for:\n(1) Independent School District No. 625, St. Paul, as any of the following:\n(i) a full-time employee in a position for which a valid license from the Professional Educator Licensing and Standards Board is required;\n(ii) a part-time employee in a position for which a valid license from the Professional Educator Licensing and Standards Board is required; or\n(iii) a part-time employee in a position for which a valid license from the Professional Educator Licensing and Standards Board is required who also renders other nonteaching services for the school district, unless the board of trustees of the teachers retirement fund association determines that the combined employment is on the whole so substantially dissimilar to teaching service that the service may not be covered by the association;\n(2) the teachers retirement fund association located in the city of St. Paul as an employee; or\n(3) the Minnesota State Colleges and Universities as an employee who has continuing coverage under this chapter through section 354B.211, subdivision 3, paragraph (c).\n(b) The term does not mean any person who renders service in the school district as any of the following:\n(1) an independent contractor or the employee of an independent contractor;\n(2) an employee who is a full-time teacher covered by the Teachers Retirement Association under chapter 354;\n(3) an employee who is exempt from licensure pursuant to section 122A.30; or\n(4) a person who is receiving a retirement annuity from the teachers retirement fund association and is employed after retirement by the school district associated with the retirement fund association.\n\"Teaching service\" means any service as a teacher performed by any person included within the definition of teacher.\n\"Vesting\" or \"vested\" means having entitlement to a nonforfeitable annuity or benefit from the St. Paul Teachers Retirement Fund Association coordinated member program when the teacher has accrued credit for at least three years of allowable service.",
	"repealed": false
}