{
	"id": "572B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/572B.23",
	"title": "572B.23 VACATING AWARD.",
	"text": "(a) Upon motion of a party to the arbitration proceeding, the court shall vacate an award if:\n(1) the award was procured by corruption, fraud, or other undue means;\n(2) there was:\n(A) evident partiality by an arbitrator appointed as a neutral;\n(B) corruption by an arbitrator; or\n(C) misconduct by an arbitrator prejudicing the rights of a party to the arbitration proceeding;\n(3) an arbitrator refused to postpone the hearing upon showing of sufficient cause for postponement, refused to consider evidence material to the controversy, or otherwise conducted the hearing contrary to section 572B.15, so as to prejudice substantially the rights of a party to the arbitration proceeding;\n(4) an arbitrator exceeded the arbitrator's powers;\n(5) there was no agreement to arbitrate, unless the person participated in the arbitration proceeding without raising the objection under section 572B.15, subsection (c), not later than the commencement of the arbitration hearing; or\n(6) the arbitration was conducted without proper notice of the initiation of an arbitration as required in section 572B.09 so as to prejudice substantially the rights of a party to the arbitration proceeding.\n(b) A motion under this section must be filed within 90 days after the movant receives notice of the award in a record pursuant to section 572B.19 or within 90 days after the movant receives notice of an arbitrator's award in a record on a motion to modify or correct an award pursuant to section 572B.20, unless the motion is predicated upon the ground that the award was procured by corruption, fraud, or other undue means, in which case it must be filed within 90 days after such a ground is known or by the exercise of reasonable care should have been known by the movant.\n(c) In vacating an award on a ground other than that set forth in subsection (a)(5), the court may order a rehearing before a new arbitrator. If the award is vacated on the ground stated in subsection (a)(3), (4), or (6), the court may order a rehearing before the arbitrator who made the award or the arbitrator's successor. The arbitrator must render the decision in the rehearing within the same time as that provided in section 572B.19, subsection (b), for an award.\n(d) If a motion to vacate an award is denied and a motion to modify or correct the award is not pending, the court shall confirm the award.",
	"repealed": false
}