{
	"id": "216B.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.16",
	"title": "216B.16 RATE CHANGE; PROCEDURE; HEARING.",
	"text": "Unless the commission otherwise orders, no public utility shall change a rate which has been duly established under this chapter, except upon 60 days' notice to the commission. The notice shall include statements of facts, expert opinions, substantiating documents, and exhibits, supporting the change requested, and state the change proposed to be made in the rates then in force and the time when the modified rates will go into effect. If the filing utility does not have an approved energy conservation improvement plan on file with the department, it shall also include in its notice an energy conservation plan pursuant to section 216B.241. A filing utility subject to rate regulation under section 216B.026 shall reference in its notice the energy conservation improvement plans of the generation and transmission cooperative providing energy conservation improvement programs to members of the filing utility pursuant to section 216B.241. The filing utility shall give written notice, as approved by the commission, of the proposed change to the governing body of each municipality and county in the area affected. All proposed changes shall be shown by filing new schedules or shall be plainly indicated upon schedules on file and in force at the time.\n(a) When a public utility submits a general rate filing, the Office of Administrative Hearings, before conducting a contested case hearing, shall convene a settlement conference including all of the parties for the purpose of encouraging settlement of any or all of the issues in the contested case. If a stipulated settlement is not reached before the contested case hearing, the Office of Administrative Hearings may reconvene the settlement conference during or after completion of the contested case hearing at its discretion or a party's request. The Office of Administrative Hearings or the commission may, upon the request of any party and the public utility, extend the procedural schedule of the contested case in order to permit the parties to engage in settlement discussions. An extension must be for a definite period of time not to exceed 60 days.\n(b) If the applicant and all intervening parties agree to a stipulated settlement of the case or parts of the case, the settlement must be submitted to the commission. The commission shall accept or reject the settlement in its entirety and, at any time until its final order is issued in the case, may require the Office of Administrative Hearings to conduct a contested case hearing. The commission may accept the settlement on finding that to do so is in the public interest and is supported by substantial evidence. If the commission does not accept the settlement, it may issue an order modifying the settlement subject to the approval of the parties. Each party shall have ten days in which to reject the proposed modification. If no party rejects the proposed modification, the commission's order becomes final. If the commission rejects the settlement, or a party rejects the commission's proposed modification, a contested case hearing must be completed.\n(a) Whenever there is filed with the commission a schedule modifying or resulting in a change in any rates then in force as provided in subdivision 1, the commission may suspend the operation of the schedule by filing with the schedule of rates and delivering to the affected utility a statement in writing of its reasons for the suspension at any time before the rates become effective. The suspension shall not be for a longer period than ten months beyond the initial filing date except as provided in this subdivision or subdivision 1a.\n(b) During the suspension the commission shall determine whether all questions of the reasonableness of the rates requested raised by persons deemed interested or by the department can be resolved to the satisfaction of the commission. If the commission finds that all significant issues raised have not been resolved to its satisfaction, or upon petition by ten percent of the affected customers or 250 affected customers, whichever is less, it shall refer the matter to the Office of Administrative Hearings with instructions for a public hearing as a contested case pursuant to chapter 14, except as otherwise provided in this section.\n(c) The commission may order that the issues presented by the proposed rate changes be bifurcated into two separate hearings as follows: (1) determination of the utility's revenue requirements and (2) determination of the rate design. Upon issuance of both administrative law judge reports, the issues shall again be joined for consideration and final determination by the commission.\n(d) All prehearing discovery activities of state agency intervenors shall be consolidated and conducted by the Department of Commerce.\n(e) If the commission does not make a final determination concerning a schedule of rates within ten months after the initial filing date, the schedule shall be deemed to have been approved by the commission; except if:\n(1) an extension of the procedural schedule has been granted under paragraph (f) or subdivision 1a, in which case the schedule of rates is deemed to have been approved by the commission on the last day of the extended period of suspension; or\n(2) a settlement has been submitted to and rejected by the commission and the commission does not make a final determination concerning the schedule of rates, the schedule of rates is deemed to have been approved 60 days after the initial or, if applicable, the extended period of suspension.\n(f) If the commission finds that it has insufficient time during the suspension period to make a final determination of a case involving changes in general rates because of the need to make a final determination of any pending case involving changes in general rates under this section or section 237.075, the commission may extend the suspension period to allow up to a total of 90 additional calendar days to make the final determination. An extension of the suspension period under this paragraph does not alter the setting of interim rates under subdivision 3.\n(g) For the purposes of this section, \"final determination\" means the initial decision of the commission and not any order which may be entered by the commission in response to a petition for rehearing or other further relief. The commission may further suspend rates until it determines all those petitions.\n(a) Notwithstanding any order of suspension of a proposed increase in rates, the commission shall order an interim rate schedule into effect not later than 60 days after the initial filing date. The commission shall order the interim rate schedule ex parte without a public hearing. Notwithstanding the provisions of sections 216.25, 216B.27, and 216B.52, no interim rate schedule ordered by the commission pursuant to this subdivision shall be subject to an application for a rehearing or an appeal to a court until the commission has rendered its final determination.\n(b) Unless the commission finds that exigent circumstances exist, the interim rate schedule shall be calculated using the proposed test year cost of capital, rate base, and expenses, except that it shall include: (1) a rate of return on common equity for the utility equal to that authorized by the commission in the utility's most recent rate proceeding; (2) rate base or expense items the same in nature and kind as those allowed by a currently effective order of the commission in the utility's most recent rate proceeding; and (3) no change in the existing rate design. In the case of a utility which has not been subject to a prior commission determination, the commission shall base the interim rate schedule on its most recent determination concerning a similar utility.\n(c) If, at the time of its final determination, the commission finds that the interim rates are in excess of the rates in the final determination, the commission shall order the utility to refund the excess amount collected under the interim rate schedule, including interest on it which shall be at the rate of interest determined by the commission. The utility shall commence distribution of the refund to its customers within 120 days of the final order, not subject to rehearing or appeal. If, at the time of its final determination, the commission finds that the interim rates are less than the rates in the final determination, the commission shall prescribe a method by which the utility will recover the difference in revenues between the date of the final determination and the date the new rate schedules are put into effect. In addition, when an extension is granted for settlement discussions under subdivision 1a, the commission shall allow the utility to also recover the difference in revenues for a length of time equal to the length of the extension.\n(d) If the public utility fails to make refunds within the period of time prescribed by the commission, the commission shall sue therefor and may recover on behalf of all persons entitled to a refund. In addition to the amount of the refund and interest due, the commission shall be entitled to recover reasonable attorney's fees, court costs and estimated cost of administering the distribution of the refund to persons entitled to it. No suit under this subdivision shall be maintained unless instituted within two years after the end of the period of time prescribed by the commission for repayment of refunds.\n(e) The commission shall not order an interim rate schedule in a general rate case into effect as provided by this subdivision until at least four months after it has made a final determination concerning any previously filed change of the rate schedule or the change has otherwise become effective under subdivision 2, unless:\n(1) the commission finds that a four-month delay would unreasonably burden the utility, its customers, or its shareholders and that an earlier imposition of interim rates is therefore necessary; or\n(2) the utility files a second general rate case at least 12 months after it has filed a previous general rate case for which the commission has extended the suspension period under subdivision 2.\nThe burden of proof to show that the rate change is just and reasonable shall be upon the public utility seeking the change.\nIf, after the hearing, the commission finds the rates to be unjust or unreasonable or discriminatory, the commission shall determine the rates to be charged or applied by the utility for the service in question and shall fix them by order to be served upon the utility. The rates shall thereafter be observed until changed, as provided by this chapter. In no event shall the rates exceed the level of rates requested by the public utility, except that individual rates may be adjusted upward or downward. Rate design changes shall be prospective from the effective date of the new rate schedules approved by the commission.\nThe commission, in the exercise of its powers under this chapter to determine just and reasonable rates for public utilities, shall give due consideration to the public need for adequate, efficient, and reasonable service and to the need of the public utility for revenue sufficient to enable it to meet the cost of furnishing the service, including adequate provision for depreciation of its utility property used and useful in rendering service to the public, and to earn a fair and reasonable return upon the investment in such property. In determining the rate base upon which the utility is to be allowed to earn a fair rate of return, the commission shall give due consideration to evidence of the cost of the property when first devoted to public use, to prudent acquisition cost to the public utility less appropriate depreciation on each, to construction work in progress, to offsets in the nature of capital provided by sources other than the investors, and to other expenses of a capital nature. For purposes of determining rate base, the commission shall consider the original cost of utility property included in the base and shall make no allowance for its estimated current replacement value. If the commission orders a generating facility to terminate its operations before the end of the facility's physical life in order to comply with a specific state or federal energy statute or policy, the commission may allow the public utility to recover any positive net book value of the facility as determined by the commission.\nTo the extent that construction work in progress is included in the rate base, the commission shall determine in its discretion whether and to what extent the income used in determining the actual return on the public utility property shall include an allowance for funds used during construction, considering the following factors:\n(1) the magnitude of the construction work in progress as a percentage of the net investment rate base;\n(2) the impact on cash flow and the utility's capital costs;\n(3) the effect on consumer rates;\n(4) whether it confers a present benefit upon an identifiable class or classes of customers; and\n(5) whether it is of a short-term nature or will be imminently useful in the provision of utility service.\n(a) Except as otherwise provided in this subdivision, all investments and expenses of a public utility as defined in section 216B.241, subdivision 1, paragraph (h), incurred in connection with energy conservation improvements shall be recognized and included by the commission in the determination of just and reasonable rates as if the investments and expenses were directly made or incurred by the utility in furnishing utility service.\n(b) The commission shall not include investments and expenses for energy conservation improvements in determining (i) just and reasonable electric rates for retail electric service provided to large customer facilities whose electric utilities have been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (b), with respect to those large customer facilities; or (ii) just and reasonable gas rates for large energy facilities, large customer facilities whose natural gas utilities have been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (b), or commercial gas customer facilities whose natural gas utilities have been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (c).\n(c) The commission may permit a public utility to file rate schedules providing for annual recovery of the costs of energy conservation improvements. These rate schedules may be applicable to less than all the customers in a class of retail customers if necessary to reflect the requirements of section 216B.241. The commission shall allow a public utility, without requiring a general rate filing under this section, to reduce the electric rates applicable to large customer facilities that have been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (b), and to reduce the gas rate applicable to a large energy facility, a large customer facility or commercial customer facility that has been exempted by the commissioner under section 216B.241, subdivision 1a, paragraph (b) or (c), or by the commission under section 216B.241, subdivision 2, by an amount that reflects the elimination of energy conservation improvement investments or expenditures for those facilities. In the event that the commission has set electric or gas rates based on the use of an accounting methodology that results in the cost of conservation improvements being recovered from utility customers over a period of years, the rate reduction may occur in a series of steps to coincide with the recovery of balances due to the utility for conservation improvements made by the utility on or before December 31, 2007.\n(d) Investments and expenses of a public utility shall not include electric utility infrastructure costs as defined in section 216B.1636, subdivision 1, paragraph (b).\n(a) The commission may order public utilities to develop and submit for commission approval incentive plans that describe the method of recovery and accounting for utility conservation and efficient fuel-switching expenditures and savings. For public utilities that provide electric service, the commission must develop and implement incentive plans designed to promote energy conservation separately from the plans designed to promote efficient fuel-switching. In developing the incentive plans the commission shall ensure the effective involvement of interested parties.\n(b) In approving incentive plans, the commission shall consider:\n(1) whether the plan is likely to increase utility investment in cost-effective energy conservation or efficient fuel switching;\n(2) whether the plan is compatible with the interest of utility ratepayers and other interested parties;\n(3) whether the plan links the incentive to the utility's performance in achieving cost-effective conservation or efficient fuel switching;\n(4) whether the plan is in conflict with other provisions of this chapter;\n(5) whether the plan conflicts with other provisions of this chapter; and\n(6) the likely financial impacts of the conservation and efficient fuel-switching programs on the utility.\n(c) The commission may set rates to encourage the vigorous and effective implementation of utility conservation and efficient fuel-switching programs. The commission may:\n(1) increase or decrease any otherwise allowed rate of return on net investment based upon the utility's skill, efforts, and success in improving the efficient use of energy through energy conservation or efficient fuel switching;\n(2) share between ratepayers and utilities the net savings resulting from energy conservation and efficient fuel-switching programs to the extent justified by the utility's skill, efforts, and success in improving the efficient use of energy; and\n(3) adopt any mechanism that satisfies the criteria of this subdivision, such that implementation of cost-effective conservation or efficient fuel switching is a preferred resource choice for the public utility considering the impact of conservation or efficient fuel switching on earnings of the public utility.\n(d) Any incentives offered to electric utilities under this subdivision for efficient-fuel switching projects expire December 31, 2032.\nAn owner of a wind energy conversion facility which is required to pay property taxes under section 272.02, subdivision 22, or production taxes under section 272.029, and any related or successor provisions, or a public utility regulated by the Public Utilities Commission which purchases the wind-generated electricity may petition the commission to include in any power purchase agreement between the owner of the facility and the public utility the amount of property taxes and production taxes paid by the owner of the facility. The Public Utilities Commission shall require the public utility to amend the power purchase agreement to include the property taxes and production taxes paid by the owner of the facility in the price paid by the utility for wind-generated electricity if the commission finds:\n(1) the owner of the facility has paid the property taxes or production taxes required by this subdivision;\n(2) the power purchase agreement between the public utility and the owner does not already require the utility to pay the amount of property taxes or production taxes the owner has paid under this subdivision or, in the case of a power purchase agreement entered into prior to 1997, the amount of property or production taxes paid by the owner in any year of the power purchase agreement exceeds the amount of such property or production taxes included in the price paid by the utility to the owner, as reflected in the owner's bid documents; and\n(3) the commission has approved a rate schedule containing provisions for the automatic adjustment of charges for utility service in direct relation to the charges ordered by the commission under section 272.02, subdivision 22, or 272.029.\nNotwithstanding any other provision of this chapter, the commission may permit a public utility to file rate schedules containing provisions for the automatic adjustment of charges for public utility service in direct relation to changes in:\n(1) federally regulated wholesale rates for energy delivered through interstate facilities;\n(2) direct costs for natural gas delivered;\n(3) costs for fuel used in generation of electricity or the manufacture of gas; or\n(4) prudent costs incurred by a public utility for sorbents, reagents, or chemicals used to control emissions from an electric generation facility, provided that these costs are not recovered elsewhere in rates. The utility must track and report annually the volumes and costs of sorbents, reagents, or chemicals using separate accounts by generating plant.\nThe commission may permit a public utility to file rate schedules providing for annual adjustments reflecting rewards or penalties provided for in performance-based gas purchasing plans approved by the commission under section 216B.167.\n(a) Notwithstanding any other provision of this chapter, the commission may approve a tariff mechanism for the automatic annual adjustment of charges for the Minnesota jurisdictional costs net of associated revenues of:\n(1) new transmission facilities that have been separately filed and reviewed and approved by the commission under section 216B.243 or new transmission or distribution facilities that are certified as a priority project or deemed to be a priority transmission project under section 216B.2425;\n(2) new transmission facilities approved by the regulatory commission of the state in which the new transmission facilities are to be constructed, to the extent approval is required by the laws of that state, and determined by the Midcontinent Independent System Operator to benefit the utility or integrated transmission system; and\n(3) charges incurred by a utility under a federally approved tariff that accrue from other transmission owners' regionally planned transmission projects that have been determined by the Midcontinent Independent System Operator to benefit the utility or integrated transmission system.\n(b) Upon filing by a public utility or utilities providing transmission service, the commission may approve, reject, or modify, after notice and comment, a tariff that:\n(1) allows the utility to recover on a timely basis the costs net of revenues of facilities approved under section 216B.243 or certified or deemed to be certified under section 216B.2425 or exempt from the requirements of section 216B.243;\n(2) allows the utility to recover charges incurred under a federally approved tariff that accrue from other transmission owners' regionally planned transmission projects that have been determined by the Midcontinent Independent System Operator to benefit the utility or integrated transmission system. These charges must be reduced or offset by revenues received by the utility and by amounts the utility charges to other regional transmission owners, to the extent those revenues and charges have not been otherwise offset;\n(3) allows the utility to recover on a timely basis the costs net of revenues of facilities approved by the regulatory commission of the state in which the new transmission facilities are to be constructed and determined by the Midcontinent Independent System Operator to benefit the utility or integrated transmission system;\n(4) allows the utility to recover costs associated with distribution planning required under section 216B.2425;\n(5) allows the utility to recover costs associated with investments in distribution facilities to modernize the utility's grid that have been certified by the commission under section 216B.2425;\n(6) allows a return on investment at the level approved in the utility's last general rate case, unless a different return is found to be consistent with the public interest;\n(7) provides a current return on construction work in progress, provided that recovery from Minnesota retail customers for the allowance for funds used during construction is not sought through any other mechanism;\n(8) allows for recovery of other expenses if shown to promote a least-cost project option or is otherwise in the public interest;\n(9) allocates project costs appropriately between wholesale and retail customers;\n(10) provides a mechanism for recovery above cost, if necessary to improve the overall economics of the project or projects or is otherwise in the public interest; and\n(11) terminates recovery once costs have been fully recovered or have otherwise been reflected in the utility's general rates.\n(c) A public utility may file annual rate adjustments to be applied to customer bills paid under the tariff approved in paragraph (b). In its filing, the public utility shall provide:\n(1) a description of and context for the facilities included for recovery;\n(2) a schedule for implementation of applicable projects;\n(3) the utility's costs for these projects;\n(4) a description of the utility's efforts to ensure the lowest costs to ratepayers for the project; and\n(5) calculations to establish that the rate adjustment is consistent with the terms of the tariff established in paragraph (b).\n(d) Upon receiving a filing for a rate adjustment pursuant to the tariff established in paragraph (b), the commission shall approve the annual rate adjustments provided that, after notice and comment, the costs included for recovery through the tariff were or are expected to be prudently incurred and achieve transmission system improvements at the lowest feasible and prudent cost to ratepayers.\n(a) Public utility owners of transmission facilities may, subject to Public Utilities Commission approval, transfer operational control or ownership of those transmission assets to a transmission company subject to Federal Energy Regulatory Commission jurisdiction. For transmission asset transfers by a public utility, the Public Utilities Commission must review the request to transfer either in the context of a general rate case under this section or by initiating other proceedings it determines provide adequate review of the transmission asset transfer. The Public Utilities Commission may limit, in whole or in part, the transfer of transmission assets or the timing of those transfers by a public utility if it finds the limitation in the public interest. The commission may only approve a transfer if it finds that the transfer is consistent with the public interest. In assessing the public interest, the commission shall evaluate, among other things, whether the transfer:\n(1) facilitates the development of transmission infrastructure necessary to ensure reliability, encourages the development of renewable resources, and accommodates energy transfers within and between states;\n(2) protects Minnesota ratepayers against the subsidization of wholesale transactions through retail rates;\n(3) ensures, in the case of operational control of transmission assets, that the state retains jurisdiction over the transferring utility for all aspects of service under this chapter;\n(4) impacts Minnesota retail rates; and\n(5) protects Minnesota ratepayers from paying capital costs for transmission assets that have already been recovered.\n(b) A transfer of operational control or ownership of transmission assets by a public utility under this subdivision is subject to section 216B.50. The relationship between a public utility transferring operational control of transmission assets to another entity under this subdivision is subject to the provisions of section 216B.48. If a public utility transfers ownership of its transmission assets to a transmission provider subject to the jurisdiction of the Federal Energy Regulatory Commission, the Public Utilities Commission may permit the utility to file a rate schedule providing for the automatic adjustment of charges to recover the cost of transmission services purchased under tariff rates approved by the Federal Energy Regulatory Commission.\n(c) A municipal utility, a municipal power agency, or a joint venture pursuant to section 452.25 may transfer operational control or ownership of transmission assets to a transmission company, or make investments in a transmission company, if the governing body of the municipal utility, municipal power agency, or joint venture finds that the transfer or investment is consistent with the public interest and will facilitate the development of infrastructure necessary to ensure reliability.\n(a) The Central Corridor utility zone is the area extending from the Union Depot Station in St. Paul to the proposed multimodal station in Minneapolis along the route of the light rail transit project connecting those two points, and an area extending approximately one-quarter mile from that route and including the entire University of Minnesota, Minneapolis campus.\n(b) A public utility that provides retail electric service within the Central Corridor utility zone and that is required to replace, relocate, construct, or install new facilities, may apply to the commission for approval of new facilities in the Central Corridor utility zone and facilities outside the zone that the utility demonstrates must be changed as a direct result of changes within the zone. Facilities proposed under this subdivision may include transmission facilities, distribution facilities, generation facilities, advanced technology-assisted efficiency devices, and energy storage facilities not otherwise subject to section 216B.243, or chapter 216E, 216F, or 216G. Upon approval under paragraph (c), the utility may construct and install the facilities.\n(c) The commission may approve the construction and installation of facilities in the Central Corridor mass transit utility zone proposed by a utility under paragraph (b) upon a finding:\n(1) that the facilities:\n(i) are necessary to provide electric service;\n(ii) assist future development of renewable energy, conservation, electric vehicles, and advanced technology-assisted efficiency programs and devices; or\n(iii) are exploratory, experimental, or research facilities to advance the use of renewable energy, conservation, electric vehicles, and advanced technology-assisted efficiency programs and devices;\n(2) that the utility has engaged in a cooperative process with affected local and state government agencies in the design, planning, or construction of the Central Corridor utility zone project and changes to utility facilities;\n(3) that the utility and local units of government have made reasonable efforts to seek federal, state, or private funds that may be available to mass transit and energy projects;\n(4) that the utility has made reasonable efforts to minimize the project costs and maximize the value of the facilities to customers;\n(5) that the utility has a plan to offer a comprehensive array of programs for residential, commercial, and industrial customers located within the mass transit zone;\n(6) that the utility directs existing and planned solar energy programs to develop solar energy along the mass transit utility zone; and\n(7) that the utility has made reasonable efforts to apply for federal funds to develop technology-assisted efficiency programs and devices within the mass transit utility zone.\n(d) Upon request of the commission, the utility shall submit periodic reports to the commission reviewing the cost and benefits of the facilities constructed within the Central Corridor utility zone and their potential applicability to other areas outside the Central Corridor utility zone.\n(e) Notwithstanding any other provision of this chapter, the commission may approve a tariff mechanism for automatic adjustment of charges for new, replaced, or relocated facilities installed under this subdivision in a manner consistent with this subdivision and the standards and procedures contained in subdivision 7b, except that no approval under section 216B.243 or certification under section 216B.2425 is required unless otherwise required by law. This section does not authorize a city-requested facilities surcharge.\n(f) For the purpose of this subdivision, \"technology-assisted efficiency programs and devices\" includes, but is not limited to, infrastructure that integrates digital information and controls technology to improve the reliability, security, and efficiency of the electric grid.\n(a) A public utility may petition the commission under this section to recover costs associated with implementing an energy storage system pilot project. As part of the petition, the public utility must submit a report to the commission containing, at a minimum, the following information regarding the proposed energy storage system pilot project:\n(1) the storage technology utilized;\n(2) the energy storage capacity and the duration of output at that capacity;\n(3) the proposed location;\n(4) the purchase and installation costs;\n(5) how the project will interact with existing distributed generation resources on the utility's grid; and\n(6) the goals the project proposes to achieve, which may include controlling frequency or voltage, mitigating transmission congestion, providing emergency power supplies during outages, reducing curtailment of existing renewable energy generators, and reducing peak power costs.\n(b) A utility may petition the commission to approve a rate schedule that provides for the automatic adjustment of charges to recover prudently incurred investments, expenses, or costs associated with energy storage system pilot projects approved by the commission under this subdivision. A petition filed under this subdivision must include the elements listed in section 216B.1645, subdivision 2a, paragraph (b), clauses (1) to (4), and must describe the benefits of the pilot project.\n(c) The commission may approve, or approve as modified, a rate schedule filed under this subdivision. The rate schedule filed by the public utility may include the elements listed in section 216B.1645, subdivision 2a, paragraph (a), clauses (1) to (5).\n(d) For each pilot project that the commission has found is in the public interest, the commission must make its determination on the specific amounts that are eligible for recovery under the approved rate schedule within 90 days of final approval of the specific pilot program or within 90 days of the public utility filing for approval of cost recovery for the specific pilot program, whichever is later.\n(e) Nothing in this subdivision prohibits or deters the deployment of energy storage systems.\n(f) For the purposes of this subdivision:\n(1) \"energy storage system\" has the meaning given in section 216B.2422, subdivision 1; and\n(2) \"pilot project\" means a project that is (i) owned, operated, and controlled by a public utility to optimize safe and reliable system operations, and (ii) deployed at a limited number of locations in order to assess the technical and economic effectiveness of its operations.\n(a) The commission shall disapprove the portion of any rate which makes an allowance directly or indirectly for expenses incurred by a public utility to provide a public advertisement which:\n(1) is designed to influence or has the effect of influencing public attitudes toward legislation or proposed legislation, or toward a rule, proposed rule, authorization or proposed authorization of the Public Utilities Commission or other agency of government responsible for regulating a public utility;\n(2) is designed to justify or otherwise support or defend a rate, proposed rate, practice or proposed practice of a public utility;\n(3) is designed primarily to promote consumption of the services of the utility;\n(4) is designed primarily to promote good will for the public utility or improve the utility's public image; or\n(5) is designed to promote the use of nuclear power or to promote a nuclear waste storage facility.\n(b) The commission may approve a rate which makes an allowance for expenses incurred by a public utility to disseminate information which:\n(1) is designed to encourage efficient use of energy supplies;\n(2) is designed to promote safety; or\n(3) is designed to inform and educate customers as to financial services made available to them by the public utility.\n(c) The commission shall not withhold approval of a rate because it makes an allowance for expenses incurred by the utility to disseminate information about corporate affairs to its owners.\nThe commission shall allow as operating expenses only those charitable contributions that the commission deems prudent and that qualify under section 300.66, subdivision 3. Only 50 percent of the qualified contributions are allowed as operating expenses.\n(a) A nonprofit organization or an individual granted formal intervenor status by the commission is eligible to receive compensation.\n(b) The commission may order a utility to compensate all or part of an eligible intervenor's reasonable costs of participation in a general rate case that comes before the commission when the commission finds that the intervenor has materially assisted the commission's deliberation and when a lack of compensation would present financial hardship to the intervenor. Compensation may not exceed $50,000 for a single intervenor in any proceeding. For the purpose of this subdivision, \"materially assisted\" means that the intervenor's participation and presentation was useful and seriously considered, or otherwise substantially contributed to the commission's deliberations in the proceeding.\n(c) In determining whether an intervenor has materially assisted the commission's deliberation, the commission must consider, among other factors, whether:\n(1) the intervenor represented an interest that would not otherwise have been adequately represented;\n(2) the evidence or arguments presented or the positions taken by the intervenor were an important factor in producing a fair decision;\n(3) the intervenor's position promoted a public purpose or policy;\n(4) the evidence presented, arguments made, issues raised, or positions taken by the intervenor would not have been a part of the record without the intervenor's participation; and\n(5) the administrative law judge or the commission adopted, in whole or in part, a position advocated by the intervenor.\n(d) In determining whether the absence of compensation would present financial hardship to the intervenor, the commission must consider:\n(1) whether the costs presented in the intervenor's claim reflect reasonable fees for attorneys and expert witnesses and other reasonable costs; and\n(2) the ratio between the costs of intervention and the intervenor's unrestricted funds.\n(e) An intervenor seeking compensation must file a request and an affidavit of service with the commission, and serve a copy of the request on each party to the proceeding. The request must be filed 30 days after the later of (1) the expiration of the period within which a petition for rehearing, amendment, vacation, reconsideration, or reargument must be filed or (2) the date the commission issues an order following rehearing, amendment, vacation, reconsideration, or reargument.\n(f) The compensation request must include:\n(1) the name and address of the intervenor or representative of the nonprofit organization the intervenor is representing;\n(2) proof of the organization's nonprofit, tax-exempt status;\n(3) the name and docket number of the proceeding for which compensation is requested;\n(4) a list of actual annual revenues and expenses of the organization the intervenor is representing for the preceding year and projected revenues, revenue sources, and expenses for the current year;\n(5) the organization's balance sheet for the preceding year and a current monthly balance sheet;\n(6) an itemization of intervenor costs and the total compensation request; and\n(7) a narrative explaining why additional organizational funds cannot be devoted to the intervention.\n(g) Within 30 days after service of the request for compensation, a party may file a response, together with an affidavit of service, with the commission. A copy of the response must be served on the intervenor and all other parties to the proceeding.\n(h) Within 15 days after the response is filed, the intervenor may file a reply with the commission. A copy of the reply and an affidavit of service must be served on all other parties to the proceeding.\n(i) If additional costs are incurred as a result of additional proceedings following the commission's initial order, the intervenor may file an amended request within 30 days after the commission issues an amended order. Paragraphs (e) to (h) apply to an amended request.\n(j) The commission must issue a decision on intervenor compensation within 60 days of a filing by an intervenor.\n(k) A party may request reconsideration of the commission's compensation decision within 30 days of the decision.\n(l) If the commission issues an order requiring payment of intervenor compensation, the utility that was the subject of the proceeding must pay the compensation to the intervenor, and file with the commission proof of payment, within 30 days after the later of (1) the expiration of the period within which a petition for reconsideration of the commission's compensation decision must be filed or (2) the date the commission issues an order following reconsideration of its order on intervenor compensation.\n(m) The implementation and enforcement of this subdivision is suspended while section 216B.631 is effective.\nAll costs of a public utility that are necessary to comply with state pipeline safety programs under sections 216D.01 to 216D.07, 299F.56 to 299F.64, or 299J.01 to 299J.17 must be recognized and included by the commission in the determination of just and reasonable rates as if the costs were directly incurred by the utility in furnishing utility service.\n(a) A municipality may file with the commission a resolution of its governing body requesting exemption from the provisions of this section for a public utility that is under a franchise with the municipality to supply natural, manufactured, or mixed gas and that serves 650 or fewer customers in the municipality as long as the public utility serves no more than a total of 5,000 customers.\n(b) The commission shall grant an exemption from this section for that portion of a public utility's business that is requested by each municipality it serves. Furthermore, the commission shall also grant the public utility an exemption from this section for any service provided outside of a municipality's border that is considered by the commission to be incidental. The public utility shall file with the commission and the department all initial and subsequent changes in rates, tariffs, and contracts for service outside the municipality at least 30 days in advance of implementation.\n(c) However, the commission shall require the utility to adopt the commission's policies and procedures governing disconnection during cold weather. The utility shall annually submit a copy of its municipally approved rates to the commission.\n(d) In all cases covered by this subdivision in which an exemption for service outside of a municipality is granted, the commission may initiate an investigation under section 216B.17, on its own motion or upon complaint from a customer.\n(e) If a municipality files with the commission a resolution of its governing body rescinding the request for exemption, the commission shall regulate the public utility's business in that municipality under this section.\n(a) An electric utility, operating as such in a bordering state and having fewer than 200 customers in Minnesota, is exempt from this section if the utility:\n(1) charges Minnesota customers the same rates as those charged to customers in the bordering state;\n(2) provides 60-day notice to the commission of rate increases for its Minnesota customers;\n(3) provides individual, written notice of rate increases to its Minnesota customers;\n(4) provides the commission with schedules of rates and tariffs charged in the bordering state and revenues by class under the former and proposed rates; and\n(5) maintains an up-to-date tariff book with the department.\n(b) The commission may initiate an investigation under section 216B.17, on its own motion or upon customer complaint with respect to the utility's rates and practices in Minnesota.\nThe commission may allow a public utility to recover from ratepayers the reasonable expenses incurred: (1) for economic and community development; and (2) to employ local workers, as defined in section 216B.2422, subdivision 1, to construct and maintain generation facilities that supply power to the public utility's customers.\nA public utility shall fund an affordability program for low-income customers at a base annual funding level of $8,000,000. The annual funding level shall increase in the calendar years subsequent to each commission approval of a rate increase for the public utility's residential customers by the same percentage as the approved residential rate increase. Costs for the program shall be included in the utility's base rate. For the purposes of this subdivision, \"low-income\" describes a customer who is receiving assistance from the federal low-income home energy assistance program. The affordability program must be designed to target participating customers with the lowest incomes and highest energy costs in order to lower the percentage of income they devote to energy bills, increase their payments, lower utility service disconnections, and decrease costs associated with collection activities on their accounts. For low-income customers who are 62 years of age or older or disabled, the program must include a $15 discount in each billing period. For the purposes of this subdivision, \"public utility\" includes only those public utilities with more than 200,000 residential electric service customers. The commission may issue orders necessary to implement, administer, and recover the costs of the program on a timely basis.\n(a) The commission must consider ability to pay as a factor in setting utility rates and may establish affordability programs for low-income residential ratepayers in order to ensure affordable, reliable, and continuous service to low-income utility customers. A public utility serving low-income residential ratepayers who use natural gas for heating must file an affordability program with the commission. For purposes of this subdivision, \"low-income residential ratepayers\" means ratepayers who receive energy assistance from the low-income home energy assistance program (LIHEAP).\n(b) Any affordability program the commission orders a utility to implement must:\n(1) lower the percentage of income that participating low-income households devote to energy bills;\n(2) increase participating customer payments over time by increasing the frequency of payments;\n(3) decrease or eliminate participating customer arrears;\n(4) lower the utility costs associated with customer account collection activities; and\n(5) coordinate the program with other available low-income bill payment assistance and conservation resources.\n(c) In ordering affordability programs, the commission may require public utilities to file program evaluations that measure the effect of the affordability program on:\n(1) the percentage of income that participating households devote to energy bills;\n(2) service disconnections; and\n(3) frequency of customer payments, utility collection costs, arrearages, and bad debt.\n(d) The commission must issue orders necessary to implement, administer, and evaluate affordability programs, and to allow a utility to recover program costs, including administrative costs, on a timely basis. The commission may not allow a utility to recover administrative costs, excluding start-up costs, in excess of five percent of total program costs, or program evaluation costs in excess of two percent of total program costs. The commission must permit deferred accounting, with carrying costs, for recovery of program costs incurred during the period between general rate cases.\n(e) Public utilities may use information collected or created for the purpose of administering energy assistance to administer affordability programs.\nA public utility providing natural gas services that has a performance regulation plan approved pursuant to section 216B.1675 shall file tariff provisions incorporating the provisions of that plan. Changes in the cost recovery of natural gas supplies must not be included within the plan.\n(a) The commission may not allow as operating expenses a public utility's travel, entertainment, and related employee expenses that the commission deems unreasonable and unnecessary for the provision of utility service. In order to assist the commission in evaluating the travel, entertainment, and related employee expenses that may be allowed for ratemaking purposes, a public utility filing a general rate case petition shall include a schedule separately itemizing all travel, entertainment, and related employee expenses as specified by the commission, including but not limited to the following categories:\n(1) travel and lodging expenses;\n(2) food and beverage expenses;\n(3) recreational and entertainment expenses;\n(4) board of director-related expenses, including and separately itemizing all compensation and expense reimbursements;\n(5) expenses for the ten highest paid officers and employees, including and separately itemizing all compensation and expense reimbursements;\n(6) dues and expenses for memberships in organizations or clubs;\n(7) gift expenses;\n(8) expenses related to owned, leased, or chartered aircraft; and\n(9) lobbying expenses.\n(b) To comply with the requirements of paragraph (a), each applicable expense incurred in the most recently completed fiscal year must be itemized separately, and each itemization must include the date of the expense, the amount of the expense, the vendor name, and the business purpose of the expense. The separate itemization required by this paragraph may be provided using standard accounting reports already utilized by the utility involved in the rate case, in a written format or an electronic format that is acceptable to the commission. For expenses identified in response to paragraph (a), clauses (1) and (2), the utility shall disclose the total amounts for each expense category and provide separate itemization for those expenses incurred by or on behalf of any employee at the level of vice president or higher and for board members. The petitioning utility shall also provide a one-page summary of the total amounts for each expense category included in the petitioning utility's proposed test year.\n(c) Except as otherwise provided in this paragraph, data submitted to the commission under paragraph (a) are public data. The commission or an administrative law judge assigned to the case may treat the salary of one or more of the ten highest paid officers and employees, other than the five highest paid, as private data on individuals as defined in section 13.02, subdivision 12, or issue a protective order governing release of the salary, if the utility establishes that the competitive disadvantage to the utility that would result from release of the salary outweighs the public interest in access to the data. Access to the data by a government entity that is a party to the rate case must not be restricted.\nThe commission may not allow a public utility to recover from ratepayers expenses resulting from a contribution or expenditure incurred to promote or defeat a candidate for public office or to advocate approval or defeat of a ballot question. This subdivision does not prohibit a public utility from engaging in political activity or making a contribution or expenditure otherwise permitted by law.\n(a) A public utility may propose, and the commission may approve, approve as modified, or reject, a multiyear rate plan as provided in this subdivision. The term \"multiyear rate plan\" refers to a plan establishing the rates the utility may charge for each year of the specified period of years, which cannot exceed five years, to be covered by the plan. A utility proposing a multiyear rate plan shall provide a general description of the utility's major planned investments over the plan period. The commission may also require the utility to provide a set of reasonable performance measures and incentives that are quantifiable, verifiable, and consistent with state energy policies. The commission may allow the utility to adjust recovery of its cost of capital or other costs in a reasonable manner within the plan period. The utility may propose:\n(1) recovery of the utility's forecasted rate base, based on a formula, a budget forecast, or a fixed escalation rate, individually or in combination. The forecasted rate base must include the utility's planned capital investments and investment-related costs, including income tax impacts, depreciation, and property taxes, as well as forecasted capacity-related costs from purchased power agreements that are not recovered through subdivision 7;\n(2) recovery of operations and maintenance expenses, based on an electricity-related price index or other formula;\n(3) tariffs that expand the products and services available to customers, including, but not limited to, an affordability rate for low-income residential customers; and\n(4) adjustments to the rates approved under the multiyear plan for rate changes that the commission determines to be just and reasonable, including, but not limited to, changes in the utility's cost of operating its nuclear facilities, or other significant investments not addressed in the plan.\n(b) A utility that has filed a petition with the commission to approve a multiyear rate plan may request to be allowed to implement interim rates for the first and second years of the multiyear plan. If the commission approves the request, interim rates shall be implemented in the same manner as allowed under subdivision 3.\n(c) The commission may approve a multiyear rate plan only if it finds that the plan establishes just and reasonable rates for the utility, applying the factors described in subdivision 6. Consistent with subdivision 4, the burden of proof to demonstrate that the multiyear rate plan is just and reasonable is on the public utility proposing the plan.\n(d) Rates charged under the multiyear rate plan must be based only upon the utility's reasonable and prudent costs of service over the term of the plan, as determined by the commission, provided that the costs are not being recovered elsewhere in rates. Rate adjustments authorized under subdivisions 6b and 7 may continue outside of a plan authorized under this subdivision.\n(e) The commission may, by order, establish terms, conditions, and procedures for a multiyear rate plan necessary to implement this section and ensure that rates remain just and reasonable during the course of the plan, including terms and procedures for rate adjustment. At any time prior to conclusion of a multiyear rate plan, the commission, upon its own motion or upon petition of any party, has the discretion to examine the reasonableness of the utility's rates under the plan, and adjust rates as necessary.\n(f) In reviewing a multiyear rate plan proposed in a general rate case under this section, the commission may extend the time requirements for issuance of a final determination prescribed in this section by an additional 90 days beyond its existing authority under subdivision 2, paragraph (f).\n(g) A utility may not file a multiyear rate plan that would establish rates under the terms of the plan until after May 31, 2012.\n(h) The commission may initiate a proceeding to determine a set of performance measures that can be used to assess a utility operating under a multiyear rate plan.",
	"repealed": false
}