{
	"id": "62A.3097",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3097",
	"title": "62A.3097 PEDIATRIC AUTOIMMUNE NEUROPSYCHIATRIC DISORDERS ASSOCIATED WITH STREPTOCOCCAL INFECTIONS (PANDAS) AND PEDIATRIC ACUTE-ONSET NEUROPSYCHIATRIC SYNDROME (PANS) TREATMENT; COVERAGE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Pediatric acute-onset neuropsychiatric syndrome\" means a class of acute-onset obsessive compulsive or tic disorders or other behavioral changes presenting in children and adolescents that are not otherwise explained by another known neurologic or medical disorder.\n(c) \"Pediatric autoimmune neuropsychiatric disorders associated with streptococcal infections\" means a condition in which a streptococcal infection in a child or adolescent causes the abrupt onset of clinically significant obsessions, compulsions, tics, or other neuropsychiatric symptoms or behavioral changes, or a relapsing and remitting course of symptom severity.\nThis section applies to all health plans that provide coverage to Minnesota residents.\nEvery health plan included in subdivision 2 must provide coverage for treatment for pediatric autoimmune neuropsychiatric disorders associated with streptococcal infections (PANDAS) and for treatment for pediatric acute-onset neuropsychiatric syndrome (PANS). Treatments that must be covered under this section must be recommended by the insured's licensed health care professional and include but are not limited to antibiotics, medication and behavioral therapies to manage neuropsychiatric symptoms, plasma exchange, and immunoglobulin.\nThe commissioner of commerce shall reimburse health carriers for coverage under this section. Reimbursement is available only for coverage that would not have been provided by the health carrier without the requirements of this section. Each fiscal year an amount necessary to make payments to health carriers to defray the cost of providing coverage under this section is appropriated to the commissioner of commerce. Health carriers shall report to the commissioner quantified costs attributable to the additional benefit under this section in a format developed by the commissioner. The commissioner shall evaluate submissions and make payments to health carriers as provided in Code of Federal Regulations, title 45, section 155.170.",
	"repealed": false
}