{
	"id": "299F.631",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.631",
	"title": "299F.631 INSPECTION FEE; ASSESSMENT, RULES.",
	"text": "From each pipeline operator subject to the intrastate pipeline inspection authority under sections 299F.56 to 299F.641, the commissioner shall assess and collect an inspection fee in an amount calculated under subdivisions 2 and 4. The assessment of the inspection fee must be made no fewer than 30 days after the end of the quarter. If an operator does not pay the fee within 60 days after the assessment was mailed, the commissioner may impose a delinquency fee of ten percent of the quarterly inspection fee and interest at the rate of 15 percent per year on the portion of the fee not paid. Fees collected under this section must be credited to the pipeline safety account.\n(a) For each quarter that an inspection fee is to be assessed, the commissioner shall calculate the total actual expenses and obligations incurred by the Office of Pipeline Safety in implementing sections 299F.56 to 299F.641. The calculation must not include:\n(1) expenses that will be reimbursed by the federal government;\n(2) expenses attributable to follow-up inspections necessitated by the failure of a pipeline facility to comply with safety standards;\n(3) expenses attributable to investigations of specific pipeline facilities;\n(4) expenses attributable to inspections of newly constructed pipelines over 2,000 feet in length;\n(5) expenses attributable to the inspection of facilities carrying liquefied natural gas, and hazardous liquids;\n(6) expenses attributable to the inspection of facilities carrying liquefied petroleum gas, until the commissioner adopts a rule providing for metered billing of these facilities; and\n(7) expenses attributable to seeking and maintaining federal interstate agent status.\n(b) The commissioner shall assess each pipeline operator for a pro rata share of the expenses and obligations calculated under paragraph (a), based on the number of meters in service on the preceding December 31.\n(c) The expenses and obligations described in paragraph (a), clauses (2), (3), (4), and (5), must be directly charged to the appropriate pipeline operators on a quarterly basis. The expenses and obligations described in paragraph (a), clause (6), must be directly charged to the appropriate pipeline operators on a quarterly basis until the commissioner adopts a rule providing for metered billing of facilities carrying liquefied petroleum gas.\nThe commissioner shall adopt rules to implement this section.\nThe commissioner shall calculate the general support costs of the Office of Pipeline Safety for the preceding quarter, and add to the inspection fee calculated under subdivision 2 the share of those costs that is proportionate to the amount of time spent by the office in implementing sections 299F.56 to 299F.641 with respect to that type of pipeline facility.",
	"repealed": false
}