{
	"id": "149A.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.72",
	"title": "149A.72 FUNERAL INDUSTRY PRACTICES; MISREPRESENTATIONS.",
	"text": "In selling or offering to sell funeral goods or funeral services to the public, it is a deceptive act or practice for a funeral provider to represent that state or local law requires that a dead human body be embalmed when that is not the case or to fail to disclose that embalming is not required by law except in certain cases.\nTo prevent deceptive acts or practices, a funeral provider must not represent that a dead human body is required to be embalmed for direct cremation, immediate burial, or a closed casket funeral without viewing or visitation, when refrigeration is available and when not required by law. The funeral provider must also place the following disclosure on the general price list, described in section 149A.71, subdivision 2, paragraph (e), in immediate conjunction with the price shown for embalming: \"Except in certain cases, embalming is not required by law. Embalming may be necessary, however, if you select certain funeral arrangements, such as a funeral with viewing. If you do not want embalming, you usually have the right to choose an arrangement that does not require you to pay for it, such as direct cremation or immediate burial or when refrigeration or use of dry ice is available.\"\nIn selling or offering to sell funeral goods or funeral services to the public, it is a deceptive act or practice for a funeral provider to represent that a casket is required for alkaline hydrolysis, cremations, or, effective July 1, 2025, natural organic reduction by state or local law or otherwise.\nTo prevent deceptive acts or practices, funeral providers must place the following disclosure in immediate conjunction with the prices shown for alkaline hydrolysis: \"Minnesota law does not require you to purchase a casket for alkaline hydrolysis. If you want to arrange for alkaline hydrolysis, you can use an alkaline hydrolysis container. An alkaline hydrolysis container is a hydrolyzable or biodegradable closed container or pouch resistant to leakage of bodily fluids that encases the body and into which a dead human body is placed prior to insertion into an alkaline hydrolysis vessel. The containers we provide are (specify containers provided).\" This disclosure is required only if the funeral provider arranges alkaline hydrolysis.\nTo prevent deceptive acts or practices, funeral providers must place the following disclosure in immediate conjunction with the prices shown for cremations: \"Minnesota law does not require you to purchase a casket for cremation. If you want to arrange a cremation, you can use a cremation container. A cremation container is a combustible, closed container that encases the body and can be made of materials like fiberboard or corrugated cardboard and into which a dead human body is placed prior to insertion into a cremation chamber for cremation. The containers we provide are (specify containers provided).\" This disclosure is required only if the funeral provider arranges direct cremations.\nIn selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to fail to disclose that a casket has been used in a previous funeral ceremony when that is the case.\nTo prevent deceptive acts or practices, funeral providers must place the following disclosure in immediate conjunction with the prices shown for funeral goods or funeral services where a casket may be rented rather than purchased: \"If you choose a funeral service where a rental casket is provided, the casket used for the funeral service may have been used in a previous funeral service. If the casket has been used in a previous funeral service, the interior lining has either been replaced or thoroughly cleaned.\"\nIn selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to represent that state or local laws or regulations, or particular cemeteries, require outer burial containers when that is not the case or to fail to disclose to consumers arranging funerals that state law or local law does not require the purchase of an outer burial container.\nTo prevent deceptive acts or practices, funeral providers must place the following disclosure on the outer burial container price list, described in section 149A.71, subdivision 2, paragraph (c), or, if the prices of outer burial containers are listed on the general price list, described in section 149A.71, subdivision 2, paragraph (e), in immediate conjunction with those prices: \"In most areas of the country, state or local law does not require that you buy a container to surround the casket in the grave. However, many cemeteries require that you have such a container so that the grave will not sink in. Either a grave liner or a burial vault will satisfy these requirements.\"\nIn selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to represent that federal, state, or local laws, or particular cemeteries, alkaline hydrolysis facilities, crematories, or, effective July 1, 2025, natural organic reduction facilities require the purchase of any funeral goods, funeral services, burial site goods, or burial site services when that is not the case.\nTo prevent deceptive acts or practices, funeral providers must identify and briefly describe in writing on the statement of funeral goods, funeral services, burial site goods, and burial site services selected, as described in section 149A.71, subdivision 2, paragraph (f), any legal, cemetery, or crematory requirement which the funeral provider represents to consumers as compelling the purchase of funeral goods, funeral services, burial site goods, or burial site services for the funeral which that consumer is arranging.\nIn selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to represent that funeral goods, funeral services, burial site goods, or burial site services will delay the natural decomposition of human remains for a long term or indefinite time or to represent that funeral goods or burial site goods have protective features, beyond a lid sealing casket, or will protect the body from grave site substances, when that is not the case.\nIn selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is a deceptive act or practice for a funeral provider to represent that the price charged for a cash advance item is the same as the cost to the funeral provider for the item when that is not the case or to fail to disclose to the consumer arranging the funeral that the price charged for a cash advance item is not the same as the cost to the funeral provider when that is not the case.\nTo prevent deceptive acts or practices, funeral providers must place the following sentence in the itemized statement of funeral goods, funeral services, burial site goods, and burial site services selected, in immediate conjunction with the list of itemized cash advance items required by section 149A.71, subdivision 2, paragraph (f): \"We charge you for our services in obtaining (specify cash advance items provided).\", if the funeral provider makes a charge upon, or receives and retains a rebate, commission, or trade or volume discount upon a cash advance item.",
	"repealed": false
}