{
	"id": "3A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/3A.02",
	"title": "3A.02 RETIREMENT ALLOWANCE.",
	"text": "(a) A former legislator is entitled, upon written application to the director, to receive a retirement allowance monthly, if the person:\n(1) has either served at least six full years, or has served during all or part of four regular sessions as a member of the legislature, which service need not be continuous;\n(2) has attained the normal retirement age;\n(3) has retired as a member of the legislature; and\n(4) has made all contributions provided for in section 3A.03, has made payments for past service under subdivision 2, or has made payments in lieu of contributions under Minnesota Statutes 1992, section 3A.031, before July 1, 1994.\n(b) Unless the former legislator has legislative service before January 1, 1979, the retirement allowance is an amount equal to 2-1/2 percent per year of service of that member's average monthly salary and adjusted for that person on an actuarial equivalent basis to reflect the change in the investment return actuarial assumption under section 356.215, subdivision 8, from five percent to six percent. The adjustment must be calculated by or, alternatively, the adjustment procedure must be specified by, the actuary retained under section 356.214. The purpose of this adjustment is to ensure that the total amount of benefits that the actuary predicts an individual member will receive over the member's lifetime under this paragraph will be the same as the total amount of benefits the actuary predicts the individual member would receive over the member's lifetime under the law in effect before enactment of this paragraph. If the former legislator has legislative service before January 1, 1979, the person's benefit must include the additional benefit amount in effect on January 1, 1979, and adjusted as otherwise provided in this paragraph.\n(c) The retirement allowance accrues following the receipt by the director of a retirement application on a form prescribed by the director, but not before the normal retirement age, except as specified in subdivision 1b. The annuity is payable for the remainder of the former legislator's life, if the former legislator is not serving as a member of the legislature or as a constitutional officer as defined in section 3A.01, subdivision 1c. The annuity does not begin to accrue before the person's retirement as a legislator. No annuity payment may be made retroactive for more than 180 days before the date that the annuity application is filed with the director.\n(d) Any member who has served during all or part of four regular sessions is considered to have served eight years as a member of the legislature.\n(e) The retirement allowance ceases with the last payment that accrued to the retired legislator during the retired legislator's lifetime, except that the surviving spouse, if any, is entitled to receive the retirement allowance of the retired legislator for the calendar month in which the retired legislator died.\n[Repealed, 1973 c 653 s 47]\n(a) Upon separation from service after the beginning of the 1981 legislative session, a former member of the legislature who has attained the age set by the board of directors of the Minnesota State Retirement System and who is otherwise qualified under subdivision 1 is entitled, upon making written application on a form prescribed by the director, to a reduced retirement allowance. The reduced retirement allowance is an amount equal to the retirement allowance specified in subdivision 1, paragraph (b), that is reduced so that the reduced allowance is the actuarial equivalent of the allowance that would be payable if the former member of the legislature deferred receipt of the allowance and the allowance amount was augmented at an annual rate of three percent compounded annually from the date the allowance begins to accrue until age 62.\n(b) The age set by the board of directors under paragraph (a) cannot be an earlier age than the early retirement age under section 352.116, subdivision 1a.\n(c) If there is an actuarial cost to the plan of resetting the early retirement age under paragraph (a), the retired legislator is required to pay an additional amount to cover the full actuarial value. The additional amount must be paid in a lump sum within 30 days of the certification of the amount by the executive director.\n(d) The executive director of the Minnesota State Retirement System shall report to the Legislative Commission on Pensions and Retirement on the utilization of this provision annually on or before September 1.\n[Repealed, 2006 c 271 art 10 s 33]\n[Repealed, 2013 c 111 art 2 s 33]\nThe deferred retirement allowance of any former legislator must be augmented as provided herein from the first of the month following the termination of active service, or July 1, 1973, whichever is later, to the effective date of retirement, at the following rate or rates, compounded annually:\n(1) five percent until January 1, 1981;\n(2) three percent from January 1, 1981, until January 1 of the year in which the former legislator attains age 55 or January 1, 2012, whichever is earlier;\n(3) five percent from the period end date under clause (2) until the effective date of retirement or January 1, 2012, whichever is earlier;\n(4) two percent from January 1, 2012, until December 31, 2018; and\n(5) after December 31, 2018, the deferred annuity must not be augmented.\n(a) The board of directors shall establish an optional retirement annuity in the form of a joint and survivor annuity and an optional retirement annuity in the form of a period certain and life thereafter. Except as provided in paragraph (b), these optional annuity forms must be actuarially equivalent to the normal allowance computed under this section, plus the actuarial value of any surviving spouse benefit otherwise potentially payable at the time of retirement under section 3A.04, subdivision 1. An individual selecting an optional annuity under this subdivision and the person's spouse waive any rights to surviving spouse benefits under section 3A.04, subdivision 1.\n(b) If a retired legislator selects the joint and survivor annuity option, the retired legislator must receive a normal single-life allowance if the designated optional annuity beneficiary dies before the retired legislator and no reduction may be made in the annuity to provide for restoration of the normal single-life allowance in the event of the death of the designated optional annuity beneficiary.\n(c) The surviving spouse of a legislator who has attained at least age 55 and who dies while a member of the legislature may elect an optional joint and survivor annuity under paragraph (a), in lieu of surviving spouse benefits under section 3A.04, subdivision 1.\n(d) The surviving spouse of a deceased former legislator may elect an optional joint and survivor annuity under paragraph (a) in lieu of surviving spouse benefits under section 3A.04, subdivision 1, on or after the date the former legislator would have reached age 55.\nA retirement allowance under this section is eligible for postretirement adjustments under section 356.415.\nThe application for a benefit or refund made under this chapter must comply with section 352.115, subdivision 7a.",
	"repealed": false
}