{
	"id": "3.8851",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8851",
	"title": "3.8851 LEGISLATIVE ENERGY COMMISSION.",
	"text": "(a) There is established a Legislative Energy Commission to study and to make recommendations for legislation concerning issues related to its duties under subdivision 3.\n(b) The commission consists of:\n(1) nine members of the house of representatives, five of whom are appointed by the speaker of the house and four of whom are appointed by the leader of the minority caucus; and\n(2) nine members of the senate, five of whom are appointed by the leader of the majority caucus and four of whom are appointed by the leader of the minority caucus.\n(c) The commission may employ full-time and part-time staff, contract for consulting services, and may reimburse the expenses of persons requested to assist it in its duties. The director of the Legislative Coordinating Commission shall assist the commission in administrative matters. The commission shall elect cochairs, one member of the house of representatives and one member of the senate from among the committee and subcommittee chairs named to the commission. The commission members from the house of representatives shall elect the house of representatives cochair, and the commission members from the senate shall elect the senate cochair.\nThe commission may establish subcommittees as necessary to perform its duties.\n(a) The commission shall continuously evaluate the energy policies of this state and the degree to which they promote an environmentally and economically sustainable energy future. The commission shall monitor the state's progress in achieving its goals to develop renewable sources of electric energy under section 216B.1691, subdivision 2a, and the progress of energy-related sectors in reducing greenhouse gas emissions under the state's greenhouse gas emissions-reductions goals established in section 216H.02, subdivision 1. The commission may review proposed energy legislation and may recommend legislation. The commission shall when feasible solicit and consider public testimony regarding the economic, environmental, and social implications of state energy plans and policies. Notwithstanding any other law to the contrary the commission's evaluations and reviews under this subdivision shall include new and existing technologies for nuclear power.\n(b) The commission may study, analyze, hold hearings, and make legislative recommendations regarding the following issues:\n(1) the generation, transmission, and distribution of electricity;\n(2) the reduction of greenhouse gas emissions;\n(3) the conservation of energy;\n(4) alternative energy sources available to replace dwindling fossil fuel and other nonrenewable fuel sources;\n(5) the development of renewable energy supplies;\n(6) the economic development potential associated with issues described in clauses (1) to (5); and\n(7) other energy-related subjects the commission finds significant.\nThe public utility that owns the Prairie Island and Monticello nuclear generation facilities shall update the reports required under section 116C.772, subdivisions 3 to 5, and shall submit those updates periodically to the Public Utilities Commission with the utility's resource plan filing under section 216B.2422 and to the commission.\nThe commission may issue a subpoena under section 3.153 to any person for production of information held by that person that is relevant to the work of the commission.\nA state agency shall reply promptly to a request for data from the commission, subject to the requirements of chapter 13 and section 15.17.\n(a) Upon request by the cochairs of the commission, the commissioner of commerce shall assess the amount requested for the operation of the commission, not to exceed $250,000 in a fiscal year, from the following sources:\n(1) 50 percent of the assessment must come from all public utilities, municipal utilities, electric cooperative associations, generation and transmission cooperative electric associations, and municipal power agencies providing electric or natural gas services in Minnesota; and\n(2) 50 percent of the assessment must come from all bulk terminals located in this state from which petroleum products and liquid petroleum gas are dispensed.\n(b) The commissioner of commerce shall apportion the assessment amount requested among the entities in paragraph (a), clause (1), in proportion to their respective gross operating revenues from energy sold within the state during the most recent calendar year.\n(c) The commissioner of commerce shall apportion the assessment amount requested equally among the referenced entities in paragraph (a), clause (2).\n(d) The entities in paragraph (a), clause (1), must provide information to the commissioner of commerce to allow for calculation of the assessment.\n(e) The assessments under this subdivision are in addition to assessments made under section 216B.62. The amount assessed under this section must be deposited in the Legislative Energy Commission account in the special revenue fund. Funds in the Legislative Energy Commission account are appropriated to the director of the Legislative Coordinating Commission for the purposes of this section, and are available until expended. Utilities selling gas and electric service at retail must be assessed and billed in accordance with the procedures provided in section 216B.62, to the extent that these procedures do not conflict with this subdivision.",
	"repealed": false
}