{
	"id": "169.522",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.522",
	"title": "169.522 SLOW-MOVING VEHICLE, SIGN REQUIRED.",
	"text": "(a) All animal-drawn vehicles, motorized golf carts when operated on designated roadways pursuant to section 169.045, implements of husbandry, and other machinery, including all road construction machinery, which are designed for operation at a speed of 30 miles per hour or less, must display a triangular slow-moving vehicle emblem, except (1) when being used in actual construction and maintenance work and traveling within the limits of a construction area marked in accordance with the Manual on Uniform Traffic Control Devices, as set forth in section 169.06, or (2) for a towed implement of husbandry that is empty and that is not self-propelled, in which case it may be towed at lawful speeds greater than 30 miles per hour without removing the slow-moving vehicle emblem. The emblem must consist of a fluorescent or illuminated red-orange triangle with a dark red reflective border and be mounted so as to be visible from a distance of not less than 600 feet to the rear. When a primary power unit towing an implement of husbandry or other machinery displays a slow-moving vehicle emblem visible from a distance of 600 feet to the rear, it is not necessary to display a similar emblem on the secondary unit. All slow-moving vehicle emblems sold in this state must be so designed that when properly mounted they are visible from a distance of not less than 600 feet to the rear when directly in front of lawful lower beam of headlamps on a motor vehicle. The commissioner of public safety shall adopt standards and specifications for the design and position of mounting the slow-moving vehicle emblem. Such standards and specifications must be adopted by rule in accordance with the Administrative Procedure Act.\n(b) An alternate slow-moving vehicle emblem consisting of a dull black triangle with a white reflective border may be used after obtaining a permit from the commissioner under rules of the commissioner. A person with a permit to use an alternate slow-moving vehicle emblem must:\n(1) carry in the vehicle a regular slow-moving vehicle emblem and display the emblem when operating a vehicle between sunset and sunrise, and at any other time when visibility is impaired by weather, smoke, fog, or other conditions; and\n(2) permanently affix to the rear of the slow-moving vehicle at least 72 square inches of reflective tape that reflects the color red.\n(c) In addition to the emblem requirement under this subdivision, an animal-drawn vehicle must comply with section 169.58, subdivision 6.\nThe use of this emblem is restricted to the slow-moving vehicles specified in subdivision 1 and its use on any other type of vehicle or stationary object on the highway is prohibited.\nNo person shall sell, lease, rent, or operate any slow-moving vehicle, as defined in subdivision 1, except motorized golf carts and except those units designed to be completely mounted on a primary power unit, which is manufactured or assembled on or after July 1, 1967, unless the vehicle is equipped with a slow-moving vehicle emblem-mounting device as specified in subdivision 1. Provided however, a slow-moving vehicle must not be operated without such slow-moving vehicle emblem.",
	"repealed": false
}