{
	"id": "144.0754",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0754",
	"title": "144.0754 OFFICE OF AFRICAN AMERICAN HEALTH; DUTIES.",
	"text": "(a) The commissioner shall establish the Office of African American Health to address the unique public health needs of African American Minnesotans. The office must work to develop solutions and systems to address identified health disparities of African American Minnesotans arising from a context of cumulative and historical discrimination and disadvantages in multiple systems, including but not limited to housing, education, employment, gun violence, incarceration, environmental factors, and health care discrimination. The office shall:\n(1) convene the African American Health State Advisory Council under section 144.0755 to advise the commissioner on issues and to develop specific, targeted policy solutions to improve the health of African American Minnesotans, with a focus on United States born African Americans;\n(2) based upon input from and collaboration with the African American Health State Advisory Council, health indicators, and identified disparities, conduct analysis and develop policy and program recommendations and solutions targeted at improving African American health outcomes;\n(3) coordinate and conduct community engagement across multiple systems, sectors, and communities to address racial disparities in labor force participation, educational achievement, and involvement with the criminal justice system that impact African American health and well-being;\n(4) conduct data analysis and research to support policy goals and solutions;\n(5) award and administer African American health special emphasis grants to health and community-based organizations to plan and develop programs targeted at improving African American health outcomes, based upon needs identified by the council, health indicators, and identified disparities and addressing historical trauma and systems of United States born African American Minnesotans; and\n(6) develop and administer Department of Health immersion experiences for students in secondary education and community colleges to improve diversity of the public health workforce and introduce career pathways that contribute to reducing health disparities.\n(b) By January 15, 2025, and every two years thereafter, the commissioner of health shall report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over health policy and finance on the work accomplished by the Office of African American Health during the previous two years and on goals of the office for the upcoming two years.",
	"repealed": false
}