{
	"id": "256B.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.76",
	"title": "256B.76 PHYSICIAN, PROFESSIONAL SERVICES, AND DENTAL REIMBURSEMENT.",
	"text": "(a) Effective for services rendered on or after October 1, 1992, the commissioner shall make payments for physician services as follows:\n(1) payment for level one Centers for Medicare and Medicaid Services' common procedural coding system codes titled \"office and other outpatient services,\" \"preventive medicine new and established patient,\" \"delivery, antepartum, and postpartum care,\" \"critical care,\" cesarean delivery and pharmacologic management provided to psychiatric patients, and level three codes for enhanced services for prenatal high risk, shall be paid at the lower of (i) submitted charges, or (ii) 25 percent above the rate in effect on June 30, 1992;\n(2) payments for all other services shall be paid at the lower of (i) submitted charges, or (ii) 15.4 percent above the rate in effect on June 30, 1992; and\n(3) all physician rates shall be converted from the 50th percentile of 1982 to the 50th percentile of 1989, less the percent in aggregate necessary to equal the above increases except that payment rates for home health agency services shall be the rates in effect on September 30, 1992.\n(b) Effective for services rendered on or after January 1, 2000, payment rates for physician and professional services shall be increased by three percent over the rates in effect on December 31, 1999, except for home health agency and family planning agency services. The increases in this paragraph shall be implemented January 1, 2000, for managed care.\n(c) Effective for services rendered on or after July 1, 2009, payment rates for physician and professional services shall be reduced by five percent, except that for the period July 1, 2009, through June 30, 2010, payment rates shall be reduced by 6.5 percent for the medical assistance and general assistance medical care programs, over the rates in effect on June 30, 2009. This reduction and the reductions in paragraph (d) do not apply to office or other outpatient visits, preventive medicine visits and family planning visits billed by physicians, advanced practice registered nurses, or physician assistants in a family planning agency or in one of the following primary care practices: general practice, general internal medicine, general pediatrics, general geriatrics, and family medicine. This reduction and the reductions in paragraph (d) do not apply to federally qualified health centers, rural health centers, and Indian health services. Effective October 1, 2009, payments made to managed care plans and county-based purchasing plans under sections 256B.69, 256B.692, and 256L.12 shall reflect the payment reduction described in this paragraph.\n(d) Effective for services rendered on or after July 1, 2010, payment rates for physician and professional services shall be reduced an additional seven percent over the five percent reduction in rates described in paragraph (c). This additional reduction does not apply to physical therapy services, occupational therapy services, and speech pathology and related services provided on or after July 1, 2010. This additional reduction does not apply to physician services billed by a psychiatrist or an advanced practice registered nurse with a specialty in mental health. Effective October 1, 2010, payments made to managed care plans and county-based purchasing plans under sections 256B.69, 256B.692, and 256L.12 shall reflect the payment reduction described in this paragraph.\n(e) Effective for services rendered on or after September 1, 2011, through June 30, 2013, payment rates for physician and professional services shall be reduced three percent from the rates in effect on August 31, 2011. This reduction does not apply to physical therapy services, occupational therapy services, and speech pathology and related services.\n(f) Effective for services rendered on or after September 1, 2014, payment rates for physician and professional services, including physical therapy, occupational therapy, speech pathology, and mental health services shall be increased by five percent from the rates in effect on August 31, 2014. In calculating this rate increase, the commissioner shall not include in the base rate for August 31, 2014, the rate increase provided under section 256B.76, subdivision 7. This increase does not apply to federally qualified health centers, rural health centers, and Indian health services. Payments made to managed care plans and county-based purchasing plans shall not be adjusted to reflect payments under this paragraph.\n(g) Effective for services rendered on or after July 1, 2015, payment rates for physical therapy, occupational therapy, and speech pathology and related services provided by a hospital meeting the criteria specified in section 62Q.19, subdivision 1, paragraph (a), clause (4), shall be increased by 90 percent from the rates in effect on June 30, 2015. Payments made to managed care plans and county-based purchasing plans shall not be adjusted to reflect payments under this paragraph.\n(h) Any ratables effective before July 1, 2015, do not apply to early intensive developmental and behavioral intervention (EIDBI) benefits described in section 256B.0949.\n(i) The commissioner may reimburse physicians and other licensed professionals for costs incurred to pay the fee for testing newborns who are medical assistance enrollees for heritable and congenital disorders under section 144.125, subdivision 1, paragraph (c), when the sample is collected outside of an inpatient hospital or freestanding birth center and the cost is not recognized by another payment source.\n(a) Effective for services rendered on or after October 1, 1992, the commissioner shall make payments for dental services as follows:\n(1) dental services shall be paid at the lower of (i) submitted charges, or (ii) 25 percent above the rate in effect on June 30, 1992; and\n(2) dental rates shall be converted from the 50th percentile of 1982 to the 50th percentile of 1989, less the percent in aggregate necessary to equal the above increases.\n(b) Beginning October 1, 1999, the payment for tooth sealants and fluoride treatments shall be the lower of (1) submitted charge, or (2) 80 percent of median 1997 charges.\n(c) Effective for services rendered on or after January 1, 2000, payment rates for dental services shall be increased by three percent over the rates in effect on December 31, 1999.\n(d) Effective for services provided on or after January 1, 2002, payment for diagnostic examinations and dental x-rays provided to children under age 21 shall be the lower of (1) the submitted charge, or (2) 85 percent of median 1999 charges.\n(e) The increases listed in paragraphs (b) and (c) shall be implemented January 1, 2000, for managed care.\n(f) Effective for dental services rendered on or after October 1, 2010, by a state-operated dental clinic, payment shall be paid on a reasonable cost basis that is based on the Medicare principles of reimbursement. This payment shall be effective for services rendered on or after January 1, 2011, to recipients enrolled in managed care plans or county-based purchasing plans.\n(g) Beginning in fiscal year 2011, if the payments to state-operated dental clinics in paragraph (f), including state and federal shares, are less than $1,850,000 per fiscal year, a supplemental state payment equal to the difference between the total payments in paragraph (f) and $1,850,000 shall be paid from the general fund to state-operated services for the operation of the dental clinics.\n(h) Effective for services rendered on or after January 1, 2014, through December 31, 2021, payment rates for dental services shall be increased by five percent from the rates in effect on December 31, 2013. This increase does not apply to state-operated dental clinics in paragraph (f), federally qualified health centers, rural health centers, and Indian health services. Effective January 1, 2014, payments made to managed care plans and county-based purchasing plans under sections 256B.69, 256B.692, and 256L.12 shall reflect the payment increase described in this paragraph.\n(i) Effective for services provided on or after January 1, 2017, through December 31, 2021, the commissioner shall increase payment rates by 9.65 percent for dental services provided outside of the seven-county metropolitan area. This increase does not apply to state-operated dental clinics in paragraph (f), federally qualified health centers, rural health centers, or Indian health services. Effective January 1, 2017, payments to managed care plans and county-based purchasing plans under sections 256B.69 and 256B.692 shall reflect the payment increase described in this paragraph.\n(j) Effective for services provided on or after July 1, 2017, through December 31, 2021, the commissioner shall increase payment rates by 23.8 percent for dental services provided to enrollees under the age of 21. This rate increase does not apply to state-operated dental clinics in paragraph (f), federally qualified health centers, rural health centers, or Indian health centers. This rate increase does not apply to managed care plans and county-based purchasing plans.\n(k) Effective for services provided on or after January 1, 2022, the commissioner shall exclude from medical assistance and MinnesotaCare payments for dental services to public health and community health clinics the 20 percent increase authorized under Laws 1989, chapter 327, section 5, subdivision 2, paragraph (b).\n(l) Effective for services provided on or after January 1, 2022, the commissioner shall increase payment rates by 98 percent for all dental services. This rate increase does not apply to state-operated dental clinics, federally qualified health centers, rural health centers, or Indian health services.\n(m) Managed care plans and county-based purchasing plans shall reimburse providers at a level that is at least equal to the rate paid under fee-for-service for dental services. If, for any coverage year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed an amount equal to any increase in rates that results from this provision. If, for any coverage year, federal approval is not received for this paragraph, the commissioner shall not implement this paragraph for subsequent coverage years.\n(a) The commissioner shall award grants to community clinics or other nonprofit community organizations, political subdivisions, professional associations, or other organizations that demonstrate the ability to provide dental services effectively to public program recipients. Grants may be used to fund the costs related to coordinating access for recipients, developing and implementing patient care criteria, upgrading or establishing new facilities, acquiring furnishings or equipment, recruiting new providers, or other development costs that will improve access to dental care in a region. In awarding grants, the commissioner shall give priority to applicants that plan to serve areas of the state in which the number of dental providers is not currently sufficient to meet the needs of recipients of public programs or uninsured individuals. The commissioner shall consider the following in awarding the grants:\n(1) potential to successfully increase access to an underserved population;\n(2) the ability to raise matching funds;\n(3) the long-term viability of the project to improve access beyond the period of initial funding;\n(4) the efficiency in the use of the funding; and\n(5) the experience of the proposers in providing services to the target population.\n(b) The commissioner shall monitor the grants and may terminate a grant if the grantee does not increase dental access for public program recipients. The commissioner shall consider grants for the following:\n(1) implementation of new programs or continued expansion of current access programs that have demonstrated success in providing dental services in underserved areas;\n(2) a pilot program for utilizing hygienists outside of a traditional dental office to provide dental hygiene services; and\n(3) a program that organizes a network of volunteer dentists, establishes a system to refer eligible individuals to volunteer dentists, and through that network provides donated dental care services to public program recipients or uninsured individuals.\n(a) The commissioner shall increase reimbursements to dentists and dental clinics deemed by the commissioner to be critical access dental providers. For dental services rendered on or after July 1, 2016, through December 31, 2021, the commissioner shall increase reimbursement by 37.5 percent above the reimbursement rate that would otherwise be paid to the critical access dental provider, except as specified under paragraph (b). The commissioner shall pay the managed care plans and county-based purchasing plans in amounts sufficient to reflect increased reimbursements to critical access dental providers as approved by the commissioner.\n(b) For dental services rendered on or after July 1, 2016, through December 31, 2021, by a dental clinic or dental group that meets the critical access dental provider designation under paragraph (f), clause (4), and is owned and operated by a health maintenance organization licensed under chapter 62D, the commissioner shall increase reimbursement by 35 percent above the reimbursement rate that would otherwise be paid to the critical access provider.\n(c) The commissioner shall increase reimbursement to dentists and dental clinics deemed by the commissioner to be critical access dental providers. For dental services provided on or after January 1, 2022, by a dental provider deemed to be a critical access dental provider under paragraph (f), the commissioner shall increase reimbursement by 20 percent above the reimbursement rate that would otherwise be paid to the critical access dental provider. This paragraph does not apply to federally qualified health centers, rural health centers, state-operated dental clinics, or Indian health centers.\n(d) Managed care plans and county-based purchasing plans shall increase reimbursement to critical access dental providers by at least the amount specified in paragraph (c). If, for any coverage year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed an amount equal to any increase in rates that results from this provision. If, for any coverage year, federal approval is not received for this paragraph, the commissioner shall not implement this paragraph for subsequent coverage years.\n(e) Critical access dental payments made under this subdivision for dental services provided by a critical access dental provider to an enrollee of a managed care plan or county-based purchasing plan must not reflect any capitated payments or cost-based payments from the managed care plan or county-based purchasing plan. The managed care plan or county-based purchasing plan must base the additional critical access dental payment on the amount that would have been paid for that service had the dental provider been paid according to the managed care plan or county-based purchasing plan's fee schedule that applies to dental providers that are not paid under a capitated payment or cost-based payment.\n(f) The commissioner shall designate the following dentists and dental clinics as critical access dental providers:\n(1) nonprofit community clinics that:\n(i) have nonprofit status in accordance with chapter 317A;\n(ii) have tax exempt status in accordance with the Internal Revenue Code, section 501(c)(3);\n(iii) are established to provide oral health services to patients who are low income, uninsured, have special needs, and are underserved;\n(iv) have professional staff familiar with the cultural background of the clinic's patients;\n(v) charge for services on a sliding fee scale designed to provide assistance to low-income patients based on current poverty income guidelines and family size;\n(vi) do not restrict access or services because of a patient's financial limitations or public assistance status; and\n(vii) have free care available as needed;\n(2) federally qualified health centers, rural health clinics, and public health clinics;\n(3) hospital-based dental clinics owned and operated by a city, county, or former state hospital as defined in section 62Q.19, subdivision 1, paragraph (a), clause (4);\n(4) a dental clinic or dental group owned and operated by a nonprofit corporation in accordance with chapter 317A with more than 10,000 patient encounters per year with patients who are uninsured or covered by medical assistance or MinnesotaCare;\n(5) a dental clinic owned and operated by the University of Minnesota or the Minnesota State Colleges and Universities system; and\n(6) private practicing dentists if:\n(i) the dentist's office is located within the seven-county metropolitan area and more than 50 percent of the dentist's patient encounters per year are with patients who are uninsured or covered by medical assistance or MinnesotaCare; or\n(ii) the dentist's office is located outside the seven-county metropolitan area and more than 25 percent of the dentist's patient encounters per year are with patients who are uninsured or covered by medical assistance or MinnesotaCare.\nAn entity that operates both a Medicare certified comprehensive outpatient rehabilitation facility and a facility which was certified prior to January 1, 1993, that is licensed under Minnesota Rules, parts 9570.2000 to 9570.3400, and for whom at least 33 percent of the clients receiving rehabilitation services in the most recent calendar year are medical assistance recipients, shall be reimbursed by the commissioner for rehabilitation services at rates that are 38 percent greater than the maximum reimbursement rate allowed under subdivision 1, paragraph (a), clause (2), when those services are (1) provided within the comprehensive outpatient rehabilitation facility and (2) provided to residents of nursing facilities owned by the entity.\n(a) Effective for services rendered on or after January 1, 2007, the commissioner shall make payments for physician and professional services based on the Medicare relative value units (RVUs). This change shall be budget neutral and the cost of implementing RVUs will be incorporated in the established conversion factor.\n(b) Effective for services rendered on or after January 1, 2025, rates for mental health services reimbursed under the resource-based relative value scale (RBRVS) must be equal to 83 percent of the Medicare Physician Fee Schedule.\n(c) Effective for services rendered on or after January 1, 2025, the commissioner shall increase capitation payments made to managed care plans and county-based purchasing plans to reflect the rate increases provided under this subdivision. Managed care plans and county-based purchasing plans must use the capitation rate increase provided under this paragraph to increase payment rates to the providers corresponding to the rate increases. The commissioner must monitor the effect of this rate increase on enrollee access to services under this subdivision. If for any contract year federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this paragraph. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this paragraph.\n[See Note.]\nPayment for certain primary care services and immunization administration services rendered on or after January 1, 2013, through December 31, 2014, shall be made in accordance with section 1902(a)(13) of the Social Security Act.",
	"repealed": false
}