{
	"id": "13D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.04",
	"title": "13D.04 NOTICE OF MEETINGS.",
	"text": "A schedule of the regular meetings of a public body shall be kept on file at its primary offices. If a public body decides to hold a regular meeting at a time or place different from the time or place stated in its schedule of regular meetings, it shall give the same notice of the meeting that is provided in this section for a special meeting.\n(a) For a special meeting, except an emergency meeting or a special meeting for which a notice requirement is otherwise expressly established by statute, the public body shall post written notice of the date, time, place, and purpose of the meeting on the principal bulletin board of the public body, or if the public body has no principal bulletin board, on the door of its usual meeting room.\n(b) The notice shall also be mailed or otherwise delivered to each person who has filed a written request for notice of special meetings with the public body. This notice shall be posted and mailed or delivered at least three days before the date of the meeting.\n(c) As an alternative to mailing or otherwise delivering notice to persons who have filed a written request for notice of special meetings, the public body may publish the notice once, at least three days before the meeting, in the official newspaper of the public body or, if there is none, in a qualified newspaper of general circulation within the area of the public body's authority.\n(d) A person filing a request for notice of special meetings may limit the request to notification of meetings concerning particular subjects, in which case the public body is required to send notice to that person only concerning special meetings involving those subjects.\n(e) A public body may establish an expiration date for requests for notices of special meetings pursuant to this subdivision and require refiling of the request once each year.\n(f) Not more than 60 days before the expiration date of a request for notice, the public body shall send notice of the refiling requirement to each person who filed during the preceding year.\n(a) For an emergency meeting, the public body shall make good faith efforts to provide notice of the meeting to each news medium that has filed a written request for notice if the request includes the news medium's telephone number.\n(b) Notice of the emergency meeting shall be given by telephone or by any other method used to notify the members of the public body.\n(c) Notice shall be provided to each news medium which has filed a written request for notice as soon as reasonably practicable after notice has been given to the members.\n(d) Notice shall include the subject of the meeting. Posted or published notice of an emergency meeting is not required.\n(e) An \"emergency\" meeting is a special meeting called because of circumstances that, in the judgment of the public body, require immediate consideration by the public body.\n(f) If matters not directly related to the emergency are discussed or acted upon at an emergency meeting, the minutes of the meeting shall include a specific description of the matters.\n(g) The notice requirement of this subdivision supersedes any other statutory notice requirement for a special meeting that is an emergency meeting.\n(a) If a meeting is a recessed or continued session of a previous meeting, and the time and place of the meeting was established during the previous meeting and recorded in the minutes of that meeting, then no further published or mailed notice is necessary.\n(b) For purposes of this subdivision, the term \"meeting\" includes a public hearing conducted pursuant to chapter 429 or any other law or charter provision requiring a public hearing by a public body.\nThe notice requirements of this section apply to closed meetings.\nFor a meeting of an agency, board, commission, or department of the state required or permitted by law to transact public business in a meeting:\n(1) the notice requirements of this section apply only if a statute governing meetings of the agency, board, or commission does not contain specific reference to the method of providing notice;\n(2) all provisions of this section relating to publication are satisfied by publication in the State Register or posting on the website of the agency, board, commission, or department; and\n(3) a schedule of the regular meetings shall be kept on file at the primary offices or posted on the website of the agency, board, commission, or department.\nIf a person receives actual notice of a meeting of a public body at least 24 hours before the meeting, all notice requirements of this section are satisfied with respect to that person, regardless of the method of receipt of notice.",
	"repealed": false
}