{
	"id": "430.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.011",
	"title": "430.011 PEDESTRIAN MALL ORDINANCE, IMPROVEMENT DISTRICT.",
	"text": "The legislature finds that: (1) increases in population and automobile usage have created traffic congestion in cities; (2) those conditions endanger pedestrians and impede the movement of police and fire equipment, ambulances, and other emergency vehicles; (3) certain streets in cities have been improved to their maximum width for sidewalk and roadway purposes and cannot be further widened without taking valuable buildings and improvements, substantially impairing the primary function of those city streets as pedestrian facilities, and impairing the cities' sources of tax revenue; and (4) limitation on the use of those streets by private vehicles may be found by the council of any city to be in the interest of the city and state, to be of benefit to adjoining properties, and to be essential to the effective use of the streets for street purposes.\nIt is the state's policy to permit the city council of any city to protect the public welfare and the interests of the public in the safe and effective movement of persons and to preserve and enhance the function and appearance of cities by adopting pedestrian mall ordinances under this section.\n(a) A pedestrian mall ordinance may be adopted if the city council finds that:\n(1) a street or a part of a street (i) is not a part of any trunk highway, (ii) is located within a city right-of-way, and (iii) is improved to its maximum width for roadway and sidewalk purposes, and (iv) except for a city of the first class, is not part of a residence district;\n(2) the movement of police and fire equipment and other emergency vehicles would not be impeded;\n(3) reasonably convenient alternate routes exist for private vehicles to other parts of the city and state;\n(4) continued unlimited use of the street or part of the street by private vehicles may endanger pedestrians;\n(5) abutting properties can reasonably and adequately receive and deliver merchandise and materials from other streets and alleys or through arrangements for limited use of the streets by carriers of merchandise and materials; and\n(6) it would be in the best interests of the city and the public and of benefit to adjacent properties to use the street primarily for pedestrian purposes and pedestrian use is the highest and best use of the street or part of it.\n(b) In addition to meeting the criteria under paragraph (a), a pedestrian mall ordinance may be adopted relating to property that is immediately adjacent to at least one side of an intersection with a road that is under the jurisdiction of another road authority only if the city has consulted with the other road authority, which must include consideration of changes to traffic flow. If the other road authority is opposed to the location of the proposed pedestrian mall, the city must make publicly available a detailed written response to the road authority before adopting the ordinance. A pedestrian mall ordinance may be adopted relating to property that borders another city only if the city developing the ordinance has received the approval of the bordering city.\n(c) As relevant, the city must collaborate with the state and local units of government in the pedestrian mall planning process.\nAn ordinance under subdivision 3 must (1) set forth the findings required in subdivision 3, (2) designate a street or part of a street as a pedestrian mall, (3) limit the use of the surface of the street or part of the street at times or during hours or days set by the council to pedestrians and to classes of emergency, public works, maintenance, service, and utility transportation vehicles defined in the ordinance, and (4) include other provisions required in this chapter.\nAn ordinance under subdivision 3 must state that a limitation of use does not apply to vehicles on an intersecting street crossing the street or part of a street designated as a pedestrian mall unless the intersecting street is similarly designated.\nIf the council finds that a street or part of a street limited under this section is served by a transit utility engaged in mass transportation of persons within the city by bus or street railway, and that continued use of the street or part of the street by the transit utility will benefit the city and the public and to adjacent property, the council shall permit the transit utility to use the street or part of the street for transit purposes to the extent and subject to the obligations and restrictions applicable to the transit utility in the use of other streets of the city. Upon similar findings, the council may permit use of the street or part of the street by utilities engaged in carrying persons by taxicabs.\nIf any property abutting on a street or part of a street limited under this section does not, when an ordinance is adopted, have access to some other street or alley for delivery of or receiving merchandise and materials, the council shall provide for deliveries in the ordinance. It may do so by issuing a permit to the owners or occupants of the property for the use of the street or part of the street for deliveries, or otherwise. The council shall provide for deliveries during hours and days, which need not be ordinary business hours or days, the council finds to be reasonably adequate for the purpose and not to interfere with the use of the street or part of the street by pedestrians and other authorized vehicles.\nIf an ordinance is to be adopted in connection with an improvement of the street under this chapter, it must so state, must be introduced as a proposed ordinance and given its first reading concurrently with the introduction and adoption of the resolution of the council beginning the improvement proceedings, and must not be given its final reading or be finally adopted until the council has taken action on the proposed improvement under section 430.02, subdivision 12.\nAn ordinance that is not being adopted in connection with an improvement of the street under this chapter must state that fact and be considered and adopted like other ordinances, subject to the right of appeal under section 430.031. The council shall not meet to give the ordinance its final reading or to finally adopt the ordinance unless a copy of the proposed ordinance and a notice stating the time and place at which the council will meet to consider its adoption has been published in the official newspaper of the city at least once and has been mailed to the owners of the lots or parcels of land abutting on the proposed pedestrian mall at least three weeks before the meeting.\nAn ordinance adopted in connection with an improvement of the street under this chapter must describe the property to be assessed for the improvement. No property is subject to assessment for the improvement unless it is described in the ordinance.\nIf an ordinance is to be adopted in connection with an improvement of the street under this chapter and the ordinance includes a council determination that (1) the improvement will involve annual costs in addition to the initial cost of constructing and making the improvement, and (2) the annual costs will provide benefits primarily to adjacent property rather than to the city as a whole, the ordinance may require that the improvement and its facilities be operated and maintained under section 430.101 and the costs assessed or taxed to benefited properties under section 430.102.\nAlternatively, after a pedestrian mall ordinance has been adopted or lands have been acquired or improved for a pedestrian mall, the council may require by separate ordinance or by amendment to a pedestrian mall ordinance that the improvement and its facilities be operated and maintained and the costs taxed and assessed to benefited properties under sections 430.101 and 430.102, subject to appeal under section 430.031. In that case, the ordinance must describe the properties to be assessed or taxed for annual costs. The area may be given the name \"(name of street) Pedestrian Mall Improvement District.\"\nThe owners of lands abutting on a street or part of a street proposed as a pedestrian mall representing a majority of the frontage on the proposed pedestrian mall may make written objection to the establishment of the proposed pedestrian mall at any time before the ordinance has been given its final reading and adopted. If they do the council shall end the proceedings for establishment of the mall. In that event, no ordinance establishing the same or substantially the same pedestrian mall may be introduced or adopted within one year after the termination.\nNotwithstanding the improvement of a street as a pedestrian mall or the adoption of a pedestrian mall ordinance, the city and its council keep their police powers and other rights and powers relating to the city street or street part constituting the pedestrian mall, and the pedestrian mall action may not be construed to be a vacation, in whole or in part, of any city street or street part in the mall area. The establishment of a pedestrian mall under this chapter is a matter of regulation only. This chapter does not prevent the city and its council, at any time after the adoption of a pedestrian mall ordinance, from abandoning the operation of the pedestrian mall, from changing the extent of the pedestrian mall, from supplying or amending the description of the district to be specially assessed or taxed for annual costs of the pedestrian mall, or from changing or repealing any limitations on the use of the pedestrian mall by private vehicles or any plan, rules, or regulations adopted for the operation of a pedestrian mall.\nAn ordinance or amendment adopted under this section does not become effective until 20 days after its final adoption and publication.",
	"repealed": false
}