{
	"id": "214.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.13",
	"title": "214.13 HUMAN SERVICES OCCUPATIONS.",
	"text": "The commissioner of health shall promote the recognition of human services occupations useful in the effective delivery of human services. The commissioner shall coordinate the development of a credentials policy among the health-related licensing boards consistent with section 214.001. The commissioner shall, consistent with section 214.001, establish procedures for the identification of human services occupations not now credentialed by the state, recommend appropriate regulatory modes, and promulgate by rule standards and procedures relating to the credentialing of persons practicing in the affected occupations. At the time of submission of a letter of intent to enter the credentialing process, an occupational applicant group shall pay a fee of $1,000 to the commissioner. The fee is nonrefundable and must be deposited with the commissioner of management and budget and credited to the general fund. The commissioner may require an occupational applicant group to submit information relating to, and to recommend and justify regulatory modes and standards consistent with, the provisions of section 214.001. If the commissioner determines that credentialing of an occupation is appropriate, the commissioner is empowered only to register the occupation. Before promulgating any rules resulting in registration for an occupation the commissioner shall consult with state boards or agencies charged with regulating similar occupations in order to define the scope and range of practice for the registered occupation and the degree of supervision required. As used in this section, registration is defined as in section 214.001, subdivision 3, clause (c).\nBefore promulgating any rules regulating a specific occupation under this section, the commissioner shall determine whether a substantial number of persons in that occupation will be employed by an employer who is regulated by or funded through another state agency. If the commissioner so determines, then the commissioner must submit the proposed rules to the head or governing board of that agency for review and comment. The agency shall review the rules to insure compliance with laws which are administered or enforced by that agency. Agency comment shall be forwarded to the commissioner within 90 days of receiving the proposed rules. After receipt of agency comment, the commissioner may proceed to promulgate the rules.\nRules promulgated by the commissioner pursuant to subdivision 1 may include procedures and standards relating to the registration requirement, the scope of authorized practice, fees, supervision required, continuing education, career progression and disciplinary matters. Notwithstanding any law to the contrary, persons registered under the authority of the rules promulgated by the commissioner shall not, for a period of four years after the effective date of the rules, be subject to any action by a health-related licensing board for violation of the board's laws or rules provided the person's practice or conduct is recognized by the rules promulgated by the commissioner. Three years after the effective date of the commissioner's rules, the commissioner shall make a report to the legislature on the usefulness of the new occupational group, any problems encountered in administering the regulation of the group, and any necessary statutory changes recommended to continue, discontinue, or modify the regulation of the group.\nThe commissioner of health shall wherever possible delegate the administration of regulation activities to a health-related licensing board with the concurrence of that board. If the commissioner of health delegates this function, the licensing board may regularly bill the commissioner of health for the cost of performing this function. The licensing board may directly set and charge fees in accordance with the provisions of section 214.06. The commissioner of health may establish an advisory council to advise the commissioner or the appropriate health-related licensing board on matters relating to the registration and regulation of an occupation. A council shall have seven members appointed by the commissioner of which five are members of the registered occupation or related registered or licensed occupations, and two are public members. The terms, compensation, and removal of members shall be as provided in section 15.059.\nThe commissioner of health shall exercise care to prevent the proliferation of unessential registered human services occupations. In evaluating a currently unregistered occupation the commissioner may determine that registration of the occupation is not appropriate, but that implementation of another mode as set forth in section 214.001, subdivision 3, is appropriate. For a period of two years after a determination by the commissioner as to the appropriate regulatory mode, if any, for an occupational applicant group, the same or substantially equivalent group may not submit a letter of intent to enter the credentialing process, unless invited to do so by the commissioner.\nThe provisions of section 214.10 shall apply to any complaint or other communication, whether oral or written, received by the commissioner of health which alleges or implies a violation of a statute or rule which the commissioner is empowered to enforce relating to a specific occupational group for which a registration requirement has been created pursuant to this section.\nThe duties of the executive director, executive secretary, or board members specified in section 214.10, subdivisions 1 and 2, shall be performed with respect to occupations regulated pursuant to this section by the advisory council established under subdivision 4, or if no council has been created, by the health-related licensing board which has been delegated the administration of regulation activities, or if no such delegation has been made, by a staff member appointed by the commissioner. For the purposes of subdivision 6 and this subdivision, the commissioner may exercise the powers granted to boards by section 214.10, subdivision 3, when carrying out the duties of this subdivision.",
	"repealed": false
}