{
	"id": "297F.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.13",
	"title": "297F.13 REQUIRED RECORDS.",
	"text": "(a) A distributor shall keep at each licensed place of business complete and accurate records for that place of business. The records must include: itemized invoices of cigarettes held, purchased, manufactured, or brought in or caused to be brought in from outside the state, and all sales of cigarettes made, except sales to the ultimate consumer. These records must show the names and addresses of purchasers, the inventory of all stamps affixed and unaffixed and all cigarettes on hand at the close of each period for which a return is required, and any other pertinent papers and documents relating to the purchase, sale, or disposition of cigarettes.\n(b) A distributor or subjobber who sells cigarettes at retail must maintain a separate inventory, substantiated with invoices for cigarettes that were acquired for retail sale.\n(c) When a licensed distributor sells cigarettes exclusively to the ultimate consumer at the address given in the license, no invoice of those sales is required, but itemized invoices must be made of all cigarettes transferred to other retail outlets owned or controlled by that licensed distributor.\n(d) All books, records, and other documents required by this chapter shall be preserved for a period of at least 3-1/2 years after the date of the documents or the date of the entries appearing in the records, unless the commissioner in writing authorizes their destruction or disposal at an earlier date.\n(e) To determine whether the distributor is in compliance with the provisions of this chapter, at any time during usual business hours the commissioner, or duly authorized agents or employees, may enter a place of business of a distributor, without a search warrant, and inspect the premises, the records required to be kept under this chapter, and the packages of cigarettes and the vending devices in that place of business. If the commissioner, or an agent or employee of the commissioner, is denied free access or is hindered or interfered with in making the examination, the commissioner may revoke the distributor's license.\n(a) A distributor shall keep at each licensed place of business complete and accurate records for that place of business, including itemized invoices of tobacco products held, purchased, manufactured, brought in or caused to be brought in from outside the state, or shipped or transported to retailers in this state, and all sales of tobacco products made, except sales to the ultimate consumer.\n(b) When a licensed distributor sells tobacco products exclusively to the ultimate consumer at the address given in the license, no invoice of those sales is required, but itemized invoices must be made of all tobacco products transferred to other retail outlets owned or controlled by that licensed distributor.\n(c) All books, records, and other documents required by this chapter must be preserved for a period of at least 3-1/2 years after the date of the documents or the date of the entries appearing in the records, unless the commissioner authorizes in writing their destruction or disposal at an earlier date.\n(d) To determine whether the distributor is in compliance with the provisions of this chapter, at any time during usual business hours the commissioner, or duly authorized agents or employees, may enter a place of business of a distributor, without a search warrant, and inspect the premises, the records required to be kept under this chapter, and the tobacco products in that place of business. If the commissioner, or an agent or employee of the commissioner, is denied free access or is hindered or interfered with in making the examination, the commissioner may revoke the distributor's license.\nA person who sells cigarettes or tobacco products to persons other than the ultimate consumer shall render with each sale itemized invoices showing the seller's name and address, the purchaser's name and address, the date of sale, and all prices and discounts, and shall preserve legible copies of all such invoices for 3-1/2 years from the date of the sale.\nEvery retailer and subjobber shall procure itemized invoices of all cigarettes or tobacco products purchased.\nThe retailer and subjobber shall preserve a legible copy of each invoice for one year from the date of the invoice or as long as the cigarette or tobacco product listed on the invoice is available for sale or in their possession, whichever period is longer. The retailer and subjobber shall preserve copies of the invoices at each retail location or at a central location provided that the invoice must be produced and made available at a retail location within one hour when requested by the commissioner or duly authorized agents and employees. Copies should be numbered and kept in chronological order.\nTo determine whether the business is in compliance with the provisions of this chapter, at any time during usual business hours, the commissioner, or duly authorized agents and employees, may enter any place of business of a retailer or subjobber without a search warrant and inspect the premises, the records required to be kept under this chapter, and the packages of cigarettes, tobacco products, and vending devices contained on the premises.\nRecords of all deliveries or shipments of cigarettes or tobacco products from any public warehouse of first destination in this state (which is subject to the provisions of and licensed under chapter 231), must be kept by the warehouse and made available to the commissioner for inspection. The records must show the name and address of the consignee, the date, the quantity of cigarettes or tobacco products delivered, and any other information required by the commissioner. These records must be preserved for one year from the date of delivery of the cigarettes or tobacco products.",
	"repealed": false
}