{
	"id": "518A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.56",
	"title": "518A.56 MANDATORY PAYMENT OF OBLIGATIONS TO CENTRAL COLLECTIONS UNIT.",
	"text": "All payments described in section 518A.55 must be made to the central collections unit.\nEach local child support agency shall provide a location within the agency to receive payments. A local agency receiving a payment shall transmit the funds to the central collections unit within one working day of receipt of the payment.\nNotwithstanding any rule to the contrary, incentives must be paid to the county providing services and maintaining the case to which the payment is applied. Incentive payments awarded for the collection of child support must be based solely upon payments processed by the central collections unit. Incentive payments received by the county under this subdivision shall be used for county child support collection efforts.\nThe central collections unit is authorized to engage in the electronic transfer of funds for the receipt and disbursement of funds.\nA tribunal issuing an order that establishes or modifies a payment shall issue an income withholding order in conformity with section 518A.53. The automatic income withholding order must include the name of the obligor, the obligor's Social Security number, the obligor's date of birth, and the name and address of the obligor's employer. The street mailing address and the electronic mail address for the central collections unit must be included in each automatic income withholding order issued by a tribunal.\nThe tribunal shall transmit a copy of the order establishing or modifying the payment, and a copy of the automatic income withholding order, to the local child support agency within two working days of the approval of the order by the judge or child support magistrate or other person or entity authorized to sign the automatic withholding order.\nThe obligor or other payor of funds shall identify the obligor on the check or remittance by name, payor number, and Social Security number, and shall comply with section 518A.53.\nA notice may be directed to any person or entity submitting a check drawn on insufficient funds stating that future payment must be paid by cash or certified funds. The central collections unit and the local child support agency may refuse a check from a person or entity that has been given notice that payments must be in cash or certified funds.\nA copy of the record of payments maintained by the central collections unit in section 518A.55 is admissible evidence in all tribunals as proof of payments made through the central collections unit without the need of testimony to prove authenticity.\n(a) The commissioner of children, youth, and families shall develop a plan for the implementation of the central collections unit. The plan must require that payments be redirected to the central collections unit. Payments may be redirected in groups according to county of origin, county of payment, method of payment, type of case, or any other distinguishing factor designated by the commissioner.\n(b) Notice that payments must be made to the central collections unit must be provided to the obligor and to the payor of funds within 30 days prior to the redirection of payments to the central collections unit. After the notice has been provided to the obligor or payor of funds, mailed payments received by a local child support agency must be forwarded to the central collections unit. A notice must be sent to the obligor or payor of funds stating that payment application may be delayed and provide directions to submit future payment to the central collections unit.\nThe commissioner of human services may establish a revolving account to cover funds issued in error due to insufficient funds or other reasons. Appropriations for this purpose and all recoupments against payments from the account shall be deposited in the collections unit's recoupment account and are appropriated to the commissioner. Any unexpended balance in the account does not cancel, but is available until expended.\n(a) If support payments have not been disbursed to an obligee because the obligee is not located, the public authority shall continue locate efforts for one year from the date the public authority determines that the obligee is not located.\n(b) If the public authority is unable to locate the obligee after one year, the public authority shall mail a written notice to the obligee at the obligee's last known address. The notice shall give the obligee 60 days to contact the public authority. If the obligee does not contact the public authority within 60 days from the date of notice, the public authority shall:\n(1) close the nonpublic assistance portion of the case;\n(2) disburse unclaimed support funds to pay public assistance arrears. If public assistance arrears remain after disbursing the unclaimed support funds, the public authority may continue enforcement and collection of child support until all public assistance arrears have been paid. If there are no public assistance arrears, or unclaimed support funds remain after paying public assistance arrears, remaining unclaimed support funds shall be returned to the obligor; and\n(3) mail, when all public assistance arrears have been paid the public authority, to the obligor at the obligor's last known address a written notice of termination of income withholding and case closure due to the public authority's inability to locate the obligee. The notice must indicate that the obligor's support or maintenance obligation will remain in effect until further order of the court and must inform the obligor that the obligor can contact the public authority for assistance to modify the order. A copy of the form prepared by the state court administrator's office under section 518A.39, subdivision 6, must be included with the notice.\n(c) If the obligor is not located when attempting to return unclaimed support funds, the public authority shall continue locate efforts for one year from the date the public authority determines that the obligor is not located. If the public authority is unable to locate the obligor after one year, the funds shall be treated as unclaimed property according to federal law and chapter 345.\nPayments to the commissioner from other governmental units, private enterprises, and individuals for services performed by the child support payment center must be deposited in the state systems account authorized under section 256.014. These payments are appropriated to the commissioner for the operation of the child support payment center or system, according to section 256.014.",
	"repealed": false
}