{
	"id": "13.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.10",
	"title": "13.10 DATA ON DECEDENTS.",
	"text": "As used in this chapter:\n(a) \"Confidential data on decedents\" are data which, prior to the death of the data subject, were classified by statute, federal law, or temporary classification as confidential data.\n(b) \"Private data on decedents\" are data which, prior to the death of the data subject, were classified by statute, federal law, or temporary classification as private data.\n(c) \"Representative of the decedent\" is the personal representative of the estate of the decedent during the period of administration, or if no personal representative has been appointed or after discharge of the personal representative, the surviving spouse, any child of the decedent, or, if there is no surviving spouse or children, the parents of the decedent.\nUpon the death of the data subject, private data and confidential data shall become, respectively, private data on decedents and confidential data on decedents. Private data on decedents and confidential data on decedents shall become public when ten years have elapsed from the actual or presumed death of the individual and 30 years have elapsed from the creation of the data. For purposes of this subdivision, an individual is presumed to be dead if either 90 years elapsed since the creation of the data or 90 years have elapsed since the individual's birth, whichever is earlier, except that an individual is not presumed to be dead if readily available data indicate that the individual is still living.\nRights conferred by this chapter on individuals who are the subjects of private or confidential data shall, in the case of private data on decedents or confidential data on decedents, be exercised by the representative of the decedent. Nonpublic data concerning a decedent, created or collected after death, are accessible by the representative of the decedent. Nothing in this section may be construed to prevent access to appropriate data by a trustee appointed in a wrongful death action.\nAny person may bring an action in the district court located in the county where the data is being maintained or, in the case of data maintained by a state agency, in any county, to authorize release of private data on decedents or confidential data on decedents. Individuals clearly identified in the data or the representative of the decedent may be given notice if doing so does not cause an undue delay in hearing the matter and, in any event, shall have standing in the court action. The responsible authority for the data being sought or any interested person may provide information regarding the possible harm or benefit from granting the request. The data in dispute shall be examined by the court in camera. The court may order all or part of the data to be released to the public or to the person bringing the action. In deciding whether or not to release the data, the court shall consider whether the harm to the surviving spouse, children, or next of kin of the decedent, the harm to any other individual identified in the data, or the harm to the public outweighs the benefit to the person bringing the action or the benefit of the public. The court shall make a written statement of findings in support of its decision.\nNotwithstanding any provision of this or any other chapter, adoption records shall be treated as provided in sections 259.53, 259.61, 259.79, and 259.83 to 259.88.\nNothing in this section may be construed to require retention of government data, including private data on decedents or confidential data on decedents, for periods of time other than those established by the procedures provided in section 138.17, or any other statute.",
	"repealed": false
}