{
	"id": "122A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.40",
	"title": "122A.40 EMPLOYMENT; CONTRACTS; TERMINATION.",
	"text": "A principal, supervisor, and classroom teacher and any other professional employee required to hold a license from the state department shall be deemed to be a \"teacher\" within the meaning of this section. A superintendent is a \"teacher\" only for purposes of subdivisions 3 and 19.\nFor purposes of this section, \"nonprovisional license\" means an entrance, continuing, or life license.\n(a) School boards must hire or dismiss teachers at duly called meetings. Where spouses, brother and sister, or two brothers or sisters, constitute a quorum, no contract employing a teacher shall be made or authorized except upon the unanimous vote of the full board. A teacher related by blood or marriage, within the fourth degree, computed by the civil law, to a board member shall not be employed except by a unanimous vote of the full board. The initial employment of the teacher in the district must be by written contract, signed by the teacher and by the chair and clerk. All subsequent employment of the teacher in the district must be by written contract, signed by the teacher and by the chair and clerk, except where there is a master agreement covering the employment of the teacher. Contracts for teaching or supervision of teaching can be made only with qualified teachers. A teacher shall not be required to reside within the employing district as a condition to teaching employment or continued teaching employment.\n(b) A school district must annually report to the Professional Educator Licensing and Standards Board: (1) all new teacher hires and terminations, including layoffs, by race and ethnicity; and (2) the reasons for all teacher resignations and requested leaves of absence. The report must not include data that would personally identify individuals.\nNotwithstanding other law, a teacher, as defined in section 179A.03, does not have a right to employment in a district as an assistant superintendent, as a principal defined in section 179A.03, as a confidential or supervisory employee defined in section 179A.03, or in a position that is a promotion from the position currently held, based on seniority, seniority date, or order of employment by the district. This provision shall not alter the reinstatement rights of an individual who is placed on leave from an assistant superintendent, principal or assistant principal, or supervisory or confidential employee position pursuant to this chapter.\n(a) The first three consecutive years of a teacher's first teaching experience in Minnesota in a single district are deemed to be a probationary period of employment, and, the probationary period in each district in which the teacher is thereafter employed shall be one year. The school board must adopt a plan for written evaluation of teachers during the probationary period that is consistent with subdivision 8. Evaluation must occur at least three times periodically throughout each school year for a teacher performing services during that school year; the first evaluation must occur within the first 90 days of teaching service. Days devoted to parent-teacher conferences, teachers' workshops, and other staff development opportunities and days on which a teacher is absent from school must not be included in determining the number of school days on which a teacher performs services. Except as otherwise provided in paragraph (b), during the probationary period any annual contract with any teacher may or may not be renewed as the school board shall see fit. However, the board must give any such teacher whose contract it declines to renew for the following school year written notice to that effect before July 1. If the teacher requests reasons for any nonrenewal of a teaching contract, the board must give the teacher its reason in writing, including a statement that appropriate supervision was furnished describing the nature and the extent of such supervision furnished the teacher during the employment by the board, within ten days after receiving such request. The school board may, after a hearing held upon due notice, discharge a teacher during the probationary period for cause, effective immediately, under section 122A.44.\n(b) A board must discharge a probationary teacher, effective immediately, upon receipt of notice under section 122A.20, subdivision 1, paragraph (b), that the teacher's license has been revoked due to a conviction for child abuse or sexual abuse.\n(c) A probationary teacher whose first three years of consecutive employment are interrupted for active military service and who promptly resumes teaching consistent with federal reemployment timelines for uniformed service personnel under United States Code, title 38, section 4312(e), is considered to have a consecutive teaching experience for purposes of paragraph (a).\n(d) A probationary teacher whose first three years of consecutive employment are interrupted for maternity, paternity, or medical leave and who resumes teaching within 12 months of when the leave began is considered to have a consecutive teaching experience for purposes of paragraph (a) if the probationary teacher completes a combined total of three years of teaching service immediately before and after the leave.\n(e) A probationary teacher must complete at least 90 days of teaching service each year during the probationary period. Days devoted to parent-teacher conferences, teachers' workshops, and other staff development opportunities and days on which a teacher is absent from school do not count as days of teaching service under this paragraph.\n(f) Notwithstanding any law to the contrary, a teacher who has taught for three consecutive years in a single school district or single charter school in Minnesota or another state must serve a probationary period of no longer than one year in a Minnesota school district.\nA school board and an exclusive representative of the teachers in the district must develop a probationary teacher peer review process through joint agreement that is consistent with subdivision 8. The process may include having trained observers serve as mentors or coaches or having teachers participate in professional learning communities.\n(a) A teacher who has completed a probationary period in any district, and who has not been discharged or advised of a refusal to renew the teacher's contract under subdivision 5, shall elect to have a continuing contract with such district where contract terms and conditions, including salary and salary increases, are established based either on the length of the school calendar or an extended school calendar under section 120A.415. Thereafter, the teacher's contract must remain in full force and effect, except as modified by mutual consent of the board and the teacher, until terminated by a majority roll call vote of the full membership of the board prior to April 1 upon one of the grounds specified in subdivision 9 or July 1 upon one of the grounds specified in subdivision 10 or 11, or until the teacher is discharged pursuant to subdivision 13, or by the written resignation of the teacher submitted prior to April 1. If an agreement as to the terms and conditions of employment for the succeeding school year has not been adopted pursuant to the provisions of sections 179A.01 to 179A.25 prior to March 1, the teacher's right of resignation is extended to the 30th calendar day following the adoption of said contract in compliance with section 179A.20, subdivision 5. Such written resignation by the teacher is effective as of June 30 if submitted prior to that date and the teachers' right of resignation for the school year then beginning shall cease on July 15. Before a teacher's contract is terminated by the board, the board must notify the teacher in writing and state its ground for the proposed termination in reasonable detail together with a statement that the teacher may make a written request for a hearing before the board within 14 days after receipt of such notification. If the grounds are those specified in subdivision 9 or 13, the notice must also state a teacher may request arbitration under subdivision 15. Within 14 days after receipt of this notification the teacher may make a written request for a hearing before the board or an arbitrator and it shall be granted upon reasonable notice to the teacher of the date set for hearing, before final action is taken. If no hearing is requested within such period, it shall be deemed acquiescence by the teacher to the board's action. Such termination shall take effect at the close of the school year in which the contract is terminated in the manner aforesaid. Such contract may be terminated at any time by mutual consent of the board and the teacher and this section does not affect the powers of a board to suspend, discharge, or demote a teacher under and pursuant to other provisions of law.\n(b) A teacher electing to have a continuing contract based on the extended school calendar under section 120A.415 must participate in staff development training under subdivision 7a and shall receive an increased base salary.\n(a) A teacher electing to have a continuing contract based on the extended school calendar under section 120A.415 must participate in a total number of staff development days where the total number of such days equals the difference between the total number of days of student instruction and 240 days. Staff development includes peer mentoring, peer gathering, continuing education, professional development, or other training. A school board may schedule such days throughout the calendar year. Staff development programs provided during such days shall enable teachers to achieve the staff development outcomes under section 122A.60, subdivision 3.\n(b) A public employer and the exclusive representative of the teachers must include terms in the collective bargaining agreement for all teachers who participate in additional staff development days under paragraph (a) that increase base salaries.\n(a) To improve student learning and success, a school board and an exclusive representative of the teachers in the district, consistent with paragraph (b), may develop a teacher evaluation and peer review process for probationary and continuing contract teachers through joint agreement. If a school board and the exclusive representative of the teachers do not agree to an annual teacher evaluation and peer review process, then the school board and the exclusive representative of the teachers must implement the state teacher evaluation plan under paragraph (c). The process must include having trained observers serve as peer coaches or having teachers participate in professional learning communities, consistent with paragraph (b).\n(b) To develop, improve, and support qualified teachers and effective teaching practices, improve student learning and success, and provide all enrolled students in a district or school with improved and equitable access to more effective and diverse teachers, the annual evaluation process for teachers:\n(1) must, for probationary teachers, provide for all evaluations required under subdivision 5;\n(2) must establish a three-year professional review cycle for each teacher that includes an individual growth and development plan, a peer review process, and at least one summative evaluation performed by a qualified and trained evaluator such as a school administrator. For the years when a tenured teacher is not evaluated by a qualified and trained evaluator, the teacher must be evaluated by a peer review;\n(3) must include a rubric of performance standards for teacher practice that: (i) is based on the standards of effective practice in Minnesota Rules, part 8710.2000; (ii) includes culturally responsive methodologies; and (iii) provides common descriptions of effectiveness using at least three levels of performance;\n(4) must coordinate staff development activities under sections 122A.60 and 122A.61 with this evaluation process and teachers' evaluation outcomes;\n(5) may provide time during the school day and school year for peer coaching and teacher collaboration;\n(6) may include job-embedded learning opportunities such as professional learning communities;\n(7) may include mentoring and induction programs for teachers, including teachers who are members of populations underrepresented among the licensed teachers in the district or school and who reflect the diversity of students under section 120B.35, subdivision 3, paragraph (b), clause (2), who are enrolled in the district or school;\n(8) must include an option for teachers to develop and present a portfolio demonstrating evidence of reflection and professional growth, consistent with section 122A.187, subdivision 3, and include teachers' own performance assessment based on student work samples and examples of teachers' work, which may include video among other activities for the summative evaluation;\n(9) must use data from valid and reliable assessments aligned to state and local academic standards and must use state and local measures of student growth and literacy that may include value-added models or student learning goals to determine 35 percent of teacher evaluation results;\n(10) must use longitudinal data on student engagement and connection, and other student outcome measures explicitly aligned with the elements of curriculum for which teachers are responsible, including academic literacy, oral academic language, and achievement of content areas of English learners;\n(11) must require qualified and trained evaluators such as school administrators to perform summative evaluations and ensure school districts and charter schools provide for effective evaluator training specific to teacher development and evaluation;\n(12) must give teachers not meeting professional teaching standards under clauses (3) to (11) support to improve through a teacher improvement process that includes established goals and timelines; and\n(13) must discipline a teacher for not making adequate progress in the teacher improvement process under clause (12) that may include a last chance warning, termination, discharge, nonrenewal, transfer to a different position, a leave of absence, or other discipline a school administrator determines is appropriate.\nData on individual teachers generated under this subdivision are personnel data under section 13.43. The observation and interview notes of peer coaches may only be disclosed to other school officials with the consent of the teacher being coached.\n(c) The department, in consultation with parents who may represent parent organizations and teacher and administrator representatives appointed by their respective organizations, representing the Professional Educator Licensing and Standards Board, the Minnesota Association of School Administrators, the Minnesota School Boards Association, the Minnesota Elementary and Secondary Principals Associations, Education Minnesota, and representatives of the Minnesota Assessment Group, the Minnesota Business Partnership, the Minnesota Chamber of Commerce, and Minnesota postsecondary institutions with research expertise in teacher evaluation, must create and publish a teacher evaluation process that complies with the requirements in paragraph (b) and applies to all teachers under this section and section 122A.41 for whom no agreement exists under paragraph (a) for an annual teacher evaluation and peer review process. The teacher evaluation process created under this subdivision does not create additional due process rights for probationary teachers under subdivision 5.\n(d) Consistent with the measures of teacher effectiveness under this subdivision:\n(1) for students in kindergarten through grade 4, a school administrator must not place or approve the placement of a student in the classroom of a teacher who is in the improvement process referenced in paragraph (b), clause (12), or has not had a summative evaluation if, in the prior year, that student was in the classroom of a teacher who received discipline pursuant to paragraph (b), clause (13), unless no other teacher at the school teaches that grade; and\n(2) for students in grades 5 through 12, a school administrator must not place or approve the placement of a student in the classroom of a teacher who is in the improvement process referenced in paragraph (b), clause (12), or has not had a summative evaluation if, in the prior year, that student was in the classroom of a teacher who received discipline pursuant to paragraph (b), clause (13), unless no other teacher at the school teaches that subject area and grade.\nAll data created and used under this paragraph retains its classification under chapter 13.\n[See Note.]\nA continuing contract may be terminated, effective at the close of the school year, upon any of the following grounds:\n(1) inefficiency in teaching or in the management of a school, consistent with subdivision 8, paragraph (b);\n(2) neglect of duty, or persistent violation of school laws, rules, regulations, or directives;\n(3) conduct unbecoming a teacher which materially impairs the teacher's educational effectiveness; or\n(4) other good and sufficient grounds rendering the teacher unfit to perform the teacher's duties.\nA contract must not be terminated upon one of the grounds specified in clause (1), (2), (3), or (4), unless the teacher fails to correct the deficiency after being given written notice of the specific items of complaint and reasonable time within which to remedy them.\nThe school board and the exclusive bargaining representative of the teachers must negotiate a plan providing for unrequested leave of absence without pay or fringe benefits for as many teachers as may be necessary because of discontinuance of position, lack of pupils, financial limitations, or merger of classes caused by consolidation of districts.\nMS 2018 [Repealed, 1Sp2017 c 5 art 2 s 58]\nAffliction with a communicable disease, mental illness, drug or alcoholic addiction, or other serious incapacity shall be grounds for temporary suspension and leave of absence while the teacher is suffering from such disability. Unless the teacher consents, such action must be taken only upon evidence that suspension is required from a physician who has examined the teacher. The physician must be competent in the field involved and must be selected by the teacher from a list of three provided by the school board, and the examination must be at the expense of the school district. A copy of the report of the physician shall be furnished the teacher upon request. If the teacher fails to submit to the examination within the prescribed time, the board may discharge the teacher, effective immediately. In the event of mental illness, if the teacher submits to such an examination and the examining physician's or psychiatrist's statement is unacceptable to the teacher or the board, a panel of three physicians or psychiatrists must be selected to examine the teacher at the board's expense. The board and the teacher shall each select a member of this panel, and these two members shall select a third member. The panel must examine the teacher and submit a statement of its findings and conclusions to the board. Upon receipt and consideration of the statement from the panel the board may suspend the teacher. The board must notify the teacher in writing of such suspension and the reasons therefor. During the leave of absence, the district must pay the teacher sick leave benefits up to the amount of unused accumulated sick leave, and after it is exhausted, the district may in its discretion pay additional benefits. The teacher must be reinstated to the teacher's position upon evidence from such a physician of sufficient recovery to be capable of resuming performance of duties in a proper manner. In the event that the teacher does not qualify for reinstatement within 12 months after the date of suspension, the continuing disability may be a ground for discharge under subdivision 13.\n(a) Except as otherwise provided in paragraph (b), a board may discharge a continuing-contract teacher, effective immediately, upon any of the following grounds:\n(1) immoral conduct, insubordination, or conviction of a felony;\n(2) conduct unbecoming a teacher which requires the immediate removal of the teacher from classroom or other duties;\n(3) failure without justifiable cause to teach without first securing the written release of the school board;\n(4) gross inefficiency which the teacher has failed to correct after reasonable written notice;\n(5) willful neglect of duty; or\n(6) continuing physical or mental disability subsequent to a 12 months leave of absence and inability to qualify for reinstatement in accordance with subdivision 12.\nFor purposes of this paragraph, conduct unbecoming a teacher includes an unfair discriminatory practice described in section 363A.13.\nPrior to discharging a teacher under this paragraph, the board must notify the teacher in writing and state its ground for the proposed discharge in reasonable detail. Within ten days after receipt of this notification the teacher may make a written request for a hearing before the board and it shall be granted before final action is taken. The board may suspend a teacher with pay pending the conclusion of the hearing and determination of the issues raised in the hearing after charges have been filed which constitute ground for discharge. If a teacher has been charged with a felony and the underlying conduct that is the subject of the felony charge is a ground for a proposed immediate discharge, the suspension pending the conclusion of the hearing and determination of the issues may be without pay. If a hearing under this paragraph is held, the board must reimburse the teacher for any salary or compensation withheld if the final decision of the board or the arbitrator does not result in a penalty to or suspension, termination, or discharge of the teacher.\n(b) A board must discharge a continuing-contract teacher, effective immediately, upon receipt of notice under section 122A.20, subdivision 1, paragraph (b), that the teacher's license has been revoked due to a conviction for child abuse, as defined in section 609.185; sex trafficking in the first degree under section 609.322, subdivision 1; sex trafficking in the second degree under section 609.322, subdivision 1a; engaging in hiring or agreeing to hire a minor to engage in prostitution under section 609.324, subdivision 1; sexual abuse under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 617.23, subdivision 3; solicitation of children to engage in sexual conduct or communication of sexually explicit materials to children under section 609.352; interference with privacy under section 609.746 or harassment or stalking under section 609.749 and the victim was a minor; using minors in a sexual performance under section 617.246; possessing pornographic works involving a minor under section 617.247; or any other offense not listed in this paragraph that requires the person to register as a predatory offender under section 243.166, or a crime under a similar law of another state or the United States.\n(c) When a teacher is discharged under paragraph (b) or when the commissioner makes a final determination of child maltreatment involving a teacher under section 260E.35, subdivision 5, the school principal or other person having administrative control of the school must include in the teacher's employment record the information contained in the record of the disciplinary action or the final maltreatment determination, consistent with the definition of public data under section 13.41, subdivision 5, and must provide the Professional Educator Licensing and Standards Board and the licensing division at the department with the necessary and relevant information to enable the Professional Educator Licensing and Standards Board and the department's licensing division to fulfill their statutory and administrative duties related to issuing, renewing, suspending, or revoking a teacher's license. Information received by the Professional Educator Licensing and Standards Board or the licensing division at the department under this paragraph is governed by section 13.41 or other applicable law governing data of the receiving entity. In addition to the background check required under section 123B.03, a school board or other school hiring authority must contact the Professional Educator Licensing and Standards Board and the department to determine whether the teacher's license has been suspended or revoked, consistent with the discharge and final maltreatment determinations identified in this paragraph. Unless restricted by federal or state data practices law or by the terms of a collective bargaining agreement, the responsible authority for a school district must disseminate to another school district private personnel data on a current or former teacher employee or contractor of the district, including the results of background investigations, if the requesting school district seeks the information because the subject of the data has applied for employment with the requesting school district.\nAny hearing held pursuant to this section must be held upon appropriate and timely notice to the teacher, and any hearing held pursuant to subdivision 9 or 13 must be private or public at the discretion of the teacher. At the hearing, the board and the teacher may each be represented by counsel at each party's own expense, and such counsel may examine and cross-examine witnesses and present arguments. The board must first present evidence to sustain the grounds for termination or discharge and then receive evidence presented by the teacher. Each party may then present rebuttal evidence. Dismissal of the teacher must be based upon substantial and competent evidence in the record. All witnesses shall be sworn upon oath administered by the presiding officer of the board. The clerk of the board shall issue subpoenas for witnesses or the production of records pertinent to the grounds upon the request of either the board or the teacher. The board must employ a court reporter to record the proceedings at the hearing, and either party may obtain a transcript of the hearing at its own expense.\nA teacher whose termination is proposed under subdivision 7 on grounds specified in subdivision 9, or whose discharge is proposed under subdivision 13, may elect a hearing before an arbitrator instead of the school board. The hearing is governed by this subdivision.\n(a) The teacher must make a written request for a hearing before an arbitrator within 14 days after receiving notification of proposed termination on grounds specified in subdivision 9 or within ten days of receiving notification of proposed discharge under subdivision 13. If a request for a hearing does not specify that the hearing be before an arbitrator, it is considered to be a request for a hearing before the school board.\n(b) If the teacher and the school board are unable to mutually agree on an arbitrator, the board must request from the bureau of mediation services a list of five persons to serve as an arbitrator. If the matter to be heard is a proposed termination on grounds specified in subdivision 9, arbitrators on the list must be available to hear the matter and make a decision within a time frame that will allow the board to comply with all statutory timelines relating to termination. If the teacher and the board are unable to mutually agree on an arbitrator from the list provided, the parties shall alternately strike names from the list until the name of one arbitrator remains. The person remaining after the striking procedure must be the arbitrator. If the parties are unable to agree on who shall strike the first name, the question must be decided by a flip of a coin. The teacher and the school board must share equally the costs and fees of the arbitrator.\n(c) The arbitrator shall determine, by a preponderance of the evidence, whether the grounds for termination or discharge specified in subdivision 9 or 13 exist to support the proposed termination or discharge. A lesser penalty than termination or discharge may be imposed by the arbitrator only to the extent that either party proposes such lesser penalty in the proceeding. In making the determination, the arbitration proceeding is governed by sections 572B.15 to 572B.28 and by the collective bargaining agreement applicable to the teacher.\n(d) An arbitration hearing conducted under this subdivision is a meeting for preliminary consideration of allegations or charges within the meaning of section 13D.05, subdivision 3, paragraph (a), and must be closed, unless the teacher requests it to be open.\n(e) The arbitrator's award is final and binding on the parties, subject to sections 572B.18 to 572B.28.\nAfter the hearing, the board must issue a written decision and order. If the board orders termination of a continuing contract or discharge of a teacher, its decision must include findings of fact based upon competent evidence in the record and must be served on the teacher, accompanied by an order of termination or discharge, prior to April 1 in the case of a contract termination for grounds specified in subdivision 9, prior to July 1 for grounds specified in subdivision 10 or 11, or within ten days after conclusion of the hearing in the case of a discharge. If the decision of the board or of a reviewing court is favorable to the teacher, the proceedings must be dismissed and the decision entered in the board minutes, and all references to such proceedings must be excluded from the teacher's record file.\nThe pendency of judicial proceedings must not be grounds for postponement of the effective date of the board's order, but if judicial review eventuates in reinstatement of the teacher, the board must pay the teacher all compensation withheld as a result of the termination or dismissal order.\nThis section does not apply to any district in a city of the first class.\nAll evaluations and files generated within a school district relating to each individual teacher must be available to each individual teacher upon written request. Effective January 1, 1976, all evaluations and files, wherever generated, relating to each individual teacher must be available to each individual teacher upon written request. The teacher shall have the right to reproduce any of the contents of the files at the teacher's expense and to submit for inclusion in the file written information in response to any material contained therein.\nA district may destroy the files as provided by law and must expunge from the teacher's file any material found to be false or inaccurate through the grievance procedure required pursuant to section 179A.20, subdivision 4. The grievance procedure promulgated by the director of the bureau of mediation services, pursuant to section 179A.04, subdivision 3, clause (h), applies to those principals and supervisory employees not included in an appropriate unit as defined in section 179A.03. Expungement proceedings must be commenced within the time period provided in the collective bargaining agreement for the commencement of a grievance. If no time period is provided in the bargaining agreement, the expungement proceedings must commence within 15 days after the teacher has knowledge of the inclusion in the teacher's file of the material the teacher seeks to have expunged.",
	"repealed": false
}