{
	"id": "136A.825",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.825",
	"title": "136A.825 PERMITS FOR SOLICITORS.",
	"text": "A solicitor representing a private career school must obtain a solicitor's permit from the office before soliciting students to enroll in the private career school. Such permit shall expire one year following the date of issuance. Application for renewal of permit shall be made annually.\n(a) The application for the permit shall state the full name, address, previous employment, and such other information concerning the solicitor applicant as the office may require.\n(b) The application shall have attached to it a certified affidavit signed by a private career school official and the solicitor attesting to the fact that the applicant has been furnished a copy, has read and has knowledge of the provisions of this chapter and Minnesota Rules.\nNo permit shall be issued to any solicitor unless such solicitor files with the office a continuous corporate surety bond in the sum of $2,000 conditioned upon the faithful performance of all contracts and agreements with the students made by the solicitor. Such bonds shall run to the state of Minnesota and to any person who may have cause of action against the applicant arising at any time after the bond is filed and before it is canceled for breach of any contract or agreement made by the solicitor with any student. The aggregate liability of the surety for all breaches of the conditions of the bond shall not exceed the principal sum of $2,000. The surety of any such bond may cancel it upon giving 60 days' notice in writing to the office and shall be relieved of liability for any breach of condition occurring after the effective date of cancellation. In lieu of bond, the solicitor may deposit with the commissioner of management and budget the sum of $2,000.\nA solicitor representing more than one private career school must obtain a separate permit for each private career school represented; however when a solicitor represents private career schools having a common ownership, only one permit shall be required.\nThe initial and renewal application for each permit shall be accompanied by a nonrefundable fee under section 136A.824.\nAny contract entered into by a solicitor for a licensed private career school shall be unenforceable in any action brought thereon if the solicitor does not hold a valid permit as required by this section.",
	"repealed": false
}