{
	"id": "469.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.171",
	"title": "469.171 BORDER CITY ENTERPRISE ZONES; STATE TAX REDUCTIONS.",
	"text": "(a) The following types of tax reductions may be approved by the commissioner for businesses located in a border city enterprise zone, after the governing body of the border city has designated an area or areas, each consisting of at least 100 acres, of the city not in excess of a total of 400 acres in which the tax reductions may be provided:\n(1) an exemption from the general sales tax imposed by chapter 297A for purchases of construction materials or equipment for use in the zone if the purchase was made after the date of application for the zone;\n(2) a credit against the income tax of an employer for additional workers employed in the zone, other than workers employed in construction, up to a maximum of $3,000 per employee per year;\n(3) an income tax credit for a percentage of the cost of debt financing to construct new or expanded facilities in the zone; and\n(4) a state paid property tax credit for a portion of the property taxes paid by a new commercial or industrial facility or the additional property taxes paid by an expansion of an existing commercial or industrial facility in the zone.\n(b) An application for a tax reduction under this subdivision may not be approved unless the governing body finds that the construction or improvement of the facility is not likely to have the effect of transferring existing employment from a location outside of the municipality but within the state.\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nUpon designation of an enterprise zone and approval by the commissioner of the tax reductions to be made available therein, the commissioner of revenue shall implement the tax reductions.\nThe tax reductions provided by this section shall not apply to (1) a facility the primary purpose of which is one of the following: the provision of recreation or entertainment, or a private or commercial golf course, country club, massage parlor, tennis club, skating facility including roller skating, skateboard, and ice skating, racquet sports facility, including any handball or racquetball court, hot tub facility, suntan facility, or racetrack; (2) property of a public utility; (3) property used in the operation of a financial institution; (4) property owned by a fraternal or veterans' organization; or (5) a retail food or beverage facility operating under a franchise agreement that requires the business to be located in this state.\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nIn addition to the tax reductions authorized by subdivision 1, for a border city zone, the following types of tax reductions may be approved:\n(1) a credit against income tax for workers employed in the zone and not qualifying for a credit under subdivision 1, clause (2), subject to a maximum of $1,500 per employee per year;\n(2) a state paid property tax credit for a portion of the property taxes paid by a commercial or industrial facility located in the zone.\nThe commissioner may allocate $2,000,000 for tax reductions pursuant to subdivision 9 to border city enterprise zones. This money shall be allocated among the zones on a per capita basis. Tax reductions authorized by this subdivision may not be allocated to any property which is:\n(1) a facility the primary purpose of which is one of the following: the provision of recreation or entertainment, or a private or commercial golf course, country club, massage parlor, tennis club, skating facility including roller skating, skateboard, and ice skating, racquet sports facility, including any handball or racquetball court, hot tub facility, suntan facility, or racetrack;\n(2) property of a public utility;\n(3) property used in the operation of a financial institution;\n(4) property owned by a fraternal or veterans' organization;\n(5) property of a retail food or beverage service business operating under a franchise agreement that requires the business to be located in the state.\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nEach tax reduction provided to a business that is located in a border city enterprise zone may be provided until the allocations provided under subdivision 6a, and under section 469.169, have been expended. Subject to the limitation in this subdivision, the tax reductions may be provided after expiration of the zone's designation.\nThere is annually appropriated from the general fund to the commissioner of revenue the amounts required to reimburse taxing jurisdictions for the revenue lost due to the property tax credit provided in subdivision 1, clause (4). Payment shall be made to taxing jurisdictions in the same proportion that the ad valorem tax is distributed. Payment shall be made to taxing jurisdictions, other than school districts, at the time provided in section 473H.10, subdivision 3.\nThe income tax credits provided pursuant to subdivisions 1 and 6 may be refundable.\nAny business that (1) receives tax reductions authorized by subdivisions 1 to 8; and (2) ceases to operate its facility located within the border city enterprise zone shall repay the amount of the tax reduction or local contribution received during the two years immediately before it ceased to operate in the zone.\nThe repayment must be paid to the state to the extent it represents a tax reduction under subdivisions 1 to 8 and to the municipality to the extent it represents a property tax reduction or other local contribution. Any amount repaid to the state must be credited to the amount certified as available for tax reductions in the zone pursuant to the city's allocation. Any amount repaid to the municipality must be used by the municipality for economic development purposes. The commissioner of revenue may seek repayment of tax credits from a business ceasing to operate within an enterprise zone by utilizing any remedies available for the collection of tax.\nWhen tax credits allowed under subdivisions 1 to 8 result in an overpayment within the meaning of section 289A.50, the excess to be refunded to the taxpayer shall bear interest at the amount specified in section 270C.405, computed from 90 days after (1) the due date of the return or (2) the date on which the return is filed, whichever is later, to the date the refund is paid.\nThis subdivision applies only to state tax reductions first authorized by the municipality to be provided to a business within eight months of the expiration of the border city enterprise zone's designation.\nBefore agreeing with a business to provide tax reductions, the municipality must submit the proposed tax reductions to the commissioner for approval. The commissioner shall review and analyze the proposal in light of, at least: (1) the proposed investment that the business will make in the zone, (2) the number and quality of new jobs that will be created in the zone, (3) the overall positive impact on economic activity in the zone, and (4) the extent to which the impacts in clauses (1) to (3) are dependent upon providing the state tax reductions to the business. The commissioner shall disapprove the proposal if the commissioner determines the public benefits of increased investment and employment resulting from the tax reductions is disproportionately small relative to the cost of the state tax reductions. If the commissioner disapproves of the proposal, the tax reductions are not allowed to the business.\nIf the municipality submits the proposal to the commissioner before expiration of the zone designation, the authority to grant the tax reductions continues until the commissioner acts on the proposal.",
	"repealed": false
}