{
	"id": "624.7131",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7131",
	"title": "624.7131 TRANSFEREE PERMIT; PENALTY.",
	"text": "Any person may apply for a transferee permit by providing the following information in writing to the chief of police of an organized full time police department of the municipality in which the person resides or to the county sheriff if there is no such local chief of police:\n(1) the name, residence, telephone number, and driver's license number or nonqualification certificate number, if any, of the proposed transferee;\n(2) the sex, date of birth, height, weight, and color of eyes, and distinguishing physical characteristics, if any, of the proposed transferee;\n(3) a statement that the proposed transferee authorizes the release to the local police authority of commitment information about the proposed transferee maintained by the commissioner of human services, to the extent that the information relates to the proposed transferee's eligibility to possess a pistol or semiautomatic military-style assault weapon under section 624.713, subdivision 1; and\n(4) a statement by the proposed transferee that the proposed transferee is not prohibited by section 624.713 from possessing a pistol or semiautomatic military-style assault weapon.\nThe statements shall be signed and dated by the person applying for a permit. At the time of application, the local police authority shall provide the applicant with a dated receipt for the application. The statement under clause (3) must comply with any applicable requirements of Code of Federal Regulations, title 42, sections 2.31 to 2.35, with respect to consent to disclosure of alcohol or drug abuse patient records.\nThe chief of police or sheriff shall check criminal histories, records and warrant information relating to the applicant through the Minnesota Crime Information System, the national criminal record repository, and the National Instant Criminal Background Check System. The chief of police or sheriff shall also make a reasonable effort to check other available state and local record-keeping systems. The chief of police or sheriff shall obtain commitment information from the commissioner of human services as provided in section 246C.15.\nChiefs of police and sheriffs shall make transferee permit application forms available throughout the community. There shall be no charge for forms, reports, investigations, notifications, waivers or any other act performed or materials provided by a government employee or agency in connection with application for or issuance of a transferee permit.\n(a) The chief of police or sheriff shall refuse to grant a transferee permit if the applicant is: (1) prohibited by state or federal law from possessing a pistol or semiautomatic military-style assault weapon; (2) determined to be a danger to self or the public when in possession of firearms under paragraph (b); or (3) listed in the criminal gang investigative data system under section 299C.091.\n(b) A chief of police or sheriff shall refuse to grant a permit to a person if there exists a substantial likelihood that the applicant is a danger to self or the public when in possession of a firearm. To deny the application pursuant to paragraph (a), clause (2), the chief of police or sheriff must provide the applicant with written notification and the specific factual basis justifying the denial, including the source of the factual basis. The chief of police or sheriff must inform the applicant of the applicant's right to submit, within 20 business days, any additional documentation relating to the propriety of the denial. Upon receiving any additional documentation, the chief of police or sheriff must reconsider the denial and inform the applicant within 15 business days of the result of the reconsideration. Any denial after reconsideration must be in the same form and substance as the original denial and must specifically address any continued deficiencies in light of the additional documentation submitted by the applicant. The applicant must be informed of the right to seek de novo review of the denial as provided in subdivision 8.\n(c) A person is not eligible to submit a permit application under this section if the person has had an application denied pursuant to paragraph (b) and less than six months have elapsed since the denial was issued or the person's appeal under subdivision 8 was denied, whichever is later.\n(d) A chief of police or sheriff who denies a permit application pursuant to paragraph (b) must provide a copy of the notice of disqualification to the chief of police or sheriff with joint jurisdiction over the proposed transferee's residence.\n(a) The chief of police or sheriff shall issue a transferee permit or deny the application within 30 days of application for the permit.\n(b) In the case of a denial, the chief of police or sheriff shall provide an applicant with written notification of a denial and the specific reason for the denial.\n(c) The permits and their renewal shall be granted free of charge.\nTransferee permits issued pursuant to this section are valid statewide and shall expire after one year. A transferee permit may be renewed in the same manner and subject to the same provisions by which the original permit was obtained, except that all renewed permits must comply with the standards adopted by the commissioner under section 624.7151. Permits issued pursuant to this section are not transferable. A person who transfers a permit in violation of this subdivision is guilty of a misdemeanor.\n(a) The transferee permit shall be void at the time that the holder becomes prohibited from possessing or receiving a pistol under section 624.713, in which event the holder shall return the permit within five days to the issuing authority. If the chief law enforcement officer who issued the permit has knowledge that the permit holder is ineligible to possess firearms, the chief law enforcement officer must revoke the permit and give notice to the holder in writing. Failure of the holder to return the permit within the five days of learning that the permit is void or revoked is a gross misdemeanor unless the court finds that the circumstances or the physical or mental condition of the permit holder prevented the holder from complying with the return requirement.\n(b) When a permit holder receives a court disposition that prohibits the permit holder from possessing a firearm, the court must take possession of the permit, if it is available, and send it to the issuing law enforcement agency. If the permit holder does not have the permit when the court imposes a firearm prohibition, the permit holder must surrender the permit to the assigned probation officer, if applicable. When a probation officer is assigned upon disposition of the case, the court shall inform the probation agent of the permit holder's obligation to surrender the permit. Upon surrender, the probation officer must send the permit to the issuing law enforcement agency. If a probation officer is not assigned to the permit holder, the holder shall surrender the permit as provided for in paragraph (a).\n(a) Any person aggrieved by denial of a transferee permit may appeal by petition to the district court having jurisdiction over the county or municipality where the application was submitted. The petition must list the applicable chief of police or sheriff as the respondent. The district court must hold a hearing at the earliest practicable date and in any event no later than 60 days following the filing of the petition for review. The court may not grant or deny any relief before the completion of the hearing. The record of the hearing must be sealed. The matter must be heard de novo without a jury.\n(b) The court must issue written findings of fact and conclusions of law regarding the issues submitted by the parties. The court must issue its writ of mandamus directing that the permit be issued and order other appropriate relief unless the chief of police or sheriff establishes by clear and convincing evidence that:\n(1) the applicant is disqualified from possessing a firearm under state or federal law;\n(2) there exists a substantial likelihood that the applicant is a danger to self or the public when in possession of a firearm. Incidents of alleged criminal misconduct that are not investigated and documented may not be considered; or\n(3) the applicant is listed in the criminal gang investigative data system under section 299C.091.\n(c) If an application is denied because the proposed transferee is listed in the criminal gang investigative data system under section 299C.091, the applicant may challenge the denial, after disclosure under court supervision of the reason for that listing, based on grounds that the person:\n(1) was erroneously identified as a person in the data system;\n(2) was improperly included in the data system according to the criteria outlined in section 299C.091, subdivision 2, paragraph (b); or\n(3) has demonstrably withdrawn from the activities and associations that led to inclusion in the data system.\nA valid permit to carry issued pursuant to section 624.714 constitutes a transferee permit for the purposes of this section and sections 624.7132 and 624.7134.\nA person who transfers a pistol or semiautomatic military-style assault weapon to a person exhibiting a valid transferee permit issued pursuant to this section or a valid permit to carry issued pursuant to section 624.714 is not required to file a transfer report pursuant to section 624.7132, subdivision 1.\nA person who makes a false statement in order to obtain a transferee permit knowing or having reason to know the statement is false is guilty of a felony.\nThis section shall be construed to supersede municipal or county regulation of the issuance of transferee permits.",
	"repealed": false
}