{
	"id": "462A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.36",
	"title": "462A.36 NONPROFIT HOUSING BONDS; AUTHORIZATION; STANDING APPROPRIATION.",
	"text": "(a) For purposes of this section the following terms have the meanings given them in this subdivision.\n(b) \"Debt service\" means the amount payable in any fiscal year of principal, premium, if any, and interest on nonprofit housing bonds and the fees, charges, and expenses related to the bonds.\n(c) \"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended.\n(d) \"Nonprofit housing bonds\" means bonds issued by the agency under this chapter that are \"qualified 501(c)(3) bonds\" (within the meaning of section 145(a) of the Internal Revenue Code) or are not \"private activity bonds\" (within the meaning of section 141(a) of the Internal Revenue Code), for the purpose of financing or refinancing affordable housing authorized under this chapter.\n(e) \"Permanent supportive housing\" means housing that is not time-limited and provides or coordinates with linkages to services necessary for residents to maintain housing stability and maximize opportunities for education and employment.\n(a) The agency may issue up to $36,000,000 of nonprofit housing bonds in one or more series to which the payments made under this section may be pledged. The nonprofit housing bonds authorized in this subdivision may be issued for the purpose of making loans, on terms and conditions the agency deems appropriate, to finance the costs of the construction, acquisition, preservation, and rehabilitation of permanent supportive housing for individuals and families who: (1) either have been without a permanent residence for at least 12 months or at least four times in the last three years; or (2) are at significant risk of lacking a permanent residence for 12 months or at least four times in the last three years. The bonds may also be issued to finance the costs of the construction, acquisition, preservation, and rehabilitation of foreclosed or vacant housing to be used for affordable rental housing.\n(b) An insubstantial portion of the bond proceeds may be used for permanent supportive housing for individuals and families experiencing homelessness who do not meet the criteria of paragraph (a).\n(a) The agency may issue nonprofit housing bonds in one or more series to refund bonds authorized in subdivision 2. The amount of refunding nonprofit housing bonds that may be issued from time to time will not be subject to the dollar limitation contained in subdivision 2 nor will those bonds be included in computing the amount of bonds that may be issued within that dollar limitation.\n(b) In the refunding of nonprofit housing bonds, each bond must be called for redemption prior to its maturity in accordance with its terms no later than the earliest date on which it may be redeemed. No refunding bonds may be issued unless as of the date of the refunding bonds the present value of the dollar amount of the debt service on the refunding bonds, computed to their stated maturity dates, is lower than the present value of the dollar amount of debt service on all nonprofit housing bonds refunded computed to their stated maturity dates. For purposes of this subdivision, \"present value of the dollar amount of debt service\" means the dollar amount of debt service to be paid, discounted to the nominal date of the refunding bonds at a rate equal to the yield on the refunding bonds.\n(c) If as a result of the issuance of refunding bonds the amount of debt service for an annual period is less than the amount transferred by the commissioner of management and budget to pay debt service for that annual period, the agency must deduct the excess amount from the actual amount of debt service on those bonds certified for the next subsequent annual period.\nThe nonprofit housing bonds are not public debt of the state, and the full faith and credit and taxing powers of the state are not pledged to the payment of the nonprofit housing bonds or to any payment that the state agrees to make under this section. The bonds must contain a conspicuous statement to that effect.\n(a) The agency must certify annually to the commissioner of management and budget the actual amount of annual debt service on each series of bonds issued under subdivision 2.\n(b) Each July 15, beginning in 2009 and through 2031, if any nonprofit housing bonds issued under subdivision 2, or nonprofit housing bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the nonprofit housing bond account established under section 462A.21, subdivision 32, the amount certified under paragraph (a), not to exceed $2,400,000 annually. The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(c) The agency may pledge to the payment of the nonprofit housing bonds the payments to be made by the state under this section.",
	"repealed": false
}