{
	"id": "354.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.06",
	"title": "354.06 BOARD OF TRUSTEES; MEMBERSHIP; DUTIES.",
	"text": "The management of the association is vested in a board of eight trustees known as the board of trustees of the Teachers Retirement Association. It is composed of the following persons: the commissioner of education, the commissioner of management and budget, a representative of the Minnesota School Boards Association, four members of the association elected by the members of the association, and one retiree elected by the retirees of the association. The five elected members of the board of trustees must be chosen by ballot in a manner fixed by the board of trustees of the association. In every odd-numbered year there shall be elected two members of the association to the board of trustees for terms of four years commencing on the first of July next succeeding their election. In every other odd-numbered year one retiree of the association must be elected to the board of trustees for a term of four years commencing on the first of July next succeeding the election. The filing of candidacy for a retiree election must include a petition of endorsement signed by at least ten retirees of the association. Each election must be completed by June first of each succeeding odd-numbered year. In the case of elective members, any vacancy must be filled by appointment by the remainder of the board, and the appointee shall serve until the members or retirees of the association at the next regular election have elected a trustee to serve for the unexpired term caused by the vacancy. No member or retiree may be appointed by the board, or elected by the members of the association as a trustee, if the person is not a member or retiree of the association in good standing at the time of the appointment or election.\nIt is the duty of the board of trustees and the executive director to undertake their activities consistent with chapter 356A.\nThe board must annually elect one of its members as president. It must elect an executive director. Notwithstanding any law to the contrary, the board must set the salary of the executive director. The board must review the performance of the executive director on an annual basis and may grant salary adjustments as a result of the review. The executive director must serve at the pleasure of the board and be the executive officer of the board, with the duties prescribed in subdivision 2a and any additional duties that the board may prescribe. The board must employ all other clerks and employees necessary to properly administer the association. The board must appoint an executive director on the basis of education, experience in the retirement field, ability to manage and lead system staff, and ability to assist the board in setting a vision for the system. The executive director must have had at least five years of experience in either an executive-level management position or in a position with responsibility for the governance, management, or administration of a retirement plan.\nThe management of the association is vested in the executive director who shall be the executive and administrative head of the association. The executive director shall act as advisor to the board on all matters pertaining to the association and shall also act as the secretary of the board. The executive director shall:\n(1) attend all meetings of the board;\n(2) prepare and recommend to the board appropriate rules to carry out the provisions of this chapter;\n(3) establish and maintain an adequate system of records and accounts following recognized accounting principles and controls;\n(4) designate, as necessary, a deputy executive director and an assistant executive director in the unclassified service, as defined in section 43A.08, whose salaries shall be set in accordance with section 43A.18, subdivision 3, and two assistant executive directors in the classified service, as defined in section 43A.07, with the approval of the board, and appoint such employees, both permanent and temporary, as are necessary to carry out the provisions of this chapter;\n(5) organize the work of the association as the director deems necessary to fulfill the functions of the association, and define the duties of its employees and delegate to them any powers or duties, subject to the director's control and under such conditions as the director may prescribe;\n(6) with the approval of the board, contract and set the compensation for the services of an approved actuary, professional management services, and any other consulting services. These contracts are not subject to the competitive bidding procedure prescribed by chapter 16C. An approved actuary retained by the executive director shall function as the actuarial advisor of the board and the executive director and may perform actuarial valuations and experience studies to supplement those performed by the actuary retained under section 356.214. Any supplemental actuarial valuations or experience studies shall be filed with the executive director of the Legislative Commission on Pensions and Retirement. Copies of professional management survey reports must be transmitted to the secretary of the senate, the chief clerk of the house of representatives, and the Legislative Reference Library as provided by section 3.195, and to the executive director of the commission at the same time as reports are furnished to the board. Only management firms experienced in conducting management surveys of federal, state, or local public retirement systems are qualified to contract with the executive director;\n(7) with the approval of the board, provide in-service training for the employees of the association;\n(8) make refunds of accumulated contributions to former members and to the designated beneficiary, surviving spouse, legal representative, or next of kin of deceased members or deceased former members, under this chapter;\n(9) determine the amount of the annuities and disability benefits of members covered by the association and authorize payment of the annuities and benefits beginning as of the dates on which the annuities and benefits begin to accrue, under this chapter;\n(10) pay annuities, refunds, survivor benefits, salaries, and necessary operating expenses of the association;\n(11) prepare and submit to the board and the legislature an annual financial report covering the operation of the association, as required by section 356.20;\n(12) certify funds available for investment to the State Board of Investment;\n(13) with the advice and approval of the board, request the State Board of Investment to sell securities on determining that funds are needed for the purposes of the association;\n(14) prepare and submit biennial and annual budgets to the board and with the approval of the board submit those budgets to the Department of Management and Budget; and\n(15) with the approval of the board, perform such other duties as may be required for the administration of the association and the other provisions of this chapter and for the transaction of its business. The executive director may:\n(i) reduce all or part of the accrued interest and fines payable by an employing unit for reporting requirements under this chapter, based on an evaluation of any extenuating circumstances of the employing unit;\n(ii) assign association employees to conduct field audits of an employing unit to ensure compliance with the provisions of this chapter; and\n(iii) recover overpayments, if not repaid to the association, by suspending or reducing the payment of a retirement annuity, refund, disability benefit, survivor benefit, or optional annuity under this chapter until the overpayment, plus interest, has been recovered.\nThe commissioner of management and budget shall be ex officio treasurer of the association and the commissioner's general bond to the state shall cover any liabilities for acts as treasurer of the association. The commissioner shall receive all moneys payable to the association and pay out the same only upon forms signed by the executive director.\nAll members of the board shall serve without compensation. A member shall receive necessary expenses to attend meetings of the board and its committees, and association functions and presentations authorized by the board. The necessary expenses must be paid out of the fund. Members of the board shall suffer no loss of compensation from their employing units by reason of service on or for the association, the board, or any committee authorized by the board. Necessary expenses may include the salary of any substitute teacher which the employing unit is required to hire in the absence of the board member. The board may reimburse the employing unit for the cost of the substitute teacher.\nThe board shall meet regularly at its office at such times as it shall determine. Special meetings may be held at any time at the call of the president of the board or of any three members thereof.\n[Repealed, 2009 c 169 art 4 s 51]\nA suitable office shall be provided by the state through the proper officer for the use of the board and its executive director.",
	"repealed": false
}