{
	"id": "168.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.09",
	"title": "168.09 REGISTRATION; REREGISTRATION.",
	"text": "No trailer or motor vehicle, except as is exempted by section 168.012, may be used or operated upon the public streets or highways of the state in any calendar year until it is registered as provided in this section, the motor vehicle tax and fees as provided in this chapter are paid, and the number plates issued for the trailer or motor vehicle are displayed on it. No trailer or motor vehicle, except as provided by section 168.012, which for any reason is not subject to taxation as provided in this chapter, may be used or operated upon the public streets or highways of this state until it is registered as provided in this section and displays number plates as required by this chapter, except that the purchaser of a new trailer or motor vehicle may operate it without plates if the permit authorized by section 168.091 or 168.092 is displayed.\nWhen a motor vehicle registered in Minnesota, has during the calendar year for which it is so registered, been reregistered for the following year, the display on such motor vehicle of the plates issued for such motor vehicle on its reregistration for the following year shall on and after November 15 of the calendar year in which it was so reregistered constitute compliance with subdivision 1 requiring display of plates except as provided in subdivisions 3 and 4.\n(a) Plates or other insignia issued for a motor vehicle registered under section 168.187 for a calendar year shall be displayed on the motor vehicle not later than 12:01 a.m. on March 2 of the year unless extended by the registrar for the period of time required for the issuance of the new plates or insignia. The registration year for vehicles registered under section 168.187, as provided in this section, is from March 1 to the last day of February for 1995 and succeeding years.\n(b) Except for a motor vehicle registered under section 168.017 or 168.187, plates or other insignia issued for a self-propelled motor vehicle registered for over 27,000 pounds shall be displayed on the vehicle not later than 12:01 a.m. on March 2 of the year, and, except for recreational equipment, not earlier than 12:01 a.m. on February 15 of the year, unless otherwise extended by the registrar for the period of time required for issuing the new plates or insignia.\n(c) Except for a motor vehicle registered under section 168.017 or 168.187, plates or other insignia issued for a self-propelled vehicle registered for 27,000 pounds or less and all other motor vehicles shall be displayed not later than 12:01 a.m. on March 2 of the year, and, except for recreational equipment, not earlier than January 1 of the year unless otherwise extended by the registrar for the period of time required for issuing the new plates or insignia. The registration year for all vehicles as provided in this paragraph and paragraph (b) is from March 1 to the last day of February for 1979 and succeeding years.\nA vehicle registered under the monthly series system of registration shall display the plates and insignia issued within ten days of the first day of the month which commences the registration period.\nNo person may be charged with violating this section by reason of failure to renew the registration of a previously registered motor vehicle, except those vehicles registered under section 168.187, if:\n(1) the person produces a statement from the registrar to the effect that the person was not notified by the registrar of the annual renewal for the registration of the vehicle to which a citation was issued; and\n(2) the person renews the registration and pays the motor vehicle tax and fees due within ten days of being cited for the violation.\nFor a semitrailer, as defined in section 168.002, subdivision 30, a number plate must be assigned to the registered owner as identification for the vehicle. This number plate must not display a year designator. The registration card must indicate the number plate for the number plate to be valid.\n(a) The commissioner may issue a temporary permit under this subdivision in conjunction with the conclusion of a registration period or a recently expired registration if:\n(1) the current registration tax and all other fees and taxes have been paid in full; and\n(2) special plates have been applied for.\n(b) The permit is valid for a period of 60 days. The permit must be in a format prescribed by the commissioner, affixed to the rear of the vehicle where a license plate would normally be affixed, and plainly visible. The permit is valid only for the vehicle for which it was issued to allow a reasonable time for the new plates to be manufactured and delivered to the applicant. The permit may be issued only by the commissioner or by a deputy registrar under section 168.33.",
	"repealed": false
}