{
	"id": "287.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/287.01",
	"title": "287.01 DEFINITIONS; MORTGAGE REGISTRY TAX.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of sections 287.01 to 287.13, have the meanings given them in this section.\n\"Amendment\" means generally a document that alters an existing mortgage without securing a new debt, or increasing the amount of an existing debt; and, that does not, in the case of a multistate mortgage described in section 287.05, subdivision 1, paragraph (b), result in an increased percentage of the real property encumbered by the mortgage being located in this state. A document is an amendment if it meets the definition in this subdivision, including documents that do any one or more of the following:\n(i) extends the time for payment of the unpaid portion of the original debt;\n(ii) changes the rate of interest applicable to the unpaid portion of the original debt;\n(iii) adds additional real property as security for the unpaid portion of the original debt;\n(iv) releases some but not all of the real property serving as security for the unpaid portion of the debt;\n(v) replaces all the real property serving as security for the unpaid portion of the debt with other real property regardless of value;\n(vi) replaces a party previously bound by the mortgage with a new party who becomes bound by the same amended mortgage; or\n(vii) reduces the amount of the debt secured by real property located in this state, or in the case of a multistate mortgage described in section 287.05, subdivision 1, paragraph (b), reduces the percentage of real property encumbered by the mortgage that is located in this state.\n\"Debt\" means the principal amount of an obligation to pay money that is secured in whole or in part by a mortgage of an interest in real property.\n\"Decree of marriage dissolution\" includes a summary real estate disposition judgment or an instrument made under it.\n\"Extension\" means any document that alters an existing mortgage by extending the time for repayment without increasing the amount of debt secured by real property that is located in this state.\n\"Mortgage\" means any instrument, including a decree of marriage dissolution or an instrument made under it, creating or evidencing a lien of any kind on real property, given by an owner of real property as security for a debt, notwithstanding that the debt may also be secured in part by a lien upon personalty.\n\"Multistate mortgage\" means a mortgage that encumbers real property located both in and outside of this state.\n\"Person\" includes any individual, partner, officer, director, firm, partnership, joint venture, limited liability company, association, cooperative, social club, fraternal organization, municipal or private corporation, whether organized for profit or not, estate, trusts, business trusts, receiver, trustee, syndicate, the United States, a state, any political subdivision of a state, or any group or combination acting as a unit, and the plural as well as the singular. The term includes any agent of any individual or organization enumerated in this subdivision.\n\"Real property,\" \"real estate,\" and \"land\" have the meanings contained in chapter 500, and include all interests in real property that can be conveyed by a document which may be recorded.\n\"Record,\" \"recorded,\" and \"recording\" each mean that a document has been delivered to and filed in the office of the county recorder or registrar of titles, whichever office maintains the records for the real property described in the document.",
	"repealed": false
}