{
	"id": "124D.4531",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.4531",
	"title": "124D.4531 CAREER AND TECHNICAL REVENUE.",
	"text": "(a) A district with a career and technical program approved under this section for the fiscal year in which the levy is certified is eligible for career and technical revenue equal to 35 percent of approved expenditures in the fiscal year in which the levy is certified for the following:\n(1) salaries paid to essential, licensed personnel providing direct instructional services to students in that fiscal year, including extended contracts, for services rendered in the district's approved career and technical education programs, excluding salaries reimbursed by another school district under clause (2);\n(2) amounts paid to another Minnesota school district for salaries of essential, licensed personnel providing direct instructional services to students in that fiscal year for services rendered in the district's approved career and technical education programs;\n(3) contracted services provided by a public or private agency other than a Minnesota school district or cooperative center under chapter 123A or 136D;\n(4) necessary travel between instructional sites by licensed career and technical education personnel;\n(5) necessary travel by licensed career and technical education personnel for vocational student organization activities held within the state for instructional purposes;\n(6) curriculum development activities that are part of a five-year plan for improvement based on program assessment;\n(7) necessary travel by licensed career and technical education personnel for noncollegiate credit-bearing professional development; and\n(8) specialized vocational instructional supplies.\n(b) The district must recognize the full amount of this levy as revenue for the fiscal year in which it is certified.\n(c) The amount of the revenue calculated under this subdivision may not exceed $17,850,000 for taxes payable in 2012, $15,520,000 for taxes payable in 2013, and $20,657,000 for taxes payable in 2014.\n(d) If the estimated revenue exceeds the amount in paragraph (c), the commissioner must reduce the percentage in paragraph (a) until the estimated revenue no longer exceeds the limit in paragraph (c).\n(a) For fiscal year 2014 only, a district may levy an amount not more than the product of its career and technical revenue times the lesser of one or the ratio of its adjusted net tax capacity per adjusted pupil unit in the fiscal year in which the levy is certified to the career and technical revenue equalizing factor. The career and technical revenue equalizing factor for fiscal year 2014 equals $7,612.\n(b) For fiscal year 2015 and later, a district may levy an amount not more than the product of its career and technical revenue times the lesser of one or the ratio of its adjusted net tax capacity per adjusted pupil unit in the fiscal year in which the levy is certified to the career and technical revenue equalizing factor. The career and technical revenue equalizing factor for fiscal year 2015 and later equals $7,612.\nFor fiscal year 2014 and later, a district's career and technical aid equals its career and technical revenue less its career and technical levy. If the district levy is less than the permitted levy, the district's career and technical aid shall be reduced proportionately.\nFor purposes of this section, a cooperative center or an intermediate district must allocate its approved expenditures for career and technical education programs among participating districts.\nNotwithstanding subdivision 1, paragraph (a), the career and technical education revenue for a district is not less than the lesser of:\n(1) the district's career and technical education revenue for the previous fiscal year; or\n(2) 100 percent of the approved expenditures for career and technical programs included in subdivision 1, paragraph (a), for the fiscal year in which the levy is certified.\nNotwithstanding subdivisions 1, 1a, and 3, for taxes payable in 2012 to 2014 only, the department must calculate the career and technical revenue for each district according to Minnesota Statutes 2010, section 124D.4531, and adjust the revenue for each district proportionately to meet the statewide revenue target under subdivision 1, paragraph (c). For purposes of calculating the revenue guarantee under subdivision 3, the career and technical education revenue for the previous fiscal year is the revenue according to Minnesota Statutes 2010, section 124D.4531, before adjustments to meet the statewide revenue target.\nEach district or cooperative center must report data to the department for all career and technical education programs as required by the department to implement the career and technical revenue formula.\nFor purposes of this section, a district with a career and technical program approved under this section that participates in an agreement under section 123A.30 or 123A.32 must allocate its revenue authority under this section among participating districts.",
	"repealed": false
}