{
	"id": "237.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.52",
	"title": "237.52 TELECOMMUNICATIONS ACCESS MINNESOTA FUND.",
	"text": "A telecommunications access Minnesota fund is established as an account in the state treasury. Earnings, such as interest, dividends, and any other earnings arising from fund assets, must be credited to the fund.\n(a) The commissioner of commerce, the commissioner of employment and economic development, and the commissioner of human services shall annually recommend to the Public Utilities Commission an adequate and appropriate surcharge and budget to implement sections 237.50 to 237.56, 248.062, and 256C.30, respectively. The maximum annual budget for section 248.062 must not exceed $100,000 and for section 256C.30 must not exceed $300,000. The Public Utilities Commission shall review the budgets for reasonableness and may modify the budget to the extent it is unreasonable. The commission shall annually determine the funding mechanism to be used within 60 days of receipt of the recommendation of the departments and shall order the imposition of surcharges effective on the earliest practicable date. The commission shall establish a monthly charge no greater than 20 cents for each customer access line, including trunk equivalents as designated by the commission pursuant to section 403.11, subdivision 1.\n(b) If the fund balance falls below a level capable of fully supporting all programs eligible under subdivision 5 and sections 248.062 and 256C.30, expenditures under sections 248.062 and 256C.30 shall be reduced on a pro rata basis and expenditures under sections 237.53 and 237.54 shall be fully funded. Expenditures under sections 248.062 and 256C.30 shall resume at fully funded levels when the commissioner of commerce determines there is a sufficient fund balance to fully fund those expenditures.\nEvery provider of services capable of originating a TRS call, including cellular communications and other nonwire access services, in this state shall, except as provided in subdivision 3a, collect the charges established by the commission under subdivision 2 and transfer amounts collected to the commissioner of public safety in the same manner as provided in section 403.11, subdivision 1, paragraph (d). The commissioner of public safety must deposit the receipts in the fund established in subdivision 1.\nThe fee established in subdivision 2 does not apply to prepaid wireless telecommunications services as defined in section 403.02, subdivision 17d, which are instead subject to the prepaid wireless telecommunications access Minnesota fee established in section 403.161, subdivision 1, paragraph (b). Collection, remittance, and deposit of prepaid wireless telecommunications access Minnesota fees are governed by sections 403.161 and 403.162.\nMoney in the fund is appropriated to the commissioner of commerce to implement sections 237.51 to 237.56, to the commissioner of employment and economic development to implement section 248.062, and to the commissioner of human services to implement section 256C.30.\n(a) Money in the fund may only be used for:\n(1) expenses of the Department of Commerce, including personnel cost, public relations, advisory board members' expenses, preparation of reports, and other reasonable expenses not to exceed ten percent of total program expenditures;\n(2) reimbursing the commissioner of human services for purchases made or services provided pursuant to section 237.53; and\n(3) contracting for the provision of TRS required by section 237.54.\n(b) All costs directly associated with the establishment of the program, the purchase and distribution of telecommunications devices and interconnectivity products, and the provision of TRS are either reimbursable or directly payable from the fund after authorization by the commissioner of commerce. The commissioner of commerce shall contract with one or more TRS providers to indemnify the telecommunications service providers for any fines imposed by the Federal Communications Commission related to the failure of the relay service to comply with federal service standards. Notwithstanding section 16A.41, the commissioner may advance money to the TRS providers if the providers establish to the commissioner's satisfaction that the advance payment is necessary for the provision of the service. The advance payment may be used only for working capital reserve for the operation of the service. The advance payment must be offset or repaid by the end of the contract fiscal year together with interest accrued from the date of payment.",
	"repealed": false
}