{
	"id": "321.0103",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0103",
	"title": "321.0103 KNOWLEDGE AND NOTICE.",
	"text": "(a) A person knows a fact if the person has actual knowledge of it.\n(b) A person has notice of a fact if the person:\n(1) knows of it;\n(2) has received a notification of it;\n(3) has reason to know it exists from all of the facts known to the person at the time in question; or\n(4) has notice of it under subsection (c) or (d).\n(c) A certificate of limited partnership on file in the Office of the Secretary of State is notice that the partnership is a limited partnership and the persons designated in the certificate as general partners are general partners. Except as otherwise provided in subsections (d) and (i), the certificate is not notice of any other fact.\n(d) Subject to subsection (i), a person has notice of:\n(1) another person's dissociation as a general partner, 90 days after the effective date of a filed amendment to the certificate of limited partnership which states that the other person has dissociated or 90 days after the effective date of a filed statement of dissociation pertaining to the other person, whichever occurs first;\n(2) a limited partnership's dissolution, 90 days after the effective date of a filed amendment to the certificate of limited partnership stating that the limited partnership is dissolved;\n(3) a limited partnership's termination, 90 days after the effective date of a filed statement of termination;\n(4) a limited partnership's conversion under article 11, 90 days after the effective date of the filed articles of conversion; or\n(5) a merger under article 11, 90 days after the effective date of the filed articles of merger.\n(e) A person notifies or gives a notification to another person by taking steps reasonably required to inform the other person in ordinary course, whether or not the other person learns of it.\n(f) A person receives a notification when the notification:\n(1) comes to the person's attention; or\n(2) is delivered at the person's place of business or at any other place held out by the person as a place for receiving communications.\n(g) Except as otherwise provided in subsection (h), a person other than an individual knows, has notice, or receives a notification of a fact for purposes of a particular transaction when the individual conducting the transaction for the person knows, has notice, or receives a notification of the fact, or in any event when the fact would have been brought to the individual's attention if the person had exercised reasonable diligence. A person other than an individual exercises reasonable diligence if it maintains reasonable routines for communicating significant information to the individual conducting the transaction for the person and there is reasonable compliance with the routines. Reasonable diligence does not require an individual acting for the person to communicate information unless the communication is part of the individual's regular duties or the individual has reason to know of the transaction and that the transaction would be materially affected by the information.\n(h) A general partner's knowledge, notice, or receipt of a notification of a fact relating to the limited partnership is effective immediately as knowledge of, notice to, or receipt of a notification by the limited partnership, except in the case of a fraud on the limited partnership committed by or with the consent of the general partner. A limited partner's knowledge, notice, or receipt of a notification of a fact relating to the limited partnership is not effective as knowledge of, notice to, or receipt of a notification by the limited partnership.\n(i) Notice otherwise effective under subsection (d) does not affect the power of a person to transfer real property held in the name of a limited partnership unless at the time of transfer a certified copy of the relevant statement, amendment, or articles, as filed with the secretary of state, has been recorded in the office of the county recorder in the county in which the real property affected by the statement, amendment, or articles is located or, if the real property is registered under chapter 508 or 508A, memorialized on the certificate of title for that property.",
	"repealed": false
}