{
	"id": "115E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.05",
	"title": "115E.05 ORDERS AND INJUNCTIONS; ENFORCEMENT.",
	"text": "If one or more of the commissioners finds the prevention and response plans or preparedness measures of a person do not meet the requirements of this chapter, the commissioner or commissioners making the finding may by order require that reasonable amendments to the plan or reasonable additional preventive or preparedness measures be implemented in a timely fashion. If more than one commissioner makes the finding, the order must be a joint order.\nIf oil or a hazardous substance is discharged while it is under the control of a person not identified in section 115E.03, subdivision 2, any one of the commissioners may by order require the person to comply with the prevention and response plan requirements of sections 115E.03 and 115E.04 in a timely manner if:\n(1) land, water, or air of the state is polluted or threatened; or\n(2) human life, safety, health, natural resources, or property is damaged or threatened.\n(a) For purposes of this subdivision, \"ordering commissioner\" means:\n(1) the commissioner of the Pollution Control Agency;\n(2) the commissioner of natural resources;\n(3) the commissioner of agriculture; or\n(4) two or more of these commissioners acting jointly.\n(b) The ordering commissioner may issue an order under this subdivision if the ordering commissioner determines that adequate response is not being made or that other circumstances exist which indicate adequate response will not continue. When ordered by the ordering commissioner the owner or operator of a vessel or facility responsible for the discharge of a hazardous substance or oil shall provide financial assurance acceptable to the ordering commissioner. The financial assurance must be in the amount necessary to cover the reasonable response costs, as determined within one year after discharge by the ordering commissioner, of any additional response that is determined to be reasonable and necessary under applicable laws and regulations.\n(c) The ordering commissioner may issue only one financial assurance order under this subdivision for a single incident involving the discharge of hazardous substances or oil.\n(d) This subdivision may be enforced by the ordering commissioner under section 115.071.\n(e) An order issued under this subdivision shall cease to be effective upon completion of a response in accordance with applicable laws and regulations.\nFor the purposes of enforcing this chapter, the commissioner of the Pollution Control Agency may exercise the regulatory and enforcement powers in chapters 115 and 116 and the commissioner of the Department of Agriculture may exercise the regulatory and enforcement powers in chapters 18B, 18C, and 18D.",
	"repealed": false
}