{
	"id": "256B.0755",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0755",
	"title": "256B.0755 INTEGRATED HEALTH PARTNERSHIP DEMONSTRATION PROJECT.",
	"text": "(a) The commissioner shall continue a demonstration project established under this section to test alternative and innovative integrated health partnerships, including accountable care organizations that provide services to a specified patient population for an agreed-upon total cost of care or risk/gain sharing payment arrangement. The commissioner shall develop a request for proposals for participation in the demonstration project in consultation with hospitals, primary care providers, health plans, and other key stakeholders.\n(b) In developing the request for proposals, the commissioner shall:\n(1) establish uniform statewide methods of forecasting utilization and cost of care for the appropriate Minnesota public program populations, to be used by the commissioner for the integrated health partnership projects;\n(2) identify key indicators of quality, access, patient satisfaction, and other performance indicators that will be measured, in addition to indicators for measuring cost savings;\n(3) allow maximum flexibility to encourage innovation and variation so that a variety of provider collaborations are able to become integrated health partnerships, and may be customized for the special needs and barriers of patient populations experiencing health disparities due to social, economic, racial, or ethnic factors;\n(4) encourage and authorize different levels and types of financial risk;\n(5) encourage and authorize projects representing a wide variety of geographic locations, patient populations, provider relationships, and care coordination models;\n(6) encourage projects that involve close partnerships between the integrated health partnership and counties and nonprofit agencies that provide services to patients enrolled with the integrated health partnership, including social services, public health, mental health, community-based services, and continuing care;\n(7) encourage projects established by community hospitals, clinics, and other providers in rural communities;\n(8) identify required covered services for a total cost of care model or services considered in whole or partially in an analysis of utilization for a risk/gain sharing model;\n(9) establish a mechanism to monitor enrollment;\n(10) establish quality standards for the integrated health partnerships that are appropriate for the particular patient population to be served; and\n(11) encourage participation of privately insured population so as to create sufficient alignment in the integrated health partnership.\n(c) To be eligible to participate in the demonstration project an integrated health partnership must:\n(1) provide required covered services and care coordination to recipients enrolled in the integrated health partnership;\n(2) establish a process to monitor enrollment and ensure the quality of care provided;\n(3) in cooperation with counties and community social service agencies, coordinate the delivery of health care services with existing social services programs;\n(4) provide a system for advocacy and consumer protection; and\n(5) adopt innovative and cost-effective methods of care delivery and coordination, which may include the use of allied health professionals, telehealth, patient educators, care coordinators, and community health workers.\n(d) An integrated health partnership may be formed by the following groups of providers of services and suppliers if they have established a mechanism for shared governance:\n(1) professionals in group practice arrangements;\n(2) networks of individual practices of professionals;\n(3) partnerships or joint venture arrangements between hospitals and health care professionals;\n(4) hospitals employing professionals; and\n(5) other groups of providers of services and suppliers as the commissioner determines appropriate.\nA managed care plan or county-based purchasing plan may participate in this demonstration in collaboration with one or more of the entities listed in clauses (1) to (5).\nAn integrated health partnership may contract with a managed care plan or a county-based purchasing plan to provide administrative services, including the administration of a payment system using the payment methods established by the commissioner for integrated health partnerships.\n(e) The commissioner may require an integrated health partnership to enter into additional third-party contractual relationships for the assessment of risk and purchase of stop loss insurance or another form of insurance risk management related to the delivery of care described in paragraph (c).\n(a) Individuals eligible for medical assistance or MinnesotaCare shall be eligible for enrollment in an integrated health partnership.\n(b) Eligible applicants and recipients may enroll in an integrated health partnership if the integrated health partnership serves the county in which the applicant or recipient resides. If more than one integrated health partnership serves a county, the applicant or recipient shall be allowed to choose among the integrated health partnerships. The commissioner may assign an applicant or recipient to an integrated health partnership if an integrated health partnership is available and no choice has been made by the applicant or recipient.\n(a) Integrated health partnerships must accept responsibility for the quality of care based on standards established under subdivision 1, paragraph (b), clause (10), and the cost of care or utilization of services provided to its enrollees under subdivision 1, paragraph (b), clause (1). Accountability standards must be appropriate to the particular population served.\n(b) An integrated health partnership may contract and coordinate with providers and clinics for the delivery of services and shall contract with community health clinics, federally qualified health centers, community mental health centers or programs, county agencies, and rural clinics to the extent practicable.\n(c) An integrated health partnership must indicate how it will coordinate with other services affecting its patients' health, quality of care, and cost of care that are provided by other providers, county agencies, and other organizations in the local service area. The integrated health partnership must indicate how it will engage other providers, counties, and organizations, including county-based purchasing plans, that provide services to patients of the integrated health partnership on issues related to local population health, including applicable local needs, priorities, and public health goals. The integrated health partnership must describe how local providers, counties, organizations, including county-based purchasing plans, and other relevant purchasers were consulted in developing the application to participate in the demonstration project.\n(a) In developing a payment system for integrated health partnerships, the commissioner shall establish a total cost of care benchmark or a risk/gain sharing payment model to be paid for services provided to the recipients enrolled in an integrated health partnership.\n(b) The payment system may include incentive payments to integrated health partnerships that meet or exceed annual quality and performance targets realized through the coordination of care.\n(c) An amount equal to the savings realized to the general fund as a result of the demonstration project shall be transferred each fiscal year to the health care access fund.\n(d) The payment system shall include a population-based payment that supports care coordination services for all enrollees served by the integrated health partnerships, and is risk-adjusted to reflect varying levels of care coordination intensiveness for enrollees with chronic conditions, limited English skills, cultural differences, who are homeless, or who experience health disparities or other barriers to health care. The population-based payment shall be a per member, per month payment paid at least on a quarterly basis. Integrated health partnerships receiving this payment must continue to meet cost and quality metrics under the program to maintain eligibility for the population-based payment. An integrated health partnership is eligible to receive a payment under this paragraph even if the partnership is not participating in a risk-based or gain-sharing payment model and regardless of the size of the patient population served by the integrated health partnership. Any integrated health partnership participant certified as a health care home under section 62U.03 that agrees to a payment method that includes population-based payments for care coordination is not eligible to receive health care home payment or care coordination fee authorized under section 62U.03 or 256B.0753, subdivision 1, or in-reach care coordination under section 256B.0625, subdivision 56, for any medical assistance or MinnesotaCare recipients enrolled or attributed to the integrated health partnership under this demonstration.\nOutpatient prescription drug coverage may be provided through accountable care organizations only if the delivery method qualifies for federal prescription drug rebates.\nThe commissioner shall apply for any federal waivers or other federal approval required to implement this section. The commissioner shall also apply for any applicable grant or demonstration under the Patient Protection and Affordable Health Care Act, Public Law 111-148, or the Health Care and Education Reconciliation Act of 2010, Public Law 111-152, that would further the purposes of or assist in the establishment of accountable care organizations.\nThe commissioner shall expand the demonstration project to include additional medical assistance and MinnesotaCare enrollees, and shall seek participation of Medicare in demonstration projects. The commissioner shall seek to include participation of privately insured persons and Medicare recipients in the integrated health partnership demonstration. As part of the demonstration expansion, the commissioner may procure the services of the integrated health partnerships authorized under this section by geographic area, to supplement or replace the services provided by managed care plans operating under section 256B.69.\nThe commissioner may authorize an integrated health partnership to provide incentives for patients to:\n(1) see a primary care provider for an initial health assessment;\n(2) maintain a continuous relationship with the primary care provider; and\n(3) participate in ongoing health improvement and coordination of care activities.",
	"repealed": false
}