{
	"id": "37.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/37.07",
	"title": "37.07 MONTHLY STATEMENTS BY SECRETARY; PURCHASES, EXPENDITURES.",
	"text": "The secretary of the State Agricultural Society shall prepare a signed statement each month summarizing receipts and expenditures for the preceding month, which must be approved by the president or a vice-president of the board of managers. The secretary's affidavit must be attached to this statement. The affidavit must state:\n(1) that all articles were purchased by or under the secretary's direction, and that to the secretary's best information and belief, all articles purchased by the board of managers were purchased at a fair cash market value and received by the society, and that all services charged for were actually provided;\n(2) that neither the secretary nor any person in the secretary's behalf, or the board of managers, to the secretary's best information and belief, had any pecuniary or other interest in any purchase made or services rendered, or received any pecuniary or other benefit from the purchases or services, directly or indirectly, by commission, percentage, deduction, or otherwise; and\n(3) that the articles specified conformed in every respect to the goods ordered, in both quality and quantity.\nThe report must also show the amount of money in the hands of the treasurer of the society.\nCopies of the secretary's monthly report must be furnished to the commissioner of management and budget and to each member of the board of managers no later than the tenth of the month following the month's activities reported.\nThe board of managers shall designate one or more national or state banks, or trust companies authorized to do a banking business, as official depositories for the society's money, and shall then require the treasurer to deposit all or part of that money in the designated bank or banks. The designation must be in writing and must set forth all the terms and conditions upon which the deposits are made, and it must be signed by the president and secretary and made a part of the minutes of the board. Any bank or trust company designated must qualify as a depository by furnishing a corporate surety bond or collateral as required by section 118A.03, and must, as long as any of the society's money is on deposit with it, maintain the bond or collateral in the amounts required by that section. No bond or collateral is required to secure any deposit if it is insured under federal law, as provided in section 118A.03.",
	"repealed": false
}