{
	"id": "524.1-401",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.1-401",
	"title": "524.1-401 NOTICE; METHOD AND TIME OF GIVING.",
	"text": "(a) If notice of a hearing on any petition is required and except for specific notice requirements as otherwise provided, the petitioner shall cause notice of the time and place of hearing of any petition to be given to any interested person or the person's attorney if the person has appeared by attorney or requested that notice be sent to the attorney. Subject to paragraph (e), notice shall be given:\n(1) by mailing a copy thereof at least 14 days before the time set for the hearing by certified, registered or ordinary first class mail addressed to the person being notified at the post office address given in the demand for notice, if any, or at the demander's office or place of residence, if known;\n(2) by delivering a copy thereof to the person being notified personally at least 14 days before the time set for the hearing; or\n(3) if the address, or identity of any person is not known and cannot be ascertained with reasonable diligence, by publishing once a week for two consecutive weeks, a copy thereof in a legal newspaper in the county where the hearing is to be held, the last publication of which is to be at least 10 days before the time set for the hearing.\n(b) The court for good cause shown may provide for a different method or time of giving notice for any hearing.\n(c) Proof of the giving of notice shall be made on or before the hearing and filed in the proceeding.\n(d) No defect in any notice nor in publication or in service thereof shall limit or affect the validity of the appointment, powers, or other duties of the personal representative. Any of the notices required by this section and sections 524.3-306, 524.3-310, 524.3-403 and 524.3-801 may be combined into one notice.\n(e) Except where personal service is required by statute for the petition to appoint a guardian under section 524.5-308 or conservator under section 524.5-404, service of all documents and notices under this chapter may, and where required by Supreme Court rule or order shall, be made by electronic means other than facsimile transmission if authorized by rule or order of the Supreme Court and if service is made in accordance with the rule or order.",
	"repealed": false
}