{
	"id": "500.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.245",
	"title": "500.245 RIGHT OF FIRST REFUSAL FOR AGRICULTURAL LAND.",
	"text": "(a) A state or federal agency, limited partnership, corporation, or limited liability company may not lease or sell agricultural land or a farm homestead before offering or making a good faith effort to offer the land for sale or lease to the immediately preceding former owner at a price no higher than the highest price offered by a third party that is acceptable to the seller or lessor. The offer must be made on the notice to offer form under subdivision 2. The requirements of this subdivision do not apply to a sale or lease by a corporation that is a family farm corporation or an authorized farm corporation or to a sale or lease by the commissioner of agriculture of property acquired by the state under the family farm security program under chapter 41. This subdivision applies only to a sale or lease when the seller or lessor acquired the property by enforcing a debt against the agricultural land or farm homestead, including foreclosure of a mortgage, accepting a deed in lieu of foreclosure, terminating a contract for deed, or accepting a deed in lieu of terminating a contract for deed. Selling or leasing property to a third party at a price is prima facie evidence that the price is acceptable to the seller or lessor. The seller must provide written notice to the immediately preceding former owner that the agricultural land or farm homestead will be offered for sale at least 14 days before the agricultural land or farm homestead is offered for sale.\n(b) An immediately preceding former owner is the entity with record legal title to the agricultural land or farm homestead before acquisition by the state or federal agency or corporation except: if the immediately preceding former owner is a bankruptcy estate, the debtor in bankruptcy is the immediately preceding former owner; and if the agricultural land or farm homestead was acquired by termination of a contract for deed or deed in lieu of termination of a contract for deed, the immediately preceding former owner is the purchaser under the contract for deed. For purposes of this subdivision, only a family farm, family farm corporation, family farm partnership or family farm limited liability company can be an immediately preceding former owner.\n(c) An immediately preceding former owner may elect to purchase or lease the entire property or an agreed to portion of the property. If the immediately preceding former owner elects to purchase or lease a portion of the property, the election must be reported in writing to the seller or lessor prior to the time the property is first offered for sale or lease. If election is made to purchase or lease a portion of the property, the portion must be contiguous and compact so that it does not unreasonably reduce access to or the value of the remaining property.\n(d) For purposes of this subdivision, the term \"a price no higher than the highest price offered by a third party\" means the acceptable cash price offered by a third party or the acceptable time-price offer made by a third party. A cash price offer is one that involves simultaneous transfer of title for payment of the entire amount of the offer. If the acceptable offer made by a third party is a time-price offer, the seller or lessor must make the same time-price offer or an equivalent cash offer to the immediately preceding former owner. An equivalent cash offer is equal to the total of the payments made over a period of the time-price offer discounted by yield curve of the United States treasury notes and bonds of similar maturity on the first business day of the month in which the offer is personally delivered or mailed for time periods similar to the time period covered by the time-price offer, plus 2.0 percent. A time-price offer is an offer that is financed entirely or partially by the seller and includes an offer to purchase under a contract for deed or mortgage. An equivalent cash offer is not required to be made if the state participates in an offer to a third party through the Rural Finance Authority.\n(e) This subdivision applies to a seller when the property is sold and to a lessor each time the property is leased, for the time period specified in section 500.24, subdivision 2, paragraph (v), after the agricultural land is acquired except:\n(1) an offer to lease to the immediately preceding former owner is required only until the immediately preceding owner fails to accept an offer to lease the property or the property is sold;\n(2) an offer to sell to the immediately preceding former owner is required until the property is sold; and\n(3) if the immediately preceding former owner elects to lease or purchase a portion of the property, this subdivision does not apply to the seller with regard to the balance of the property after the election is made under paragraph (c).\n(f) The notice of an offer under subdivision 2 that is personally delivered with a signed receipt or sent by certified mail with a receipt of mailing to the immediately preceding former owner's last known address is a good faith offer.\n(g) This subdivision does not apply to a sale or lease that occurs after the seller or lessor has held the property for the time period specified in section 500.24, subdivision 2, paragraph (x).\n(h) For purposes of this subdivision, if the immediately preceding former owner is a bankruptcy estate the debtor in the bankruptcy is the immediately preceding owner.\n(i) The immediately preceding former owner must exercise the right to lease all or a portion of the agricultural land or a homestead located on agricultural land in writing within 15 days after an offer to lease under this subdivision is mailed with a receipt of mailing or personally delivered. If election is made to lease only the homestead or a portion of the agricultural land, the portion to be leased must be clearly identified in writing. The immediately preceding former owner must exercise the right to buy the agricultural land, a portion of the agricultural land, or a farm homestead located on agricultural land, in writing, within 65 days after an offer to buy under this subdivision is mailed with a receipt of mailing or is personally delivered. Within ten days after exercising the right to lease or buy by accepting the offer, the immediately preceding owner must fully perform according to the terms of the offer including paying the amounts due. A seller may sell and a lessor may lease the agricultural land or farm homestead subject to this subdivision to the third party in accordance with their lease or purchase agreement if:\n(1) the immediately preceding former owner does not accept an offer to lease or buy before the offer terminates; or\n(2) the immediately preceding former owner does not perform the obligations of the offer, including paying the amounts due, within ten days after accepting the offer.\n(j) A certificate indicating whether or not the property contains agricultural land or a farm homestead that is signed by the county assessor where the property is located and recorded in the office of the county recorder or the registrar of titles where the property is located is prima facie evidence of whether the property is agricultural land or a farm homestead.\n(k) As prima facie evidence that an offer to sell or lease agricultural land or a farm homestead has terminated, a receipt of mailing the notice under subdivision 2 and an affidavit, signed by a person authorized to act on behalf of a state, federal agency, or corporation selling or leasing the agricultural land or a farm homestead may be filed in the office of the county recorder or registrar of titles of the county where the agricultural land or farm homestead is located. The affidavit must state that:\n(1) notice of an offer to buy or lease the agricultural land or farm homestead was provided to the immediately preceding former owner at a price not higher than the highest price offered by a third party that is acceptable;\n(2) the time during which the immediately preceding former owner is required to exercise the right to buy or lease the agricultural land or farm homestead has expired;\n(3) the immediately preceding former owner has not exercised the right to buy or lease the agricultural land or farm homestead as provided in this subdivision or has accepted an offer and has not fully performed according to the terms of the offer; and\n(4) the offer to the immediately preceding former owner has terminated.\n(l) The right of an immediately preceding former owner to receive an offer to lease or purchase agricultural land under this subdivision or to lease or purchase at a price no higher than the highest price offered by a third party that is acceptable to the seller or lessor may be extinguished or limited by an express statement signed by the immediately preceding owner that complies with the plain language requirements of section 325G.31. The right may not be extinguished or limited except by:\n(1) an express statement in a deed in lieu of foreclosure of the agricultural land;\n(2) an express statement in a deed in lieu of a termination of a contract for deed for the agricultural land;\n(3) an express statement conveying the right to the state or federal agency or corporation owning the agricultural land that is required to make an offer under this subdivision; however, the preceding former owner may rescind the conveyance by notifying the state or federal agency or corporation in writing within 20 calendar days after signing the express statement;\n(4) to cure a title defect, an express statement conveying the right may be made to a person to whom the agricultural land has been transferred by the state or federal agency or corporation; or\n(5) an express statement conveying the right to a contract for deed vendee to whom the agricultural land or farm homestead was sold under a contract for deed by the immediately preceding former owner if the express statement and the contract for deed are recorded.\n(m) The right of an immediately preceding former owner to receive an offer to lease or purchase agricultural land under this subdivision may not be assigned or transferred except as provided in paragraph (l), but may be inherited.\n(n) An immediately preceding former owner, except a former owner who is actively engaged in farming as defined in section 500.24, subdivision 2, paragraph (a), and who agrees to remain actively engaged in farming on a portion of the agricultural land or farm homestead for at least one year after accepting an offer under this subdivision, may not sell agricultural land acquired by accepting an offer under this subdivision if the arrangement of the sale was negotiated or agreed to prior to the former owner accepting the offer under this subdivision. A person who sells property in violation of this paragraph is liable for damages plus reasonable attorney fees to a person who is damaged by a sale in violation of this paragraph. There is a rebuttable presumption that a sale by an immediately preceding former owner is in violation of this paragraph if the sale takes place within 270 days of the former owner accepting the offer under this subdivision. This paragraph does not apply to a sale by an immediately preceding former owner to the owner's spouse, the owner's parents, the owner's sisters and brothers, the owner's spouse's sisters and brothers, or the owner's children.\n(a) The state, a federal agency, limited partnership, corporation, or limited liability company subject to subdivision 1 must provide a notice of an offer to sell or lease agricultural land substantially as follows, after inserting the appropriate terms within the parentheses:\n\"NOTICE OF OFFER TO (LEASE, BUY) AGRICULTURAL LAND\n(...The state, federal agency, limited partnership, corporation, or limited liability company...) HAS ACQUIRED THE AGRICULTURAL LAND DESCRIBED BELOW AND HAS RECEIVED AN ACCEPTABLE OFFER TO (LEASE, SELL) THE AGRICULTURAL LAND FROM ANOTHER PARTY. UNDER MINNESOTA STATUTES, SECTION 500.245, SUBDIVISION 1, AN OFFER FROM (...the state, federal agency, limited partnership, corporation, or limited liability company...) MUST BE MADE TO YOU AT A PRICE NO HIGHER THAN THE HIGHEST OFFER MADE BY ANOTHER PARTY.\nTHE AGRICULTURAL LAND BEING OFFERED CONTAINS APPROXIMATELY (...approximate number of acres...) ACRES AND IS INFORMALLY DESCRIBED AS FOLLOWS:\n(Informal description of the agricultural land being offered that reasonably describes the land. This description does not need to be a legal description.)\n(...The state, federal agency, limited partnership, corporation, or limited liability company...) OFFERS TO (SELL, LEASE) THE AGRICULTURAL LAND DESCRIBED ABOVE FOR A CASH PRICE OF $(...cash price or equivalent cash price for lease and lease period, or cash price or equivalent cash price for sale of land...), WHICH IS NOT HIGHER THAN THE PRICE OFFERED BY ANOTHER PARTY. THE PRICE IS OFFERED ON THE FOLLOWING TERMS:\n(Terms, if any, of acceptable offer)\nIF YOU WANT TO ACCEPT THIS OFFER YOU MUST NOTIFY (...the state, federal agency, limited partnership, corporation, or limited liability company...) IN WRITING THAT YOU ACCEPT THE OFFER OR SIGN UNDERNEATH THE FOLLOWING PARAGRAPH AND RETURN A COPY OF THIS NOTICE BY (15 for a lease, 65 for a sale) DAYS AFTER THIS NOTICE IS PERSONALLY DELIVERED OR MAILED TO YOU. THE OFFER IN THIS NOTICE TERMINATES ON (...date of termination - 15 days for lease and 65 days for sale after date of mailing or personal delivery...)\nACCEPTANCE OF OFFER\nI ACCEPT THE OFFER TO (BUY, LEASE) THE AGRICULTURAL LAND DESCRIBED ABOVE AT THE PRICE OFFERED TO ME IN THIS NOTICE. AS PART OF ACCEPTING THIS OFFER I WILL PERFORM ACCORDING TO THE TERMS OF THE OFFER, INCLUDING MAKING PAYMENTS DUE UNDER THE OFFER, WITHIN TEN DAYS AFTER THE DATE I ACCEPT THIS OFFER. I UNDERSTAND THAT NEGOTIATING OR AGREEING TO AN ARRANGEMENT TO SELL THE AGRICULTURAL LAND TO ANOTHER PERSON PRIOR TO ACCEPTING THIS OFFER MAY BE A VIOLATION OF LAW AND I MAY BE LIABLE TO A PERSON DAMAGED BY THE SALE.\nIMPORTANT NOTICE\nANY ACTION FOR THE RECOVERY OF THE AGRICULTURAL LAND DESCRIBED ABOVE OR ANY ACTION FOR DAMAGES, EXCEPT FOR DAMAGES FOR FRAUD, REGARDING THIS OFFER MUST BE COMMENCED BY A LAWSUIT BEFORE THE EXPIRATION OF THREE YEARS AFTER THIS LAND IS SOLD TO ANOTHER PARTY. UPON FILING A LAWSUIT, YOU MUST ALSO FILE A NOTICE OF LIS PENDENS WITH THE COUNTY RECORDER OR REGISTRAR OF TITLES IN THE COUNTY WHERE THE LAND IS LOCATED.\n(b) For an offer to sell, a copy of the purchase agreement containing the price and terms of the highest offer made by a third party that is acceptable to the seller and a signed affidavit by the seller affirming that the purchase agreement is true, accurate, and made in good faith must be included with the notice under this subdivision. At the seller's discretion, reference to the third party's identity may be deleted from the copy of the purchase agreement.\n(c) For an offer to lease, a copy of the lease containing the price and terms of the highest offer made by a third party that is acceptable to the lessor and a signed affidavit by the lessor affirming that the lease is true, accurate, and made in good faith must be included with the notice under this subdivision. At the lessor's discretion, reference to the third party's identity may be deleted from the copy of the lease agreement.\n(d) The affidavit under paragraphs (b) and (c) is subject to section 609.48.\nAn action for the recovery of title to or possession of real property or any right in the property or any action for damages, except for damages for fraud, based upon a failure to comply with the requirements of subdivision 1 or 2 must be commenced, and a notice of lis pendens filed with the county recorder or registrar of titles in the county where the real property is located, within three years after the conveyance on which the action is based was recorded with the county recorder or registrar of titles.",
	"repealed": false
}