{
	"id": "609.902",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.902",
	"title": "609.902 DEFINITIONS.",
	"text": "As used in sections 609.901 to 609.912, the following terms have the meanings given them.\n\"Criminal proceeding\" means a criminal proceeding begun under section 609.903.\n\"Enterprise\" means a sole proprietorship, partnership, corporation, trust, or other legal entity, or a union, governmental entity, association, or group of persons, associated in fact although not a legal entity, and includes illicit as well as legitimate enterprises.\n\"Criminal act\" means conduct constituting, or a conspiracy or attempt to commit, a felony violation of chapter 152, or a felony violation of section 297D.09; 299F.79; 299F.80; 299F.82; 609.185; 609.19; 609.195; 609.20; 609.205; 609.221; 609.222; 609.223; 609.2231; 609.228; 609.235; 609.245; 609.25; 609.27; 609.322; 609.342; 609.343; 609.344; 609.345; 609.42; 609.48; 609.485; 609.495; 609.496; 609.497; 609.498; 609.52, subdivision 2, if the offense is punishable under subdivision 3, clause (1), if the property is a firearm, clause (3)(b), or clause (3)(d)(v); section 609.52, subdivision 2, paragraph (a), clause (1) or (4); 609.527, if the crime is punishable under subdivision 3, clause (4); 609.528, if the crime is punishable under subdivision 3, clause (4); 609.53; 609.561; 609.562; 609.582, subdivision 1 or 2; 609.668, subdivision 6, paragraph (a); 609.67; 609.687; 609.713; 609.86; 609.894, subdivision 3 or 4; 609.895; 624.713; 624.7191; or 626A.02, subdivision 1, if the offense is punishable under section 626A.02, subdivision 4, paragraph (a). \"Criminal act\" also includes conduct constituting, or a conspiracy or attempt to commit, a felony violation of section 609.52, subdivision 2, clause (3), (4), (15), or (16), if the violation involves an insurance company as defined in section 60A.02, subdivision 4, a nonprofit health service plan corporation regulated under chapter 62C, a health maintenance organization regulated under chapter 62D, or a fraternal benefit society regulated under chapter 64B.\nA person \"participates in a pattern of criminal activity\" when the person is a principal with respect to conduct constituting at least three of the criminal acts included in the pattern and two of the acts constitute felonies other than conspiracy.\n\"Pattern of criminal activity\" means conduct constituting three or more criminal acts that:\n(1) were committed within ten years of the commencement of the criminal proceeding;\n(2) are neither isolated incidents, nor so closely related and connected in point of time or circumstance of commission as to constitute a single criminal offense; and\n(3) were either: (i) related to one another through a common scheme or plan or a shared criminal purpose or (ii) committed, solicited, requested, importuned, or intentionally aided by persons acting with the mental culpability required for the commission of the criminal acts and associated with or in an enterprise involved in those activities.\n\"Personal property\" includes personal property, an interest in personal property, or a right, including a bank account, debt, corporate stock, patent, or copyright. Personal property and a beneficial interest in personal property are deemed to be located where the trustee is, the personal property is, or the instrument evidencing the right is.\n\"Principal\" means a person who personally engages in conduct constituting a violation or who is criminally liable under section 609.05 for the conduct of another constituting a violation.\n\"Prosecuting authority\" means the office of a county attorney or office of the attorney general.\n\"Real property\" means any real property or an interest in real property, including a lease of, or mortgage on, real property. A beneficial interest in real property is deemed to be located where the real property is located.",
	"repealed": false
}