{
	"id": "160.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.93",
	"title": "160.93 USER FEES; HIGH-OCCUPANCY VEHICLE AND DYNAMIC SHOULDER LANES.",
	"text": "To improve efficiency and provide more options to individuals traveling in a trunk highway corridor, the commissioner of transportation may charge user fees to owners or operators of single-occupant vehicles using dynamic shoulder lanes as designated by the commissioner and any designated high-occupancy vehicle lanes. The fees may be collected using electronic or other toll-collection methods and may vary in amount with the time of day and level of traffic congestion within the corridor. The commissioner shall consult with the Metropolitan Council and obtain necessary federal authorizations before implementing user fees on a high-occupancy vehicle lane or dynamic shoulder lane. Fees under this section are not subject to section 16A.1283.\n(a) Except as provided in subdivision 2a, money collected from fees authorized under subdivision 1 must be deposited in a high-occupancy vehicle lane user fee account in the special revenue fund. A separate account must be established for each trunk highway corridor. Money in the account is appropriated to the commissioner.\n(b) From this appropriation the commissioner shall first repay the trunk highway fund and any other fund source for money spent to install, equip, or modify the corridor for the purposes of subdivision 1, and then shall pay all the costs of implementing and administering the fee collection system for that corridor.\n(c) The commissioner shall spend remaining money in the account as follows:\n(1) one-half must be spent for transportation capital improvements within the corridor; and\n(2) one-half must be transferred to the Metropolitan Council for expansion and improvement of bus transit services within the corridor beyond the level of service provided on the date of implementation of subdivision 1.\n(a) An I-35W high-occupancy vehicle and dynamic shoulder lane account is established in the special revenue fund. Money collected from fees authorized under subdivision 1 for the marked Interstate Highway 35W (I-35W) corridor must be deposited in the account and used as described in this subdivision. Money in the account is appropriated to the commissioner.\n(b) During the first year of revenue operations, the commissioner shall use the money received in that year to pay the costs of operating and administering the fee collection system within the corridor, up to $1,000,000. Any remaining money must be transferred to the Metropolitan Council for improvement of bus transit services within the I-35W corridor including transit capital expenses.\n(c) During the second and subsequent years of revenue operations, the commissioner shall use money in the account as follows:\n(1) each year, allocate the lesser amount of $1,000,000 or 75 percent of the revenues for operating and administering the fee collection system within the corridor;\n(2) transfer the remaining amount up to the amount allocated under clause (1) to the Metropolitan Council for improvement of bus transit within the corridor including capital expenses; and\n(3) allocate any remaining amount as follows: (i) 25 percent to the commissioner for operating and administering the fee collection system within the corridor and for transportation capital improvements that are consistent with the goals of the urban partnership agreement and that are located within the corridor and (ii) 75 percent to the Metropolitan Council for improvement of bus transit services within the corridor including transit capital expenses.\nWith respect to this section, the commissioner is exempt from statutory rulemaking requirements, including section 14.386, and from sections 160.84 to 160.92 and 161.162 to 161.167.\nNo person may operate a single-occupant vehicle in a designated high-occupancy vehicle lane or dynamic shoulder lane except in compliance with the requirements of the commissioner. A person who violates this subdivision is guilty of a petty misdemeanor and is subject to sections 169.89, subdivisions 1, 2, and 4, and 169.891 and any other provision of chapter 169 applicable to the commission of a petty misdemeanor traffic offense. Upon approval of the Federal Highway Administration, this subdivision does not apply on New Year's Day, Memorial Day, Independence Day, Labor Day, Thanksgiving, and Christmas.\n(a) The commissioner may designate dynamic shoulder lanes on freeways. The commissioner may operate dynamic shoulder lanes as priced lanes, general purpose lanes, high-occupancy vehicle lanes, or as shoulders as defined in section 169.011, subdivision 74. The commissioner may prescribe the conditions under which the lanes may be used.\n(b) The commissioner may not operate a dynamic shoulder lane on marked Trunk Highway 35W from its intersection with marked Trunk Highway 94 to its intersection with marked Trunk Highway 62 as a general purpose lane. A dynamic shoulder lane along this portion of marked Trunk Highway 35W may only be used by:\n(1) a vehicle with more than one occupant;\n(2) a single-occupant vehicle if the fee under subdivision 1 is paid;\n(3) a transit bus providing public transportation, as defined in section 174.22, subdivision 7; and\n(4) an authorized emergency vehicle, as defined in section 169.011, subdivision 3.\n(c) The commissioner shall erect signs to indicate when the lanes may be used.",
	"repealed": false
}