{
	"id": "116J.557",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.557",
	"title": "116J.557 COST RECOVERY ACTIONS.",
	"text": "The attorney general or a development authority or municipality that incurs cleanup costs to implement an approved response action plan pursuant to sections 116J.551 to 116J.557, may bring an action under section 115B.04 or other law to recover the reasonable and necessary cleanup costs incurred by the development authority or municipality. The attorney general, development authority, or municipality may recover all cleanup costs incurred whether paid from the proceeds of a grant under sections 116J.551 to 116J.557 or funds of the development authority or municipality. Recoverable costs include administrative and legal costs related to the development and implementation of the response action plan but do not include any cost associated with development or redevelopment of property. A development authority or municipality must have the consent of the attorney general to bring or settle an action under this subdivision to recover cleanup costs paid from the proceeds of a grant.\nThe commissioner shall notify the attorney general when a grant is awarded under sections 116J.551 to 116J.557. Upon request of the attorney general the development authority shall prepare and submit a certification of the cleanup costs and shall cooperate in any cost recovery action brought by the attorney general under subdivision 1. Certification by the development authority of the cleanup costs incurred to develop and implement the approved response action plan is prima facie evidence that the costs are reasonable and necessary in any action brought under this section.\n(a) The attorney general may assist a development authority or municipality, if requested to do so, in bringing an action under subdivision 1 by providing legal and technical advice or other appropriate assistance. The attorney general shall not assess any fee to the development authority or municipality for the assistance but may recover the cost of the assistance as provided in paragraph (b).\n(b) If the attorney general brings or assists in an action brought under subdivision 1, the reasonable litigation expenses or other costs of legal or technical assistance incurred by the attorney general must be deducted from any recovery and paid to the attorney general before proceeds of the recovery are otherwise distributed. The attorney general shall deposit any money so deducted in the general fund.\nAmounts recovered from responsible persons, after any deduction under subdivision 3, and all other amounts otherwise received by the municipality, the agency, or the attorney general for the site shall be used to reimburse the municipality and the account in proportion to their respective payments for response costs. The amount of recovered costs apportioned to tax increments must be treated by the municipality and development authority as an excess increment under section 469.176, subdivision 2.",
	"repealed": false
}