{
	"id": "383C.234",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.234",
	"title": "383C.234 REMOVAL OF SNOW.",
	"text": "The St. Louis County Board may by resolution provide for removal of snow from roadways as provided in this section, and upon conditions and terms and under restrictions as the board may deem proper.\nAny person desiring to have snow removed from the person's roadway during the ensuing winter shall on or before August 31 of each year, file a petition in form approved by the county board with the board, providing among other things for the payment of the expense by the person, requesting it to render the service. The county board shall forthwith submit the petition to the county engineer who shall inspect the roadway to determine whether or not it would be advisable to permit snow removal equipment to work on it. The determination of the county engineer as to advisability shall be final and not subject to review. The engineer shall file a report with the county board approving or rejecting the petition, on or before October 31 each year.\nThe board shall, if the report of the engineer is favorable to the removal of snow from the roadway, place the name and address of the petitioners on file and shall forthwith notify each petitioner of the report.\nNo snow removal equipment shall be used for the purposes of this section unless and until snow is removed from all roads and highways which the county is charged by law with keeping clear.\nThe manner and number of times which machinery shall be used on the roadways shall be determined by the county board, and no person shall have the right to compel the removal of snow from any roadway as described in this section.\nThe amount of the expenses shall constitute and be a lien in favor of the county against the land involved, and, unless paid by July first following, shall be certified by the county engineer to the county auditor, and the auditor shall enter them upon the tax books, as an assessment, upon the land. They shall be collected in the same manner that other real estate taxes are collected. The amount of the expenses, when collected, shall be used to reimburse the county for its expenditure.",
	"repealed": false
}