{
	"id": "270C.447",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.447",
	"title": "270C.447 LEGAL ACTION TO ENJOIN TAX RETURN PREPARER.",
	"text": "(a) Whenever it appears to the commissioner that a tax preparer doing business in Minnesota has engaged in any conduct described in subdivision 2, a civil action in the name of the state of Minnesota may be commenced to enjoin the conduct and enforce compliance.\n(b) An action under this subdivision must be brought by the attorney general in:\n(1) the district court for the judicial district of the tax preparer's residence or principal place of business;\n(2) the district court for the judicial district of the residence of any taxpayer with respect to whose return the action is brought; or\n(3) Ramsey County District Court.\n(c) The court may exercise its jurisdiction over the action separate and apart from any other action brought by the state of Minnesota against the tax preparer or any taxpayer. The court must grant a permanent injunction or other appropriate relief if the commissioner shows that the person has engaged in conduct constituting a violation of a law administered by the commissioner or a cease and desist order issued by the commissioner. The commissioner shall not be required to show irreparable harm.\nIn an action under subdivision 1, the court may enjoin the person from further engaging in that conduct if the court finds that a tax preparer has:\n(1) engaged in any conduct subject to a civil penalty under section 289A.60, a criminal penalty under section 289A.63, or a criminal penalty under section 609.527 or a similar statute for a return filed with the commissioner, the Internal Revenue Service, or another state;\n(2) misrepresented the preparer's eligibility to practice before the Department of Revenue, or misrepresented the preparer's experience or education as a tax preparer;\n(3) guaranteed the payment of any tax refund or the allowance of any tax credit;\n(4) violated a cease and desist order issued by the commissioner; or\n(5) engaged in any other fraudulent or deceptive conduct that substantially interferes with the proper administration of a law administered by the commissioner, and injunctive relief is appropriate to prevent the recurrence of that conduct.\nIf the court finds that a tax preparer has continually or repeatedly engaged in conduct described in subdivision 2, and that an injunction prohibiting that conduct would not be sufficient to prevent the person's interference with the proper administration of a law administered by the commissioner, the court may enjoin the person from acting as a tax preparer. The court may not enjoin the employer of a tax preparer for conduct described in subdivision 2 engaged in by one or more of the employer's employees unless the employer was also actively involved in that conduct.\n(a) Whenever the commissioner under subdivision 1 or 3 seeks to enforce compliance with a cease and desist order, the court must consider the allegations in the cease and desist order conclusively established if the order is a final order.\n(b) If the court finds the tax preparer was not in compliance with a cease and desist order, the court may impose a further civil penalty against the tax preparer for contempt in an amount up to $10,000 for each violation and may grant any other relief the court determines is just and proper in the circumstances. A civil penalty imposed by a court under this section may be collected and enforced by the commissioner as an income tax liability.\n(c) The court may not require the commissioner to post a bond in an action or proceeding under this section.\n[Repealed, 1Sp2017 c 1 art 22 s 22]",
	"repealed": false
}