{
	"id": "257B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/257B.04",
	"title": "257B.04 CONTENTS OF DESIGNATION.",
	"text": "A designation of a standby or temporary custodian must identify the designator making the designation; the children; the other parent, if any; the standby or temporary custodian; and the triggering event or events upon which a standby or temporary custodian becomes a co-custodian or custodian. Different standby custodians may be designated for different triggering events. The designation must include the signed consent of the standby or temporary custodian and the signed consent of the other parent or a statement why the other parent's consent is not required.\nThe designation must be signed by the designator in the presence of two witnesses who are 18 years of age or older and not otherwise named in the designation. The witnesses must also sign the declaration.\nIf the designator is physically unable to sign the designation, the designator may direct another person not named in the designation to sign on the designator's behalf in the presence of the designator and both witnesses.\nA designator may, but need not, designate an alternate standby custodian in the designation. No alternate temporary custodian may be named.\nA designation may, but need not, be in the following form: \"I (insert name of designator) do hereby appoint (insert name, address, and telephone number of standby or temporary custodian) as the standby or temporary custodian of (insert name(s) of child(ren)) to take effect upon the occurrence of the following triggering event or events (insert specific triggering events).\nI am the (insert designator's relationship to child(ren)) of (insert name(s) of child(ren)). (Insert name(s) of child(ren)'s other parent) is the other parent of (insert name(s) of child(ren)). The other parent's address is:\n(check all that apply):\n.... The other parent died on (insert date of death).\n.... The other parent's parental rights were terminated on (insert date of termination).\n.... The other parent's whereabouts are unknown. I understand that all living parents whose rights have not been terminated must be given notice of this designation pursuant to the Minnesota Rules of Civil Procedure or a petition to approve this designation may not be granted by the court.\n.... The other parent is unwilling and unable to make and carry out day-to-day child care decisions concerning the child(ren).\n.... The other parent consents to this designation and has signed this form below.\nBy this designation I am granting (insert name of standby or temporary custodian) the authority to act for 60 days following the occurrence of the triggering event as a co-custodian with me, or in the event of my death, as custodian of my child(ren).\nA temporary custodian appointment terminates upon the death of the designator.\n(Optional) I hereby nominate (insert name, address, and telephone number of alternate standby custodian) as the alternate standby custodian to assume the duties of the standby custodian named above if the standby custodian is unable or unwilling to act as a standby custodian.\nIf I have indicated more than one triggering event, it is my intent that the triggering event which occurs first shall take precedence. If I have indicated \"my death\" as the triggering event, it is my intent that the person named in the designation to be standby custodian for my child(ren) in the event of my death shall be appointed as guardian of my child(ren) under Minnesota Statutes, sections 524.5-201 to 524.5-317, upon my death.\nIt is my intention to retain full parental rights to the extent consistent with my condition and to retain the authority to revoke the appointment of a standby or temporary custodian if I so choose.\nThis designation is made after careful reflection, while I am of sound mind.\nIF APPLICABLE: I (insert name of other parent) hereby consent to this designation.\nI, (insert name of standby or temporary custodian), hereby accept my nomination as standby or temporary custodian of (insert child(ren)'s name(s)). I understand that my rights and responsibilities toward the child(ren) named above will become effective upon the occurrence of the above-stated triggering event or events. I further understand that in order to continue caring for the child(ren), I must file a petition with the court within 60 days of the occurrence of the triggering event.\nA designator who wishes to have a standby or temporary custodian indication placed on the designator's driver's license may do so as provided in section 171.07, subdivision 11.",
	"repealed": false
}