{
	"id": "216B.1692",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1692",
	"title": "216B.1692 EMISSIONS-REDUCTION RIDER.",
	"text": "(a) Projects that may be approved for the emissions reduction-rate rider allowed in this section must:\n(1) be installed on existing large electric generating power plants, as defined in section 216B.2421, subdivision 2, clause (1), that are located in the state and that are currently not subject to emissions limitations for new power plants under the federal Clean Air Act, United States Code, title 42, section 7401 et seq.;\n(2) not increase the capacity of the existing electric generating power plant more than ten percent or more than 100 megawatts, whichever is greater; and\n(3) result in the existing plant either:\n(i) complying with applicable new source review standards under the federal Clean Air Act; or\n(ii) emitting air contaminants at levels substantially lower than allowed for new facilities by the applicable new source performance standards under the federal Clean Air Act; or\n(iii) reducing emissions from current levels at a unit to the lowest cost-effective level when, due to the age or condition of the generating unit, the public utility demonstrates that it would not be cost-effective to reduce emissions to the levels in item (i) or (ii).\n(b) Notwithstanding paragraph (a), a project may be approved for the emission reduction rate rider allowed in this section if the project is to be installed on existing large electric generating power plants, as defined in section 216B.2421, subdivision 2, clause (1), that are located outside the state and are needed to comply with state or federal air quality standards, but only if the project has received an advance determination of prudence from the commission under section 216B.1695.\nSubdivisions 2, 4, and 5, paragraph (c), clause (1), do not apply to projects qualifying under subdivision 1, paragraph (b).\nA public utility that intends to submit a proposal for an emissions-reduction rider under this section must submit to the commission, the department, the Pollution Control Agency, and interested parties its plans for emissions-reduction projects at its generating facilities. This submission must be made at least 60 days in advance of a petition for a rider and shall include:\n(1) the priority order of emissions-reduction projects the utility plans to pursue at its generating facilities;\n(2) the planned schedule for implementation;\n(3) the analysis and considerations relied on by the public utility to develop that priority ranking;\n(4) the alternative emissions-reduction projects considered, including but not limited to applications of the best available control technology and repowering with natural gas, and reasons for not pursuing them;\n(5) the emissions reductions expected to be achieved by the projects and their relation to applicable standards for new facilities under the federal Clean Air Act, United States Code, title 42, section 7401 et seq.; and\n(6) the general rationale and conclusions of the public utility in determining the priority ranking.\n(a) A public utility may petition the commission for approval of an emissions-reduction rider to recover the costs of a qualifying emissions-reduction project outside of a general rate case proceeding under section 216B.16. In its filing, the public utility shall provide:\n(1) a description of the planned emissions-reduction project;\n(2) the activities involved in the project;\n(3) a schedule for implementation;\n(4) any analysis provided to the Pollution Control Agency regarding the project;\n(5) an assessment of alternatives to the project, including costs, environmental impact, and operational issues;\n(6) the proposed method of cost recovery;\n(7) any proposed recovery above cost; and\n(8) the projected emissions reductions from the project.\n(b) Nothing in this section precludes a public utility or interested party from seeking commission guidelines for emissions-reduction rider filings; however, commission guidelines are not required as a prerequisite to a public utility-initiated filing.\nThe Pollution Control Agency shall evaluate the public utility's emissions-reduction project filing and provide the commission with:\n(1) verification that the emissions-reduction project qualifies under subdivision 1;\n(2) a description of the projected environmental benefits of the proposed project; and\n(3) its assessment of the appropriateness of the proposed project.\n(a) After receiving the Pollution Control Agency's environmental assessment, the commission shall allow opportunity for written and oral comment on the proposed emissions reduction-rate rider proposal. The commission must assess the costs of an emissions-reduction project on a stand-alone basis and may approve, modify, or reject the proposed emissions-reduction rider. In making its determination, the commission shall consider whether the project, proposed cost recovery, and any proposed recovery above cost appropriately achieves environmental benefits without unreasonable consumer costs.\n(b) The commission may approve a rider that:\n(1) allows the utility to recover costs of qualifying emissions-reduction projects net of revenues attributable to the project;\n(2) allows an appropriate return on investment associated with qualifying emissions-reduction projects at the level established in the public utility's last general rate case;\n(3) allocates project costs appropriately between wholesale and retail customers;\n(4) provides a mechanism for recovery above cost, if necessary to improve the overall economics of the qualifying projects to ensure implementation;\n(5) recovers costs from retail customer classes in proportion to class energy consumption; and\n(6) terminates recovery once the costs of qualifying projects have been fully recovered.\n(c) The commission must not approve an emissions-reduction project and its associated rate rider if:\n(1) the emissions-reduction project is needed to comply with new state or federal air quality standards; or\n(2) the emissions-reduction project is required as a corrective action as part of any state or federal enforcement action.\n(d) The commission may not include any costs of a proposed project in the emissions-reduction rider that are not directly allocable to reduction of emissions.\nWithin 60 days of a final commission order, the public utility shall notify the commission and the Pollution Control Agency whether it will proceed with the project. Nothing in this section commits a public utility to implementing a proposed emissions-reduction project if the proposed project or terms of the emissions-reduction rider have been either modified or rejected by the commission. A public utility implementing a project under this section will not be required for a period of eight years after installation to undertake additional investments to comply with a new state requirement regarding pollutants addressed by the project at the project generating facility. This section does not affect requirements of federal law. The term of the rider shall extend for the period approved by the commission regardless of any subsequent state or federal requirement affecting any pollutant addressed by the approved emissions-reduction project and regardless of the sunset date in subdivision 8.\nBy January 15, 2005, the commission, in consultation with the commissioner of commerce and commissioner of the Pollution Control Agency, shall report to the legislature:\n(1) the number of participating public utilities and qualifying projects proposed and approved under this section;\n(2) the total cost of each project and any associated incentives;\n(3) the reduction in air emissions achieved;\n(4) rate impacts of the cost recovery mechanisms; and\n(5) an assessment of the effectiveness of the cost recovery mechanism in accomplishing power plant emissions reductions in excess of those required by law.\nThis section is effective until December 31, 2020, and applies to plans, projects, and riders approved before that date and modifications made to them after that date.",
	"repealed": false
}