{
	"id": "321.0206",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0206",
	"title": "321.0206 DELIVERY TO AND FILING OF RECORDS BY SECRETARY OF STATE; EFFECTIVE TIME AND DATE.",
	"text": "(a) A record authorized or required to be delivered to the secretary of state for filing under this chapter must be captioned to describe the record's purpose, be in a medium permitted by the secretary of state, and be delivered to the secretary of state. Unless the secretary of state determines that a record does not comply with the filing requirements of this chapter, and if the appropriate filing fees have been paid, the secretary of state shall file the record and:\n(1) for a statement of dissociation, send:\n(A) a copy of the filed statement to the person which the statement indicates has dissociated as a general partner; and\n(B) a copy of the filed statement to the limited partnership;\n(2) for a statement of withdrawal, send:\n(A) a copy of the filed statement to the person on whose behalf the record was filed; and\n(B) if the statement refers to an existing limited partnership, a copy of the filed statement to the limited partnership; and\n(3) for all other records, send a copy of the filed record to the person on whose behalf the record was filed.\n(b) Upon request and payment of a fee, the secretary of state shall send to the requester a certified copy of the requested record.\n(c) Except as otherwise provided in sections 321.0116 and 321.0207, a record delivered to the secretary of state for filing under this chapter may specify an effective time and a delayed effective date. Except as otherwise provided in this chapter, a record filed by the secretary of state is effective:\n(1) if the record does not specify an effective time and does not specify a delayed effective date, on the date and at the time the record is filed as evidenced by the secretary of state's endorsement of the date and time on the record;\n(2) if the record specifies an effective time but not a delayed effective date, on the date the record is filed at the time specified in the record;\n(3) if the record specifies a delayed effective date but not an effective time, at 12:01 a.m. on the earlier of:\n(A) the specified date; or\n(B) the 30th day after the record is filed; or\n(4) if the record specifies an effective time and a delayed effective date, at the specified time on the earlier of:\n(A) the specified date; or\n(B) the 30th day after the record is filed.\n(d) The appropriate fees for filings under this chapter are:\n(1) for filing a certificate of limited partnership, $100;\n(2) for filing an amended certificate of limited partnership, $50;\n(3) for filing a name reservation for a limited partnership name, $35;\n(4) for filing any other record, other than the annual renewal required by section 321.0210, for which no fee must be charged, required or permitted to be delivered for filing, $50;\n(5) for filing a certificate requesting authority to transact business in Minnesota as a foreign limited partnership, $100;\n(6) for filing an application of reinstatement, $25;\n(7) for filing a name reservation for a foreign limited partnership name, $35; and\n(8) for filing any other record, other than the annual renewal required by section 321.0210, for which no fee must be charged, required or permitted to be delivered for filing on a foreign limited partnership authorized to transact business in Minnesota, $50.",
	"repealed": false
}