{
	"id": "342.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.06",
	"title": "342.06 APPROVAL OF CANNABIS FLOWER, PRODUCTS, AND CANNABINOIDS.",
	"text": "(a) For the purposes of this section, \"product category\" means a type of product that may be sold in different sizes, distinct packaging, or at various prices but is still created using the same manufacturing or agricultural processes. A new or additional stock keeping unit (SKU) or Universal Product Code (UPC) shall not prevent a product from being considered the same type as another unit. All other terms have the meanings provided in section 342.01.\n(b) The office shall approve product categories of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products for retail sale.\n(c) The office may establish limits on the total THC of cannabis flower, cannabis products, and hemp-derived consumer products. As used in this paragraph, \"total THC\" means the sum of the percentage by weight of tetrahydrocannabinolic acid multiplied by 0.877 plus the percentage by weight of all tetrahydrocannabinols.\n(d) The office shall not approve any cannabis product, lower-potency hemp edible, or hemp-derived consumer product that:\n(1) is or appears to be a lollipop or ice cream;\n(2) bears the likeness or contains characteristics of a real or fictional person, animal, or fruit;\n(3) is modeled after a type or brand of products primarily consumed by or marketed to children;\n(4) is substantively similar to a meat food product; poultry food product as defined in section 31A.02, subdivision 10; or a dairy product as defined in section 32D.01, subdivision 7;\n(5) contains a synthetic cannabinoid;\n(6) is made by applying a cannabinoid, including but not limited to an artificially derived cannabinoid, to a finished food product that does not contain cannabinoids and is sold to consumers, including but not limited to a candy or snack food; or\n(7) if the product is an edible cannabis product or lower-potency hemp edible, contains an ingredient, other than a cannabinoid, that is not approved by the United States Food and Drug Administration for use in food.\n(a) The office may designate any cannabinoid as nonintoxicating and may approve the use of any cannabinoid in lower-potency hemp edibles. The office may establish limits on the amount of an intoxicating cannabinoid that may be present in a lower-potency hemp edible.\n(b) Beginning January 1, 2026, any person may petition the office to designate a cannabinoid as nonintoxicating or to allow the use of any cannabinoid in lower-potency hemp edibles. Petitions must be filed in the form and manner established by the office and must:\n(1) specify the cannabinoid that is the subject of the petition;\n(2) indicate whether the petition seeks to have the cannabinoid designated as nonintoxicating or approved for use in lower-potency hemp edibles;\n(3) indicate whether the cannabinoid has been identified in cannabis plants, cannabis extract, hemp plant parts, or hemp extract; and\n(4) include verified data, validated studies, or other evidence that is generally relied upon in the scientific community to support the petition.\n(c) The office must post all final determinations on the office's publicly facing website.\n(d) If the office denies a petition to designate a cannabinoid as nonintoxicating or to allow the cannabinoid's use in lower-potency hemp edibles, that denial shall be in effect for two years. Any petition filed under this subdivision within two years of a final determination denying a petition for the same cannabinoid must be summarily denied.",
	"repealed": false
}