{
	"id": "424B.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/424B.13",
	"title": "424B.13 CONVERSION OF RELIEF ASSOCIATION DEFINED BENEFIT PLAN TO DEFINED CONTRIBUTION PLAN.",
	"text": "(a) The board of trustees of a defined benefit relief association may convert the defined benefit plan to a defined contribution plan in accordance with this section.\n(b) A conversion consists of:\n(1) termination of the defined benefit plan;\n(2) establishment of a defined contribution plan; and\n(3) transfer and allocation of the assets of the defined benefit plan to accounts under the defined contribution plan.\n(c) The termination of the defined benefit plan does not dissolve the relief association, which is an ongoing nonprofit corporation under chapter 317A, unless dissolved under chapter 317A and section 424B.22.\nTo initiate and complete a conversion, the board of trustees must:\n(1) approve resolutions that:\n(i) state that the defined benefit plan is being converted to a defined contribution plan;\n(ii) designate a conversion effective date;\n(iii) direct that each participant, except any retiree in pay status who is receiving a monthly service pension from a relief association described in section 424A.093, becomes fully (100 percent) vested as of the conversion effective date in the participant's retirement benefit;\n(iv) if the relief association has a surplus as of the end of the relief association's most recent fiscal year before the conversion effective date, at the option of the board of trustees, conditionally increase the lump-sum benefit or monthly pension amount under the defined benefit plan, as provided under subdivision 4;\n(v) determine the method for allocating a surplus;\n(vi) adopt a defined contribution plan and approve a plan document that complies with section 424A.016 and states the terms and conditions for eligibility, vesting, allocation of contributions, distribution of retirement benefits, and any ancillary benefits; and\n(vii) authorize any bylaws amendments needed to incorporate items (i) to (vi) into the bylaws;\n(2) obtain the consent of the municipality or firefighting corporation if required by subdivision 3;\n(3) determine the present value of each participant's accrued benefit as of the conversion effective date as required by subdivision 5;\n(4) if there is a surplus, allocate the surplus under a method that complies with subdivision 6;\n(5) if there is not a surplus, take the actions required under subdivision 7;\n(6) provide the notices required under subdivisions 8 and 9; and\n(7) implement the conversion, including the requirements under subdivision 10.\nThe consent of the affiliated municipality, all municipalities if more than one municipality operates the fire department pursuant to a joint powers agreement, or firefighting corporation to a relief association's conversion of its defined benefit plan to a defined contribution plan is required as provided under subdivision 7 only if the relief association does not have a surplus as of the end of the relief association's most recent fiscal year before the conversion effective date.\n(a) If the relief association has a surplus as of the end of the relief association's most recent fiscal year before the conversion effective date, the board of trustees may approve a resolution that increases the lump-sum benefit or monthly pension amount or both the lump-sum and monthly pension amount, if the relief association offers both, and amends the relief association bylaws without the consent of the affiliated municipality or firefighting corporation, notwithstanding section 424A.02, subdivision 10. The resulting lump-sum benefit or monthly pension amount is not limited to the maximum lump-sum service pension amount or maximum monthly service pension amount under section 424A.02, subdivision 3.\n(b) The benefit increase must not cause the liabilities of the retirement plan to exceed the value of the assets, after taking into account full vesting as required under subdivision 2 and any administrative expenses arising from the conversion.\n(c) The board of trustees shall specify whether the benefit increase will apply only to participants who are members active as of the conversion effective date or whether the benefit increase will apply to all participants, including members who are not active as of the conversion effective date, notwithstanding section 424A.015, subdivision 6.\n(d) The board of trustees' resolution approving an increase in the benefit level must be considered conditional on there being sufficient assets to fund the increase and must state that if, as of the date benefits are transferred to the defined contribution plan, there are not sufficient assets to cover all benefit liabilities at the new higher benefit level, the benefit level will be reduced until assets equal or are greater than liabilities. The resolution must state that the new lower benefit level will be considered approved by the board of trustees without further action by the board.\n(a) The board of trustees shall determine the present value of each participant's accrued benefit, taking into account the full vesting requirement under subdivision 2 and any increase in the lump-sum benefit or monthly pension amount approved under subdivision 4:\n(1) using the method set forth in section 424A.092, subdivision 2, for determining a plan's funded status by calculating the value of each participant's accrued benefit; or\n(2) as determined by an actuary retained by the relief association, who meets the definition of approved actuary under section 356.215, subdivision 1, paragraph (c).\n(b) If the retirement plan pays a monthly pension, the board of trustees must determine the present value of the remaining payments to any retiree in pay status or beneficiary who is receiving an annuity. Present value must be determined by an actuary who meets the definition of approved actuary under section 356.215, subdivision 1, paragraph (c), retained by the relief association. At the discretion of the relief association, the relief association must provide the retiree in pay status or beneficiary receiving the annuity either:\n(1) an immediate lump-sum distribution of an amount equal to the present value of the remaining payments as determined by the actuary and permit the retiree in pay status or beneficiary to elect a lump-sum payment or a direct rollover of the amount to an eligible retirement plan as permitted under section 356.633, subdivisions 1 and 2, if the distribution is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d); or\n(2) continued payments in the same monthly amount under an annuity to be purchased by the board of trustees from a reputable insurance company licensed to do business in the state.\n(a) If, as of the conversion effective date, the defined benefit plan has a surplus, the board of trustees shall allocate the surplus as follows:\n(1) per capita method: each participant's account will receive the same dollar amount;\n(2) service-based method: each participant's account will receive a share of the surplus based on the ratio of the participant's years of service to the total years of service for all participants; or\n(3) participant and municipality sharing method under paragraph (b).\n(b) The board of trustees may allocate the surplus using the participant and municipality sharing method in accordance with this paragraph.\n(1) For this purpose, \"municipality\" means \"municipality\" or \"firefighting corporation,\" as applicable.\n(2) If the fire department is operated by more than one municipality under a joint powers agreement:\n(i) any consent by the municipality under this paragraph requires consent by each municipality that is party to the joint powers agreement;\n(ii) any payment of surplus to the municipality under this paragraph requires a payment of a pro rata share of surplus to each municipality that is party to the joint powers agreement; and\n(iii) any restrictions on the use of surplus applies to each municipality that is party to the joint powers agreement.\n(3) Under the participant and municipality sharing method:\n(i) first, the municipality will receive a share of the surplus based on the ratio of the municipal contributions made to the defined benefit relief association over a specified period of years to the total of fire state aid paid and municipal contributions made to the defined benefit relief association over the same period; and\n(ii) second, any remaining surplus will be allocated to accounts of participants using the per capita or service-based method.\n(4) The board of trustees may impose conditions on the use of the surplus by the municipality, as follows:\n(i) all or a specified portion of the surplus must be contributed back to the defined contribution relief association over a specified number of future years for allocation to the accounts of participants eligible for an allocation;\n(ii) all or a specified portion of the surplus must be used by the municipality for the purposes described in section 424A.08, paragraph (a) or (b); or\n(iii) all or a specified portion of the surplus must be used by the municipality to provide health insurance or other welfare benefits for the participants.\n(c) The board of trustees shall specify whether the surplus will be allocated only to participants who are members active as of the conversion effective date or whether the surplus will be allocated to all participants, including members who are not active as of the conversion effective date.\nIf the relief association does not have a surplus as of the end of the relief association's most recent fiscal year before the conversion effective date, the board of trustees shall:\n(1) obtain the consent of the municipality, of each municipality, if more than one municipality operates the fire department pursuant to a joint powers agreement, or of the firefighting corporation to the conversion and bylaws amendments under subdivision 2; and\n(2) either:\n(i) include with the resolutions of the board of trustees under subdivision 2 a resolution amending the relief association bylaws to decrease the lump-sum or monthly pension benefit level as necessary to reduce benefit liabilities until plan assets are sufficient to fund all benefit liabilities, taking into account full vesting under subdivision 2 and the payment of administrative expenses arising from the conversion; or\n(ii) enter into an agreement with the municipality, each municipality if more than one municipality operates the fire department pursuant to a joint powers agreement, or the firefighting corporation, as applicable, that requires the municipality, municipalities, or firefighting corporation, as applicable, to make a contribution in an amount sufficient to cover all benefit liabilities at the current benefit level, taking into account full vesting under subdivision 2 and the payment of administrative expenses arising from the conversion.\nThe board of trustees shall provide notice to all participants at least 90 days before the conversion effective date. The notice shall include:\n(1) an explanation that the plan is converting from a defined benefit plan to a defined contribution plan and provide definitions for those terms, the reasons for the conversion, the conversion effective date, and the procedure to be followed, including fully vesting all participants;\n(2) a summary of the terms of the newly adopted defined contribution plan;\n(3) information about any increase in the benefit level and whether the increase applies to all participants or only active members;\n(4) a section tailored to each participant that provides an estimate of the present value of the participant's fully vested accrued benefit and the calculation that resulted in that value;\n(5) an estimate of any anticipated surplus and an explanation of the disposition of the surplus, including, as applicable, a description of the method for allocating the surplus among participants' accounts and whether the municipality, each municipality, if more than one municipality operates the fire department pursuant to a joint powers agreement, or firefighting corporation will receive any of the surplus and any conditions on its use; and\n(6) contact information for one or more members of the board of trustees who will answer questions and provide a copy of the new defined contribution plan document or a summary, if requested, or directions to a website for viewing and printing the plan document or summary.\nThe relief association shall provide notice to the municipality, each municipality, if more than one municipality operates the fire department pursuant to a joint powers agreement, or firefighting corporation affiliated with the relief association and the state auditor at the same time as the notice required under subdivision 8. The notice must include the information required under subdivision 8, except that the individualized information will be provided as a spreadsheet listing the name of each participant and the corresponding accrued benefit amount.\n(a) A record-keeping account shall be established for each participant under the defined contribution plan to which is recorded the value of the participant's fully vested accrued benefit as determined as of the conversion effective date and the amount of any surplus allocated to the participant's account.\n(b) In no event may the value of a participant's account in the defined contribution plan be less as of the day following the conversion effective date than the present value of the participant's accrued benefit as of the day before the conversion effective date.",
	"repealed": false
}