{
	"id": "60A.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.761",
	"title": "60A.761 GLOSSARY OF TECHNICAL TERMS USED.",
	"text": "As used in sections 60A.76 to 60A.768, the terms in subdivisions 2 to 21 have the meanings given them.\n\"Annual claim cost\" means the net annual cost per unit of benefit before the addition of expenses, including claim settlement expenses, and a margin for profit or contingencies. For example, the annual claim cost for a $100 monthly disability benefit, for a maximum disability benefit period of one year, with an elimination period of one week, with respect to a male at age 35, in a certain occupation might be $12, while the gross premium for this benefit might be $18. The additional $6 would cover expenses and profit or contingencies.\n\"Claims accrued\" means that portion of claims incurred on or prior to the valuation date which result in liability of the insurer for the payment of benefits for medical services which have been rendered on or before the valuation date, and for the payment of benefits for days of hospitalization and days of disability which have occurred on or prior to the valuation date, which the insurer has not paid as of the valuation date, but for which it is liable, and will have to pay after the valuation date. This liability is sometimes referred to as a liability for \"accrued\" benefits. A claim reserve, which represents an estimate of this accrued claim liability, must be established.\n\"Claims reported\" means when an insurer has been informed that a claim has been incurred, if the date reported is on or before the valuation date, the claim is considered as a reported claim for annual statement purposes.\n\"Claims unaccrued\" means that portion of claims incurred on or before the valuation date which result in liability of the insurer for the payment of benefits for medical services expected to be rendered after the valuation date, and for benefits expected to be payable for days of hospitalization and days of disability occurring after the valuation date. This liability is sometimes referred to as a liability for \"unaccrued\" benefits. A claim reserve, which represents an estimate of the unaccrued claim payments expected to be made (which may or may not be discounted with interest) must be established.\n\"Claims unreported\" means when an insurer has not been informed, on or before the valuation date, concerning a claim that has been incurred on or prior to the valuation date, the claim is considered as an unreported claim for annual statement purposes.\n\"Date of disablement\" means the earliest date the insured is considered as being disabled under the definition of disability in the contract, based on a doctor's evaluation or other evidence. Normally this date will coincide with the start of any elimination period.\n\"Elimination period\" means a specified number of days, weeks, or months starting at the beginning of each period of loss, during which no benefits are payable.\n\"Gross premium\" means the amount of premium charged by the insurer. It includes the net premium (based on claim cost) for the risk, together with any loading for expenses, profit, or contingencies.\n\"Group insurance\" includes blanket insurance and franchise insurance and any other forms of group insurance.\n\"Level premium\" means a premium calculated to remain unchanged throughout either the lifetime of the policy, or for some shorter projected period of years. The premium need not be guaranteed; in which case, although it is calculated to remain level, it may be changed if any of the assumptions on which it was based are revised at a later time.\nGenerally, the annual claim costs are expected to increase each year and the insurer, instead of charging premiums that correspondingly increase each year, charges a premium calculated to remain level for a period of years or for the lifetime of the contract. In this case, the benefit portion of the premium is more than needed to provide for the cost of benefits during the earlier years of the policy and less than the actual cost in the later years. The building of a prospective contract reserve is a natural result of level premiums.\n\"Long-term care insurance\" means a qualified long-term care insurance policy or rider as defined in section 62S.01, subdivision 18, and a nonqualified long-term insurance policy or rider as defined in section 62A.46, subdivision 2.\n\"Modal premium\" refers to the premium paid on a contract based on a premium term which could be annual, semiannual, quarterly, monthly, or weekly. Thus if the annual premium is $100 and if, instead, monthly premiums of $9 are paid then the modal premium is $9.\n\"Negative reserve\" means normally the terminal reserve is a positive value. However, if the values of the benefits are decreasing with advancing age or duration it could be a negative value, called a negative reserve.\n\"Preliminary term reserve method\" means that under this method of valuation the valuation net premium for each year falling within the preliminary term period is exactly sufficient to cover the expected incurred claims of that year, so that the terminal reserves will be zero at the end of the year. As of the end of the preliminary term period, a new constant valuation net premium (or stream of changing valuation premiums) becomes applicable such that the present value of all such premiums is equal to the present value of all claims expected to be incurred following the end of the preliminary term period.\n\"Present value of amounts not yet due on claims\" means the reserve for \"claims unaccrued\" which may be discounted at interest.\n\"Rating block\" means a grouping of contracts determined by the valuation actuary based on common characteristics, such as a policy form or forms having similar benefit designs.\n\"Reserve\" includes all items of benefit liability, whether in the nature of incurred claim liability or in the nature of contract liability relating to future periods of coverage, and whether the liability is accrued or unaccrued.\nAn insurer under its contracts promises benefits, which result in:\n(a) claims which have been incurred, that is, for which the insurer has become obligated to make payment, on or prior to the valuation date. On these claims, payments expected to be made after the valuation date for accrued and unaccrued benefits are liabilities of the insurer which should be provided for by establishing claim reserves; or\n(b) claims which are expected to be incurred after the valuation date. Any present liability of the insurer for these future claims should be provided for by the establishment of contract reserves and unearned premium reserves.\n\"Terminal reserve\" means the reserve at the end of a contract year, and is defined as the present value of benefits expected to be incurred after that contract year minus the present value of future valuation net premiums.\n\"Unearned premium reserve\" means that portion of the premium paid or due to the insurer which is applicable to the period of coverage extending beyond the valuation date. Thus if an annual premium of $120 was paid on November 1, $20 would be earned as of December 31 and the remaining $100 would be unearned. The unearned premium reserve could be on a gross basis as in this example, or on a valuation net premium basis.\n\"Valuation net modal premium\" means the modal fraction of the valuation net annual premium that corresponds to the gross modal premium in effect on any contract to which contract reserves apply. Thus if the mode of payment in effect is quarterly, the valuation net modal premium is the quarterly equivalent of the valuation net annual premium.",
	"repealed": false
}