{
	"id": "136F.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.80",
	"title": "136F.80 GRANTS; GIFTS; BEQUESTS; DEVISES; ENDOWMENTS.",
	"text": "The board may apply for, receive, and accept on behalf of the state and for the benefit of any state college or university any grant, gift, bequest, devise, or endowment that any person, firm, corporation, foundation, or association may make to the board for the purposes of the state colleges and universities, or any federal, state, or private money made available for the purpose of providing student financial aid at the state colleges and universities. The board may use any money given to it or to any of the state colleges and universities consistent with the terms and conditions under which the money was received and for the purposes stated. All moneys under this subdivision are appropriated to the board for use in the colleges and universities and shall be administered within the college and university activity funds. These moneys shall not be taken into account in determining appropriations or allocations. All taxes and special assessments constituting a lien on any real property received and accepted by the board under this section shall be paid in full before title is transferred to the state.\nThe board shall provide by policy, in accordance with provisions of chapter 118A, for the deposit of all money received or referred to under this section. Whenever the board shall by resolution determine that there are moneys in the state college or university funds not currently needed, the board may by resolution authorize and direct the president of the college or university to invest a specified amount in securities as are duly authorized as legal investments for savings banks and trust companies. Securities so purchased shall be deposited and held for the board by any bank or trust company authorized to do a banking business in this state. Notwithstanding the provisions of chapter 118A, the State Board of Investment may invest assets of the board, colleges, and universities when requested by the board, college, or university.",
	"repealed": false
}