{
	"id": "97A.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.311",
	"title": "97A.311 LICENSES.",
	"text": "A person that alters a license in a material manner is guilty of a misdemeanor.\nA person that knowingly makes a false statement related to an application for a license, a license, or certificate, required by or issued under the game and fish laws, is guilty of a misdemeanor.\nA license agent that knowingly issues a license to an ineligible person or predates a license is guilty of a misdemeanor.\nIn addition to other penalties, a license agent that violates a law or rule of the commissioner relating to license sales, handling, or accounting forfeits the right to sell and handle licenses for a period of one year.\n(a) The commissioner may issue a refund on a license, not including any issuing fees paid under section 97A.485, subdivision 6, if the request is received within 90 days of the original license purchase and:\n(1) the licensee dies before the opening of the licensed season. The original license and a copy of the death certificate must be provided to the commissioner;\n(2) the licensee is unable to participate in the licensed activity because the licensee is called to active military duty or military leave is canceled during the entire open season of the licensed activity. The original license and a copy of the military orders or notice of cancellation of leave must be provided to the commissioner;\n(3) the licensee purchased two licenses for the same license season in error;\n(4) the licensee was not legally required to purchase the license to participate in the activity; or\n(5) evidence is provided to the commissioner that demonstrates the license was issued incorrectly by the department or license agent.\n(b) This subdivision does not apply to lifetime licenses.\nThe commissioner may correct a license or license type and refund the difference or charge the difference of the corrected license fee if:\n(1) the licensee provides evidence that the license was issued incorrectly by the department or license agent;\n(2) the request is made within 30 days of the original license purchase;\n(3) the season or license activities for the original license have not yet started at the time of the request; and\n(4) the licensee is entitled to the corrected license.",
	"repealed": false
}