{
	"id": "144.382",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.382",
	"title": "144.382 DEFINITIONS.",
	"text": "For the purposes of sections 144.381 to 144.387, the following terms have the meanings given.\n\"Commissioner\" means the state commissioner of health.\n\"Connector\" means gooseneck, pigtail, and other service line connectors. A connector is typically a short section of piping not exceeding two feet that can be bent and used for connections between rigid service piping.\n\"Federal regulations\" means rules promulgated by the federal environmental protection agency, or its successor agencies.\n\"Galvanized requiring replacement\" means a galvanized service line that is or was at any time connected to a lead service line or lead status unknown service line, or is currently or was previously affixed to a lead connector. The majority of galvanized service lines fall under this category.\n\"Galvanized service line\" means a service line made of iron or piping that has been dipped in zinc to prevent corrosion and rusting.\n\"Lead connector\" means a connector made of lead.\n\"Lead service line\" means a portion of pipe that is made of lead, which connects the water main to the building inlet. A lead service line may be owned by the water system, by the property owner, or both.\n\"Lead status unknown service line\" or \"unknown service line\" means a service line that has not been demonstrated to meet or does not meet the definition of lead free in section 1417 of the Safe Drinking Water Act.\n\"Nonlead service line\" means a service line determined through an evidence-based record, method, or technique not to be a lead service line or galvanized service line requiring replacement. Most nonlead service lines are made of copper or plastic.\n\"Public water supply\" has the meaning given to \"public water system\" in the federal Safe Drinking Water Act, United States Code, title 42, section 300f, clause (4).\n\"Service line\" means a portion of pipe that connects the water main to the building inlet. A service line may be owned by the water system, by the property owner, or both. A service line may be made of many materials, such as lead, copper, galvanized steel, or plastic.\n\"Supplier\" means a person who owns, manages or operates a public water supply.",
	"repealed": false
}