{
	"id": "103F.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.351",
	"title": "103F.351 LOWER ST. CROIX WILD AND SCENIC RIVER ACT.",
	"text": "The lower St. Croix River, between the dam near Taylors Falls and its confluence with the Mississippi River, constitutes a relatively undeveloped scenic and recreational asset lying close to the largest densely populated area of the state. The preservation of this unique scenic and recreational asset is in the public interest and will benefit the health and welfare of the citizens of the state. The state recognizes and concurs in the inclusion of the lower St. Croix River into the federal wild and scenic rivers system by the Lower St. Croix River Act of the 92nd Congress, Public Law 92-560. The authorizations of the state are necessary to the preservation and administration of the lower St. Croix River as a wild and scenic river, particularly in relation to those portions of the river that are to be jointly preserved and administered as a wild and scenic river by this state and Wisconsin.\n(a) The commissioner of natural resources shall join with the secretary of the United States Department of the Interior and the appropriate agency of the state of Wisconsin in the preparation of the comprehensive master plan relating to boundaries, classification, and development required by section 3 of the Lower St. Croix River Act of 1972, and by section 3(b) of the Wild and Scenic Rivers Act, Public Law 90-542.\n(b) The commissioner shall make the proposed comprehensive master plan available to affected local governmental bodies, shoreland owners, conservation and outdoor recreation groups, and the general public.\n(c) Not less than 30 days after making the information available, the commissioner shall conduct a public hearing on the proposed comprehensive master plan in the county seat of each county which contains a portion of the area covered by the comprehensive master plan, in the manner provided in chapter 14.\nThe commissioner of natural resources may acquire land, scenic easements, or other interests in land by gift, purchase, or other lawful means, and may acquire scenic easement interests in land by eminent domain. The acquisitions must be proposed for acquisition by the state by the comprehensive master plan.\n(a) The commissioner of natural resources shall adopt rules that establish guidelines and specify standards for local zoning ordinances applicable to the area within the boundaries covered by the comprehensive master plan.\n(b) The guidelines and standards must be consistent with this section, the federal Wild and Scenic Rivers Act, and the federal Lower St. Croix River Act of 1972. The standards specified in the guidelines must include:\n(1) the prohibition of new residential, commercial, or industrial uses other than those that are consistent with the above mentioned acts; and\n(2) the protection of riverway lands by means of acreage, frontage, and setback requirements on development.\n(c) Cities, counties, and towns lying within the areas affected by the guidelines shall adopt zoning ordinances complying with the guidelines and standards within the time schedule prescribed by the commissioner.\n(d) In rural districts, as defined in rules adopted pursuant to this section, commercial, nature-oriented, and educational uses may be allowed as conditional uses on properties that were in similar use on May 1, 1974, and on January 1, 2010, if the conditional use:\n(1) complies with all dimensional standards in the rules, including variance requirements for any changes to the properties made after January 1, 2010; and\n(2) is similar in scope to the use that existed on May 1, 1974.\nThe commissioner of natural resources in cooperation with appropriate federal authorities and authorities of the state of Wisconsin shall administer state lands and waters in conformance with this section, the federal Wild and Scenic Rivers Act, and the federal Lower St. Croix River Act of 1972.",
	"repealed": false
}