{
	"id": "62A.302",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.302",
	"title": "62A.302 COVERAGE OF DEPENDENTS.",
	"text": "This section applies to:\n(1) a health plan as defined in section 62A.011; and\n(2) a policy, contract, or certificate issued by a community integrated service network licensed under chapter 62N.\nEvery health plan included in subdivision 1 that provides dependent coverage must define \"dependent\" no more restrictively than the definition provided in section 62L.02, subdivision 11.\nAny health plan included in subdivision 1 that provides dependent coverage of children shall make that coverage available to children until the child attains 26 years of age. A health carrier must not place restrictions on this coverage and must comply with the following requirements:\n(1) with respect to a child who has not attained 26 years of age, a health carrier shall not define dependent for purposes of eligibility for dependent coverage of children other than the terms of a relationship between a child and the enrollee or spouse of the enrollee;\n(2) a health carrier must not deny or restrict coverage for a child who has not attained 26 years of age based on (i) the presence or absence of the child's financial dependency upon the participant, primary subscriber, or any other person; (ii) residency with the participant and in the individual market the primary subscriber, or with any other person; (iii) marital status; (iv) student status; (v) employment; or (vi) any combination of those factors; and\n(3) a health carrier must not deny or restrict coverage of a child based on eligibility for other coverage, except as provided in subdivision 5.\nNothing in this section requires a health carrier to make coverage available for a grandchild, unless the grandparent becomes the legal guardian or adoptive parent of that grandchild or unless the grandchild meets the requirements of section 62A.042. For grandchildren included under a grandparent's policy pursuant to section 62A.042, coverage for the grandchild may terminate if the grandchild does not continue to reside with the covered grandparent continuously from birth, if the grandchild does not remain financially dependent upon the covered grandparent, or when the grandchild reaches age 25, except as provided in section 62A.14 or if coverage is continued under section 62A.20.\nThe terms of coverage in a health plan offered by a health carrier providing dependent coverage of children cannot vary based on age except for children who are 26 years of age or older.\nA health carrier must comply with all provisions of the Affordable Care Act in regards to providing an opportunity to enroll in coverage to any child whose coverage ended, or was not eligible for coverage under a group health plan or individual health plan because, under the terms of the coverage, the availability of dependent coverage of a child ended before age 26.\n(a) For plan years beginning before January 1, 2014, a group health plan that is a grandfathered plan and makes available dependent coverage of children may exclude an adult child who has not attained 26 years of age from coverage only if the adult child is eligible to enroll in an eligible employer-sponsored health benefit plan, as defined in section 5000A(f)(2) of the Internal Revenue Code, other than the group health plan of a parent.\n(b) For plan years beginning on or after January 1, 2014, a group health plan that is a grandfathered plan must comply with all requirements of this section.\nThis section does not require compliance with any provision of the Affordable Care Act before the effective date provided for that provision in the Affordable Care Act.\nThe commissioner shall enforce this section.",
	"repealed": false
}