{
	"id": "508.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.58",
	"title": "508.58 REGISTRATION AFTER FORECLOSURE; NEW CERTIFICATE.",
	"text": "Any person who has, by an action or other proceeding to enforce or foreclose a mortgage, lien, or other charge upon registered land, become the owner in fee of the land, or any part thereof, may have the title registered. Except as provided in subdivision 2, the owner shall apply by duly verified petition to the court for a new certificate of title to such land, and the court shall thereupon, after due notice to all parties in interest and upon such hearing as the court may direct, make an order for the issuance of a new certificate of title to the person entitled thereto, and the registrar shall thereupon enter a new certificate of title to the land, or of the part thereof to which the petitioner is entitled as in the case of a voluntary conveyance.\nAny person who has become the owner in fee of registered land, or any part of the land, pursuant to a mortgage foreclosure by action under chapter 581 is entitled to a new certificate of title for the land described in the sheriff's certificate of sale or so much of the land as may be described in the certificate of title, after the redemption period expires. The registrar shall enter the new certificate of title only pursuant to the court order provided in subdivision 1 or upon the written directive of the examiner of titles as to the legal sufficiency of the mortgage foreclosure proceeding. The directive of the examiner of titles also must specify the instruments the registrar shall omit from the new certificate of title by virtue of the foreclosure.\nAt the request of a registered owner or other person in interest, the examiner of titles by a written directive may direct the registrar of titles to show by memorial on the certificate of title that a contract for the conveyance of a time share interest, as defined in section 515B.1-103(34), has been terminated in accordance with chapter 559. The directive also must specify the instruments the registrar shall omit from the next certificate of title because of the cancellation.\n(a) The procedures under this subdivision are limited to a time share interest in fee title that:\n(1) consists of not more than seven days in length in any year; and\n(2) is located within a county in which, upon the written recommendation of the county registrar of titles, the county board of commissioners has authorized, by resolution, the examiner of titles to issue directives for entry of a new certificate of title to a time share interest in the manner provided in paragraphs (b) and (c).\n(b) Upon expiration of the time allowed for redemption, any person who has become the owner in fee of a time share interest, as defined in paragraph (a), or a portion thereof, by a foreclosure of a mortgage or lien upon the time share interest, or any part thereof, may apply to the examiner of titles, for an examiner's directive directing the entry of a new certificate of title in the time share interest, or portion thereof.\n(c) Upon evidence submitted by the applicant, as the examiner may require and deem appropriate, the examiner shall determine the legal sufficiency of the foreclosure. If, in the opinion of the examiner, the evidence submitted is legally sufficient for foreclosure, the examiner shall issue a directive to the registrar to issue a new certificate of title for the interest. The directive of the examiner also must specify the instruments the registrar shall omit from the new certificate of title by virtue of the foreclosure. If the examiner of titles will not issue a directive pursuant to an application under this subdivision, the person may proceed under subdivision 1.\nThe registrar shall carry the memorials of all documents relating to a contract for deed cancellation until directed to remove them by court order or written examiner's directive. The examiner of titles may issue a written directive upon the request of the registered owner or other person in interest if documents evidencing a legally sufficient cancellation under section 559.21 have been of record on the certificate of title or certificate of possessory title for at least five years. The documents must include a copy of the notice of cancellation of contract for deed with proof of service thereof, and the affidavit of the seller, the seller's agent, or the seller's attorney showing that the purchaser has not complied with the terms of the notice. The court order or written directive of the examiner of titles must also specify the instruments the registrar shall omit from any successor certificate of title because of cancellation of the contract for deed.",
	"repealed": false
}