{
	"id": "90.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.121",
	"title": "90.121 INTERMEDIATE AUCTION SALES; MAXIMUM LOTS OF 3,000 CORDS.",
	"text": "(a) The commissioner may sell the timber on any tract of state land in lots not exceeding 3,000 cords in volume, in the same manner as timber sold at public auction under section 90.101, and related laws, subject to the following special exceptions and limitations:\n(1) the commissioner shall offer all tracts authorized for sale by this section separately from the sale of tracts of state timber made pursuant to section 90.101;\n(2) no bidder may be awarded more than 25 percent of the total tracts offered at the first round of bidding unless fewer than four tracts are offered, in which case not more than one tract shall be awarded to one bidder. Any tract not sold at public auction may be offered for private sale as authorized by section 90.101, subdivision 1, 30 days after the auction to responsible bidders eligible under this section at the appraised value; and\n(3) no sale may be made to a responsible bidder having more than 30 employees. For the purposes of this clause, \"employee\" means an individual working in the timber or wood products industry for salary or wages on a full-time or part-time basis.\n(b) The auction sale procedure set forth in this section constitutes an additional alternative timber sale procedure available to the commissioner and is not intended to replace other authority possessed by the commissioner to sell timber in lots of 3,000 cords or less.\n(c) Another bidder or the commissioner may request that the number of employees a bidder has pursuant to paragraph (a), clause (3), be confirmed by signed affidavit if there is evidence that the bidder may be ineligible due to exceeding the employee threshold. The commissioner shall request information from the commissioners of labor and industry and employment and economic development including the premiums paid by the bidder in question for workers' compensation insurance coverage for all employees of the bidder. The commissioner shall review the information submitted by the commissioners of labor and industry and employment and economic development and make a determination based on that information as to whether the bidder is eligible. A bidder is considered eligible and may participate in intermediate auctions until determined ineligible under this paragraph.",
	"repealed": false
}