{
	"id": "62S.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.20",
	"title": "62S.20 REQUIRED DISCLOSURE PROVISIONS.",
	"text": "(a) Individual long-term care insurance policies must contain a renewability provision that is appropriately captioned, appears on the first page of the policy, and clearly states that the coverage is guaranteed renewable or noncancelable. This subdivision does not apply to policies which are part of or combined with life insurance policies which do not contain a renewability provision and under which the right to nonrenew is reserved solely to the policyholder.\n(b) A long-term care insurance policy or certificate, other than one where the insurer does not have the right to change the premium, shall include a statement that premium rates may change.\nExcept for riders or endorsements by which the insurer effectuates a request made in writing by the insured under an individual long-term care insurance policy, all riders or endorsements added to an individual long-term care insurance policy after date of issue or at reinstatement or renewal which reduce or eliminate benefits or coverage in the policy must require signed acceptance by the individual insured. After the date of policy issue, a rider or endorsement which increases benefits or coverage with a concomitant increase in premium during the policy term must be agreed to, in writing, signed by the insured, except if the increased benefits or coverage are required by law. Where a separate additional premium is charged for benefits provided in connection with riders or endorsements, the premium charge must be specified in the policy, rider, or endorsement.\nA long-term care insurance policy which provides for the payment of benefits based on standards described as \"usual and customary,\" \"reasonable and customary,\" or similar words must include a definition and an explanation of the terms in its accompanying outline of coverage.\nIf a long-term care insurance policy or certificate contains any limitations with respect to preexisting conditions, the limitations must appear as a separate paragraph of the policy or certificate and must be labeled as \"preexisting condition limitations.\"\nA long-term care insurance policy or certificate containing any limitations or conditions for eligibility other than those prohibited in section 62S.06 shall provide a description of the limitations or conditions, including any required number of days of confinement, in a separate paragraph of the policy or certificate and shall label the paragraph \"limitations or conditions on eligibility for benefits.\"\nWith regard to life insurance policies that provide an accelerated benefit for long-term care, a disclosure statement is required at the time of application for the policy or rider and at the same time the accelerated benefit payment request is submitted that receipt of these accelerated benefits may be taxable, and that assistance should be sought from a personal tax advisor. The disclosure statement must be prominently displayed on the first page of the policy or rider and any other related documents. This subdivision does not apply to qualified long-term care insurance contracts.\nActivities of daily living and cognitive impairment must be used to measure an insured's need for long-term care and must be described in the policy or certificate in a separate paragraph and must be labeled \"Eligibility for the Payment of Benefits.\" Any additional benefit triggers must also be explained in this section. If these triggers differ for different benefits, explanation of the trigger must accompany each benefit description. If an attending physician, advanced practice registered nurse, physician assistant, or other specified person must certify a certain level of functional dependency in order to be eligible for benefits, this too shall be specified.\nA qualified long-term care insurance policy must include a disclosure statement in the policy that the policy is intended to be a qualified long-term care insurance policy under section 7702B(b) of the Internal Revenue Code of 1986, as amended.",
	"repealed": false
}