{
	"id": "216H.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/216H.02",
	"title": "216H.02 GREENHOUSE GAS EMISSIONS CONTROL.",
	"text": "(a) It is the goal of the state to reduce statewide greenhouse gas emissions across all sectors producing greenhouse gas emissions by at least the following amounts, compared with the level of emissions in 2005:\n(1) 15 percent by 2015;\n(2) 30 percent by 2025;\n(3) 50 percent by 2030; and\n(4) to net zero by 2050.\n(b) To the maximum extent practicable, actions taken to achieve these goals must avoid causing disproportionate adverse impacts to residents of communities that are or have been incommensurately exposed to pollution affecting human health and environmental quality.\n(c) The targets under paragraph (a) must be reviewed annually by the commissioner of the Pollution Control Agency, taking into account the latest scientific research on the impacts of climate change and strategies to reduce greenhouse gas emissions published by the Intergovernmental Panel on Climate Change. The commissioner must forward any recommended changes to the targets to the chairs and ranking minority members of legislative committees with primary jurisdiction over climate change and environmental policy.\n(d) For the purposes of the subdivision, \"net zero\" means:\n(1) statewide greenhouse gas emissions equal to zero; or\n(2) when annual anthropogenic emissions of greenhouse gases to the atmosphere are balanced by removals over a specific period.\nBy February 1, 2008, the commissioner of commerce, in consultation with the commissioners of the Pollution Control Agency, the Housing Finance Agency, and the Departments of Natural Resources, Agriculture, Employment and Economic Development, and Transportation, and the chair of the Metropolitan Council, shall submit to the legislature a climate change action plan that meets the requirements of this section.\nThe plan required by subdivision 2 must be developed through a structured, broadly inclusive stakeholder-based review of potential policies and initiatives that will reduce statewide greenhouse gas emissions from a broad range of sources and activities. The commissioner shall engage a nationally recognized independent expert entity to conduct the stakeholder process. The report of the stakeholder process must form the basis for the plan submitted by the commissioner under subdivision 2.\nThe plan must:\n(1) estimate 1990 and 2005 greenhouse gas emissions in the state and make projections of emissions in 2015, 2025, and 2050;\n(2) identify, evaluate, and integrate a broad range of statewide greenhouse gas reduction options for all emission sectors in the state;\n(3) assess the costs, benefits, and feasibility of implementing the options;\n(4) recommend an integrated set of reduction options and strategies for implementing the options that will achieve the goals in subdivision 1, including analysis of the associated costs and benefits to Minnesotans;\n(5) estimate the statewide greenhouse gas emissions reductions anticipated from implementation of existing state policies;\n(6) recommend a system to require the reporting of statewide greenhouse gas emissions, identifying which facilities must report, and how emission estimates should be made; and\n(7) evaluate the option of exempting a project from the prohibitions contained in section 216H.03, subdivision 3, if the project contributes a specified fee per ton of carbon dioxide emissions emitted annually by the project, the proceeds of which would be used to fund permanent, quantifiable, verifiable, and enforceable reductions in greenhouse gas emissions that would not otherwise have occurred.\n(a) The plan must evaluate and recommend interim goals as steps to achieve the goals in subdivision 1.\n(b) The plan must determine the feasibility, assess the costs and benefits, and recommend how the state could adopt a regulatory system that imposes a cap on the aggregate air pollutant emissions of a group of sources, requires those subject to the cap to own an allowance for each ton of the air pollutant emitted, and allows for market-based trading of those allowances. The evaluation must contain an analysis of the state implementing a cap and trade system alone, in coordination with other states, and as a requirement of federal law applying to all states. The plan must recommend the parameters of a cap and trade system that includes a cap that would prevent significant increases in greenhouse gas emissions above current levels with a schedule for lowering the cap periodically to achieve the goals in subdivision 1 and interim goals recommended under paragraph (a). The plan must consider cost savings and cost increases on energy consumers in the state.\n(c) The plan must include recommendations for improvements in the emissions inventory and recommend whether the state should require greenhouse gas emissions reporting from specific sources and, if so, which sources should be required to report. The plan must also evaluate options for an emissions registry after reviewing registries in other states and recommend a registry that will insure the greatest opportunity for Minnesota entities to obtain marketable credits.\nThe state must, to the extent possible, with other states in the Midwest region, develop and implement a regional approach to reducing greenhouse gas emissions from activities in the region, including consulting on a regional cap and trade system. The commissioner of commerce shall coordinate Minnesota's regional activities under this subdivision and report to the legislative committees in the senate and house of representatives with jurisdiction over energy and environmental policy by February 1, 2008, and February 1, 2009, on the progress made and recommendations for further action. The commissioner of commerce, as part of the activities required under this subdivision, must meet with responsible officials from bordering states, other states in the Midwest region, and states in other regions of the country to:\n(1) determine whether other states are interested in establishing and cooperating in a multistate or regional greenhouse gas cap and trade allowance program;\n(2) identify and prepare an inventory of greenhouse gas reduction resources available to support a multistate or regional greenhouse gas cap and trade allowance program;\n(3) seek cooperation on a regional inventory of greenhouse gas emission sources; and\n(4) prepare an inventory of available renewable energy resources within a state or region.\nThe commissioner of commerce must develop a definition of scope of this regional activity that is in addition to the components described in clauses (1) to (4). The commissioner must report on the additional scoping definitions to the chairs and ranking minority members of the legislative committees with jurisdiction over energy and environmental finance and policy on or before the commencement of the 2008 regular legislative session.",
	"repealed": false
}