{
	"id": "80E.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/80E.041",
	"title": "80E.041 WARRANTY OBLIGATIONS TO DEALERS.",
	"text": "Each new motor vehicle manufacturer shall specify in writing to each of its new motor vehicle dealers licensed in this state the dealer's obligations for preparation, delivery, and warranty service on its products. The manufacturer shall compensate the new motor vehicle dealer for warranty service parts and labor required of the new motor vehicle dealer by the manufacturer. Compensation for parts used in warranty service must include the motor vehicle dealer's actual cost of the part plus a reasonable percentage markup or be calculated as described in subdivision 2 at the election of the dealer. Compensation for labor used in warranty service must be reasonable and may at the election of the dealer be determined as described in subdivision 4. This section applies to all warranty repair service performed by the dealer for the manufacturer or with the approval of the manufacturer and for which the dealer is entitled to compensation or reimbursement from the manufacturer.\n(a) The dealer may establish a percentage markup to be applied to the cost of warranty parts by submitting 100 sequential nonwarranty customer-paid service repair orders to the manufacturer which contain warranty-like repairs, or 90 consecutive days of nonwarranty customer-paid service repair orders which contain warranty-like repairs, whichever is less, covering repairs made no more than 180 days before the submission.\n(b) A dealer's retail rate for parts shall be calculated by determining the dealer's total parts sales in the submitted service repair orders under paragraph (a) and dividing that amount by the dealer's total cost to purchase the parts, subtracting one from that amount, and then multiplying by 100. A manufacturer may disapprove a dealer's retail rate if:\n(1) the disapproval is provided to the dealer in writing;\n(2) the disapproval is sent to the dealer within 30 days of the submission of the retail rate by the dealer to the manufacturer;\n(3) the disapproval includes a reasonable substantiation that the retail rate submission is inaccurate, incomplete, or unreasonable in light of a comparison to the retail rate charged by other similarly situated franchised motor vehicle dealers in a comparable geographic area in the state offering the same line-make of vehicles; and\n(4) the manufacturer proposes an adjustment of the retail rate.\n(c) If a manufacturer fails to approve or disapprove the retail rate within this time period, the retail rate is approved. If a manufacturer disapproves a dealer's retail rate, and the dealer does not agree to the manufacturer's proposed adjustment, the parties shall use the manufacturer's internal dispute resolution procedure, if any, within a reasonable time after the dealer notifies the manufacturer of their failure to agree. If the manufacturer's internal dispute resolution procedure is unsuccessful, or if the procedure is not implemented within a reasonable time after the dealer notifies the manufacturer of their failure to agree, the dealer may use the civil remedies available under section 80E.17. A dealer must file a civil suit under section 80E.17, as permitted by this subdivision, within 60 days of receiving the manufacturer's proposed adjustment to the retail rate, or the conclusion of the manufacturer's internal dispute resolution procedure, whichever is later.\n(d) Charges for the following do not qualify as warranty-like repairs and are excluded from the calculations under this subdivision and subdivision 4:\n(1) repairs including parts and labor for manufacturer or distributor special events, specials, or promotional discounts for retail customer repairs;\n(2) parts sold at wholesale;\n(3) engine assemblies and transmission assemblies if the new motor vehicle dealer agrees to be compensated for those assemblies with a handling charge instead of a retail parts markup;\n(4) parts and labor to perform routine maintenance generally performed at predetermined intervals to keep a vehicle operating properly and not covered under any retail customer warranty, such as fluids, filters, and belts not provided in the course of repairs;\n(5) nuts, bolts, fasteners, and similar items that do not have an individual part number;\n(6) tires and labor to install or repair;\n(7) parts and labor to perform vehicle reconditioning; and\n(8) accessories.\nIf a manufacturer furnishes a new part to a dealer at no cost or at a reduced cost for use in performing repairs under this section, the manufacturer shall compensate the dealer the amount paid for the part, if any, plus an amount equal to the dealer's established percentage markup multiplied by the fair wholesale value of the part. The fair wholesale value of the part is the maximum of:\n(1) the amount the dealer paid for the part or a substantially identical part if already owned by the dealer;\n(2) the cost of the part shown in a current manufacturer's established price schedule; and\n(3) the cost of a substantially identical part shown in a current manufacturer's established price schedule.\n(a) Compensation for warranty labor must equal the dealer's effective nonwarranty labor rate multiplied by the time guide used by the dealer for nonwarranty customer-paid service repair orders. If no time guide exists for a warranty repair, compensation for warranty labor must equal the dealer's effective nonwarranty labor rate multiplied by the time actually spent to complete the repair order and must not be less than the time charged to retail customers for the same or similar work performed. The effective nonwarranty labor rate is determined by dividing the total customer labor charges for qualifying nonwarranty repairs in the repair orders submitted under subdivision 2 by the total number of labor hours that generated those sales. Compensation for warranty labor must include all diagnostic time for repairs performed under this section, including but not limited to all time spent communicating with the manufacturer's technical assistance or external manufacturer source in order to provide a warranty repair, and must not be less than the time charged to retail customers for the same or similar work performed.\n(b) A manufacturer may disapprove a dealer's effective nonwarranty labor rate if:\n(1) the disapproval is provided to the dealer in writing;\n(2) the disapproval is sent to the dealer within 30 days of the submission of the effective nonwarranty labor rate by the dealer to the manufacturer;\n(3) the disapproval includes a reasonable substantiation that the effective nonwarranty labor rate submission is inaccurate, incomplete, or unreasonable in light of a comparison to the retail rate charged by other similarly situated franchised motor vehicle dealers in a comparable geographic area in the state offering the same line-make vehicles; and\n(4) the manufacturer proposes an adjustment of the effective nonwarranty labor rate.\n(c) If a manufacturer fails to approve or disapprove the rate within this time period, the rate is approved. If a manufacturer disapproves a dealer's effective nonwarranty labor rate, and the dealer does not agree to the manufacturer's proposed adjustment, the parties shall use the manufacturer's internal dispute resolution procedure, if any, within a reasonable time after the dealer notifies the manufacturer of their failure to agree. If the manufacturer's internal dispute resolution procedure is unsuccessful, or if the procedure is not implemented within a reasonable time after the dealer notifies the manufacturer of their failure to agree, the dealer may use the civil remedies available under section 80E.17. A dealer must file a civil suit under section 80E.17, as permitted by this subdivision, within 60 days of receiving the manufacturer's proposed adjustment to the effective nonwarranty labor rate, or the conclusion of the manufacturer's internal dispute resolution procedure, whichever is later.\nA dealer shall not be permitted to establish a retail rate for parts or labor more than once per year.\n(a) Except as provided under paragraph (b), a manufacturer shall not otherwise recover its costs under this section from dealers within this state, including but not limited to a surcharge imposed on a dealer, solely intended to recover the cost of reimbursing a dealer for parts and labor pursuant to this section.\n(b) A manufacturer may recover its cost for reimbursing a dealer for parts and labor pursuant to this section if:\n(1) the manufacturer provides written notice at least 60 days in advance of the implementation of cost recovery;\n(2) the notice includes substantiation of the reasonableness of the cost recovery to be implemented, including by reference to a comparison to the retail rate charged by other similarly situated franchised motor vehicle dealers in a comparable geographic area in the state offering the same line-make of vehicles.\nIf the dealer does not agree to the amount of the manufacturer's cost recovery, the parties shall use the manufacturer's internal dispute resolution procedure, if any, within a reasonable time after the dealer notifies the manufacturer of its failure to agree. If the dealer is not satisfied with the result of the manufacturer's internal dispute resolution procedure or if, due to the manufacturer, the procedure is not initiated within a reasonable time after the dealer notifies the manufacturer of its failure to agree, the dealer may file a civil suit under section 80E.17, as permitted by this subdivision, within 60 days of receiving the notice that cost recovery will be implemented, or the conclusion of the manufacturer's internal dispute resolution procedure, whichever is later.\n(c) Cost recovery must not be implemented by a manufacturer pending conclusion of the process set forth under paragraph (b) in the case of dealer disagreement with the amount of cost recovery. If cost recovery is allowed at the conclusion of such process, it may be implemented retroactively from the date provided in the notice given under paragraph (b), clause (1).\n(d) As an alternative to the dispute resolution process in paragraph (b), or during the pendency of the dispute resolution process in paragraph (b), the dealer may reduce its retail rate and request that the manufacturer recalculate the amount of cost recovery or abandon the implementation of cost recovery.\n(e) Nothing in this subdivision prohibits a manufacturer from increasing prices for vehicles or parts in the normal course of business.\nIf a manufacturer has fewer than five dealers in the state offering the same line-make of vehicle, the comparisons set forth in subdivision 2, paragraph (b), clause (3); subdivision 4, paragraph (b), clause (3); and subdivision 6, paragraph (b), clause (2), may be made by reference to similarly situated franchised motor vehicle dealers in a comparable geographic area in the United States offering the same line-make of vehicle.\n(a) All claims made by new motor vehicle dealers under this section for labor and parts must be paid within 30 days of their approval. Claims must be either approved or disapproved within 30 days after they are submitted to the manufacturer in the manner and on the forms it prescribes. Any claims not specifically disapproved in writing within 30 days after the manufacturer receives them are deemed to be approved and payment must follow within 30 days, provided, however, that the manufacturer retains the right to audit the claims for a period of one year and to charge back any amounts paid on claims not reasonably substantiated or fraudulent claims. The manufacturer has the burden of proving that a claim is not reasonably substantiated or fraudulent.\n(b) The audit and charge back provisions of this subdivision also apply to all other incentive and reimbursement programs that are subject to audit by the manufacturer.\n(c) A manufacturer shall not deny a claim submitted under this section or charge back a claim or payment based solely on the dealer's incidental failure to comply with a claim processing procedure, a clerical error, or other administrative technicality, provided that the failure does not call into question the legitimacy of the claim. The manufacturer shall allow the dealer to resubmit the claim according to reasonable guidelines not later than 30 days after the dealer receives notice of the initial claim denial or charge back.\nAs between the dealer and the manufacturer, the obligations imposed by this section constitute the dealer's only responsibility for product liability based in whole or in part on strict liability in tort.\nFor purposes of this section, the term \"manufacturer\" includes \"distributor\" and includes manufacturers and distributors of motor vehicle engines. Dealer includes dealers of new motor vehicles and motor vehicle engines.\nIt is a violation of this section for any new motor vehicle manufacturer to fail to perform any warranty obligations that it undertakes under the motor vehicle manufacturer's warranty.",
	"repealed": false
}