{
	"id": "473H.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.06",
	"title": "473H.06 NOTIFICATION.",
	"text": "Upon receipt of an application, the authority shall determine if all material required in section 473H.05 has been submitted and, if so, shall determine that the application is complete. When used in this chapter, the term \"date of application\" means the date the application is determined complete by the authority. Within five days of the date of application, the authority shall forward the completed and signed application to the county recorder, and copies to the county auditor, the county assessor, the Metropolitan Council, and the county soil and water conservation district.\nThe county recorder shall record the application containing the restrictive covenant and return it to the applicant. If the land is registered, the registrar of titles shall memorialize the application containing the restrictive covenant upon the certificate of title. The authority shall be notified by the recorder or registrar of titles that the application has been recorded or memorialized.\nThe county auditor, for taxes payable in the following year and thereafter for the duration of the preserve, shall determine local tax rates, assessments and taxes involving the preserve according to the provisions of section 473H.10.\nThe county assessor, for taxes payable in the following calendar year and thereafter for the duration of the preserve, shall value and assess the agricultural preserve according to section 473H.10.\nThe Metropolitan Council shall maintain agricultural preserve maps, illustrating (a) certified long-term agricultural lands; and (b) lands covenanted as agricultural preserves. The council shall make yearly reports to the Department of Agriculture and such other agencies as the council deems appropriate.\nCounty auditors shall maintain records of the taxes assessed and paid on agricultural preserves in a manner prescribed by the commissioner of revenue for the orderly monitoring of the program.\nThe county soil and water conservation district may prepare an advisory statement of existing and potential conservation problems for the agricultural preserve land. The statement shall be forwarded to the owner of record and a copy of the statement shall be forwarded to the authority.",
	"repealed": false
}