{
	"id": "116.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.03",
	"title": "116.03 COMMISSIONER.",
	"text": "(a) The Office of Commissioner of the Pollution Control Agency is created and is under the supervision and control of the commissioner, who is appointed by the governor under the provisions of section 15.06.\n(b) The commissioner may appoint a deputy commissioner and assistant commissioners who shall be in the unclassified service.\n(c) The commissioner shall make all decisions on behalf of the agency.\nThe commissioner shall organize the agency and employ such assistants and other officers, employees and agents as the commissioner may deem necessary to discharge the functions of the commissioner's office, define the duties of such officers, employees and agents, and delegate to them any of the commissioner's powers, duties, and responsibilities, subject to the commissioner's control and under such conditions as the commissioner may prescribe. The commissioner may also contract with, and enter into grant agreements with, persons, firms, corporations, the federal government and any agency or instrumentality thereof, the Water Research Center of the University of Minnesota or any other instrumentality of such university, for doing any of the work of the commissioner's office. None of the provisions of chapter 16C, relating to bids, shall apply to such contracts.\nIt is part of the agency's mission that within the agency's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the agency as efficiently as possible;\n(3) coordinate the agency's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the agency.\n(a) It is the goal of the state that environmental and resource management permits be issued or denied within 90 days for tier 1 permits or 150 days for tier 2 permits following submission of a permit application. The commissioner of the Pollution Control Agency shall establish management systems designed to achieve the goal. For the purposes of this section, \"tier 1 permits\" are permits that do not require individualized actions or public comment periods, and \"tier 2 permits\" are permits that require individualized actions or public comment periods.\n(b) The commissioner shall prepare an annual permitting efficiency report that includes statistics on meeting the goal in paragraph (a) and the criteria for tier 2 by permit categories. The report is due August 1 each year. For permit applications that have not met the goal, the report must state the reasons for not meeting the goal. In stating the reasons for not meeting the goal, the commissioner shall separately identify delays caused by the responsiveness of the proposer, lack of staff, scientific or technical disagreements, or the level of public engagement. The report must specify the number of days from initial submission of the application to the day of determination that the application is complete. The report must aggregate the data for the year and assess whether program or system changes are necessary to achieve the goal. The report must be posted on the agency's website and submitted to the governor and the chairs and ranking minority members of the house of representatives and senate committees having jurisdiction over environment policy and finance.\n(c) The commissioner shall allow electronic submission of environmental review and permit documents to the agency.\n(d) Within 30 business days of application for a permit subject to paragraph (a), the commissioner of the Pollution Control Agency shall notify the permit applicant, in writing, whether the application is complete or incomplete. If the commissioner determines that an application is incomplete, the notice to the applicant must enumerate all deficiencies, citing specific provisions of the applicable rules and statutes, and advise the applicant on how the deficiencies can be remedied. If the commissioner determines that the application is complete, the notice must confirm the application's tier 1 or tier 2 permit status. If the commissioner believes that a complete application for a tier 2 construction permit cannot be issued within the 150-day goal, the commissioner must provide notice to the applicant with the commissioner's notice that the application is complete and, upon request of the applicant, provide the permit applicant with a schedule estimating when the agency will begin drafting the permit and issue the public notice of the draft permit. This paragraph does not apply to an application for a permit that is subject to a grant or loan agreement under chapter 446A.\n(e) For purposes of this subdivision, \"permit professional\" means an individual not employed by the Pollution Control Agency who:\n(1) has a professional license issued by the state of Minnesota in the subject area of the permit;\n(2) has at least ten years of experience in the subject area of the permit; and\n(3) abides by the duty of candor applicable to employees of the Pollution Control Agency under agency rules and complies with all applicable requirements under chapter 326.\n(f) Upon the agency's request, an applicant relying on a permit professional must participate in a meeting with the agency before submitting an application:\n(1) at least two weeks prior to the preapplication meeting, the applicant must submit at least the following:\n(i) project description, including, but not limited to, scope of work, primary emissions points, discharge outfalls, and water intake points;\n(ii) location of the project, including county, municipality, and location on the site;\n(iii) business schedule for project completion; and\n(iv) other information requested by the agency at least four weeks prior to the scheduled meeting; and\n(2) during the preapplication meeting, the agency shall provide for the applicant at least the following:\n(i) an overview of the permit review program;\n(ii) a determination of which specific application or applications will be necessary to complete the project;\n(iii) a statement notifying the applicant if the specific permit being sought requires a mandatory public hearing or comment period;\n(iv) a review of the timetable established in the permit review program for the specific permit being sought; and\n(v) a determination of what information must be included in the application, including a description of any required modeling or testing.\n(g) The applicant may select a permit professional to undertake the preparation of the permit application and draft permit.\n(h) If a preapplication meeting was held, the agency shall, within seven business days of receipt of an application, notify the applicant and submitting permit professional that the application is complete or is denied, specifying the deficiencies of the application.\n(i) Upon receipt of notice that the application is complete, the permit professional shall submit to the agency a timetable for submitting a draft permit. The permit professional shall submit a draft permit on or before the date provided in the timetable. Within 60 days after the close of the public comment period, the commissioner shall notify the applicant whether the permit can be issued.\n(j) Nothing in this section shall be construed to modify:\n(1) any requirement of law that is necessary to retain federal delegation to or assumption by the state; or\n(2) the authority to implement a federal law or program.\n(k) The permit application and draft permit shall identify or include as an appendix all studies and other sources of information used to substantiate the analysis contained in the permit application and draft permit. The commissioner shall request additional studies, if needed, and the permit applicant shall submit all additional studies and information necessary for the commissioner to perform the commissioner's responsibility to review, modify, and determine the completeness of the application and approve the draft permit.\n(a) The commissioner of the Pollution Control Agency is the state agent to apply for, receive, and disburse federal funds made available to the state by federal law or rules and regulations promulgated thereunder for any purpose related to the powers and duties of the Pollution Control Agency or the commissioner. The commissioner shall comply with any and all requirements of such federal law or such rules and regulations promulgated thereunder to facilitate application for, receipt, and disbursement of such funds. All such moneys received by the commissioner shall be deposited in the state treasury and are hereby annually appropriated to the commissioner for the purposes for which they are received. None of such moneys in the state treasury shall cancel and they shall be available for expenditure in accordance with the requirements of federal law.\n(b) The provisions of section 3.3005 shall not apply to money available under the federal Comprehensive Environmental Response, Compensation, and Liability Act of 1980, United States Code, title 42, sections 9601 to 9657, for which a state match is not required or for which a state match is available under the Environmental Response and Liability Act or from a political subdivision. The receipt of the money shall be reported to the Legislative Advisory Commission.\n[Repealed by amendment, 1996 c 405 s 6]\n[Repealed by amendment, 1996 c 405 s 6]\n[Repealed by amendment, 1996 c 405 s 6]\nWhen public notice of a draft individual tier 2 permit is required, the commissioner must provide to the applicant a draft permit for review by the applicant within 30 days after determining the proposal conforms to all federal and state laws and rules, unless the permit applicant and the commissioner mutually agree to a different date. The commissioner must consider all comments submitted by the applicant before issuing the permit.",
	"repealed": false
}