{
	"id": "103B.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.255",
	"title": "103B.255 GROUNDWATER PLANS.",
	"text": "A metropolitan county may prepare and adopt groundwater plans in accordance with this section.\nThe county may prepare and adopt the plan or, upon request of a soil and water conservation district, the county may delegate to the soil and water conservation district the preparation and adoption of all or part of a plan and the performance of other county responsibilities regarding the plan under this section and section 103B.231.\nTo ensure the coordination of efforts of all units of government during the preparation and implementation of watershed and groundwater plans, the county shall conduct meetings with local units of government and watershed management organizations and may enter into agreements with local units of government and watershed management organizations establishing the responsibilities during the preparation and implementation of the water plans.\nThe county may contract with the Minnesota Geological Survey, the United States Geological Survey, a soil and water conservation district, or other public or private agencies or persons for services in performing the county's responsibilities regarding the plan under this section and section 103B.231. Counties may enter into agreements with other counties or local units of government under section 471.59 for the performance of these responsibilities. To assist in the development of the groundwater plan, the county shall seek the advice of the advisory committee, the Minnesota Geological Survey, the Departments of Health and Natural Resources, the Pollution Control Agency, and other appropriate local, state, and federal agencies.\n(a) The county shall name an advisory committee of 15 members. The committee must include representatives of various interests, including construction, agriculture, hydrogeology, and well drilling. At least four members of the committee must be from the public at large with no direct pecuniary interest in any project involving groundwater protection. At least seven members must be appointed from watershed management organizations, statutory and home rule charter cities, and towns, and these local government representatives must be geographically distributed so that at least one is appointed from each county commissioner district.\n(b) The county shall consult the advisory committee on the development, content, and implementation of the plan, including the relationship of the groundwater plan and existing watershed and local water management plans, the effect of the groundwater plan on the other plans, and the allocation of costs and governmental authority and responsibilities during implementation.\n(a) The groundwater plan must specify the period covered by the plan and must extend at least five years but no more than ten years from the date the board approves the plan. The plan must contain the elements required by subdivision 7. Each element must be set out in the degree of detail and prescription necessary to accomplish the purposes of sections 103B.205 to 103B.255, considering the character of existing and anticipated physical and hydrogeologic conditions, land use, and development and the severity of existing and anticipated groundwater management problems in the county.\n(b) To the fullest extent possible in a manner consistent with groundwater protection, a county shall make maximum use of existing and available data and studies in preparing the groundwater plan and incorporate into its groundwater plan relevant data from existing plans and studies and the relevant provisions of existing plans adopted by watershed management organizations having jurisdiction wholly or partly within the county.\nA groundwater plan must:\n(1) cover the entire area within the county;\n(2) describe existing and expected changes to the physical environment, land use, and development in the county;\n(3) summarize available information about the groundwater and related resources in the county, including existing and potential distribution, availability, quality, and use;\n(4) state the goals, objectives, scope, and priorities of groundwater protection in the county;\n(5) contain standards, criteria, and guidelines for the protection of groundwater from pollution and for various types of land uses in environmentally sensitive areas, critical areas, or previously contaminated areas;\n(6) describe relationships and possible conflicts between the groundwater plan and the plans of other counties, local government units, and watershed management organizations in the affected groundwater system;\n(7) set forth standards, guidelines, and official controls for implementation of the plan by watershed management organizations and local units of government; and\n(8) include procedures and timelines for amending the groundwater plan.\n(a) Upon completion of the groundwater plan but before final adoption by the county, the county shall submit the draft plan for a 60-day review and comment period to adjoining counties, the Metropolitan Council, the state review agencies, the Board of Water and Soil Resources, each soil and water conservation district, town, statutory and home rule charter city, and watershed management organization having territory within the county. The county also shall submit the plan to any other county or watershed management organization or district in the affected groundwater system that could affect or be affected by implementation of the plan. Any political subdivision or watershed management organization that expects that substantial amendment of its plans would be necessary in order to bring them into conformance with the county groundwater plan shall describe as specifically as possible, within its comments, the amendments that it expects would be necessary and the cost of amendment and implementation. Reviewing entities have 60 days to review and comment. Differences among local governmental agencies regarding the plan must be mediated. Notwithstanding sections 103D.401, 103D.405, and 473.165, the council shall review the plan in the same manner and with the same authority and effect as provided in section 473.175 for review of the comprehensive plans of local government units. The council shall comment on the apparent conformity with metropolitan system plans of any anticipated amendments to watershed plans and local comprehensive plans. The council shall advise the Board of Water and Soil Resources on whether the plan conforms with the management objectives stated in the council's water resources plan and shall recommend changes in the plan that would satisfy the council's plan.\n(b) The county must respond in writing to any concerns expressed by the reviewing agencies within 30 days of receipt thereof.\n(c) The county shall hold a public hearing on the draft plan no sooner than 30 days and no later than 45 days after the 60-day review period of the draft plan.\nAfter completion of the review under subdivision 8, the draft plan, any amendments thereto, all written comments received on the plan, a record of the public hearing, and a summary of changes incorporated as part of the review process must be submitted to the Metropolitan Council, the state review agencies, and the Board of Water and Soil Resources for final review. The state review agencies shall review and comment on the consistency of the plan with state laws and rules relating to water and related land resources. The state review agencies shall forward their comments to the board within 45 days after they receive the final review draft of the plan. A state review agency may request and receive up to a 30-day extension of this review period from the board.\nAfter completion of the review under subdivision 9, the Board of Water and Soil Resources shall review the plan as provided in section 103D.401. The board shall review the plan for conformance with the requirements of sections 103B.205 to 103B.255, and chapter 103D. The board may not prescribe a plan but may disapprove all or parts of a plan which it determines is not in conformance with the requirements of sections 103B.205 to 103B.255, and chapter 103D.\nThe county shall adopt and implement its groundwater plan within 120 days after approval of the plan by the Board of Water and Soil Resources.\nTo the extent and in the manner required by the adopted plan, all amendments to the adopted plan must be submitted to the towns, cities, counties, the Metropolitan Council, the state review agencies, and the Board of Water and Soil Resources for review in accordance with the provisions of subdivisions 8 to 10.\nA metropolitan county may levy amounts necessary to administer and implement an approved and adopted groundwater plan. A county may levy amounts necessary to pay the reasonable increased costs to soil and water conservation districts and watershed management organizations of administering and implementing priority programs identified in the county's groundwater plan.",
	"repealed": false
}