{
	"id": "383B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.48",
	"title": "383B.48 BUYING STATE SUPPLEMENTAL INVESTMENT FUND SHARES.",
	"text": "(a) A participant in the Hennepin County supplemental retirement program shall indicate the investments, from those made available pursuant to section 383B.47, in which the participant's salary deductions and county matching contributions attributable to salary deductions are to be invested for such time as allowed by the Minnesota State Retirement System. The Minnesota State Retirement System shall purchase with the salary deductions and county matching funds attributable to the salary deductions shares in the appropriate investment in accordance with the indicated preferences of the participant.\n(b) The county of Hennepin has the authority to determine which investments made available pursuant to section 383B.47 will be available for participant investment. The shares purchased must stand in the name of the county of Hennepin.\n(c) A record must be kept by the Minnesota State Retirement System indicating the number of shares in each investment purchased with the salary deductions and county matching funds attributable to the salary deductions of each participant. The record must be known as the \"participant's share account record.\" The participant's share account record must show, in addition to the number of shares in the account, any cash balance of salary deductions or county matching funds attributable to those deductions which stand uninvested in shares.\n(d) At the option of the county of Hennepin, and subject to any terms and conditions established and communicated in writing by the county to a participant, the participant may designate no more often than once each month that prior salary deductions and county matching contributions attributable to the salary deductions, together with any interest earned, be reinvested in another investment made available under this section.",
	"repealed": false
}