{
	"id": "153A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/153A.20",
	"title": "153A.20 HEARING AID DISPENSER ADVISORY COUNCIL.",
	"text": "(a) The commissioner shall appoint seven persons to a Hearing Aid Dispenser Advisory Council.\n(b) The seven persons must include:\n(1) three public members, as defined in section 214.02. At least one of the public members shall be a prescription hearing aid user and one of the public members shall be either a prescription hearing aid user or an advocate of one;\n(2) three hearing aid dispensers certified under sections 153A.14 to 153A.20, each of whom is currently, and has been for the five years immediately preceding their appointment, engaged in prescription hearing aid dispensing in Minnesota and who represent the occupation of prescription hearing aid dispensing and who are not audiologists; and\n(3) one audiologist licensed as an audiologist under chapter 148 who dispenses prescription hearing aids, recommended by a professional association representing audiologists and speech-language pathologists.\n(c) The factors the commissioner may consider when appointing advisory council members include, but are not limited to, professional affiliation, geographical location, and type of practice.\n(d) No two members of the advisory council shall be employees of, or have binding contracts requiring sales exclusively for, the same prescription hearing aid manufacturer or the same employer.\nThe advisory council shall be organized and administered according to section 15.059. The council may form committees to carry out its duties.\nAt the commissioner's request, the advisory council shall:\n(1) advise the commissioner regarding hearing aid dispenser certification standards;\n(2) provide for distribution of information regarding hearing aid dispenser certification standards;\n(3) review investigation summaries of competency violations and make recommendations to the commissioner as to whether the allegations of incompetency are substantiated; and\n(4) perform other duties as directed by the commissioner.",
	"repealed": false
}