{
	"id": "609.522",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.522",
	"title": "609.522 ORGANIZED RETAIL THEFT.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Pattern of retail theft\" means acts committed or directed by the defendant on at least two separate occasions in the preceding six months that would constitute a violation of:\n(1) section 609.52, subdivision 2, paragraph (a), clause (1), (3), or (4), involving retail merchandise;\n(2) section 609.521;\n(3) section 609.53, subdivision 1, involving retail merchandise;\n(4) section 609.582 when the building was a retail establishment; or\n(5) section 609.59.\n(c) \"Retail establishment\" means the building where a retailer sells retail merchandise.\n(d) \"Retail merchandise\" means all forms of tangible property, without limitation, held out for sale by a retailer.\n(e) \"Retail theft enterprise\" means a group of two or more individuals with a shared goal involving the unauthorized removal of retail merchandise from a retailer. Retail theft enterprise does not require the membership of the enterprise to remain the same or that the same individuals participate in each offense committed by the enterprise.\n(f) \"Retailer\" means a person or entity that sells retail merchandise.\n(g) \"Value\" means the retail market value at the time of the theft or, if the retail market value cannot be ascertained, the cost of replacement of the property within a reasonable time after the theft.\nA person is guilty of organized retail theft if:\n(1) the person is employed by or associated with a retail theft enterprise;\n(2) the person has previously engaged in a pattern of retail theft and intentionally commits an act or directs another member of the retail theft enterprise to commit an act involving retail merchandise that would constitute a violation of:\n(i) section 609.52, subdivision 2, paragraph (a), clause (1), (3), or (4); or\n(ii) section 609.53, subdivision 1; and\n(3) the person or another member of the retail theft enterprise:\n(i) resells or intends to resell the stolen retail merchandise;\n(ii) advertises or displays any item of the stolen retail merchandise for sale; or\n(iii) returns any item of the stolen retail merchandise to a retailer for anything of value.\nWhoever commits organized retail theft may be sentenced as follows:\n(1) to imprisonment for not more than 15 years or to payment of a fine of not more than $35,000, or both, if the value of the property stolen exceeds $5,000;\n(2) to imprisonment for not more than seven years or to payment of a fine of not more than $14,000, or both, if either of the following circumstances exist:\n(i) the value of the property stolen is more than $1,000 but not more than $5,000; or\n(ii) the value of the property is more than $500 but not more than $1,000 and the person commits the offense within ten years of the first of two or more convictions under this section, section 256.98; 268.182; 609.24; 609.245; 609.52; 609.53; 609.582, subdivision 1, 2, or 3; 609.625; 609.63; 609.631; or 609.821, or a statute from another state, the United States, or a foreign jurisdiction, in conformity with any of those sections, and the person received a felony or gross misdemeanor sentence for the offense, or a sentence that was stayed under section 609.135 if the offense to which a plea was entered would allow imposition of a felony or gross misdemeanor sentence;\n(3) to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both, if either of the following circumstances exist:\n(i) the value of the property stolen is more than $500 but not more than $1,000; or\n(ii) the value of the property is $500 or less and the person commits the offense within ten years of a previous conviction under this section, section 256.98; 268.182; 609.24; 609.245; 609.52; 609.53; 609.582, subdivision 1, 2, or 3; 609.625; 609.63; 609.631; or 609.821, or a statute from another state, the United States, or a foreign jurisdiction, in conformity with any of those sections, and the person received a felony or gross misdemeanor sentence for the offense, or a sentence that was stayed under section 609.135 if the offense to which a plea was entered would allow imposition of a felony or gross misdemeanor sentence; or\n(4) to imprisonment of not more than 364 days or to payment of a fine of not more than $3,000, or both, if the value of the property stolen is $500 or less.\nThe value of the retail merchandise received by the defendant in violation of this section within any six-month period may be aggregated and the defendant charged accordingly in applying the provisions of this subdivision; provided that when two or more offenses are committed by the same person in two or more counties, the accused may be prosecuted in any county in which one of the offenses was committed for all of the offenses aggregated under this subdivision.\nIf a violation of this section creates a reasonably foreseeable risk of bodily harm to another, the penalties described in subdivision 3 are enhanced as follows:\n(1) if the penalty is a gross misdemeanor, the person is guilty of a felony and may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $5,000, or both; and\n(2) if the penalty is a felony, the statutory maximum sentence for the offense is 50 percent longer than for the underlying crime.",
	"repealed": false
}