{
	"id": "356.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.27",
	"title": "356.27 CITY OF ST. PAUL AND INDEPENDENT SCHOOL DISTRICT NO. 625, ST. PAUL; CONTRIBUTIONS TO MULTIEMPLOYER PLANS.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Building and construction trades\" means categories of employees who perform building construction, maintenance, or inspection services, including:\n(1) bricklayers;\n(2) carpenters;\n(3) cement masons;\n(4) electricians;\n(5) elevator constructors;\n(6) glaziers;\n(7) laborers;\n(8) operating engineers;\n(9) painters;\n(10) pipefitters;\n(11) plasterers;\n(12) plumbers;\n(13) roofers;\n(14) sheet metal workers; and\n(15) sprinkler fitters.\nBuilding and construction trades does not include machinists or teamsters.\n(c) \"Employers\" means the city of St. Paul and Independent School District No. 625, St. Paul.\n(d) \"Grandfathered trades employees\" means trades employees on whose behalf an employer made contributions on or before June 30, 2020, to PERA and to one or more multiemployer plans other than as provided in section 356.24, subdivision 1, clause (8), (9), or (10).\n(e) \"Multiemployer plan\" means a plan or fund subject to the federal Employee Retirement Income Security Act of 1974, as amended, to which more than one employer is required to contribute and that is maintained pursuant to one or more collective bargaining agreements between one or more labor organizations and more than one employer. For purposes of this section, a multiemployer plan may be: (1) either a defined benefit pension plan or a defined contribution retirement plan; and (2) either a plan that covers employees in one or more local units in the state of Minnesota or a plan that covers union employees nationwide.\n(f) \"PERA\" means the Public Employees Retirement Association general plan established under chapter 353.\n(g) \"Trades employees\" means employees principally employed in one of the building and construction trades.\nThe employers are authorized to negotiate, with labor organizations representing trades employees, collective bargaining agreements that provide for contributions to multiemployer plans on the basis of hours worked or paid. Any provision must identify each multiemployer plan to which contributions are to be made and, beginning with any such collective bargaining agreement or renewal thereof entered into after June 30, 2020, must include the employer identification number and plan number unique to the plan.\n(a) In connection with services performed for an employer under a collective bargaining agreement authorized by subdivision 2, a trades employee first hired by the employer on or after July 1, 2020, shall not participate in PERA, except for a trades employee whose employer makes contributions on behalf of the trades employee to PERA and to one or more multiemployer plans as provided in section 356.24, subdivision 1, clause (8), (9), or (10).\n(b) Grandfathered trades employees shall continue to participate in PERA according to chapter 353 and in one or more multiemployer plans pursuant to a collective bargaining agreement authorized by subdivision 2. Participation shall not be subject to section 356.24.\n(a) If an employer negotiates a collective bargaining agreement authorized by subdivision 2 that covers grandfathered trades employees, the employer shall annually submit a report that satisfies the requirements of paragraph (b) to the executive director of the Legislative Commission on Pensions and Retirement annually, no later than 60 days after the end of the employer's fiscal year.\n(b) The report shall provide for each labor organization the number of grandfathered trades employees for whom the employer made contributions during the prior fiscal year.\n(c) After receiving a report from an employer, the executive director of the Legislative Commission on Pensions and Retirement may request additional information that the employer shall promptly provide.\n(d) The reporting obligation expires upon submission of a report for the last fiscal year in which the employer makes a contribution to PERA with respect to a grandfathered trades employee.",
	"repealed": false
}