{
	"id": "3.8841",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8841",
	"title": "3.8841 LEGISLATIVE COMMISSION ON METROPOLITAN GOVERNMENT.",
	"text": "The Legislative Commission on Metropolitan Government is established to oversee the Metropolitan Council's operating and capital budgets, work program, and capital improvement program.\nThe commission consists of four senators appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration, three senators appointed by the senate minority leader, four state representatives appointed by the speaker of the house, and three state representatives appointed by the house minority leader. All members must reside in or represent a portion of the seven-county metropolitan area. The appointing authorities must ensure balanced geographic representation. Each appointing authority must make appointments as soon as possible after the opening of the next regular session of the legislature in each odd-numbered year.\nMembers of the commission serve for a two-year term beginning upon appointment and expiring upon appointment of a successor after the opening of the next regular session of the legislature in the odd-numbered year. A vacancy in the membership of the commission must be filled for the unexpired term in a manner that will preserve the representation established by this section.\nThe commission must meet as soon as practicable after members are appointed in each odd-numbered year to elect its chair and other officers as it may determine necessary. A chair serves a two-year term, expiring in the odd-numbered year after a successor is elected. The chair must alternate biennially between the senate and the house of representatives.\nMembers serve without compensation but may be reimbursed for their reasonable expenses as members of the legislature.\nLegislative staff must provide administrative and research assistance to the commission.\nThe commission meets at the call of the chair. If there is a quorum, the commission may take action by a simple majority vote of commission members present.\nThe commission must monitor, review, and make recommendations to the Metropolitan Council and to the legislature for the following calendar year on:\n(1) the tax rate and dollar amount of the Metropolitan Council's property tax levies and any proposed increases in the rate or dollar amount of tax;\n(2) any request for an increase in the debt of the Metropolitan Council;\n(3) the overall work and role of the Metropolitan Council;\n(4) the Metropolitan Council's proposed operating and capital budgets, work program, and capital improvement program; and\n(5) the Metropolitan Council's implementation of the operating and capital budgets, work program, and capital improvement program.\nThe commission must monitor appointments to the Metropolitan Council and may make recommendations on appointments to the nominating committee under section 473.123, subdivision 3, or to the governor before the governor makes the appointments. The commission may also make recommendations to the senate before appointments are presented to the senate for its advice and consent.",
	"repealed": false
}