{
	"id": "103C.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.225",
	"title": "103C.225 TERMINATING DISTRICTS.",
	"text": "(a) Five years after the organization of a district, a district board may, by resolution adopted by a majority of the board, or resident owners may, by a petition filed with the state board, ask that the operations and existence of the district be terminated. The resident owner petition must be signed by the lesser of:\n(1) at least one percent of the resident owners within the district; or\n(2) 500 resident owners within the district.\n(b) The state board may not receive a petition, conduct a referendum, or make a determination on a petition to discontinue a district more often than once in two years.\nThe state board may conduct public meetings and public hearings upon the petition as necessary to assist in consideration of the petition.\n(a) Upon receipt of a petition, the state board shall provide written notice to the secretary of state and the county auditor of each county in which the district is located no later than 74 days before the state general election. The notice must include the date of the election and the title and text of the question to be placed on the ballot. Prior to the referendum, the state board shall facilitate the preparation of a plan to continue the administration of the powers, duties, and responsibilities of the district, including the functions of the district board.\n(b) The question shall appear on the ballot in the following form: \"Shall the .................. (name of the soil and water conservation district to be here inserted) be terminated?\".\n(c) Only eligible voters in the district may vote in the referendum.\n(d) Informalities in the conduct of the referendum or matters relating to the referendum do not invalidate the referendum, or result of the referendum, if due notice has been given and the referendum has been fairly conducted.\n(e) The state board shall publish the result of the referendum.\n(a) The state board shall determine whether the continued operation of the district board is administratively feasible and give consideration to the public policy under section 103C.005, and:\n(1) the attitudes of land occupiers within the district;\n(2) the number of eligible voters who voted in the referendum;\n(3) the proportion of the votes cast in the referendum in favor of the discontinuance of the district to the total number of votes cast;\n(4) the approximate wealth and income of the land occupiers of the district;\n(5) the probable expense of carrying on erosion-control operations and related water quality improvements within the district;\n(6) the plan to continue the powers, duties, and responsibilities of the district board; and\n(7) other economic and social factors relevant to the determination.\n(b) If the state board determines that the continued operation of the district is administratively feasible, the state shall record the determination and deny the petition.\n(c) If the state board determines that the continued operation of the district is not administratively feasible, the state board shall record the determination and certify the determination to the district board. The state board may determine that the continued operation of the district is not administratively feasible only when at least a majority of the votes cast in the referendum have been cast in opposition to continuance and a satisfactory plan to continue the powers, duties, and responsibilities of the district board is completed.\nUpon receipt from the state board of a certification that the state board has determined that the continued operation of the district is not administratively feasible, the district board shall promptly terminate the affairs of the district. The district board shall dispose of all property belonging to the district at public auction and pay the proceeds into the state treasury.\nThe district board shall then file a verified application with the secretary of state to discontinue the district with the certificate of the state board setting forth its determination that the continued operation of the district is not administratively feasible. The application shall recite that the property of the district has been disposed of and the proceeds paid as provided in this section, and set forth a full accounting of the property and proceeds.\nThe secretary of state shall issue to the district board a certificate of dissolution and record the certificate in the secretary of state's office.\nUpon issuance of the certificate of dissolution, the ordinances and regulations in force in the district are of no further force. All contracts entered into, to which the district or district board were parties, shall remain in force and effect for the period provided in the contracts. The state board shall be substituted for the district or district board as party to the contracts and succeed to the district's rights and duties. The state board may delegate the district's rights and duties to a local government unit, as identified in the plan developed under subdivision 3.",
	"repealed": false
}