{
	"id": "221.0269",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.0269",
	"title": "221.0269 RELIEF FROM SAFETY REGULATION.",
	"text": "The governor may declare an emergency and grant relief from any of the regulations incorporated in section 221.0314 to carriers and drivers operating motor vehicles in Minnesota to provide emergency relief during the emergency. The relief granted may not exceed the duration of the motor carrier's or driver's direct assistance in providing emergency relief, or 30 days from the date of the initial declaration of the emergency, whichever is less.\nOn request of a carrier or driver, the commissioner may extend the 30-day relief period in subdivision 1. A request for extension must be in writing and must give a detailed explanation of the reasons for requesting additional relief. The commissioner shall consider the severity of the ongoing emergency and the nature of the relief services to be provided by the motor carrier or driver in determining whether to grant an extension. If the commissioner decides to grant an extension, the extension must include a new time limit and may include any restrictions on the carrier or driver the commissioner considers necessary.\n(a) Upon termination of direct assistance to an emergency relief effort, a carrier or driver is subject to the requirements of section 221.0314, except that a driver may return empty to a carrier's terminal or the driver's normal work reporting location without complying with that section. A driver who informs the carrier that the driver needs immediate rest must be permitted at least eight consecutive hours off duty before the driver is required to return to the terminal or location. Having returned to the terminal or other location, the driver must be relieved of all duty and responsibilities.\n(b) When a driver has been relieved of all duty and responsibilities upon termination of direct assistance to an emergency relief effort, a carrier shall neither permit nor require any driver used by it to drive nor shall any such driver drive in commerce until the driver:\n(1) has met the requirements of Code of Federal Regulations, title 49, section 395.3, paragraph (a), which is incorporated by reference; and\n(2) has had at least 34 consecutive hours off duty if (i) the driver has been on duty for more than 60 hours in any seven consecutive days at the time the driver is relieved of all duty if the employing carrier does not operate every day in the week, or (ii) the driver has been on duty for more than 70 hours in any eight consecutive days at the time the driver is relieved of all duty if the employing carrier operates every day in the week.\n(c) For purposes of this section, direct assistance to an emergency relief effort terminates when a driver or commercial motor vehicle is used to transport cargo not destined for the emergency relief effort, or when the carrier dispatches that driver or vehicle to another location to begin operations in commerce.\n(a) If a regional emergency has been declared by the President of the United States or by the Federal Motor Carrier Safety Administration pursuant to United States Code, title 49, section 390.23(a), the federal regulations incorporated into section 221.0314, subdivision 9, for hours of service do not apply to drivers engaged in intrastate transportation of fuel products when the driver is:\n(1) driving a vehicle designed and exclusively used to transport fuel products; and\n(2) carrying only fuel products as defined in section 296A.01.\n(b) The relief provided by paragraph (a) only applies when the fuel product being transported is included in the emergency declaration as a covered commodity.\n(c) Notwithstanding the relief provided in paragraph (a), a driver may not exceed a total of 14 hours combined on-duty and driving time after coming on duty following at least ten consecutive hours off-duty.\n(d) If a driver is operating under the relief provided by paragraph (a), and the declaration is in effect for more than 30 calendar days, the driver must take a 34-hour restart before the driver has been on duty for 30 consecutive days.",
	"repealed": false
}