{
	"id": "116.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.925",
	"title": "116.925 ELECTRIC ENERGY; MERCURY EMISSIONS REPORT.",
	"text": "To address the shared responsibility between the providers and consumers of electricity for the protection of Minnesota's lakes, each electric utility, as defined in section 216B.38, subdivision 5, and each person that generates electricity in this state for that person's own use or for sale at retail or wholesale shall provide to the commissioner of the Pollution Control Agency by April 1 an annual report of the amount of mercury emitted in generating that electricity at that person's facilities for the previous calendar year.\n(a) A report must include:\n(1) a list of all generation facilities owned or operated by the utility or person subject to subdivision 1;\n(2) all readily available information regarding the amount of electricity purchased by the utility or person subject to subdivision 1, for use in the state; and\n(3) information for each facility owned or operated by the utility or person subject to subdivision 1, stating: (i) the amount of electricity generated at the facility for use or for sale in this state at retail or wholesale; (ii) the amount of fuel used to generate that electricity at the facility; and (iii) the amount of mercury emitted in generating that electricity in the previous calendar year, based on emission factors, stack tests, fuel analysis, or other methods approved by the commissioner. The report must include the mercury content of the fuel if it is determined in conjunction with a stack test.\n(b) The following are de minimis standards for small and little-used generation facilities:\n(1) less than 240 hours of operation by the combustion unit per year;\n(2) a fuel capacity input at the combustion unit of less than 150,000,000 British thermal units per hour; or\n(3) an electrical generation unit with maximum output of less than or equal to 15 megawatts.\nA utility or person subject to this section who owns or operates a combustion unit that qualifies under one of these de minimis standards is not required to provide the information described in paragraph (a) for that combustion unit.\n(c) A report need not be filed for a combustion device for a year in which the device has documented mercury emissions of three pounds or less.\nBy January 1, 1999, and biennially thereafter in the report on air toxics required under section 115D.15, the commissioner shall report the amount of mercury emitted in the generation of electricity.",
	"repealed": false
}