{
	"id": "356A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/356A.06",
	"title": "356A.06 INVESTMENTS; ADDITIONAL DUTIES.",
	"text": "(a) Assets of a covered pension plan may be held only by:\n(1) the plan treasurer;\n(2) the State Board of Investment;\n(3) the depository agent of the plan;\n(4) a security broker or the broker's agent with, in either case, insurance equal to or greater than the plan assets held from the Securities Investor Protection Corporation or from excess insurance coverage; or\n(5) the depository agent of the State Board of Investment.\n(b) Legal title to plan assets must be vested in the plan, the State Board of Investment, the governmental entity that sponsors the plan, the nominee of the plan, or the depository agent. The holder of legal title shall function as a trustee for a person or entity with a beneficial interest in the assets of the plan.\nThe investment of plan assets must be diversified to minimize the risk of substantial investment losses unless the circumstances at the time an investment is made clearly indicate that diversification would not be prudent.\nNo fiduciary may personally profit, directly or indirectly, as a result of the investment or management of plan assets. This subdivision, however, does not preclude the receipt by a fiduciary of reasonable compensation, including membership in or the receipt of benefits from a pension plan, for the fiduciary's position with respect to the plan.\n(a) Each member of the governing board of a covered pension plan and the chief administrative officer of the plan shall file with the plan a statement of economic interest.\n(b) For a covered pension plan other than a plan specified in paragraph (c), the statement must contain the information required by section 10A.09, subdivision 5, and any other information that the fiduciary or the governing board of the plan determines is necessary to disclose a reasonably foreseeable potential or actual conflict of interest.\n(c) For a covered pension plan governed by sections 424A.091 to 424A.096 or the Bloomington Fire Department Relief Association if its special fund assets are under $8,000,000, the statement must contain the following:\n(1) the person's principal occupation and principal place of business;\n(2) whether or not the person has an ownership of or interest of ten percent or greater in an investment security brokerage business, a real estate sales business, an insurance agency, a bank, a savings and loan, or another financial institution; and\n(3) any relationship or financial arrangement that can reasonably be expected to give rise to a conflict of interest.\n(d) The statement must be filed annually with the chief administrative officer of the plan and be available for public inspection during regular office hours at the office of the pension plan.\n(e) A disclosure form meeting the requirements of the federal Investment Advisers Act of 1940, United States Code, title 15, sections 80b-1 to 80b-21 as amended, and filed with the State Board of Investment or the pension plan meets the requirements of this subdivision.\n(f) The chief administrative officer of each covered pension plan, by January 15, annually, shall transmit a certified listing of all individuals who have filed statements of economic interest with the plan under this subdivision during the preceding 12 months and the address of the office referenced in paragraph (d) to the Campaign Finance and Public Disclosure Board.\nThe chief administrative officer of a covered pension plan, with respect to investments made by the plan, and the executive director of the State Board of Investment, with respect to investments of plan assets made by the board, shall annually disclose in writing the recipients of investment business placed with or investment commissions allocated among commercial banks, investment bankers, brokerage organizations, or other investment managers. The disclosure document must be prepared within 60 days after the close of the fiscal year of the plan and must be available for public inspection during regular office hours at the office of the plan. The disclosure document must also be filed with the executive director of the Legislative Commission on Pensions and Retirement within 90 days after the close of the fiscal year of the plan. For the State Board of Investment and the St. Paul Teachers Retirement Fund Association, a disclosure document included as part of a regular annual report when filed with the executive director of the Legislative Commission on Pensions and Retirement is considered to have been filed on a timely basis. An officer or member of the board of trustees of a covered pension plan governed by sections 424A.091 to 424A.096 or the Bloomington Fire Department Relief Association may file the disclosure document with the executive director of the Legislative Commission on Pensions and Retirement by email.\n(a) Authority. This subdivision specifies the investment authority for a limited list plan. A limited list plan is a covered pension plan that does not:\n(1) have pension fund assets with a market value in excess of $1,000,000;\n(2) use the services of an investment advisor registered with the Securities and Exchange Commission in accordance with the Investment Advisers Act of 1940, or registered as an investment advisor in accordance with sections 80A.58, and 80A.60, for the investment of at least 60 percent of its pension fund assets, calculated on market value;\n(3) use the services of the State Board of Investment for the investment of at least 60 percent of its pension fund assets, calculated on market value; or\n(4) use a combination of the services of an investment advisor meeting the requirements of clause (2) and the services of the State Board of Investment for the investment of at least 75 percent of its pension fund assets, calculated on market value.\n(b) Investment agency appointment authority. The governing board of a covered pension plan may select and appoint investment agencies to act for or on its behalf.\n(c) Savings accounts; similar vehicles. A limited list plan is authorized to invest in:\n(1) certificates of deposit issued, to the extent of available insurance or collateralization, by a financial institution that is a member of the Federal Deposit Insurance Corporation, that is insured by the National Credit Union Administration, or that is authorized to do business in this state and has deposited with the chief administrative officer of the plan a sufficient amount of marketable securities as collateral in accordance with section 118A.03;\n(2) guaranteed investment contracts, limited to those issued by insurance companies or banks rated in the top four quality categories by a nationally recognized rating agency or to alternative guaranteed investment contracts where the underlying assets comply with the requirements of this paragraph; and\n(3) savings accounts, limited to those fully insured by federal agencies.\n(d) Government-backed obligations. A limited list plan is authorized to invest in governmental obligations as further specified in this paragraph, including bonds, notes, bills, mortgages, and other evidences of indebtedness, if the issue is backed by the full faith and credit of the issuer or if the issue is rated among the top four quality rating categories by a nationally recognized rating agency. The obligations in which plans are authorized to invest under this paragraph are guaranteed or insured issues of:\n(1) the United States, one of its agencies, one of its instrumentalities, or an organization created and regulated by an act of Congress;\n(2) the Dominion of Canada or one of its provinces if the principal and interest are payable in United States dollars;\n(3) a state or one of its municipalities, political subdivisions, agencies, or instrumentalities; or\n(4) any United States government-sponsored organization of which the United States is a member if the principal and interest are payable in United States dollars.\n(e) Corporate obligations. A limited list plan is authorized to invest in corporate obligations, including bonds, notes, debentures, transportation equipment obligations, or any other longer-term evidences of indebtedness issued or guaranteed by a corporation organized under the laws of the United States or any of its states, or the Dominion of Canada or any of its provinces if:\n(1) the principal and interest are payable in United States dollars; and\n(2) the obligations are rated among the top four quality categories by a nationally recognized rating agency.\n(f) Mutual fund authority, limited list authorized assets. Securities authorized under paragraphs (c) to (e) may be owned directly or through shares in exchange-traded funds, or through open-end mutual funds, or as units of commingled trusts.\n(g) Extended mutual fund authority. Notwithstanding restrictions in other paragraphs of this subdivision, a limited list plan is authorized to invest the assets of the special fund in exchange-traded funds and open-end mutual funds, if their portfolio investments comply with the type of securities authorized for investment under section 356A.06, subdivision 7, paragraphs (c) to (g). Investments under this paragraph must not exceed 75 percent of the assets of the special fund, not including any money market investments through mutual or exchange-traded funds.\n(h) Supplemental fund authority. The governing body of a limited list plan may certify special fund assets to the State Board of Investment for investment under section 11A.17.\n(i) Assets mix restrictions. A limited list plan must conform to the asset mix limitations specified in section 356A.06, subdivision 7.\n(a) Authority. A covered pension plan not described by subdivision 6, paragraph (a), is an expanded list plan and shall invest its assets as specified in this subdivision. The governing board of an expanded list plan may select and appoint investment agencies to act for or on its behalf.\n(b) Securities generally; investment forms. An expanded list plan is authorized to purchase, sell, lend, and exchange the investment securities authorized under this subdivision, including puts and call options and future contracts traded on a contract market regulated by a governmental agency or by a financial institution regulated by a governmental agency. These securities may be owned directly or through shares in exchange-traded or mutual funds, or as units in commingled trusts, subject to any limitations specified in this subdivision.\n(c) Government obligations. An expanded list plan is authorized to invest funds in governmental bonds, notes, bills, mortgages, and other evidences of indebtedness if the issue is backed by the full faith and credit of the issuer or the issue is rated among the top four quality rating categories by a nationally recognized rating agency. The obligations in which funds may be invested under this paragraph are guaranteed or insured issues of:\n(1) the United States, one of its agencies, one of its instrumentalities, or an organization created and regulated by an act of Congress;\n(2) the Dominion of Canada or one of its provinces if the principal and interest are payable in United States dollars;\n(3) a state or one of its municipalities, political subdivisions, agencies, or instrumentalities; and\n(4) a United States government-sponsored organization of which the United States is a member if the principal and interest are payable in United States dollars.\n(d) Investment-grade corporate obligations. An expanded list plan is authorized to invest funds in bonds, notes, debentures, transportation equipment obligations, or any other longer term evidences of indebtedness issued or guaranteed by a corporation organized under the laws of the United States or any of its states, or the Dominion of Canada or any of its provinces if:\n(1) the principal and interest are payable in United States dollars; and\n(2) the obligations are rated among the top four quality categories by a nationally recognized rating agency.\n(e) Below-investment-grade corporate obligations. An expanded list plan is authorized to invest in unrated corporate obligations or in corporate obligations that are not rated among the top four quality categories by a nationally recognized rating agency if:\n(1) the aggregate value of these obligations does not exceed five percent of the covered pension plan's market value;\n(2) the covered pension plan's participation is limited to 50 percent of a single offering subject to this paragraph; and\n(3) the covered pension plan's participation is limited to 25 percent of an issuer's obligations subject to this paragraph.\n(f) Other obligations. (1) An expanded list plan is authorized to invest funds in:\n(i) bankers acceptances and deposit notes if issued by a United States bank that is rated in the highest four quality categories by a nationally recognized rating agency;\n(ii) certificates of deposit if issued by a United States bank or savings institution rated in the highest four quality categories by a nationally recognized rating agency or whose certificates of deposit are fully insured by federal agencies, or if issued by a credit union in an amount within the limit of the insurance coverage provided by the National Credit Union Administration;\n(iii) commercial paper if issued by a United States corporation or its Canadian subsidiary and if rated in the highest two quality categories by a nationally recognized rating agency;\n(iv) mortgage securities and asset-backed securities if rated in the top four quality categories by a nationally recognized rating agency;\n(v) repurchase agreements and reverse repurchase agreements if collateralized with letters of credit or securities authorized in this section;\n(vi) guaranteed investment contracts if issued by an insurance company or a bank that is rated in the top four quality categories by a nationally recognized rating agency or alternative guaranteed investment contracts if the underlying assets comply with the requirements of this subdivision;\n(vii) savings accounts if fully insured by a federal agency; and\n(viii) guaranty fund certificates, surplus notes, or debentures if issued by a domestic mutual insurance company.\n(2) Sections 16A.58, 16C.03, subdivision 4, and 16C.05 do not apply to certificates of deposit and collateralization agreements executed by the covered pension plan under clause (1), item (ii).\n(3) In addition to investments authorized by clause (1), item (iv), an expanded list plan is authorized to purchase from the Minnesota Housing Finance Agency all or any part of a pool of residential mortgages, not in default, that has previously been financed by the issuance of bonds or notes of the agency. The covered pension plan may also enter into a commitment with the agency, at the time of any issue of bonds or notes, to purchase at a specified future date, not exceeding 12 years from the date of the issue, the amount of mortgage loans then outstanding and not in default that have been made or purchased from the proceeds of the bonds or notes. The covered pension plan may charge reasonable fees for any such commitment and may agree to purchase the mortgage loans at a price sufficient to produce a yield to the covered pension plan comparable, in its judgment, to the yield available on similar mortgage loans at the date of the bonds or notes. The covered pension plan may also enter into agreements with the agency for the investment of any portion of the funds of the agency. The agreement must cover the period of the investment, withdrawal privileges, and any guaranteed rate of return.\n(g) Corporate stocks. An expanded list plan is authorized to invest in stocks or convertible issues of any corporation organized under the laws of the United States or any of its states, any corporation organized under the laws of the Dominion of Canada or any of its provinces, or any corporation listed on an exchange that is regulated by an agency of the United States or of the Canadian national government.\nAn investment in any corporation must not exceed five percent of the total outstanding shares of that corporation, except that an expanded list plan may hold up to 20 percent of the shares of a real estate investment trust and up to 20 percent of the shares of a closed mutual fund. Purchase of shares of exchange-traded or mutual funds shall be consistent with paragraph (b).\n(h) Other investments. (1) In addition to the investments authorized in paragraphs (b) to (g), and subject to the provisions in clause (2), an expanded list plan is authorized to invest funds in:\n(i) equity and debt investment businesses through participation in limited partnerships, trusts, private placements, limited liability corporations, limited liability companies, limited liability partnerships, and corporations;\n(ii) real estate ownership interests or loans secured by mortgages or deeds of trust or shares of real estate investment trusts, through investment in limited partnerships, bank-sponsored collective funds, trusts, mortgage participation agreements, and insurance company commingled accounts, including separate accounts;\n(iii) resource investments through limited partnerships, trusts, private placements, limited liability corporations, limited liability companies, limited liability partnerships, and corporations; and\n(iv) international securities.\n(2) The investments authorized in clause (1) must conform to the following provisions:\n(i) the aggregate value of all investments made under clause (1), items (i), (ii), and (iii), may not exceed 35 percent of the market value of the fund for which the expanded list plan is investing;\n(ii) there must be at least four unrelated owners of the investment other than the expanded list plan for investments made under clause (1), item (i), (ii), or (iii);\n(iii) the expanded list plan's participation in an investment vehicle is limited to 20 percent thereof for investments made under clause (1), item (i), (ii), or (iii);\n(iv) the expanded list plan's participation in a limited partnership does not include a general partnership interest or other interest involving general liability. The expanded list plan may not engage in any activity as a limited partner which creates general liability;\n(v) the aggregate value of all unrated obligations and obligations that are not rated among the top four quality categories by a nationally recognized rating agency authorized by paragraph (e) and clause (1), item (iv), must not exceed five percent of the covered plan's market value; and\n(vi) for volunteer firefighter relief associations, emerging market equity and international debt investments authorized under clause (1), item (iv), must not exceed 15 percent of the association's special fund market value.\n(i) Supplemental plan investments. The governing body of an expanded list plan may certify assets to the State Board of Investment for investment under section 11A.17.\n(j) Asset mix limitations. The aggregate value of an expanded list plan's investments under paragraphs (g) and (h) and equity investments under paragraph (i), regardless of the form in which these investments are held, must not exceed 85 percent of the covered plan's market value.\nAny agreement to lend securities must be concurrently collateralized with cash or securities with a market value of not less than 100 percent of the market value of the loaned securities at the time of the agreement. For a covered pension authorized to purchase put and call options and futures contracts under subdivision 7, any agreement for put and call options and futures contracts may only be entered into with a fully offsetting amount of cash or securities. Only securities authorized by this section, excluding those under subdivision 7, paragraph (h), clause (1), items (i) to (iv), may be accepted as collateral or offsetting securities.\nA covered pension plan described by subdivision 6 or 7, in order to pay benefits as they come due, shall invest a portion of its assets in authorized short-term debt obligations that can be immediately liquidated without accrual of a substantial determinable penalty or loss and that have an average maturity of no more than 90 days. The chief administrative officer of the plan shall determine the minimum liquidity requirement of the plan and shall retain appropriate documentation of that determination for three years from the date of determination.\n(a) The governing board of a covered pension plan shall designate a national bank, an insured state bank, an insured credit union, or an insured thrift institution as the depository for the pension plan for assets not held by the pension plan's custodian bank.\n(b) Unless collateralized as provided under paragraph (c), a covered pension plan may not deposit in a designated depository an amount in excess of the insurance held by the depository in the Federal Deposit Insurance Corporation or the National Credit Union Administration, whichever applies.\n(c) For an amount greater than the insurance under paragraph (b), the depository must provide collateral in compliance with section 118A.03 or with any comparable successor enactment relating to the collateralization of municipal deposits.\n(a) For this subdivision, the term \"broker\" means a broker, broker-dealer, investment advisor, investment manager, or third-party agent who transfers, purchases, sells, or obtains investment securities for, or on behalf of, a covered pension plan.\n(b) Before a covered pension plan may complete an investment transaction with or in accord with the advice of a broker, the covered pension plan shall provide annually to the broker a written statement of investment restrictions applicable under state law to the covered pension plan or applicable under the pension plan governing board investment policy.\n(c) A broker must acknowledge in writing annually the receipt of the statement of investment restrictions and must agree to handle the covered pension plan's investments and assets in accord with the provided investment restrictions. A covered pension plan may not enter into or continue a business arrangement with a broker until the broker has provided this written acknowledgment to the chief administrative officer of the covered pension plan.\n(d) If any portion of the plan's assets are held by a security broker or its agent, the security broker or its agent must acknowledge in writing annually that sufficient insurance has been obtained from the Securities Investor Protection Corporation, supplemented by additional insurance, if necessary, to cover the full amount of covered pension plan assets held by the security broker or its agent. Uniform acknowledgment forms prepared by the state auditor shall be used by covered pension plans and brokers to meet the requirements of this subdivision.\n(a) No fiduciary of a covered pension plan may engage in a prohibited transaction or allow the plan to engage in a transaction that the fiduciary knows or should know is a prohibited transaction.\n(b) A prohibited transaction is any of the following transactions, whether direct or indirect:\n(1) the sale, exchange, or lease of real estate between the pension plan and a fiduciary of the plan;\n(2) the lending of money or other extension of credit between the plan and a fiduciary of the plan;\n(3) the furnishing to a plan by a fiduciary for compensation or remuneration, of goods, services other than those performed in the capacity of fiduciary, or facilities;\n(4) the furnishing to a fiduciary by a plan of goods, services, or facilities other than office and related space, equipment and office supplies, and administrative services appropriate to the recipient's fiduciary position;\n(5) the transfer of plan assets to a plan fiduciary for use by or for the benefit of the fiduciary, other than the payment of retirement plan benefits to which a fiduciary is entitled or the payment to a fiduciary of a reasonable salary and of necessary and reasonable expenses incurred by the fiduciary in the performance of the fiduciary's duties; and\n(6) the sale, exchange, loan, or lease of any item of value between a plan and a fiduciary of the plan other than for a fair market value and as a result of an arm's-length transaction.\n(a) To the extent that a plan governed by chapter 352D, 353D, 354B, 354C, or 354D permits a participant or beneficiary to select among investment products for the person's account and the participant or beneficiary exercises that investment self-direction, no fiduciary is liable for any loss which may result from the participant's or beneficiary's exercise of that investment self-direction.\n(b) Subdivisions 1, 2, 6, 8, and 8a do not apply to plans governed by chapter 354B or 354C.",
	"repealed": false
}