{
	"id": "297E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.06",
	"title": "297E.06 ORGANIZATION REPORTS AND RECORDS.",
	"text": "An organization must file with the commissioner, on a form prescribed by the commissioner, a report showing all gambling activity conducted by that organization for each month. Gambling activity includes all gross receipts, prizes, all gambling taxes owed or paid to the commissioner, all gambling expenses, and all lawful purpose and board-approved expenditures. The report must be filed with the commissioner on or before the 20th day of the month following the month in which the gambling activity takes place. The commissioner shall prescribe the content, format, and manner of returns or other documents pursuant to section 270C.30.\nThe gambling manager and the chief executive officer of the organization, or their respective designees, and the person who completed the tax return must sign the tax return. The organization shall inform the commissioner of revenue in writing of the identity of the designees as soon as practicable in the form and manner prescribed by the commissioner.\nAn organization shall maintain records supporting the gambling activity reported to the commissioner. Records include, but are not limited to, the following items:\n(1) all winning and unsold tickets, cards, or stubs for pull-tab, tipboard, paddlewheel, and raffle games;\n(2) all reports and statements, including checker's records, for each bingo occasion;\n(3) all cash journals and ledgers, deposit slips, register tapes, and bank statements supporting gambling activity receipts;\n(4) all invoices that represent purchases of gambling product;\n(5) all canceled checks or copies of substitute checks as defined in Public Law 108-100, section 3, check recorders, journals and ledgers, vouchers, invoices, bank statements, and other documents supporting gambling activity expenditures; and\n(6) all organizational meeting minutes.\nAll records required to be kept by this section must be preserved by the organization for at least 3-1/2 years and may be inspected by the commissioner of revenue at any reasonable time without notice or a search warrant.\nAll gambling activity transactions must be segregated from all other revenues and expenditures made by the conducting organization.\n(a) An organization licensed under chapter 349 with gross receipts from lawful gambling of more than $750,000 in any year must have an annual financial audit of its lawful gambling activities and funds for that year. For the purposes of this subdivision, \"gross receipts\" does not include a licensed organization's receipts from electronic pull-tabs regulated under chapter 349 provided the electronic pull-tab manufacturer has completed an annual system and organization controls audit, containing standards that must incorporate and be consistent with standards prescribed by the American Institute of Certified Public Accountants.\n(b) The commissioner may require a financial audit of the lawful gambling activities and funds of an organization licensed under chapter 349, with gross receipts less than $750,000 annually, when an organization has:\n(1) failed to timely file required gambling tax returns;\n(2) failed to timely pay the gambling tax or regulatory fee;\n(3) filed fraudulent gambling tax returns;\n(4) failed to take corrective actions required by the commissioner; or\n(5) failed to otherwise comply with this chapter.\n(c) Audits under this subdivision must be performed by an independent accountant firm licensed in accordance with chapter 326A.\n(d) An organization licensed under chapter 349 must perform an annual certified inventory and cash count at the end of its fiscal year and submit the report to the commissioner within 30 days after the end of its fiscal year. The report shall be on a form prescribed by the commissioner.\n(e) The commissioner of revenue shall prescribe standards for the audits, certified inventory, and cash count reports required under this subdivision. The standards may vary based on the gross receipts of the organization. The standards must incorporate and be consistent with standards prescribed by the American Institute of Certified Public Accountants. A complete, true, and correct copy of the audits, certified inventory, and cash count report must be filed as prescribed by the commissioner.",
	"repealed": false
}