{
	"id": "340A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.24",
	"title": "340A.24 BREW PUBS.",
	"text": "A brew pub may be issued an on-sale intoxicating liquor or 3.2 percent malt liquor license by a municipality for a restaurant operated in the place of manufacture.\nNotwithstanding section 340A.405, a brew pub that holds an on-sale license issued pursuant to this section may, with the approval of the commissioner, be issued a license by a municipality for off-sale of malt liquor produced and packaged on the licensed premises. Off-sale of malt liquor shall be limited to the legal hours for off-sale at exclusive liquor stores in the jurisdiction in which the brew pub is located, and the malt liquor sold off-sale must be removed from the premises before the applicable off-sale closing time at exclusive liquor stores, except that malt liquor in growlers only may be sold at off-sale on Sundays. Sunday sales must be approved by the licensing jurisdiction and hours may be established by those jurisdictions. Packaging of malt liquor for off-sale under this subdivision must comply with section 340A.285.\nA brew pub's total retail sales at on- or off-sale under this section may not exceed 3,500 barrels per year, provided that off-sales may not total more than 750 barrels.\n(a) A brew pub may hold or have an interest in other retail on-sale licenses, but may not have an ownership interest in whole or in part, or be an officer, director, agent, or employee of, any other manufacturer, brewer, importer, or wholesaler, or be an affiliate thereof whether the affiliation is corporate or by management, direction, or control.\n(b) Notwithstanding this prohibition, a brew pub may be an affiliate or subsidiary company of a brewer licensed in Minnesota or elsewhere if that brewer's only manufacture of malt liquor is:\n(1) manufacture licensed under section 340A.301, subdivision 6, clause (d);\n(2) manufacture in another state for consumption exclusively in a restaurant located in the place of manufacture; or\n(3) manufacture in another state for consumption primarily in a restaurant located in or immediately adjacent to the place of manufacture if the brewer was licensed under section 340A.301, subdivision 6, clause (d), on January 1, 1995.\nA brew pub licensed under this chapter may not be licensed as an importer under section 340A.302.",
	"repealed": false
}