{
	"id": "116J.871",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.871",
	"title": "116J.871 FINANCIAL ASSISTANCE LIMITATIONS; PREVAILING WAGE.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Economic development\" means financial assistance provided to a person directly or to a local unit of government or nonprofit organization on behalf of a person who is engaged in the manufacture or sale of goods and services. Economic development does not include (1) financial assistance for rehabilitation of existing housing; (2) financial assistance for new housing construction in which total financial assistance at a single project site is less than $100,000; or (3) financial assistance for the new construction of fully detached single-family affordable homeownership units for which the financial assistance covers no more than ten fully detached single-family affordable homeownership units. For purposes of this paragraph, \"affordable homeownership\" means housing targeted at households with incomes, at initial occupancy, at or below 115 percent of the state or area median income, whichever is greater, as determined by the United States Department of Housing and Urban Development.\n(c) \"Financial assistance\" means (1) a grant awarded by a state agency or allocating agency for economic development related purposes if a single business receives $200,000 or more of the grant proceeds; (2) a loan or the guaranty or purchase of a loan made by a state agency or allocating agency for economic development related purposes if a single business receives $500,000 or more of the loan proceeds; or (3) a reduction, credit, or abatement of a tax assessed under chapter 297A where the tax reduction, credit, or abatement applies to a geographic area smaller than the entire state and was granted for economic development related purposes; or (4) allocations or awards of low-income housing credits by all allocating agencies as provided in section 462A.222, for which tax credits are used for multifamily housing projects consisting of more than ten units. Financial assistance does not include payments by the state of aids and credits under chapter 273 or 477A to a political subdivision.\n(d) \"Project site\" means the location where improvements are made that are financed in whole or in part by the financial assistance; or the location of employees that receive financial assistance in the form of employment and training services as defined in section 116L.19, subdivision 4, or customized training from a technical college.\n(e) \"State agency\" means any agency defined under section 16B.01, subdivision 2, Enterprise Minnesota, Inc., and the Department of Iron Range Resources and Rehabilitation.\n(f) \"Allocating agency\" has the meaning given in section 462A.221, subdivision 1a.\n(a) A state agency or allocating agency may provide financial assistance to a person only if the person receiving or benefiting from the financial assistance certifies to the commissioner of labor and industry that laborers and mechanics at the project site during construction, installation, remodeling, and repairs for which the financial assistance was provided will be paid the prevailing wage rate as defined in section 177.42, subdivision 6. The person receiving or benefiting from the financial assistance is also subject to the requirements and enforcement provisions of sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\n(b) For purposes of complying with section 177.30, paragraph (a), clauses (6) and (7), the state agency or allocating agency awarding the financial assistance is considered the contracting authority and the project is considered a public works project. The person receiving or benefiting from the financial assistance shall notify all employers on the project of the record keeping and reporting requirements in section 177.30, paragraph (a), clauses (6) and (7). Each employer shall submit the required information to the contracting authority.\nIt is a misdemeanor for a person who has certified that prevailing wages will be paid to laborers and mechanics under subdivision 2 to subsequently fail to pay the prevailing wage. Each day a violation of this subdivision continues is a separate offense.\nA state agency or allocating agency shall notify any person applying for financial assistance from the state agency or allocating agency of the requirements under subdivision 2 and of the penalties under subdivision 3.\nNothing in this section denies any financial assistance granted to or qualified for by a person whose construction, installation, remodeling, or repairs commenced prior to August 1, 1990.",
	"repealed": false
}