{
	"id": "144.652",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.652",
	"title": "144.652 BILL OF RIGHTS NOTICE TO PATIENT OR RESIDENT; VIOLATION.",
	"text": "Except as provided below, section 144.651 shall be posted conspicuously in a public place in all facilities licensed under the provisions of sections 144.50 to 144.58, or 144A.02. Copies of the law shall be furnished the patient or resident and the patient or resident's guardian or conservator upon admittance to the facility. Facilities providing services to patients may delete section 144.651, subdivisions 24 to 29, and those portions of other subdivisions that apply only to residents, from copies posted or distributed to patients with appropriate notation that residents have additional rights under law. The policy statement shall include the address and telephone number of the Board of Medical Practice and/or the name and phone number of the person within the facility to whom inquiries about the medical care received may be directed. The notice shall include a brief statement describing how to file a complaint with the Office of Health Facility Complaints established pursuant to section 144A.52 concerning a violation of section 144.651 or any other state statute or rule. This notice shall include the address and phone number of the Office of Health Facility Complaints.\nA substantial violation of the rights of any patient or resident as defined in section 144.651, shall be grounds for issuance of a correction order pursuant to section 144.653 or 144A.10. The issuance or nonissuance of a correction order shall not preclude, diminish, enlarge, or otherwise alter private action by or on behalf of a patient or resident to enforce any unreasonable violation of the patient's or resident's rights. Compliance with the provisions of section 144.651 shall not be required whenever emergency conditions, as documented by the attending physician, advanced practice registered nurse, or physician assistant in a patient's medical record or a resident's care record, indicate immediate medical treatment, including but not limited to surgical procedures, is necessary and it is impossible or impractical to comply with the provisions of section 144.651 because delay would endanger the patient's or resident's life, health, or safety.",
	"repealed": false
}