{
	"id": "308C.835",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.835",
	"title": "308C.835 ABANDONMENT.",
	"text": "After a plan of merger has been approved by the members entitled to vote on the approval of the plan and before the effective date of the plan, the plan may be abandoned by the same vote that approved the plan.\n(a) A merger may be abandoned:\n(1) if the members of each of the constituent domestic cooperatives entitled to vote on the approval of the plan have approved the abandonment at a meeting by the affirmative vote of the holders of a majority of the voting power of the membership interests entitled to vote; if the merger is with a domestic cooperative and a Minnesota limited liability company or foreign business entity, if abandonment is approved in such manner as may be required by section 322C.1003 for the involvement of a Minnesota limited liability company, or for a foreign business entity by the laws of the state under which the foreign business entity is organized; and the members of a constituent domestic cooperative are not entitled to vote on the approval of the plan, the board of the constituent domestic cooperative has approved the abandonment by the affirmative vote of a majority of the directors present;\n(2) if the plan itself provides for abandonment and all conditions for abandonment set forth in the plan are met; or\n(3) under paragraph (b).\n(b) A plan of merger may be abandoned before the effective date of the plan by a resolution of the board of any constituent domestic cooperative abandoning the plan of merger approved by the affirmative vote of a majority of the directors present, subject to the contract rights of any other person under the plan. If a plan of merger is with a domestic or foreign business entity, the plan of merger may be abandoned before the effective date of the plan by a resolution of the foreign business entity adopted according to the laws of the state under which the foreign business entity is organized, subject to the contract rights of any other person under the plan. If the plan of merger is with a Minnesota limited liability company, the plan of merger may be abandoned by the Minnesota limited liability company as provided in section 322C.1003, subject to the contractual rights of any other person under the plan.\n(c) If articles of merger have been filed with the secretary of state, but have not yet become effective, the constituent organizations, in the case of abandonment under paragraph (a), clause (1), the constituent organizations or any one of them, in the case of abandonment under paragraph (a), clause (2), or the abandoning organization in the case of abandonment under paragraph (b), shall file with the secretary of state articles of abandonment that contain:\n(1) the names of the constituent organizations;\n(2) the provisions of this section under which the plan is abandoned; and\n(3) if the plan is abandoned under paragraph (b), the text of the resolution abandoning the plan.",
	"repealed": false
}