{
	"id": "626A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.05",
	"title": "626A.05 AUTHORIZATION FOR INTERCEPTION OF WIRE, ELECTRONIC, OR ORAL COMMUNICATIONS.",
	"text": "The attorney general or a county attorney of any county may make application as provided in section 626A.06, to a judge of the district court, of the court of appeals, or of the supreme court for a warrant authorizing or approving the interception of wire, electronic, or oral communications by investigative or law enforcement officers having responsibility for the investigation of the offense as to which the application is made. No court commissioner shall issue a warrant under this chapter.\nA warrant authorizing interception of wire, electronic, or oral communications by investigative or law enforcement officers may only be issued when the interception may provide evidence of the commission of, or of an attempt or conspiracy to commit, any of the following offenses:\n(1) a felony offense involving murder, manslaughter, assault in the first, second, and third degrees, aggravated robbery, carjacking in the first or second degree, kidnapping, criminal sexual conduct in the first, second, and third degrees, prostitution, bribery, perjury, escape from custody, theft, receiving stolen property, embezzlement, burglary in the first, second, and third degrees, forgery, aggravated forgery, check forgery, or financial transaction card fraud, as punishable under sections 609.185, 609.19, 609.195, 609.20, 609.221, 609.222, 609.223, 609.2231, 609.245, 609.247, subdivision 2 or 3, 609.25, 609.321 to 609.324, 609.342, 609.343, 609.344, 609.42, 609.48, 609.485, subdivision 4, paragraph (a), clause (1), 609.52, 609.53, 609.54, 609.582, 609.625, 609.63, 609.631, 609.821, and 609.825;\n(2) an offense relating to gambling or controlled substances, as punishable under section 609.76 or chapter 152; or\n(3) an offense relating to restraint of trade defined in section 325D.53, subdivision 1 or 2, as punishable under section 325D.56, subdivision 2.",
	"repealed": false
}