{
	"id": "204B.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.175",
	"title": "204B.175 CHANGE OF POLLING PLACE IN AN EMERGENCY.",
	"text": "When an emergency occurs after the deadline to designate a polling place for the purpose of absentee or early voting pursuant to section 203B.081, or after the deadline to designate a polling place pursuant to section 204B.16 but before the polls close on election day, a new polling place may be designated pursuant to this section. For purposes of this section, an emergency is any situation that prevents the safe, secure, and full operation of a polling place, or when required to remedy a potential violation of section 200.54.\nIf a local election official determines that an emergency has occurred or is imminent, the local election official must procure a polling place that is as near the designated polling place as possible and that complies with the requirements of section 204B.16, subdivisions 4 and 5. If it is not possible to locate a new polling place in the precinct, the polling place may be located outside of the precinct without regard to the distance limitations in section 204B.16, subdivision 1. If a polling place location is changed to remedy a potential violation of section 200.54, the location of the polling place must be selected to remedy the violation. The local election official must certify to the appropriate governing body the expenses incurred because of the change. These expenses shall be paid as part of the expenses of the election.\nA local election official may designate additional polling places, notwithstanding the deadlines in section 203B.081, if additional designations are required to remedy a potential violation of section 200.54. The local election official must certify to the appropriate governing body the expenses incurred because of the change. These expenses shall be paid as part of the expenses of the election.\n(a) Upon making the determination to relocate a polling place, the local election official must immediately notify the county auditor and the secretary of state. The notice must include the reason for the relocation and the reason for the location of the new polling place. As soon as possible, the local election official must also post a notice stating the reason for the relocation and the location of the new polling place. The notice must also be posted on the website of the public body, if there is one. The local election official must also notify the election judges and request that local media outlets publicly announce the reason for the relocation and the location of the polling place. If the relocation occurs more than 14 days prior to the election, the local election official must mail a notice to the impacted voters of the reason for the relocation and the location of the polling place.\n(b) On election day, the local election official must post a notice in large print in a conspicuous place at the polling place where the emergency occurred, if practical, stating the location of the new polling place. The local election official must also post the notice, if practical, in a location visible by voters who vote from their motor vehicles as provided in section 204C.15, subdivision 2. If polling place hours are extended pursuant to section 204C.05, subdivision 2, paragraph (b), the posted notices required by this paragraph must include a statement that the polling place hours at the new polling place will be extended until the specified time.",
	"repealed": false
}