{
	"id": "430.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.01",
	"title": "430.01 DESIGNATION OF LAND FOR VARIOUS USES.",
	"text": "The council and the board of park commissioners of a city of the first class may designate land to be acquired for a system of streets, parks, and parkways. They may take this action only by concurrent resolution adopted by a majority vote of each body. The land must be acquired under this chapter, in proceedings conducted either by the city council or the board of park commissioners, as stated in the resolution.\nThe council of a city may by resolution designate land to be acquired, improved, and operated for motor vehicle parking lots. By resolution, the council may designate lands to be acquired, improved, and operated for pedestrian malls. By ordinance adopted under section 430.011, the council may designate any property within a city right-of-way to be improved primarily for pedestrian uses.\nIf the board of park commissioners acts, the duties to be performed under this chapter by the city clerk, the city engineer, and the city attorney, respectively, must be performed by the secretary, the engineer, and the attorney elected and employed by the board of park commissioners, and the powers to be exercised under this chapter by the city council may be exercised by the board of park commissioners.\nAs used in this chapter, the term \"system of streets, parks, and parkways\" means a body of contiguous land designed to be used in part for streets and in part for parks or parkways. The concurrent resolution must designate which part is for streets, which part is for parks, and which part is for parkways.\nIf the city council wants to take, improve, or take and improve land for street purposes, to take land for motor vehicle parking lots, to take land for pedestrian malls, or to improve streets for pedestrian uses, it may act under this chapter for that purpose without the concurrence of the board of park commissioners. If the board of park commissioners wants to take, improve, or take and improve land for parks or parkways, it may act under this chapter without the concurrence of the city council.",
	"repealed": false
}