{
	"id": "308C.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.511",
	"title": "308C.511 REGULAR MEMBER MEETINGS.",
	"text": "Regular member meetings shall be held annually at a time determined by the board, unless more frequent meetings are provided for in the bylaws.\nThe regular member meeting shall be held at the principal place of business of the cooperative or at another conveniently located place as determined by the bylaws or the board.\nUnless additional information is required by the bylaws, the officers shall submit reports to the members at the regular member meetings covering the business of the cooperative for the previous fiscal year that show the financial condition of the cooperative at the close of the fiscal year.\nAll directors shall be elected at the regular member meeting for the terms of office prescribed in the bylaws.\nThe cooperative shall give notice of regular member meetings by personal delivery of the meeting notice to each member or mailing the regular member meeting notice to each member at the member's post office address as it appears on the membership book of the cooperative, or by other notification approved by the board and agreed to by the members. The regular member meeting notice shall be published or otherwise given by approved method at least two weeks before the date of the meeting, or mailed at least 15 days, but not more than 30 days before the date of the meeting.\nA member may waive notice of a meeting of members. A waiver of notice by a member entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, or by attendance. Attendance by a member at a meeting is a waiver of notice of that meeting, except where the member objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened, or objects before a vote on an item of business because the item may not lawfully be considered at that meeting and does not participate in the consideration of the item at that meeting.",
	"repealed": false
}