{
	"id": "342.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.22",
	"title": "342.22 RETAILERS; LOCAL REGISTRATION AND ENFORCEMENT.",
	"text": "Before making retail sales to customers or patients, a cannabis microbusiness, cannabis mezzobusiness, cannabis retailer, medical cannabis combination business, or lower-potency hemp edible retailer must register with the city, town, or county in which the retail establishment is located. A county may issue a registration in cases where a city or town has provided consent for the county to issue the registration for the jurisdiction.\n(a) A local unit of government may impose an initial retail registration fee of $500 or up to half the amount of the applicable initial license fee under section 342.11, whichever is less. The local unit of government may also impose a renewal retail registration fee of $1,000 or up to half the amount of the applicable renewal license fee under section 342.11, whichever is less. The initial registration fee shall include the fee for initial registration and the first annual renewal. Any renewal fee imposed by the local unit of government shall be charged at the time of the second renewal and each subsequent annual renewal thereafter.\n(b) The local unit of government may not charge an application fee.\n(c) Registration fees are nonrefundable.\n(a) A local unit of government shall issue a retail registration to a cannabis microbusiness with a retail operations endorsement, cannabis mezzobusiness with a retail operations endorsement, cannabis retailer, medical cannabis combination business operating a retail location, or lower-potency hemp edible retailer that:\n(1) has a valid license or license preapproval issued by the office;\n(2) has paid the registration fee or renewal fee pursuant to subdivision 2;\n(3) is found to be in compliance with the requirements of this chapter at any preliminary compliance check that the local unit of government performs; and\n(4) if applicable, is current on all property taxes and assessments at the location where the retail establishment is located.\n(b) Before issuing a retail registration, the local unit of government may conduct a preliminary compliance check to ensure that the cannabis business or hemp business is in compliance with any applicable local ordinance established pursuant to section 342.13.\n(c) A local unit of government shall renew the retail registration of a cannabis business or hemp business when the office renews the license of the cannabis business or hemp business.\n(d) A retail registration issued under this section may not be transferred.\n(a) A local unit of government shall conduct compliance checks of every cannabis business and hemp business with a retail registration issued by the local unit of government. During a compliance check, a local unit of government shall assess a business's compliance with age verification requirements and compliance with any applicable local ordinance established pursuant to section 342.13.\n(b) A local unit of government must conduct unannounced age verification compliance checks of every cannabis business and hemp business at least once each calendar year. Age verification compliance checks must involve persons at least 17 years of age but under the age of 21 who, with the prior written consent of a parent or guardian if the person is under the age of 18, attempt to purchase adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products under the direct supervision of a law enforcement officer or an employee of the local unit of government.\n(a) If a local unit of government determines that a cannabis business or hemp business with a retail registration issued by the local unit of government is not operating in compliance with the requirements of a local ordinance authorized under section 342.13 or that the operation of the business poses an immediate threat to the health or safety of the public, the local unit of government may suspend the retail registration of the cannabis business or hemp business. The local unit of government must immediately notify the office of the suspension and shall include a description of the grounds for the suspension.\n(b) The office shall review the retail registration suspension and may order reinstatement of the retail registration or take any action described in section 342.19 or 342.21.\n(c) The retail registration suspension must be for up to 30 days unless the office suspends the license and operating privilege of the cannabis business or hemp business for a longer period or revokes the license.\n(d) The local unit of government may reinstate the retail registration if the local unit of government determines that any violation has been cured. The local unit of government must reinstate the retail registration if the office orders reinstatement.\n(e) No cannabis microbusiness, cannabis mezzobusiness, cannabis retailer, medical cannabis combination business, or lower-potency hemp edible retailer may make any sale to a customer or patient without a valid retail registration with a local unit of government and a valid license with any applicable endorsement from the office. A local unit of government may impose a civil penalty of up to $2,000 for each violation of this paragraph.",
	"repealed": false
}