{
	"id": "303.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/303.17",
	"title": "303.17 LICENSE REVOCATION.",
	"text": "The certificate of authority of a foreign corporation to transact business in this state shall be revoked by the secretary of state if it fails:\n(1) to pay any fee due under the provisions of this chapter;\n(2) to designate a registered agent when a vacancy occurs in that office, or when the appointed registered agent becomes disqualified or incapacitated;\n(3) to file certificates of merger or name change, as required in section 303.11;\n(4) to file an annual report; or\n(5) to comply with the provisions of Minnesota Statutes 1949, section 303.04, and acts amendatory thereof and supplementary thereto, insofar as it relates to the limits of territory in which a savings association organized under the laws of another state may carry on the business of making real estate mortgages.\nOn finding that a default has occurred under subdivision 1, clauses (1) to (3) or (5), the secretary of state shall attempt to provide notice to the corporation that the default exists and that its certificate of authority will be revoked unless the default shall be cured within 30 days after the mailing of the notice.\n(a) The secretary of state shall revoke the certificate of authority of a corporation that is in default under subdivision 1, clause (4), for failure to file an annual registration form under section 303.14.\n(b) The secretary of state shall revoke the certificate of authority of a corporation that is in default under subdivision 1, clauses (1) to (3) or (5), if the default is not cured within 30 days after attempting to provide notice under subdivision 2; provided that for good cause shown the secretary of state may extend the 30-day period from time to time, but in no event may the aggregate of all extensions granted exceed 180 days or the period of time of any applicable extension granted by the Department of Revenue for filing the income tax return of the corporation, whichever is greater.\n(a) Upon revoking the certificate of authority of a corporation because of a default under subdivision 1, clauses (1) to (3) or (5), the secretary of state shall:\n(1) issue a certificate of revocation; and\n(2) attempt to provide notice of the revocation to the corporation.\n(b) Upon revoking the certificate of authority of a corporation because of a default under subdivision 1, clause (4), the secretary of state shall issue a certificate of revocation, and the certificate must be filed in the Office of the Secretary of State. No further notice to the corporation is required.\n(c) The secretary of state shall also make the names of the revoked corporations available in an electronic format.\nUpon the issuance of such certificate of revocation, the authority of the corporation to transact business in this state shall cease.",
	"repealed": false
}