{
	"id": "13.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.41",
	"title": "13.41 LICENSING DATA.",
	"text": "As used in this section \"licensing agency\" means any board, department or agency of this state which is given the statutory authority to issue professional or other types of licenses, except the various agencies primarily administered by the commissioner of human services. Data pertaining to persons or agencies licensed or registered under authority of the commissioner of human services shall be administered pursuant to section 13.46.\n(a) The following data collected, created or maintained by any licensing agency are classified as private, pursuant to section 13.02, subdivision 12: data, other than their names and designated addresses, submitted by applicants for licenses; the identity of complainants who have made reports concerning licensees or applicants which appear in inactive complaint data unless the complainant consents to the disclosure; the nature or content of unsubstantiated complaints when the information is not maintained in anticipation of legal action; the identity of patients whose medical records are received by any health licensing agency for purposes of review or in anticipation of a contested matter; inactive investigative data relating to violations of statutes or rules; and the record of any disciplinary proceeding except as limited by subdivision 5.\n(b) An applicant for a license shall designate on the application a residence or business address and telephone number at which the applicant can be contacted in connection with the license application. A licensee shall designate a residence or business address and telephone number at which the licensee can be contacted in connection with the license. By designating an address under this paragraph other than a residence address, the applicant or licensee consents to accept personal service of process by service on the licensing agency for legal or administrative proceedings. The licensing agency shall mail a copy of the documents to the applicant or licensee at the last known residence address.\nThe following government data of the Board of Peace Officer Standards and Training are private data: personal telephone numbers and home and email addresses of licensees and applicants for licenses.\nThe board may disseminate private data on applicants and licensees as is necessary to administer law enforcement licensure or to provide data under section 626.845, subdivision 1, to law enforcement agencies who are conducting employment background investigations.\nThe following data collected, created or maintained by any licensing agency are classified as confidential, pursuant to section 13.02, subdivision 3: active investigative data relating to the investigation of complaints against any licensee.\nLicensing agency minutes, application data on licensees except nondesignated addresses, orders for hearing, findings of fact, conclusions of law and specification of the final disciplinary action contained in the record of the disciplinary action are classified as public, pursuant to section 13.02, subdivision 15. The entire record concerning the disciplinary proceeding is public data pursuant to section 13.02, subdivision 15, in those instances where there is a public hearing concerning the disciplinary action. If the licensee and the licensing agency agree to resolve a complaint without a hearing, the agreement and the specific reasons for the agreement are public data. The license numbers, the license status, and continuing education records issued or maintained by the Board of Peace Officer Standards and Training are classified as public data, pursuant to section 13.02, subdivision 15.\nAny licensing agency may make any data classified as private or confidential pursuant to this section accessible to an appropriate person or agency if the licensing agency determines that failure to make the data accessible is likely to create a clear and present danger to public health or safety.",
	"repealed": false
}