{
	"id": "548.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/548.181",
	"title": "548.181 DISCHARGE OF JUDGMENTS AGAINST BANKRUPTCY DEBTORS.",
	"text": "A judgment debtor who has received a discharge under United States Code, title 11, or an interested party, upon paying a filing fee of $5 for each judgment, may apply to the court administrator of any court for the discharge of all judgments entered in that court against the judgment debtor that were ordered discharged by the bankruptcy discharge.\nAn application under subdivision 1 must identify each judgment to be discharged, must be accompanied by a certified copy of the judgment debtor's bankruptcy discharge or a certificate by the clerk of the United States Bankruptcy Court of the discharge, must state the time the judgment creditor has to object as specified in subdivision 3 and the grounds for objection as specified in subdivision 4, must be served at the expense of the applicant on each judgment creditor either:\n(1) in the manner provided for the service of a summons in a civil action and must be accompanied by an affidavit of service; or\n(2) by certified mail to the judgment creditor's last known address as it appears in the court record, and must be accompanied by an affidavit of mailing.\nThe court administrator, without further notice or hearing, shall discharge each judgment except a judgment in favor of a judgment creditor who has filed an objection to discharge of the judgment within 20 days after service of the application on the judgment creditor. An objection to discharge of a judgment must be served on the judgment debtor in the same manner as an answer in a civil action.\nUpon receipt of a filing fee of $5, the court administrator shall certify to the judgment debtor or other interested party the judgments against a person that have been discharged by the administrator.\nIf a judgment creditor objects to the discharge of a judgment, on motion of the judgment debtor, the judgment creditor, or other interested party, the court shall order the judgment discharged except to the extent that: (1) the debt represented by the judgment was not discharged by the bankruptcy discharge; or (2) the judgment was an enforceable lien on real property when the bankruptcy discharge was entered. If the judgment was an enforceable lien on some, but not all, real property of the judgment debtor, the discharge shall only be entered as to real property not subject to an enforceable lien.",
	"repealed": false
}