{
	"id": "144.213",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.213",
	"title": "144.213 OFFICE OF VITAL RECORDS.",
	"text": "The commissioner shall establish an Office of Vital Records under the supervision of the state registrar. The commissioner shall promulgate rules for the collection, filing, and registering of vital records information by the state registrar, physicians, advanced practice registered nurses, physician assistants, morticians, and others. Except as otherwise provided in sections 144.211 to 144.227, rules previously promulgated by the commissioner relating to the collection, filing and registering of vital records shall remain in effect until repealed, modified or superseded by a rule promulgated by the commissioner.\n(a) The state registrar shall maintain a statewide system of vital records. The state registrar is responsible for the administration and enforcement of sections 144.211 to 144.227 and shall supervise the enforcement of sections 144.211 to 144.227 and the rules promulgated thereunder. Local issuance offices that fail to comply with the statutes or rules or to properly train employees may have their issuance privileges and access to the vital records system revoked.\n(b) To preserve vital records, the state registrar is authorized to prepare typewritten, photographic, electronic, or other reproductions of original records and files in the Office of Vital Records. The reproductions, when certified by the state registrar, shall be accepted as the original records.\n(c) The state registrar shall also:\n(1) establish, designate, and eliminate offices in the state to aid in the efficient issuance of vital records;\n(2) direct the activities of all persons engaged in activities pertaining to the operation of the system of vital records;\n(3) develop and conduct training programs to promote uniformity of policy and procedures throughout the state in matters pertaining to the system of vital records; and\n(4) prescribe, furnish, and distribute all forms required by sections 144.211 to 144.227 and any rules adopted under these sections, and prescribe other means for the transmission of data, including electronic submission, that will accomplish the purpose of complete, accurate, and timely reporting and registration.\n[Repealed by amendment, 2013 c 108 art 12 s 17]",
	"repealed": false
}