{
	"id": "124E.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.12",
	"title": "124E.12 EMPLOYMENT.",
	"text": "A charter school, excluding its preschool or prekindergarten program established under section 124E.06, subdivision 3, must employ or contract with necessary teachers, as defined by section 122A.06, subdivision 2, or contract with a cooperative formed under chapter 308A to provide necessary teachers, who hold valid licenses to perform the particular service for which they are employed in the school. A charter school may not contract with a CMO or EMO to provide necessary teachers. A charter school's preschool or prekindergarten program must employ or contract with teachers knowledgeable in early childhood curriculum content, assessment, native and English language programs, and instruction established under section 124E.06, subdivision 3. The commissioner may reduce the charter school's state aid under section 127A.43 if the school employs a teacher who is not appropriately licensed or approved by the Professional Educator Licensing and Standards Board. The school may employ necessary employees who are not required to hold teaching licenses to perform duties other than teaching and may contract for other services. The school may discharge teachers and nonlicensed employees. The charter school board is subject to section 181.932 governing whistle-blowers. When offering employment to a prospective employee, a charter school must give that employee a written description of the terms and conditions of employment and the school's personnel policies.\n(a) A charter school board of directors must establish qualifications for all persons who hold administrative, academic supervision, or instructional leadership positions. The qualifications must include a requirement that a person hold a minimum of a four-year degree from an accredited institution or equivalent experience. Other qualifications for these positions shall include, as appropriate for the specific position: instruction and assessment, curriculum design, human resource and personnel management, professional ethics, child development, financial management, legal and compliance management, special education oversight, contract management, effective communication, cultural competency, board and authorizer relationships, parent relationships, and community partnerships. A charter school board of directors must use those qualifications as the basis for the job description, hiring process, and performance evaluation of the charter school director or chief administrator. The charter school director or chief administrator must use those qualifications as the basis for the job descriptions, hiring, and performance reviews for the administrative staff, academic program supervisors, and instructional leaders who report to the charter school director or chief administrator.\n(b) A person who does not hold a valid administrator's license may perform administrative, academic supervision, or instructional leadership duties. A person without a valid administrator's license serving as a charter school director or chief administrator must complete a minimum of 25 hours annually of competency-based training corresponding to the individual's annual professional development needs and plan approved by the charter school board of directors. Training includes but is not limited to: instruction and curriculum; state standards; teacher and staff hiring, development, support, and evaluation; social-emotional learning; data collection and usage; assessment methodologies; use of technology for learning and management; charter school law and requirements; code of professional ethics; financial management and state accounting requirements; grant management; legal and compliance management; special education management; health and safety laws; restorative justice; cultural competencies; effective communication; parent relationships; board and management relationships; community partnerships; charter contract and authorizer relationships; and public accountability.\n(c) A person serving as a charter school director or chief administrator with a valid administrator's license must complete a minimum of ten hours of competency-based training during the first year of employment on the following: charter school law and requirements, board and management relationships, and charter contract and authorizer relationships.\n(d) The training a person must complete under paragraphs (b) and (c) may not be self-instructional. The organization or instructor providing the training must certify completion of the training. The person must submit the certification of completion of training to the charter school board of directors and certifications must be maintained in the personnel file. Completing required training must be a component of annual performance evaluations.\n(e) All professional development training completed by the charter school director or chief administrator in the previous academic year must be documented in the charter school's annual report.\n(f) No charter school administrator may serve as a paid administrator or consultant with another charter school without the knowledge and a two-thirds vote of approval of the boards of directors of the charter schools involved in such an arrangement. The boards of directors involved in such arrangements must send notice of this arrangement to authorizers upon approval by the boards.\n(g) No charter school administrator may serve on the board of directors of another charter school, except that an individual serving as an administrator serving more than one school under paragraph (f) may serve on each board as an ex-officio member.\nEmployees of the board of directors of a charter school may, if otherwise eligible, organize under chapter 179A and comply with its provisions. The board of directors of a charter school is a public employer, for the purposes of chapter 179A, when forming one or more bargaining units at the school. Bargaining units at the school must be separate from any other units within an authorizing district, except that bargaining units may remain part of the appropriate unit within an authorizing district if the employees of the school, the board of directors of the school, the exclusive representative of the appropriate unit in the authorizing district, and the board of the authorizing district agree to include the employees in the appropriate unit of the authorizing district. The board of directors of a charter school with employees organized under this subdivision must comply with sections 471.6161 governing group insurance and 471.895 governing gifts.\n(a) Teachers in a charter school must be public school teachers for the purposes of chapters 354 and 354A governing the Teacher Retirement Act.\n(b) Except for teachers under paragraph (a), employees in a charter school must be public employees for the purposes of chapter 353 governing the Public Employees Retirement Act.\n(a) A charter school board with at least 25 employees or a teacher cooperative of licensed teachers providing instruction under a contract between a school and a cooperative that provides group health insurance coverage shall:\n(1) request proposals for group health insurance coverage from a minimum of three sources at least every two years; and\n(2) notify employees covered by the group health insurance coverage before the effective date of the changes in the group coverage policy contract.\n(b) A charter school board or a cooperative of teachers that provides group health insurance coverage must establish and publish on its website the policy for purchasing group health insurance coverage. A charter school board policy must include a sealed proposal process, which requires all proposals to be opened at the same time. Upon opening the proposals according to the school or cooperative policy, the proposals become public data under chapter 13.\nNothing in this subdivision supersedes the right of an exclusive representative to negotiate the terms and conditions of employment.\nIf a teacher employed by a district makes a written request for an extended leave of absence to teach at a charter school, the district must grant the leave. The district must grant a leave not to exceed a total of five years. Any request to extend the leave shall be granted only at the discretion of the school board. The district may require a teacher to make the request for a leave or extension of leave before February 1 in the school year preceding the school year in which the teacher intends to leave, or February 1 of the calendar year in which the teacher's leave is scheduled to terminate. Except as otherwise provided in this subdivision and section 122A.46, subdivision 7, governing employment in another district, the leave is governed by section 122A.46, including, but not limited to, reinstatement, notice of intention to return, seniority, salary, and insurance.\nDuring a leave, the teacher may continue to aggregate benefits and credits in the Teachers' Retirement Association account under chapters 354 and 354A, consistent with subdivision 4.",
	"repealed": false
}