{
	"id": "260.821",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.821",
	"title": "260.821 GRANT FORMULA.",
	"text": "(a) The amount available for grants established under section 260.785, subdivision 1, to tribes, Indian organizations, and tribal social services agency programs located off-reservation is four-fifths of the total annual appropriation for Indian child welfare grants.\n(b) The commissioner shall award tribes at least 70 percent of the amount set in paragraph (a) for primary support grants. Each tribe shall be awarded a base amount of five percent of the total amount set in this paragraph. In addition, each tribe shall be allocated a proportion of the balance of the amount set in this paragraph, less the total base amounts for all reservations. This proportion must equal the ratio of the tribe's on-reservation population to the state's total on-reservation population. Population data must be based on the most recent federal census data according to the state demographer's office.\n(c) The commissioner shall award Indian organizations and tribal social services agency programs located off-reservation that serve Indian children and families up to 30 percent of the amount set in paragraph (a) for primary support grants. A maximum of four multiservice Indian organizations and tribal social services agency programs located off-reservation may be awarded grants under this paragraph. \"Multiservice Indian organizations\" means Indian organizations recognized by the Indian community as providing a broad continuum of social, educational, or cultural services, including Indian child welfare services designed to meet the unique needs of the Indian communities in Minneapolis, St. Paul, and Duluth. Grants may be awarded to programs that submit acceptable proposals, comply with the goals and the application process of the program, and have budgets that reflect appropriate and efficient use of funds. To maintain continuity of service in Indian communities, primary support grants awarded under this paragraph which meet the grant criteria and have demonstrated satisfactory performance as established by the commissioner may be awarded on a noncompetitive basis. The commissioner may revoke or deny funding for Indian organizations or tribal social services agencies failing to meet the grant criteria established by the commissioner, and the commissioner may request new proposals from Indian organizations or tribal social services agencies to the extent that funding is available.\nThe amount available for grants established under section 260.785, subdivision 2, for child-placing agencies, Tribes, Indian organizations, and other social services organizations is one-fifth of the total annual appropriation for Indian child welfare grants. The maximum award under this subdivision is $100,000 a year for programs approved by the commissioner.",
	"repealed": false
}