{
	"id": "260B.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.125",
	"title": "260B.125 CERTIFICATION.",
	"text": "When a child is alleged to have committed, after becoming 14 years of age, an offense that would be a felony if committed by an adult, the juvenile court may enter an order certifying the proceeding for action under the laws and court procedures controlling adult criminal violations.\nExcept as provided in subdivision 5 or 6, the juvenile court may order a certification only if:\n(1) a petition has been filed in accordance with the provisions of section 260B.141;\n(2) a motion for certification has been filed by the prosecuting authority;\n(3) notice has been given in accordance with the provisions of sections 260B.151 and 260B.152;\n(4) a hearing has been held in accordance with the provisions of section 260B.163 within 30 days of the filing of the certification motion, unless good cause is shown by the prosecution or the child as to why the hearing should not be held within this period in which case the hearing shall be held within 90 days of the filing of the motion;\n(5) the court finds that there is probable cause, as defined by the Rules of Criminal Procedure promulgated pursuant to section 480.059, to believe the child committed the offense alleged by delinquency petition; and\n(6) the court finds either:\n(i) that the presumption of certification created by subdivision 3 applies and the child has not rebutted the presumption by clear and convincing evidence demonstrating that retaining the proceeding in the juvenile court serves public safety; or\n(ii) that the presumption of certification does not apply and the prosecuting authority has demonstrated by clear and convincing evidence that retaining the proceeding in the juvenile court does not serve public safety. If the court finds that the prosecutor has not demonstrated by clear and convincing evidence that retaining the proceeding in juvenile court does not serve public safety, the court shall retain the proceeding in juvenile court.\nIt is presumed that a proceeding involving an offense committed by a child will be certified if:\n(1) the child was 16 or 17 years old at the time of the offense; and\n(2) the delinquency petition alleges that the child committed an offense that would result in a presumptive commitment to prison under the Sentencing Guidelines and applicable statutes, or that the child committed any felony offense while using, whether by brandishing, displaying, threatening with, or otherwise employing, a firearm.\nIf the court determines that probable cause exists to believe the child committed the alleged offense, the burden is on the child to rebut this presumption by demonstrating by clear and convincing evidence that retaining the proceeding in the juvenile court serves public safety. If the court finds that the child has not rebutted the presumption by clear and convincing evidence, the court shall certify the proceeding.\nIn determining whether the public safety is served by certifying the matter, the court shall consider the following factors:\n(1) the seriousness of the alleged offense in terms of community protection, including the existence of any aggravating factors recognized by the Sentencing Guidelines, the use of a firearm, and the impact on any victim;\n(2) the culpability of the child in committing the alleged offense, including the level of the child's participation in planning and carrying out the offense and the existence of any mitigating factors recognized by the Sentencing Guidelines;\n(3) the child's prior record of delinquency;\n(4) the child's programming history, including the child's past willingness to participate meaningfully in available programming;\n(5) the adequacy of the punishment or programming available in the juvenile justice system; and\n(6) the dispositional options available for the child.\nIn considering these factors, the court shall give greater weight to the seriousness of the alleged offense and the child's prior record of delinquency than to the other factors listed in this subdivision.\nNotwithstanding the provisions of subdivisions 2, 3, and 4, the court shall order a certification in any felony case if the prosecutor shows that the child has been previously prosecuted on a felony charge by an order of certification issued pursuant to either a hearing held under subdivision 2 or pursuant to the waiver of the right to such a hearing, other than a prior certification in the same case.\nThis subdivision only applies if the child is convicted of the offense or offenses for which the child was prosecuted pursuant to the order of certification or of a lesser-included offense which is a felony.\nThis subdivision does not apply to juvenile offenders who are subject to criminal court jurisdiction under section 609.055.\nThe juvenile court has jurisdiction to hold a certification hearing on motion of the prosecuting authority to certify the matter if:\n(1) an adult is alleged to have committed an offense before the adult's 18th birthday; and\n(2) a petition is filed under section 260B.141 before expiration of the time for filing under section 628.26.\nThe court may not certify the matter under this subdivision if the adult demonstrates that the delay was purposefully caused by the state in order to gain an unfair advantage.\nWhen the juvenile court enters an order certifying an alleged violation, the prosecuting authority shall proceed with the case as if the jurisdiction of the juvenile court had never attached.\n(a) The court shall decide whether to order certification within 15 days after the certification hearing was completed, unless additional time is needed, in which case the court may extend the period up to another 15 days. If the juvenile court orders certification, and the presumption described in subdivision 3 does not apply, the order shall contain in writing, findings of fact and conclusions of law as to why public safety is not served by retaining the proceeding in the juvenile court. A child certified under this paragraph may be detained pending the outcome of criminal proceedings in a secure juvenile detention facility.\n(b) If the juvenile court, after a hearing conducted pursuant to subdivision 2, decides not to order certification, the decision shall contain, in writing, findings of fact and conclusions of law as to why certification is not ordered. If the juvenile court decides not to order certification in a case in which the presumption described in subdivision 3 applies, the court shall designate the proceeding an extended jurisdiction juvenile prosecution and include in its decision written findings of fact and conclusions of law as to why the retention of the proceeding in juvenile court serves public safety, with specific reference to the factors listed in subdivision 4. If the court decides not to order certification in a case in which the presumption described in subdivision 3 does not apply, the court may designate the proceeding an extended jurisdiction juvenile prosecution, pursuant to the hearing process described in section 260B.130, subdivision 2.\nWhen a motion for certification has been filed in a case in which the petition alleges that the child committed murder in the first degree, the prosecuting authority shall present the case to the grand jury for consideration of indictment under chapter 628 within 14 days after the petition was filed.\nThis section does not apply to a child excluded from the definition of delinquent child under section 260B.007, subdivision 6, paragraph (b).",
	"repealed": false
}