{
	"id": "321.0810",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0810",
	"title": "321.0810 REINSTATEMENT FOLLOWING ADMINISTRATIVE DISSOLUTION OR REVOCATION.",
	"text": "(a) A limited partnership that has been administratively dissolved or a foreign limited partnership that has had its certificate of authority revoked may reinstate after the effective date of dissolution.\n(1) To reinstate for failure to file the annual renewal, the annual renewal required by section 5.34 must be delivered to the secretary of state for filing with the reinstatement fee of $25.\n(2) To reinstate for failure to appoint a registered agent after a prior registered agent has resigned pursuant to section 321.0116, subdivision 1, when the limited partnership has filed all previously required annual renewals, the limited partnership may appoint a new agent meeting the requirements of section 5.36 by filing with the secretary of state an appointment signed by one or more of the general partners at the time of the administrative dissolution.\n(3) To reinstate for both a failure to file the annual renewal and appoint a new registered agent following the resignation of the registered agent, the limited partnership must comply with clauses (1) and (2).\n(b) If the secretary of state determines that an annual renewal contains the information required by subsection (a) and that the information is correct and is accompanied by the appropriate fee, the secretary of state shall file the renewal and reinstate the limited partnership or foreign limited partnership.\n(c) When reinstatement becomes effective, it relates back to and takes effect as of the effective date of the administrative dissolution or revocation and the limited partnership may resume its activities as if the administrative dissolution or revocation had never occurred, except that for the purposes of section 321.0103(c) and (d) the reinstatement is effective only as of the date the reinstatement is filed.",
	"repealed": false
}