{
	"id": "117.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.036",
	"title": "117.036 APPRAISAL AND NEGOTIATION REQUIREMENTS.",
	"text": "This section applies to the acquisition of property under this chapter.\nFor the purposes of this section, \"owner\" means fee owner, contract purchaser, or business lessee who is entitled to condemnation compensation under a lease.\n(a) Before commencing an eminent domain proceeding under this chapter for an acquisition greater than $25,000, the acquiring authority must obtain at least one appraisal for the property proposed to be acquired. In making the appraisal, the appraiser must confer with one or more of the owners of the property, if reasonably possible. For acquisitions less than $25,000, the acquiring authority may obtain a minimum damage acquisition report in lieu of an appraisal. In making the minimum damage acquisition report, the qualified person with appraisal knowledge must confer with one or more of the owners of the property, if reasonably possible. Notwithstanding section 13.44, the acquiring authority must provide the owner with a copy of (1) each appraisal for property acquisitions over $25,000, or (2) the minimum damage acquisition report for properties under $25,000, the acquiring authority has obtained for the property at the time an offer is made, but no later than 60 days before presenting a petition under section 117.055. The acquiring authority must also inform the owner of the right to obtain an appraisal under this section. Upon request, the acquiring authority must make available to the owner all appraisals for properties over $25,000, or the minimum damage acquisition report for properties under $25,000. If the acquiring authority is considering both a full and partial taking of the property, the acquiring authority shall obtain and provide the owner with appraisals for properties over $25,000 for both types of takings, or minimum damage acquisition reports for properties under $25,000.\n(b) The owner may obtain an appraisal by a qualified appraiser of the property proposed to be acquired. The owner is entitled to reimbursement for the reasonable costs of the appraisal from the acquiring authority up to a maximum of $1,500 for single family and two-family residential property and minimum damage acquisitions and $5,000 for other types of property, provided that the owner submits to the acquiring authority the information necessary for reimbursement, including a copy of the owner's appraisal, at least five days before a condemnation commissioners' hearing. For purposes of this subdivision, a \"minimum damage acquisition\" means an interest in property that a qualified person having an understanding of the local real estate market indicates can be acquired for $25,000 or less.\n(c) The acquiring authority must pay the reimbursement to the owner within 30 days after receiving a copy of the appraisal and the reimbursement information. Upon agreement between the acquiring authority and the owner, the acquiring authority may pay the reimbursement directly to the appraiser.\nIn addition to the appraisal requirements under subdivision 2, before commencing an eminent domain proceeding, the acquiring authority must make a good faith attempt to negotiate personally with the owner of the property in order to acquire the property by direct purchase instead of the use of eminent domain proceedings. In making this negotiation, the acquiring authority must consider the appraisals in its possession, including any appraisal obtained and furnished by the owner if available, and other information that may be relevant to a determination of damages under this chapter. If the acquiring authority is considering both a full and partial taking of the property, the acquiring authority must make a good faith attempt to negotiate with respect to both types of takings.\nAn appraisal or minimum damage acquisition report must not be used or considered in a condemnation commissioners' hearing, nor may the appraiser who prepared the appraisal or the person who prepared the minimum damage acquisition report testify, unless a copy of the appraiser's written report or the minimum damage acquisition report is provided to the opposing party at least five days before the hearing.\nDocumentation related to a loss of going concern claim made under section 117.186 must not be used or considered in a condemnation commissioners' hearing unless the documentation is provided to the opposing party at least 14 days before the hearing.",
	"repealed": false
}