{
	"id": "16B.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.24",
	"title": "16B.24 GENERAL AUTHORITY.",
	"text": "The commissioner is authorized to maintain and operate the State Capitol building and grounds, subject to whatever standards and policies are set for its appearance and cleanliness by the Capitol Area Architectural and Planning Board and the commissioner under section 15B.15, subdivision 2, and all other buildings, cafeterias, and grounds in state-owned buildings in the Capitol Area under section 15B.02, the state Department of Public Safety, Bureau of Criminal Apprehension building in St. Paul, 603 Pine Street building in St. Paul, Fleet and Surplus Services building in Arden Hills, Ely Revenue building, any other properties acquired by the Department of Administration, and, when the commissioner considers it advisable and practicable, any other building or premises owned or rented by the state for the use of a state agency. The commissioner shall assign and reassign office space in the Capitol and state buildings to make an equitable division of available space among agencies. The commissioner shall regularly update the long-range strategic plan for locating agencies and shall follow the plan in assigning and reassigning space to agencies. The plan must include locational and urban design criteria, a cost-analysis method to be used in weighing state ownership against leasing of space in specific instances, and a transportation management plan. If the commissioner determines that a deviation from the plan is necessary or desirable in a specific instance, the commissioner shall provide the legislature with a timely written explanation of the reasons for the deviation. The power granted in this subdivision does not apply to state hospitals or to educational, penal, correctional, or other institutions not enumerated in this subdivision the control of which is vested by law in some other agency.\nThe commissioner shall supervise and control the making of necessary repairs to all state buildings and structures, except:\n(1) structures, other than buildings, under the control of the state Transportation Department; and\n(2) buildings and structures under the control of the Board of Trustees of the Minnesota State Colleges and Universities.\nAll repairs to the public and ceremonial areas and the exterior of the State Capitol building shall be carried out subject to the standards and policies of the Capitol Area Architectural and Planning Board and the commissioner of administration adopted pursuant to section 15B.15, subdivision 2.\n(a) Upon request from the head of an agency with control of a state-owned building with an estimated market value of less than $50,000, as determined by the commissioner, the commissioner may sell, demolish, or otherwise dispose of the building if the commissioner determines that the building is no longer used or is a fire or safety hazard.\n(b) Upon request of the head of an agency with control of a state-owned building with an estimated market value of $50,000 or more, as determined by the commissioner, the commissioner may sell, demolish, or otherwise dispose of the building after determining that the building is no longer used or is a fire or safety hazard and obtaining approval of the chairs of the senate Finance Committee and house of representatives Ways and Means Committee.\n(c) In the event a sale is made under this subdivision, the proceeds shall be deposited in the account provided by law. If there is no requirement in law specifying how proceeds must be deposited other than section 16A.72, the proceeds must be deposited in the account from which the appropriation to acquire or construct the building was made. If the account from which the appropriation was made cannot be identified or has been terminated, the proceeds shall be deposited in the general fund.\nBy February 1 of each year, the commissioner shall report to the chairs of the senate Committee on Finance and the house of representatives Committees on Ways and Means and Capital Investment all sales or other transfers of real property owned by the state that have taken place in the preceding calendar year. The report shall include a description of the property, reason for the sale, the name of the buyer, and the price for which the property was sold. Sales of easements need not be included. This subdivision does not apply to real property held by the Department of Natural Resources, the Department of Transportation, or the Board of Water and Soil Resources, except for real property that has been used for office space by any of those agencies. This subdivision does not apply to property owned by the Board of Trustees of the Minnesota State Colleges and Universities or the University of Minnesota.\nThe commissioner shall provide for the periodic inspection and appraisal of all state property, real and personal, and for current and perpetual inventories of all state property. The commissioner shall require agencies to make reports of the real and personal property in their custody at the intervals and in the form the commissioner considers necessary.\n(a) Authority. The commissioner may rent out state property, real or personal, that is not needed for public use, if the rental is not otherwise provided for or prohibited by law. The property may not be rented out for more than five years at a time without the approval of the State Executive Council and may never be rented out for more than 25 years. A rental agreement may provide that the state will reimburse a tenant for a portion of capital improvements that the tenant makes to state real property if the state does not permit the tenant to renew the lease at the end of the rental agreement.\n(b) Restrictions. Paragraph (a) does not apply to state trust fund lands, other state lands under the jurisdiction of the Department of Natural Resources, lands forfeited for delinquent taxes, or lands acquired under section 298.22.\n(c) Rental of living accommodations. The commissioner shall establish rental rates for all living accommodations provided by the state for its employees. Money collected as rent by state agencies pursuant to this paragraph must be deposited in the state treasury and credited to the general fund.\n(d) Lease of space in certain state buildings to state agencies. The commissioner may lease portions of the state-owned buildings under the custodial control of the commissioner to state agencies and the court administrator on behalf of the judicial branch of state government and charge rent on the basis of space occupied. Notwithstanding any law to the contrary, all money collected as rent pursuant to the terms of this section shall be deposited in the state treasury. Money collected as rent to recover the bond interest costs of a building funded from the state bond proceeds fund shall be credited to the general fund. Money collected as rent to recover the depreciation costs of a building funded from the state bond proceeds fund and money collected as rent to recover capital expenditures from capital asset preservation and replacement appropriations and statewide building access appropriations shall be credited to a segregated asset preservation and replacement account in a special revenue fund. Fifty percent of the money credited to the account each fiscal year must be transferred to the general fund. The remaining money in the account is appropriated to the commissioner to be expended for asset preservation projects as determined by the commissioner. Money collected as rent to recover the depreciation and interest costs of a building built with other state dedicated funds shall be credited to the dedicated fund which funded the original acquisition or construction. All other money received shall be credited to the general services revolving fund.\n(e) Lease of space in Andersen and Freeman buildings. The commissioner may lease space in the Elmer L. Andersen and Orville L. Freeman buildings to state agencies and charge rent on the basis of space occupied. Money collected as rent under this paragraph to fund future building repairs must be credited to a segregated account for each building in the special revenue fund and is appropriated to the commissioner to make the repairs. When the state acquires title to each building, the account for that building must be abolished and any balance remaining in the account must be transferred to the appropriate asset preservation and replacement account created under paragraph (d).\n(a) The commissioner must assign quarters in the Veterans Service Building to the Department of Veterans Affairs. Some of what is assigned, as mutually determined with the commissioner of veterans affairs, must be on the first floor.\n(b) The commissioner of administration must also assign space in the Veterans Service Building to:\n(1) the American Legion;\n(2) Veterans of Foreign Wars;\n(3) Disabled American Veterans;\n(4) Military Order of the Purple Heart;\n(5) Veterans of World War I;\n(6) auxiliaries of the groups in clauses (1) to (5), if incorporated in Minnesota; and\n(7) as space becomes available and as the commissioner of administration considers desirable, other state departments and agencies.\nAn entity in the executive, legislative, or judicial branch may use space under its control to offer fitness, wellness, or similar classes or activities to its employees, and may allow persons conducting these classes or activities to charge employees a fee to participate. Revenue received by a public entity under this section is appropriated to the entity. This authorization applies to all state space, including property in the Capitol Area, and other designated property as defined in rules adopted by the commissioner of public safety. Persons conducting these classes or activities, and participating employees, waive any and all claims of liability against the state for any damage or injury arising from the use of state space for employee fitness and wellness classes or similar classes or activities. Persons conducting these classes or activities agree to indemnify, save, and hold the state, its agents, and employees harmless from any claims or causes of action, including attorney fees incurred by the state that arise from these classes or activities.\n(a) Leases. The commissioner shall lease land and other premises when necessary for state purposes. Notwithstanding subdivision 6a, paragraph (a), the commissioner may lease land or premises for up to ten years, subject to cancellation upon 30 days' written notice by the state for any reason except lease of other non-state-owned land or premises for the same use. The commissioner may not lease non-state-owned land and buildings or substantial portions of land or buildings within the Capitol Area as defined in section 15B.02 unless the commissioner first consults with the Capitol Area Architectural and Planning Board. If the commissioner enters into a lease-purchase agreement for buildings or substantial portions of buildings within the Capitol Area, the commissioner shall require that any new construction of non-state-owned buildings conform to design guidelines of the Capitol Area Architectural and Planning Board. Lands needed by the Department of Transportation for storage of vehicles or road materials may be leased for five years or less, such leases for terms over two years being subject to cancellation upon 30 days' written notice by the state for any reason except lease of other non-state-owned land or premises for the same use. An agency or department head must consult with the chairs of the house of representatives appropriations and senate finance committees before entering into any agreement that would cause an agency's rental costs to increase by ten percent or more per square foot or would increase the number of square feet of office space rented by the agency by 25 percent or more in any fiscal year.\n(b) Use vacant public space. No agency may initiate or renew a lease for space for its own use in a private building unless the commissioner has thoroughly investigated presently vacant space in public buildings, such as closed school buildings, and found that none is available or use of the space is not feasible, prudent, and cost-effective compared with available alternatives.\n(c) Preference for certain buildings. For needs beyond those which can be accommodated in state-owned buildings, the commissioner shall acquire and utilize space in suitable buildings of historical, architectural, or cultural significance for the purposes of this subdivision unless use of that space is not feasible, prudent and cost-effective compared with available alternatives. Buildings are of historical, architectural, or cultural significance if they are listed on the National Register of Historic Places, designated by a state or county historical society, or designated by a municipal preservation commission.\n(d) Recycling space. Leases for space of 30 days or more for 5,000 square feet or more must require that space be provided for recyclable materials.\n(a) With the approval of the commissioner of management and budget and the recommendation of the Legislative Advisory Commission, the commissioner of administration may enter into lease-purchase agreements. A lease-purchase agreement must provide the state with a unilateral right to purchase the leased premises at specified times for specified amounts. Under these lease agreements, the lease rental rates shall not be more than market rental rates. Notwithstanding subdivision 6, the term of the lease may be for more than ten years, but must not exceed 20 years. Prior to exercising the state's right to purchase the premises, the purchase must be approved by an act of the legislature.\n(b) A lease-purchase agreement entered into under paragraph (a) must be subject to cancellation by the state for any reason except lease of other non-state-owned land or premises for the same use.\n[Repealed, 2014 c 196 art 1 s 6]\nThe commissioner may establish a regional service center on a demonstration basis. The commissioner shall select agencies to participate in the demonstration service center and determine equitable methods of sharing space, personnel and equipment. The commissioner may enter into a lease for a base term of five years with a five-year leasehold renewal option to acquire suitable space for the service center.\n(a) To protect the public health, comfort, and environment and to protect the nonsmoker's right to a smoke-free environment, smoking in all buildings managed or leased by the commissioner under subdivisions 1 and 6 is prohibited except in veterans homes where smoking areas have been designated under a policy adopted in accordance with paragraph (b).\n(b) A veterans home may permit smoking only in designated areas, providing that existing physical barriers and ventilation systems can be used to prevent the presence of smoke in adjacent nonsmoking areas.\nNo employee complaining of a violation of this subdivision to a lessor, lessee, manager, or supervisor may be subjected to any disciplinary action as a result of making the complaint.\nFor state office space that is leased, purchased, or substantially remodeled after August 1, 1988, the commissioner shall consider including space usable for child care services or for a workplace school. Space must be included if the commissioner determines that it is needed and that it could be provided at reasonable cost. The commissioner may prepare sites as a common usage space for the Capitol complex.\nWhen a fluorescent lamp containing mercury is removed from service in a building or premises owned by the state or rented by the state, the commissioner shall ensure that the lamp is recycled if a recycling facility, which has been licensed or permitted by the agency or is operated subject to a compliance agreement with, or other approval by, the commissioner, is available in this state.\nThe commissioner must provide free rehearsal and storage space in the same building in the Capitol Area to an entity known as the Minnesota State Band, which is a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code.\nMS 2022 [Repealed, 2023 c 62 art 2 s 133]",
	"repealed": false
}