{
	"id": "473.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.143",
	"title": "473.143 AFFIRMATIVE ACTION PLANS.",
	"text": "For purposes of this section, \"agency\" means a metropolitan agency as defined in section 473.121, except the Metropolitan Parks and Open Space Commission. Agency also means the Metropolitan Mosquito Control Commission. For purposes of this section, \"commissioner\" means the commissioner of the state Department of Management and Budget.\nThe council and each agency shall develop an affirmative action plan and submit its plan to the commissioner for approval. The commissioner may not approve a plan unless the commissioner determines that it will be effective in assuring that employment positions are equally accessible to all qualified persons, in eliminating the underutilization of qualified members of protected groups, in providing a supportive work environment to all employees, regardless of race, religion, sex, national origin, or disability, and in dealing with discrimination complaints. For purposes of this section, \"protected group\" has the meaning given it in section 43A.02, subdivision 33. A plan must contain at least the elements required in this subdivision.\n(a) It must identify protected groups that are underrepresented in the council's or agency's work force.\n(b) It must designate a person responsible for directing and implementing the affirmative action program and assign the specific responsibilities and duties of that person. The person responsible for implementing the program shall report directly to the council's or agency's chief operating officer regarding the person's affirmative action duties. The person responsible for the affirmative action program shall review examination and other selection criteria to assure compliance with law. This person shall be involved in the filling of all vacancies in the council or agency work force, to the extent necessary to facilitate attainment of affirmative action goals.\n(c) It must describe the methods by which the plan will be communicated to employees and to other persons.\n(d) It must describe methods for recruiting members of protected groups. These methods may include internship programs, cooperation with union apprenticeship programs, and other steps necessary to expand the number of protected group members in applicant pools.\n(e) It must describe internal procedures in accordance with this paragraph for processing complaints of alleged discrimination from job applicants and employees. The procedures must provide for an initial determination of whether the complaint is properly a discrimination complaint subject to the procedure under the affirmative action plan. Complaints filed under the discrimination procedures that allege reprisals against an employee for opposing a forbidden practice or for filing a charge, testifying, or participating in an investigation, proceeding, or hearing relating to a forbidden practice are appealable to the chief operating officer of the council or agency. Procedures under this paragraph must be distinct from any procedures available under a union contract or personnel policy for nondiscrimination complaints. Use of procedures developed under this paragraph is not a prerequisite to filing charges with a governmental enforcement agency, nor does it limit a person's right to file these charges.\n(f) It must set goals and timetables to eliminate underutilization of members of each protected group in the council or agency work force.\n(g) It must provide a plan for retaining and promoting protected group members in the council or agency work force. This plan should encourage training opportunities for protected group members, to the extent necessary to eliminate underutilization in specific parts of the work force.\n(h) It must describe methods of auditing, evaluating, and reporting program success, including a procedure that requires a preemployment review of all hiring decisions for occupational groups with unmet affirmative action goals.\n(i) It must provide for training of management and supervisory personnel in implementation of the plan and in dealing with alleged acts of discrimination in the workplace.\n(j) It must provide for periodic surveying of the council or agency work force to determine employee attitudes toward implementation of the plan.\n(k) It must provide for creation of an employee committee to advise on implementation of the plan and on any changes needed in the plan.\nThe council and each agency shall adopt written policies forbidding harassment based on sex, disability, or race in their workplaces and establishing implementation plans and grievance procedures to deal with complaints of harassment based on sex, disability, or race.\nThe evaluation of the performance of each supervisory and managerial employee of the council and the agencies must include evaluation of the person's performance in implementing the council's or agency's affirmative action plan and in preventing forbidden discrimination in the workplace.\nBy March 1 each year, the commissioner shall report to the legislature on affirmative action progress of the council and of each agency. The report must include:\n(1) an audit of the record of the council and each agency to determine compliance with affirmative action goals and to evaluate overall progress in attainment of overall affirmative action objectives;\n(2) if the council or any agency has failed to make satisfactory progress toward its affirmative action goals, a list of unmet goals and an analysis of why the failure occurred;\n(3) a summary of all personnel actions taken by the council and each agency during the past calendar year, categorized by occupational group, protected group status, and full-time, part-time, temporary, and seasonal status; and\n(4) a summary of discrimination complaints and lawsuits against the council and each agency filed or resolved during the past calendar year, including the basis for the complaints and lawsuits.\nFor purposes of this subdivision, \"personnel action\" means a new hire, promotion, transfer, demotion, layoff, recall from layoff, suspension with or without pay, letter of reprimand, involuntary termination, other disciplinary action, and voluntary termination.\nThe council and each agency shall report to the commissioner all information that the commissioner requests to make the report required by this subdivision. In providing this information, the council and agencies are not required to reveal information that is not public data under chapter 13.\nThe council and each agency shall submit these reports at the time and in the manner requested by the commissioner. The commissioner shall report to the legislature on the failure of the council or an agency to file the required report in a timely manner.\nThe commissioner or a designee shall meet with affirmative action officers of the council and all of the agencies to share successful techniques and foster innovative means to implement affirmative action plans and eliminate discrimination in the workplace.\nThe council and each agency shall facilitate legislative oversight of equal opportunity practices by providing the legislature access, including access to computerized records if compatible systems exist, to public data maintained by the agency. The council and agencies must not provide access to information that is not public data as defined in section 13.02, subdivision 8a.",
	"repealed": false
}