{
	"id": "62S.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.13",
	"title": "62S.13 INCONTESTABILITY PERIOD.",
	"text": "For a policy or certificate that has been in force for less than six months, an insurer may rescind a long-term care insurance policy or certificate or deny an otherwise valid long-term care insurance claim upon a showing of misrepresentation that is material to acceptance for coverage.\nFor a policy or certificate that has been in force for at least six months, but less than two years, an insurer may rescind a long-term care insurance policy or certificate or deny an otherwise valid long-term care insurance claim upon a showing of misrepresentation that is both material to the acceptance for coverage and that pertains to the condition for which benefits are sought.\nAfter a policy or certificate has been in force for two years, it is not contestable upon the grounds of misrepresentation alone. The policy or certificate may be contested only upon a showing that the insured knowingly and intentionally misrepresented relevant facts relating to the insured's health.\nA long-term care insurance policy or certificate may not be field issued based on medical or health status. For purposes of this section, \"field issued\" means a policy or certificate issued by an agent or a third-party administrator under the underwriting authority granted to the agent or third-party administrator by an insurer and using the insurer's underwriting guidelines.\nIf an insurer has paid benefits under the long-term care insurance policy or certificate, the benefit payments may not be recovered by the insurer in the event that the policy or certificate is rescinded.\nIn the event of the death of the insured, this section shall not apply to the remaining death benefit of a life insurance policy that accelerates benefits for long-term care. In this situation, the remaining death benefits under these policies shall be governed by section 61A.03, subdivision 1, paragraph (c). In all other situations, this section shall apply to life insurance policies that accelerate benefits for long-term care.",
	"repealed": false
}