{
	"id": "62W.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.07",
	"title": "62W.07 PHARMACY OWNERSHIP INTEREST; PHARMACY SERVICES.",
	"text": "(a) A pharmacy benefit manager that has an ownership interest either directly or indirectly, or through an affiliate or subsidiary, in a pharmacy must disclose to a plan sponsor that contracts with the pharmacy benefit manager any difference between the amount paid to that pharmacy and the amount charged to the plan sponsor.\n(b) A pharmacy benefit manager or health carrier is prohibited from penalizing, requiring, or providing financial incentives, including variations in premiums, deductibles, co-payments, or coinsurance, to an enrollee as an incentive to use a retail pharmacy, mail order pharmacy, specialty pharmacy, or other network pharmacy provider in which a pharmacy benefit manager has an ownership interest or in which the pharmacy provider has an ownership interest in the pharmacy benefit manager.\n(c) Paragraph (b) does not apply if the pharmacy benefit manager or health carrier offers an enrollee the same financial incentives for using a network retail pharmacy, mail order pharmacy, specialty pharmacy, or other network pharmacy in which the pharmacy benefit manager has no ownership interest and the network pharmacy has agreed to accept the same pricing terms, conditions, and requirements related to the cost of the prescription drug and the cost of dispensing the prescription drug that are in the agreement with a network pharmacy in which the pharmacy benefit manager has an ownership interest.\n(d) A pharmacy benefit manager or health carrier is prohibited from imposing limits, including quantity limits or refill frequency limits, on an enrollee's access to medication that differ based solely on whether the health carrier or pharmacy benefit manager has an ownership interest in a pharmacy or the pharmacy has an ownership interest in the pharmacy benefit manager.\n(e) Nothing in paragraph (d) shall be construed to prohibit a pharmacy benefit manager from imposing different limits, including quantity limits or refill frequency limits on an enrollee's access to medication based on whether the enrollee uses a mail order pharmacy or retail pharmacy so long as the enrollee has the option to use a mail order pharmacy or retail pharmacy with the same limits imposed in which the pharmacy benefit manager or health carrier does not have an ownership interest.\n(f) A pharmacy benefit manager or health carrier must not prohibit an entity authorized to participate in the federal 340B Drug Pricing Program under section 340B of the Public Health Service Act, United States Code, title 42, chapter 6A, or a pharmacy under contract with such an entity to provide pharmacy services from participating in the pharmacy benefit manager's or health carrier's provider network. A pharmacy benefit manager or health carrier must not reimburse an entity or a pharmacy under contract with such an entity participating in the federal 340B Drug Pricing Program differently than other similarly situated pharmacies. A pharmacy benefit manager that contracts with a managed care plan or county-based purchasing plan under contract with the commissioner of human services under chapter 256B or 256L must comply with this paragraph only if the entity or contracted pharmacy can identify all claims eligible for 340B drugs at the time of initial claims submission at the point of sale. This paragraph does not preclude a pharmacy benefit manager that contracts with a managed care plan or county-based purchasing plan under contract with the commissioner of human services under chapter 256B or 256L from reimbursing an entity or pharmacy identified in this paragraph at a lower rate for any prescription drug purchased by the entity or pharmacy through the federal 340B Drug Pricing Program.",
	"repealed": false
}