{
	"id": "243.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.88",
	"title": "243.88 PRIVATE INDUSTRY ON GROUNDS OF CORRECTIONAL INSTITUTIONS.",
	"text": "Notwithstanding the provisions of any law to the contrary, the commissioner of administration, with the approval of the governor, may lease one or more buildings or portions thereof on the grounds of any state adult correctional institution, together with the real estate needed for reasonable access to and egress from the leased buildings, for a term not to exceed 20 years, to a private corporation for the purpose of establishing and operating a factory for the manufacture and processing of goods, wares or merchandise, or any other business or commercial enterprise deemed by the commissioner of corrections to be consistent with the proper training and rehabilitation of inmates.\nAny corporation operating a factory or other business or commercial enterprise under this section may employ selected inmates of the correctional institution upon whose grounds it operates and persons conditionally released subject to the provisions of section 241.26. Persons conditionally released as provided in this subdivision shall be deemed to be parolees within the purview of United States Code, title 49, section 60.\nExcept as prohibited by applicable provisions of the United States Code, inmates of state correctional institutions may be employed in the manufacture and processing of goods, wares and merchandise for introduction into interstate commerce, provided that they are paid no less than the prevailing minimum wages for work of a similar nature performed by employees with similar skills in the locality in which the work is being performed.\nUnder rules prescribed by the commissioner of corrections a portion of the wages of each inmate employed as authorized by this subdivision, in an amount to be determined by the commissioner, shall be set aside and kept by the chief executive officer of the facility in the public welfare fund of the state for the benefit of the inmate and for the purpose of assisting the inmate when leaving the facility on conditional release or by final discharge. Any portion remaining undisbursed at the time of the inmate's final discharge shall be given to the inmate upon final discharge.\nAny factory established under the provisions of this section shall be deemed a private enterprise and subject to all the laws and rules of this state governing the operation of similar business enterprises elsewhere in this state.\nThe authority of the commissioner of corrections over the institutions of the Department of Corrections and the inmates thereof shall not be diminished by this section.\nNotwithstanding any other law to the contrary, any compensation paid to inmates under this section is subject to section 243.23, subdivisions 2 and 3, and rules of the commissioner of corrections.",
	"repealed": false
}