{
	"id": "62J.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.91",
	"title": "62J.91 PRESCRIPTION DRUG PRODUCT REVIEWS.",
	"text": "Once a decision by the board has been made to proceed with a cost review of a prescription drug product, the board shall conduct the review and make a determination as to whether appropriate utilization of the prescription drug under review, based on utilization that is consistent with the United States Food and Drug Administration (FDA) label or standard medical practice, has led or will lead to affordability challenges for the state health care system or for patients.\nIn reviewing the cost of a prescription drug product, the board may consider the following factors:\n(1) the price at which the prescription drug product has been and will be sold in the state;\n(2) manufacturer monetary price concessions, discounts, or rebates, and drug-specific patient assistance;\n(3) the price of therapeutic alternatives;\n(4) the cost to group purchasers based on patient access consistent with the FDA-labeled indications and standard medical practice;\n(5) measures of patient access, including cost-sharing and other metrics;\n(6) the extent to which the attorney general or a court has determined that a price increase for a generic or off-patent prescription drug product was excessive under sections 62J.842 and 62J.844;\n(7) any information a manufacturer chooses to provide; and\n(8) any other factors as determined by the board.\n(a) Any submission made to the board related to a drug cost review must be made available to the public with the exception of information determined by the board to be proprietary and information provided by the commissioner of health classified as not public data under section 13.02, subdivision 8a, or as trade secret information under section 13.37, subdivision 1, paragraph (b), or as trade secret information under the Defend Trade Secrets Act of 2016, United States Code, title 18, section 1836, as amended.\n(b) The board shall establish the standards for the information to be considered proprietary under paragraph (a) and section 62J.90, subdivision 2, including standards for heightened consideration of proprietary information for submissions for a cost review of a drug that is not yet approved by the FDA.\n(c) Prior to the board establishing the standards under paragraph (b), the public shall be provided notice and the opportunity to submit comments.\n(d) The establishment of standards under this subdivision is exempt from the rulemaking requirements under chapter 14, and section 14.386 does not apply.",
	"repealed": false
}