{
	"id": "346.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.55",
	"title": "346.55 CIVIL LIABILITY.",
	"text": "The transfer by a person other than the owner of a dog or cat to a dealer, the possession of a dog or cat by a dealer without the permission of the owner, or the transfer of a dog or cat by a dealer to an institution without the permission of the owner is prohibited. Nothing in this section prohibits the transfer of a dog or cat to a dealer if the dog or cat is removed from a property by or at the request of a person in possession of the property. For the purpose of this subdivision, \"dealer\" and \"institution\" have the meanings given them in section 347.31.\nA person who transfers or possesses a dog or cat without claim of right with intent to deprive the owner permanently of possession of the dog or cat violates this section and is liable for a civil penalty of up to $1,000 per dog or cat for each violation. In bringing a civil action under this section the charging attorney shall consider, and in imposing a fine the court shall consider:\n(1) the history of previous violations;\n(2) the number of violations;\n(3) the degree of willfulness of the violation;\n(4) the good faith of the dealer;\n(5) the good faith of the person delivering the dog or cat to the dealer; and\n(6) the gravity of the violation.\nA fine paid by the defendant in a criminal action that arose from the same violation may not be applied toward payment of the civil penalty under this subdivision.\nThe district court may hear, try, and determine actions started under this section. Trials under this section must be to the court, sitting without a jury.\nNotwithstanding section 8.01, county or city attorneys may appear for the board of animal health in civil actions started under this section at the request of the attorney general. Actions under this section may be brought in the name of the state of Minnesota with the consent of the Board of Animal Health or directly by a city or county attorney at the request of a person filing a complaint.\nCivil actions under this section may be started in any county in which the animal in question was transferred or possessed, or from which the dog or cat was removed without the permission of the lawful owner.\nFines collected under this section must be disposed of as follows:\n(a) If the violation occurs in the county, and the county attorney appears in the action, 50 percent to the county and 50 percent to the state.\n(b) If the violation occurs within the municipality, and the city attorney appears in the action, 50 percent to the city and 50 percent to the state.\n(c) If the attorney general appears in the action, all penalties imposed and fines collected must be credited to the general fund in the state treasury.",
	"repealed": false
}