{
	"id": "136A.824",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.824",
	"title": "136A.824 FEES.",
	"text": "(a) The office processing fee for an initial licensure application is:\n(1) $2,500 for a private career school that will offer no more than one program during its first year of operation;\n(2) $750 for a private career school licensed exclusively due to the use of the term \"college,\" \"university,\" \"academy,\" or \"institute\" in its name, or licensed exclusively in order to participate in state grant or SELF loan financial aid programs; and\n(3) $2,500, plus $500 for each additional program offered by the private career school, for a private career school during its first year of operation.\n(b) In addition to the fee under paragraph (a), a fee of $600 must be paid for an initial application that: (1) has had four revisions, corrections, amendment requests, or application reminders for the same application or licensure requirement; or (2) cumulatively has had six revisions, corrections, amendment requests, or application reminders for the same license application and the private career school seeks to continue with the application process with additional application submissions. If this fee is paid, the private career school may submit two final application submissions for review prior to application denial under section 136A.829, subdivision 1, clause (2). This provision excludes from its scope nonrepetitive questions or clarifications initiated by the school before the submission of the application, initial interpretation questions or inquiries from the office regarding a completed application, and initial requests from the office for verification or validation of a completed application.\n(a) The office processing fee for a renewal licensure application is:\n(1) for a private career school that offers one program, the license renewal fee is $1,150;\n(2) for a private career school that offers more than one program, the license renewal fee is $1,150, plus $200 for each additional program with a maximum renewal licensing fee of $2,000;\n(3) for a private career school licensed exclusively due to the use of the term \"college,\" \"university,\" \"academy,\" or \"institute\" in its name, the license renewal fee is $750; and\n(4) for a private career school licensed by another state agency and also licensed with the office exclusively in order to participate in state student aid programs, the license renewal fee is $750.\n(b) If a license renewal application is not received by the office by the close of business at least 60 days before the expiration of the current license, a late fee of $100 per business day, not to exceed $3,000, shall be assessed.\n(c) In addition to the fee under paragraph (a), a fee of $600 must be paid for a renewal application that: (1) has had four revisions, corrections, amendment requests, or application reminders for the same application or licensure requirement; or (2) cumulatively has had six revisions, corrections, amendment requests, or application reminders for the same license application and the private career school seeks to continue with the application process with additional application submissions. If this fee is paid, the private career school may submit two final application submissions for review prior to application denial under section 136A.829, subdivision 1, clause (2). This provision excludes from its scope nonrepetitive questions or clarifications initiated by the school before the submission of the application, initial interpretation questions or inquiries from the office regarding a completed application, and initial requests from the office for verification or validation of a completed application.\nThe office processing fee for adding a program to those that are currently offered by the private career school is $500 per program.\nIf the office determines that a fact-finding visit or outside consultant is necessary to review, investigate, or evaluate any new or revised program or the private career school for statutory compliance with the Private Career School Act, the office shall be reimbursed for the expenses incurred related to the review as follows:\n(1) $400 for the team base fee or for a paper review conducted by a consultant if the office determines that a fact-finding visit is not required;\n(2) $300 for each day or part thereof on site per team member; and\n(3) the actual cost of customary meals, lodging, and related travel expenses incurred by team members.\nThe fee for modification of any existing program is $100 and is due if there is:\n(1) an increase or decrease of 25 percent or more, from the original date of program approval, in clock hours, credit hours, or calendar length of an existing program;\n(2) a change in academic measurement from clock hours to credit hours or vice versa; or\n(3) an addition or alteration of courses that represent a 25 percent change or more in the objectives, content, or methods of delivery.\nThe solicitor permit fee is $350 and must be paid annually.\nPrivate career schools wishing to operate at multiple locations must pay:\n(1) $250 per location, for locations two to five; and\n(2) an additional $100 for each location over five.\nThe fee for a student transcript requested from a closed private career school whose records are held by the office is $15, with a maximum of five transcripts per request.\nThe rate for copies of any public office document shall be 50 cents per page.",
	"repealed": false
}