{
	"id": "97A.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.475",
	"title": "97A.475 LICENSE FEES.",
	"text": "A license shall be issued when the requirements of the law are met and the license fee specified in this section is paid.\nFees for the following licenses, to be issued to residents only, are:\n(1) for persons age 18 or over and under age 65 to take small game, $15.50;\n(2) for persons age 65 or over, $7 to take small game;\n(3) for persons age 18 or over to take turkey, $26;\n(4) for persons age 13 or over and under age 18 to take turkey, $5;\n(5) for persons age 18 or over to take deer with firearms during the regular firearms season, $34;\n(6) for persons age 18 or over to take deer by archery, $34;\n(7) for persons age 18 or over to take deer by muzzleloader during the muzzleloader season, $34;\n(8) to take moose, for a party of not more than six persons, $356;\n(9) for persons age 18 or over to take bear, $44;\n(10) to take elk, for a party of not more than two persons, $287;\n(11) to take light geese during the light goose conservation order, $2.50;\n(12) to take sandhill crane during the sandhill crane season, $3;\n(13) to take prairie chickens, $23;\n(14) for persons age 13 or over and under age 18 to take deer with firearms during the regular firearms season, $5;\n(15) for persons age 13 or over and under age 18 to take deer by archery, $5;\n(16) for persons age 13 or over and under age 18 to take deer by muzzleloader during the muzzleloader season, $5;\n(17) for persons age 10, 11, or 12 to take bear, no fee;\n(18) for persons age 13 or over and under age 18 to take bear, $5;\n(19) for persons age 18 or over to take small game for a consecutive 72-hour period selected by the licensee, $19, of which an amount equal to one-half of the fee for the migratory-waterfowl stamp under subdivision 5, clause (1), shall be deposited in the waterfowl habitat improvement account under section 97A.075, subdivision 2; one-half of the fee for the pheasant stamp under subdivision 5, clause (2), shall be deposited in the pheasant habitat improvement account under section 97A.075, subdivision 4; and one-half of the small-game surcharge under subdivision 4, shall be deposited in the wildlife acquisition account;\n(20) for persons age 16 or over and under age 18 to take small game, $5;\n(21) to take wolf, $30;\n(22) for persons age 12 and under to take turkey, no fee;\n(23) for persons age 10, 11, or 12 to take deer by firearm, no fee;\n(24) for persons age 10, 11, or 12 to take deer by archery, no fee; and\n(25) for persons age 10, 11, or 12 to take deer by muzzleloader during the muzzleloader season, no fee.\n(a) Fees for the following licenses, to be issued to nonresidents, are:\n(1) for persons age 18 or over to take small game, $90.50;\n(2) for persons age 18 or over to take deer with firearms during the regular firearms season, $180;\n(3) for persons age 18 or over to take deer by archery, $180;\n(4) for persons age 18 or over to take deer by muzzleloader during the muzzleloader season, $180;\n(5) for persons age 18 or over to take bear, $225;\n(6) for persons age 18 or over to take turkey, $91;\n(7) for persons age 13 or over and under age 18 to take turkey, $5;\n(8) to take raccoon or bobcat, $178;\n(9) to take light geese during the light goose conservation order, $2.50;\n(10) to take sandhill crane during the sandhill crane season, $3;\n(11) for persons age 13 or over and under age 18 to take deer with firearms during the regular firearms season in any open season option or time period, $5;\n(12) for persons age 13 or over and under age 18 to take deer by archery, $5;\n(13) for persons age 13 or over and under age 18 to take deer during the muzzleloader season, $5;\n(14) for persons age 13 or over and under 18 to take bear, $5;\n(15) for persons age 18 or over to take small game for a consecutive 72-hour period selected by the licensee, $75, of which an amount equal to one-half of the fee for the migratory-waterfowl stamp under subdivision 5, clause (1), shall be deposited in the waterfowl habitat improvement account under section 97A.075, subdivision 2; one-half of the fee for the pheasant stamp under subdivision 5, clause (2), shall be deposited in the pheasant habitat improvement account under section 97A.075, subdivision 4; and one-half of the small-game surcharge under subdivision 4, shall be deposited into the wildlife acquisition account;\n(16) for persons age 16 or 17 to take small game, $5;\n(17) to take wolf, $250;\n(18) for persons age 12 and under to take turkey, no fee;\n(19) for persons age 10, 11, or 12 to take deer by firearm, no fee;\n(20) for persons age 10, 11, or 12 to take deer by archery, no fee;\n(21) for persons age 10, 11, or 12 to take deer by muzzleloader during the muzzleloader season, no fee; and\n(22) for persons age 10, 11, or 12 to take bear, no fee.\n(b) A $5 surcharge shall be added to nonresident hunting licenses issued under paragraph (a), clauses (1) to (6) and (8). An additional commission may not be assessed on this surcharge.\n(a) A person may agree to add a donation of $1, $3, or $5 to the fees for annual resident and nonresident licenses to take deer by firearms or archery established under subdivisions 2, clauses (5), (6), (7), (15), (16), and (17), and 3, paragraph (a), clauses (2), (3), (4), (12), (13), and (14).\n(b) Beginning March 1, 2008, fees for bonus licenses to take deer by firearms or archery established under section 97B.301, subdivision 4, must be increased by a surcharge of $1.\n(c) An additional commission may not be assessed on the donation or surcharge.\n(a) Fees for annual licenses to take small game must be increased by a surcharge of $6.50, except licenses under subdivisions 2, clauses (20) and (21); and 3, paragraph (a), clauses (16) and (17). An additional commission may not be assessed on the surcharge and the following statement must be included in the annual small-game-hunting regulations: \"This $6.50 surcharge is being paid by hunters for the acquisition and development of wildlife lands.\"\n(b) A person may agree to add a donation of $1, $3, or $5 to the fees for annual resident and nonresident licenses to take small game. An additional commission may not be assessed on the donation. The following statement must be included in the annual small-game-hunting regulations: \"The small-game license donations are being paid by hunters for administration of the walk-in access program.\"\nFees for the following stamps and stamp validations are:\n(1) migratory-waterfowl stamp, $7.50; and\n(2) pheasant stamp, $7.50.\nFees for the following licenses, to be issued to residents only, are:\n(1) for persons age 18 or over to take fish by angling, $25;\n(2) for persons age 18 or over to take fish by angling, for a combined license for a married couple, $40;\n(3) for persons age 18 or over to take fish by spearing from a dark house, $6, and the person must possess an angling license;\n(4) for persons age 18 or over to take fish by angling for a 24-hour period selected by the licensee, $12;\n(5) for persons age 18 or over to take fish by angling for a consecutive 72-hour period selected by the licensee, $14;\n(6) for persons age 18 or over to take fish by angling for three consecutive years, $71; and\n(7) for persons age 16 or over and under age 18 to take fish by angling, $5.\n(a) Fees for the following licenses, to be issued to nonresidents, are:\n(1) for persons age 18 or over to take fish by angling, $46;\n(2) for persons age 18 or over to take fish by angling limited to seven consecutive days selected by the licensee, $38;\n(3) for persons age 18 or over to take fish by angling for a consecutive 72-hour period selected by the licensee, $31;\n(4) for persons age 18 or over to take fish by angling for a combined license for a family for one or both parents and dependent children under the age of 16, $63;\n(5) for persons age 18 or over to take fish by angling for a 24-hour period selected by the licensee, $14;\n(6) to take fish by angling for a combined license for a married couple, limited to 14 consecutive days selected by one of the licensees, $49;\n(7) for persons age 18 or over to take fish by spearing from a dark house, $12, and the person must possess an angling license; and\n(8) for persons age 16 or over and under age 18 to take fish by angling, $5.\n(b) A $5 surcharge shall be added to all nonresident fishing licenses, except licenses issued under paragraph (a), clauses (5) and (8). An additional commission may not be assessed on this surcharge.\n(a) The commissioner shall issue Minnesota sporting licenses to residents only. The licensee may take fish by angling and small game. The fee for the license is:\n(1) for an individual, $34.50; and\n(2) for a combined license for a married couple to take fish and for one spouse to take small game, $50.50.\n(b) The commissioner shall issue Minnesota supersports licenses to residents only. The licensee may take fish by angling, including trout; small game, including pheasant and waterfowl; and deer by firearms or muzzleloader or by archery. The fee for the supersports license, including all required stamp validations is:\n(1) for an individual age 18 or over, $93.50; and\n(2) for a combined license for a married couple to take fish, including the trout-and-salmon stamp validation, and for one spouse to take small game, including pheasant and waterfowl, and deer, $119.50.\n(c) Revenue for the stamp endorsements under paragraph (b) shall be deposited according to section 97A.075, subdivisions 2, 3, and 4.\n(d) Revenue for the deer license endorsement under paragraph (b) shall be deposited according to section 97A.075, subdivision 1.\n[Repealed, 1994 c 561 s 28]\nThe fee for a trout-and-salmon stamp validation is $10.\nA person may agree to purchase a walleye stamp validation for $5.\nFees for the following licenses are:\n(1) annual for a fish house, dark house, or shelter that is not rented, $15;\n(2) annual for a fish house, dark house, or shelter that is rented, $30;\n(3) three-year for a fish house, dark house, or shelter that is not rented, $42; and\n(4) three-year for a fish house, dark house, or shelter that is rented, $87.\nFees for fish house, dark house, and shelter licenses for a nonresident are:\n(1) annual, $37;\n(2) seven consecutive days selected by the licensee, $21; and\n(3) three-year, $111.\nThe fee for a license to net whitefish and ciscoes in inland lakes and international waters for personal consumption is, for each net, $10.\n[Repealed by amendment, 1997 c 216 s 83]\nThe fee for a license to operate a charter boat and guide anglers on Lake Superior or the St. Louis River Estuary is:\n(1) for a resident, $125;\n(2) for a nonresident, $400; or\n(3) if another state charges a Minnesota resident a fee greater than $440 for a Lake Superior or St. Louis River Estuary fishing guide license in that state, the nonresident fee for a resident of that state is that greater fee.\n(a) The fee for a resident bear-hunting-outfitter license is $82.50 and is available only to a Minnesota resident individual.\n(b) The fee for a resident master bear-hunting-outfitter license is $165. The fee to add an additional person under the license is $82.50 per person.\n[Repealed, 1994 c 623 art 1 s 47]\nThe fee for a shooting preserve license is:\n(1) for a private shooting preserve, $100; and\n(2) for a commercial shooting preserve, $500.\nThe fee for a taxidermist license, to be issued for a three-year period to residents only, is:\n(1) for persons age 18 and older, $44; and\n(2) for persons under age 18, $27.50.\n(a) The fee for a license to trap fur-bearing animals, other than wolves, is:\n(1) for residents over age 13 and under age 18, $5;\n(2) for residents age 18 or over and under age 65, $23;\n(3) for residents age 65 or over, $11.50; and\n(4) for nonresidents, $84.\n(b) The fee for a license to trap wolves is $30, to be issued to residents only.\n(a) The fee for a license for a resident to buy and sell raw furs is $110.\n(b) The fee for a supplemental license to buy and sell furs is $55.\nThe fee for a license for a nonresident to buy and sell raw furs is $500.\nThe fee for a license to tan and dress raw furs to be issued to residents and nonresidents is $16.50.\nThe fee for a game and fur farm license is $16.50.\n[Repealed, 1Sp2015 c 4 art 5 s 34]\nThe fees for the following licenses are:\n(1) minnow dealer, $310;\n(2) minnow dealer's vehicle, $15;\n(3) exporting minnow dealer for residents and nonresidents, $700; and\n(4) exporting minnow dealer's vehicle for residents and nonresidents, $15.\nThe fees for the following licenses, to be issued to residents and nonresidents, are:\n(1) minnow retailer, $47; and\n(2) minnow retailer's vehicle, $15.\n[Repealed, 2004 c 255 s 51]\nThe fees for the following licenses to be issued to residents and nonresidents are:\n(1) for a private fish hatchery, with annual sales under $200, $70;\n(2) for a private fish hatchery, with annual sales of $200 or more, $210 for the base license. The commissioner must establish an additional fee based on the acreage of the operation. Notwithstanding section 16A.1283, the commissioner may, by written order published in the State Register, establish the additional fee required by this subdivision. The fee is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply; and\n(3) to take sucker eggs from public waters for a private fish hatchery, $400, plus $6 for each quart in excess of 100 quarts.\n[Repealed, 1992 c 566 s 23]\nThe fees to take commercial fish are:\n(1) commercial license fees:\n(i) for residents and nonresidents seining and netting in inland waters, $120;\n(ii) for residents netting in Lake Superior, $120;\n(iii) for residents netting in Lake of the Woods, Rainy, Namakan, and Sand Point Lakes, $120;\n(iv) for residents seining in the Mississippi River from St. Anthony Falls to the St. Croix River junction, $120;\n(v) for residents seining, netting, and set lining in Wisconsin boundary waters from Lake St. Croix to the Iowa border, $120; and\n(vi) for a resident apprentice license, $55; and\n(2) commercial gear fees:\n(i) for each gill net in Lake Superior, Wisconsin boundary waters, and Namakan Lake, $5 per 100 feet of net;\n(ii) for each seine in inland waters, on the Mississippi River as described in section 97C.801, subdivision 2, and in Wisconsin boundary waters, $9 per 100 feet;\n(iii) for each commercial hoop net in inland waters, $2;\n(iv) for each submerged fyke, trap, and hoop net in Lake Superior, St. Louis Estuary, Lake of the Woods, and Rainy, Namakan, and Sand Point Lakes, and for each pound net in Lake Superior, $20;\n(v) for each stake and pound net in Lake of the Woods, $90; and\n(vi) for each set line in the Wisconsin boundary waters, $45.\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed by amendment, 1997 c 216 s 83]\n[Repealed, 2007 c 131 art 1 s 96]\nThe fee for a license to prepare dressed game fish or native rough fish for transportation or shipment is $40.\nThe fee for a license to use a motor vehicle to sell fish is $70.\nThe fee for a recreational turtle license to take, transport, and possess turtles for personal use is $25.\nThe fee for the licenses to deal in frogs that are to be used for purposes other than bait are:\n(1) for a resident to purchase, possess, and transport frogs, $220;\n(2) for a nonresident to purchase, possess, and transport frogs, $550; and\n(3) for a resident to take, possess, transport, and sell frogs, $35.\nThe fees for duplicate licenses are:\n(1) for licenses to take big game, $5, except licenses issued under subdivision 8, paragraph (b); and\n(2) for other licenses, $2.\nThe fee for a replacement deer or turkey license is $5, except there is no fee for replacing a deer license issued under subdivision 8, paragraph (b).\nThe application fee for the Camp Ripley archery deer hunt is $14.",
	"repealed": false
}