{
	"id": "161.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.39",
	"title": "161.39 AID TO OTHER ROAD AUTHORITIES AND STATE DEPARTMENTS.",
	"text": "Upon the request of another road authority, any road authority including the commissioner and the road authority of any city, township, or county may provide technical and engineering advice, assistance and supervision to the requesting road authority; and may make surveys and prepare plans for the location, construction, and reconstruction of and perform maintenance on any highway, street, road, or bridge under the jurisdiction of the requesting road authority.\nIf so requested the assisting road authority may examine the whole or any part of the highway or street system under the jurisdiction of the road authority and recommend changes, alterations, or additions thereto that the assisting road authority deems to be in the public interest and in the interest of safety and convenient public travel. The commissioner may make surveys, studies, investigations, and perform work and services as are necessary in carrying out such requests.\nThe commissioner shall render engineering or surveying services as the governor may require for any of the state departments or agencies.\nThe commissioner may pavement mark highways and streets off the trunk highway system and furnish the necessary equipment and operators therefor when any road authority, including road authorities of cities and state department or agencies having jurisdiction over such highways or streets requests such pavement marking.\nThe cost of the work or services performed under the provisions of this section shall be paid by the road authority, department or agency for which the work or services were performed. All money received or expended therefor shall be credited or debited to the trunk highway fund.\nThe trunk highway fund shall be reimbursed for money expended by the Transportation Department in performing services for the Public Utilities Commission.\nThe Office of Electronic Communication in the Department of Transportation may perform work for other state agencies and, to the extent that these services are performed beyond the level for which money was appropriated, may deposit revenue generated from this source as dedicated receipts to the account from which it was spent.\nThe road authorities, including road authorities of cities, townships, counties, state departments, or agencies may enter into agreements with the commissioner setting forth the work or services to be performed by the commissioner or the road authority under the provisions of this section and providing for the method of reimbursement to or from the trunk highway fund of the cost thereof.",
	"repealed": false
}