{
	"id": "611A.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.57",
	"title": "611A.57 DETERMINATION OF CLAIMS.",
	"text": "[Repealed, 1993 c 326 art 6 s 26]\nThe board staff shall examine the papers filed in support of the claim and cause an investigation to be conducted into the validity of a claim to the extent that an investigation is necessary.\nThe board executive director may decide the claim in favor of a claimant in the amount claimed on the basis of the papers filed in support of it and the report of the investigation of such claim. If unable to decide the claim upon the basis of the papers and any report of investigation, the board executive director shall discuss the matter with other members of the board present at a board meeting. After discussion the board shall vote on whether to grant or deny the claim or whether further investigation is necessary. A decision granting or denying the claim shall then be issued by the executive director.\nThe written decision granting or denying a claim shall be filed with the board, and a copy shall be provided to the claimant.\nThe claimant may, within 30 days after receiving the decision of the board, apply for reconsideration before the entire board. Upon request for reconsideration, the board shall reexamine all information filed by the claimant, including any new information the claimant provides, and all information obtained by investigation. The board may also conduct additional examination into the validity of the claim. Upon reconsideration, the board may affirm, modify, or reverse the prior ruling. A claimant denied reimbursement upon reconsideration is entitled to a contested case hearing within the meaning of chapter 14.\nClaims for reimbursement and supporting documents and reports are investigative data and subject to the provisions of section 13.39 until the claim is paid, denied, withdrawn, or abandoned. Following the payment, denial, withdrawal, or abandonment of a claim, the claim and supporting documents and reports are private data on individuals as defined in section 13.02, subdivision 12; provided that the board may forward any reimbursement claim forms, supporting documents, and reports to local law enforcement authorities for purposes of implementing section 611A.67.",
	"repealed": false
}