{
	"id": "66A.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.39",
	"title": "66A.39 CONVERSION OF EXISTING COMPANIES; AMENDMENT OF CERTIFICATES OF INCORPORATION.",
	"text": "Any existing stock or mutual insurance company authorized to do the kinds of business referred to in section 66A.36 may amend its certificate of incorporation so as to become a stock and mutual company; provided, that no such amendment shall deprive any stockholder or member or policyholder of the right, at any and all meetings of stockholders and members or policyholders held thereafter, to cast as many votes for directors as are provided by the certificate of incorporation in force at the time of the adoption of such amendment, or by the law in force at such time. No such amendment shall be construed to change the identity of the corporation and it shall thereafter continue to be governed by the laws applicable thereto at the time of such amendment and as amended hereafter and not inconsistent with sections 66A.36 to 66A.39, as well as those relating to the added characteristic of capital stock or mutuality which it shall have acquired by such amendment.\nThe certificate of incorporation of a stock and mutual life insurance company may be amended in any respect therein provided by section 60A.07, subdivision 1d, in the manner therein provided. The certificate of incorporation of a stock and mutual life insurance company may also be amended in respect to any matter which an original certificate of incorporation of a stock and mutual life insurance company might lawfully have contained, or so as to vest in its board of directors authority to make and alter bylaws subject to the power of the stockholders and members to change or repeal such bylaws, by the affirmative vote, at a regular meeting of stockholders and members or at a special meeting of stockholders and members called for that expressly stated purpose by the board of directors which shall first have proposed the amendment and declared it to be advisable, of (1) a majority of the total number of votes to which all stockholders are entitled, and (2) at least one-fifth of the total number of votes to which all participating policyholder members are entitled, provided the proposed amendment does not receive the negative vote of more than five percent of the total number of votes to which all participating policyholder members are entitled. The certificate of incorporation of a stock and mutual life insurance company may also be amended so as to increase or decrease its capital stock, or so as to change the number and par value of the shares of its capital stock, or so as to limit or deny to stockholders the preemptive right to subscribe to any or all shares of stock which may be authorized to be thereafter issued, by a majority vote of all its shares but without the vote of its members, at a regular meeting or at a special meeting of stockholders called for that expressly stated purpose by the board of directors which shall first have proposed the amendment and declared it to be advisable and not adverse to or in conflict with the rights and interests of the members, provided that if the proposed amendment is to increase or decrease the capital stock or to change the number of the shares of the capital stock, the resolution specifying the proposed amendment and the certificate of amendment shall expressly provide (1) that the stockholders holding all its shares shall, at all meetings, be entitled to the same number of total votes after the amendment is adopted as they were entitled to before the amendment, and (2) that each stockholder shall, at all meetings, be entitled to a fraction of one vote for each share of stock held, the numerator of which fraction shall be the number of shares outstanding before the first such amendment is adopted and the denominator of which fraction shall be the number of shares outstanding. The resolution specifying the amendment shall be embraced in a certificate duly executed by its president and secretary, or other presiding and recording officers, under its corporate seal, and approved, filed, recorded, and published in the manner prescribed for the execution, approval, filing, recording, and publishing of an original certificate of incorporation.",
	"repealed": false
}