{
	"id": "103F.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.121",
	"title": "103F.121 FLOODPLAIN MANAGEMENT ORDINANCES.",
	"text": "(a) In accordance with sections 103F.101 to 103F.151, the rules of the commissioner and applicable laws authorizing local governmental units to adopt floodplain management ordinances, local governmental units shall adopt, administer, and enforce floodplain management ordinances, which must include:\n(1) the delineation of floodplains and floodways;\n(2) the preservation of the capacity of the floodplain to carry and discharge regional floods;\n(3) the minimization of flood hazards; and\n(4) the regulation of the use of land in the floodplain.\n(b) The ordinances shall be based on adequate technical data and competent engineering advice and shall be consistent with local and regional comprehensive planning.\n(a) The commissioner, upon determining that sufficient technical information is available for the delineation of floodplains and floodways on a watercourse, may notify affected local governmental units that technical information is available. The local governmental units shall prepare or amend their floodplain management ordinances in conformance with the provisions of sections 103F.101 to 103F.151 and shall submit the ordinance to the commissioner for review and approval before adoption.\n(b) The commissioner shall approve or disapprove the proposed ordinance within 120 days after receiving it.\n(c) If the proposed ordinance is disapproved, the commissioner shall return it to the local governmental unit with a written statement of reasons for disapproval. Within 90 days after disapproval, the local governmental unit shall resubmit an amended proposed ordinance for further review and approval before adoption. The local governmental unit shall adopt a floodplain management ordinance within 90 days after approval by the commissioner.\n(d) A floodplain management ordinance adopted by a local governmental unit is invalid unless it is approved by the commissioner.\n(e) A local governmental unit may adopt a floodplain management ordinance in the absence of notification by the commissioner that the required technical data is available, provided that any such ordinance is submitted to the commissioner prior to its adoption for approval.\n(f) A local governmental unit may adopt a floodplain management ordinance that is more restrictive than required under sections 103F.101 to 103F.151.\n(g) Floodplain management ordinances may be amended by a local governmental unit upon the approval of the commissioner.\n[Repealed, 2014 c 289 s 70]\n[Repealed, 2014 c 289 s 70]\n(a) If a floodplain has been delineated by a floodplain management ordinance under sections 103F.101 to 103F.151, alteration to a structure in existence on the effective date of the ordinance or a new fill, structure, deposit, or other floodplain use that is not in accordance with the local governmental unit's adopted floodplain management ordinance may not be permitted after the effective date of the ordinance delineating the floodplain.\n(b) This subdivision does not apply to alterations, repair, or maintenance reasonably done under emergency circumstances to preserve or protect life.\n(c) This subdivision applies to alterations to existing structures and to new fill, structures, deposits, or other floodplain uses by the state and state agencies.",
	"repealed": false
}