{
	"id": "79.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.01",
	"title": "79.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms, for the purposes of sections 79.01 to 79.211, shall have the meanings ascribed to them.\n\"Assigned risk plan\" means:\n(1) the method to provide workers' compensation coverage to employers unable to obtain coverage through licensed workers' compensation companies; and\n(2) the procedures established by the commissioner to implement that method of providing coverage including administration of all assigned risk losses and reserves.\n\"Employer\" has the meaning given in section 176.011, subdivision 10.\nThe word \"insurer\" means any insurance carrier authorized by license issued by the commissioner of commerce to transact the business of workers' compensation insurance in this state and includes a political subdivision providing self insurance or establishing a pool under section 471.981, subdivision 3.\nThe word \"insurance\" means workers' compensation insurance and insurance covering any part of the liability of an employer exempted from insuring liability for compensation, as provided in section 176.181 and includes a program of self insurance, self insurance revolving fund or pool established under section 471.981.\n[Repealed, 1969 c 9 s 10]\nThe word \"commissioner\" means the commissioner of commerce.\n\"Association\" or \"rating association\" means the Workers' Compensation Insurers Rating Association of Minnesota.\n\"Interested party\" means any person or association acting on behalf of its members who is directly affected by a change in the schedule of rates and includes the staff of the Department of Commerce.\n\"Schedule of rates\" means the rate level applicable to the various industry groupings or classes, including the risk classifications thereunder upon which the determination of workers' compensation premiums are based, including but not limited to all systems for merit or experience rating, retrospective rating, and premium discounts.",
	"repealed": false
}