{
	"id": "103D.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.265",
	"title": "103D.265 CONSOLIDATING DISTRICTS.",
	"text": "(a) Proceedings for the consolidation of two or more watershed districts must be initiated by a petition filed with the board.\n(b) The petition must be signed by each watershed district affected and state:\n(1) the names of the watershed districts to be consolidated;\n(2) that the watershed districts are adjoining;\n(3) that the consolidated watershed districts can be feasibly administered as one watershed district;\n(4) the proposed name of the consolidated watershed district;\n(5) the reasons why it would be conducive to the public health, convenience and welfare to consolidate the watershed districts; and\n(6) a request for the consolidation.\n(c) The petition must be served and the board shall proceed as prescribed for an establishment petition. The requirement of notice and public hearings are as prescribed for the establishment petition.\n(a) After the hearing, if the board determines that consolidation of the watershed districts as asked in the petition would serve the public welfare, public interest, and the purpose of this chapter, the board shall, by its findings and order, consolidate the watershed districts.\n(b) The board shall file a certified copy of the findings and order with the secretary of state.\n(c) The name of the watershed district may be changed by order of the board.\n(a) The term of office of the managers of the consolidated watershed districts ends on the date of the order of consolidation. Distribution of the managers of the consolidated watershed district shall be as directed by the board in the order of consolidation.\n(b) Five managers of the consolidated watershed district must be appointed from the managers of the consolidated watershed districts. Their first term shall be for one year. After the first year, the managers must be appointed as provided in this chapter.\n(a) The real and personal property assets of the watershed districts involved and all legally valid and enforceable claims and contract obligations of the watershed districts pass to the new watershed district.\n(b) Levies on the property of the watershed districts consolidated continue in force until fully paid.\n(c) Property in the watershed districts remains liable for its proportionate share of indebtedness existing at the time of the order.\nThe watershed management plans of the watershed districts that were consolidated become the watershed management plan of the consolidated watershed district.",
	"repealed": false
}