{
	"id": "97A.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.095",
	"title": "97A.095 WATERFOWL PROTECTED AREAS.",
	"text": "The commissioner may designate by rule any part of a state game refuge or any part of a public water that is designated for management purposes under section 97A.101, subdivision 2, as a migratory-waterfowl sanctuary. The commissioner must consider an area for designation upon presentation of a petition signed by at least ten residents demonstrating that the area is primarily a migratory-waterfowl refuge. The commissioner shall post the area as a migratory-waterfowl sanctuary. A person may not enter a posted migratory-waterfowl sanctuary during the open migratory-waterfowl season or during other times prescribed by the commissioner unless accompanied by or under a permit issued by a conservation officer or wildlife manager. Upon a request from a private landowner within a migratory-waterfowl sanctuary, an annual permit must be issued to provide access to the property during the waterfowl season. The permit shall include conditions that allow no activity which would disturb waterfowl using the refuge during the waterfowl season.\nThe commissioner may, by rule, designate any part of a lake as a migratory feeding and resting area if there is adequate, free public access to the area. Before designation, the commissioner must describe the area in a public notice and receive public comments for 30 days. The commissioner must consider an area for designation upon presentation of a petition signed by at least ten residents demonstrating that the area is a substantial feeding or resting area for migratory waterfowl. The commissioner shall post the area as a migratory-waterfowl feeding and resting area. Except as authorized in rules adopted by the commissioner, a person may not enter a posted migratory-waterfowl feeding and resting area, during a period when hunting of migratory waterfowl is allowed, with watercraft or aircraft propelled by a motor, other than an electric motor with battery power of 12 volts or less. The commissioner may, by rule, further restrict the use of electric motors in migratory-waterfowl feeding and resting areas.\n[Repealed, 2012 c 277 art 1 s 91]\nThe land described in Laws 1999, chapter 81, section 2, is designated Swan Lake Migratory-Waterfowl Sanctuary under subdivision 1.",
	"repealed": false
}