{
	"id": "116.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.16",
	"title": "116.16 MINNESOTA STATE WATER POLLUTION CONTROL PROGRAM.",
	"text": "A Minnesota state water pollution control program is created to provide money to be granted or loaned to agencies and subdivisions of the state for the acquisition and betterment of public land, buildings, and improvements of a capital nature needed for the prevention, control, and abatement of water pollution in accordance with the long-range state policy, plan, and program established in sections 115.41 to 115.63, and in accordance with standards adopted pursuant to law by the Minnesota Pollution Control Agency. It is determined that state financial assistance for the construction of water pollution prevention and abatement facilities for municipal disposal systems and combined sewer overflow is a public purpose and a proper function of state government, in that the state is trustee of the waters of the state and such financial assistance is necessary to protect the purity of state waters, and to protect the public health of the citizens of the state, which is endangered whenever pollution enters state waters at one point and flows to other points in the state.\nIn this section and sections 116.17 and 116.18:\n(1) \"agency\" means the Minnesota Pollution Control Agency created by this chapter;\n(2) \"municipality\" means any county, city, town, the metropolitan council, or an Indian tribe or an authorized Indian tribal organization, and any other governmental subdivision of the state responsible by law for the prevention, control, and abatement of water pollution in any area of the state;\n(3) \"water pollution control program\" means the Minnesota state water pollution control program created by subdivision 1;\n(4) \"bond account\" means the Minnesota state water pollution control bond account created in the state bond fund by section 116.17, subdivision 4;\n(5) terms defined in section 115.01 have the meanings therein given them;\n(6) the eligible cost of any municipal project, except as otherwise provided in clause (7), includes (i) preliminary planning to determine the economic, engineering, and environmental feasibility of the project; (ii) engineering, architectural, legal, fiscal, economic, sociological, project administrative costs of the agency and the municipality, and other investigations and studies; (iii) surveys, designs, plans, working drawings, specifications, procedures, and other actions necessary to the planning, design, and construction of the project; (iv) erection, building, acquisition, alteration, remodeling, improvement, and extension of disposal systems; (v) inspection and supervision of construction; and (vi) all other expenses of the kinds enumerated in section 475.65;\n(7) for state grants under the state independent grants program, the eligible cost includes the acquisition of land for stabilization ponds, the construction of collector sewers for totally unsewered statutory and home rule charter cities and towns described under section 368.01, subdivision 1 or 1a, that are in existence on January 1, 1985, and the provision of reserve capacity sufficient to serve the reasonable needs of the municipality for 20 years in the case of treatment works and 40 years in the case of sewer systems. For state grants under the state independent grants program, the eligible cost does not include the provision of service to seasonal homes, or cost increases from contingencies that exceed three percent of as-bid costs or cost increases from unanticipated site conditions that exceed an additional two percent of as-bid costs;\n(8) \"authority\" means the Minnesota Public Facilities Authority established in section 446A.03.\nThe commissioner of management and budget shall deposit in the state treasury and credit to a separate account in the bond proceeds fund as received all proceeds of Minnesota water pollution control bonds, except accrued interest and premiums received upon the sale thereof. All money granted to the state for such purposes by the federal government or any agency thereof must be credited to a separate account in the federal fund. All such receipts are annually appropriated for the permanent construction and improvement purposes of the water pollution control program, and shall be and remain available for expenditure in accordance with this section and federal law until the purposes for which such appropriations were made have been accomplished or abandoned.\nDisbursements for the water pollution control program shall be made by the commissioner of management and budget at the times and in the amounts requested by the agency or the Minnesota Public Facilities Authority in accordance with the applicable state and federal law governing such disbursements; except that no appropriation or loan of state funds for any project shall be disbursed to any municipality until and unless the agency has by resolution determined the total estimated cost of the project, and ascertained that financing of the project is assured by:\n(1) a grant to the municipality by an agency of the federal government within the amount of funds then appropriated to that agency and allocated by it to projects within the state; or\n(2) a grant of funds appropriated by state law; or\n(3) a loan authorized by state law; or\n(4) the appropriation of proceeds of bonds or other funds of the municipality to a fund for the construction of the project; or\n(5) any or all of the means referred to in clauses (1) to (4); and\n(6) an irrevocable undertaking, by resolution of the governing body of the municipality, to use all funds so made available exclusively for the construction of the project, and to pay any additional amount by which the cost of the project exceeds the estimate, by the appropriation to the construction fund of additional municipal funds or the proceeds of additional bonds to be issued by the municipality; and\n(7) conformity of the project and of the loan or grant application with the state water pollution control plan as certified to the federal government and with all other conditions under applicable state and federal law for a grant of state or federal funds of the nature and in the amount involved.\n(a) The agency shall promulgate permanent rules for the administration of grants and loans authorized to be made under the water pollution control program, which rules, however, shall not be applicable to the issuance of bonds by the commissioner of management and budget as provided in section 116.17. The rules shall contain as a minimum:\n(1) procedures for application by municipalities;\n(2) conditions for the administration of the grant or loan;\n(3) criteria for the ranking of projects in order of priority for grants or loans, based on factors including the extent and nature of pollution, technological feasibility, assurance of proper operation, maintenance and replacement, and participation in multimunicipal systems; and\n(4) such other matters as the agency and the commissioner find necessary to the proper administration of the grant program.\n(b) The agency shall award the amount of additional priority points necessary to place a project in the fundable range of the intended use plan if the agency determines that the project would repair a facility that is an imminent threat to discharge untreated or partially treated sewage to the Boundary Waters Canoe Area Wilderness if it fails.\n(c) For purposes of awarding independent state grants, the agency may by rule waive the federal 20-year planning requirement for municipalities with a population of less than 1,500.\n[Repealed, 1984 c 597 s 55]\n[Repealed, 1984 c 597 s 55]\nEach loan made to a municipality from the proceeds of state bonds, when authorized by law, shall be evidenced by resolutions adopted by the agency and by the governing body of the municipality, obligating the municipality to repay the loan to the commissioner of management and budget, for credit to the water pollution control bond account in the state bond fund, in annual installments including both principal and interest, each in an amount sufficient to pay the principal amount within such period as may be provided by the agency in accordance with the law authorizing the loan, with interest on the declining balance thereof at a rate not less than the average annual interest rate on state bonds of the issue from the proceeds of which the loan was made, and obligating the municipality to provide money for such repayment from user charges, taxes, special assessments, or other funds available to it. For the purpose of repaying such loans the municipality by resolution of its governing body may undertake to fix rates and charges for disposal system service and enter into contracts for the payment by others of costs of construction, maintenance, and use of the project in accordance with section 444.075, and may pledge the revenues derived therefrom, and the agency may condition any such loans upon the establishment of rates and charges or the execution of contracts sufficient to produce the revenues pledged.\nApplications by municipalities for grants or loans under the water pollution control program shall be made to the authority on forms requiring information prescribed by rules of the agency. The authority shall send the application to the agency within ten days of receipt. The commissioner shall certify to the authority those applications which appear to meet the criteria set forth in sections 116.16 to 116.18 and the rules promulgated hereunder, and the authority shall award the grants or loans on the basis of the criteria and priorities established by the agency in its rules and in sections 116.16 to 116.18. A municipality that is designated under agency rules to receive state or federal funding for a project and that does not make a timely application for or that refuses the funding is not eligible for either state or federal funding for that project in that fiscal year or the subsequent year.\nA municipality awarded a final grant of funding for a project under the program established by the 1972 Federal Water Pollution Control Act amendments or the state independent grants program is not eligible for additional funding to replace that project under the federal program or the state program, unless the funding is necessary as a result of subsequent changes in state water quality standards, effluent limits, or technical design requirements, or for a municipality awarded the final grant before October 1, 1984, if the funding is necessary for the provision of increased capacity.\nTo the extent the agency administers or engages in activities necessary for administering any aspects of the Federal Water Pollution Control Act as amended, United States Code, title 33, section 1251 et seq., the agency may assess the costs of such administrative activities, in an amount not to exceed that allowed by federal law, against the federal construction grant funds allotted to the state.\nUpon certification by the commissioner of the Pollution Control Agency, the authority shall notify a municipality that is to receive a grant or loan and advise the municipality of the grant agreement or loan form or other document that must be executed to complete the grant or loan. Upon certification from the commissioner that the work has been completed and that payment is proper, the authority shall pay to the municipality the periodic grant or loan payment.\nA municipality that seeks an amendment to a previously awarded grant or loan shall follow the procedure in subdivision 9 for applying to the authority. The request for a grant or loan amendment must be forwarded by the authority to the commissioner of the Pollution Control Agency for consideration, and the authority shall process a grant or loan amendment that is approved by the commissioner.",
	"repealed": false
}