{
	"id": "181A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.10",
	"title": "181A.10 JUDICIAL REVIEW.",
	"text": "Any person who may be aggrieved by any administrative rule issued pursuant to section 181A.09 may obtain a review thereof in the district court for Ramsey County, by filing in such court a written petition for declaratory judgment praying that the rule be modified or set aside. A copy of such petition shall be served upon the department. The department's findings of fact, if any, shall be conclusive upon the court if supported by substantial evidence. The court shall determine whether the rule is in accordance with law.\nIf the court determines that such rule is not in accordance with law, it shall remand the case to the department with directions to modify or revoke such rule. If application is made to the court by any aggrieved party for leave to adduce additional evidence, such party shall show to the satisfaction of the court that such additional evidence is material and that there were reasonable grounds for the failure to adduce such evidence before the department. If the court finds that such evidence is material and that reasonable grounds exist for the failure to the aggrieved party to adduce such evidence in prior proceedings, the court may remand the case to the department with directions that such additional evidence be taken by the department. The department may modify its findings and conclusions, in whole or in part, by reason of such additional evidence.\nHearings in the district court on all appeals taken under subdivision 1 shall be privileged and take precedence over all matters, except matters of the same character. The jurisdiction of the court shall be exclusive and its judgment and decree shall be final except that the same shall be subject to review on appeal as in other civil cases.\nThe commencement of proceedings under subdivision 1 shall not, unless specifically ordered by the court, operate as a stay of an administrative rule issued pursuant to section 181A.09.",
	"repealed": false
}