{
	"id": "85.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.34",
	"title": "85.34 FORT SNELLING LEASE.",
	"text": "The commissioner of natural resources with the approval of the Executive Council may lease for purposes of restoration, preservation, historical, recreational, educational, and commercial use and development, that portion of Fort Snelling State Park known as the upper bluff consisting of officer's row, area J, the polo grounds, the adjacent golf course, and all buildings and improvements located thereon, all lying within an area bounded by Minneapolis-St. Paul International Airport, Trunk Highways numbered 5 and 55, and Bloomington Road. The lease or leases shall be in a form approved by the attorney general and for a term of not to exceed 99 years. The lease or leases may provide for the provision of capital improvements or other performance by the tenant or tenants in lieu of all or some of the payments of rent that would otherwise be required. Notwithstanding the continuing ownership of the upper bluff by the state, any lease of one or more buildings improved with state general obligation bond proceeds that exceeds 50 years shall be treated as a sale of the buildings for purposes of section 16A.695, subdivision 3. Any disposition proceeds payable to the commissioner upon execution of a lease relating to state-bond-financed buildings at the upper bluff shall be applied according to section 16A.695, subdivision 3, and used to pay, redeem, or defease state general obligation bonds issued for purposes of improving those buildings. Any lease revenues paid to the commissioner subsequent to the payment, redemption, or defeasance of state general obligation bonds shall be used by the commissioner as further described in this section.\nAdmission to the property leased pursuant to subdivision 1 shall be exempt from any state park permit or admission fees imposed pursuant to law.\nThe commissioner of public safety with the approval of the Executive Council may issue to the lessee or developer of the property leased pursuant to subdivision 1, an on-sale license for the sale of intoxicating liquor upon the leased property. The annual fee for the license issued pursuant to this subdivision shall be set by the commissioner of public safety at an amount comparable to the fee charged by municipalities in the surrounding area for a similar license. All provisions of chapter 340A shall apply to the sale of intoxicating liquor upon the leased property.\n[Repealed, 2004 c 255 s 51]\nThe commissioner of natural resources may provide an exception, in whole or in part, to the rules for use of state parks and other recreational areas for property leased pursuant to subdivision 1. The exception may be provided by commissioner's order and shall be effective for the term of the lease or such lesser period of time specified by the commissioner.\nA lease to the Minneapolis Park and Recreation Board for the purposes of athletic fields and golf course operations is subject to subdivisions 1 to 5, except as provided in this subdivision. Approval of the Executive Council is not required for the lease or the issuance of a liquor license. A lease of any portion of Officer's Row or Area J may include a charge to be paid by the tenant for repayment of a portion of the costs incurred by the Minneapolis Park and Recreation Board for the installation of a new water line on the upper bluff. The total amount to be repaid to the Minneapolis Park and Recreation Board by tenants of Officer's Row and Area J shall not exceed $450,000.\n(a) All revenue derived from the lease of the Fort Snelling upper bluff, with the exception of payment for costs of the water line as described in subdivision 6, shall be deposited in the natural resources fund and credited to a state park account. Interest earned on the money in the account accrues to the account.\n(b) Revenue and expenses from the upper bluff shall be tracked separately within the account. Money in the account derived from the leasing or operation of the property described in subdivision 1 is appropriated annually to the commissioner for the payment of expenses attributable to the leasing, development, and operation of the property described in subdivision 1, including, but not limited to, the maintenance, repair, and rehabilitation of historic buildings and landscapes.",
	"repealed": false
}