{
	"id": "473J.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.13",
	"title": "473J.13 STADIUM OPERATIONS; CAPITAL IMPROVEMENTS.",
	"text": "The stadium shall be operated in a first-class manner, similar to and consistent with other comparable NFL stadiums. The authority and the NFL team will mutually agree on a third-party management company or individual to manage the stadium and on certain major vendors to the stadium. The authority, with the approval of the NFL team, may enter into an agreement with a program manager for management of the stadium, for a maximum of 30 years.\n(a) The authority must pay or cause to be paid all operating expenses of the stadium. The authority must require in the lease or use agreement with the NFL team that the NFL team pay the authority, beginning January 1, 2016, or other date as mutually agreed upon by the parties, toward operating costs of the stadium, $8,500,000 each year, increased by a three percent annual inflation rate.\n(b) Beginning January 1, 2016, or other date as mutually agreed upon by the parties, and continuing through 2020, the state shall pay the authority operating expenses, $6,000,000 each year, increased by an annual adjustment factor. After 2020, the state shall assume this payment, using funds generated in accordance with the city of Minneapolis as specified under section 297A.994, subdivision 4, paragraph (a), clause (3).\n(c) The authority may establish an operating reserve to cover operating expense shortfalls and may accept funds from any source for deposit in the operating reserve. The establishment or funding of an authority operating reserve must not decrease the amounts required to be paid to the authority toward operating costs under this subdivision unless agreed to by the authority.\n(d) The authority will be responsible for operating cost overruns.\n(e) After the joint selection of the third-party manager or program manager, the authority may agree with a program manager or other third-party manager of the stadium on a fixed cost operating, management, or employment agreement with operating cost protections under which the program manager or third-party manager assumes responsibility for stadium operating costs and shortfalls. The agreement with the manager must require the manager to prepare an initial and ongoing operating plan and operating budgets for approval by the authority in consultation with the NFL team. The manager must agree to operate the stadium in accordance with the approved operating plan and operating budget.\nThe authority will work to maximize access for public and amateur sports, community, and civic events, and other public events in type and on terms consistent with those currently held at the existing football stadium, as defined in section 473.551, subdivision 9. The authority may provide that these events have exclusive use of the premises at agreed-upon times subject to the scheduling rights of the NFL team under the lease or use agreement.\n(a) The authority shall establish a capital reserve fund. The authority shall be responsible for making, or for causing others to make, all capital repairs, replacements, and improvements for the stadium and stadium infrastructure. The authority shall maintain, or cause others to maintain, the stadium and stadium infrastructure in a safe, clean, attractive, and first-class manner so as to cause them to remain in a condition comparable to that of other comparable NFL facilities of similar design and age. The authority shall make, or cause others to make, all necessary or appropriate repairs, renewals, and replacements, whether structural or nonstructural, interior or exterior, ordinary or extraordinary, foreseen or unforeseen, in a prompt and timely manner. In addition, the authority, with approval of the NFL team, may enter into an agreement with a program manager to perform some or all of the responsibilities of the authority in this subdivision and to assume and accept financial liability for the cost of performing the responsibilities.\n(b) The NFL team must contribute $1,500,000 each year, beginning in 2016 or as otherwise determined for the term of the lease or use agreement to the capital reserve fund, increased by a three percent annual inflation rate.\n(c) The state shall contribute $1,500,000 each year, beginning in 2016 or as otherwise determined for the term of the lease to the capital reserve fund. The contributions of the state are subject to increase by an annual adjustment factor.\n(d) The authority with input from the NFL team shall develop short-term and long-term capital funding plans and shall use those plans to guide the future capital needs of the stadium and stadium infrastructure. The authority shall make the final determination with respect to funding capital needs. Any capital improvement proposed by the NFL team intended primarily to provide revenue enhancements to the NFL team shall be paid for by the NFL team, unless otherwise agreed to with the authority.\n(e) The NFL team has authority to determine the design of a retractable roof feature for the stadium. The NFL team must cooperate with the authority in designing the feature to minimize any additional operating cost. The design must not result in a material marginal increase in the operating or capital costs of the stadium, considering current collections and reserves.\nIn addition to operating expense contributions of the NFL team under subdivision 2, the NFL team shall pay all NFL game day, NFL team-owned major league soccer, as provided in section 473J.15, subdivision 15, and other NFL team-sponsored event expenses within the stadium and stadium plaza areas.\nThe authority shall cooperate with the NFL team to facilitate the financing of the NFL team's contribution. Such agreement to cooperate shall not require the authority to incur any additional costs or provide conduit financing. The lease, license, and other transaction documents shall include provisions customarily required by lenders in stadium financings.",
	"repealed": false
}