{
	"id": "462.391",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.391",
	"title": "462.391 SPECIFIC POWERS AND DUTIES.",
	"text": "MS 1996 [Repealed, 1997 c 231 art 12 s 27]\nThe commission may review and provide comments and recommendations on local plans or development proposals which in the judgment of the commission have a substantial effect on regional development. Local units of government may request that a regional commission review, comment, and provide advisory recommendations on local plans or development proposals.\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nTo avoid duplication of staff for various regional bodies assisted by federal or state government, the commission may provide basic administrative, research, and planning services for all regional planning and development bodies. The commissions may contract to obtain or perform services with state agencies, for-profit or nonprofit entities, subdistricts organized as the result of federal or state programs, councils of governments organized under section 471.59, or any other law, and with local governments.\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nThe commission may be designated as a regional data center providing data collection, storage, analysis, and dissemination to be used by it and other governmental and private users, and may accept gifts or grants to provide this service.\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nWhere studies have not been otherwise authorized by law the commission may study the feasibility of programs including, but not limited to, water, land use, economic development, housing, demographics, cultural issues, governmental issues, human services, natural resources, communication, technology, transportation, and other subjects of concern to the citizens of the region, may institute demonstration projects in connection therewith, and may enter into contracts or accept gifts or grants for such purposes as otherwise authorized in sections 462.381 to 462.398.\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nMS 1996 [Repealed, 1997 c 231 art 12 s 27]\nThe commission may contract with local units of government to provide them with services and technical assistance in the conduct of local planning and development activities.\nUpon approval of the appropriate authority from local, state, and federal government units, commissions may be regarded as general purpose units of government to receive funds and operate programs on a regional or subregional basis to provide economies of scale or to enhance program efficiency.\nA commission may buy, lease, acquire, own, hold, improve, and use real or personal property or an interest in property, wherever located in the state for purposes of housing the administrative office of the regional commission.\nA commission may sell, convey, mortgage, create a security interest in, lease, exchange, transfer, or dispose of all or part of its real or personal property or an interest in property, wherever located in the state.",
	"repealed": false
}