{
	"id": "365.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/365.36",
	"title": "365.36 INVESTMENT OF CEMETERY FUND.",
	"text": "A cemetery's directors or, if none, the town board shall invest the principal of the cemetery fund in the kind of securities that the permanent school fund may be invested in. This section controls the investment of the principal of the fund.\nThe town board and the cemetery directors may require the county treasurer to withdraw money from the depository for investment under this section. The securities invested in must remain with the county treasurer. The bond of the county treasurer is security for the proper care of the securities. The bond is also security for the payment to the cemetery directors of interest earned by the securities and received by the treasurer. On receiving payments on the securities the county treasurer shall deposit the payments in the county depository. The county treasurer also shall collect the interest on money loaned from the fund. The county treasurer shall then pay the money received and collected to the directors of the cemetery when they ask for it. Annually the county treasurer shall pay the cemetery directors all interest on money received or collected on money deposited or invested under sections 365.29 to 365.36, and principal as directed by the town board.\nBefore March 2 each year the county treasurer shall make a report to the town board. The report must have a statement of all money received by the treasurer under sections 365.29 to 365.36 during the last calendar year. The statement must include:\n(1) the amount of money and the amount of securities in the permanent fund on the first day of the calendar year;\n(2) the amount of money paid into the fund during the year;\n(3) the amount of money invested in securities in the year;\n(4) the amount of money and the amount of securities in the fund at the end of the calendar year;\n(5) the amount of interest collected on the fund and turned over to the directors;\n(6) the amount of excess interest returned by the directors, deposited in the treasury, and added to the permanent fund; and\n(7) the amount of principal in the fund turned over to the directors at the direction of the town board.",
	"repealed": false
}