{
	"id": "559.209",
	"url": "https://www.revisor.mn.gov/statutes/cite/559.209",
	"title": "559.209 MEDIATION NOTICE AND CONDITIONS FOR AGRICULTURAL PROPERTY.",
	"text": "A person may not begin to terminate a contract for deed under section 559.21 to purchase agricultural property subject to sections 583.20 to 583.32 for a remaining balance on the contract of more than the amount provided in section 583.24, subdivision 5, unless: (1) a mediation notice is served on the contract for deed purchaser after a default has occurred under the contract and a copy served on the director and the contract for deed vendor and purchaser have completed mediation under sections 583.20 to 583.32; or (2) as otherwise allowed under sections 583.20 to 583.32.\nA mediation notice must contain the following notice with the blanks properly filled in.\n\"TO: ....(Name of Contract for Deed Purchaser)....\nYOU HAVE DEFAULTED ON THE CONTRACT FOR DEED OF THE AGRICULTURAL PROPERTY DESCRIBED AS ....(Size and Reasonable Location of Property, Not Legal Description). THE AMOUNT OF THE OUTSTANDING DEBT IS....(Amount of Debt)....\nAS THE CONTRACT FOR DEED VENDOR, ....(Contract for Deed Vendor).... INTENDS TO TERMINATE THE CONTRACT AND TAKE BACK THE PROPERTY.\nYOU HAVE THE RIGHT TO HAVE THE CONTRACT FOR DEED DEBT REVIEWED FOR MEDIATION. IF YOU REQUEST MEDIATION, A DEBT THAT IS IN DEFAULT WILL BE MEDIATED ONLY ONCE. IF YOU DO NOT REQUEST MEDIATION, THIS DEBT WILL NOT BE SUBJECT TO FUTURE MEDIATION IF THE CONTRACT FOR DEED VENDOR BEGINS REMEDIES TO ENFORCE THE DEBT.\nIF YOU PARTICIPATE IN MEDIATION, THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE WILL PROVIDE AN ORIENTATION MEETING AND A FINANCIAL ANALYST TO HELP YOU PREPARE FINANCIAL INFORMATION. IF YOU DECIDE TO PARTICIPATE IN MEDIATION, IT WILL BE TO YOUR ADVANTAGE TO ASSEMBLE YOUR FARM FINANCE AND OPERATION RECORDS AND TO CONTACT A COUNTY EXTENSION OFFICE AS SOON AS POSSIBLE. MEDIATION WILL ATTEMPT TO ARRIVE AT AN AGREEMENT FOR HANDLING FUTURE FINANCIAL RELATIONS.\nTO HAVE THE CONTRACT FOR DEED DEBT REVIEWED FOR MEDIATION YOU MUST FILE A MEDIATION REQUEST WITH THE DIRECTOR WITHIN 14 DAYS AFTER YOU RECEIVE THE NOTICE. THE MEDIATION REQUEST FORM IS AVAILABLE FROM THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE.\nFROM: ....(Name and Address of Contract for Deed Vendor)....\"",
	"repealed": false
}