{
	"id": "243.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.521",
	"title": "243.521 ADMINISTRATIVE AND DISCIPLINARY SEGREGATION.",
	"text": "In any adult correctional facility under the control of the commissioner of corrections, the commissioner may require an inmate to be placed on disciplinary segregation status for rule violations or on administrative segregation status when the continued presence of the inmate in general population would pose a serious threat to life, property, self, staff, or other inmates or to the security or orderly running of the institution. Inmates pending investigation for trial on a criminal act or pending transfer may be included, provided the warden's written approval is sought and granted within seven business days of placing the inmate in restrictive housing under this provision. The warden of each facility must document any time approval is granted and the reason for it, and submit a quarterly report to the commissioner of corrections.\nThe restrictive housing unit shall provide living conditions that are approximate to those offenders in general population, including reduced lighting during nighttime hours.\nThe commissioner of corrections shall receive notification of all inmates with consecutive placement in a restrictive housing setting for more than 30 days. This notification shall occur on a monthly basis. In the event an inmate is placed into restrictive housing for more than 120 days, the reason for the placement and the behavior management plan for the inmate shall be submitted to the commissioner of corrections.\nThe commissioner shall design and implement a continuum of interventions, including informal sanctions, administrative segregation, formal discipline, disciplinary segregation, and step-down management. The commissioner shall implement a method of due process for all offenders with formal discipline proceedings.\n(a) If it is apparent that the inmate is exhibiting serious symptoms of a mental illness that prevents the inmate from understanding or fully participating in the disciplinary process, a mental health professional shall be consulted regarding appropriate treatment and placement. For other inmates placed in a restrictive setting, an inmate shall be screened by a health services staff member within 24 hours of placement in a restrictive housing setting. If the screening indicates symptoms of a mental illness, a qualified mental health professional shall be consulted regarding appropriate treatment and placement. The health services staff member shall document any time an inmate screens in for symptoms of a mental health illness and whether or not the health services staff member connected with a mental health professional.\n(b) If mental health staff believe the inmate's behavior may be more appropriately treated through alternative interventions or programming, or determine that the inmate's actions were the result of mental illness, this information must be considered during the disciplinary process.\nA health services staff member shall perform a daily wellness round in the restrictive housing setting. If a health services staff member indicates symptoms of a mental illness, a qualified mental health professional shall be consulted regarding appropriate treatment and placement.\nThe commissioner shall design and implement a system of incentives so that an inmate who demonstrates appropriate behavior can earn additional privileges and an accelerated return to the general population.\nAn inmate shall not be released into the community directly from a stay in restrictive housing for 60 or more days absent a compelling reason. In cases where there is a compelling reason, the commissioner of corrections or deputy commissioner shall directly authorize the inmate's release into the community from restrictive housing.\n(a) By January 15, 2020, and by January 15 each year thereafter, the commissioner of corrections shall report to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over public safety and judiciary on the status of the implementation of the provisions in this section. This report shall include but not be limited to data regarding:\n(1) the number of inmates in each institution placed in restrictive housing during the past year;\n(2) the ages of inmates placed in restrictive housing during the past year;\n(3) the number of inmates transferred from restrictive housing to the mental health unit;\n(4) disciplinary sanctions by infraction;\n(5) the lengths of terms served in restrictive housing, including terms served consecutively; and\n(6) the number of inmates by race in restrictive housing.\n(b) The Department of Corrections shall submit a qualitative report detailing outcomes, measures, and challenges to implementation of a step-down management program by April 1, 2020.",
	"repealed": false
}