{
	"id": "168A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.05",
	"title": "168A.05 CERTIFICATE OF TITLE.",
	"text": "The department shall file each application received, and when satisfied as to its genuineness and regularity and that the applicant is entitled to the issuance of a certificate of title shall issue a certificate of title for the vehicle or manufactured home.\nIn the case of a manufactured home, the department shall not issue a certificate of title unless the application under section 168A.04 is accompanied with a statement from the county auditor or county treasurer where the manufactured home is presently located, stating that all manufactured home personal property taxes levied on the unit in the name of the current owner at the time of transfer have been paid. For this purpose, manufactured home personal property taxes are treated as levied on January 1 of the payable year.\nThe provisions of subdivision 1a do not apply to:\n(1) a manufactured home which is sold or otherwise disposed of pursuant to section 504B.271 by the owner of a manufactured home park, as defined in section 327.14, subdivision 3;\n(2) a manufactured home which is sold pursuant to section 504B.265 by the owner of a manufactured home park; or\n(3) a manufactured home for which a certificate of title is reissued under section 168A.142.\nThe provisions of subdivision 1a do not apply if title is to be transferred to an owner of a manufactured home park as defined in section 327.14, subdivision 3, who provides to the county auditor or treasurer a notarized statement that the manufactured home is to be destroyed or moved to a site and destroyed.\n(a) The department shall maintain a record of all certificates of title issued by it:\n(1) under a distinctive title number assigned to the vehicle;\n(2) by vehicle identifying number;\n(3) alphabetically, under the name of the owner.\n(b) Such record shall consist of the certificate of title, including the notations of all security interests recorded, assigned, terminated, or released and liens filed pursuant to a court order or by a public authority responsible for child support enforcement of which the department has notice, of duplicate certificates issued or applied for, and such other information as the department may deem proper.\n(a) Each certificate of title issued by the department must contain:\n(1) the date issued;\n(2) the first, middle, and last names and the dates of birth of all owners who are natural persons, and the full names of all other owners;\n(3) the residence address of the owner listed first if that owner is a natural person or the address if that owner is not a natural person;\n(4) the names of any secured parties, and the address of the first secured party, listed in the order of priority (i) as shown on the application, or (ii) if the application is based on a certificate of title, as shown on the certificate, or (iii) as otherwise determined by the department;\n(5) any liens filed pursuant to a court order or by a public agency responsible for child support enforcement against the owner;\n(6) the title number assigned to the vehicle;\n(7) a description of the vehicle including, so far as the following data exists, its make, model, year, identifying number, type of body, whether new or used, and if a new vehicle, the date of the first sale of the vehicle for use;\n(8) with respect to a motor vehicle subject to section 325E.15, (i) the true cumulative mileage registered on the odometer or (ii) that the actual mileage is unknown if the odometer reading is known by the owner to be different from the true mileage;\n(9) if applicable, one or more of the following:\n(i) with respect to a vehicle subject to sections 168A.151 and 325F.6642, the appropriate brand \"flood damaged,\" \"salvage,\" \"prior salvage,\" or \"reconstructed\";\n(ii) with respect to a vehicle contaminated by methamphetamine production, if the registrar has received the certificate of title and notice described in section 152.0275, subdivision 2, paragraph (g), the brand \"hazardous waste contaminated vehicle\"; and\n(iii) with respect to a vehicle subject to section 325F.665, the brand \"lemon law vehicle\"; and\n(10) any other data the department prescribes.\n(b) For a certificate of title on a vehicle that is a restored pioneer vehicle:\n(1) the identifying number must be the valid identifying number as provided under section 168A.04, subdivision 5;\n(2) the year of the vehicle must be the year of original vehicle manufacture and not the year of restoration; and\n(3) the title must not bear a \"reconstructed vehicle\" brand.\nUnless a bond is filed as provided in section 168A.07, subdivision 1, clause (2), a distinctive certificate of title shall be issued for a vehicle last previously registered in another state or country, the laws of which do not require that secured parties be named on a certificate of title to perfect their security interests. The certificate shall contain the legend \"This vehicle may be subject to an undisclosed lien\" and may contain any other information the department prescribes. If no notice of a security interest in the vehicle is received by the department within four months from the issuance of the distinctive certificate of title, it shall, upon application and surrender of the distinctive certificate, issue a certificate of title in ordinary form.\n(a) The certificate of title shall contain forms:\n(1) for assignment and warranty of title by the owner;\n(2) for assignment and warranty of title by a dealer;\n(3) to apply for a certificate of title by a transferee;\n(4) to name a secured party; and\n(5) to make the disclosure required by section 325F.6641.\n(b) The certificate of title must also include a separate detachable form entitled \"Notice of Sale\" that contains, but is not limited to, the vehicle's title number and vehicle identification number. The form must include sufficient space for the owner to record the purchaser's name, address, and driver's license number, if any, and the date of sale. The notice of sale must include clear instructions regarding the owner's responsibility to complete and return the form, or to transmit the required information electronically in a form acceptable to the commissioner, pursuant to section 168A.10, subdivision 1.\nMS 2006 [Repealed, 2008 c 287 art 1 s 126]\nA certificate of title issued by the department is prima facie evidence of the facts appearing on it.\nA certificate of title for a vehicle is not subject to garnishment, attachment, execution, or other judicial process, but this subdivision does not prevent a lawful levy upon the vehicle or the lawful enforcement of an administrative lien or judgment debt or lien filed pursuant to a court order or by a public authority responsible for child support enforcement.\nThis subdivision applies if the court or a public authority responsible for child support enforcement orders or directs the commissioner to enter a lien, as provided in section 518A.67. If a certificate of title is applied for by the owner, the department shall enter a lien on the title in the name of the state of Minnesota or in the name of the obligee in accordance with the notice if the value of the motor vehicle determined in accordance with either the definitions of section 297B.01, subdivision 14, or the retail value described in the N.A.D.A. Official Used Car Guide, Midwest Edition, for the current year exceeds the exemption allowed in section 550.37. The lien on the title is subordinate to any bona fide purchase money security interest under section 336.9-103 regardless of when the purchase money security interest is perfected. With respect to all other security interests, the lien is perfected as of the date entered on the title.\nNeighborhood electric vehicles and medium-speed electric vehicles, as defined in section 169.011, subdivisions 39 and 47, must be titled as specified in section 168A.02. The department shall not issue a title for a neighborhood electric vehicle or a medium-speed electric vehicle (1) that lacks a vehicle identification number, and (2) for which a manufacturer's certificate of origin clearly labeling the vehicle as a neighborhood electric vehicle or similar designation has not been issued. The department shall not issue a vehicle identification number to a homemade neighborhood electric or low-speed vehicle or retrofitted golf cart, and such vehicles do not qualify as neighborhood electric vehicles.",
	"repealed": false
}