{
	"id": "142D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.30",
	"title": "142D.30 RETAINING EARLY EDUCATORS THROUGH ATTAINING INCENTIVES NOW (REETAIN) GRANT PROGRAM.",
	"text": "The retaining early educators through attaining incentives now (REETAIN) grant program is established to provide competitive grants to incentivize well-trained child care professionals to remain in the workforce. The overall goal of the REETAIN grant program is to create more consistent care for children over time.\nThe commissioner shall administer the REETAIN grant program through a grant to a nonprofit with the demonstrated ability to manage benefit programs for child care professionals. Up to ten percent of grant money may be used for administration of the grant program.\nApplicants must apply for the REETAIN grant program using the forms and according to timelines established by the commissioner.\n(a) To be eligible for a grant, an applicant must:\n(1) be licensed to provide child care or work for a licensed child care program;\n(2) work directly with children at least 30 hours per week;\n(3) have worked in the applicant's current position for at least 12 months;\n(4) agree to work in the early childhood care and education field for at least 12 months upon receiving a grant under this section;\n(5) have a career lattice step of five or higher;\n(6) have a current membership with the Minnesota quality improvement and registry tool;\n(7) not be a current teacher education and compensation helps scholarship recipient; and\n(8) meet any other requirements determined by the commissioner.\n(b) Grant recipients must sign a contract agreeing to remain in the early childhood care and education field for 12 months.\nGrant awards must be made annually and may be made up to an amount per recipient determined by the commissioner. Grant recipients may use grant money for program supplies, training, or personal expenses.\nBy January 1 each year, the commissioner must report to the legislative committees with jurisdiction over child care about the number of grants awarded to recipients and outcomes of the grant program since the last report.",
	"repealed": false
}