{
	"id": "216D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/216D.01",
	"title": "216D.01 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 216D.01 to 216D.07.\n\"Commissioner\" means the commissioner of public safety.\n\"Boundary survey\" means a survey made to establish or to reestablish a boundary line on the ground or to obtain data for preparing a map or plat showing boundary lines.\n\"Damage\" means:\n(1) the substantial weakening of structural or lateral support of an underground facility;\n(2) penetration, impairment, or destruction of any underground protective coating, housing, or other protective device; or\n(3) impact with or the partial or complete severance of an underground facility to the extent that the facility operator determines that repairs are required.\n\"Emergency\" means a condition that poses a clear and immediate danger to life or health, or a significant loss of property.\n\"Emergency responder\" means a fire department or company, a law enforcement official or office, an ambulance or other emergency rescue service, or the Division of Emergency Management created by section 12.04, subdivision 1.\n\"Excavation\" means an activity that moves, removes, or otherwise disturbs the soil by use of a motor, engine, hydraulic or pneumatically powered tool, or machine-powered equipment of any kind, or by explosives. Excavation does not include:\n(1) the extraction of minerals;\n(2) the opening of a grave in a cemetery;\n(3) normal maintenance of roads and streets if the maintenance does not change the original grade and does not involve the road ditch;\n(4) plowing, cultivating, planting, harvesting, and similar operations in connection with growing crops, trees, and shrubs, unless any of these activities disturbs the soil to a depth of 18 inches or more;\n(5) gardening unless it disturbs the soil to a depth of 12 inches or more; or\n(6) planting of windbreaks, shelterbelts, and tree plantations, unless any of these activities disturbs the soil to a depth of 18 inches or more.\n\"Excavator\" means a person who conducts excavation in the state.\n\"Land surveyor\" means a person licensed to practice land surveying under sections 326.02 to 326.15.\n\"Local governmental unit\" means a county, town, or statutory or home rule charter city.\n\"Locate\" means an operator's markings of an underground facility.\n\"Locate period\" means:\n(1) the period among the following that ends farthest from now:\n(i) the 48-hour period beginning at 12:01 a.m. on the day after a locate request is submitted to the notification center, excluding any Saturday, Sunday, or holiday; or\n(ii) the period between the date of submission of a locate request to the notification center and the identified date and time of excavation; or\n(2) if applicable, and notwithstanding clause (1), a period of time that is mutually agreed to between the excavator and operator, as specified in written documentation provided to the notification center.\n\"Notification center\" means a center that receives notice from excavators of planned excavation or other requests for location and transmits this notice to participating operators.\n\"On-site meet\" means meeting at the site of a proposed excavation requested at the time of notice by the excavator with all affected underground facility operators to further clarify the precise geographic location of excavation, schedule the locating, propose future contacts, and share other information concerning the excavation and facilities.\n\"Operator\" means a person who owns or operates an underground facility. A person is not considered an operator solely because the person is an owner or tenant of real property where underground facilities are located if the underground facilities are used exclusively to furnish services or commodities on that property, unless the person is the state, a state agency, or a local governmental unit.\n\"Person\" means the state, a public agency, a local governmental unit, an individual, corporation, partnership, association, or other business or public entity or a trustee, receiver, assignee, or personal representative of any of them.\n\"Underground facility\" means an underground line, facility, system, and its appurtenances used to produce, store, convey, transmit, or distribute communications, data, electricity, power, heat, gas, oil, petroleum products, water including stormwater, steam, sewage, and other similar substances.\n\"Utility quality level\" means a professional opinion about the quality and reliability of utility information. There are four levels of utility quality information, ranging from the most precise and reliable, level A, to the least precise and reliable, level D. The utility quality level must be determined in accordance with guidelines established by the Construction Institute of the American Society of Civil Engineers in the document entitled \"Standard Guideline for Investigating and Documenting Existing Utilities,\" ASCE/UESI/CI 38-22, or in a successor document.",
	"repealed": false
}