{
	"id": "53.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.05",
	"title": "53.05 POWERS, LIMITATION.",
	"text": "No industrial loan and thrift company may do any of the following:\n(1) carry demand banking accounts; use the word \"savings\" unless the institution's investment certificates, savings accounts, and savings deposits are insured by the Federal Deposit Insurance Corporation and then only if the word is not followed by the words \"and loan\" in its corporate name; use the word \"bank\" or \"banking\" in its corporate name; operate as a savings bank;\n(2) have outstanding at any one time certificates of indebtedness, savings accounts, and savings deposits 30 times the sum of capital stock and surplus of the company;\n(3) accept trusts, except as provided in section 47.75, subdivision 1, or act as guardian, administrator, or judicial trustee in any form;\n(4) deposit any of its funds in any banking corporation, unless that corporation has been designated by vote of a majority of directors or of the executive committee present at a meeting duly called, at which a quorum was in attendance;\n(5) change any allocation of capital made pursuant to section 53.03 or reduce or withdraw in any way any portion of the capital stock and surplus without prior written approval of the commissioner of commerce;\n(6) take any instrument in which blanks are left to be filled in after execution;\n(7) lend money in excess of 20 percent of the total of its capital stock and surplus at all its authorized locations to a person primarily liable. Companies not issuing investment certificates of indebtedness under section 53.04 need not comply with the requirement if the amount of money lent does not exceed $100,000 of principal as defined by section 47.59, subdivision 1, paragraph (p).\nHowever, industrial loan and thrift companies with deposit liabilities must comply with the provisions of section 48.24; or\n(8) issue cashier's checks pursuant to section 48.151, unless and at all times the aggregate liability to all creditors on these instruments is protected by a special fund in cash or due from banks to be used solely for payment of the cashier's checks.",
	"repealed": false
}