{
	"id": "590.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/590.02",
	"title": "590.02 PETITION; FILING; SERVICE; COSTS.",
	"text": "The petition filed in the district court pursuant to section 590.01 shall be entitled in the name of the petitioner versus the state of Minnesota and shall contain:\n(1) a statement of the facts and the grounds upon which the petition is based and the relief desired. All grounds for relief must be stated in the petition or any amendment thereof unless they could not reasonably have been set forth therein. It shall not contain argument or citation of authorities;\n(2) an identification of the proceedings in which the petitioner was convicted including the date of the entry of judgment and sentence or other disposition complained of;\n(3) an identification of any previous proceeding, together with the grounds therein asserted taken on behalf of the petitioner to secure relief from the conviction and sentence or other disposition;\n(4) the name and address of any attorney representing the petitioner. In the event the petitioner is without counsel, the court administrator shall forthwith transmit a copy of the petition to the state public defender and shall advise the petitioner of such referral.\nThe filing of the petition and any document subsequent thereto and all proceedings thereon shall be without costs or any fees charged to the petitioner.\nWhen a petition is filed pursuant to section 590.01 it shall be signed by the petitioner or signed by the petitioner's attorney with proof of service on the attorney general and county attorney. It shall be addressed to the district court of the judicial district in the county where the conviction took place.\nIn those cases in which the petitioner is represented by counsel or in which the petitioner has filed a written waiver of right to counsel, the court administrator of the district court shall immediately direct attention of the filing thereof to the chief judge or judge acting in the chief judge's behalf who shall promptly assign the matter to a judge in said district.",
	"repealed": false
}