{
	"id": "214.104",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.104",
	"title": "214.104 HEALTH-RELATED LICENSING BOARDS; SUBSTANTIATED MALTREATMENT.",
	"text": "(a) A health-related licensing board shall make determinations as to whether regulated persons who are under the board's jurisdiction should be the subject of disciplinary or corrective action because of substantiated maltreatment under section 626.557 or chapter 260E. The board shall make a determination upon receipt, and after the review, of an investigation memorandum or other notice of substantiated maltreatment under section 626.557, chapter 260E, or of a notice from the commissioner of human services that a background study of a regulated person shows substantiated maltreatment.\n(b) Upon completion of its review of a report of substantiated maltreatment, the board shall notify the commissioner of human services of its determination. The board shall notify the commissioner of human services if, following a review of the report of substantiated maltreatment, the board determines that it does not have jurisdiction in the matter and the commissioner shall make the appropriate disqualification decision regarding the regulated person as otherwise provided in chapter 245C. The board shall also notify the commissioner of health or the commissioner of human services immediately upon receipt of knowledge of a facility or program allowing a regulated person to provide direct contact services at the facility or program while not complying with requirements placed on the regulated person.\n(c) In addition to any other remedy provided by law, the board may, through its designated board member, temporarily suspend the license of a licensee; deny a credential to an applicant; or require the regulated person to be continuously supervised, if the board finds there is probable cause to believe the regulated person referred to the board according to paragraph (a) poses an immediate risk of harm to vulnerable persons. The board shall consider all relevant information available, which may include but is not limited to:\n(1) the extent the action is needed to protect persons receiving services or the public;\n(2) the recency of the maltreatment;\n(3) the number of incidents of maltreatment;\n(4) the intrusiveness or violence of the maltreatment; and\n(5) the vulnerability of the victim of maltreatment.\nThe action shall take effect upon written notice to the regulated person, served by certified mail, specifying the statute violated. The board shall notify the commissioner of health or the commissioner of human services of the suspension or denial of a credential. The action shall remain in effect until the board issues a temporary stay or a final order in the matter after a hearing or upon agreement between the board and the regulated person. At the time the board issues the notice, the regulated person shall inform the board of all settings in which the regulated person is employed or practices. The board shall inform all known employment and practice settings of the board action and schedule a disciplinary hearing to be held under chapter 14. The board shall provide the regulated person with at least 30 days' notice of the hearing, unless the parties agree to a hearing date that provides less than 30 days' notice, and shall schedule the hearing to begin no later than 90 days after issuance of the notice of hearing.",
	"repealed": false
}