{
	"id": "609.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.14",
	"title": "609.14 REVOCATION OF STAY.",
	"text": "(a) When it appears that the defendant has violated any of the conditions of probation or intermediate sanction, or has otherwise been guilty of misconduct that warrants the adjudication of guilt, or imposition or execution of sentence, the court may without notice revoke the stay and direct that the defendant be taken into immediate custody. Revocation shall only be used as a last resort when rehabilitation has failed.\n(b) When it appears that the defendant violated any of the conditions of probation during the term of the stay, but the term of the stay has since expired, the defendant's probation officer or the prosecutor may ask the court to initiate probation revocation proceedings under the Rules of Criminal Procedure at any time within six months after the expiration of the stay. The court also may initiate proceedings under these circumstances on its own motion. If proceedings are initiated within this six-month period, the court may conduct a revocation hearing and take any action authorized under rule 27.04 at any time during or after the six-month period.\n(c) Notwithstanding the provisions of section 609.135 or any law to the contrary, after proceedings to revoke the stay have been initiated by a court order revoking the stay and directing either that the defendant be taken into custody or that a summons be issued in accordance with paragraph (a), the proceedings to revoke the stay may be concluded and the summary hearing provided by subdivision 2 may be conducted after the expiration of the stay or after the six-month period set forth in paragraph (b). The proceedings to revoke the stay shall not be dismissed on the basis that the summary hearing is conducted after the term of the stay or after the six-month period. The ability or inability to locate or apprehend the defendant prior to the expiration of the stay or during or after the six-month period shall not preclude the court from conducting the summary hearing unless the defendant demonstrates that the delay was purposefully caused by the state in order to gain an unfair advantage.\n(a) Correctional treatment is better provided through a community resource than through confinement and would not unduly depreciate the seriousness of the violation if probation was not revoked. Policies favoring probation outweigh the need for confinement if a person has not previously violated a condition of probation or intermediate sanction in an open criminal case and does any of the following in violation of a condition imposed by the court:\n(1) fails to abstain from the use of controlled substances without a valid prescription, unless the person is under supervision for a violation of section:\n(i) 169A.20;\n(ii) 609.2112, subdivision 1, paragraph (a), clauses (2) to (6); or\n(iii) 609.2113, subdivision 1, clauses (2) to (6); 2, clauses (2) to (6); or 3, clauses (2) to (6);\n(2) fails to abstain from the use of alcohol, unless the person is under supervision for a violation of section:\n(i) 169A.20;\n(ii) 609.2112, subdivision 1, paragraph (a), clauses (2) to (6); or\n(iii) 609.2113, subdivision 1, clauses (2) to (6); 2, clauses (2) to (6); or 3, clauses (2) to (6);\n(3) possesses drug paraphernalia in violation of section 152.092;\n(4) fails to obtain or maintain employment;\n(5) fails to pursue a course of study or vocational training;\n(6) fails to report a change in employment, unless the person is prohibited from having contact with minors and the employment would involve such contact;\n(7) violates a curfew;\n(8) fails to report contact with a law enforcement agency, unless the person was charged with a misdemeanor, gross misdemeanor, or felony; or\n(9) commits any offense for which the penalty is a petty misdemeanor.\n(b) A violation by a person described in paragraph (a) does not warrant the imposition or execution of sentence and the court may not direct that the person be taken into immediate custody unless the court receives a written report, signed under penalty of perjury pursuant to section 358.116, showing probable cause to believe the person violated probation and establishing by a preponderance of the evidence that the continued presence of the person in the community would present a risk to public safety. If the court does not direct that the person be taken into custody, the court may request a supplemental report from the supervising agent containing:\n(1) the specific nature of the violation;\n(2) the response of the person under supervision to the violation, if any; and\n(3) the actions the supervising agent has taken or will take to address the violation.\nThe defendant shall thereupon be notified in writing and in such manner as the court directs of the grounds alleged to exist for revocation of the stay. If such grounds are brought in issue by the defendant, a summary hearing shall be held thereon at which the defendant is entitled to be heard and to be represented by counsel.\n(a) A probation agent must present the court with local options to address and correct the violation including, but not limited to, inpatient chemical dependency treatment when the defendant at a summary hearing provided by subdivision 2 is:\n(1) a nonviolent controlled substance offender;\n(2) subject to supervised probation;\n(3) appearing based on a technical violation; and\n(4) admitting or found to have violated any of the conditions of probation.\n(b) For purposes of this subdivision, \"nonviolent controlled substance offender\" is a person who meets the criteria described under section 244.0513, subdivision 2, clauses (1), (2), and (5), and \"technical violation\" has the meaning given in section 244.195, subdivision 15.\nIf any of such grounds are found to exist the court may:\n(1) if imposition of sentence was previously stayed, again stay sentence or impose sentence and stay the execution thereof, and in either event place the defendant on probation or order intermediate sanctions pursuant to section 609.135, or impose sentence and order execution thereof;\n(2) if sentence was previously imposed and execution thereof stayed, continue such stay and place the defendant on probation or order intermediate sanctions in accordance with the provisions of section 609.135, or order execution of the sentence previously imposed; or\n(3) if adjudication was stayed or prosecution was deferred, continue the stay without intermediate sanctions, continue it with intermediate sanctions, or adjudicate guilt and proceed as otherwise provided, including, in the event of a felony conviction, as provided in section 244.10.\nIf none of such grounds are found to exist, the defendant shall be restored to liberty under the previous order of the court.\nFor the purposes of this section, \"stay\" means a stay of adjudication, a stay of imposition, a stay of execution, or a deferred prosecution.",
	"repealed": false
}