{
	"id": "174.186",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.186",
	"title": "174.186 DISADVANTAGED BUSINESS ENTERPRISE COLLABORATIVE.",
	"text": "(a) The commissioner of transportation shall convene regular meetings of the disadvantaged business enterprise program and workforce inclusion collaborative, as constituted by the commissioner as of January 1, 2010.\n(b) The collaborative shall review and evaluate the commissioner's implementation of the disadvantaged business enterprise program, under Code of Federal Regulations, title 49, and recommend changes, including possible legislation, to improve the effectiveness of the program in this state. At a minimum, the collaborative shall review, evaluate, and recommend program changes where necessary in the following areas:\n(1) an on-the-job training program to increase the diversity of the workforce on projects;\n(2) on-the-job trainee tracking and retention;\n(3) a mentor and protégé program for small, disadvantaged business entrepreneurs;\n(4) requirements for participation of disadvantaged business enterprises at the time of letting bids for contracts;\n(5) a coordinated access point to recruit disadvantaged business enterprises and a diverse workforce;\n(6) objective measures for good-faith efforts to recruit disadvantaged business enterprises;\n(7) a working capital fund for small disadvantaged business enterprises;\n(8) increased transparency for results in the on-the-job training and disadvantaged business enterprise programs;\n(9) civil rights program training;\n(10) a targeted group business program for state-funded projects; and\n(11) coding systems and dual goals for women and people of color.\n(c) The commissioner shall provide staff and administrative support for the collaborative and shall establish policies and procedures for the collaborative, including quorum requirements and majority decision making.\n(d) The representatives of the Department of Transportation with responsibility for civil rights and contracting shall participate in collaborative meetings and deliberations.\n(e) Members of the collaborative do not receive compensation or reimbursement of expenses.\nThe collaborative shall develop recommendations to the commissioner and to the legislature designed to implement fully the federal Disadvantaged Business Enterprise program in this state and to improve the effectiveness of the program. These recommendations, including any draft legislation if the collaborative decides to recommend legislation, may include, but are not limited to, strategies, policies, and actions focused on:\n(1) requiring bid proposals to include information on disadvantaged business enterprise participation;\n(2) defining and implementing appropriate accountability measures when disadvantaged business enterprise contract goals are not met in accordance with Code of Federal Regulations, title 49;\n(3) sponsoring disadvantaged business enterprise training and development workshops; and\n(4) strengthening the content and frequency of department reporting requirements relating to the disadvantaged business enterprise program.",
	"repealed": false
}