{
	"id": "47.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.015",
	"title": "47.015 CLOSING ON CERTAIN DAYS.",
	"text": "As used in this section the term \"financial institution\" shall include banks, trust companies, banks and trust companies, savings banks, industrial loan and thrift companies having outstanding certificates of indebtedness for investment, savings associations, national banking associations, Federal Reserve banks, federal savings associations, and federal savings banks doing business in this state, and includes any branch or detached facility of any of them.\nAny financial institution in the state may remain closed on any Monday next following a Sunday on which falls a holiday designated by any law of this state and on any Saturday next following a Friday holiday or preceding a Sunday or Monday holiday. Any such Saturday or any such Monday on which any financial institution remains closed is a holiday and not a business day with respect to that institution. Any act which by law or contract may be performed on any such Saturday or any such Monday, at, by, or with respect to any such financial institution remaining closed on such day may be performed on the next succeeding regular business day. No liability or loss of rights on the part of any person or financial institution shall result from such closing.\nAny financial institution in the state may remain open for the transaction of business on any such Monday or on any holiday designated by any law of this state, and on any such day any financial institution in this state may accept, certify or pay checks, drafts or other instruments, may charge the same against the accounts of customers, and may receive payment of notes, drafts and other instruments, all to the same extent and with the same legal effect as if such day were a regular business day, but nothing herein contained shall affect the due date of any time instrument.\nA financial institution may close for up to three hours on Good Friday. The financial institution shall post on its premises a written notice of the closing.\nA financial institution may close at noon on December 24 or on December 31. The financial institution shall post on its premises a written notice of the closing.",
	"repealed": false
}