{
	"id": "473F.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/473F.06",
	"title": "473F.06 INCREASE IN NET TAX CAPACITY.",
	"text": "On or before July 15 of each year, the auditor of each county in the area shall determine the amount, if any, by which the net tax capacity determined in the preceding year under section 473F.05, of commercial-industrial property subject to taxation within each municipality in the auditor's county exceeds the net tax capacity in 1971 of commercial-industrial property subject to taxation within that municipality. If a municipality is located in two or more counties within the area, the auditors of those counties shall certify the data required by section 473F.05 to the county auditor who is responsible under other provisions of law for allocating the levies of that municipality between or among the affected counties. That county auditor shall determine the amount of the net excess, if any, for the municipality under this section, and certify that amount under section 473F.07. Notwithstanding any other provision of sections 473F.01 to 473F.13 to the contrary, in the case of a municipality which is designated on July 24, 1971, as a redevelopment area under section 401(a)(4) of the Public Works and Economic Development Act of 1965, Public Law 89-136, the increase in its net tax capacity of commercial-industrial property for purposes of this section shall be determined in each year by using as a base the net tax capacity of commercial-industrial property in that municipality in the 1989 assessment year, rather than the net tax capacity of such property in 1971. The increase in total net tax capacity determined by this section shall be reduced by the amount of any decreases in net tax capacity of commercial-industrial property resulting from any court decisions, court related stipulation agreements, or abatements for a prior year, and only in the amount of such decreases made during the 12-month period ending on May 1 of the current assessment year, where such decreases, if originally reflected in the determination of a prior year's net tax capacity under section 473F.05, would have resulted in a smaller contribution from the municipality in that year. An adjustment for such decreases shall be made only if the municipality made a contribution in a prior year based on the higher net tax capacity of the commercial-industrial property.",
	"repealed": false
}