{
	"id": "148.9075",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9075",
	"title": "148.9075 EXEMPTIONS TO LICENSE REQUIREMENT.",
	"text": "(a) Nothing in sections 148.88 to 148.98 shall prevent members of other professions or occupations from performing functions for which they are competent and properly authorized by law. The following individuals are exempt from the licensure requirements of the Minnesota Psychology Practice Act, provided they operate in compliance with the stated exemption:\n(1) individuals licensed by a health-related licensing board as defined under section 214.01, subdivision 2, or by the commissioner of health;\n(2) individuals authorized as mental health practitioners as defined under section 245.462, subdivision 17; and\n(3) individuals authorized as mental health professionals under section 245.462, subdivision 18.\n(b) Any of these individuals must not hold themselves out to the public by any title or description stating or implying they are licensed to engage in the practice of psychology unless they are licensed under sections 148.88 to 148.98 or are using a title in compliance with section 148.96.\nNothing in sections 148.88 to 148.98 shall prevent the use of psychological techniques by a business or industrial organization for its own personnel purposes or by an employment agency or state vocational rehabilitation agency for the evaluation of the agency's clients prior to a recommendation for employment. However, a representative of an industrial or business firm or corporation may not sell, offer, or provide psychological services as specified in section 148.89, unless the services are performed or supervised by an individual licensed under sections 148.88 to 148.98.\n(a) Nothing in sections 148.88 to 148.98 shall be construed to prevent a person who holds a license or certificate issued by the Professional Educator Licensing and Standards Board in accordance with chapters 122A and 129 from practicing school psychology within the scope of employment if authorized by a board of education or by a private school that meets the standards prescribed by the Professional Educator Licensing and Standards Board, or from practicing as a school psychologist within the scope of employment in a program for children with disabilities.\n(b) Any person exempted under this subdivision shall not offer psychological services to any other individual, organization, or group for remuneration, monetary or otherwise, unless the person is licensed by the Board of Psychology under sections 148.88 to 148.98.\nNothing in sections 148.88 to 148.98 shall be construed to prevent recognized religious officials, including ministers, priests, rabbis, imams, Christian Science practitioners, and other persons recognized by the board, from conducting counseling activities that are within the scope of the performance of their regular recognizable religious denomination or sect, as defined in current federal tax regulations, if the religious official does not refer to the official's self as a psychologist and the official remains accountable to the established authority of the religious denomination or sect.\nNothing in sections 148.88 to 148.98 shall be construed to prevent a person employed in a secondary, postsecondary, or graduate institution from teaching and conducting research in psychology within an educational institution that is recognized by a regional accrediting organization or by a federal, state, county, or local government institution, agency, or research facility, so long as:\n(1) the institution, agency, or facility provides appropriate oversight mechanisms to ensure public protections; and\n(2) the person is not providing direct clinical services to a client or clients as defined in sections 148.88 to 148.98.\nNothing in sections 148.88 to 148.98 shall be construed to prevent a psychologist sent to this state for the sole purpose of responding to a disaster or emergency relief effort of the state government, the federal government, the American Red Cross, or other disaster or emergency relief organization as long as the psychologist is not practicing in Minnesota longer than 30 days and the sponsoring organization can certify the psychologist's assignment to this state. The board or its designee, at its discretion, may grant an extension to the 30-day time limitation of this subdivision.\nA license under sections 148.88 to 148.98 is not required by a nonresident of the state, serving as an expert witness, organizational consultant, presenter, or educator on a limited basis provided the person is appropriately trained, educated, or has been issued a license, certificate, or registration by another jurisdiction.\nNothing in sections 148.88 to 148.98 shall prohibit the practice of psychology under qualified supervision by a practicum psychology student, a predoctoral psychology intern, or an individual who has earned a doctoral degree in psychology and is in the process of completing their postdoctoral supervised psychological employment. A student trainee or intern shall use the titles as required under section 148.96, subdivision 3.\nNothing in sections 148.88 to 148.98 shall be construed to authorize a person licensed under sections 148.88 to 148.98 to engage in the practice of any profession regulated under Minnesota law, unless the individual is duly licensed or registered in that profession.",
	"repealed": false
}