{
	"id": "79.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.34",
	"title": "79.34 CREATION OF REINSURANCE ASSOCIATION.",
	"text": "The nonprofit association known as the Workers' Compensation Reinsurance Association may be incorporated under chapter 317A with all the powers of a corporation formed under that chapter, except that if the provisions of that chapter are inconsistent with sections 79.34 to 79.40, sections 79.34 to 79.40 govern. Each insurer as defined by section 79.01, subdivision 2, shall, as a condition of its authority to transact workers' compensation insurance in this state, be a member of the reinsurance association and is bound by the plan of operation of the reinsurance association; provided, that all affiliated insurers within a holding company system as defined in chapter 60D are considered a single entity for purposes of the exercise of all rights and duties of membership in the reinsurance association. Each self-insurer approved under section 176.181 and each political subdivision that self-insures shall, as a condition of its authority to self-insure workers' compensation liability in this state, be a member of the reinsurance association and is bound by its plan of operation; provided that:\n(1) all affiliated companies within a holding company system, as determined by the commissioner of labor and industry in a manner consistent with the standards and definitions in chapter 60D, are considered a single entity for purposes of the exercise of all rights and duties of membership in the reinsurance association; and\n(2) all group self-insurers granted authority to self-insure pursuant to section 176.181 are considered single entities for purposes of the exercise of all the rights and duties of membership in the reinsurance association. As a condition of its authority to self-insure workers' compensation liability, and for losses incurred after December 31, 1983, the state is a member of the reinsurance association and is bound by its plan of operation. The commissioner of administration represents the state in the exercise of all the rights and duties of membership in the reinsurance association. The amounts necessary to pay the state's premiums required for coverage by the Workers' Compensation Reinsurance Association are appropriated from the general fund to the commissioner of administration. The University of Minnesota shall pay its portion of workers' compensation reinsurance premiums directly to the Workers' Compensation Reinsurance Association. For the purposes of this section, \"state\" means the administrative branch of state government, the legislative branch, the judicial branch, the University of Minnesota, and any other entity whose workers' compensation liability is paid from the state revolving fund. The commissioner of management and budget may calculate, prorate, and charge a department or agency the portion of premiums paid to the reinsurance association for employees who are paid wholly or in part by federal funds, dedicated funds, or special revenue funds. The reinsurance association is not a state agency. Actions of the reinsurance association and its board of directors and actions of the commissioner of labor and industry with respect to the reinsurance association are not subject to chapters 13 and 15. All property owned by the association is exempt from taxation. The reinsurance association is not obligated to make any payments or pay any assessments to any funds or pools established pursuant to this chapter or chapter 176 or any other law.\nThe direct funded premiums received by the reinsurance association from self-insurers approved under section 176.181 and political subdivisions that self-insure are subject to taxation under chapter 297I.\nThe reinsurance association shall provide and each member shall accept indemnification for 100 percent of the amount of ultimate loss sustained in each loss occurrence relating to one or more claims arising out of a single compensable event, including aggregate losses related to a single event or occurrence which constitutes a single loss occurrence, under chapter 176 on and after October 1, 1979, in excess of a low, a high, a super, or a jumbo retention limit, at the option of the member. In case of occupational disease causing disablement on and after October 1, 1979, each person suffering disablement due to occupational disease is considered to be involved in a separate loss occurrence. The low retention limit shall be $500,000 in 2016. The board may determine future adjustments to the low retention limit subject to the approval of the commissioner of labor and industry. In determining whether to approve an adjustment to the low retention limit, the commissioner shall consider costs, inflation, the impact on members, and workers' compensation reinsurance markets in other states. The high retention limit shall be two times the low retention limit and shall be adjusted when the low retention limit is adjusted. The super retention limit shall be four times the low retention limit and shall be adjusted when the low retention limit is adjusted. Effective January 1, 2018, the jumbo retention limit shall be ten times the low retention limit and shall be adjusted when the low retention limit is adjusted. Ultimate loss as used in this section means the actual loss amount which a member is obligated to pay and which is paid by the member for workers' compensation benefits payable under chapter 176 and shall not include claim expenses, assessments, damages or penalties. For losses incurred on or after January 1, 1979, any amounts paid by a member pursuant to sections 176.183, 176.221, 176.225, and 176.82 shall not be included in ultimate loss and shall not be indemnified by the reinsurance association. A loss is incurred by the reinsurance association on the date on which the accident or other compensable event giving rise to the loss occurs, and a member is liable for a loss up to its retention limit in effect at the time that the loss was incurred, except that members which are determined by the reinsurance association to be controlled by or under common control with another member, and which are liable for claims from one or more employees entitled to compensation for a single compensable event, including aggregate losses relating to a single loss occurrence, may aggregate their losses and obtain indemnification from the reinsurance association for the aggregate losses in excess of the highest retention limit selected by any of the members in effect at the time the loss was incurred. Each member is liable for payment of its ultimate loss and shall be entitled to indemnification from the reinsurance association for the ultimate loss in excess of the member's retention limit in effect at the time of the loss occurrence.\nA member that chooses the high, super, or jumbo retention limit shall retain the liability for all losses below the chosen retention limit itself and shall not transfer the liability to any other entity or reinsure or otherwise contract for reimbursement or indemnification for losses below its retention limit, except in the following cases: (a) when the reinsurance or contract is with another member which, directly or indirectly, through one or more intermediaries, control or are controlled by or are under common control with the member; (b) when the reinsurance or contract provides for reimbursement or indemnification of a member if and only if the total of all claims which the member pays or incurs, but which are not reimbursable or subject to indemnification by the reinsurance association for a given period of time, exceeds a dollar value or percentage of premium written or earned and stated in the reinsurance agreement or contract; (c) when the reinsurance or contract is a pooling arrangement with other insurers where liability of the member to pay claims pursuant to chapter 176 is incidental to participation in the pool and not as a result of providing workers' compensation insurance to employers on a direct basis under chapter 176; (d) when the reinsurance or contract is limited to all the claims of a specific insured of a member which are reimbursed or indemnified by a reinsurer which, directly or indirectly, through one or more intermediaries, controls or is controlled by or is under common control with the insured of the member so long as any subsequent contract or reinsurance of the reinsurer relating to the claims of the insured of a member is not inconsistent with the bases of exception provided under clauses (a), (b) and (c); or (e) when the reinsurance or contract is limited to all claims of a specific self-insurer member which are reimbursed or indemnified by a reinsurer which, directly or indirectly, through one or more intermediaries, controls or is controlled by or is under common control with the self-insurer member so long as any subsequent contract or reinsurance of the reinsurer relating to the claims of the self-insurer member are not inconsistent with the bases for exception provided under clauses (a), (b) and (c).\nWhenever it appears to the commissioner of labor and industry that any member that chooses the high, super, or jumbo retention limit has participated in the transfer of liability to any other entity or reinsured or otherwise contracted for reimbursement or indemnification of losses below its retention limit in a manner inconsistent with the bases for exception provided under clauses (a), (b), (c), (d), and (e), the commissioner may, after giving notice and an opportunity to be heard, order the member to pay to the state of Minnesota an amount not to exceed twice the difference between the reinsurance premium for the high, super, or jumbo retention limit, as appropriate, and the low retention limit applicable to the member for each year in which the prohibited reinsurance or contract was in effect. Any member subject to this penalty provision shall continue to be bound by its selection of the high, super, or jumbo retention limit for purposes of membership in the reinsurance association.\nIf the board determines that a distribution of excess surplus resulted in inadequate funds being available to pay claims that arose during the period upon which that distribution was calculated, the board shall determine the amount of the deficiency. The deficiency shall be made up by imposing an assessment rate against self-insured members and policyholders of insurer members. The board shall notify the commissioner of commerce of the amount of the deficiency and recommend an assessment rate. The commissioner shall order an assessment at a rate and for the time period necessary to eliminate the deficiency. The assessment rate shall be applied to the exposure base of self-insured employers and insured employers. The assessment may not be retroactive and applies only prospectively. The assessment may be spread over a period of time that will cause the least financial hardship to employers. All assessments under this subdivision are payable to the association. The commissioner may issue orders necessary to administer this section.\nAn insurer may withdraw from the reinsurance association only upon ceasing to be authorized by license issued by the commissioner of commerce to transact workers' compensation insurance in this state and when all workers' compensation insurance policies issued by such insurer have expired; a self-insurer may withdraw from the reinsurance association only upon ceasing to be approved to self-insure workers' compensation liability in this state pursuant to section 176.181.\nAn insurer or self-insurer which withdraws or whose membership in the reinsurance association is terminated shall continue to be bound by the plan of operation. Upon withdrawal or termination, all unpaid premiums which have been charged to the withdrawing or terminated member shall be payable as of the effective date of the withdrawal or termination.\nAn unsatisfied net liability to the reinsurance association of an insolvent member shall be assumed by and apportioned among the remaining members of the reinsurance association as provided in the plan of operation. The reinsurance association shall have all rights allowed by law on behalf of the remaining members against the estate or funds of the insolvent member for sums due the reinsurance association.\nWhen a member has been merged or consolidated into another insurer or self-insurer, or another insurer, which provides insurance required by chapter 176, has reinsured a member's entire business, the member and successors in interest of the member shall remain liable for the member's obligations.\nThe commissioner of labor and industry shall require each member to identify the portion of all losses which exceed its retention limit selected under this section in any report filed with the Workers' Compensation Insurers Rating Association of Minnesota or filed with the Department of Labor and Industry for use in reviewing the workers' compensation schedule of rates.\nFor losses incurred on or after January 1, 1984, the reinsurance association shall indemnify the member for the ultimate loss, in excess of the retention limit in effect at the time of the loss occurrence, sustained in each loss occurrence relating to one or more claims arising out of a single compensable event in another state provided that:\n(a) the injured worker is eligible for benefits under section 176.041, subdivision 2 or 3, but elects to receive benefits under the workers' compensation statute of another state in lieu of benefits under chapter 176; and\n(b) the ultimate loss indemnified by the reinsurance association shall be determined as provided in this chapter, except that the benefits shall be equal to those required to be paid under the workers' compensation statute of the state elected.",
	"repealed": false
}