{
	"id": "346.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.37",
	"title": "346.37 GENERAL PROVISIONS.",
	"text": "(a) If an animal is left with a veterinarian, boarding facility, or commercial facility pursuant to a written agreement with the owner or person in possession of the animal and the owner or lawful possessor of the animal has not claimed the animal within ten days after notice in accordance with paragraph (b) or (d), the animal is abandoned and the owner has no further rights or claim to the animal.\n(b) The notice required under paragraph (a), must be given by the veterinarian, boarding facility, or commercial facility to the owner or the owner's agent at the person's last known address by certified mail, return receipt requested, or may be served upon the owner or owner's agent in the manner that a summons is served in a civil court action in the district courts. The notice must notify the owner or owner's agent that the animal may be redeemed by paying all prior expenses incurred within ten days or the animal is abandoned and will be disposed of in accordance with this subdivision.\n(c) If the animal is not claimed within ten days, the veterinarian, boarding facility, or commercial facility becomes the owner of the animal and the animal may be disposed of by the veterinarian, boarding facility, or commercial facility as they consider proper. Upon the veterinarian, boarding facility, or commercial facility becoming the owner of the animal, the veterinarian, boarding facility, or commercial facility is relieved of any liability for disposal of the animal.\n(d) If the notice under paragraph (c) is not given to the owner or owner's agent, or if the address of the owner or owner's agent is not known, notice must be given by the veterinarian, boarding facility, or commercial facility by publishing one notice in a legal newspaper circulated in the county where the animal was delivered to the veterinarian, boarding facility, or commercial facility not less than ten days before the animal is to become the property of the veterinarian, boarding facility, or commercial facility under paragraph (c). The published notice must contain the information required in paragraph (b).\n(e) Each veterinarian, boarding facility, or commercial facility shall warn its patrons of the provisions of this subdivision by a conspicuously posted notice or by conspicuous type in a written document delivered to the owner or the owner's agent.\nA person is not liable for rendering humane assistance to an injured pet or companion animal.\nA person may not inflict cruelty on a pet or companion animal by the use of a cruel training or handling device or method.\nAdequate health care, including parasite and pest control, must be provided to each pet or companion animal.\nA dispute as to the meaning of \"abuse,\" \"cruelty,\" or \"neglect\" shall be resolved by an expert opinion.\nA veterinarian must report known or suspected cases of abuse, cruelty, or neglect to peace officers and humane agents as provided in 343.12 and 343.29.",
	"repealed": false
}