{
	"id": "124D.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.52",
	"title": "124D.52 ADULT BASIC EDUCATION.",
	"text": "(a) An adult basic education program is a day or evening program offered by a district that is for people who do not attend an elementary or secondary school and are not subject to compulsory attendance. The program offers academic and English language instruction necessary to earn a high school diploma or equivalency certificate.\n(b) Notwithstanding any law to the contrary, a school board or the governing body of a consortium offering an adult basic education program may adopt a sliding fee schedule based on a family's income, but must waive the fee for participants who are under the age of 21 or unable to pay. The fees charged must be designed to enable individuals of all socioeconomic levels to participate in the program. A program may charge a security deposit to assure return of materials, supplies, and equipment.\n(c) Each approved adult basic education program must develop a memorandum of understanding with the local workforce development centers located in the approved program's service delivery area. The memorandum of understanding must describe how the adult basic education program and the workforce development centers will cooperate and coordinate services to provide unduplicated, efficient, and effective services to clients.\n(d) Adult basic education aid must be spent for adult basic education purposes as specified in sections 124D.518 to 124D.531.\n(e) A state-approved adult basic education program must count and submit student contact hours for a program that offers high school credit toward an adult high school diploma according to student eligibility requirements and measures of student progress toward work-based competency and, where appropriate, English language proficiency requirements established by the commissioner and posted on the department website in a readily accessible location and format.\n(a) To receive aid under this section, a district, the Department of Corrections, a private nonprofit organization, or a consortium including districts, nonprofit organizations, or both must submit an application by June 1 describing the program, on a form provided by the department. The program must be approved by the commissioner according to the following criteria:\n(1) how the needs of different levels of learning and English language proficiency will be met;\n(2) for continuing programs, an evaluation of results;\n(3) anticipated number and education level of participants;\n(4) coordination with other resources and services;\n(5) participation in a consortium, if any, and money available from other participants;\n(6) management and program design;\n(7) volunteer training and use of volunteers;\n(8) staff development services;\n(9) program sites and schedules;\n(10) program expenditures that qualify for aid;\n(11) program ability to provide data related to learner outcomes as required by law; and\n(12) a copy of the memorandum of understanding described in subdivision 1 submitted to the commissioner.\n(b) Adult basic education programs may be approved under this subdivision for up to five years. Five-year program approval must be granted to an applicant who has demonstrated the capacity to:\n(1) offer comprehensive learning opportunities and support service choices appropriate for and accessible to adults at all basic skill and English language levels of need;\n(2) provide a participatory and experiential learning approach based on the strengths, interests, and needs of each adult, that enables adults with basic skill needs to:\n(i) identify, plan for, and evaluate their own progress toward achieving their defined educational and occupational goals;\n(ii) master the basic academic reading, writing, and computational skills, as well as the problem-solving, decision making, interpersonal effectiveness, and other life and learning skills they need to function effectively in a changing society;\n(iii) locate and be able to use the health, governmental, and social services and resources they need to improve their own and their families' lives; and\n(iv) continue their education, if they desire, to at least the level of secondary school completion, with the ability to secure and benefit from continuing education that will enable them to become more employable, productive, and responsible citizens;\n(3) plan, coordinate, and develop cooperative agreements with community resources to address the needs that the adults have for support services, such as transportation, English language learning, flexible course scheduling, convenient class locations, and child care;\n(4) collaborate with business, industry, labor unions, and employment-training agencies, as well as with family and occupational education providers, to arrange for resources and services through which adults can attain economic self-sufficiency;\n(5) provide sensitive and well trained adult education personnel who participate in local, regional, and statewide adult basic education staff development events to master effective adult learning and teaching techniques;\n(6) participate in regional adult basic education peer program reviews and evaluations;\n(7) submit accurate and timely performance and fiscal reports;\n(8) submit accurate and timely reports related to program outcomes and learner follow-up information; and\n(9) spend adult basic education aid on adult basic education purposes only, which are specified in sections 124D.518 to 124D.531.\n(c) The commissioner shall require each district to provide notification by February 1, of its intent to apply for funds under this section as a single district or as part of a consortium. A district receiving funds under this section must notify the commissioner by February 1 of its intent to change its application status for applications due the following June 1.\n(a) Each district, group of districts, or private nonprofit organization providing adult basic education programs must establish and maintain a reserve account within the community service fund for receiving and disbursing all funds related to these programs. All revenue received under this section must be used solely for the purposes of adult basic education programs. State aid must not equal more than 100 percent of the unreimbursed expenses of providing these programs, excluding in-kind costs.\n(b) For purposes of paragraph (a), an adult basic education program may include as valid expenditures for the previous fiscal year program spending that occurs from July 1 to September 30 of the following year. A program may carry over a maximum of 20 percent of its adult basic education aid revenue into the next fiscal year. Program spending may only be counted for one fiscal year.\n(c) Notwithstanding section 123A.26 or any other law to the contrary, an adult basic education consortium providing an approved adult basic education program may be its own fiscal agent and is eligible to receive state-aid payments directly from the commissioner.\nPersons may teach English as a second language classes at a worksite, if they meet the requirements of section 122A.19, subdivision 1, clause (1), regardless of whether they are licensed teachers. Persons teaching English as a second language for an approved adult basic education program must possess a bachelor's or master's degree in English as a second language, applied linguistics, or bilingual education, or a related degree approved by the commissioner.\nA district, or a consortium of districts, with a program approved by the commissioner under subdivision 2 must establish, in consultation with the commissioner, a basic level of service for every adult basic education site in the district or consortium. The basic service level must describe minimum levels of academic and English language instruction and support services to be provided at each site. The program must set a basic service level that promotes effective learning and student achievement with measurable results. Each district or consortium of districts must submit its basic service level to the commissioner for approval.\n(a) A school district, or adult basic education consortium that receives revenue under section 124D.531, may deliver English as a second language, citizenship, or other adult education programming in collaboration with community-based and nonprofit organizations located within its district or region, and with correctional institutions. The organization or correctional institution must have the demonstrated capacity to offer education programs for adults. Community-based or nonprofit organizations must meet the criteria in paragraph (b), or have prior experience. A community-based or nonprofit organization or a correctional institution may be reimbursed for unreimbursed expenses as defined in section 124D.518, subdivision 5, for administering English as a second language or adult basic education programs, not to exceed eight percent of the total funds provided by a school district or adult basic education consortium. The administrative reimbursement for a school district or adult basic education consortium that delivers services cooperatively with a community-based or nonprofit organization or correctional institution is limited to five percent of the program aid, not to exceed the unreimbursed expenses of administering programs delivered by community-based or nonprofit organizations or correctional institutions.\n(b) A community-based organization or nonprofit organization that delivers education services under this section must demonstrate that it has met the following criteria:\n(1) be legally established as a nonprofit organization;\n(2) have an established system for fiscal accounting and reporting that is consistent with the department's adult basic education completion report and reporting requirements under section 124D.531;\n(3) require all instructional staff to complete a training course in teaching adult learners; and\n(4) develop a learning plan for each student that identifies defined educational and occupational goals with measures to evaluate progress.\n(a) By July 1, 2000, each approved adult basic education program must develop and implement a performance tracking system to provide information necessary to comply with federal law and serve as one means of assessing the effectiveness of adult basic education programs. The tracking system must be designed to collect data on the following core outcomes for learners, including English learners, who have completed participation in the adult basic education program:\n(1) demonstrated improvements in literacy skill levels in reading, writing, speaking the English language, numeracy, problem solving, English language acquisition, and other literacy skills;\n(2) placement in, retention in, or completion of postsecondary education, training, unsubsidized employment, or career advancement; and\n(3) receipt of a secondary school diploma or its recognized equivalent.\n(b) A district, group of districts, state agency, or private nonprofit organization providing an adult basic education program may meet this requirement by developing a tracking system based on either or both of the following methodologies:\n(1) conducting a reliable follow-up survey; or\n(2) submitting student information, including collected Social Security numbers for data matching.\nData related to any of the specified outcomes may be collected at any time during a program year.\n(c) When a student in a program is requested to provide the student's Social Security number, the student must be notified in a written form easily understandable to the student that:\n(1) providing the Social Security number is optional and no adverse action may be taken against the student if the student chooses not to provide the Social Security number;\n(2) the request is made under section 124D.52, subdivision 7;\n(3) if the student provides the Social Security number, it will be used to assess the effectiveness of the program by tracking the student's subsequent career; and\n(4) the Social Security number will be shared with the Department of Education; Minnesota State Colleges and Universities; and the Department of Employment and Economic Development in order to accomplish the purposes of this section and will not be used for any other purpose or reported to any other governmental entities.\n(d) Annually a district, group of districts, state agency, or private nonprofit organization providing programs under this section must forward the tracking data collected to the Department of Education. For the purposes of longitudinal studies on the employment status of former students under this section, the Department of Education must forward the Social Security numbers to the Department of Employment and Economic Development to electronically match the Social Security numbers of former students with wage detail reports filed under section 268.044. The results of data matches must, for purposes of this section and consistent with the requirements of the Workforce Innovation and Opportunity Act, be compiled in a longitudinal form by the Department of Employment and Economic Development and released to the Department of Education in the form of summary data that does not identify the individual students. The Department of Education may release this summary data. State funding for adult basic education programs must not be based on the number or percentage of students who decline to provide their Social Security numbers or on whether the program is evaluated by means of a follow-up survey instead of data matching.\n(a) Consistent with subdivision 9, the commissioner shall provide for a standard adult high school diploma to persons who:\n(1) are not eligible for kindergarten through grade 12 services;\n(2) do not have a high school diploma; and\n(3) successfully complete an adult basic education program of instruction approved by the commissioner of education necessary to earn an adult high school diploma.\n(b) Persons participating in an approved adult basic education program of instruction must demonstrate the competencies, knowledge, and skills and, where appropriate, English language proficiency, sufficient to ensure that postsecondary programs and institutions and potential employers regard persons with a standard high school diploma and persons with a standard adult high school diploma as equally well prepared and qualified graduates. Approved adult basic education programs of instruction under this subdivision must issue a standard adult high school diploma to persons who successfully demonstrate the competencies, knowledge, and skills required by the program.\n(a) The commissioner must establish criteria and requirements for eligible adult basic education consortia under section 124D.518, subdivision 2, to effectively operate and provide instruction under this subdivision.\n(b) An eligible and interested adult basic education consortium must apply to the commissioner, in the form and manner determined by the commissioner, for approval to provide an adult high school diploma program to eligible students under subdivision 8, paragraph (a). An approved consortium annually must submit to the commissioner the longitudinal and evaluative data, identified in the consortium's application, to demonstrate its compliance with applicable federal and state law and its approved application and the efficacy of its adult high school diploma program. The commissioner must use the data to evaluate whether or not to reapprove an eligible consortium every fifth year. The commissioner, at the commissioner's discretion, may reevaluate the compliance or efficacy of a program provider sooner than every fifth year. The commissioner may limit the number or size of adult high school diploma programs based on identified community needs, available funding, other available resources, or other relevant criteria identified by the commissioner.\n(c) At the time a student applies for admission to an adult high school diploma program, the program provider must work with the student applicant to:\n(1) identify the student's learning goals, skills and experiences, required competencies already completed, and goals and options for viable career pathways;\n(2) assess the student's instructional needs; and\n(3) develop an individualized learning plan to guide the student in completing adult high school diploma requirements and realizing career goals identified in the plan.\nTo fully implement the learning plan, the provider must provide the student with ongoing advising, monitor the student's progress toward completing program requirements and receiving a diploma, and provide the student with additional academic support services when needed. At the time a student satisfactorily completes all program requirements and is eligible to receive a diploma, the provider must conduct a final student interview to examine both student and program outcomes related to the student's ability to demonstrate required competencies and complete program requirements and to assist the student with the student's transition to training, a career, or postsecondary education.\n(d) Competencies and other program requirements must be rigorous, uniform throughout the state, and align to Minnesota academic high school standards applicable to adult learners and their career and college needs. The commissioner must establish competencies, skills, and knowledge requirements in the following areas, consistent with this paragraph:\n(1) language arts, including reading, writing, speaking, and listening;\n(2) mathematics;\n(3) career development and employment-related skills;\n(4) social studies; and\n(5) science.\n(e) Consistent with criteria established by the commissioner, students may demonstrate satisfactory completion of program requirements through verification of the student's:\n(1) prior experiences, including kindergarten through grade 12 courses and programs, postsecondary courses and programs, adult basic education instruction, and other approved experiences aligned with the Minnesota academic high school standards applicable to adult learners and their career and college needs;\n(2) knowledge and skills as measured or demonstrated by valid and reliable high school assessments, secondary credentials, adult basic education programs, and postsecondary entrance exams;\n(3) adult basic education instruction and course completion; and\n(4) applied and experiential learning acquired via contextualized projects and other approved learning opportunities.\n(f) Program providers must transmit a student's record of work to another approved consortium for any student who transfers between approved programs under this subdivision. The commissioner must establish a uniform format and transcript to record a student's record of work and also the manner under which approved consortia maintain permanent student records and transmit transferred student records. At a student's request, a program provider must transmit the student's record of work to other entities such as a postsecondary institution or employer.\n(g) The commissioner may issue a standard adult high school diploma and transmit the transcript and record of work of the student who receives the diploma. Alternatively, a school district that is a member of an approved consortium providing a program under this subdivision may issue a district diploma to a student who satisfactorily completes the requirements for a standard adult high school diploma under this subdivision.\n(h) The commissioner must identify best practices for adult basic education programs and develop adult basic education recommendations consistent with this subdivision to assist approved consortia in providing an adult high school diploma program. The commissioner must provide assistance to consortia providing an approved adult high school diploma program.\n(i) The commissioner must consult with practitioners from throughout Minnesota, including educators, school board members, and school administrators, among others, who are familiar with adult basic education students and programs, on establishing the standards, requirements, and other criteria needed to ensure, consistent with subdivision 8, that persons with a standard adult high school diploma are as equally well prepared and qualified graduates as persons with a standard high school diploma. The commissioner, in consultation with the practitioners, shall regularly review program requirements and diploma standards.",
	"repealed": false
}