{
	"id": "268.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.19",
	"title": "268.19 DATA PRIVACY.",
	"text": "(a) Except as provided by this section, data gathered from any person under the administration of the Minnesota Unemployment Insurance Law are private data on individuals or nonpublic data not on individuals as defined in section 13.02, subdivisions 9 and 12, and may not be disclosed except according to a district court order or section 13.05. A subpoena is not considered a district court order. These data may be disseminated to and used by the following agencies without the consent of the subject of the data:\n(1) state and federal agencies specifically authorized access to the data by state or federal law;\n(2) any agency of any other state or any federal agency charged with the administration of an unemployment insurance program;\n(3) any agency responsible for the maintenance of a system of public employment offices for the purpose of assisting individuals in obtaining employment;\n(4) the public authority responsible for child support in Minnesota or any other state in accordance with section 518A.83;\n(5) human rights agencies within Minnesota that have enforcement powers;\n(6) the Department of Revenue to the extent necessary for its duties under Minnesota laws;\n(7) public and private agencies responsible for administering publicly financed assistance programs for the purpose of monitoring the eligibility of the program's recipients;\n(8) the Department of Labor and Industry and the Commerce Fraud Bureau in the Department of Commerce for uses consistent with the administration of their duties under Minnesota law;\n(9) the Department of Human Services and the Office of Inspector General and its agents within the Department of Human Services, including county fraud investigators, for investigations related to recipient or provider fraud and employees of providers when the provider is suspected of committing public assistance fraud;\n(10) the Department of Human Services for the purpose of evaluating medical assistance services and supporting program improvement;\n(11) local and state welfare agencies for monitoring the eligibility of the data subject for assistance programs, or for any employment or training program administered by those agencies, whether alone, in combination with another welfare agency, or in conjunction with the department or to monitor and evaluate the statewide Minnesota family investment program and other cash assistance programs, the Supplemental Nutrition Assistance Program, and the Supplemental Nutrition Assistance Program Employment and Training program by providing data on recipients and former recipients of Supplemental Nutrition Assistance Program (SNAP) benefits, cash assistance under chapter 256, 256D, 256J, or 256K, child care assistance under chapter 142E, or medical programs under chapter 256B or 256L or formerly codified under chapter 256D;\n(12) local and state welfare agencies for the purpose of identifying employment, wages, and other information to assist in the collection of an overpayment debt in an assistance program;\n(13) local, state, and federal law enforcement agencies for the purpose of ascertaining the last known address and employment location of an individual who is the subject of a criminal investigation;\n(14) the United States Immigration and Customs Enforcement has access to data on specific individuals and specific employers provided the specific individual or specific employer is the subject of an investigation by that agency;\n(15) the Department of Health for the purposes of epidemiologic investigations;\n(16) the Department of Corrections for the purposes of case planning and internal research for preprobation, probation, and postprobation employment tracking of offenders sentenced to probation and preconfinement and postconfinement employment tracking of committed offenders;\n(17) the state auditor to the extent necessary to conduct audits of job opportunity building zones as required under section 469.3201;\n(18) the Office of Higher Education for purposes of supporting program improvement, system evaluation, and research initiatives including the Statewide Longitudinal Education Data System; and\n(19) the Family and Medical Benefits Division of the Department of Employment and Economic Development to be used as necessary to administer chapter 268B.\n(b) Data on individuals and employers that are collected, maintained, or used by the department in an investigation under section 268.182 are confidential as to data on individuals and protected nonpublic data not on individuals as defined in section 13.02, subdivisions 3 and 13, and must not be disclosed except under statute or district court order or to a party named in a criminal proceeding, administrative or judicial, for preparation of a defense.\n(c) Data gathered by the department in the administration of the Minnesota unemployment insurance program must not be made the subject or the basis for any suit in any civil proceedings, administrative or judicial, unless the action is initiated by the department.\n(a) Wage and employment data gathered under section 268.044 may be disseminated to and used, without the consent of the subject of the data, by an agency of another state that is designated as the performance accountability and consumer information agency for that state under Code of Federal Regulations, volume 20, part 663.510(c), in order to carry out the requirements of the Workforce Investment Act of 1998, United States Code, title 29, sections 2842 and 2871.\n(b) The commissioner may enter into a data exchange agreement with an employment and training service provider under section 116L.17, or the Workforce Investment Act of 1998, United States Code, title 29, section 2864, under which the commissioner, with the consent of the subject of the data, may furnish data on the quarterly wages paid and number of hours worked on those individuals who have received employment and training services from the provider. With the initial consent of the subject of the data, this data may be shared for up to three years after termination of the employment and training services provided to the individual without execution of an additional consent. This data is furnished solely for the purpose of evaluating the employment and training services provided. The data subject's ability to receive service is not affected by a refusal to give consent under this paragraph. The consent form must state this fact.\n(a) Regardless of any provision of law to the contrary, an employer may provide the commissioner with information on an applicant so that the commissioner can determine an applicant's entitlement to unemployment benefits under the Minnesota Unemployment Insurance Law.\n(b) The commissioner may disseminate an employer's name and address and the name and address of any employer's unemployment insurance processing agent in order to administer the Minnesota unemployment insurance program.\n(c) Information obtained under the Minnesota Unemployment Insurance Law, in order to determine an applicant's entitlement to unemployment benefits, are absolutely privileged and may not be made the subject matter or the basis for any civil proceeding, administrative, or judicial.",
	"repealed": false
}