{
	"id": "79A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.01",
	"title": "79A.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of commerce except where specifically stated otherwise.\n\"Incurred liabilities for the payment of compensation\" means the sum of both of the following:\n(1) an estimate of future workers' compensation benefits, including medical and indemnity; and\n(2) an amount determined by the commissioner to be reasonably adequate to assure the administration of claims, including legal costs, but not to exceed ten percent of future workers' compensation benefits.\n\"Insolvent self-insurer\" means: (1) a member private self-insurer who has failed to pay compensation as a result of a declaration of bankruptcy or insolvency by a court of competent jurisdiction and whose security deposit has been called by the commissioner pursuant to chapter 176; (2) a member self-insurer who has failed to pay compensation and who has been issued a certificate of default by the commissioner and whose security deposit has been called by the commissioner pursuant to chapter 176; (3) a member or former member private self-insurer who has failed to pay an assessment required by section 79A.12, subdivision 2, and who has been issued a certificate of default by the commissioner and whose security deposit has been called by the commissioner; or (4) a member private self-insurer whose security deposit has been called by the commissioner pursuant to chapter 176 and in accordance with section 79A.04, subdivision 9a, paragraph (b).\n\"Member\" means a private self-insurer which participates in the self-insurers' security fund.\n\"Private self-insurer\" means a member private employer which is self-insured or a group which is self-insured against liability for workers' compensation under chapter 176. It does not include the state of Minnesota or its political subdivisions.\n\"Security fund\" means the self-insurers' security fund established pursuant to this chapter.\n\"Trustees\" means the board of trustees of the self-insurers' security fund.\n\"Certificate of default\" means a notice issued by the commissioner of commerce based upon information received from the commissioner of labor and industry, that a private self-insurer has failed to pay compensation as required by chapter 176.\n\"Common claims fund,\" with respect to group self-insurers, means the cash, cash equivalents, or investment accounts maintained by the self-insurance group to pay its workers' compensation liabilities.\n\"Diminutive applicants\" to group self-insurance means applicants to existing self-insurance groups whose equity and premium are both less than five percent of the total group's equity and premium.",
	"repealed": false
}