{
	"id": "176.1812",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.1812",
	"title": "176.1812 COLLECTIVE BARGAINING AGREEMENTS.",
	"text": "Upon appropriate filing, the commissioner, compensation judge, Workers' Compensation Court of Appeals, and courts shall recognize as valid and binding a provision in a collective bargaining agreement between a qualified employer or qualified groups of employers and the certified and exclusive representative of its employees to establish certain obligations and procedures relating to workers' compensation. For purposes of this section, \"qualified employer\" means any employer that is self-insured for workers' compensation in compliance with this chapter, or any employer that is insured for workers' compensation in compliance with this chapter. For purposes of this section, a \"qualified group of employers\" means a group of employers, in which each employer is insured for workers' compensation in compliance with this chapter or is self-insured for workers' compensation in compliance with this chapter. This agreement must be limited to, but need not include, all of the following:\n(a) an alternative dispute resolution system to supplement, modify, or replace the procedural or dispute resolution provisions of this chapter. The system may include mediation, arbitration, or other dispute resolution proceedings, the results of which may be final and binding upon the parties. A system of arbitration shall provide that the decision of the arbiter is subject to review either by the Workers' Compensation Court of Appeals in the same manner as an award or order of a compensation judge or, in lieu of review by the Workers' Compensation Court of Appeals, by the Office of Administrative Hearings, by the district court, by the Minnesota Court of Appeals, or by the supreme court in the same manner as the Workers' Compensation Court of Appeals and may provide that any arbiter's award disapproved by a court be referred back to the arbiter for reconsideration and possible modification;\n(b) an agreed list of providers of medical treatment that may be the exclusive source of all medical and related treatment provided under this chapter which need not be certified under section 176.1351;\n(c) the use of a limited list of impartial physicians to conduct independent medical examinations;\n(d) the creation of a light duty, modified job, or return to work program;\n(e) the use of a limited list of individuals and companies for the establishment of vocational rehabilitation or retraining programs which list is not subject to the requirements of section 176.102;\n(f) the establishment of safety committees and safety procedures; or\n(g) the adoption of a 24-hour health care coverage plan if a 24-hour plan pilot project is authorized by law, according to the terms and conditions authorized by that law.\n(a) A copy of the agreement and the approximate number of employees who will be covered under it must be filed with the commissioner. Within 21 days of receipt of an agreement, the commissioner shall review the agreement for compliance with this section and the benefit provisions of this chapter and notify the parties of any additional information required or any recommended modification that would bring the agreement into compliance. Upon receipt of any requested information or modification, the commissioner must notify the parties within 21 days whether the agreement is in compliance with this section and the benefit provisions of this chapter.\n(b) After an agreement is approved by the commissioner under paragraph (a), a qualified employer may join or withdraw from a qualified group of employers without commissioner review or approval. The commissioner must be notified within 30 days when a qualified employer joins or withdraws from a qualified group of employers.\n(c) In order for any agreement to remain in effect, it must provide for a timely and accurate method of reporting to the commissioner the individual claims covered by the agreement and claim-specific dispute resolution data, in the form and manner prescribed by the commissioner. Dispute resolution data includes information about facilitation, mediation, and arbitration and shall be provided annually to the commissioner to enable the commissioner to report aggregate dispute data to the legislature.\nA person aggrieved by the commissioner's decision concerning an agreement may request in writing, within 30 days of the date the notice is issued, the initiation of a contested case proceeding under chapter 14. The request to initiate a contested case must be received by the department by the 30th day after the commissioner's decision. An appeal from the commissioner's final decision and order may be taken to the Workers' Compensation Court of Appeals pursuant to sections 176.421 and 176.442.\nNothing in this section shall allow any agreement that diminishes an employee's entitlement to benefits as otherwise set forth in this chapter. For the purposes of this section, the procedural rights and dispute resolution agreements under subdivision 1, clauses (a) to (g), are not agreements which diminish an employee's entitlement to benefits. Any agreement that diminishes an employee's entitlement to benefits as set forth in this chapter is null and void.\nIf the employer is insured under this chapter, the collective bargaining agreement provision shall not be recognized by the commissioner, compensation judge, Workers' Compensation Court of Appeals, and other courts unless the employer has given notice to the employer's insurance carrier, in the manner provided in the insurance contract, of intent to enter into an agreement with its employees as provided in this section.\n[Repealed, 2005 c 90 s 20]\nThe commissioner may adopt rules necessary to implement this section.",
	"repealed": false
}