{
	"id": "116J.575",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.575",
	"title": "116J.575 GRANTS.",
	"text": "The commissioner may make a grant for up to 50 percent of the eligible costs of a project. The determination of whether to make a grant for a site is within the discretion of the commissioner, subject to this section and sections 116J.571 to 116J.574 and available unencumbered money in the redevelopment account. The commissioner's decisions and application of the priorities under this section are not subject to judicial review, except for abuse of discretion.\n(a) If applications for grants exceed the available appropriations, grants shall be made for sites that, in the commissioner's judgment, provide the highest return in public benefits for the public costs incurred. \"Public benefits\" include job creation, bioscience development, environmental benefits to the state and region, efficient use of public transportation, efficient use of existing infrastructure, provision of affordable housing, multiuse development that constitutes community rebuilding rather than single-use development, crime reduction, blight reduction, community stabilization, and property tax base maintenance or improvement. In making this judgment, the commissioner shall give priority to redevelopment projects with one or more of the following characteristics:\n(1) the need for redevelopment in conjunction with contamination remediation needs;\n(2) the redevelopment project meets current tax increment financing requirements for a redevelopment district and tax increments will contribute to the project;\n(3) the redevelopment potential within the municipality;\n(4) proximity to public transit if located in the metropolitan area;\n(5) redevelopment costs related to expansion of a bioscience business in Minnesota;\n(6) multijurisdictional projects that take into account the need for affordable housing, transportation, and environmental impact; or\n(7) the project advances or promotes the green economy as defined in section 116J.437.\n(b) The factors in paragraph (a) are not listed in a rank order of priority; rather, the commissioner may weigh each factor, depending upon the facts and circumstances, as the commissioner considers appropriate. The commissioner may consider other factors that affect the net return of public benefits for completion of the redevelopment plan. The commissioner, notwithstanding the listing of priorities and the goal of maximizing the return of public benefits, shall make grants that distribute available money to sites both within and outside of the metropolitan area. Unless sufficient applications are not received for qualifying sites outside of the metropolitan area, at least 50 percent of the money provided as grants must be made for sites located outside of the metropolitan area.\nIn making grants, the commissioner shall establish semiannual application deadlines in which grants will be authorized from all or part of the available money in the account.\nIn order to qualify for a grant under sections 116J.571 to 116J.575, the municipality must pay for at least one-half of the redevelopment costs as a local match from any money available to the municipality.\nIf a project fails to substantially provide the public benefits listed in the grant application within five years from the date of the grant award, the commissioner may require that 100 percent of the grant amount be repaid by the development authority over a term not to exceed ten years. The commissioner may exercise discretion to require repayment of only a portion of the grant amount taking into account the public benefits generated by the completed development.",
	"repealed": false
}