{
	"id": "124D.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.34",
	"title": "124D.34 MINNESOTA FOUNDATION FOR STUDENT ORGANIZATIONS.",
	"text": "This section may be cited as the \"Minnesota Foundation For Student Organizations Act.\"\nThere is created the Minnesota Foundation for Student Organizations. The purpose of the foundation is to promote career and technical student organizations and applied leadership opportunities in Minnesota public and nonpublic schools through public-private partnerships. The foundation is a nonprofit organization. The board of directors of the foundation and activities of the foundation are under the direction of the commissioner of education.\nThe board of directors of the Minnesota Foundation for Student Organizations consists of:\n(1) seven members appointed by the board of directors of the career and technical student organizations and chosen so that each represents one of the following career areas: agriculture, family and consumer sciences, service occupations, health occupations, marketing, business, and technical/industrial;\n(2) seven members from business, industry, and labor appointed by the governor to staggered terms and chosen so that each represents one of the following career areas: agriculture, family and consumer sciences, service occupations, health occupations, marketing, business, and technical/industrial;\n(3) five students or alumni of career and technical student organizations representing diverse career areas, three from secondary student organizations, and two from postsecondary student organizations. The students or alumni shall be appointed by the criteria and process agreed upon by the executive directors of the career and technical organizations; and\n(4) four members from education appointed by the governor to staggered terms and chosen so that each represents one of the following groups: school district level administrators, secondary school administrators, middle school administrators, and postsecondary administrators.\nExecutive directors of career and technical education student organizations are ex officio, nonvoting members of the board.\nThe foundation shall advance applied leadership and intracurricular career and technical learning experiences for students. These may include, but are not limited to:\n(1) recognition programs and awards for students demonstrating excellence in applied leadership;\n(2) summer programs for student leadership, career development, applied academics, and mentorship programs with business and industry;\n(3) recognition programs for teachers, administrators, and others who make outstanding contributions to career and technical programs;\n(4) outreach programs to increase the involvement of urban and suburban students;\n(5) organized challenges requiring cooperation and competition for secondary and postsecondary students;\n(6) assistance and training to community teams to increase career awareness and empowerment of youth as community leaders; and\n(7) assessment and activities in order to plan for and implement continuous improvement.\nTo the extent possible, the foundation shall make these programs available to students in all parts of the state.\nThe foundation may:\n(1) identify and plan common goals and priorities for the various career and technical student organizations in Minnesota;\n(2) publish brochures or booklets relating to the purposes of the foundation and collect reasonable fees for the publications;\n(3) seek and receive public and private money, grants, and in-kind services and goods from nonstate sources for the purposes of the foundation, without complying with section 16A.013, subdivision 1;\n(4) contract with consultants on behalf of the career and technical student organizations;\n(5) plan, implement, and expend money for awards and other forms of recognition for career and technical student programs; and\n(6) identifying an appropriate name for the foundation.\nThe foundation board shall review and approve each contract of the board. Each contract of the foundation board shall be subject to the same review and approval procedures as a contract of the commissioner of education.\nThe commissioner of education shall appoint the executive director of the foundation from three candidates nominated and submitted by the foundation board of directors and, as necessary, other staff who shall perform duties and have responsibilities solely related to the foundation. The employees appointed are not state employees under chapter 43A, but are covered under section 3.736. The employees may participate in the state health and state insurance plans for employees in unclassified service. The employees shall be supervised by the executive director.\nThe commissioner shall appoint a liaison to the foundation board from the division in the department responsible for career and technical education.\nThe state shall identify and secure appropriate funding for the basic staffing of the foundation and individual student career and technical student organizations at the state level.\nThe foundation must seek private resources to supplement the available public money. Individuals, businesses, and other organizations may contribute to the foundation in any manner specified by the board of directors. All money received shall be administered by the board of directors.\nThe board of directors of the foundation must submit an annual report on the progress of its activities to the commissioner of education and to the Board of Trustees of the Minnesota State Colleges and Universities. The annual report shall contain a financial report for the preceding year. The foundation shall submit a biennium report to the legislature before February 15, in the odd-numbered year.\nAll the amounts received by the foundation pursuant to this section are annually appropriated to the foundation.\nIndividual boards of career and technical education student organizations shall continue their operations in accordance with section 124D.355 and applicable federal law.",
	"repealed": false
}