{
	"id": "252A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/252A.101",
	"title": "252A.101 HEARING.",
	"text": "Except as otherwise provided in this section, sections 524.5-101 to 524.5-502 apply to public guardianship hearings.\nThe proposed person subject to public guardianship may waive the right to be present at the hearing only if the proposed person subject to public guardianship has met with counsel and specifically waived the right to appear.\nIf, at the time of the hearing, the proposed person subject to public guardianship has been under medical care, the person subject to public guardianship has the same rights regarding limitation on the use of drugs, medication, or other treatment before the hearing that are available under section 252A.04, subdivision 2.\nThe county attorney shall appear and represent the petitioner upon the request of the court or the petitioner. The petitioner must be notified of the right to request that the county attorney appear. The attorney general may appear and represent the commissioner in any proceedings brought under this chapter.\n(a) In all cases the court shall make specific written findings of fact, conclusions of law, and direct entry of an appropriate judgment or order. The court shall order the appointment of the commissioner as guardian if it finds that:\n(1) the proposed person subject to public guardianship is a person with a developmental disability as defined in section 252A.02, subdivision 2;\n(2) the proposed person subject to public guardianship is incapable of exercising specific legal rights, which must be enumerated in the court's findings;\n(3) the proposed person subject to public guardianship is in need of the supervision and protection of a public guardian; and\n(4) no appropriate alternatives to public guardianship exist that are less restrictive of the person's civil rights and liberties, such as appointing a private guardian, supported decision maker, or health care agent; or arranging residential or community services under sections 524.5-101 to 524.5-502.\n(b) The court shall grant the specific powers that are necessary for the commissioner to act as public guardian on behalf of the person subject to public guardianship.\nA copy of the order shall be served by mail upon the person subject to public guardianship and the counsel of the person subject to public guardianship. The order must be accompanied by a notice that advises the person subject to public guardianship of the right to appeal the guardianship appointment within 30 days.\n(a) Letters of guardianship must be issued by the court and contain:\n(1) the name, address, and telephone number of the person subject to public guardianship; and\n(2) the powers to be exercised on behalf of the person subject to public guardianship.\n(b) The letters under paragraph (a) must be served by mail upon the person subject to public guardianship, the counsel of the person subject to public guardianship, the commissioner, and the local agency.\nIf upon the completion of the hearing and consideration of the record, the court finds that the proposed person subject to public guardianship is not developmentally disabled or is developmentally disabled but not in need of the supervision and protection of a public guardian, the court shall dismiss the application and shall notify the proposed person subject to public guardianship, the counsel of the person subject to public guardianship, and the petitioner of the court's findings.",
	"repealed": false
}