{
	"id": "299F.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.63",
	"title": "299F.63 RECORDS, REPORTS, INSPECTIONS.",
	"text": "(a) The commissioner may, to the extent necessary to carry out the enforcement responsibilities of sections 299F.56 to 299F.641, conduct investigations, make reports, issue subpoenas, require the production of relevant documents and records, take depositions, and conduct research, testing, development, demonstration, and training activities.\n(b) The commissioner may require each person who engages in the transportation of gas or hazardous liquid or who owns or operates pipeline facilities to establish and maintain records, and to make reports and provide information to the commissioner. The records and other information must be made available as the commissioner orders to enable the commissioner to determine whether the person has acted or is acting in compliance with sections 299F.56 to 299F.641 and the standards adopted or orders issued under sections 299F.56 to 299F.641.\n(c) Officers, employees, and agents authorized by the commissioner, on presenting appropriate credentials to the person in charge, may enter upon, inspect, and examine, at reasonable times and in a reasonable manner, the records and properties of a person subject to regulation under sections 299F.56 to 299F.641 to the extent the records and properties are relevant to determine whether the person has acted or is acting in compliance with those sections and the standards adopted under those sections.\n(d) An accident report made by an officer, employee, or agent of the Office of Pipeline Safety is available for use in a civil, criminal, or other judicial proceeding arising out of the accident. The officer, employee, or agent may be required to testify in the proceedings as to the facts developed in the investigation. A report made available to the public need not identify individuals. Reports on research projects, demonstration projects, and other related activities are public information.\n(e) All information reported to or otherwise obtained by the commissioner under sections 299F.56 to 299F.641 that contains or relates to a trade secret referred to in United States Code, title 18, section 1905, is confidential for the purpose of that section, and is private or nonpublic data as defined in section 13.02. However, the information may be disclosed to other officers or employees authorized to enforce sections 299F.56 to 299F.641. Nothing in this section authorizes the withholding of information by the commissioner from a duly authorized committee of the legislature or the United States Congress.\nThe commissioner must establish and implement an inspection program to enforce the standards adopted under section 299F.57. The program must be established and implemented in a manner that complies with requirements for state certification under United States Code, title 49, section 1674. In the course of the exercise of duties and responsibilities under sections 299F.56 to 299F.641, the commissioner shall wherever practicable employ a practice of spot checking, with respect to persons subject to sections 299F.56 to 299F.641.\n[Repealed by amendment, 1989 c 244 s 15]\n[Repealed, 1988 c 624 s 23]",
	"repealed": false
}