{
	"id": "144.4805",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4805",
	"title": "144.4805 HEALTH ORDER; RIGHTS OF CARRIER AND RESPONDENT.",
	"text": "Only the commissioner, or a community health board with express delegated authority from the commissioner, may issue a health order under this section.\nWhenever the commissioner has probable cause to believe that a carrier is an endangerment to the public health, the commissioner may issue a health order that the commissioner deems necessary to protect the public health. The commissioner may petition the court for enforcement of the health order. In a court proceeding for enforcement of the health order, the commissioner shall demonstrate the particularized circumstances constituting the necessity for the health order. The health order may be issued to any person, including a carrier, physician, licensed health professional, or treatment facility. The health order may be in the form of a subpoena by the commissioner for certified medical records relating to the carrier's tuberculosis and status as an endangerment to the public health.\nA health order must include:\n(1) a citation to this section as the legal authority under which the order is issued;\n(2) a summary of evidence upon which the person is alleged to be a carrier;\n(3) a description of the alleged conduct of the carrier that makes the carrier an endangerment to the public health;\n(4) a description of less restrictive alternatives that the commissioner considered and rejected, together with the reasons for the rejection, or a description of less restrictive alternatives that the commissioner used and that were unsuccessful;\n(5) the preventive measure ordered; and\n(6) a notice advising the carrier or respondent that:\n(i) a hearing will be held if the carrier or respondent petitions the court for a hearing or if the commissioner determines that the carrier has not complied with the health order;\n(ii) the carrier or respondent has the right to appear at the hearing;\n(iii) the carrier or respondent has the right to present and cross-examine witnesses at the hearing;\n(iv) the carrier has the right to court-appointed counsel in a proceeding under sections 144.4801 to 144.4813; and\n(v) the carrier or respondent has the right to the assistance of an interpreter in a proceeding under sections 144.4801 to 144.4813.\n(a) The carrier or respondent has the right to counsel in any proceeding under sections 144.4801 to 144.4813. The court shall promptly appoint counsel for a carrier if the carrier does not have counsel:\n(1) at the time the court issues an order under section 144.4807, subdivision 7, authorizing the continued detention of the carrier;\n(2) at the time the court issues an order under section 144.4808, subdivision 2, authorizing the carrier to be apprehended and held; or\n(3) in all other cases, at the time either party files a notice for a preliminary hearing under section 144.4810, subdivision 2.\nThe court shall appoint counsel for the carrier. The cost of court-appointed counsel shall be paid by the court.\n(b) Upon being notified of the name and address of counsel for the carrier, the commissioner shall promptly forward to the carrier and the carrier's counsel the following:\n(1) a copy of the health order;\n(2) a certified copy of relevant portions of the carrier's medical records; and\n(3) the name and address of the licensed health professional, including the carrier's attending physician or nurse, or the public health physician or nurse whom the commissioner intends to have testify at the preliminary hearing, and a summary of the witness' testimony, including a copy of the witness' affidavit, if any.\nThe commissioner's counsel and the carrier's counsel shall make every effort to communicate prior to any hearing and to stipulate as to undisputed facts, witnesses, and exhibits.\nThe carrier or respondent has the right to the assistance of an interpreter in a proceeding under sections 144.4801 to 144.4813.\nA health order may be served by a disease prevention officer or peace officer.",
	"repealed": false
}