{
	"id": "245A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.04",
	"title": "245A.04 APPLICATION PROCEDURES.",
	"text": "(a) An individual, organization, or government entity that is subject to licensure under section 245A.03 must apply for a license. The application must be made on the forms and in the manner prescribed by the commissioner. The commissioner shall provide the applicant with instruction in completing the application and provide information about the rules and requirements of other state agencies that affect the applicant. An applicant seeking licensure in Minnesota with headquarters outside of Minnesota must have a program office located within 30 miles of the Minnesota border. An applicant who intends to buy or otherwise acquire a program or services licensed under this chapter that is owned by another license holder must apply for a license under this chapter and comply with the application procedures in this section and section 245A.043.\nThe commissioner shall act on the application within 90 working days after a complete application and any required reports have been received from other state agencies or departments, counties, municipalities, or other political subdivisions. The commissioner shall not consider an application to be complete until the commissioner receives all of the required information.\nWhen the commissioner receives an application for initial licensure that is incomplete because the applicant failed to submit required documents or that is substantially deficient because the documents submitted do not meet licensing requirements, the commissioner shall provide the applicant written notice that the application is incomplete or substantially deficient. In the written notice to the applicant the commissioner shall identify documents that are missing or deficient and give the applicant 45 days to resubmit a second application that is substantially complete. An applicant's failure to submit a substantially complete application after receiving notice from the commissioner is a basis for license denial under section 245A.043.\n(b) An application for licensure must identify all controlling individuals as defined in section 245A.02, subdivision 5a, and must designate one individual to be the authorized agent. The application must be signed by the authorized agent and must include the authorized agent's first, middle, and last name; mailing address; and email address. By submitting an application for licensure, the authorized agent consents to electronic communication with the commissioner throughout the application process. The authorized agent must be authorized to accept service on behalf of all of the controlling individuals. A government entity that holds multiple licenses under this chapter may designate one authorized agent for all licenses issued under this chapter or may designate a different authorized agent for each license. Service on the authorized agent is service on all of the controlling individuals. It is not a defense to any action arising under this chapter that service was not made on each controlling individual. The designation of a controlling individual as the authorized agent under this paragraph does not affect the legal responsibility of any other controlling individual under this chapter.\n(c) An applicant or license holder must have a policy that prohibits license holders, employees, subcontractors, and volunteers, when directly responsible for persons served by the program, from abusing prescription medication or being in any manner under the influence of a chemical that impairs the individual's ability to provide services or care. The license holder must train employees, subcontractors, and volunteers about the program's drug and alcohol policy.\n(d) An applicant and license holder must have a program grievance procedure that permits persons served by the program and their authorized representatives to bring a grievance to the highest level of authority in the program.\n(e) The commissioner may limit communication during the application process to the authorized agent or the controlling individuals identified on the license application and for whom a background study was initiated under chapter 245C. Upon implementation of the provider licensing and reporting hub, applicants and license holders must use the hub in the manner prescribed by the commissioner. The commissioner may require the applicant, except for child foster care, to demonstrate competence in the applicable licensing requirements by successfully completing a written examination. The commissioner may develop a prescribed written examination format.\n(f) When an applicant is an individual, the applicant must provide:\n(1) the applicant's taxpayer identification numbers including the Social Security number or Minnesota tax identification number, and federal employer identification number if the applicant has employees;\n(2) at the request of the commissioner, a copy of the most recent filing with the secretary of state that includes the complete business name, if any;\n(3) if doing business under a different name, the doing business as (DBA) name, as registered with the secretary of state;\n(4) if applicable, the applicant's National Provider Identifier (NPI) number and Unique Minnesota Provider Identifier (UMPI) number; and\n(5) at the request of the commissioner, the notarized signature of the applicant or authorized agent.\n(g) When an applicant is an organization, the applicant must provide:\n(1) the applicant's taxpayer identification numbers including the Minnesota tax identification number and federal employer identification number;\n(2) at the request of the commissioner, a copy of the most recent filing with the secretary of state that includes the complete business name, and if doing business under a different name, the doing business as (DBA) name, as registered with the secretary of state;\n(3) the first, middle, and last name, and address for all individuals who will be controlling individuals, including all officers, owners, and managerial officials as defined in section 245A.02, subdivision 5a, and the date that the background study was initiated by the applicant for each controlling individual;\n(4) if applicable, the applicant's NPI number and UMPI number;\n(5) the documents that created the organization and that determine the organization's internal governance and the relations among the persons that own the organization, have an interest in the organization, or are members of the organization, in each case as provided or authorized by the organization's governing statute, which may include a partnership agreement, bylaws, articles of organization, organizational chart, and operating agreement, or comparable documents as provided in the organization's governing statute; and\n(6) the notarized signature of the applicant or authorized agent.\n(h) When the applicant is a government entity, the applicant must provide:\n(1) the name of the government agency, political subdivision, or other unit of government seeking the license and the name of the program or services that will be licensed;\n(2) the applicant's taxpayer identification numbers including the Minnesota tax identification number and federal employer identification number;\n(3) a letter signed by the manager, administrator, or other executive of the government entity authorizing the submission of the license application; and\n(4) if applicable, the applicant's NPI number and UMPI number.\n(i) At the time of application for licensure or renewal of a license under this chapter, the applicant or license holder must acknowledge on the form provided by the commissioner if the applicant or license holder elects to receive any public funding reimbursement from the commissioner for services provided under the license that:\n(1) the applicant's or license holder's compliance with the provider enrollment agreement or registration requirements for receipt of public funding may be monitored by the commissioner as part of a licensing investigation or licensing inspection; and\n(2) noncompliance with the provider enrollment agreement or registration requirements for receipt of public funding that is identified through a licensing investigation or licensing inspection, or noncompliance with a licensing requirement that is a basis of enrollment for reimbursement for a service, may result in:\n(i) a correction order or a conditional license under section 245A.06, or sanctions under section 245A.07;\n(ii) nonpayment of claims submitted by the license holder for public program reimbursement;\n(iii) recovery of payments made for the service;\n(iv) disenrollment in the public payment program; or\n(v) other administrative, civil, or criminal penalties as provided by law.\nThe commissioner must not issue a license under this chapter without giving 30 calendar days' written notice to the affected municipality or other political subdivision unless the program is considered a permitted single-family residential use under sections 245A.11 and 245A.14. The commissioner may provide notice through electronic communication. The notification must be given before the first issuance of a license under this chapter and annually after that time if annual notification is requested in writing by the affected municipality or other political subdivision. State funds must not be made available to or be spent by an agency or department of state, county, or municipal government for payment to a residential or nonresidential program licensed under this chapter until the provisions of this subdivision have been complied with in full. The provisions of this subdivision shall not apply to programs located in hospitals.\nAn applicant or license holder under sections 245A.01 to 245A.16 must document compliance with applicable building codes, fire and safety codes, health rules, and zoning ordinances, or document that an appropriate waiver has been granted.\nIndividuals and organizations that are required under section 245C.03 to have or initiate background studies shall comply with the requirements in chapter 245C.\nThe notice of background study results and the commissioner's determination of the background subject's risk of harm shall be governed according to sections 245C.16 and 245C.17.\nReconsideration of a disqualification shall be governed according to sections 245C.21 to 245C.27.\nContested case hearing rights related to a disqualification shall be governed according to section 245C.28.\nDisqualification shall be governed according to sections 245C.14 and 245C.15.\nA variance for a disqualified individual shall be governed according to section 245C.30.\nWhether a disqualification determination or maltreatment determination or disposition is deemed conclusive shall be governed according to section 245C.29.\n(a) Before issuing a license under this chapter, the commissioner shall conduct an inspection of the program. The inspection must include but is not limited to:\n(1) an inspection of the physical plant;\n(2) an inspection of records and documents;\n(3) observation of the program in operation; and\n(4) an inspection for the health, safety, and fire standards in licensing requirements for a child care license holder.\n(b) The observation in paragraph (a), clause (3), is not required prior to issuing a license under subdivision 7. If the commissioner issues a license under this chapter, these requirements must be completed within one year after the issuance of the license.\n(a) When the commissioner is exercising the powers conferred by this chapter, section 626.557, and chapter 260E, the commissioner must be given access to:\n(1) the physical plant and grounds where the program is provided;\n(2) documents and records, including records maintained in electronic format;\n(3) persons served by the program; and\n(4) staff and personnel records of current and former staff whenever the program is in operation and the information is relevant to inspections or investigations conducted by the commissioner. Upon request, the license holder must provide the commissioner verification of documentation of staff work experience, training, or educational requirements.\nThe commissioner must be given access without prior notice and as often as the commissioner considers necessary if the commissioner is investigating alleged maltreatment, conducting a licensing inspection, or investigating an alleged violation of applicable laws or rules. In conducting inspections, the commissioner may request and shall receive assistance from other state, county, and municipal governmental agencies and departments. The applicant or license holder shall allow the commissioner to photocopy, photograph, and make audio and video tape recordings during the inspection of the program at the commissioner's expense. The commissioner shall obtain a court order or the consent of the subject of the records or the parents or legal guardian of the subject before photocopying hospital medical records.\n(b) Persons served by the program have the right to refuse to consent to be interviewed, photographed, or audio or videotaped. Failure or refusal of an applicant or license holder to fully comply with this subdivision is reasonable cause for the commissioner to deny the application or immediately suspend or revoke the license.\n(a) Before issuing, denying, suspending, revoking, or making conditional a license, the commissioner shall evaluate information gathered under this section. The commissioner's evaluation shall consider the applicable requirements of statutes and rules for the program or services for which the applicant seeks a license, including the disqualification standards set forth in chapter 245C, and shall evaluate facts, conditions, or circumstances concerning:\n(1) the program's operation;\n(2) the well-being of persons served by the program;\n(3) available evaluations of the program by persons receiving services;\n(4) information about the qualifications of the personnel employed by the applicant or license holder; and\n(5) the applicant's or license holder's ability to demonstrate competent knowledge of the applicable requirements of statutes and rules, including this chapter and chapter 245C, for which the applicant seeks a license or the license holder is licensed.\n(b) The commissioner shall also evaluate the results of the study required in subdivision 3 and determine whether a risk of harm to the persons served by the program exists. In conducting this evaluation, the commissioner shall apply the disqualification standards set forth in chapter 245C.\n(a) If the commissioner determines that the program complies with all applicable rules and laws, the commissioner shall issue a license consistent with this section or, if applicable, a temporary change of ownership license under section 245A.043. At minimum, the license shall state:\n(1) the name of the license holder;\n(2) the address of the program;\n(3) the effective date and expiration date of the license;\n(4) the type of license;\n(5) the maximum number and ages of persons that may receive services from the program; and\n(6) any special conditions of licensure.\n(b) The commissioner may issue a license for a period not to exceed two years if:\n(1) the commissioner is unable to conduct the observation required by subdivision 4, paragraph (a), clause (3), because the program is not yet operational;\n(2) certain records and documents are not available because persons are not yet receiving services from the program; and\n(3) the applicant complies with applicable laws and rules in all other respects.\n(c) A decision by the commissioner to issue a license does not guarantee that any person or persons will be placed or cared for in the licensed program.\n(d) Except as provided in paragraphs (i) and (j), the commissioner shall not issue a license if the applicant, license holder, or an affiliated controlling individual has:\n(1) been disqualified and the disqualification was not set aside and no variance has been granted;\n(2) been denied a license under this chapter or chapter 142B within the past two years;\n(3) had a license issued under this chapter or chapter 142B revoked within the past five years; or\n(4) failed to submit the information required of an applicant under subdivision 1, paragraph (f), (g), or (h), after being requested by the commissioner.\nWhen a license issued under this chapter or chapter 142B is revoked, the license holder and each affiliated controlling individual with a revoked license may not hold any license under chapter 245A for five years following the revocation, and other licenses held by the applicant or license holder or licenses affiliated with each controlling individual shall also be revoked.\n(e) Notwithstanding paragraph (d), the commissioner may elect not to revoke a license affiliated with a license holder or controlling individual that had a license revoked within the past five years if the commissioner determines that (1) the license holder or controlling individual is operating the program in substantial compliance with applicable laws and rules and (2) the program's continued operation is in the best interests of the community being served.\n(f) Notwithstanding paragraph (d), the commissioner may issue a new license in response to an application that is affiliated with an applicant, license holder, or controlling individual that had an application denied within the past two years or a license revoked within the past five years if the commissioner determines that (1) the applicant or controlling individual has operated one or more programs in substantial compliance with applicable laws and rules and (2) the program's operation would be in the best interests of the community to be served.\n(g) In determining whether a program's operation would be in the best interests of the community to be served, the commissioner shall consider factors such as the number of persons served, the availability of alternative services available in the surrounding community, the management structure of the program, whether the program provides culturally specific services, and other relevant factors.\n(h) The commissioner shall not issue or reissue a license under this chapter if an individual living in the household where the services will be provided as specified under section 245C.03, subdivision 1, has been disqualified and the disqualification has not been set aside and no variance has been granted.\n(i) Pursuant to section 245A.07, subdivision 1, paragraph (b), when a license issued under this chapter has been suspended or revoked and the suspension or revocation is under appeal, the program may continue to operate pending a final order from the commissioner. If the license under suspension or revocation will expire before a final order is issued, a temporary provisional license may be issued provided any applicable license fee is paid before the temporary provisional license is issued.\n(j) Notwithstanding paragraph (i), when a revocation is based on the disqualification of a controlling individual or license holder, and the controlling individual or license holder is ordered under section 245C.17 to be immediately removed from direct contact with persons receiving services or is ordered to be under continuous, direct supervision when providing direct contact services, the program may continue to operate only if the program complies with the order and submits documentation demonstrating compliance with the order. If the disqualified individual fails to submit a timely request for reconsideration, or if the disqualification is not set aside and no variance is granted, the order to immediately remove the individual from direct contact or to be under continuous, direct supervision remains in effect pending the outcome of a hearing and final order from the commissioner.\n(k) Unless otherwise specified by statute, all licenses issued under this chapter expire at 12:01 a.m. on the day after the expiration date stated on the license. A license holder must apply for and be granted a new license to operate the program or the program must not be operated after the expiration date.\n(l) The commissioner shall not issue or reissue a license under this chapter if it has been determined that a Tribal licensing authority has established jurisdiction to license the program or service.\n(m) The commissioner of human services may coordinate and share data with the commissioner of children, youth, and families to enforce this section.\n(a) A license holder must notify the commissioner, in a manner prescribed by the commissioner, and obtain the commissioner's approval before making any change that would alter the license information listed under subdivision 7, paragraph (a).\n(b) A license holder must also notify the commissioner, in a manner prescribed by the commissioner, before making any change:\n(1) to the license holder's authorized agent as defined in section 245A.02, subdivision 3b;\n(2) to the license holder's controlling individual as defined in section 245A.02, subdivision 5a;\n(3) to the license holder information on file with the secretary of state;\n(4) in the location of the program or service licensed under this chapter; and\n(5) to the federal or state tax identification number associated with the license holder.\n(c) When, for reasons beyond the license holder's control, a license holder cannot provide the commissioner with prior notice of the changes in paragraph (b), clauses (1) to (3), the license holder must notify the commissioner by the tenth business day after the change and must provide any additional information requested by the commissioner.\n(d) When a license holder notifies the commissioner of a change to the license holder information on file with the secretary of state, the license holder must provide amended articles of incorporation and other documentation of the change.\n(e) Upon implementation of the provider licensing and reporting hub, license holders must enter and update information in the hub in a manner prescribed by the commissioner.\n(a) A license holder must notify the commissioner within five business days of a change or vacancy in a key staff position under paragraph (b) or (c). The license holder must notify the commissioner of the staffing change on a form approved by the commissioner and include the name of the staff person now assigned to the key staff position and the staff person's qualifications for the position. The license holder must notify the program licensor of a vacancy to discuss how the duties of the key staff position will be fulfilled during the vacancy.\n(b) The key staff position for a children's residential facility licensed according to Minnesota Rules, parts 2960.0130 to 2960.0220, is a program director; and\n(c) The key staff positions for a detoxification program licensed according to Minnesota Rules, parts 9530.6510 to 9530.6590, are:\n(1) a program director as required by Minnesota Rules, part 9530.6560, subpart 1;\n(2) a registered nurse as required by Minnesota Rules, part 9530.6560, subpart 4; and\n(3) a medical director as required by Minnesota Rules, part 9530.6560, subpart 5.\nLicensing authority granted under this section shall not modify the presumption regarding routine hospital inspections under section 144.55, subdivision 4.\nThe commissioner may grant variances to rules that do not affect the health or safety of persons in a licensed program if the following conditions are met:\n(1) the variance must be requested by an applicant or license holder on a form and in a manner prescribed by the commissioner;\n(2) the request for a variance must include the reasons that the applicant or license holder cannot comply with a requirement as stated in the rule and the alternative equivalent measures that the applicant or license holder will follow to comply with the intent of the rule; and\n(3) the request must state the period of time for which the variance is requested.\nThe commissioner may grant a permanent variance when conditions under which the variance is requested do not affect the health or safety of persons being served by the licensed program, nor compromise the qualifications of staff to provide services. The permanent variance shall expire as soon as the conditions that warranted the variance are modified in any way. Any applicant or license holder must inform the commissioner of any changes or modifications that have occurred in the conditions that warranted the permanent variance. Failure to advise the commissioner shall result in revocation of the permanent variance and may be cause for other sanctions under sections 245A.06 and 245A.07.\nThe commissioner's decision to grant or deny a variance request is final and not subject to appeal under the provisions of chapter 14.\n[Renumbered 142B.10, subd 17]\n[Renumbered 142B.10, subd 18]\n(a) Except for foster care, the commissioner of human services may not grant a license to a residential facility for the placement of children before the commissioner has received documentation of approval of the on-site educational program from the commissioner of education according to section 125A.515.\n(b) A program licensed by the commissioner under Minnesota Rules, chapter 2960, may serve persons who are over the age of 18 but under the age of 21 when the person is:\n(1) completing secondary education or a program leading to an equivalent credential;\n(2) enrolled in an institution which provides postsecondary or vocational education;\n(3) participating in a program or activity designed to promote, or remove barriers to, employment;\n(4) employed for at least 80 hours per month; or\n(5) incapable of doing any of the activities described in clauses (1) to (4) due to a medical condition, which incapability is supported by regularly updated information in the case plan of the person.\n(c) In addition to the requirements in paragraph (b), a residential program licensed by the commissioner of human services under Minnesota Rules, parts 2960.0010 to 2960.0710, may serve persons under the age of 21 provided the facility complies with the following requirements:\n(1) for each person age 18 and older served at the program, the program must assess and document the person's risk of victimizing other residents residing in the facility, and based on the assessment, the facility must develop and implement necessary measures to minimize any risk of harm to other residents, including making arrangements for appropriate sleeping arrangements; and\n(2) the program must assure that the services and living arrangements provided to all residents are suitable to the age and functioning of the residents, including separation of services, staff supervision, and other program operations as appropriate.\n(d) Nothing in this subdivision precludes the license holder from seeking other variances under subdivision 9.\n(a) If an adult day care facility markets or otherwise promotes services for persons with Alzheimer's disease or related disorders, the facility's direct care staff and their supervisors must be trained in dementia care.\n(b) Areas of required training include:\n(1) an explanation of Alzheimer's disease and related disorders;\n(2) assistance with activities of daily living;\n(3) problem solving with challenging behaviors; and\n(4) communication skills.\n(c) The facility shall provide to consumers in written or electronic form a description of the training program, the categories of employees trained, the frequency of training, and the basic topics covered.\n(a) A license holder must ensure that persons served by the program retain the use and availability of personal funds or property unless restrictions are justified in the person's individual plan.\n(b) The license holder must ensure separation of funds of persons served by the program from funds of the license holder, the program, or program staff.\n(c) Whenever the license holder assists a person served by the program with the safekeeping of funds or other property, the license holder must:\n(1) immediately document receipt and disbursement of the person's funds or other property at the time of receipt or disbursement, including the person's signature, or the signature of the conservator or payee; and\n(2) return to the person upon the person's request, funds and property in the license holder's possession subject to restrictions in the person's treatment plan, as soon as possible, but no later than three working days after the date of request.\n(d) License holders and program staff must not:\n(1) borrow money from a person served by the program;\n(2) purchase personal items from a person served by the program;\n(3) sell merchandise or personal services to a person served by the program;\n(4) require a person served by the program to purchase items for which the license holder is eligible for reimbursement; or\n(5) use funds of persons served by the program to purchase items for which the facility is already receiving public or private payments.\n(a) The license holder shall develop program policies and procedures necessary to maintain compliance with licensing requirements under Minnesota Statutes and Minnesota Rules.\n(b) The license holder shall:\n(1) provide training to program staff related to their duties in implementing the program's policies and procedures developed under paragraph (a);\n(2) document the provision of this training; and\n(3) monitor implementation of policies and procedures by program staff.\n(c) The license holder shall keep program policies and procedures readily accessible to staff and index the policies and procedures with a table of contents or another method approved by the commissioner.\n(d) An adult foster care license holder that provides foster care services to a resident under chapter 256S must annually provide a copy of the resident termination policy under section 245A.11, subdivision 11, to a resident covered by the policy.\nUpon request, the license holder must cooperate with state and local government disaster planning agencies working to prepare for or react to emergencies presented by a pandemic outbreak.\n(a) Except for license holders who reside on the premises and child care providers, an applicant for initial or continuing licensure or certification must submit a written plan indicating how the program will ensure the transfer of clients and records for both open and closed cases if the program closes. The plan must provide for managing private and confidential information concerning program clients. The plan must also provide for notifying affected clients of the closure at least 25 days prior to closure, including information on how to access their records. A controlling individual of the program must annually review and sign the plan.\n(b) Plans for the transfer of open cases and case records must specify arrangements the program will make to transfer clients to another provider or county agency for continuation of services and to transfer the case record with the client.\n(c) Plans for the transfer of closed case records must be accompanied by a signed agreement or other documentation indicating that a county or a similarly licensed provider has agreed to accept and maintain the program's closed case records and to provide follow-up services as necessary to affected clients.\nUnless such reporting is otherwise already required under statute or rule, programs licensed under this chapter must have a written policy for reporting the death of an individual served by the program to the commissioner of human services. Within 24 hours of receiving knowledge of the death of an individual served by the program, the license holder shall notify the commissioner of the death. If the license holder has reason to know that the death has been reported to the commissioner, a subsequent report is not required.\nMS 2022 [Repealed, 2024 c 80 art 2 s 75]",
	"repealed": false
}