{
	"id": "256B.6928",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.6928",
	"title": "256B.6928 MANAGED CARE RATES AND PAYMENTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Base amount\" has the meaning given in Code of Federal Regulations, part 42, section 438.6, paragraph (a).\n(c) \"Budget neutral\" has the meaning given in Code of Federal Regulations, part 42, section 438.5, paragraph (a).\n(d) \"Credibility adjustment\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(e) \"Full credibility\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(f) \"Incentive arrangement\" has the meaning given in Code of Federal Regulations, part 42, section 438.6.\n(g) \"Medical loss ratio\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(h) \"Medical loss ratio reporting year\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(i) \"Member months\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(j) \"No credibility\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(k) \"Partial credibility\" has the meaning given in Code of Federal Regulations, part 42, section 438.8, paragraph (b).\n(l) \"Pass-through payment\" has the meaning given in Code of Federal Regulations, part 42, section 438.6, paragraph (a).\n(m) \"Rate cell\" has the meaning given in Code of Federal Regulations, part 42, section 438.2.\n(n) \"Risk adjustment\" has the meaning given in Code of Federal Regulations, part 42, section 438.5, paragraph (a).\n(a) Capitation rates for managed care organizations must be reviewed and approved by the Centers for Medicare and Medicaid Services as actuarially sound. The capitation rates must be provided in the format and time frame required by Code of Federal Regulations, part 42, section 438.7. Capitation rates must:\n(1) be developed in accordance with the rates standards in Code of Federal Regulations, part 42, section 438.5, and generally accepted actuarial principles and practices. Any proposed differences in capitation rates between covered populations must be based on valid rate development standards and not on the rate of federal financial participation associated with the covered populations;\n(2) be appropriate for the populations covered and the services furnished under the contract;\n(3) meet the requirements for availability of services, adequate capacity, and coordination and continuity of care in accordance with Code of Federal Regulations, part 42, sections 438.206, 438.207, and 438.208;\n(4) be specific to each rate cell under the contract, and must not cross-subsidize or be cross-subsidized by payments from any other rate cell;\n(5) meet any special contract provisions in accordance with Code of Federal Regulations, part 42, section 438.6; and\n(6) be developed to reasonably achieve a medical loss ratio standard of at least 85 percent for the rate year, or a higher minimum medical loss ratio if mandated by the commissioner, as long as the capitation rates are adequate for reasonable, appropriate, and attainable nonbenefit costs.\n(b) An independent actuary must certify that the rates were developed in accordance with Code of Federal Regulations, part 42, section 438.3, paragraph (c), clause (1), item (ii), paragraph (e).\n(a) In developing capitation rates, the commissioner shall:\n(1) identify and develop base utilization and price data, including validated encounter data and audited financial reports received from the managed care organizations that demonstrate experience for the populations served by the managed care organizations, for the three most recent and complete years before the rating period;\n(2) develop and apply reasonable trend factors, including cost and utilization, to base data that are developed from actual experience of the medical assistance population or a similar population according to generally accepted actuarial practices and principles;\n(3) develop the nonbenefit component of the rate to account for reasonable expenses related to the managed care organization's administration; taxes; licensing and regulatory fees; contribution to reserves; risk margin; cost of capital and other operational costs associated with the managed care organization's provision of covered services to enrollees;\n(4) consider the value of cost-sharing for rate development purposes, regardless of whether the managed care organization imposes the cost-sharing on the enrollee or the cost-sharing is collected by the provider;\n(5) make appropriate and reasonable adjustments to account for changes to the base data, programmatic changes, changes to nonbenefit components, and any other adjustment necessary to establish actuarially sound rates. Each adjustment must reasonably support the development of an accurate base data set for purposes of rate setting, reflect the health status of the enrolled population, and be developed in accordance with generally accepted actuarial principles and practices;\n(6) consider the managed care organization's past medical loss ratio in the development of the capitation rates and consider the projected medical loss ratio; and\n(7) select a prospective or retrospective risk adjustment methodology that must be developed in a budget-neutral manner consistent with generally accepted actuarial principles and practices.\n(b) The base data must be derived from the medical assistance population or, if data on the medical assistance population is not available, derived from a similar population and adjusted to make the utilization and price data comparable to the medical assistance population. Data must be in accordance with actuarial standards for data quality and an explanation of why that specific data is used must be provided in the rate certification. If the commissioner is unable to base the rates on data that are within the three most recent and complete years before the rating period, the commissioner may request an approval from the Centers for Medicare and Medicaid Services for an exception. The request must describe why an exception is necessary and describe the actions that the commissioner intends to take to comply with the request.\n(a) If the commissioner uses risk-sharing mechanisms, including reinsurance, risk corridors, or stop-loss limits, the risk-sharing mechanism must be described in the contract, and must be developed according to the rate development standards and generally accepted actuarial principles and practices.\n(b) The commissioner may utilize incentive payment arrangements in managed care organization contracts. Any incentive arrangement utilized by the commissioner must be made available to all managed care organizations under contract with the commissioner under the same terms of performance. The payment must not exceed 105 percent of the approved capitation payments attributable to the enrollees or services covered by the incentive arrangement and must be actuarially sound. For all incentive arrangements the contract must state that the arrangement is:\n(1) for a fixed period of time and performance is measured during the rating period in which the incentive arrangement is applied;\n(2) not renewed automatically; and\n(3) associated with specified activities, targets, performance measures, or quality-based outcomes in the quality strategy described under section 256B.6927.\nThe incentive payment arrangement must not condition a managed care organization's participation in the incentive arrangement upon entering into or adhering to an intergovernmental transfer agreement.\n(c) The commissioner may utilize withhold arrangements in managed care organization contracts. Any withhold arrangement utilized by the commissioner must be applied to all managed care organizations under contract with the commissioner under the same terms of performance. Any withhold arrangement must ensure that the capitation payment minus any portion of the withheld funds that is not reasonably achievable is actuarially sound. The total amount of the withheld funds, achievable or not, must be reasonable and must take into consideration each managed care organization's financial operating needs, accounting for the size and characteristics of the populations covered under the contract, as well as the managed care organization's capital reserves, as measured by the risk based capital level, months of claims reserve, or other appropriate measure of reserves. The data, assumptions, and methodologies used to determine the portion of the withhold that is reasonably achievable must be submitted as part of the documentation required by Code of Federal Regulations, part 42, section 438.7, paragraph (b), clause (6). For all withhold arrangements, the contract must state that the arrangement is:\n(1) for a fixed period of time and performance is measured during the rating period in which the withhold arrangement is applied;\n(2) not renewed automatically; and\n(3) associated with specified activities, targets, performance measures, or quality-based outcomes in the state's quality strategy.\nThe withhold payment arrangement must not condition a managed care organization's participation in the withhold arrangement upon entering into or adhering to an intergovernmental transfer agreement.\n(a) The commissioner shall not direct managed care organizations expenditures under the managed care contract, except as permitted under Code of Federal Regulations, part 42, section 438.6(c). The exception under this paragraph includes the following situations:\n(1) implementation of a value-based purchasing model for provider reimbursement, including pay-for-performance arrangements, bundled payments, or other service payments intended to recognize value or outcomes over volume of services;\n(2) participation in a multipayer or medical assistance-specific delivery system reform or performance improvement initiative; or\n(3) implementation of a minimum or maximum fee schedule, or a uniform dollar or percentage increase for network providers that provide a particular service. The maximum fee schedule must allow the managed care organization the ability to reasonably manage risk and provide discretion in accomplishing the goals of the contract.\n(b) Any managed care contract that directs managed care organization expenditures as permitted under paragraph (a), clauses (1) to (3), must be developed in accordance with Code of Federal Regulations, part 42, sections 438.4 and 438.5; comply with actuarial soundness and generally accepted actuarial principles and practices; and have written approval from the Centers for Medicare and Medicaid Services before implementation. To obtain approval, the commissioner shall demonstrate in writing that the contract arrangement:\n(1) is based on the utilization and delivery of services;\n(2) directs expenditures equally, using the same terms of performance for a class of providers providing service under the contract;\n(3) is intended to advance at least one of the goals and objectives in the commissioner's quality strategy;\n(4) has an evaluation plan that measures the degree to which the arrangement advances at least one of the goals in the commissioner's quality strategy;\n(5) does not condition network provider participation on the network provider entering into or adhering to an intergovernmental transfer agreement; and\n(6) is not renewed automatically.\n(c) For contract arrangements identified in paragraph (a), clauses (1) and (2), the commissioner shall:\n(1) make participation in the value-based purchasing model, special delivery system reform, or performance improvement initiative available, using the same terms of performance, to a class of providers providing services under the contract related to the model, reform, or initiative; and\n(2) use a common set of performance measures across all payers and providers.\n(d) The commissioner shall not set the amount or frequency of the expenditures or recoup from the managed care organization any unspent funds allocated for these arrangements.\nThe commissioner may make a monthly capitation payment to a managed care organization for an enrollee under the age of 65 receiving treatment for psychiatric or substance use disorder in an institution for mental diseases in accordance with Code of Federal Regulations, part 42, section 438.6, paragraph (e).\n(a) The commissioner shall submit the rate certifications to the Centers for Medicare and Medicaid Services for review and approval at the same time as the managed care contracts. The rate certification must satisfy Code of Federal Regulations, part 42, section 438.7, paragraph (b), and must include:\n(1) base data used in the rate setting process;\n(2) trend, including changes in the utilization and the price of services;\n(3) the nonbenefit component of the rate;\n(4) any adjustments;\n(5) the prospective and retrospective risk adjustment methodology; and\n(6) any special contract provisions related to payment.\n(b) The commissioner, through the state's actuary, must certify the final capitation rates paid per rate cell under each contract and document the underlying data, assumptions, and methodologies.\n(c) The commissioner may pay a managed care organization a capitation rate under a managed care contract that is different than the capitation rate paid to another managed care organization, if each capitation rate per rate cell that is paid is independently developed and set in accordance with Code of Federal Regulations, part 42, sections 438.4, 438.5, 438.6, and 438.8. The commissioner may increase or decrease the capitation rate per rate cell in accordance with Code of Federal Regulations, part 42, sections 438.4, paragraph (b), clause (4), and 438.7, paragraph (c), up to 1.5 percent without submitting a revised rate certification.\n(d) If the commissioner determines that a retroactive adjustment to the capitation rate is necessary, the retroactive adjustment must be supported by a rationale for the adjustment and the data. Assumptions and methodologies used to develop the adjustment must be described with enough detail to allow the Centers for Medicare and Medicaid Services or an actuary to determine the reasonableness of the adjustment. Any retroactive adjustments must be certified by an actuary in a revised rate certification and submitted to the Centers for Medicare and Medicaid Services for approval as a contract amendment. All adjustments are subject to timely federal claim filing requirements.\n(e) The commissioner shall, upon request from the Centers for Medicare and Medicaid Services, provide additional information if the Centers for Medicare and Medicaid Services determines the information is pertinent to certification approval. The commissioner shall identify whether the additional information shall be provided by the commissioner, the actuary, or another party.\n(a) The commissioner shall require that each managed care organization calculate and submit to the commissioner a medical loss ratio report for each contract year. The calculation of the medical loss ratio in the medical loss ratio reporting year must be the ratio of the numerator to the denominator. The numerator must be the sum of the managed care organization's incurred claims, the managed care organization's expenditures for activities that improve health care quality, and fraud prevention activities. The denominator must be calculated as the managed care organization's adjusted premium revenue minus the managed care organization's federal, state, and local taxes and licensing and regulatory fees identified in Code of Federal Regulations, part 42, section 438.8, paragraph (f), clause (3). The total amount of the denominator for a managed care organization that is assumed by another managed care organization must be reported by the assuming managed care organization for the entire medical loss ratio reporting year. The managed care organization must aggregate the data for all eligibility groups covered under the contract, unless the commissioner requires separate reporting and a separate medical loss ratio calculation for specific populations.\n(b) Incurred claims must be identified by the expenditures, liabilities, reserves, deductions, and exclusions in accordance with Code of Federal Regulations, part 42, section 438.8, paragraph (e), clause (2).\n(c) Activities that improve health care quality must be in one category in accordance with Code of Federal Regulations, part 42, section 438.8, paragraph (e), clause (3).\n(d) Fraud prevention activities, including managed care organization expenditures on activities related to fraud prevention must be identified in accordance with Code of Federal Regulations, part 45, section 158.\n(e) Premium revenue must include capitation payments; onetime payments for specific life events of enrollees; other payments to the managed care organization in accordance with Code of Federal Regulations, part 42, section 438.6, paragraph (b), clause (3); unpaid cost-sharing amounts; and changes to unearned premium reserves, net payments, and receipts related to risk-sharing mechanisms.\n(f) When calculating the medical loss ratio, each expense must be included under only one type of expense, unless a portion of the expense fits under the definition of, or criteria for, one type of expense and the remainder fits into a different type of expense, in which case the expense must be prorated between types of expenses. Expenditures that benefit multiple contracts or populations, or contracts other than those being reported, must be reported on a pro rata basis. Expenses must be allocated using the methods described in Code of Federal Regulations, part 42, section 438.8, paragraph (g), clause (2).\n(g) The commissioner may require the managed care organization to provide a remittance if the medical loss ratio for the medical loss ratio reporting year does not meet the minimum medical loss ratio standard of 85 percent, or if applicable, a higher ratio mandated by the commissioner.\n(a) The commissioner shall require each managed care organization to submit a report to the commissioner for each medical loss ratio reporting year that includes the information identified in Code of Federal Regulations, part 42, section 438.8, paragraph (k). The report must be submitted within 12 months of the end of each medical loss ratio reporting year. The managed care organization must require any third-party vendor providing claims adjudication to provide all underlying data associated with medical loss ratio reporting to the managed care organization within 180 days of the end of the medical loss ratio reporting year or within 30 days of being requested by the managed care organization to calculate and validate the accuracy of medical loss ratio reporting. The managed care organization must include with the medical loss ratio report an attestation as to the accuracy of the calculation of the medical loss ratio.\n(b) The commissioner shall annually submit to the Centers for Medicare and Medicaid Services a summary description of the reports received from the managed care organizations in accordance with Code of Federal Regulations, part 42, section 438.8, paragraph (k), along with the rate certification required under subdivision 7. At a minimum, the summary description must include for the medical loss ratio report reporting year, the amount of the numerator, the amount of the denominator, the medical loss ratio percentage achieved, the number of member months, and any remittances owed. If through the contract the commissioner requires the managed care organization to pay remittances for not meeting the minimum medical loss ratio, the commissioner must reimburse the Centers for Medicare and Medicaid Services the federal share that reflects any differences in the federal matching rate. If a remittance is owed, the commissioner shall submit with the required report a separate report describing the methodology used to determine the state and federal shares of the remittance.\n(c) If the commissioner makes a retroactive change to the capitation payments for a medical loss ratio reporting year for which the report was already submitted to the commissioner, the managed care organization shall recalculate the medical loss ratio for that year and submit a new report meeting the reporting requirements under paragraph (a).\n(d) The commissioner may exempt a newly contracted managed care organization from calculating and reporting the medical loss ratio for the first year of the managed care organization's operation as required under this subdivision. If a managed care organization is excluded, the managed care organization must comply with the requirements of this section during the next medical loss ratio reporting year.",
	"repealed": false
}