{
	"id": "353.656",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.656",
	"title": "353.656 DISABILITY BENEFITS.",
	"text": "(a) A member of the police and fire plan who (1) is not a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, (2) has a condition that meets the definition of a duty disability under section 353.01, subdivision 41, and (3) has filed an application under section 353.031 that was approved by the executive director is entitled to receive disability benefits during the period of disability in an amount equal to 60 percent of the member's average salary as defined under section 353.01, subdivision 17a, plus an additional 3.0 percent of that average salary for each year of service in excess of 20 years.\n(b) To be eligible for a benefit under paragraph (a), the member must have:\n(1) not met the age and vesting requirements for a retirement annuity under section 353.651, subdivision 1; or\n(2) met the age and vesting requirements under that subdivision, but does not have at least 20 years of allowable service credit.\n(c) If paragraph (b), clause (2), applies, the disability benefit must be paid for a period of 60 months from the disability benefit accrual date and at the end of that period is subject to provisions of subdivision 5a.\n(d) If the disability under this subdivision occurs before the member has at least five years of allowable service credit in the police and fire plan, the disability benefit must be computed on the average salary from which deductions were made for contribution to the police and fire fund.\nMS 2006 [Renumbered, subd 1b]\n(a) A member of the police and fire plan who (1) is not a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, (2) has a condition that meets the definition of a duty disability under section 353.01, subdivision 41, and that is also a total and permanent disability as defined under section 353.01, subdivision 19, and (3) has filed an application under section 353.031 that was approved by the executive director is entitled to receive, for life, a disability benefit in an amount equal to 99 percent of the member's average salary as defined under section 353.01, subdivision 17a. Beginning July 1, 2023, a member receiving a benefit under this paragraph must receive a disability benefit in an amount equal to the greater of 99 percent of the member's average salary as defined under section 353.01, subdivision 17a, in effect as of the date of the disability or the amount of the disability benefit the member was receiving on June 30, 2023.\n(b) A disability benefit payable under paragraph (a) is subject to the reapplication requirements under section 353.33, subdivision 6, but the reapplication may be waived if the executive director receives a written statement from the medical advisor retained by the association under section 353.031, subdivision 5, that no improvement can be expected in the member's disability condition that was the basis for payment of the benefit under paragraph (a).\n(c) A member receiving a disability benefit under this subdivision who is found to no longer have a total and permanent disability as defined under section 353.01, subdivision 19, but continues to have a duty disability as defined under section 353.01, subdivision 41, is subject to subdivision 1 upon written notice from the association's medical advisor that the person no longer has a total and permanent disability, and may, upon application, elect an optional annuity under subdivision 1b.\n(d) If a member approved for disability benefits under this subdivision dies before attaining normal retirement age as defined under section 353.01, subdivision 37, paragraph (b), or within 60 months of the effective date of the disability, whichever is later, the surviving spouse is entitled to receive a survivor benefit under section 353.657, subdivision 2, paragraph (a), clause (1), if the death is the direct result of the disabling condition for which disability benefits were approved, or section 353.657, subdivision 2, paragraph (a), clause (2), if the death is not directly related to the disabling condition for which benefits were approved under this subdivision.\n(e) If the election of an actuarial equivalent optional annuity is not made at the time the member is entitled to begin to receive total and permanent disability benefits, an election must be made within 90 days before the member attains normal retirement age as defined under section 353.01, subdivision 37, paragraph (b), or has collected total and permanent disability benefits for 60 months, whichever is later. If a member receiving disability benefits who has dependent children dies, subdivision 6a, paragraph (c), applies.\n(a) A disabled member of the police and fire fund may elect to receive the normal disability benefit or an actuarial equivalent optional annuity. If the election of an actuarial equivalent optional annuity is made before the commencement of payment of the disability benefit, the member is entitled to begin payment of the optional annuity on the same date that the normal disability benefit would have begun. For the purpose of this subdivision, a \"normal disability benefit\" is a monthly benefit payable for the life of the member and equal to a percentage of the member's average salary as defined under section 353.01, subdivision 17a. The percentage is 60 percent if the disability is a duty disability under subdivision 1 or 99 percent if the disability is a total and permanent disability.\n(b) If an election of an optional annuity is not made before the commencement of the disability benefit, the disability benefit recipient may elect an optional annuity:\n(1) within 90 days before normal retirement age;\n(2) upon the filing of an application to convert to an early retirement annuity, if electing to convert to an early retirement annuity before the normal retirement age;\n(3) within 90 days before the expiration of the 60-month period for which a disability benefit is paid, if the disability benefit is payable because the disabled member did not have at least 20 years of allowable service at normal retirement age; or\n(4) upon a determination that the disability benefit recipient continues to be disabled under subdivision 1, but no longer has a total and permanent disability under subdivision 1a.\n(c) If a disabled member who has named a joint and survivor optional annuity beneficiary dies before the disability benefit ceases and is recalculated under subdivision 5a, the beneficiary eligible to receive the joint and survivor annuity may elect to have the annuity converted at the times designated in paragraph (b), clause (1), (2), or (3), whichever allows for the earliest payment of a higher joint and survivor annuity option resulting from recalculation under subdivision 5a, paragraph (e).\n(d) A disabled member may name a person other than the spouse as beneficiary of a joint and survivor annuity only if the spouse of the disabled member permanently waives surviving spouse coverage on the disability application form prescribed by the executive director.\n(e) If the spouse of the member permanently waives survivor coverage, the dependent child or children, if any, continue to be eligible for dependent child benefits under section 353.657, subdivision 3, and the designated optional annuity beneficiary may draw the monthly benefit.\n(f) Any optional annuity under this subdivision, plus dependent child benefits, if applicable, are subject to the maximum and minimum family benefit amounts specified in section 353.657, subdivision 3a.\nMS 2022 [Repealed, 2023 c 48 s 33]\nMS 2022 [Repealed, 2023 c 48 s 33]\n(a) A member of the police and fire plan who (1) is not a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, (2) has at least one year of allowable service, (3) has a condition that meets the definition of a regular disability under section 353.01, subdivision 46, and (4) has filed an application under section 353.031 that was approved by the executive director is entitled to receive a disability benefit in an amount equal to 45 percent of the member's average salary as defined in section 353.01, subdivision 17a.\n(b) To be eligible for a benefit under paragraph (a), the member must have at least one year of allowable service credit and have:\n(1) not met the age and vesting requirements for a retirement annuity under section 353.651, subdivision 1; or\n(2) met the age and vesting requirements under that subdivision, but does not have at least 15 years of allowable service credit.\n(c) If paragraph (b), clause (2), applies, the disability benefit must be paid for a period of 60 months from the disability benefit accrual date and, at the end of that period, is subject to provisions of subdivision 5a.\n(d) For a member who is employed as a full-time firefighter by the Department of Military Affairs of the state of Minnesota, allowable service as a full-time state Military Affairs Department firefighter credited by the Minnesota State Retirement System may be used in meeting the minimum allowable service requirement of this subdivision.\n(a) A member of the police and fire plan who (1) is not a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, (2) has a condition that meets the definition of a regular disability under section 353.01, subdivision 46, and that is also a total and permanent disability as defined under section 353.01, subdivision 19, and (3) has filed an application under section 353.031 that was approved by the executive director is entitled to receive, for life, a disability benefit in an amount equal to 45 percent of the member's average salary as defined under section 353.01, subdivision 17a, plus an additional 3.0 percent of that average salary for each year of service in excess of 15 years.\n(b) A disability benefit payable under paragraph (a) is subject to eligibility review under section 353.33, subdivision 6, but the review may be waived if the executive director receives a written statement from the association's medical advisor that no improvement can be expected in the member's disabling condition that was the basis for payment of the benefit under paragraph (a). A member receiving a disability benefit under this subdivision who is found to no longer have a total and permanent disability as defined under section 353.01, subdivision 19, but continues to have a regular disability as defined under section 353.01, subdivision 46, is subject to subdivision 3 upon written notice from the association's medical advisor that the person no longer has a total and permanent disability.\n(c) A member approved for disability benefits under this subdivision may elect to receive a normal disability benefit or an actuarial equivalent optional annuity. If the election of an actuarial equivalent optional annuity is not made by the date on which the member is entitled to begin the total and permanent disability benefit, the election must be made within 90 days before the member attains normal retirement age as defined in section 353.01, subdivision 37, paragraph (b), or, if later, the date on which the member receives the 60th monthly payment of the disability benefit. No surviving spouse benefits are payable if the member dies during the period in which a normal disability benefit is being paid. If a member receiving disability benefits who has dependent children dies, subdivision 6a, paragraph (c), applies. For the purpose of this subdivision, a \"normal disability benefit\" is a monthly benefit payable for the life of the member.\n(a) No member is entitled to receive a disability benefit payment when there remains to the member's credit unused annual leave, sick leave, or any other employer-provided salary continuation plan, or under any other circumstances when, during the period of disability, there has been no impairment of the person's salary as a police officer, a firefighter, or a paramedic as defined in section 353.64, subdivision 10, whichever applies.\n(b) This paragraph applies to members who begin disability payments before July 1, 2023, and either are not required to reapply under section 353.031, subdivision 8, or have not reached the end of one year or three years, as applicable, when reapplication under section 353.031, subdivision 8, is required. If a disabled member resumes a gainful occupation with earnings that, when added to the single life disability benefit, and workers' compensation benefit if applicable, exceed the disability benefit recipient's reemployment earnings limit, the amount of the disability benefit must be reduced during the months of employment and receipt of workers' compensation benefits, if applicable, as provided in this paragraph. The disability benefit recipient's reemployment earnings limit is the greater of (1) the monthly salary earned at the date of disability, or (2) 125 percent of the base monthly salary currently paid by the employing governmental subdivision for similar positions.\nThe disability benefit must be reduced by one dollar for each three dollars by which the total amount of the current monthly disability benefit, any monthly workers' compensation benefits if applicable, and actual monthly earnings exceed the greater disability benefit recipient's reemployment earnings limit. In no event may the monthly disability benefit as adjusted under this subdivision exceed the disability benefit originally allowed.\n(c) This paragraph applies to members who begin disability payments or are required to reapply under section 353.031, subdivision 8, on or after July 1, 2023. Beginning the calendar year after application or reapplication, if a disabled member resumes a gainful occupation with earnings, the amount of the member's disability benefit must be reduced each year until normal retirement age by the sum of clauses (1) and (2), not to exceed the amount of the member's disability benefit:\n(1) for members with less than 20 years of service for a duty disability benefit or less than 15 years of service for a regular disability benefit, one dollar for each dollar of reemployment earnings, but not more than the lesser of (i) and (ii), and not to exceed the employee contribution rate as defined under section 353.65, subdivision 2, multiplied by the average salary used to determine the amount of the member's disability benefit when granted:\n(i) an amount equal to the employee contribution rate as defined under section 353.65, subdivision 2, multiplied by the average salary used to determine the amount of the member's disability benefit, when granted, multiplied by the difference between 20 for a duty disability benefit or 15 for a regular disability benefit and the member's years of service, divided by 55 minus the member's age at the time of disability; or\n(ii) 50 percent of the member's yearly reemployment earnings; and\n(2) for all members:\n(i) one dollar for every two dollars, up to 125 percent of the base monthly salary, by which the sum exceeds the base monthly salary; and\n(ii) one dollar for each dollar by which the sum exceeds 125 percent of the base monthly salary;\nwhere \"sum\" means the sum of the current disability benefit plus actual monthly reemployment earnings and \"base monthly salary\" means the base monthly salary currently paid by the employing governmental subdivision for similar positions.\n(d) Paragraphs (b) and (c) do not apply to a member receiving total and permanent disability benefits under section 353.656, subdivision 1a or 3a.\n[Repealed, 2007 c 134 art 4 s 36]\n(a) The association shall cease the payment of any disability benefit the first of the month following the reinstatement of a member to full time or less than full-time service in a position covered by the police and fire fund.\n(b) A disability benefit paid to a disabled member of the police and fire plan, that was granted under laws in effect after June 30, 2007, terminates at the end of the month in which the member:\n(1) reaches normal retirement age;\n(2) if the disability benefit is payable for a 60-month period as determined under subdivisions 1 and 3, as applicable, the first of the month following the expiration of the 60-month period; or\n(3) if the disabled member so chooses, the end of the month in which the member has elected to convert to an early retirement annuity under section 353.651, subdivision 4.\n(c) If the police and fire plan member continues to be disabled when the disability benefit terminates under this subdivision, the member is deemed to be retired. The individual is entitled to receive a normal retirement annuity or an early retirement annuity under section 353.651, whichever is applicable, as further specified in paragraph (d) or (e). If the individual did not previously elect an optional annuity under subdivision 1b, paragraph (a), the individual may elect an optional annuity under subdivision 1b, paragraph (b).\n(d) A member of the police and fire plan who is receiving a disability benefit under this section may, upon application, elect to receive an early retirement annuity under section 353.651, subdivision 4, at any time after attaining age 50, but must convert to a retirement annuity no later than the end of the month in which the disabled member attains normal retirement age. An early retirement annuity elected under this subdivision must be calculated on the disabled member's accrued years of service and average salary as defined in section 353.01, subdivision 17a, and when elected, the member is deemed to be retired.\n(e) When an individual's disability benefit terminates under paragraph (b), clause (1) or (2), and is recalculated as a retirement annuity, the annuity must be based on clause (1) or (2), whichever provides the greater amount:\n(1) the benefit amount at the time of reclassification, including all prior adjustments provided under Minnesota Statutes 2008, section 11A.18, through January 1, 2009, and thereafter as provided in section 356.415; or\n(2) a benefit amount computed on the member's actual years of accrued allowable service credit and the law in effect at the time the disability benefit first accrued, plus any increases that would have applied since that date under Minnesota Statutes 2008, section 11A.18, through January 1, 2009, and thereafter as provided in section 356.415.\n[Repealed, 1993 c 307 art 4 s 54]\n(a) If a member who is receiving a disability benefit that was granted under the laws in effect before July 1, 2007, dies before attaining normal retirement age as defined under section 353.01, subdivision 37, paragraph (b), or within five years of the effective date of the disability, whichever is later, the surviving spouse shall receive a survivor benefit under section 353.657, subdivision 2, paragraph (a), clause (2); or 2a, unless the surviving spouse elected to receive a refund under section 353.32, subdivision 1. The joint and survivor optional annuity under subdivision 2a is based on the minimum disability benefit under subdivision 1 or 3, or the deceased member's allowable service, whichever is greater.\n(b) If the disability benefit was granted under the laws in effect before July 1, 2007, and the disabled member is living at the age required for receipt of a retirement annuity under section 353.651, subdivision 1, or five years after the effective date of the disability, whichever is later, the disabled member may continue to receive a normal disability benefit, or the member may elect a joint and survivor optional annuity under section 353.30. The optional annuity is based on the minimum disability benefit under subdivision 1 or 3, or the member's allowable service, whichever is greater. The election of this joint and survivor annuity must occur within 90 days before attaining normal retirement age as defined under section 353.01, subdivision 37, paragraph (b), or within 90 days before the five-year anniversary of the effective date of the disability benefit, whichever is later. The optional annuity takes effect the first of the month following the month in which the person attains the age required for receipt of a retirement annuity under section 353.651, subdivision 1, or reaches the five-year anniversary of the effective date of the disability benefit, whichever is later.\n(c) If any disabled member dies while receiving a benefit and has a dependent child or children, the association shall grant a dependent child benefit under section 353.657, subdivision 3.\n[Repealed, 1992 c 432 art 2 s 51]\nThe application procedures to determine eligibility for police and fire plan disability benefits are defined under section 353.031.\n[Repealed, 2007 c 134 art 4 s 36]\n(a) Except for a total and permanent disability under subdivision 1a, a member is entitled to begin to receive payment of a disability benefit when the member is no longer receiving any form of compensation, whether salary or paid leave 90 days preceding the filing of an application; or, if annual or sick leave, or any other employer-paid salary continuation plan is paid for more than the 90-day period, from the date on which the payment of salary ceased, whichever is later. Except for a total and permanent disability under subdivision 1a, no member is entitled to receive a disability benefit payment when there remains to the member's credit any unused annual leave, sick leave, or any other employer-paid salary continuation benefit, or under any other circumstances when, during the period of disability, there has been no impairment of the person's salary.\n(b) Payment of the disability benefit must not continue beyond the end of the month in which entitlement has terminated. If the disabled member dies prior to negotiating the check for the month in which death occurs, payment must be made to the surviving spouse or, if none, to the designated beneficiary or, if none, to the estate.\n[Repealed, 2007 c 134 art 4 s 36]\n[Repealed, 2007 c 134 art 4 s 36]\n(a) No benefits are payable for any disability resulting in whole or in part from the member's current use of illegal drugs. This exclusion does not apply to a member who:\n(1) has successfully completed a supervised drug rehabilitation program or has otherwise been rehabilitated successfully and is no longer engaging in such use; or\n(2) is participating in a supervised rehabilitation program and is no longer engaging in such use.\n(b) \"Illegal use of drugs\" means the use of drugs, the possession or distribution of which is unlawful under United States Code, title 21, section 801. \"Illegal use of drugs\" does not include the use of a drug taken under the supervision of a licensed health care professional, or other uses authorized by United States Code, title 21, or other provisions of law.\nA disability benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}