{
	"id": "629.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.292",
	"title": "629.292 UNIFORM MANDATORY DISPOSITION OF DETAINERS ACT.",
	"text": "(a) Any person who is imprisoned in a penal or correctional institution or other facility in the Department of Corrections of this state may request final disposition of any untried indictment or complaint pending against the person in this state. The request shall be in writing addressed to the court in which the indictment or complaint is pending and to the prosecuting attorney charged with the duty of prosecuting it, and shall set forth the place of imprisonment.\n(b) The commissioner of corrections or other official designated by the commissioner having custody of prisoners shall promptly inform each prisoner in writing of the source and nature of any untried indictment or complaint against the prisoner of which the commissioner of corrections or such official had knowledge or notice and of the prisoner's right to make a request for final disposition thereof.\n(c) Failure of the commissioner of corrections or other such official to inform a prisoner, as required by this section, within one year after a detainer has been filed at the institution shall entitle the prisoner to a final dismissal of the indictment or complaint with prejudice.\nThe request shall be delivered to the commissioner of corrections or other official designated by the commissioner having custody of the prisoner, who shall forthwith:\n(1) certify the term of commitment under which the prisoner is being held, the time already served on the sentence, the time remaining to be served, the good time earned, the time of parole eligibility of the prisoner, and any decisions of the commissioner of corrections relating to the prisoner; and\n(2) send by registered or certified mail, return receipt requested, one copy of the request and certificate to the court and one copy to the prosecuting attorney to whom it is addressed, or send by e-filing and e-serving the paperwork, one copy of the request to the court and one copy to the prosecuting attorney to whom it is addressed.\nWithin six months after the receipt of the request and certificate by the court and prosecuting attorney, or within such additional time as the court for good cause shown in open court may grant, the prisoner or counsel being present, the indictment or information shall be brought to trial; but the parties may stipulate for a continuance or a continuance may be granted on notice to the attorney of record and opportunity for the attorney to be heard. If, after such a request, the indictment or information is not brought to trial within that period, no court of this state shall any longer have jurisdiction thereof, nor shall the untried indictment or information be of any further force or effect, and the court shall dismiss it with prejudice.\nEscape from custody by any prisoner subsequent to the prisoner's execution of a request for final disposition of an untried indictment or information voids the request.\nThe commissioner of corrections or other official designated by the commissioner having custody of prisoners shall arrange for all prisoners to be informed in writing of the provisions of this section, and for a record thereof to be placed in the prisoner's file.\nThis section shall be so construed as to effectuate its general purpose to make uniform the law of those states which enact it.\nThis section may be cited as the Uniform Mandatory Disposition of Detainers Act.",
	"repealed": false
}