{
	"id": "216I.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.06",
	"title": "216I.06 APPLICATIONS; MAJOR REVIEW.",
	"text": "(a) The commission must prepare an environmental impact statement on each proposed large energy infrastructure facility for which a complete application has been submitted. An environmental impact statement means a detailed written statement that describes a large energy infrastructure facility and satisfies the requirements of section 116D.04. For the purposes of environmental review, the commission is prohibited from considering whether or not the project is needed. No other state environmental review documents are required. The commission must study and evaluate any site or route identified by the commission under section 216I.05, subdivision 10, clause (2).\n(b) For a cogeneration facility, as defined in section 216H.01, subdivision 1a, that is a large electric power generating plant and is not proposed by a utility, the commission must make a finding in the environmental impact statement whether the project is likely to result in a net reduction of carbon dioxide emissions, considering both the utility providing electric service to the proposed cogeneration facility and any reduction in carbon dioxide emissions resulting from increased efficiency from thermal energy production on the part of the customer that operates or owns the proposed cogeneration facility.\n(c) The commission must publish a draft environmental impact statement and a scoping document for the environmental impact statement under section 216I.05, subdivision 10. The public may provide comments on the draft environmental impact statement at the public hearing and comment period under subdivision 2.\n(d) The commission must publish a final environmental impact statement responding to the timely substantive comments on the draft environmental impact statement consistent with the scope approved by the commission under section 216I.05, subdivision 10, clause (2). The final environmental impact statement must discuss at appropriate points in the final environmental impact statement any reasonable opposing views relating to scoping issues that were not adequately discussed in the draft environmental impact statement and must indicate a response to the reasonable opposing views. When making the commission's final decision, the commission must consider the final environmental impact statement and the entirety of the record related to human and environmental impacts.\n(e) The commission must determine the adequacy of the final environmental impact statement. The commission must not decide the adequacy for at least ten days after the availability of the final environmental impact statement is announced in the EQB Monitor. The final environmental impact statement is adequate if the final environmental impact statement:\n(1) addresses the issues and alternatives raised in scoping;\n(2) provides responses to the timely substantive comments received during the draft environmental impact statement review process; and\n(3) was prepared in compliance with the procedures in sections 216I.05 and 216I.06.\nIf the commission finds that the environmental impact statement is not adequate, the commission must direct staff to respond to the deficiencies and resubmit the revised environmental impact statement to the commission as soon as possible.\n(a) No sooner than 15 days after the date the draft environmental impact statement is published, the commission must hold a public hearing on an application for a large energy infrastructure facility site or route permit. A hearing held to designate a site or route must be conducted by an administrative law judge from the Office of Administrative Hearings.\n(b) The commission may designate a portion of the hearing to be conducted as a contested case proceeding under chapter 14.\n(c) The commission must provide notice of the hearing at least ten days before but no earlier than 45 days before the date the hearing commences. The commission must provide notice by (1) publishing in a legal newspaper of general circulation in the county in which the public hearing is to be held, (2) mailing to chief executives of the regional development commissions, counties, organized towns, townships, and incorporated municipalities in which a site or route is proposed, and (3) Tribal governments, as defined by section 10.65, subdivision 2.\n(d) Any person may appear at the hearings and offer testimony and exhibits without the necessity of intervening as a formal party to the proceedings. The administrative law judge may allow any person to ask questions of other witnesses.\n(e) The administrative law judge must hold a portion of the hearing in the area where the large energy infrastructure facility's location is proposed.\n(f) The commission and administrative law judge must accept written comments for at least 20 days after the public hearing's date.\nThe administrative law judge must issue a report and recommendations after completion of post-hearing briefing or the date the public comment period under subdivision 2 closes, whichever is later.\nThe commission must make a final decision on an application within 60 days of the date the administrative law judge's report is received. A final decision on the site or route permit request must be made within one year of the date the commission determines an application is complete. The commission may extend the time limit under this subdivision for up to three months for just cause or upon agreement with the applicant.",
	"repealed": false
}