{
	"id": "72A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.07",
	"title": "72A.07 VIOLATIONS OF LAWS RELATING TO AGENTS, PENALTIES.",
	"text": "Any person, firm, or corporation violating, or failing to comply with, any of the provisions of sections 60K.30 to 60K.56 and any person who acts in any manner in the negotiation or transaction of unlawful insurance with an insurance company not licensed to do business in the state, or who, as principal or agent, violates any provision of law relating to the negotiation or effecting of contracts of insurance, shall be guilty of a misdemeanor. Upon the filing of a complaint by the commissioner of commerce in a court of competent jurisdiction against any person violating any provisions of this section, the county attorney of the county in which the violation occurred shall prosecute the person. Upon the conviction of any agent of any violation of the provisions of sections 60K.30 to 60K.56, the commissioner shall suspend the authority of the agent to transact any insurance business within the state for a period of not less than three months. Any insurer employing an agent and failing to procure an appointment, as required by sections 60K.30 to 60K.56, or allowing the agent to transact business for it within the state before an appointment has been procured, shall pay the commissioner, for the use of the state, a penalty of $25 for each offense. Each sale of an insurance policy by an agent who is not appointed by an insurance company shall constitute a separate offense, but no insurer shall be required to pay more than $300 in penalties as a result of the activities of a single unappointed agent. In the event of failure to pay a penalty within ten days' after notice from the commissioner, the authority of the insurer to do business in this state shall be revoked by the commissioner until the penalty is paid. No insurer whose authority is revoked shall be readmitted until it shall have complied with all the terms and conditions imposed for admission in the first instance. Any action taken by the commissioner under this section shall be subject to review by the district court of the county in which the office of the commissioner is located.",
	"repealed": false
}