{
	"id": "47.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.016",
	"title": "47.016 DISPOSITION OF CREDIT INSURANCE INCOME.",
	"text": "(a) For the purpose of this section, the following terms have the meanings given them.\n(b) \"Credit insurance\" means credit life, accident and health insurance, and credit involuntary unemployment insurance as defined in section 62B.02.\n(c) \"Officer,\" \"director,\" \"employee,\" and \"shareholder\" include the spouse and minor children of the officer, director, employee, or shareholder.\n(d) \"Interest\" includes ownership through a spouse or minor children; ownership through a broker, nominee, or agent; and ownership through a corporation, partnership, association, joint venture, or proprietorship.\n(e) \"Financial institution\" means any person who lends money and sells credit insurance to the borrower.\nThis section applies to sales of credit insurance by employees, officers, directors, and shareholders of a financial institution and by corporations, partnerships, associations, and other entities in which these persons have an interest. The purposes of this section are (1) to prohibit employees, officers, directors, members, and shareholders of financial institutions from benefiting personally on the sale of credit insurance to loan customers and (2) to encourage marketing of credit insurance through the use of financial facilities only under arrangements which assure that employees, officers, directors, and shareholders do not receive benefits not shared with all stockholders or members of the financial institution.\nNo employee, officer, director, or shareholder of a financial institution, nor a corporation, partnership, association, or other entity in which these persons have an interest, may retain commissions or other income from the sale of credit insurance in connection with a loan made by the financial institution. All such income received by these persons or by a corporation, partnership, association, or other entity in which these persons have an interest, must be turned over to the financial institution. Nothing in this section prohibits a financial institution from receiving the income directly in the form of commissions or as compensation for use of its premises, personnel, and good will.",
	"repealed": false
}