{
	"id": "256B.0595",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0595",
	"title": "256B.0595 PROHIBITIONS ON TRANSFER; EXCEPTIONS.",
	"text": "(a) For purposes of this section, \"long-term care services\" includes services in a nursing facility; services that are eligible for payment according to section 256B.0625, subdivision 2, because they are provided in a swing bed; services in an intermediate care facility for persons with developmental disabilities; and home and community-based services provided pursuant to sections 256B.092 and 256B.49 and chapter 256S. For purposes of this subdivision and subdivisions 2, 3, and 4, \"institutionalized person\" includes a person who is an inpatient in a nursing facility, a swing bed, or an intermediate care facility for persons with developmental disabilities, or who is receiving home and community-based services under sections 256B.092 and 256B.49 and chapter 256S.\n(b) Effective for transfers made after August 10, 1993, an institutionalized person, an institutionalized person's spouse, or any person, court, or administrative body with legal authority to act in place of, on behalf of, at the direction of, or upon the request of the institutionalized person or institutionalized person's spouse, may not give away, sell, or dispose of, for less than fair market value, any asset or interest therein, except assets other than the homestead that are excluded under the Supplemental Security Income program, for the purpose of establishing or maintaining medical assistance eligibility. This applies to all transfers, including those made by a community spouse after the month in which the institutionalized spouse is determined eligible for medical assistance. For purposes of determining eligibility for long-term care services, any transfer of such assets within 36 months before or any time after an institutionalized person requests medical assistance payment of long-term care services, or 36 months before or any time after a medical assistance recipient becomes an institutionalized person, for less than fair market value may be considered. Any such transfer is presumed to have been made for the purpose of establishing or maintaining medical assistance eligibility and the institutionalized person is ineligible for long-term care services for the period of time determined under subdivision 2, unless the institutionalized person furnishes convincing evidence to establish that the transaction was exclusively for another purpose, or unless the transfer is permitted under subdivision 3 or 4. In the case of payments from a trust or portions of a trust that are considered transfers of assets under federal law, or in the case of any other disposal of assets made on or after February 8, 2006, any transfers made within 60 months before or any time after an institutionalized person requests medical assistance payment of long-term care services and within 60 months before or any time after a medical assistance recipient becomes an institutionalized person, may be considered.\n(c) This section applies to transfers, for less than fair market value, of income or assets, including assets that are considered income in the month received, such as inheritances, court settlements, and retroactive benefit payments or income to which the institutionalized person or the institutionalized person's spouse is entitled but does not receive due to action by the institutionalized person, the institutionalized person's spouse, or any person, court, or administrative body with legal authority to act in place of, on behalf of, at the direction of, or upon the request of the institutionalized person or the institutionalized person's spouse.\n(d) This section applies to payments for care or personal services provided by a relative, unless the compensation was stipulated in a notarized, written agreement that was in existence when the service was performed, the care or services directly benefited the person, and the payments made represented reasonable compensation for the care or services provided. A notarized written agreement is not required if payment for the services was made within 60 days after the service was provided.\n(e) Effective for transactions, including the purchase of an annuity, occurring on or after February 8, 2006, by or on behalf of an institutionalized person who has applied for or is receiving long-term care services or the institutionalized person's spouse shall be treated as the disposal of an asset for less than fair market value unless the department is named a preferred remainder beneficiary as described in section 256B.056, subdivision 11. Any subsequent change to the designation of the department as a preferred remainder beneficiary shall result in the annuity being treated as a disposal of assets for less than fair market value. The amount of such transfer shall be the maximum amount the institutionalized person or the institutionalized person's spouse could receive from the annuity or similar financial instrument. Any change in the amount of the income or principal being withdrawn from the annuity or other similar financial instrument at the time of the most recent disclosure shall be deemed to be a transfer of assets for less than fair market value unless the institutionalized person or the institutionalized person's spouse demonstrates that the transaction was for fair market value. In the event a distribution of income or principal has been improperly distributed or disbursed from an annuity or other retirement planning instrument of an institutionalized person or the institutionalized person's spouse, a cause of action exists against the individual receiving the improper distribution for the cost of medical assistance services provided or the amount of the improper distribution, whichever is less.\n(f) Effective for transactions, including the purchase of an annuity, occurring on or after February 8, 2006, by or on behalf of an institutionalized person applying for or receiving long-term care services shall be treated as a disposal of assets for less than fair market value unless it is:\n(1) an annuity described in subsection (b) or (q) of section 408 of the Internal Revenue Code of 1986; or\n(2) purchased with proceeds from:\n(i) an account or trust described in subsection (a), (c), or (p) of section 408 of the Internal Revenue Code;\n(ii) a simplified employee pension within the meaning of section 408(k) of the Internal Revenue Code; or\n(iii) a Roth IRA described in section 408A of the Internal Revenue Code; or\n(3) an annuity that is irrevocable and nonassignable; is actuarially sound as determined in accordance with actuarial publications of the Office of the Chief Actuary of the Social Security Administration; and provides for payments in equal amounts during the term of the annuity, with no deferral and no balloon payments made.\n(g) This section applies to funds used to purchase a promissory note, loan, or mortgage unless the note, loan, or mortgage:\n(1) has a repayment term that is actuarially sound;\n(2) provides for payments to be made in equal amounts during the term of the loan, with no deferral and no balloon payments made; and\n(3) prohibits the cancellation of the balance upon the death of the lender.\n(h) In the case of a promissory note, loan, or mortgage that does not meet an exception in paragraph (g), clauses (1) to (3), the value of such note, loan, or mortgage shall be the outstanding balance due as of the date of the institutionalized person's request for medical assistance payment of long-term care services.\n(i) This section applies to the purchase of a life estate interest in another person's home unless the purchaser resides in the home for a period of at least one year after the date of purchase.\n(j) This section applies to transfers into a pooled trust that qualifies under United States Code, title 42, section 1396p(d)(4)(C), by:\n(1) a person age 65 or older or the person's spouse; or\n(2) any person, court, or administrative body with legal authority to act in place of, on behalf of, at the direction of, or upon the request of a person age 65 or older or the person's spouse.\n[Repealed, 2001 c 203 s 19]\n[Repealed, 2010 c 310 art 5 s 1]\n(a) For uncompensated transfers made after August 10, 1993, the number of months of ineligibility for long-term care services shall be the total uncompensated value of the resources transferred divided by the average medical assistance rate for nursing facility services in the state in effect on the date of application. The amount used to calculate the average medical assistance payment rate shall be adjusted each July 1 to reflect payment rates for the previous calendar year. The period of ineligibility begins with the first day of the month after the month in which the assets were transferred except that if one or more uncompensated transfers are made during a period of ineligibility, the total assets transferred during the ineligibility period shall be combined and a penalty period calculated to begin on the first day of the month after the month in which the first uncompensated transfer was made. If the transfer was reported to the local agency after the date that advance notice of a period of ineligibility that affects the next month could be provided to the recipient and the recipient received medical assistance services or the transfer was not reported to the local agency, and the applicant or recipient received medical assistance services during what would have been the period of ineligibility if the transfer had been reported, a cause of action exists against the transferee for that portion of long-term care services provided during the period of ineligibility, or for the uncompensated amount of the transfer, whichever is less. The uncompensated transfer amount is the fair market value of the asset at the time it was given away, sold, or disposed of, less the amount of compensation received. Effective for transfers made on or after March 1, 1996, involving persons who apply for medical assistance on or after April 13, 1996, no cause of action exists for a transfer unless:\n(1) the transferee knew or should have known that the transfer was being made by a person who was a resident of a long-term care facility or was receiving that level of care in the community at the time of the transfer;\n(2) the transferee knew or should have known that the transfer was being made to assist the person to qualify for or retain medical assistance eligibility; or\n(3) the transferee actively solicited the transfer with intent to assist the person to qualify for or retain eligibility for medical assistance.\n(b) For uncompensated transfers made on or after February 8, 2006, the period of ineligibility:\n(1) for uncompensated transfers by or on behalf of individuals receiving medical assistance payment of long-term care services, begins the first day of the month following advance notice of the period of ineligibility, but no later than the first day of the month that follows three full calendar months from the date of the report or discovery of the transfer; or\n(2) for uncompensated transfers by individuals requesting medical assistance payment of long-term care services, begins the date on which the individual is eligible for medical assistance under the Medicaid state plan and would otherwise be receiving long-term care services based on an approved application for such care but for the period of ineligibility resulting from the uncompensated transfer; and\n(3) cannot begin during any other period of ineligibility.\n(c) If a calculation of a period of ineligibility results in a partial month, payments for long-term care services shall be reduced in an amount equal to the fraction.\n(d) In the case of multiple fractional transfers of assets in more than one month for less than fair market value on or after February 8, 2006, the period of ineligibility is calculated by treating the total, cumulative, uncompensated value of all assets transferred during all months on or after February 8, 2006, as one transfer.\n(e) A period of ineligibility established under paragraph (b) may be eliminated if all of the assets transferred for less than fair market value used to calculate the period of ineligibility, or cash equal to the value of the assets at the time of the transfer, are returned. A period of ineligibility must not be adjusted if less than the full amount of the transferred assets or the full cash value of the transferred assets are returned.\n[Repealed, 2001 c 203 s 19]\n[Repealed, 2010 c 310 art 5 s 1]\n(a) An institutionalized person is not ineligible for long-term care services due to a transfer of assets for less than fair market value if the asset transferred was a homestead and:\n(1) title to the homestead was transferred to the individual's:\n(i) spouse;\n(ii) child who is under age 21;\n(iii) blind or permanently and totally disabled child as defined in the Supplemental Security Income program;\n(iv) sibling who has equity interest in the home and who was residing in the home for a period of at least one year immediately before the date of the individual's admission to the facility; or\n(v) son or daughter who was residing in the individual's home for a period of at least two years immediately before the date the individual became an institutionalized person, and who provided care to the individual that, as certified by the individual's attending physician, advanced practice registered nurse, or physician assistant, permitted the individual to reside at home rather than receive care in an institution or facility;\n(2) a satisfactory showing is made that the individual intended to dispose of the homestead at fair market value or for other valuable consideration; or\n(3) the local agency grants a waiver of a penalty resulting from a transfer for less than fair market value because denial of eligibility would cause undue hardship for the individual, based on imminent threat to the individual's health and well-being. Whenever an applicant or recipient is denied eligibility because of a transfer for less than fair market value, the local agency shall notify the applicant or recipient that the applicant or recipient may request a waiver of the penalty if the denial of eligibility will cause undue hardship. With the written consent of the individual or the personal representative of the individual, a long-term care facility in which an individual is residing may file an undue hardship waiver request, on behalf of the individual who is denied eligibility for long-term care services on or after July 1, 2006, due to a period of ineligibility resulting from a transfer on or after February 8, 2006. In evaluating a waiver, the local agency shall take into account whether the individual was the victim of financial exploitation, whether the individual has made reasonable efforts to recover the transferred property or resource, and other factors relevant to a determination of hardship. If the local agency does not approve a hardship waiver, the local agency shall issue a written notice to the individual stating the reasons for the denial and the process for appealing the local agency's decision.\n(b) When a waiver is granted under paragraph (a), clause (3), a cause of action exists against the person to whom the homestead was transferred for that portion of long-term care services provided within:\n(1) 30 months of a transfer made on or before August 10, 1993;\n(2) 60 months if the homestead was transferred after August 10, 1993, to a trust or portion of a trust that is considered a transfer of assets under federal law;\n(3) 36 months if transferred in any other manner after August 10, 1993, but prior to February 8, 2006; or\n(4) 60 months if the homestead was transferred on or after February 8, 2006,\nor the amount of the uncompensated transfer, whichever is less, together with the costs incurred due to the action.\n[Repealed, 2001 c 203 s 19]\n[Repealed, 2010 c 310 art 5 s 1]\n(a) An institutionalized person, as defined in subdivision 1, paragraph (a), who has made, or whose spouse has made a transfer prohibited by subdivision 1, is not ineligible for long-term care services if one of the following conditions applies:\n(1) the assets were transferred to the individual's spouse or to another for the sole benefit of the spouse; or\n(2) the institutionalized spouse, prior to being institutionalized, transferred assets to a spouse, provided that the spouse to whom the assets were transferred does not then transfer those assets to another person for less than fair market value. (At the time when one spouse is institutionalized, assets must be allocated between the spouses as provided under section 256B.059); or\n(3) the assets were transferred to the individual's child who is blind or permanently and totally disabled as determined in the Supplemental Security Income program; or\n(4) a satisfactory showing is made that the individual intended to dispose of the assets either at fair market value or for other valuable consideration; or\n(5) the local agency determines that denial of eligibility for long-term care services would work an undue hardship and grants a waiver of a period of ineligibility resulting from a transfer for less than fair market value based on an imminent threat to the individual's health and well-being. Imminent threat to the individual's health and well-being means that imposing a period of ineligibility would endanger the individual's health or life or cause serious deprivation of food, clothing, or shelter. Whenever an applicant or recipient is denied eligibility because of a transfer for less than fair market value, the local agency shall notify the applicant or recipient that the applicant or recipient may request a waiver of the period of ineligibility if the denial of eligibility will cause undue hardship. With the written consent of the individual or the personal representative of the individual, a long-term care facility in which an individual is residing may file an undue hardship waiver request, on behalf of the individual who is denied eligibility for long-term care services on or after July 1, 2006, due to a period of ineligibility resulting from a transfer on or after February 8, 2006; or\n(6) for transfers occurring after August 10, 1993, the assets were transferred by the person or the person's spouse: (i) into a trust established for the sole benefit of a son or daughter of any age who is blind or disabled as defined by the Supplemental Security Income program; or (ii) into a trust established for the sole benefit of an individual who is under 65 years of age who is disabled as defined by the Supplemental Security Income program. \"For the sole benefit of\" has the meaning found in section 256B.059, subdivision 1.\n(b) Subject to paragraph (c), when evaluating a hardship waiver, the local agency shall take into account whether the individual was the victim of financial exploitation, whether the individual has made reasonable efforts to recover the transferred property or resource, whether the individual has taken any action to prevent the designation of the department as a remainder beneficiary on an annuity as described in section 256B.056, subdivision 11, and other factors relevant to a determination of hardship.\n(c) In the case of an imminent threat to the individual's health and well-being, the local agency shall approve a hardship waiver of the portion of an individual's period of ineligibility resulting from a transfer of assets for less than fair market value by or to a person:\n(1) convicted of financial exploitation, fraud, or theft upon the individual for the transfer of assets; or\n(2) against whom a report of financial exploitation upon the individual has been substantiated. For purposes of this paragraph, \"financial exploitation\" and \"substantiated\" have the meanings given in section 626.5572.\n(d) The local agency shall make a determination within 30 days of the receipt of all necessary information needed to make such a determination. If the local agency does not approve a hardship waiver, the local agency shall issue a written notice to the individual stating the reasons for the denial and the process for appealing the local agency's decision. When a waiver is granted, a cause of action exists against the person to whom the assets were transferred for that portion of long-term care services provided within:\n(1) 30 months of a transfer made on or before August 10, 1993;\n(2) 60 months of a transfer if the assets were transferred after August 30, 1993, to a trust or portion of a trust that is considered a transfer of assets under federal law;\n(3) 36 months of a transfer if transferred in any other manner after August 10, 1993, but prior to February 8, 2006; or\n(4) 60 months of any transfer made on or after February 8, 2006,\nor the amount of the uncompensated transfer, whichever is less, together with the costs incurred due to the action.\n[Repealed, 2001 c 203 s 19]\n[Repealed, 2010 c 310 art 5 s 1]\n[Repealed, 2010 c 310 art 5 s 1]\nThis section does not invalidate or impair the effectiveness of a conveyance or encumbrance of real estate.\nIf a period of ineligibility is imposed under subdivision 2 or 2a, the local agency shall inform the applicant or recipient subject to the penalty of the person's rights under section 325F.71, subdivision 2.\n(a) A cause of action exists against a transferee who receives assets for less than fair market value, either:\n(1) from a person who was a recipient of medical assistance and who made an uncompensated transfer that was known to the county agency but a penalty period could not be implemented under this section due to the death of the person; or\n(2) from a person who was a recipient of medical assistance who made an uncompensated transfer that was not known to the county agency and the transfer was made with the intent to hinder, delay, or defraud the state or local agency from recovering as allowed under section 256B.15. In determining intent under this clause, consideration may be given, among other factors, to whether:\n(i) the transfer was to a family member;\n(ii) the transferor retained possession or control of the property after the transfer;\n(iii) the transfer was concealed;\n(iv) the transfer included the majority of the transferor's assets;\n(v) the value of the consideration received was not reasonably equivalent to the fair market value of the property; and\n(vi) the transfer occurred shortly before the death of the transferor.\n(b) No cause of action exists under this subdivision unless:\n(1) the transferee knew or should have known that the transfer was being made by a person who was receiving medical assistance as described in section 256B.15, subdivision 1, paragraph (b); and\n(2) the transferee received the asset without providing a reasonable equivalent fair market value in exchange for the transfer.\n(c) The cause of action is for the uncompensated amount of the transfer or the amount of medical assistance paid on behalf of the person, whichever is less. The uncompensated transfer amount is the fair market value of the asset at the time it was given away, sold, or disposed of, less the amount of the compensation received.\n(a) The county of financial responsibility under chapter 256G may bring a cause of action under any or all of the following:\n(1) subdivision 1, paragraph (e);\n(2) subdivision 2, paragraph (a);\n(3) subdivision 3, paragraph (b);\n(4) subdivision 4, paragraph (d); and\n(5) subdivision 8\non behalf of the claimant who must be the commissioner.\n(b) Notwithstanding any other law to the contrary, a cause of action under subdivision 2, paragraph (a) or (b), or 8, must be commenced within six years of the date the local agency determines that a transfer was made for less than fair market value. Notwithstanding any other law to the contrary, a cause of action under subdivision 3, paragraph (b), or 4, clause (5), must be commenced within six years of the date of approval of a waiver of the penalty period for a transfer for less than fair market value based on undue hardship.",
	"repealed": false
}