{
	"id": "62E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.11",
	"title": "62E.11 OPERATION OF COMPREHENSIVE PLAN.",
	"text": "Upon certification as an eligible person in the manner provided by section 62E.14, an eligible person may enroll in the comprehensive health insurance plan by payment of the state plan premium to the writing carrier.\nAny employer which has in its employ one or more eligible persons enrolled in the comprehensive health insurance plan may make all or any portion of the state plan premium payment to the state plan directly to the writing carrier.\nNot less than 85 percent of the state plan premium paid to the writing carrier shall be used to pay claims, and not more than 15 percent shall be used for the payment of agent referral fees as authorized in section 62E.15, subdivision 3 and for payment of the writing carrier's direct and indirect expenses, as specified in section 62E.13, subdivision 7.\nAny income in excess of the costs incurred by the association in providing reinsurance or administrative services pursuant to section 62E.07, clauses (e) and (f) shall be held at interest and used by the association to offset losses due to claims expenses of the state plan or allocated to reduce state plan premiums.\nEach contributing member of the association shall share the losses due to claims expenses of the comprehensive health insurance plan for plans issued or approved for issuance by the association, and shall share in the operating and administrative expenses incurred or estimated to be incurred by the association incident to the conduct of its affairs. Claims expenses of the state plan which exceed the premium payments allocated to the payment of benefits shall be the liability of the contributing members. Contributing members shall share in the claims expense of the state plan and operating and administrative expenses of the association in an amount equal to the ratio of the contributing member's total accident and health insurance premium, received from or on behalf of Minnesota residents as divided by the total accident and health insurance premium, received by all contributing members from or on behalf of Minnesota residents, as determined by the commissioner. Payments made by the state to a contributing member for medical assistance or MinnesotaCare services according to chapters 256 and 256B shall be excluded when determining a contributing member's total premium.\nThe association shall make an annual determination of each contributing member's liability, if any, and may make an annual fiscal year end assessment if necessary. The association may also, subject to the approval of the commissioner, provide for interim assessments against the contributing members whose aggregate assessments comprised a minimum of 90 percent of the most recent prior annual assessment, in the event that the association deems that methodology to be the most administratively efficient and cost-effective means of assessment, and as may be necessary to assure the financial capability of the association in meeting the incurred or estimated claims expenses of the state plan and operating and administrative expenses of the association until the association's next annual fiscal year end assessment. Payment of an assessment shall be due within 30 days of receipt by a contributing member of a written notice of a fiscal year end or interim assessment. Failure by a contributing member to tender to the association the assessment within 30 days shall be grounds for termination of the contributing member's membership. A contributing member which ceases to do accident and health insurance business within the state shall remain liable for assessments through the calendar year during which accident and health insurance business ceased. The association may decline to levy an assessment against a contributing member if the assessment, as determined herein, would not exceed ten dollars.\nNet gains, if any, from the operation of the state plan shall be held at interest and used by the association to offset future losses due to claims expenses of the state plan or allocated to reduce state plan premiums.\n[Repealed, 1987 c 268 art 2 s 38]\nEach contributing member that terminates individual health coverage for reasons other than (a) nonpayment of premium; (b) failure to make co-payments; (c) enrollee moving out of the area served; or (d) a materially false statement or misrepresentation by the enrollee in the application for membership; and does not provide or arrange for replacement coverage that meets the requirements of section 62D.121; shall pay a special assessment to the state plan based upon the number of terminated individuals who join the comprehensive health insurance plan as authorized under section 62E.14, subdivisions 1, paragraph (d), and 6. Such a contributing member shall pay the association an amount equal to the average cost of an enrollee in the state plan in the year in which the member terminated enrollees multiplied by the total number of terminated enrollees who enroll in the state plan.\nThe average cost of an enrollee in the state comprehensive health insurance plan shall be determined by dividing the state plan's total annual losses by the total number of enrollees from that year. This cost will be assessed to the contributing member who has terminated health coverage before the association makes the annual determination of each contributing member's liability as required under this section.\nIn the event that the contributing member is terminating health coverage because of a loss of health care providers, the commissioner may review whether or not the special assessment established under this subdivision will have an adverse impact on the contributing member or its enrollees or insureds, including but not limited to causing the contributing member to fall below statutory net worth requirements. If the commissioner determines that the special assessment would have an adverse impact on the contributing member or its enrollees or insureds, the commissioner may adjust the amount of the special assessment, or establish alternative payment arrangements to the state plan. For health maintenance organizations regulated under chapter 62D, the commissioner of health shall make the determination regarding any adjustment in the special assessment and shall transmit that determination to the commissioner of commerce.\nAny contributing members who have terminated individual health plans and do not provide or arrange for replacement coverage that meets the requirements of section 62D.121, and whose former insureds or enrollees enroll in the state comprehensive health insurance plan with a waiver of the preexisting conditions pursuant to section 62E.14, subdivisions 1, paragraph (d), and 6, will be liable for the costs of any preexisting conditions of their former enrollees or insureds treated during the first six months of coverage under the state plan. The liability for preexisting conditions will be assessed before the association makes the annual determination of each contributing member's liability as required under this section.\nThe association must provide notice and solicit public comment at least two weeks before filing a rate increase or benefit change with the commissioner. This requirement may be satisfied by written notice, public meeting, or electronic means. If the association holds a public meeting, notice of the public meeting to hear public comment must be mailed at least two weeks before the meeting to all plan enrollees.\n[Repealed, 1997 c 225 art 2 s 63]\nIn approving the premium rates as required in sections 62A.65, subdivision 3; and 62L.08, subdivision 8, the commissioners of health and commerce shall ensure that any appropriation to reduce the annual assessment made on the contributing members to cover the costs of the Minnesota comprehensive health insurance plan as required under this section is reflected in the premium rates charged by each contributing member.",
	"repealed": false
}