{
	"id": "103H.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/103H.275",
	"title": "103H.275 MANAGING POLLUTANTS WHERE GROUNDWATER IS POLLUTED.",
	"text": "(a) If groundwater pollution is detected, a state agency or political subdivision that regulates an activity causing or potentially causing a contribution to the pollution identified shall promote implementation of best management practices to prevent or minimize the source of pollution to the extent practicable.\n(b) The Pollution Control Agency, or for agricultural chemicals and practices, the commissioner of agriculture may adopt water source protection requirements under subdivision 2 that are consistent with the goal of section 103H.001 and are commensurate with the groundwater pollution if the implementation of best management practices has proven to be ineffective.\n(c) The water resources protection requirements must be:\n(1) designed to prevent and minimize the pollution to the extent practicable;\n(2) designed to prevent the pollution from exceeding the health risk limits; and\n(3) submitted to the house of representatives and senate committees with jurisdiction over the environment, natural resources, and agriculture.\n(a) The Pollution Control Agency, or for agricultural chemicals and practices, the commissioner of agriculture shall adopt by rule water resource protection requirements that are consistent with the goal of section 103H.001 to prevent and minimize the pollution to the extent practicable. The proposed rule must be submitted to the house of representatives and senate committees with jurisdiction over the environment, natural resources, and agriculture before adoption. The water resource protection requirements must be based on the use and effectiveness of best management practices, the product use and practices contributing to the pollution detected, economic factors, availability, technical feasibility, implementability, and effectiveness. The water resource protection requirements may be adopted for one or more pollutants or a similar class of pollutants. A water resource protection requirement may not be adopted before January 1, 1991.\n(b) Before the water resource protection requirements are adopted, the Pollution Control Agency or the commissioner of agriculture for agricultural chemicals and practices must notify affected persons and businesses for comments and input in developing the water resource protection requirements.\n(c) Unless the water resource protection requirements are to cover the entire state, the water resource protection requirements are only effective in areas designated by the commissioner of the Pollution Control Agency by order or for agricultural chemicals and practices in areas designated by the commissioner of agriculture by order. The procedures for issuing the order and the effective date of the order must be included in the water resource protection requirements rule.\n(d) The water resource protection requirements rule must contain procedures for notice to be given to persons affected by the rule and order of the commissioner. The procedures may include notice by publication, personal service, and other appropriate methods to inform affected persons of the rule and commissioner's order.\n(e) A person who is subject to a water resource protection requirement may apply to the Pollution Control Agency, or for agricultural chemicals and practices the commissioner of agriculture, and suggest an alternative protection requirement. Within 60 days after receipt, the agency or commissioner of agriculture must approve or deny the request. If the Pollution Control Agency or commissioner of agriculture approves the request, an order must be issued approving the alternative protection requirement.\n(f) A person who violates a water resource protection requirement relating to pollutants, other than agricultural chemicals, is subject to the penalties for violating a rule adopted under chapter 116. A person who violates a water resource protection requirement relating to agricultural chemicals and practices is subject to the penalties for violating a rule adopted under chapter 18D.",
	"repealed": false
}