{
	"id": "62D.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.22",
	"title": "62D.22 STATUTORY CONSTRUCTION AND RELATIONSHIP TO OTHER LAWS.",
	"text": "Except as otherwise provided herein, sections 62D.01 to 62D.30 do not apply to an insurer or nonprofit health service plan corporation licensed and regulated pursuant to the laws governing such corporations in this state.\nSolicitation of enrollees by a health maintenance organization granted a certificate of authority, or its representatives, shall not be construed to violate any provision of law relating to solicitation or advertising by health professionals.\nAny health maintenance organization authorized under sections 62D.01 to 62D.30 shall not be deemed to be practicing a healing art.\nTo the extent that it furthers the purposes of sections 62D.01 to 62D.30, the commissioner of health shall attempt to coordinate the operations of sections 62D.01 to 62D.30 relating to the quality of health care services with the operations of United States Code, title 42, sections 1320c to 1320c-20.\nExcept as otherwise provided in sections 62A.01 to 62A.42 and 62D.01 to 62D.30, provisions of the insurance laws and provisions of nonprofit health service plan corporation laws shall not be applicable to any health maintenance organization granted a certificate of authority under sections 62D.01 to 62D.30.\nEffective July 1, 2025, sections 145D.30 to 145D.37 apply to nonprofit health maintenance organizations operating under this chapter.\n[Repealed, 1982 c 614 s 12]\nA licensed health maintenance organization shall be deemed to be a prepaid group practice plan for the purposes of chapter 43A and may be allowed to participate as a carrier for state employees subject to any collective bargaining agreement entered into pursuant to chapter 179A and reasonable restrictions applied pursuant to section 43A.23.\nAll agents, solicitors, and brokers engaged in soliciting or dealing with enrollees or prospective enrollees of a health maintenance organization, whether employees or under contract to the health maintenance organization, shall be subject to the provisions of sections 60K.30 to 60K.56, concerning the licensure of insurance producers and lawful rules thereunder. Medical doctors and others who merely explain the operation of health maintenance organizations shall be exempt from the provisions of sections 60K.30 to 60K.56. Section 60K.37, subdivision 1, shall not apply except as to provide for an examination of an applicant in the applicant's knowledge concerning the operations and benefits of health maintenance organizations and related insurance matters.\n[Repealed, 1984 c 464 s 46]\nAny person or committee conducting a review of a health maintenance organization or a participating entity, pursuant to sections 62D.01 to 62D.30, shall have access to any data or information necessary to conduct the review. All data or information is subject to admission into evidence in any civil action initiated by the commissioner of health against the health maintenance organization. The data and information are subject to chapter 13.",
	"repealed": false
}