{
	"id": "156.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.18",
	"title": "156.18 VETERINARY PRESCRIPTION DRUGS.",
	"text": "(a) A person may not dispense a veterinary prescription drug to a client without a prescription or other veterinary authorization. A person may not make extra-label use of an animal or human drug for an animal without a prescription from a veterinarian. A veterinarian or the veterinarian's authorized employee may dispense veterinary prescription drugs, human drugs for extra-label use, or an over-the-counter drug for extra-label use by a client without a separate written prescription, providing there is documentation of the prescription in the medical record and there is an existing veterinarian-client-patient relationship. The prescribing veterinarian must monitor the use of veterinary prescription drugs, human drugs for extra-label use, or over-the-counter drugs for extra-label use by a client.\n(b) A veterinarian may dispense prescription veterinary drugs and prescribe and dispense extra-label use drugs to a client without personally examining the animal if a bona fide veterinarian-client-patient relationship exists and in the judgment of the veterinarian the client has sufficient knowledge to use the drugs properly.\n(c) A veterinarian may issue a prescription or other veterinary authorization by oral or written communication to the dispenser, or by computer connection. If the communication is oral, the veterinarian must enter it into the patient's record. The dispenser must record the veterinarian's prescription or other veterinary authorization within 72 hours.\n(d) A prescription or other veterinary authorization must include:\n(1) the name, address, and, if written, the signature of the prescriber;\n(2) the name and address of the client;\n(3) identification of the species for which the drug is prescribed or ordered;\n(4) the name, strength, and quantity of the drug;\n(5) the date of issue;\n(6) directions for use;\n(7) withdrawal time;\n(8) expiration date of prescription; and\n(9) number of authorized refills.\n(e) A veterinarian may, in the course of professional practice and an existing veterinarian-client-patient relationship, prepare medicaments that combine drugs approved by the United States Food and Drug Administration and other legally obtained ingredients with appropriate vehicles.\n(f) A veterinarian or a bona fide employee of a veterinarian may dispense veterinary prescription drugs to a person on the basis of a prescription issued by a licensed veterinarian. The provisions of paragraphs (c) and (d) apply.\n(g) This section does not limit the authority of the Minnesota Racing Commission to regulate veterinarians providing services at a licensed racetrack.\n(a) A veterinarian or the veterinarian's authorized agent or employee dispensing a veterinary prescription drug, an over-the-counter drug for extra-label use, or a human drug for extra-label use must provide written information which includes the name and address of the veterinarian, date of filling, species of patient, name or names of drug, strength of drug or drugs, directions for use, withdrawal time, and cautionary statements, if any, appropriate for the drug.\n(b) If the veterinary drug has been prepared, mixed, formulated, or packaged by the dispenser, all of the information required in paragraph (a) must be provided on a label affixed to the container.\n(c) If the veterinary drug is in the manufacturer's original package, the information required in paragraph (a) must be supplied in writing but need not be affixed to the container. Information required in paragraph (a) that is provided by the manufacturer on the original package does not need to be repeated in the separate written information. Written information required by this paragraph may be written on the sales invoice.\nA veterinarian must maintain complete records of receipt and distribution of each prescription veterinary drug. The records may be kept in the form of sales invoices, shipping records, prescription files, or a record or log established solely to satisfy the requirements of this subdivision. Records must include:\n(1) the name of the drug;\n(2) the name and address of the person from whom the drug was shipped and the date and quantity received; and\n(3) the name and address of the person to whom the drug was distributed and the date and quantity shipped or otherwise distributed.\nRecords required by this section must be kept for at least two years after dispensing of the drug has been completed.",
	"repealed": false
}