{
	"id": "414.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.02",
	"title": "414.02 EXCLUSIVE METHOD OF MUNICIPAL INCORPORATION.",
	"text": "This section provides the exclusive method of incorporating a municipality in Minnesota. Proceedings for incorporation of a municipality may be initiated by petition of 100 or more property owners or by resolution of the town board within an area which is not included within the limits of any incorporated municipality and which area includes land that has been platted into lots and blocks in the manner provided by law. The petition or resolution shall be submitted to the chief administrative law judge and shall state the proposed name of the municipality, the names of all parties entitled to mailed notice under section 414.09, the reason for requesting incorporation, and shall include a proposed corporate boundary map.\n(a) At least 30 days before submitting the petition or resolution to the chief administrative law judge under this section, the township must serve the clerk of each municipality and each township that is contiguous to the township by certified mail a notice of the township's intent to incorporate.\n(b) If the proceedings for incorporation are initiated by the requisite number of property owners, the notice of intent to incorporate must be served by the property owner or owners or designee in the manner required under this paragraph. The property owner or owners or designee must serve a notice of intent to incorporate on the town board of the township containing the area proposed for incorporation. The property owner or owners or designee must also serve the clerk of each municipality and each township that is contiguous to the area proposed for incorporation by certified mail a notice of intent to incorporate.\nUpon receipt of a petition or resolution made pursuant to subdivision 1, the chief administrative law judge shall designate a time and place for a hearing in accordance with section 414.09.\n(a) In arriving at a decision, the chief administrative law judge shall consider the following factors:\n(1) present population and number of households, past population and projected population growth for the subject area;\n(2) quantity of land within the subject area; the natural terrain including recognizable physical features, general topography, major watersheds, soil conditions and such natural features as rivers, lakes and major bluffs;\n(3) present pattern of physical development, planning, and intended land uses in the subject area including residential, industrial, commercial, agricultural, and institutional land uses and the impact of the proposed action on those uses;\n(4) the present transportation network and potential transportation issues, including proposed highway development;\n(5) land use controls and planning presently being utilized in the subject area, including comprehensive plans, policies of the Metropolitan Council; and whether there are inconsistencies between proposed development and existing land use controls;\n(6) existing levels of governmental services being provided to the subject area, including water and sewer service, fire rating and protection, law enforcement, street improvements and maintenance, administrative services, and recreational facilities and the impact of the proposed action on the delivery of the services;\n(7) existing or potential environmental problems and whether the proposed action is likely to improve or resolve these problems;\n(8) fiscal impact on the subject area and adjacent units of local government, including present bonded indebtedness; local tax rates of the county, school district, and other governmental units, including, where applicable, the net tax capacity of platted and unplatted lands and the division of homestead and nonhomestead property; and other tax and governmental aid issues;\n(9) relationship and effect of the proposed action on affected and adjacent school districts and communities;\n(10) whether delivery of services to the subject area can be adequately and economically delivered by the existing government;\n(11) analysis of whether necessary governmental services can best be provided through the proposed action or another type of boundary adjustment;\n(12) degree of contiguity of the boundaries of the subject area and adjacent units of local government; and\n(13) analysis of the applicability of the State Building Code.\n(b) Based upon these factors, the chief administrative law judge may order the incorporation on finding that:\n(1) the property to be incorporated is now, or is about to become, urban or suburban in character; or\n(2) that the existing township form of government is not adequate to protect the public health, safety, and welfare; or\n(3) the proposed incorporation would be in the best interests of the area under consideration.\n(c) The chief administrative law judge may deny the incorporation if the area, or a part thereof, would be better served by annexation to an adjacent municipality.\n(d) The chief administrative law judge may alter the boundaries of the proposed incorporation by increasing or decreasing the area to be incorporated so as to include only that property which is now, or is about to become, urban or suburban in character, or may exclude property that may be better served by another unit of government. The chief administrative law judge may also alter the boundaries of the proposed incorporation so as to follow visible, clearly recognizable physical features for municipal boundaries.\n(e) In all cases, the chief administrative law judge shall set forth the factors which are the basis for the decision.\n(f) Notwithstanding any other provision of law to the contrary relating to the number of wards which may be established, the chief administrative law judge may provide for election of council members by wards, not less than three nor more than seven in number, whose limits are prescribed in the chief administrative law judge's order upon a finding that area representation is required to accord proper representation in the proposed incorporated area because of uneven population density in different parts thereof or the existence of agricultural lands therein which are in the path of suburban development, but after four years from the effective date of an incorporation the council of the municipality may by resolution adopted by a four-fifths vote abolish the ward system and provide for the election of all council members at large as in other municipalities.\n(g) The chief administrative law judge's order for incorporation shall provide for the election of municipal officers in accordance with section 414.09. The plan of government shall be \"Optional Plan A\", provided that an alternate plan may be adopted pursuant to section 412.551, at any time.\n(h) The ordinances of the township in which the new municipality is located shall continue in effect until repealed by the governing body of the new municipality.\nThe incorporation shall be effective upon the election and qualification of new municipal officers or on such later date as is fixed by the chief administrative law judge's order.",
	"repealed": false
}