{
	"id": "241.0215",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.0215",
	"title": "241.0215 JUVENILE DETENTION FACILITIES; RESTRICTIONS ON STRIP SEARCHES AND DISCIPLINE.",
	"text": "This section applies to juvenile facilities licensed by the commissioner of corrections under section 241.021, subdivision 2.\n(a) As used in this section, the following terms have the meanings given.\n(b) \"Health care professional\" means an individual who is licensed or permitted by a Minnesota health-related licensing board, as defined in section 214.01, subdivision 2, to perform health care services in Minnesota within the professional's scope of practice.\n(c) \"Strip search\" means a visual inspection of a juvenile's unclothed breasts, buttocks, or genitalia.\n(a) A staff person working in a facility may not conduct a strip search unless:\n(1) a specific, articulable, and immediate contraband concern is present;\n(2) other search techniques and technology cannot be used or have failed to identify the contraband; and\n(3) the facility's chief administrator or designee has reviewed the situation and approved the strip search.\n(b) A strip search must be conducted by:\n(1) a health care professional; or\n(2) a staff person working in a facility who has received training on trauma-informed search techniques and other applicable training under Minnesota Rules, chapter 2960.\n(c) A strip search must be documented in writing and describe the contraband concern, summarize other inspection techniques used or considered, and verify the approval from the facility's chief administrator or, in the temporary absence of the chief administrator, the staff person designated as the person in charge of the facility. A copy of the documentation must be provided to the commissioner within 24 hours of the strip search.\n(d) Nothing in this section prohibits or limits a strip search as part of a health care procedure conducted by a health care professional.\n(a) A staff person working in a facility may not discipline a juvenile by physically or socially isolating the juvenile.\n(b) Nothing in this subdivision restricts a facility from isolating a juvenile for the juvenile's safety, staff safety, or the safety of other facility residents when the isolation is consistent with rules adopted by the commissioner.\nThe commissioner may take any action authorized under section 241.021, subdivisions 2 and 3, to address a violation of this section.\n(a) By February 15 each year, the commissioner must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over public safety finance and policy on the use of strip searches and isolation.\n(b) The report must consist of summary data from the previous calendar year and must, at a minimum, include:\n(1) how often strip searches were performed;\n(2) how often juveniles were isolated;\n(3) the length of each period of isolation used and, for juveniles isolated in the previous year, the total cumulative amount of time that the juvenile was isolated that year; and\n(4) any injury to a juvenile related to a strip search or isolation, or both, that was reportable as a critical incident.\n(c) Data in the report must provide information on the demographics of juveniles who were subject to a strip search and juveniles who were isolated. At a minimum, data must be disaggregated by age, race, and gender.\n(d) The report must identify any facility that performed a strip search or used isolation, or both, in a manner that did not comply with this section or rules adopted by the commissioner in conformity with this section.",
	"repealed": false
}