{
	"id": "144A.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.161",
	"title": "144A.161 NURSING HOME AND BOARDING CARE HOME RESIDENT RELOCATION.",
	"text": "(a) The definitions in this subdivision apply to subdivisions 2 to 10.\n(b) \"Change in operations\" means any alteration in operations which would require or encourage the relocation of residents.\n(c) \"Closure\" or \"closing\" means the cessation of operations of a facility.\n(d) \"Contact information\" means name, address, and telephone number and, when available, email address and facsimile number.\n(e) \"County social services agency\" means the county or multicounty social service agency authorized under sections 393.01 and 393.07, as the agency responsible for providing social services for the county in which the facility is located.\n(f) \"Facility\" means a nursing home licensed pursuant to this chapter, or a boarding care home licensed pursuant to sections 144.50 to 144.56.\n(g) \"Licensee\" means the owner of the facility or the owner's designee or the commissioner of health for a facility in receivership.\n(h) \"Plan\" or \"relocation plan\" means a description of the process developed under subdivision 3, paragraph (b), for the relocation of residents in cases of a facility closure, reduction, or change in operations.\n(i) \"Reduction\" means a decrease in the number of beds that would require or encourage the relocation of residents.\n(j) \"Relocation\" means the movement of the resident to another facility or living arrangement as a result of the closing, reduction, or change in operations of a facility.\n(k) \"Responsible party\" means an individual acting as a legal representative for the resident.\nWhere a facility is undertaking a closure, reduction, or change in operations, or where a housing with services unit registered under chapter 144D is closed because the space that it occupies is being replaced by a nursing facility bed that is being reactivated from layaway status, the facility and the county social services agency must comply with the requirements of this section.\n(a) A licensee shall notify the following parties in writing when there is an intent to close, reduce, or change operations that would require or encourage the relocation of residents:\n(1) the commissioner of health;\n(2) the commissioner of human services;\n(3) the county social services agency;\n(4) the Office of Ombudsman for Long-Term Care;\n(5) the Office of Ombudsman for Mental Health and Developmental Disabilities; and\n(6) the managed care organizations contracting with Minnesota health care programs within the county where the nursing facility is located.\n(b) The written notice shall include the contact information of the persons in the facility responsible for coordinating the licensee's efforts in the planning process, and the number of residents potentially affected by the closure, reduction, or change in operations. Only the copy of the notice provided to the county social services agency shall include a complete resident census, including resident name, date of birth, Social Security number, and medical assistance identification number if it is available.\n(c) For a facility that is reducing or changing operations, after providing written notice under subdivision 5a, and prior to admission, the facility must fully inform prospective residents and their responsible parties of the intent to reduce or change operations, and of the relocation plan.\n(d) A closing facility is prohibited from admitting any new residents on or after the date of the written notice provided under subdivision 5a.\n(a) The county social services agency shall, within five working days of receiving initial notice of the licensee's intent to close, reduce, or change operations, provide the licensee and all parties identified in subdivision 2, paragraph (a), with the contact information of those persons responsible for coordinating county social services agency efforts in the planning process.\n(b) Within ten working days of receipt of the notice under subdivision 2, paragraph (a), the county social services agency and licensee shall meet to develop the relocation plan. The county social services agency shall inform the Department of Health and the Department of Human Services, the Office of Ombudsman for Long-Term Care, and the Office of Ombudsman for Mental Health and Developmental Disabilities of the date, time, and location of the meeting so that their representatives may attend. The relocation plan must be completed no later than 45 days after receipt of the initial notice in subdivision 2, paragraph (a). The plan shall:\n(1) identify the expected date of closure, reduction, or change in operations;\n(2) outline the process for public notification of the closure, reduction, or change in operations;\n(3) identify efforts that will be made to include other stakeholders in the relocation process;\n(4) outline the process to ensure 60-day advance written notice to residents, family members, and designated representatives;\n(5) present an aggregate description of the resident population remaining to be relocated and the population's needs;\n(6) outline the individual resident assessment process to be utilized;\n(7) identify an inventory of available relocation options and resources, including home and community-based services;\n(8) identify a schedule for the timely completion of each element of the plan;\n(9) identify the steps the licensee and the county social services agency will take to address the relocation needs of individual residents who may be difficult to place due to specialized care needs such as behavioral health problems; and\n(10) identify the steps needed to share information and coordinate relocation efforts with managed care organizations.\n(c) All parties to the plan shall refrain from any public notification of the intent to close, reduce, or change operations until a relocation plan has been established and the notice in subdivision 5a is given.\nThe licensee shall provide for the safe, orderly, and appropriate relocation of residents. The licensee and facility staff shall cooperate with representatives from the county social services agency, the Department of Health, the Department of Human Services, the Office of Ombudsman for Long-Term Care, and the Office of Ombudsman for Mental Health and Developmental Disabilities in planning for and implementing the relocation of residents.\n(a) The licensee shall establish an interdisciplinary team responsible for coordinating and implementing the plan. The interdisciplinary team shall include representatives from the county social services agency, the Office of Ombudsman for Long-Term Care, the Office of the Ombudsman for Mental Health and Developmental Disabilities, facility staff that provide direct care services to the residents, and facility administration.\n(b) Concurrent with the notice provided in subdivision 5a, the licensee shall provide an updated resident census summary document to the county social services agency, the Ombudsman for Long-Term Care, and the Ombudsman for Mental Health and Developmental Disabilities that includes the following information on each resident to be relocated:\n(1) resident name;\n(2) date of birth;\n(3) Social Security number;\n(4) payment source and medical assistance identification number, if applicable;\n(5) county of financial responsibility if the resident is enrolled in a Minnesota health care program;\n(6) date of admission to the facility;\n(7) all current diagnoses;\n(8) the name of and contact information for the resident's physician, advanced practice registered nurse, or physician assistant;\n(9) the name and contact information for the resident's responsible party;\n(10) the name of and contact information for any case manager, managed care coordinator, or other care coordinator, if known;\n(11) information on the resident's status related to commitment and probation; and\n(12) the name of the managed care organization in which the resident is enrolled, if known.\nAt least 60 days before the proposed date of closing, reduction, or change in operations as agreed to in the plan, the administrator shall send a written notice of closure, reduction, or change in operations to each resident being relocated, the resident's responsible party, the resident's managed care organization if it is known, the county social services agency, the commissioner of health, the commissioner of human services, the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities, the resident's attending physician, advanced practice registered nurse, or physician assistant, and, in the case of a complete facility closure, the Centers for Medicare and Medicaid Services regional office designated representative. The notice must include the following:\n(1) the date of the proposed closure, reduction, or change in operations;\n(2) the contact information of the individual or individuals in the facility responsible for providing assistance and information;\n(3) notification of upcoming meetings for residents, responsible parties, and resident and family councils to discuss the plan for relocation of residents;\n(4) the contact information of the county social services agency contact person; and\n(5) the contact information of the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities.\n[Repealed by amendment, 2013 c 63 s 4]\nThe licensee shall provide sufficient preparation to each resident to ensure safe and orderly discharge and relocation. The licensee shall assist each resident in finding placements that take into consideration quality, services, location, the resident's needs and choices, and the best interests of each resident.\nFollowing the establishment of the plan, the licensee shall conduct meetings with residents, families and responsible parties, and resident and family councils to notify them of the process for resident relocation. Representatives from the local county social services agency, the Office of Ombudsman for Long-Term Care, the Office of Ombudsman for Mental Health and Developmental Disabilities, managed care organizations with residents in the facility, the commissioner of health, and the commissioner of human services shall receive advance notice of the meetings.\nThe licensee shall assist residents desiring to make site visits to facilities with available beds or other appropriate living options to which the resident may relocate, unless it is medically inadvisable, as documented by the attending physician, advanced practice registered nurse, or physician assistant in the resident's care record. The licensee shall make available to the resident at no charge transportation for up to three site visits to facilities or other living options within the county or contiguous counties.\n(a) The licensee shall complete an inventory of resident personal possessions and provide a copy of the final inventory to the resident and the resident's responsible party prior to relocation. The licensee shall be responsible for the transfer of the resident's possessions to a selected new location within the county or contiguous counties. The licensee shall complete the transfer of resident possessions in a timely manner.\n(b) The licensee shall complete a final accounting of personal funds held in trust by the facility and provide a copy of this accounting to the resident and the resident's responsible party. The licensee shall be responsible for the transfer of all personal funds held in trust by the facility. The licensee shall complete the transfer of all personal funds in a timely manner.\n(c) The licensee shall assist residents with the transfer and reconnection of service for telephones or other personal communication devices or services. The licensee shall pay the costs associated with reestablishing service for telephones or other personal communication devices or services, such as connection fees or other onetime charges. The transfer and reconnection of personal communication devices or services shall be completed in a timely manner.\n(a) The licensee shall provide the resident, the resident's responsible parties, the resident's managed care organization, if known, and the resident's attending physician, advanced practice registered nurse, or physician assistant with a final written discharge notice prior to the relocation of the resident. The notice must:\n(1) be provided prior to the actual relocation; and\n(2) identify the effective date of the anticipated relocation and the destination to which the resident is being relocated.\n(b) The licensee shall provide the receiving facility or other health, housing, or care entity with complete and accurate resident records including contact information for family members, responsible parties, social service or other caseworkers, and managed care coordinators. These records must also include all information necessary to provide appropriate medical care and social services. This includes, but is not limited to, information on preadmission screening, Level I and Level II screening, minimum data set (MDS), all other assessments, current resident diagnoses, social, behavioral, and medication information, required forms, and discharge summaries.\n(c) For residents with special care needs, the licensee shall consult with the receiving facility or other placement entity and provide staff training or other preparation as needed to assist in providing for the special needs.\n(a) The licensee shall, at no charge to the resident, make arrangements or provide for the transportation of residents to the new facility or location within the county or contiguous counties. The licensee shall provide a staff person to accompany the resident during transportation to the new location within the county or contiguous counties, upon request of the resident, the resident's family, or responsible party. The discharge and relocation of residents must be conducted in a safe and orderly manner. The licensee must ensure that there is no disruption in providing meals, medications, or treatments of a resident during the relocation process.\n(b) Beginning the week following the announcement in subdivision 5a, the licensee shall submit weekly status reports to the commissioner of health and the commissioner of human services or their designees, the Ombudsman for Long-Term Care and Ombudsman for Mental Health and Developmental Disabilities, and to the county social services agency. The status reports must be submitted in the format required by the commissioner of health and the commissioner of human services. The initial status report must identify:\n(1) the relocation plan developed;\n(2) the interdisciplinary team members; and\n(3) the number of residents to be relocated.\n(c) Subsequent status reports must identify:\n(1) any modifications to the plan;\n(2) any change of interdisciplinary team members;\n(3) the number of residents relocated;\n(4) the destination to which residents have been relocated;\n(5) the number of residents remaining to be relocated; and\n(6) issues or problems encountered during the process and resolution of these issues.\nThe licensee shall retain or make arrangements for the retention of all remaining resident records for the period required by law. The licensee shall provide the Department of Health access to these records. The licensee shall notify the Department of Health of the location of any resident records that have not been transferred to the new facility or other health care entity.\n(a) The county social services agency shall participate in the meeting as outlined in subdivision 3, paragraph (b), to develop a relocation plan.\n(b) The county social services agency shall designate a representative to the interdisciplinary team established by the licensee responsible for coordinating the relocation efforts.\n(c) The county social services agency shall serve as a resource in the relocation process.\n(d) Concurrent with the notice sent to residents from the licensee as provided in subdivision 5a, the county social services agency shall provide written notice to residents and responsible parties describing:\n(1) the county's role in the relocation process and in the follow-up to relocations;\n(2) the county social services agency contact information; and\n(3) the contact information for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities.\n(e) The county social services agency designee shall meet with appropriate facility staff to coordinate any assistance in the relocation process. This coordination shall include participating in group meetings with residents, families, and responsible parties to explain the relocation process.\n(f) Beginning from the initial notice given in subdivision 2, the county social services agency shall monitor compliance with all components of this section and the plan developed under subdivision 3, paragraph (b). If the licensee is not in compliance, the county social services agency shall notify the commissioner of the Department of Health and the commissioner of the Department of Human Services.\n(g) Except as requested by the resident or responsible party and within the parameters of the Vulnerable Adults Act, the county social services agency, in coordination with the commissioner of health and the commissioner of human services, may halt a relocation that it deems inappropriate or dangerous to the health or safety of a resident. In situations where a resident relocation is halted, the county social services agency must notify the resident, family, responsible parties, Office of the Ombudsman for Long-Term Care and Office of the Ombudsman for Mental Health and Developmental Disabilities, and resident's managed care organization, of this action. The county social services agency shall pursue remedies to protect the resident during the relocation process, including, but not limited to, assisting the resident with filing an appeal of transfer or discharge, notification of all appropriate licensing boards and agencies, and other remedies available to the county under section 626.557, subdivision 10.\n(h) A member of the county social services agency staff shall follow up with relocated residents within 30 days after the relocation. This requirement does not apply to changes in operation where the facility moved to a new location and residents chose to move to that new location. The requirement also does not apply to residents admitted after the notice in subdivision 5a is given and discharged prior to the actual change in facility operations or reduction. County social services agency staff shall interview the resident or responsible party and review and discuss pertinent medical or social records with appropriate facility staff to:\n(1) assess the adjustment of the resident to the new placement;\n(2) recommend services or methods to meet any special needs of the resident; and\n(3) identify residents at risk.\n(i) The county social services agency shall conduct subsequent follow-up visits on site in cases where the adjustment of the resident to the new placement is in question.\n(j) Within 60 days of the completion of the follow up under paragraphs (h) and (i), the county social services agency shall submit a written summary of the follow-up work to the Department of Health and the Department of Human Services in a manner approved by the commissioners.\n(k) The county social services agency shall submit to the Department of Health and the Department of Human Services a report of any issues that may require further review or monitoring.\n(l) The county social services agency shall be responsible for the safe and orderly relocation of residents in cases where an emergent need arises or when the licensee has abrogated its responsibilities under the plan.\nUpon the recommendation of the commissioner of health, the commissioner of human services may eliminate a closure rate adjustment under subdivision 10 for violations of this section.\nUpon the request of a closing facility, the commissioner of human services must allow the facility a closure rate adjustment equal to a 50 percent payment rate increase to reimburse relocation costs or other costs related to facility closure. This rate increase is effective on the date the facility's occupancy decreases to 90 percent of capacity days after the written notice of closure is distributed under subdivision 5 and shall remain in effect for a period of up to 60 days. The commissioner shall delay the implementation of rate adjustments under section 256R.40, subdivisions 5 and 6, to offset the cost of this rate adjustment.\n[Repealed by amendment, 2013 c 63 s 4]",
	"repealed": false
}