{
	"id": "80A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.65",
	"title": "80A.65 SECTION 410; FEES AND EXPENSES.",
	"text": "(a) There shall be a filing fee of $100 for every application for registration or notice filing. There shall be an additional fee of one-tenth of one percent of the maximum aggregate offering price at which the securities are to be offered in this state, and the maximum combined fees shall not exceed $300.\n(b) When an application for registration is withdrawn before the effective date or a preeffective stop order is entered under section 80A.54, all but the $100 filing fee shall be returned. If an application to register securities is denied, the total of all fees received shall be retained.\n(c) Where a filing is made in connection with a federal covered security under section 18(b)(2) of the Securities Act of 1933, there is a fee of $100 for every initial filing. If the filing is made in connection with redeemable securities issued by an open end management company or unit investment trust, as defined in the Investment Company Act of 1940, there is an additional annual fee of 1/20 of one percent of the maximum aggregate offering price at which the securities are to be offered in this state during the notice filing period. The fee must be paid at the time of the initial filing and thereafter in connection with each renewal no later than July 1 of each year and must be sufficient to cover the shares the issuer expects to sell in this state over the next 12 months. If during a current notice filing the issuer determines it is likely to sell shares in excess of the shares for which fees have been paid to the administrator, the issuer shall submit an amended notice filing to the administrator under section 80A.50, together with a fee of 1/20 of one percent of the maximum aggregate offering price of the additional shares. Shares for which a fee has been paid, but which have not been sold at the time of expiration of the notice filing, may not be sold unless an additional fee to cover the shares has been paid to the administrator as provided in this section and section 80A.50. If the filing is made in connection with redeemable securities issued by such a company or trust, there is no maximum fee for securities filings made according to this paragraph. If the filing is made in connection with any other federal covered security under Section 18(b)(2) of the Securities Act of 1933, there is an additional fee of one-tenth of one percent of the maximum aggregate offering price at which the securities are to be offered in this state, and the combined fees shall not exceed $300.\nEvery applicant for an initial or renewal registration shall pay a filing fee of $200 in the case of a broker-dealer, $65 in the case of an agent, $100 in the case of an investment adviser, and $50 in the case of an investment adviser representative. When an application is denied or withdrawn, the filing fee shall be retained. A registered agent who has terminated employment with one broker-dealer shall, before beginning employment with another broker-dealer, pay a transfer fee of $25.\nEvery federal covered investment adviser filing the initial or renewal notice required under section 80A.60 must pay a filing fee of $100.\nAny amendment to an existing registration requiring an order of the administrator shall require payment of an amendment fee of $25. If the amendment increases the aggregate amount of securities to be registered, there shall be an additional fee calculated in accordance with subdivision 1, provided the maximum additional fees, if applicable, have not previously been paid. The administrator shall by rule designate those amendments which require an order of the administrator.\nEvery periodic report required by section 80A.53 shall be accompanied by a fee of $100.\nThe filing of any exemption for which notice is required to be given the administrator under section 80A.45 shall be accompanied by a fee of $50.\nThe filing of a rescission offer under section 80A.46(19), shall be accompanied by the fees as calculated in subdivision 1.\nEvery request for a written opinion from the administrator shall be accompanied by a fee of $50.\nIf securities of an issuer are sold in this state in excess of the quantity registered, the excess securities may be registered by paying a filing fee of $100, and an additional fee in the amount of three times that which is prescribed under subdivision 1, for the excess securities to be registered. There shall be no maximum combined fees under this subdivision, notwithstanding the limitation set forth in subdivision 1, clause (a).\nRegistration of the excess securities shall be effective retroactively to the date of sale.\nWhen the administrator deems it necessary to incur any expense in connection with any application or registration, the administrator shall have the power to require the interested person to make an advance deposit with the administrator in an amount estimated as sufficient to cover such expense. All such deposits shall be covered into the state treasury and credited to the state administrator's investigation fund, from which fund the administrator shall have power to make disbursements to pay for expenses necessarily incurred in the investigation. Any unexpended portion shall be refunded. On field examinations made by the administrator or an employee away from the office of the administrator, a per diem of $10 for each such person may be charged in addition to actual expenses. Where additional technical, expert, or special services are used, the actual cost of such services may be charged in addition to actual expenses.\nNo filing for which a fee is required shall be deemed to be filed or given any effect until the proper fee is paid. All fees and charges collected by the administrator shall be covered into the state treasury. When any person is entitled to a refund under this section, the administrator shall certify to the commissioner of management and budget the amount of the fee to be refunded to the applicant, and the commissioner of management and budget shall issue a payment thereof out of the fund to which such fee was credited in the manner provided by law. There is hereby appropriated to the person entitled to such refunds from the fund in the state treasury to which such fees were credited an amount to make such refunds and payments.",
	"repealed": false
}