{
	"id": "123B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.03",
	"title": "123B.03 BACKGROUND CHECK.",
	"text": "(a) A school hiring authority shall request a criminal history background check from the superintendent of the Bureau of Criminal Apprehension on all individuals who are offered employment in a school and on all individuals, except enrolled student volunteers, who are offered the opportunity to provide athletic coaching services or other extracurricular academic coaching services to a school, regardless of whether any compensation is paid. In order for an individual to be eligible for employment or to provide the services, the individual must provide an executed criminal history consent form and a money order or check payable to either the Bureau of Criminal Apprehension or the school hiring authority, at the discretion of the school hiring authority, in an amount equal to the actual cost to the Bureau of Criminal Apprehension and the school district of conducting the criminal history background check. A school hiring authority deciding to receive payment may, at its discretion, accept payment in the form of a negotiable instrument other than a money order or check and shall pay the superintendent of the Bureau of Criminal Apprehension directly to conduct the background check. The superintendent of the Bureau of Criminal Apprehension shall conduct the background check by retrieving criminal history data as defined in section 13.87. A school hiring authority, at its discretion, may decide not to request a criminal history background check on an individual who holds an initial entrance license issued by the Professional Educator Licensing and Standards Board or the commissioner of education within the 12 months preceding an offer of employment.\n(b) A school hiring authority may use the results of a criminal background check conducted at the request of another school hiring authority if:\n(1) the results of the criminal background check are on file with the other school hiring authority or otherwise accessible;\n(2) the other school hiring authority conducted a criminal background check within the previous 12 months;\n(3) the individual who is the subject of the criminal background check executes a written consent form giving a school hiring authority access to the results of the check; and\n(4) there is no reason to believe that the individual has committed an act subsequent to the check that would disqualify the individual for employment.\n(c) A school hiring authority may, at its discretion, request a criminal history background check from the superintendent of the Bureau of Criminal Apprehension on any individual who seeks to enter a school or its grounds for the purpose of serving as a school volunteer or working as an independent contractor or student employee. In order for an individual to enter a school or its grounds under this paragraph when the school hiring authority decides to request a criminal history background check on the individual, the individual first must provide an executed criminal history consent form and a money order, check, or other negotiable instrument payable to the school district in an amount equal to the actual cost to the Bureau of Criminal Apprehension and the school district of conducting the criminal history background check. Notwithstanding section 299C.62, subdivision 1, the cost of the criminal history background check under this paragraph is the responsibility of the individual unless a school hiring authority decides to pay the costs of conducting a background check under this paragraph. If the school hiring authority pays the costs, the individual who is the subject of the background check need not pay for it.\n(d) For all nonstate residents who are offered employment in a school, a school hiring authority shall request a criminal history background check on such individuals from the superintendent of the Bureau of Criminal Apprehension and from the government agency performing the same function in the resident state or, if no government entity performs the same function in the resident state, from the Federal Bureau of Investigation. Such individuals must provide an executed criminal history consent form and a money order, check, or other negotiable instrument payable to the school hiring authority in an amount equal to the actual cost to the government agencies and the school district of conducting the criminal history background check. Notwithstanding section 299C.62, subdivision 1, the cost of the criminal history background check under this paragraph is the responsibility of the individual.\n(e) At the beginning of each school year or when a student enrolls, a school hiring authority must notify parents and guardians about the school hiring authority's policy requiring a criminal history background check on employees and other individuals who provide services to the school, and identify those positions subject to a background check and the extent of the hiring authority's discretion in requiring a background check. The school hiring authority may include the notice in the student handbook, a school policy guide, or other similar communication. Nothing in this paragraph affects a school hiring authority's ability to request a criminal history background check on an individual under paragraph (c).\n(a) At the time a school board or other hiring authority conducts the criminal history background check required under subdivision 1 on an individual offered employment as a teacher, the school board or other hiring authority must contact the Professional Educator Licensing and Standards Board to determine whether the board has taken disciplinary action against the teacher. The school board or other hiring authority must obtain access to data that are public under section 13.41, subdivision 5, from the Professional Educator Licensing and Standards Board that relate to the substance of the disciplinary action. In addition, the school board or other hiring authority must require the individual to provide information in the employment application regarding all current and previous disciplinary actions in Minnesota and other states taken against the individual's teaching license and indicate to the applicant that intentionally submitting false or incomplete information is a ground for dismissal.\n(b) For purposes of this subdivision, \"disciplinary action\" does not include an action based on court-ordered child support or maintenance payment arrearages under section 214.101 or delinquent state taxes under section 270C.72.\n(a) A school hiring authority may hire or otherwise allow an individual to provide a service to a school pending completion of a background check under subdivision 1 or obtaining notice of a Professional Educator Licensing and Standards Board action under subdivision 1a but shall notify the individual that the individual's employment or other service may be terminated based on the result of the background check or Professional Educator Licensing and Standards Board action. A school hiring authority is not liable for failing to hire or for terminating an individual's employment or other service based on the result of a background check or Professional Educator Licensing and Standards Board action under this section.\n(b) For purposes of this paragraph, a school hiring authority must inform an individual if the individual's application to be an employee or volunteer in the district has been denied as a result of a background check conducted under this section. The school hiring authority must also inform an individual who is a current employee or volunteer if the individual's employment or volunteer status in the district is being terminated as a result of a background check conducted under subdivision 4.\nFor purposes of this section:\n(a) \"School\" means a school as defined in section 120A.22, subdivision 4, except a home school, and includes a school receiving tribal contract or grant school aid under section 124D.83; school, for the purposes of this section, also means a service cooperative, a special education cooperative, or an education district under Minnesota Statutes 1997 Supplement, section 123.35, a charter school under chapter 124E, an intermediate school district under section 136D.01, and a joint powers district under section 471.59.\n(b) \"School hiring authority\" means the school board, or in the case of a nonpublic school, the school principal or other person having general control and supervision of the school.\n(c) \"Security violation\" means failing to prevent or failing to institute safeguards to prevent the access, use, retention, or dissemination of information in violation of the security and management control outsourcing standard established by the state compact officer under section 299C.58, article I, paragraph (2), clause (B).\n(a) For purposes of this section, a school hiring authority may contract with an eligible third party to conduct the criminal history background check required under subdivision 1. Before entering into the contract, the school hiring authority must:\n(1) provide the state compact officer with the name of the proposed third-party contractor and a copy of the proposed contract;\n(2) determine from the state compact officer whether the proposed contractor has committed a security violation; and\n(3) request and receive permission from the state compact officer to enter into the contract with the proposed contractor.\nA third-party contractor that has committed a security violation is ineligible to participate under this section.\n(b) The contract must specify the purposes for which the background check information may be made available and incorporate into the contract by reference the management control outsourcing standard referred to in subdivision 3, paragraph (c). A third-party contractor under this section is subject to section 13.05, subdivision 11.\n(c) A school hiring authority must inform an individual who is the subject of a criminal history background check that the individual has the right to request and obtain from the school hiring authority a copy of the background check report. A school hiring authority may charge the individual for the actual cost of providing a copy of the report. An individual who is the subject of a criminal history background check has the right to challenge the accuracy and completeness of information contained in the background check report under section 13.04, subdivision 4.",
	"repealed": false
}