{
	"id": "148E.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.50",
	"title": "148E.50 DATA SYSTEM.",
	"text": "(a) The Commission shall provide for the development, maintenance, operation, and utilization of a coordinated data system.\n(b) The Commission shall assign each applicant for a multistate license a unique identifier, as determined by the rules of the Commission.\n(c) Notwithstanding any other provision of state law to the contrary, a member state shall submit a uniform data set to the data system on all individuals to whom this Compact is applicable as required by the rules of the Commission, including:\n(1) identifying information;\n(2) licensure data;\n(3) adverse actions against a license and information related thereto;\n(4) nonconfidential information related to alternative program participation, the beginning and ending dates of such participation, and other information related to such participation not made confidential under member state law;\n(5) any denial of application for licensure, and the reason for such denial;\n(6) the presence of current significant investigative information; and\n(7) other information that may facilitate the administration of this Compact or the protection of the public, as determined by the rules of the Commission.\n(d) The records and information provided to a member state pursuant to this Compact or through the data system, when certified by the Commission or an agent thereof, shall constitute the authenticated business records of the Commission, and shall be entitled to any associated hearsay exception in any relevant judicial, quasi-judicial, or administrative proceedings in a member state.\n(e) Current significant investigative information pertaining to a licensee in any member state will only be available to other member states.\n(f) It is the responsibility of the member states to report any adverse action against a licensee and to monitor the database to determine whether adverse action has been taken against a licensee. Adverse action information pertaining to a licensee in any member state will be available to any other member state.\n(g) Member states contributing information to the data system may designate information that may not be shared with the public without the express permission of the contributing state.\n(h) Any information submitted to the data system that is subsequently expunged pursuant to federal law or the laws of the member state contributing the information shall be removed from the data system.",
	"repealed": false
}