{
	"id": "403.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.32",
	"title": "403.32 SALE OF GENERAL OBLIGATION BONDS.",
	"text": "The Metropolitan Council may by resolution authorize the issuance of general obligation bonds of the council, in an amount outstanding and undischarged at any time not more than $3,000,000, for which its full faith and credit and taxing powers shall be pledged for the council's share of the first phase. The Metropolitan Council may also issue general obligation bonds to refund outstanding obligations issued under this section. The amount of refunding bonds that may be issued from time to time shall not be subject to the dollar limitation contained in this subdivision nor the refunding bonds be included in computing the amount of bonds that may be issued within that dollar limitation.\nThe Metropolitan Council shall sell and issue the bonds in the manner provided in chapter 475 and shall have the same powers and duties as a municipality issuing bonds under that chapter, except that the approval of a majority of the electors shall not be required and the net debt limitations shall not apply. The bonds shall be secured in accordance with section 475.61, subdivision 1, and any taxes required for their payment shall be levied by the council, shall not affect the amount or rate of taxes which may be levied by the council for other purposes, and shall be levied without limitation of rate or amount upon all taxable property in the transit taxing district and transit area as provided in section 473.446, subdivision 1.\nThe Metropolitan Council may, after the authorization of bonds under this section, provide funds immediately required for the purposes of subdivision 1 by effecting temporary loans upon terms as it shall by resolution determine, evidenced by notes due in not exceeding 24 months from their date, payable to the order of the lender or to the bearer, to be repaid with interest from the proceeds of the bonds when issued and delivered to the purchaser. The temporary loans may be made without public advertisement.",
	"repealed": false
}