{
	"id": "260C.4411",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.4411",
	"title": "260C.4411 PRE-NORTHSTAR CARE FOR CHILDREN FOSTER CARE PROGRAM.",
	"text": "(a) For a child placed in family foster care on or before December 31, 2014, the county of financial responsibility under section 256G.02 or tribal agency authorized under section 142A.03, subdivision 9, shall pay the local share under section 142A.611, subdivision 3, for foster care maintenance including any difficulty of care as defined in Minnesota Rules, part 9560.0521, subparts 7 and 10. Family foster care includes:\n(1) emergency relative placement under section 142B.06;\n(2) licensed foster family settings, foster residence settings, or treatment foster care settings, licensed under Minnesota Rules, parts 2960.3000 to 2960.3340, and served by a public or private child care agency authorized by Minnesota Rules, parts 9545.0755 to 9545.0845;\n(3) family foster care homes approved by a tribal agency; and\n(4) unlicensed supervised settings for foster youth ages 18 to 21.\n(b) The county of financial responsibility under section 256G.02 or tribal social services agency authorized in section 142A.03, subdivision 9, shall pay the entire cost of any initial clothing allowance, administrative payments to child care agencies specified in section 317A.907, or any other support services it authorizes, except as otherwise provided by law.\n(c) The rates for the pre-Northstar Care for Children foster care program remain those in effect on January 1, 2013, continuing the preexisting rate structure for foster children who remain with the same caregivers and do not transition into Northstar Care for Children under section 142A.604, subdivision 6.\n(d) Difficulty of care payments must be maintained consistent with Minnesota Rules, parts 9560.0652 and 9560.0653, using the established reassessment tool in Minnesota Rules, part 9560.0654. The preexisting rate structure for the pre-Northstar Care for Children foster care program must be maintained, provided that when the number of foster children in the program is less than ten percent of the population in 2012, the commissioner may apply the same assessment tool to both the pre-Northstar Care for Children foster care program and Northstar Care for Children under the authority granted in section 142A.607, subdivision 2.\n(e) The county of financial responsibility under section 256G.02 or tribal agency authorized under section 142A.03, subdivision 9, shall document the determined pre-Northstar Care for Children foster care rate in the case record, including a description of each condition on which the difficulty of care assessment is based. The difficulty of care rate is reassessed:\n(1) every 12 months;\n(2) at the request of the foster parent; or\n(3) if the child's level of need changes in the current foster home.\n(f) The pre-Northstar Care for Children foster care program must maintain the following existing program features:\n(1) monthly payments must be made to the family foster home provider;\n(2) notice and appeal procedures must be consistent with Minnesota Rules, part 9560.0665; and\n(3) medical assistance eligibility for foster children must continue to be determined according to section 256B.055.\n(g) The county of financial responsibility under section 256G.02 or tribal agency authorized under section 142A.03, subdivision 9, may continue existing program features, including:\n(1) establishing a local fund of county money through which the agency may reimburse foster parents for the cost of repairing damage done to the home and contents by the foster child and the additional care insurance premium cost of a child who possesses a permit or license to drive a car; and\n(2) paying a fee for specific services provided by the foster parent, based on the parent's skills, experience, or training. This fee must not be considered foster care maintenance.\n(h) The following events end the child's enrollment in the pre-Northstar Care for Children foster care program:\n(1) reunification with parent or other relative;\n(2) adoption or transfer of permanent legal and physical custody;\n(3) removal from the current foster home to a different foster home;\n(4) another event that ends the current placement episode; or\n(5) attaining the age of 21.\n(a) When a child in foster care is eligible to receive a grant of Retirement Survivors Disability Insurance (RSDI) or Supplemental Security Income for the aged, blind, and disabled, or a foster care maintenance payment under title IV-E of the Social Security Act, United States Code, title 42, sections 670 to 676, the child's needs must be met through these programs. Every effort must be made to establish a child's eligibility for a title IV-E grant to reimburse the county or tribe from the federal funds available for this purpose.\n(b) When a child in foster care qualifies for home and community-based waivered services under section 256B.49 for community alternative care (CAC), community access for disability inclusion (CADI), or traumatic brain injury (TBI) waivers, this service does not substitute for the child foster care program. When a foster child is receiving waivered services benefits, the county of financial responsibility under section 256G.02 or tribal agency authorized under section 142A.03, subdivision 9, assesses and provides foster care maintenance including difficulty of care using the established tool in Minnesota Rules, part 9560.0654. If it is determined that additional services are needed to meet the child's needs in the home that are not or cannot be met by the foster care program, the needs must be referred to the waivered service program.",
	"repealed": false
}