{
	"id": "342.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.14",
	"title": "342.14 CANNABIS LICENSE APPLICATION AND RENEWAL; PROCEDURE.",
	"text": "(a) The office shall establish procedures for the processing of cannabis licenses issued under this chapter. At a minimum, any application to obtain or renew a cannabis license shall include the following information, if applicable:\n(1) the name, address, and date of birth of the applicant;\n(2) the disclosure of ownership and control required under paragraph (b);\n(3) the disclosure of whether the applicant or, if the applicant is a business, any officer, director, manager, and general partner of the business has ever filed for bankruptcy;\n(4) the address and legal property description of the business, if applicable, except an applicant is not required to secure a physical premises for the business at the time of application;\n(5) a general description of the location or locations that the applicant plans to operate, including the planned square feet of space for cultivation, wholesaling, and retailing, as applicable;\n(6) a copy of the security plan, including security monitoring, security equipment, and facility maps if applicable, except an applicant is not required to secure a physical premises for the business at the time of application;\n(7) proof of trade name registration;\n(8) a copy of the applicant's business plan showing the expected size of the business; anticipated growth; the methods of record keeping; the knowledge and experience of the applicant and any officer, director, manager, and general partner of the business; the environmental plan; and other relevant financial and operational components;\n(9) standard operating procedures for:\n(i) quality assurance;\n(ii) inventory control, storage, and diversion prevention; and\n(iii) accounting and tax compliance;\n(10) an attestation signed by a bona fide labor organization stating that the applicant has entered into a labor peace agreement;\n(11) a description of any training and education that the applicant will provide to employees of the business;\n(12) a disclosure of any violation of a license agreement or a federal, state, or local law or regulation committed by the applicant or any true party of interest in the applicant's business that is relevant to business and working conditions;\n(13) certification that the applicant will comply with the requirements of this chapter;\n(14) identification of one or more controlling persons or managerial employees as agents who shall be responsible for dealing with the office on all matters;\n(15) a statement that the applicant agrees to respond to the office's supplemental requests for information; and\n(16) a release of information for the applicant and every true party of interest in the applicant's business license for the office to perform the background checks required under section 342.15.\n(b) An applicant must file and update as necessary a disclosure of ownership and control identifying any true party of interest as defined in section 342.185, subdivision 1, paragraph (g). The office shall establish the contents of the disclosure. Except as provided in paragraph (f), the disclosure shall, at a minimum, include the following:\n(1) the management structure, ownership, and control of the applicant or license holder, including the name of each cooperative member, officer, director, manager, general partner, or business entity; the office or position held by each person; each person's percentage ownership interest, if any; and, if the business has a parent company, the name of each owner, board member, and officer of the parent company and the owner's, board member's, or officer's percentage ownership interest in the parent company and the cannabis business;\n(2) a statement from the applicant and, if the applicant is a business, from every officer, director, manager, and general partner of the business, indicating whether that person has previously held, or currently holds, an ownership interest in a cannabis business in Minnesota, any other state or territory of the United States, or any other country;\n(3) if the applicant is a corporation, copies of the applicant's articles of incorporation and bylaws and any amendments to the applicant's articles of incorporation or bylaws;\n(4) copies of any partnership agreement, operating agreement, or shareholder agreement;\n(5) copies of any promissory notes, security instruments, or other similar agreements;\n(6) an explanation detailing the funding sources used to finance the business;\n(7) a list of operating and investment accounts for the business, including any applicable financial institution and account number; and\n(8) a list of each outstanding loan and financial obligation obtained for use in the business, including the loan amount, loan terms, and name and address of the creditor.\n(c) An application may include:\n(1) proof that the applicant is a social equity applicant;\n(2) a description of the training and education that will be provided to any employee; or\n(3) a copy of business policies governing operations to ensure compliance with this chapter.\n(d) Commitments made by an applicant in its application, including but not limited to the maintenance of a labor peace agreement, shall be an ongoing material condition of maintaining and renewing the license.\n(e) An application on behalf of a corporation or association shall be signed by at least two officers or managing agents of that entity.\n(f) The office may establish exceptions to the disclosures required under paragraph (b) for members of a cooperative who hold less than a five percent ownership interest in the cooperative.\nSubject to the limits under subdivision 1b, paragraphs (a) to (d), the office shall issue the necessary number of licenses in order to ensure that there is a sufficient supply of cannabis flower and cannabis products to meet demand, provide market stability, ensure that there is a competitive market, and limit the sale of unregulated cannabis flower and cannabis products.\n(a) Before July 1, 2026, the office may issue up to the maximum total number of licenses in each license category listed in paragraphs (b) and (c).\n(b) For licenses that are available to social equity applicants, the maximum number of licenses that the office may issue are:\n(1) cannabis cultivator licenses, 25;\n(2) cannabis manufacturer licenses, 12;\n(3) cannabis retailer licenses, 75; and\n(4) cannabis mezzobusiness licenses, 50.\n(c) For licenses that are available to all applicants, the maximum number of licenses that the office may issue are:\n(1) cannabis cultivator licenses, 25;\n(2) cannabis manufacturer licenses, 12;\n(3) cannabis retailer licenses, 75; and\n(4) cannabis mezzobusiness licenses, 50.\n(d) Beginning July 1, 2026, the office must determine the number of cannabis cultivator licenses, cannabis manufacturer licenses, cannabis retailer licenses, and cannabis mezzobusiness licenses that the office will issue consistent with the goals identified in subdivision 1a. If the office makes any of those types of licenses available, the number of licenses available to social equity applicants must be equal to or greater than the number of licenses available to all applicants.\n(e) The office may issue as many licenses as the office deems necessary of a license type that is not listed in this subdivision. If the office limits the number of license types not listed in this subdivision available in any licensing period, the office must identify the number of licenses available to social equity applicants and the number of licenses available to all applicants. The number of licenses available to social equity applicants must be equal to or greater than the number of licenses available to all applicants. The office is not required to issue a license for a license type that is not listed in this subdivision.\n(f) The office is not required to issue licenses to meet the maximum number of licenses that may be issued under paragraphs (b) and (c).\n(a) The office must establish a procedure to verify that an individual seeking to apply for a cannabis business license as a social equity applicant, either as an individual or as a true party of interest who must be identified on an application, meets the requirements of section 342.17. As used in this paragraph, \"true party of interest\" has the meaning given in section 342.185, subdivision 1, paragraph (g).\n(b) The office may announce social equity applicant verification periods and may require verification that an individual seeking to apply for a cannabis business license as a social equity applicant meets the requirements of section 342.17 before the office accepts an application from the individual.\n(c) A person seeking to be verified as a social equity applicant must submit all required information on the forms and in the manner prescribed by the office.\n(d) The office must issue a notice to an individual seeking to be verified as a social equity applicant stating that the office has verified the individual's status as a social equity applicant or that the office has been unable to verify the individual's status as a social equity applicant.\n(e) Data collected, created, or maintained by the office pursuant to this subdivision, other than data listed in section 342.20, subdivision 2, are classified as nonpublic data, as defined by section 13.02, subdivision 9, or as private data on individuals, as defined by section 13.02, subdivision 12.\n(a) The office must announce the commencement of a licensing period in advance of accepting applications for cannabis business licenses. At a minimum, the announcement must include:\n(1) the types of licenses that will be available during the licensing period;\n(2) if the office limits the number of a type of license that will be available, the number of that type of license available in the licensing period;\n(3) the date on which the office will begin accepting applications; and\n(4) the date on which the office will no longer accept applications.\n(b) An applicant must submit all required information and the applicable application fee to the office on the forms and in the manner prescribed by the office.\n(c) If the office receives an application that fails to provide the required information or pay the applicable application fee, the office shall issue a deficiency notice to the applicant. The applicant may submit the required information or pay the required application fee within 14 calendar days from the date of the deficiency notice.\n(d) Failure by an applicant to submit all required information or pay the application fee to the office will result in the application being rejected.\n(a) After an applicant submits an application that contains all required information and pays the applicable licensing fee, the office must review the application.\n(b) The office may deny an application if:\n(1) the application is incomplete;\n(2) the application contains a materially false statement about the applicant or omits information required under subdivision 1;\n(3) the applicant does not meet the qualifications under section 342.16;\n(4) the applicant is prohibited from holding the license under section 342.18, subdivision 2;\n(5) the application does not meet the minimum requirements under section 342.18, subdivision 3;\n(6) the applicant fails to pay the applicable application fee;\n(7) the application was not submitted by the application deadline;\n(8) the applicant submitted more than one application for a license type; or\n(9) the office determines that the applicant would be prohibited from holding a license for any other reason.\n(c) If the office denies an application, the office must notify the applicant of the denial and the basis for the denial.\n(d) The office may request additional information from any applicant if the office determines that the information is necessary to review or process the application. If the applicant does not provide the additional requested information within 14 calendar days of the office's request for information, the office may deny the application.\n(e) An applicant whose application is not denied under this subdivision is a qualified applicant.\n(a) If the number of qualified applicants who are verified social equity applicants seeking a type of license exceeds the number of licenses of that type that are made available for social equity applicants, the office must first conduct a lottery consisting of verified social equity applicants to select qualified applicants for preliminary license approval. If a social equity applicant is not selected in a lottery conducted under this paragraph, the office must include the social equity applicant in the pool of applicants for licenses of that type that are made available to all applicants.\n(b) If the number of qualified applicants seeking a type of license exceeds the number of licenses of that type that are made available to all applicants, the office must conduct a lottery to select applicants for preliminary license approval.\n(c) A lottery conducted under this section must be impartial, random, and in a format determined by the office.\n(d) Following the completion of any lottery conducted pursuant to paragraphs (a) or (b), the office must notify each applicant entered in the lottery that the applicant was either selected or not selected in the lottery.\n(a) Before granting preliminary license approval, the office may conduct a background check of qualified applicants consistent with section 342.15.\n(b) The office must issue preliminary license approval to a qualified applicant if the applicant is not disqualified under section 342.15, and:\n(1) there are a sufficient number of licenses of the type the applicant is seeking for all qualified applicants to receive preliminary license approval; or\n(2) the qualified applicant is selected in the lottery conducted under subdivision 4.\n(c) The office must notify an applicant of the results of any background check and whether the office has granted preliminary license approval. If the office does not grant preliminary license approval, the notice must state the specific reasons for the office's decision.\n(a) Within 18 months of receiving notice of preliminary license approval, an applicant must provide:\n(1) the address and legal property description of the location where the business will operate;\n(2) the name of the local unit of government where the business will be located; and\n(3) if applicable, an updated description of the location where the business will operate, an updated security plan, and any other additional information required by the office.\n(b) Upon receipt of the information required under paragraph (a) from an applicant that has received preliminary license approval, the office must:\n(1) forward a copy of the application to the local unit of government in which the business operates or intends to operate with a form for certification as to whether a proposed cannabis business complies with local zoning ordinances and, if applicable, whether the proposed business complies with the state fire code and building code;\n(2) schedule a site inspection; and\n(3) require the applicant to pay the applicable license fee.\n(c) The office may deny final authorization if:\n(1) an applicant fails to submit any required information;\n(2) the applicant submits a materially false statement about the applicant or fails to provide any required information;\n(3) the office confirms that the cannabis business for which the office granted a license preapproval does not meet local zoning and land use laws;\n(4) the applicant fails to pay the applicable license fee; or\n(5) the office determines that the applicant is disqualified from holding the license or would operate in violation of the provisions of this chapter.\n(d) Within 90 days of receiving the information required under paragraph (a) and the results of any required background check, the office shall grant final authorization and issue the appropriate license or send the applicant a notice of rejection setting forth specific reasons that the office did not approve the application.\n(a) Except as provided in paragraph (d), the office must issue a license to a city or county seeking to establish, own, or operate a single municipal cannabis store authorized under section 342.32, subdivision 5, if the city or county:\n(1) submits all information required by the office;\n(2) meets the minimum requirements under section 342.18, subdivision 3; and\n(3) pays the applicable application and license fee.\n(b) A license issued to a city or county must not be counted against the maximum number of licenses made available in a licensing period.\n(c) A municipal cannabis store established, owned, or operated by a city or county must not be included in any limitation on the number of licensed cannabis retailers, cannabis mezzobusinesses with a retail operations endorsement, or cannabis microbusinesses with a retail operations endorsement that a local unit of government imposes or adopts pursuant to section 342.13, paragraph (h) or (i).\n(d) The office may refuse to issue a license to a city or county if the office determines that the issuance of the license would be inconsistent with the goals in subdivision 1a.\n(e) Nothing in this subdivision prohibits a city or county from applying for a cannabis retail license subject to the requirements and procedure applicable to all other applicants.\nIf the office denies an application or denies final authorization and does not issue a license after granting preliminary license approval, the applicant may seek reconsideration from the office. A decision by the office on a request for reconsideration is final.\n(a) If the office holds a lottery as provided in subdivision 4, the office must retain the applications of any applicant not selected in the lottery for one year. The office must consider a retained application during any licensing periods that begin within the year and, except as otherwise provided in this subdivision, the office must treat a retained application as if the application were submitted during the licensing period.\n(b) At the beginning of a subsequent licensing period, the applicant may amend an application or provide additional information to the office. The office may request additional information from any applicant whose application is retained to determine if the applicant meets the requirements for a subsequent licensing period. If the applicant does not provide the requested information to the office within 14 calendar days of the office's request, the office may deny the application.\n(c) The office must not charge an additional application fee to an applicant whose application was retained by the office.\n(d) An applicant may withdraw a retained application at any time. If the applicant withdraws a retained application, the applicant may submit a new application during a licensing period. An applicant who submits a new application must pay the applicable application fee.\n(e) The office may disqualify an application from retention if the office could deny the application under subdivision 3, paragraph (a).\n(a) A preliminary license approval expires after 18 months unless the office revokes the preliminary license approval or grants an extension. The office may grant a onetime extension of up to six months if an applicant has made good faith efforts to convert a preliminary license approval into a license. The office must not issue a license to an applicant whose preliminary license approval has expired.\n(b) If the office determines that an applicant is not eligible for a license, the office may revoke a preliminary license approval.\n(c) The office must notify an applicant if the office revokes the applicant's preliminary license approval or if the applicant's preliminary license approval expires.",
	"repealed": false
}