{
	"id": "299F.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.75",
	"title": "299F.75 PERMIT APPLICATION.",
	"text": "Any person desiring to possess explosives or blasting agents, other than a person licensed as provided in section 299F.73, shall make application for a permit for the use of explosives or blasting agents to the appropriate local sheriff or chief of police of a statutory or home rule charter city of the first, second, or third class, or such other person as is designated by the commissioner of public safety, on a standardized form provided by the commissioner of public safety.\nThe application shall require the applicant's name, address, purpose for acquiring explosives or blasting agents, place of intended acquisition, quantity required, place and time of intended use, place and means of storage until such use, and whether the applicant is a person to whom no such permit may be issued pursuant to section 299F.77. Issuing authorities may request a certificate from the applicant regarding the applicant's knowledge in the use, handling, and storage of explosives and blasting agents, and may refuse to issue a permit to any person who does not have sufficient knowledge to protect the public safety. Any person aggrieved by the denial of a permit may request a hearing before the commissioner of public safety. The provisions of sections 14.57 to 14.69 shall apply to such hearings and subsequent proceedings, if any.\nPrior to the storage or use of explosives or blasting agents, the applicant shall notify the appropriate local fire official and law enforcement agency.\n(a) The portions of an application submitted under this section and any other data held by an issuing authority, local fire official, or law enforcement agency that indicate the applicant's place and time of intended use of explosives or blasting agents and place and means of storage of the explosives or blasting agents until such use shall be classified as nonpublic data pursuant to section 13.02, subdivision 9.\n(b) Nonpublic data held pursuant to this section may be shared with other law enforcement, and with employees of a government entity or utility, as defined in section 609.594, subdivision 1, whose job duties require access to a facility containing explosives or blasting agents. Any recipient of nonpublic data under this paragraph is prohibited from disclosing the data to anyone not directly involved in the work to be completed at the site where the explosives or blasting agents are stored or to be used.",
	"repealed": false
}