{
	"id": "62J.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.38",
	"title": "62J.38 COST CONTAINMENT DATA FROM GROUP PURCHASERS.",
	"text": "(a) The commissioner shall require group purchasers to submit detailed data on total health care spending for each calendar year. Group purchasers shall submit data for the 1993 calendar year by April 1, 1994, and each April 1 thereafter shall submit data for the preceding calendar year.\n(b) The commissioner shall require each group purchaser to submit data on revenue, expenses, and member months, as applicable. Revenue data must distinguish between premium revenue and revenue from other sources and must also include information on the amount of revenue in reserves and changes in reserves. Expenditure data must distinguish between costs incurred for patient care and administrative costs. Patient care and administrative costs must include only expenses incurred on behalf of health plan members and must not include the cost of providing health care services for nonmembers at facilities owned by the group purchaser or affiliate. Expenditure data must be provided separately for the following categories and for other categories required by the commissioner: physician services, dental services, other professional services, inpatient hospital services, outpatient hospital services, emergency, pharmacy services and other nondurable medical goods, mental health, and substance use disorder services, other expenditures, subscriber liability, and administrative costs. Administrative costs must include costs for marketing; advertising; overhead; salaries and benefits of central office staff who do not provide direct patient care; underwriting; lobbying; claims processing; provider contracting and credentialing; detection and prevention of payment for fraudulent or unjustified requests for reimbursement or services; clinical quality assurance and other types of medical care quality improvement efforts; concurrent or prospective utilization review as defined in section 62M.02; costs incurred to acquire a hospital, clinic, or health care facility, or the assets thereof; capital costs incurred on behalf of a hospital or clinic; lease payments; or any other costs incurred pursuant to a partnership, joint venture, integration, or affiliation agreement with a hospital, clinic, or other health care provider. Capital costs and costs incurred must be recorded according to standard accounting principles. The reports of this data must also separately identify expenses for local, state, and federal taxes, fees, and assessments. The commissioner may require each group purchaser to submit any other data, including data in unaggregated form, for the purposes of developing spending estimates, setting spending limits, and monitoring actual spending and costs. In addition to reporting administrative costs incurred to acquire a hospital, clinic, or health care facility, or the assets thereof; or any other costs incurred pursuant to a partnership, joint venture, integration, or affiliation agreement with a hospital, clinic, or other health care provider; reports submitted under this section also must include the payments made during the calendar year for these purposes. The commissioner shall make public, by group purchaser data collected under this paragraph in accordance with section 62J.321, subdivision 5. Workers' compensation insurance plans and automobile insurance plans are exempt from complying with this paragraph as it relates to the submission of administrative costs.\n(c) The commissioner may collect information on:\n(1) premiums, benefit levels, managed care procedures, and other features of health plan companies;\n(2) prices, provider experience, and other information for services less commonly covered by insurance or for which patients commonly face significant out-of-pocket expenses; and\n(3) information on health care services not provided through health plan companies, including information on prices, costs, expenditures, and utilization.\n(d) All group purchasers shall provide the required data using a uniform format and uniform definitions, as prescribed by the commissioner.",
	"repealed": false
}