{
	"id": "49.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.44",
	"title": "49.44 NATIONAL BANKING ASSOCIATION; CONVERSION, MERGER, CONSOLIDATION; STATE BANK.",
	"text": "A national banking association which is located in this state and which has taken the corporate action required therefor by the laws of the United States may convert into a state bank upon complying with the provisions applicable to the organization of a state bank except as herein otherwise provided. In such case the certificate of incorporation and the application for a certificate authorizing the proposed bank to transact business shall be executed by a majority of the directors of the national banking association and in addition thereto there shall be filed with the application a copy of the plan of conversion and a certificate signed by the president and the cashier of the national banking association setting forth the corporate action taken by the national banking association authorizing the conversion. The Department of Commerce may, at its discretion, dispense with the notice and hearing provided in section 46.041, if the granting of the certificate of authority will not increase the number of banks in the community affected. No certificate of deposit of an amount equal to the capital stock of the proposed bank shall be required but the president and the cashier of the national banking association shall certify to the commissioner of commerce that the association has a paid in and unimpaired capital not less than that specified in the certificate of incorporation of the proposed bank. Upon the conversion of a national banking association into a state bank as herein provided, the corporate existence of the national banking association shall be merged into that of the state bank and all and singular its rights, privileges, and franchises and its right, title, and interest in and to all property of whatsoever kind, whether real, personal, or mixed, and all things in action and every right, privilege, interest, or asset of conceivable value or benefit then existing which inure to it under an unconverted existence shall be deemed fully and finally transferred to and vested in the state bank without further act or deed and the state bank shall have and hold the same in its own right as fully as the same was possessed and held by the national banking association from which it was by operation hereof transferred. Its rights, obligations, and relations to any person, creditor, depositor, trustee, or beneficiary of any trust shall remain unimpaired and the state bank into which it shall have been converted shall succeed to these relations, obligations, trusts, and liabilities and shall execute and perform all such trusts in the same manner as though it had itself assumed the relation or trust or incurred the obligation or liability and its liabilities and obligations to creditors existing for any cause shall not be impaired by the conversion, nor shall any obligation or liability of any stockholder of the national banking association be affected by such conversion, but these obligations and liabilities shall continue as fully and to the same effect as existed before the conversion. The state bank shall become without further act or deed the successor of the national banking association in any and all fiduciary capacities in which the national banking association may be acting at the time of the conversion and shall be liable to all beneficiaries as fully as if the national banking association had continued its existence as such. If the national banking association shall be nominated or appointed or shall have been nominated or appointed as executor, guardian, administrator, agent or trustee, or in any other trust relation or fiduciary capacity in any will, trust agreement, trust conveyance or any other conveyance, order or judgment of any court or any other instrument prior to the conversion, even though the will or other instrument shall not become operative or effective until after the conversion shall have become effective, every such office, trust relationship, fiduciary capacity, and all of the rights, powers, privileges, duties, discretions, and responsibilities so provided to devolve upon, vest in, or inure to the national banking association so nominated or appointed shall fully and in every respect devolve upon, vest in, and inure to and be exercised by the state bank into which the national banking association shall have been converted.",
	"repealed": false
}