{
	"id": "477C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/477C.04",
	"title": "477C.04 APPROPRIATION, PAYMENT, AND ADMINISTRATION.",
	"text": "(a) The commissioner must make payments to the municipality equal to the amount of police state aid apportioned to the applicable state aid recipient under section 477C.03.\n(b) Police state aid is payable on October 1 annually. The amount of state aid due and not paid by October 1 accrues interest payable to the recipient at the rate of one percent for each month or part of a month that the amount remains unpaid after October 1.\n(a) The amount necessary to make the payments under this section and section 477C.03 is annually appropriated to the commissioner from the general fund.\n(b) The police state aid apportioned to the Departments of Public Safety and Natural Resources under section 477C.03 is allocated to the commissioner of management and budget for transfer to the funds and accounts from which the salaries of peace officers certified under section 477C.02, subdivision 2, are paid. On or before October l, the commissioner of revenue must certify to the commissioners of public safety, natural resources, and management and budget the amounts to be transferred from the appropriation for police state aid. The commissioners of public safety and natural resources must certify to the commissioner of management and budget the amounts to be credited to each of the funds and accounts from which the peace officers employed by their respective departments are paid.\n(a) For a municipality in which police retirement coverage is provided by the public employees police and fire fund and all peace officers are members of the fund, including municipalities covered by section 353.665, the total state aid must be applied toward the municipality's employer contribution to the public employees police and fire fund under sections 353.65, subdivision 3, and 353.665, subdivisions 8 and 8a.\n(b) The county treasurer, upon receipt of the police state aid for the county, must apply the total state aid toward the county's employer contribution to the public employees police and fire fund under section 353.65, subdivision 3.\n(c) The designated Metropolitan Airports Commission official, upon receipt of the police state aid for the Metropolitan Airports Commission, must apply the total police state aid toward the commission's employer contribution for peace officers to the public employees police and fire plan under section 353.65, subdivision 3.\n(d) The commissioners of public safety and natural resources must allocate the police state aid first for employer contributions funded from the general fund and then for employer contributions funded from other funds. For peace officers employed by the Departments of Natural Resources or Public Safety whose salaries are paid from the general fund, the amounts transferred from the appropriation for police state aid must be canceled to the general fund.\n(a) An adjustment needed to correct a police state aid overpayment or underpayment due to a clerical error must be made to subsequent police state aid payments as provided in paragraphs (b) and (c). The authority to correct an aid payment under this subdivision is limited to three years after the payment was issued.\n(b) If an overpayment equals more than ten percent of the most recently paid aid amount, the commissioner must reduce the aid a municipality is to receive by the amount overpaid over a period of no more than three years. If an overpayment equals or is less than ten percent of the most recently paid aid amount, the commissioner must reduce the next aid payment occurring in 30 days or more by the amount overpaid.\n(c) In the event of an underpayment, the commissioner must distribute the amount of underpaid funds to the municipality over a period of no more than three years. An additional distribution to a municipality must be paid from the general fund and must not diminish the payments made to other municipalities under this chapter.",
	"repealed": false
}