{
	"id": "239.7911",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.7911",
	"title": "239.7911 PETROLEUM REPLACEMENT PROMOTION.",
	"text": "The tiered petroleum replacement goal of the state of Minnesota is that biofuel comprises at least the specified portion of total gasoline sold or offered for sale in this state by each specified year:\n(a) The commissioner of agriculture, in consultation with the commissioners of commerce and the Pollution Control Agency, shall identify and implement activities necessary to achieve the goals in subdivision 1. Beginning November 1, 2005, and continuing through 2015, the commissioners, or their designees, shall convene a task force pursuant to section 15.014 that includes representatives from the renewable fuels industry, petroleum retailers, refiners, automakers, small engine manufacturers, and other interested groups. The task force shall assist the commissioners in carrying out the activities in paragraph (b) and eliminating barriers to the use of greater biofuel blends in this state. The task force must coordinate efforts with the biodiesel task force and the Renewable Energy Roundtable and develop annual recommendations for administrative and legislative action.\n(b) The activities of the commissioners under this subdivision shall include, but not be limited to:\n(1) developing recommendations for specific, cost-effective incentives necessary to expedite the use of greater biofuel blends in this state including, but not limited to, incentives for retailers to install equipment necessary to dispense renewable liquid fuels to the public;\n(2) expanding the renewable-fuel options available to Minnesota consumers by obtaining federal approval for the use of additional blends that contain a greater percentage of biofuel;\n(3) developing recommendations to ensure that motor vehicles and small engine equipment have access to an adequate supply of fuel;\n(4) working with the owners and operators of large corporate automotive fleets in the state to increase their use of renewable fuels;\n(5) working to maintain an affordable retail price for liquid fuels;\n(6) facilitating the production and use of advanced biofuels in this state; and\n(7) developing procedures for reporting the amount and type of biofuel under subdivision 1 and section 239.791, subdivision 1, paragraph (c).\n(c) Notwithstanding section 15.014, the task force required under paragraph (a) expires on December 31, 2015.",
	"repealed": false
}