{
	"id": "103F.725",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.725",
	"title": "103F.725 FINANCIAL AND TECHNICAL ASSISTANCE.",
	"text": "(a) The agency may award grants for up to 50 percent of the eligible cost for projects.\n(b) The agency shall determine which costs are eligible costs and grants shall be made and used only for eligible costs.\n(a) Up to $50,000,000 of the balance in the clean water revolving fund in section 446A.07, as determined by the Public Facilities Authority, may be provided to the commissioner for a clean water partnership loan program.\n(b) The agency may award loans for up to 100 percent of the costs associated with activities identified by the agency as best management practices pursuant to section 319 and section 320 of the federal Water Quality Act of 1987, as amended, including associated administrative costs.\n(c) Loans may be used to finance clean water partnership grant project eligible costs not funded by grant assistance.\n(d) The interest rate, at or below market rate, and the term, not to exceed 20 years, shall be determined by the agency in consultation with the Public Facilities Authority.\n(e) The repayment must be deposited in the clean water revolving fund under section 446A.07.\n(f) The local unit of government receiving the loan is responsible for repayment of the loan.\n(g) For the purpose of obtaining a loan from the agency, a local government unit may provide to the agency its general obligation note. All obligations incurred by a local government unit in obtaining a loan from the agency must be in accordance with chapter 475, except that so long as the obligations are issued to evidence a loan from the agency to the local government unit, an election is not required to authorize the obligations issued, and the amount of the obligations shall not be included in determining the net indebtedness of the local government unit under the provisions of any law or chapter limiting the indebtedness.\nThe agency may provide technical assistance to local units of government to ensure efficient and effective development and implementation of projects and coordination of projects with other water management activities.",
	"repealed": false
}