{
	"id": "240.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.22",
	"title": "240.22 FINES.",
	"text": "(a) The commission shall by rule establish a schedule of civil fines of up to $50,000 for a class C licensee and up to $200,000 for a class A, B, or D licensee for violations of laws related to horse racing or of the commission's rules. The schedule must be based on and reflect the culpability, frequency and severity of the violator's actions. The commission may impose a fine from this schedule on a licensee for a violation of those rules or laws relating to horse racing. The fine is in addition to any criminal penalty imposed for the same violation. Except as provided in paragraph (b), fines may be appealed to the commission according to its rules. Fines imposed by the commission must be paid to the commission and except as provided in paragraph (c), forwarded to the commissioner of management and budget for deposit in the state treasury and credited to a racing and card-playing regulation account in the special revenue fund and appropriated to the commission to distribute in the form of grants, contracts, or expenditures to support racehorse adoption, retirement, and repurposing.\n(b) If the commission issues a fine in excess of $10,000, the license holder has the right to request a contested case hearing under chapter 14, to be held as set forth in Minnesota Rules, chapter 1400. The appeal of a fine must be made in writing to the commission by certified mail or personal service. An appeal sent by certified mail must be postmarked within ten days after the license holder receives the fine order from the commission. An appeal sent by personal service must be received by the commission within ten days after the license holder receives the fine order from the commission.\n(c) If the commission is the prevailing party in a contested case proceeding, the commission may recover, from amounts to be forwarded under paragraph (a), reasonable attorney fees and costs associated with the contested case.",
	"repealed": false
}