{
	"id": "375A.1205",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.1205",
	"title": "375A.1205 APPOINTING COUNTY OFFICERS.",
	"text": "A county board may appoint the county auditor, county treasurer, or county recorder under section 375A.10, subdivision 2, or the auditor-treasurer under section 375A.10, subdivision 5, by following the process outlined in this section. Notwithstanding section 375A.12, a referendum is not required if the appointment is made pursuant to this section. A county board shall only use the authority to appoint under the following circumstances:\n(1) there is a vacancy in the office as provided in section 351.02;\n(2) the current office holder has notified the county board that the officer will not file for the office, as provided in subdivision 2; or\n(3) there is a signed contract with the county board and the incumbent auditor, treasurer, auditor-treasurer, or recorder that provides that the incumbent officer will be appointed to the position and retain tenure, pay, and benefits equal to or greater than length of service.\nAt least 104 days before the filing date for office under section 204B.09, an elected county officer must notify the county board in writing whether the officer will be filing for another term. If the officer indicates in writing that the officer will not file for the office and the county board has passed a resolution under subdivision 6, affidavits of candidacy will not be accepted for that office, and the office will not be placed on the ballot.\nUpon adoption of a resolution by the county board of commissioners and subject to subdivisions 5 and 6, the duties of an elected official required by statute whose office is made appointive as authorized by this section must be discharged by the county board of commissioners acting through a department head appointed by the board for that purpose. Reorganization, reallocation, delegation, or other administrative change or transfer does not diminish, prohibit, or avoid the discharge of duties required by statute.\n(a) A county auditor, county treasurer, county auditor-treasurer, or county recorder who was elected at the most recent election for that office prior to a county board resolution to make the office an appointed position, and the elected official is subsequently appointed by the county board to the office, may not be involuntarily demoted or discharged except for incompetency or misconduct.\n(b) Prior to demoting or discharging an office holder under this subdivision, the board must notify the office holder in writing and state its grounds for the proposed demotion or discharge in reasonable detail. Within ten days after receipt of this notification, the office holder may make a written request for a hearing before an arbitrator and the request must be granted before final action is taken. Failure to request a hearing before an arbitrator during this period is considered acquiescence to the board's action. The board may suspend an office holder with pay pending the conclusion of the hearing and determination of the issues raised in the hearing after charges have been filed which constitute grounds for demotion or discharge. If an office holder has been charged with a felony and the underlying conduct that is the subject of the felony charge is grounds for a proposed discharge, the suspension pending the conclusion of the hearing and determination of the issues may be without pay. If a hearing under this subdivision is held, the board must reimburse the office holder for any salary or compensation withheld if the final decision of the arbitrator does not result in a penalty or discharge of the office holder.\n(c) If the office holder and the board are unable to mutually agree on an arbitrator, the board must request from the Bureau of Mediation Services a list of seven persons qualified to serve as an arbitrator. If the office holder and the board are unable to mutually agree on an arbitrator from the list provided, the parties shall alternately strike names from the list until the name of one arbitrator remains. The person remaining after the striking procedure must be the arbitrator. If the parties are unable to agree on who shall strike the first name, the question must be decided by a flip of a coin. The office holder and the board must share equally the costs and fees of the arbitrator except as set forth in paragraph (g).\n(d) The arbitrator shall determine, by a preponderance of the evidence, whether the grounds for discharge or demotion exist to support the proposed discharge or demotion. A lesser penalty than demotion or discharge may be imposed by the arbitrator only to the extent that either party proposes such lesser penalty in the proceeding. In making the determination, the arbitration proceeding is governed by sections 572B.15 to 572B.28.\n(e) An arbitration hearing conducted under this subdivision is a meeting for preliminary consideration of allegations or charges within the meaning of section 13D.05, subdivision 3, paragraph (a), and must be closed, unless the office holder requests it to be open.\n(f) The arbitrator's award is final and binding on the parties, subject to sections 572B.18 to 572B.28.\n(g) In the event the arbitrator rules not to demote or discharge the office holder, the board shall pay all of the costs and fees of the arbitrator and the attorney fees of the office holder.\nThe person elected at the last general election to an office made appointive under this section must serve in that capacity and perform the duties, functions, and responsibilities required by statute until the completion of the term of office to which the person was elected, or until a vacancy occurs in the office, whichever occurs earlier.\n(a) Before the adoption of the resolution to provide for the appointment of an office as described in subdivision 1, the county board must publish a proposed resolution notifying the public of its intent to consider the issue once each week, for two consecutive weeks, in the official publication of the county. Following publication and prior to formally adopting the resolution, the county board shall provide an opportunity at its next regular meeting for public comment relating to the issue. After the public comment opportunity, at the same meeting or a subsequent meeting, the county board of commissioners may adopt a resolution that provides for the appointment of the office or offices as permitted in this section. The resolution must be approved by at least 80 percent of the members of the county board. The resolution may take effect 30 days after it is adopted, or at a later date stated in the resolution, unless a petition is filed as provided in paragraph (b).\n(b) Except when an office is made appointive under subdivision 1, clause (3), within 30 days after the county board adopts the resolution, a petition requesting a referendum may be filed with the county auditor. The petition must be signed by at least ten percent of the registered voters of the county. The petition must meet the requirements of the secretary of state, as provided in section 204B.071, and any rules adopted to implement that section. If the petition is sufficient, the county board resolution is rescinded.\n(a) The county board may adopt a resolution to provide for the election of an office that was made an appointed position under this section, but not until at least three years after the office was made an appointed position. The county board must publish a proposed resolution notifying the public of its intent to consider the issue once each week, for two consecutive weeks, in the official publication of the county. Following publication and before formally adopting the resolution, the county board must provide an opportunity at its next regular meeting for public comment relating to the issue. After the public comment opportunity, at the same meeting or a subsequent meeting, the county board of commissioners may adopt the resolution. The resolution must be approved by at least 60 percent of the members of the county board and is effective August 1 following adoption of the resolution.\n(b) The question of whether an office that was made an appointed position under this section must be made an elected office must be placed on the ballot at the next general election if: (1) the position has been an appointed position for at least three years; (2) a petition signed by at least ten percent of the registered voters of the county is filed with the office of the county auditor by August 1 of the year in which the general election is held; and (3) the petition meets the requirements of the secretary of state, as provided in section 204B.071, and any rules adopted to implement that section. If a majority of the voters of the county voting on the question vote in favor of making the office an elected position, the election for that office must be held at the next regular or special election.",
	"repealed": false
}