{
	"id": "144E.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.27",
	"title": "144E.27 EDUCATION PROGRAMS; DIRECTOR APPROVAL.",
	"text": "MS 2022 [Repealed, 2024 c 122 art 3 s 15; 2024 c 127 art 65 s 15]\nMS 2022 [Repealed, 2024 c 122 art 3 s 15; 2024 c 127 art 65 s 15]\nTo be eligible for registration with the director as an emergency medical responder, an individual shall complete a director-approved application form and:\n(1) successfully complete a director-approved initial emergency medical responder education program. Registration under this clause is valid for two years and expires on October 31; or\n(2) be credentialed as an emergency medical responder by the National Registry of Emergency Medical Technicians. Registration under this clause expires the same day as the National Registry credential.\nRegistration expiration dates are as follows:\n(1) for initial registration granted between January 1 and June 30 of an even-numbered year, the expiration date is October 31 of the next even-numbered year;\n(2) for initial registration granted between July 1 and December 31 of an even-numbered year, the expiration date is October 31 of the second odd-numbered year;\n(3) for initial registration granted between January 1 and June 30 of an odd-numbered year, the expiration date is October 31 of the next odd-numbered year; and\n(4) for initial registration granted between July 1 and December 31 of an odd-numbered year, the expiration date is October 31 of the second even-numbered year.\n(a) The director may renew the registration of an emergency medical responder who:\n(1) successfully completes a director-approved refresher course;\n(2) successfully completes a course in cardiopulmonary resuscitation approved by the director or by the licensee's medical director. This course may be a component of a director-approved refresher course; and\n(3) submits a completed renewal application to the director before the registration expiration date.\n(b) The director may renew the lapsed registration of an emergency medical responder who:\n(1) successfully completes a director-approved refresher course;\n(2) successfully completes a course in cardiopulmonary resuscitation approved by the director or by the licensee's medical director. This course may be a component of a director-approved refresher course; and\n(3) submits a completed renewal application to the director within 48 months after the registration expiration date.\nMS 2002 [Repealed, 2004 c 144 s 9]\n(a) This subdivision applies to individuals seeking registration or registered as an emergency medical responder and to individuals seeking registration or registered as a driver of a basic life-support ambulance under section 144E.101, subdivision 6a. The director may deny, suspend, revoke, place conditions on, or refuse to renew the registration of an individual who the director determines:\n(1) violates sections 144E.001 to 144E.33 or the rules adopted under those sections, an agreement for corrective action, or an order that the director issued or is otherwise empowered to enforce;\n(2) misrepresents or falsifies information on an application form for registration;\n(3) is convicted or pleads guilty or nolo contendere to any felony; any gross misdemeanor relating to assault, sexual misconduct, theft, or the illegal use of drugs or alcohol; or any misdemeanor relating to assault, sexual misconduct, theft, or the illegal use of drugs or alcohol;\n(4) is actually or potentially unable to provide emergency medical services or drive an ambulance with reasonable skill and safety to patients by reason of illness, use of alcohol, drugs, chemicals, or any other material, or as a result of any mental or physical condition;\n(5) engages in unethical conduct, including, but not limited to, conduct likely to deceive, defraud, or harm the public, or demonstrating a willful or careless disregard for the health, welfare, or safety of the public;\n(6) maltreats or abandons a patient;\n(7) violates any state or federal controlled substance law;\n(8) engages in unprofessional conduct or any other conduct which has the potential for causing harm to the public, including any departure from or failure to conform to the minimum standards of acceptable and prevailing practice without actual injury having to be established;\n(9) for emergency medical responders, provides emergency medical services under lapsed or nonrenewed credentials;\n(10) is subject to a denial, corrective, disciplinary, or other similar action in another jurisdiction or by another regulatory authority;\n(11) engages in conduct with a patient that is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior that is seductive or sexually demeaning to a patient;\n(12) makes a false statement or knowingly provides false information to the director, or fails to cooperate with an investigation of the director as required by section 144E.30; or\n(13) fails to engage with the health professionals services program or diversion program required under section 144E.287 after being referred to the program, violates the terms of the program participation agreement, or leaves the program except upon fulfilling the terms for successful completion of the program as set forth in the participation agreement.\n(b) Before taking action under paragraph (a), the director shall give notice to an individual of the right to a contested case hearing under chapter 14. If an individual requests a contested case hearing within 30 days after receiving notice, the director shall initiate a contested case hearing according to chapter 14.\n(c) The administrative law judge shall issue a report and recommendation within 30 days after closing the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\n(d) After six months from the director's decision to deny, revoke, place conditions on, or refuse renewal of an individual's registration for disciplinary action, the individual shall have the opportunity to apply to the director for reinstatement.\n(a) This subdivision applies to emergency medical responders registered under this section and to individuals registered as drivers of basic life-support ambulances under section 144E.101, subdivision 6a. In addition to any other remedy provided by law, the director may temporarily suspend the registration of an individual after conducting a preliminary inquiry to determine whether the director believes that the individual has violated a statute or rule that the director is empowered to enforce and determining that the continued provision of service by the individual would create an imminent risk to public health or harm to others.\n(b) A temporary suspension order prohibiting an individual from providing emergency medical care or from driving a basic life-support ambulance shall give notice of the right to a preliminary hearing according to paragraph (d) and shall state the reasons for the entry of the temporary suspension order.\n(c) Service of a temporary suspension order is effective when the order is served on the individual personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the director for the individual.\n(d) At the time the director issues a temporary suspension order, the director shall schedule a hearing, to be held before a group of its members designated by the director, that shall begin within 60 days after issuance of the temporary suspension order or within 15 working days of the date of the director's receipt of a request for a hearing from the individual, whichever is sooner. The hearing shall be on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. A hearing under this paragraph is not subject to chapter 14.\n(e) Evidence presented by the director or the individual may be in the form of an affidavit. The individual or the individual's designee may appear for oral argument.\n(f) Within five working days of the hearing, the director shall issue its order and, if the suspension is continued, notify the individual of the right to a contested case hearing under chapter 14.\n(g) If an individual requests a contested case hearing within 30 days after receiving notice under paragraph (f), the director shall initiate a contested case hearing according to chapter 14. The administrative law judge shall issue a report and recommendation within 30 days after the closing of the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.",
	"repealed": false
}