{
	"id": "254B.052",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.052",
	"title": "254B.052 PEER RECOVERY SUPPORT SERVICES REQUIREMENTS.",
	"text": "(a) Peer recovery support services are face-to-face interactions between a recovery peer and a client, on a one-on-one basis, in which specific goals identified in an individual recovery plan, treatment plan, or stabilization plan are discussed and addressed. Peer recovery support services are provided to promote a client's recovery goals, self-sufficiency, self-advocacy, and development of natural supports and to support maintenance of a client's recovery.\n(b) Peer recovery support services must be provided according to an individual recovery plan if provided by a recovery community organization or county, a treatment plan if provided in a substance use disorder treatment program under chapter 245G, or a stabilization plan if provided by a withdrawal management program under chapter 245F.\n(c) A client receiving peer recovery support services must participate in the services voluntarily. Any program that incorporates peer recovery support services must provide written notice to the client that peer recovery support services will be provided.\n(d) Peer recovery support services may not be provided to a client residing with or employed by a recovery peer from whom they receive services.\n(a) The individual recovery plan must be developed with the client and must be completed within the first three sessions with a recovery peer.\n(b) The recovery peer must document how each session ties into the client's individual recovery plan. The individual recovery plan must be updated as needed. The individual recovery plan must include:\n(1) the client's name;\n(2) the recovery peer's name;\n(3) the name of the recovery peer's supervisor;\n(4) the client's recovery goals;\n(5) the client's resources and assets to support recovery;\n(6) activities that may support meeting identified goals; and\n(7) the planned frequency of peer recovery support services sessions between the recovery peer and the client.\nAn eligible vendor of peer recovery support services under section 254B.05, subdivision 1, must keep a secure file for each individual receiving medical assistance peer recovery support services. The file must include, at a minimum:\n(1) the client's comprehensive assessment under section 245G.05 that led to the client's referral for peer recovery support services;\n(2) the client's individual recovery plan; and\n(3) documentation of each billed peer recovery support services interaction between the client and the recovery peer, including the date, start and end time with a.m. and p.m. designations, the client's response, and the name of the recovery peer who provided the service.",
	"repealed": false
}