{
	"id": "513.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/513.80",
	"title": "513.80 RESIDENTIAL REAL ESTATE SERVICE AGREEMENTS; UNFAIR SERVICE AGREEMENTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"County recorder\" has the meaning given in section 13.045, subdivision 1.\n(c) \"Person\" means natural persons, corporations both foreign and domestic, trusts, partnerships both limited and general, incorporated or unincorporated associations, companies, business entities, and any other legal entity or any other group associated in fact although not a legal entity or any agent, assignee, heir, employee, representative, or servant thereof.\n(d) \"Record\" or \"recording\" means placement of a document or instrument in the official county public land records.\n(e) \"Residential real property\" means real property that is located in Minnesota occupied, or intended to be occupied, by one to four families as their residence.\n(f) \"Service agreement\" means a contract under which a person agrees to provide real estate broker services as defined in section 82.55, subdivision 19, in connection with the purchase or sale of residential real property.\n(g) \"Service provider\" means an individual or entity that provides services to a person pursuant to a service agreement.\n(a) A service agreement subject to this section is unfair and prohibited if any part of the agreement provides an exclusive right to a service provider for a term in excess of one year after the time the service agreement is entered into and:\n(1) purports to run with the land or to be binding on future owners of interests in the real property;\n(2) allows for assignment of the right to provide service without notice to and consent of the residential real property's owner, including a contract for deed vendee;\n(3) is recorded or purports to create a lien, encumbrance, or other real property security interest; or\n(4) contains a provision that purports to automatically renew the agreement upon its expiration.\n(b) The following are not unfair service agreements under this section:\n(1) a home warranty or similar product that covers the cost of maintaining a major home system or appliance for a fixed period;\n(2) an insurance contract;\n(3) a mortgage loan or a commitment to make or receive a mortgage loan;\n(4) an option or right of refusal to purchase a residential real property;\n(5) a declaration of any covenants, conditions, or restrictions created in the formation of a homeowners association, a group of condominium owners, or other common interest community or an amendment to the covenants, conditions, or restrictions;\n(6) a maintenance or service agreement entered by a homeowners association in a common interest community;\n(7) a security agreement governed by chapter 336 that relates to the sale or rental of personal property or fixtures; or\n(8) a contract with a gas, water, sewer, electric, telephone, cable, or other utility service provider.\n(c) This section does not impair any lien right granted under Minnesota law or that is judicially imposed.\n(a) A person is prohibited from:\n(1) presenting or sending an unfair service agreement or notice or memorandum of an unfair service agreement to any county recorder to record; or\n(2) causing an unfair service agreement or notice or memorandum of an unfair service agreement to be recorded by a county recorder.\n(b) If a county recorder records an unfair service agreement, the county recorder does not incur liability.\n(c) If an unfair service agreement is recorded, the recording does not create a lien or provide constructive notice to any third party, bona fide purchaser, or creditor.\nA service agreement that is unfair under this section is unenforceable and does not create a contractual obligation or relationship. Any waiver of a consumer right, including a right to trial by jury, in an unfair service agreement is void.\nEncouraging any consumer to enter into an unfair service agreement by any service provider constitutes:\n(1) an unfair method of competition; and\n(2) an unfair or deceptive act or practice under section 82.81, subdivision 12, paragraph (c), and section 325F.69.\n(a) This section may be enforced by the attorney general under section 8.31, except that any private cause of action brought under subdivision 7 is subject to the limitation under subdivision 7, paragraph (d).\n(b) The commissioner of commerce may enforce this section with respect to a service provider's real estate license.\n(a) A consumer that is party to an unfair service agreement related to residential real property or a person with an interest in the property that is the subject of that agreement may bring an action under section 8.31 or 325F.70 in district court in the county where the property is located.\n(b) If an unfair service agreement or a notice or memorandum of an unfair service agreement is recorded against any residential real property, any judgment obtained under this section, after being certified by the clerk having custody of the unfair service agreement or notice or memorandum of the unfair service agreement, may be recorded and indexed against the real property encumbered or clouded by the unfair service agreement.\n(c) The remedies provided under this section are not exclusive and do not reduce any other rights or remedies a party may have in equity or in law.\n(d) No private action may be brought under this section more than six years after the date the term printed in the unfair service agreement expires.",
	"repealed": false
}