{
	"id": "216B.682",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.682",
	"title": "216B.682 MERCURY EMISSIONS-REDUCTION PLANS.",
	"text": "(a) By December 31, 2007, a public utility that owns a dry scrubbed unit at a qualifying facility shall develop and submit to the agency and the commission a plan for mercury emissions reduction at each such unit. At each dry scrubbed unit owned and operated by the utility, the plan must propose to employ the available technology for mercury removal that is most likely to result in the removal of at least 90 percent of the mercury emitted from the unit.\n(b) A plan submitted under this subdivision must provide for mercury emissions reduction at each dry scrubbed unit to be implemented by December 31, 2010. A public utility that owns two dry scrubbed targeted units must submit a plan that provides for implementation at one unit by December 31, 2009, and at the other unit by December 31, 2010.\n(a) By December 31, 2009, a public utility that owns a wet scrubbed unit at a qualifying facility shall develop and submit to the agency and the commission a plan for mercury emissions reduction at each such unit. At each wet scrubbed unit owned by the utility, the plan must propose to employ the available technology for mercury removal that is most likely to result in the removal of at least 90 percent of the mercury emitted from the unit.\n(b) A plan submitted under this subdivision must provide for mercury emissions reduction at each wet scrubbed unit to be implemented by December 31, 2014.\n(a) In each plan submitted under this section, a utility shall present information assessing that plan's ability to optimize human health benefits and achieve cost efficiencies. Each plan must provide the cost, technical feasibility, and mercury emissions reduction expected for the utility's preferred technology option and each alternative considered. The utility shall demonstrate that it has considered achieving the mercury emissions reduction required under this section through multiple pollutant control technology.\n(b) A plan submitted under this section may also:\n(1) provide measures to reduce the cost and maximize the flexibility of each option proposed or considered; and\n(2) specify permit targets or conditions proposed by the public utility for each mercury emission-control option proposed or considered, including, but not limited to, numeric emission targets, percent removal expectations, emission control technology installation and operation requirements or work practice standards, and potential changes in the performance of the mercury emissions-reduction technology over time.\n(c) The utility may submit an emissions rate rider to the commission under section 216B.683 to recover the costs associated with plans filed under this section.",
	"repealed": false
}