{
	"id": "160.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.89",
	"title": "160.89 TOLL FACILITY REVENUE BONDS.",
	"text": "To provide money to acquire, develop, finance, design, construct, improve, rehabilitate, and operate a toll facility and to establish a reserve for bonds issued under this section, the commissioner of management and budget, or a road authority by resolution of its governing body, may authorize, issue, and sell revenue bonds payable solely from all or a portion of the revenues derived from a toll facility, including any payments agreed to be made by a private operator. The bonds may be additionally secured by a mortgage of all or any portion of a toll facility or other property of the private operator. The bonds shall mature, bear the date or dates, bear interest at the rate or rates, be in denomination or denominations, be executed in the manner, be payable in such manner and be subject to redemption, with or without premium as may be provided by the resolution authorizing their issuance or any trust indenture approved by the governing body of the road authority. The bonds may be sold at private sale at the price approved pursuant to the authorizing resolution. The bonds must contain a recital that they are issued in aid of a toll facility under this section and the recital is conclusive evidence of the validity and enforceability of the bonds and the security for the bonds. Neither the road authority nor any director, commissioner, council member, officer, employee, or agent of the road authority is personally liable on the bonds by reason of their issuance. The road authority may make covenants it considers necessary to secure payment of the bonds, including, without limitation, establishing and maintaining reserves, and imposing and collecting tolls and other charges for use of the facility to provide net revenues adequate to provide for principal and interest on the bonds, and providing for the operation of the toll facility. The bonds must not be payable from nor a charge against any funds of the road authority other than the revenues or property pledged or mortgaged to secure their payment. The road authority is not subject to any liability on the bonds and it does not have any power to obligate itself to pay the bonds from funds other than the revenues and properties pledged and mortgaged. No holder or holders of the bonds has the right to compel any exercise of taxing power of the road authority or any other public body, other than as authorized by and pledged pursuant to this section, to pay the principal of or interest on the bonds, nor to enforce payment of the bonds against any property of the road authority or other public body other than that expressly pledged or mortgaged for payment; and the bonds must so state. Bonds payable from the net revenues of a toll facility and property pledged under this section are considered payable wholly from the income of a revenue-producing convenience within the meaning of chapter 475. Sections 474A.01 to 474A.21 apply to any issue of obligations under this section that are subject to limitation under a federal volume limitation act or existing federal tax law as defined in section 474A.02, subdivision 8.",
	"repealed": false
}