{
	"id": "268B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.10",
	"title": "268B.10 SUBSTITUTION OF A PRIVATE PLAN.",
	"text": "(a) Employers may apply to the commissioner for approval to meet their obligations under this chapter through the substitution of a private plan that provides paid family, paid medical, or paid family and medical benefits. In order to be approved as meeting an employer's obligations under this chapter, a private plan must confer all of the same rights, protections, and benefits provided to employees under this chapter, including but not limited to benefits under section 268B.04 and employment protections under section 268B.09. Employers may apply for approval of private plans that exceed the benefits provided to employees under this chapter. An employee covered by a private plan under this section retains all applicable rights and remedies under section 268B.09.\n(b) An insurer must file every form, application, rider, endorsement, and rate used in connection with an insurance product that provides coverage for paid family and medical leave benefits as described in this section with the commissioner at least 60 days prior to the form or rate's effective date. The commissioner may extend this filing review period for an additional period not to exceed 60 days. If any form, rate, or amendment is not disapproved by the commissioner within the filing review period, the insurer may implement it. If the commissioner notifies an insurer that has filed any form or rate that the form or rate does not comply with this section, section 62A.02, or chapter 72A, it is unlawful for the insurer to issue or use the form or rate. In the notice, the commissioner shall specify the reasons for disapproval.\n(c) Any insurer authorized to write accident and sickness insurance in Minnesota has the power to issue an insurance product that provides coverage for paid family and medical leave benefits as described in this section.\n[See Note.]\nThe commissioner, in consultation with the commissioner of commerce, must approve an application for private provision of the medical benefit program if the commissioner determines:\n(1) all of the employees of the employer are to be covered under the provisions of the employer plan;\n(2) eligibility requirements for benefits and leave are no more restrictive than as provided under this chapter;\n(3) the weekly benefits payable under the private plan for any week are at least equal to the weekly benefit amount payable under this chapter;\n(4) the total number of weeks for which benefits are payable under the private plan is at least equal to the total number of weeks for which benefits would have been payable under this chapter;\n(5) no greater amount is required to be paid by employees toward the cost of benefits under the employer plan than by this chapter;\n(6) wage replacement benefits are stated in the plan separately and distinctly from other benefits;\n(7) the private plan will provide benefits and leave for any serious health condition or medical care related to pregnancy for which benefits are payable, and leave provided, under this chapter;\n(8) the private plan will impose no additional condition or restriction on the use of medical benefits beyond those explicitly authorized by this chapter or regulations promulgated pursuant to this chapter;\n(9) the private plan will allow any employee covered under the private plan who is eligible to receive medical benefits under this chapter to receive medical benefits under the employer plan;\n(10) coverage will continue under the private plan while an employee remains employed by the employer. For former employees, coverage for the purposes of benefits applies until the individual is hired by a new employer or 26 weeks pass, whichever occurs first; and\n(11) if an application for leave is filed by a former employee to a private plan, the plan pays benefits for the totality of the leave. Private plans may not cut off eligibility for a former employee during the course of an approved leave.\n[See Note.]\nThe commissioner, in consultation with the commissioner of commerce, must approve an application for private provision of the family benefit program if the commissioner determines:\n(1) all of the employees of the employer are to be covered under the provisions of the employer plan;\n(2) eligibility requirements for benefits and leave are no more restrictive than as provided under this chapter;\n(3) the weekly benefits payable under the private plan for any week are at least equal to the weekly benefit amount payable under this chapter;\n(4) the total number of weeks for which benefits are payable under the private plan is at least equal to the total number of weeks for which benefits would have been payable under this chapter;\n(5) no greater amount is required to be paid by employees toward the cost of benefits under the employer plan than by this chapter;\n(6) wage replacement benefits are stated in the plan separately and distinctly from other benefits;\n(7) the private plan will provide benefits and leave for any care for a family member with a serious health condition, bonding with a child, qualifying exigency, or safety leave event for which benefits are payable, and leave provided, under this chapter;\n(8) the private plan will impose no additional condition or restriction on the use of family benefits beyond those explicitly authorized by this chapter or regulations promulgated pursuant to this chapter;\n(9) the private plan will allow any employee covered under the private plan who is eligible to receive family benefits under this chapter to receive family benefits under the employer plan;\n(10) coverage will continue under the private plan while an employee remains employed by the employer. For former employees, coverage for the purposes of benefits applies until the individual is hired by a new employer or 26 weeks pass, whichever occurs first; and\n(11) if an application for leave is filed by a former employee to a private plan, the private plan is required to pay benefits for the totality of the leave. Private plans must not discontinue eligibility for a former employee during the course of an approved leave.\n[See Note.]\nIf the private plan is in the form of self-insurance, the employer shall file with its application for private provision of the medical benefit or family benefit program a surety bond in an amount equal to the employer's annual premium that it would otherwise be required to pay to the family and medical benefit insurance account. The surety bond must be in a form approved by the commissioner and issued by a surety company authorized to transact business in Minnesota.\nPrivate plan benefits may be paid to align with the employer's payroll cycle or according to the terms of the approved private plan.\n(a) For purposes of determining the family and medical benefit amount and duration under a private plan, the weekly benefit amount and duration shall be based on the employee's typical work week and wages earned with the employer at the time of an application for benefits. If an employer does not have complete base period wage detail information, the employer may accept an employee's certification of wage credits, based on the employee's records.\n(b) In the event that an employee's request for benefits is denied, in whole or in part, or the amount of the benefits is contested, the employee has the right to request administrative review of a decision by the private plan within 30 calendar days. If the private plan maintains the denial, the employee may appeal to the department as permitted in section 268B.08.\n[See Note.]\nNothing in this section prohibits an employer from meeting the requirements of a private plan through a private insurance product. If the employer plan involves a private insurance product, that insurance product must be approved by the commissioner of commerce and be issued by an insurance company authorized to transact insurance in this state.\nAn employer with an approved private plan is not required to pay premiums established under section 268B.14. An employer with an approved private plan is responsible for a private plan approval and oversight fee equal to $250 for employers with fewer than 50 employees, $500 for employers with 50 to 499 employees, and $1,000 for employers with 500 or more employees. The employer must pay this fee (1) upon initial application for private plan approval, and (2) any time the employer applies to amend the private plan. The commissioner must review and report on the adequacy of this fee to cover private plan administrative costs annually beginning January 1, 2027, as part of the annual report established in section 268B.25.\nA private plan under this section must be in effect for a period of at least one year and, thereafter, continuously unless the commissioner finds that the employer has given notice of withdrawal from the plan in a manner specified by the commissioner in this section or rule. The plan may be withdrawn by the employer within 30 days of the effective date of any law increasing the benefit amounts or within 30 days of the date of any change in the rate of premiums. If the plan is not withdrawn, it must be administered to provide the increased benefit amount or change in the rate of the employee's premium on the date of the increase or change.\nIf an employee is using approved leave under this chapter when their employer changes from the state plan to a private plan, from a private plan to the state plan, or from one private plan to another private plan, the plan under which the employee was covered when their benefits were approved is required to continue paying benefits for continuous, intermittent, and reduced schedule leave through the duration previously approved. If the employee requests an extension of their original leave, or recertification is required, the employee may reapply for benefits with their new plan.\n[See Note.]\nIf an employer meeting the requirements of a private plan through an insurance product under subdivision 6 has made advance payments of benefits due under this chapter or has made payments to an employee in like manner as wages during any period of family or medical leave for which the employee is entitled to the benefits provided by this chapter, the employer is entitled to be reimbursed by the carrier or third party administrator out of any benefits due or to become due for the family or medical leave, if the claim for reimbursement is filed with the carrier prior to payment of the benefits by the carrier.\n[Never effective, 2024 c 127 art 73 s 51]\n[See Note.]\n(a) An employee is no longer covered by an approved private plan if the commissioner revokes the approval of the private plan.\n(b) An employee no longer covered by an approved private plan is, if otherwise eligible, immediately entitled to benefits under this chapter to the same extent as though there had been no approval of the private plan.\n[See Note.]\nCovered individuals that have been separated from an employer with a private plan for less than 26 weeks shall file applications for benefits as follows:\n(1) if the former employee remains unemployed on the date that an application for benefits is filed, the former employee shall submit an application for benefits with the private plan of their former employer; and\n(2) if the former employee has become employed by a different employer at the time that an application for benefits is filed, the former employee shall submit an application for benefits based on the new employer's coverage. If the new employer is covered under the state plan, the former employee shall submit the application to the state. If the new employer has an approved private plan, the covered individual shall submit the application for benefits to the private plan in accordance with the requirements established by their employer.\n[See Note.]\nAn employer with a private plan must provide a notice prepared by or approved by the commissioner regarding the private plan consistent with section 268B.26.\n(a) The commissioner must approve any amendment, other than those required by this chapter, to a private plan adjusting the provisions thereof, if the commissioner determines:\n(1) that the plan, as amended, will conform to the standards set forth in this chapter; and\n(2) that notice of the amendment has been delivered to all affected employees at least ten days before the submission of the amendment.\n(b) Any amendments approved under this subdivision are effective on the date of the commissioner's approval, unless the commissioner and the employer agree on a later date.\nA private plan in effect at the time a successor acquires the employer organization, trade, or business, or substantially all the assets thereof, or a distinct and severable portion of the organization, trade, or business, and continues its operation without substantial reduction of personnel resulting from the acquisition, must continue the approved private plan and must not withdraw the plan without a specific request for withdrawal in a manner and at a time specified by the commissioner. A successor may terminate a private plan with notice to the commissioner and within 90 days from the date of the acquisition.\n(a) The commissioner may terminate any private plan if the commissioner determines the employer or agents of the employer:\n(1) failed to pay benefits;\n(2) failed to pay benefits in a timely manner, consistent with the requirements of this chapter;\n(3) failed to submit reports as required by this chapter or rule adopted under this chapter; or\n(4) otherwise failed to comply with this chapter or rule adopted under this chapter.\n(b) The commissioner must give notice of the intention to terminate a plan to the employer at least ten days before taking any final action. The notice must state the effective date and the reason for the termination.\n(c) The payment of benefits must not be delayed during an employer's appeal of the revocation of approval of a private plan.\n(d) If the commissioner revokes approval of an employer's private plan, that employer is ineligible to apply for approval of another private plan for a period of three years, beginning on the date of revocation.\n[See Note.]\n(a) The commissioner may assess the following monetary penalties against an employer with an approved private plan found to have violated this chapter:\n(1) $1,000 for the first violation; and\n(2) $2,000 for the second, and each successive violation.\n(b) The commissioner must waive collection of any penalty if the employer corrects the violation within 30 days of receiving a notice of the violation and the notice is for a first violation.\n(c) The commissioner may waive collection of any penalty if the commissioner determines the violation to be an inadvertent error by the employer.\n(d) Monetary penalties collected under this section shall be deposited in the family and medical benefit insurance account.\n[See Note.]\nEmployers with an approved private plan must maintain all reports, information, and records as relating to the private plan and claims for a period of six years from creation and provide to the commissioner upon request.\nThe commissioner may investigate and audit plans approved under this section both before and after the plans are approved.\n(a) An employer may terminate its approved private plan by notifying the commissioner in writing at least 30 days before the voluntary termination's effective date.\n(b) The employer must notify employees of the voluntary termination no later than 30 days before the termination's effective date.\n(c) An employer must continue the approved private plan's coverage through the termination's effective date. If an employer does not continue the approved private plan's coverage through the termination's effective date, the commissioner shall assess against the employer a fine per employee per day the employee was not covered through the termination's effective date. The fine per employee per day will equal the employer's and employee's total premium amount for a year, divided by 365.\n(a) Within seven days of the effective date of a voluntary or involuntary termination of private plan approval, the employer must notify all employees of the termination and notify all employees that they are under the state plan as a result of the termination.\n(b) If an employer's workforce becomes covered by the state plan because the employer's private plan approval was voluntarily or involuntarily terminated, the employer must remain covered by the state plan and pay premiums to the state for a period of at least three years.\nEmployers covered under a private plan are subject to the quarterly wage reporting requirements under section 268B.12.\n[See Note.]",
	"repealed": false
}