{
	"id": "80A.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.58",
	"title": "80A.58 SECTION 403; INVESTMENT ADVISER REGISTRATION REQUIREMENT AND EXEMPTIONS.",
	"text": "(a) Registration requirement. It is unlawful for a person to transact business in this state as an investment adviser or investment adviser representative unless the person is registered under this chapter or is exempt from registration under subsection (b).\n(b) Exemptions from registration. The following persons are exempt from the registration requirement of subsection (a):\n(1) any person whose only clients in this state are:\n(A) federal covered investment advisers, investment advisers registered under this chapter, or broker-dealers registered under this chapter;\n(B) bona fide preexisting clients whose principal places of residence are not in this state if the investment adviser is registered under the securities act of the state in which the clients maintain principal places of residence; or\n(C) any other client exempted by rule adopted or order issued under this chapter;\n(2) a person without a place of business in this state if the person has had, during the preceding 12 months, not more than five clients that are resident in this state in addition to those specified under paragraph (1);\n(3) A private fund advisor, subject to the additional requirements of subsection (c), if the private fund adviser satisfies each of the following conditions:\n(i) neither the private fund adviser nor any of its advisory affiliates are subject to a disqualification as described in Rule 262 of SEC Regulation A, Code of Federal Regulations, title 17, section 230.262;\n(ii) the private fund adviser files with the state each report and amendment thereto that an exempt reporting adviser is required to file with the Securities and Exchange Commission pursuant to SEC Rule 204-4, Code of Federal Regulations, title 17, section 275.204-4; or\n(4) any other person exempted by rule adopted or order issued under this chapter.\n(c) Additional requirements for private fund advisers to certain 3(c)(1) funds. In order to qualify for the exemption described in subsection (b)(3), a private fund adviser who advises at least one 3(c)(1) fund that is not a venture capital fund shall, in addition to satisfying each of the conditions specified in subsection (b)(3), comply with the following requirements:\n(1) The private fund adviser shall advise only those 3(c)(1) funds, other than venture capital funds, whose outstanding securities, other than short-term paper, are beneficially owned entirely by persons who, after deducting the value of the primary residence from the person's net worth, would each meet the definition of a qualified client in SEC Rule 205-3, Code of Federal Regulations, title 17, section 275.205-3, at the time the securities are purchased from the issuer;\n(2) At the time of purchase, the private fund adviser shall disclose the following in writing to each beneficial owner of a 3(c)(1) fund that is not a venture capital fund:\n(i) all services, if any, to be provided to individual beneficial owners;\n(ii) all duties, if any, the investment adviser owes to the beneficial owners; and\n(iii) any other material information affecting the rights or responsibilities of the beneficial owners; and\n(3) The private fund adviser shall obtain on an annual basis audited financial statements of each 3(c)(1) fund that is not a venture capital fund and shall deliver a copy of such audited financial statements to each beneficial owner of the fund.\n(d) Federal covered investment advisers. If a private fund adviser is registered with the Securities and Exchange Commission, the adviser shall not be eligible for the private fund adviser exemption under paragraph (b), clause (3), and shall comply with the state notice filing requirements applicable to federal covered investment advisers in section 80A.58.\n(e) Investment adviser representatives. A person is exempt from the registration requirements of section 80A.58, paragraph (a), if he or she is employed by or associated with an investment adviser that is exempt from registration in this state pursuant to the private fund adviser exemption under paragraph (b), clause (3), and does not otherwise engage in activities that would require registration as an investment adviser representative.\n(f) Electronic filings. The report filings described in subsection (b)(3)(ii) shall be made electronically through the IARD. A report shall be deemed filed when the report and the fee required by sections 80A.60 and 80A.65 are filed and accepted by the IARD on the state's behalf.\n(g) Transition. An investment adviser who becomes ineligible for the exemption provided by this section must comply with all applicable laws and rules requiring registration or notice filing within 90 days from the date of the investment adviser's eligibility for this exemption ceases.\n(h) Grandfathering for investment advisers to 3(c)(1) funds with nonqualified clients. An investment adviser to a 3(c)(1) fund (other than a venture capital fund) that has one or more beneficial owners who are not qualified clients as described in paragraph (c), clause (1), is eligible for the exemption contained in paragraph (b), clause (3), if the following conditions are satisfied:\n(1) the subject fund existed prior to August 1, 2013;\n(2) as of August 1, 2013, the subject fund ceases to accept beneficial owners who are not qualified clients, as described in paragraph (c), clause (1);\n(3) the investment adviser discloses in writing the information described in paragraph (c), clause (2), to all beneficial owners of the fund; and\n(4) as of August 1, 2013, the investment adviser delivers audited financial statements as required by paragraph (c), clause (3).\n(i) Limits on employment or association. It is unlawful for an investment adviser, directly or indirectly, to employ or associate with an individual to engage in an activity related to investment advice in this state if the registration of the individual is suspended or revoked or the individual is barred from employment or association with an investment adviser, federal covered investment adviser, or broker-dealer by an order under this chapter, the Securities and Exchange Commission, or a self-regulatory organization, unless the investment adviser did not know, and in the exercise of reasonable care could not have known, of the suspension, revocation, or bar. Upon request from the investment adviser and for good cause, the administrator, by order, may waive, in whole or in part, the application of the prohibitions of this subsection to the investment adviser.",
	"repealed": false
}