{
	"id": "401.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.11",
	"title": "401.11 COMPREHENSIVE PLAN ITEMS; SUBSIDY REVIEW.",
	"text": "(a) A comprehensive plan submitted to the commissioner for approval under section 401.06 must include items prescribed by commissioner policy and may include the following:\n(1) the manner in which presentence and postsentence investigations and reports for the district courts and social history reports for the juvenile courts will be made;\n(2) the manner in which conditional release services to the courts and persons under jurisdiction of the commissioner will be provided;\n(3) a program for detaining, supervising, and treating persons under pretrial detention or under commitment;\n(4) delivery of other correctional services;\n(5) proposals for new programs, which proposals must demonstrate a need for the program, and the program's purpose, objective, administrative structure, staffing pattern, staff training, financing, evaluation process, degree of community involvement, client participation, and duration;\n(6) descriptions of programs that adhere to best practices for assessing risk and using interventions that address an individual's needs while tailoring supervision and interventions by using risk, need, and responsivity principles; and\n(7) data on expenditures, costs, and programming results and outcomes for individuals under community supervision.\n(b) The commissioner must develop in policy budgetary requirements for comprehensive plans to ensure the efficient and accountable expenditure of a county's or Tribal Nation's subsidy for correctional services and programming to produce successful community supervision outcomes.\nEach CCA jurisdiction must develop and implement a procedure for reviewing grant applications or applications for contracted services made to the corrections advisory board and for the manner in which corrections advisory board action will be taken on the applications. A description of the procedure must be made available to members of the public upon request.",
	"repealed": false
}