{
	"id": "16A.647",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.647",
	"title": "16A.647 TAX CREDIT AND INTEREST SUBSIDY BONDS.",
	"text": "When authorized by law to issue state general obligation bonds or state 911 revenue bonds under section 403.275, the commissioner may issue all or part of the bonds as tax credit bonds or as interest subsidy bonds or a combination of the two.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Tax credit bonds\" means bonds, the interest on which is includable in the income of the owner of the bonds for federal income tax purposes, but for which the owner is entitled to a federal tax credit.\n(c) \"Interest subsidy bonds\" means bonds, the interest on which is includable in the income of the owner of the bonds for federal income tax purposes, but for which the issuer is entitled to federal interest subsidy payments based on a percentage of the interest payable on the interest subsidy bonds.\nNotwithstanding the provisions of section 16A.641, subdivision 4, the commissioner may sell any series of tax credit bonds or interest subsidy bonds at negotiated sale upon the terms and conditions and the restrictions the commissioner prescribes, but the commissioner may contract for investment banking and banking services only after receiving competitive proposals for the services. The commissioner may enter into all contracts deemed necessary or desirable to accomplish the sale in a cost-effective manner.\nThe commissioner's order authorizing the issuance of interest subsidy bonds must establish a separate sinking fund account for the interest subsidy bonds in the state bond fund. There is annually appropriated, as received, to each interest subsidy bond account, in addition to amounts appropriated under section 16A.641, the interest subsidy payments received from the federal government with respect to the issue of interest subsidy bonds in that year.\nTax credit bonds and interest subsidy bonds must be sold at a price not less than 98 percent of their stated principal amount. No state trunk highway bond may be sold for a price of less than par and accrued interest. When the commissioner determines to issue tax credit bonds or interest subsidy bonds to achieve a net present value debt service savings over tax-exempt bonds, the commissioner may issue an additional principal amount of bonds, not to exceed two percent of the principal amount of bonds otherwise authorized by law to be issued, to pay the costs of investment banking and banking services related to the sale or placement of the bonds, provided the additional issuance will not cause an increase in the general fund debt service transfer for the biennium during which the bonds are sold, as estimated by the commissioner. The proceeds are appropriated for this purpose.",
	"repealed": false
}