{
	"id": "144G.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.55",
	"title": "144G.55 COORDINATED MOVES.",
	"text": "(a) If a facility terminates an assisted living contract, reduces services to the extent that a resident needs to move or obtain a new service provider or the facility has its license restricted under section 144G.20, or the facility conducts a planned closure under section 144G.57, the facility:\n(1) must ensure, subject to paragraph (c), a coordinated move to a safe location that is appropriate for the resident and that is identified by the facility prior to any hearing under section 144G.54;\n(2) must ensure a coordinated move of the resident to an appropriate service provider identified by the facility prior to any hearing under section 144G.54, provided services are still needed and desired by the resident; and\n(3) must consult and cooperate with the resident, legal representative, designated representative, case manager for a resident who receives home and community-based waiver services under chapter 256S and section 256B.49, relevant health professionals, and any other persons of the resident's choosing to make arrangements to move the resident, including consideration of the resident's goals.\n(b) A facility may satisfy the requirements of paragraph (a), clauses (1) and (2), by moving the resident to a different location within the same facility, if appropriate for the resident.\n(c) A resident may decline to move to the location the facility identifies or to accept services from a service provider the facility identifies, and may choose instead to move to a location of the resident's choosing or receive services from a service provider of the resident's choosing within the timeline prescribed in the termination notice.\n(d) Sixty days before the facility plans to reduce or eliminate one or more services for a particular resident, the facility must provide written notice of the reduction that includes:\n(1) a detailed explanation of the reasons for the reduction and the date of the reduction;\n(2) the contact information for the Office of Ombudsman for Long-Term Care, the Office of Ombudsman for Mental Health and Developmental Disabilities, and the name and contact information of the person employed by the facility with whom the resident may discuss the reduction of services;\n(3) a statement that if the services being reduced are still needed by the resident, the resident may remain in the facility and seek services from another provider; and\n(4) a statement that if the reduction makes the resident need to move, the facility must participate in a coordinated move of the resident to another provider or caregiver, as required under this section.\n(e) In the event of an unanticipated reduction in services caused by extraordinary circumstances, the facility must provide the notice required under paragraph (d) as soon as possible.\n(f) If the facility, a resident, a legal representative, or a designated representative determines that a reduction in services will make a resident need to move to a new location, the facility must ensure a coordinated move in accordance with this section, and must provide notice to the Office of Ombudsman for Long-Term Care.\n(g) Nothing in this section affects a resident's right to remain in the facility and seek services from another provider.\nA safe location is not a private home where the occupant is unwilling or unable to care for the resident, a homeless shelter, a hotel, or a motel. A facility may not terminate a resident's housing or services if the resident will, as the result of the termination, become homeless, as that term is defined in section 116L.361, subdivision 5, or if an adequate and safe discharge location or adequate and needed service provider has not been identified. This subdivision does not preclude a resident from declining to move to the location the facility identifies.\nThe facility must prepare a relocation plan to prepare for the move to a new safe location or appropriate service provider, as required by this section.\nUnless otherwise ordered by the commissioner, if a facility's license is restricted by the commissioner under section 144G.20 such that a resident must move or obtain a new service provider, the facility must comply with this section.\nThe rights established under this section for the benefit of residents do not limit any other rights available under other law. No facility may request or require that any resident waive the resident's rights at any time for any reason, including as a condition of admission to the facility.",
	"repealed": false
}