{
	"id": "18.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.79",
	"title": "18.79 DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall administer and enforce sections 18.76 to 18.91.\nCounty agricultural inspectors may administer and enforce sections 18.76 to 18.91. A county-designated employee may enforce sections 18.78, 18.82, 18.83, 18.84, 18.86, and 18.87. A county must make the identity of a county-designated employee described by this subdivision available to the public.\nTo administer and enforce sections 18.76 to 18.91, an inspector or county-designated employee may enter upon land without consent of the owner and without being subject to an action for trespass or any damages.\nThe commissioner may adopt necessary rules under chapter 14 for the proper enforcement of sections 18.76 to 18.91.\nAn inspector or county-designated employee may order the control or eradication of noxious weeds on any land within the inspector's or county-designated employee's jurisdiction. A county must make the identity of a county-designated employee described by this subdivision available to the public.\nThe commissioner shall conduct initial training considered necessary for inspectors and county-designated employees in the enforcement of the Minnesota Noxious Weed Law. The dean of University of Minnesota Extension may conduct educational programs for the general public that will aid compliance with the Minnesota Noxious Weed Law. Upon request, the commissioner may provide information and other technical assistance to the county agricultural inspector or county-designated employee to aid in the performance of responsibilities specified by the county board under section 18.81, subdivisions 1a and 1b.\nThe commissioner shall designate by rule reports required to be made and meetings that must be attended by inspectors.\nThe commissioner shall prescribe the forms to be used by inspectors and county-designated employees in the enforcement of sections 18.76 to 18.91.\nIf the county agricultural inspector or county-designated employee applies to a court for a temporary or permanent injunction restraining a person from violating or continuing to violate sections 18.76 to 18.91, the injunction may be issued without requiring a bond.\nOn finding that a person has violated sections 18.76 to 18.91, the inspector or county-designated employee may start court proceedings in the locality in which the violation occurred. The county attorney may prosecute actions under sections 18.76 to 18.91 within the county attorney's jurisdiction.\n[Repealed, 2004 c 228 art 1 s 76]\nThe official certification agency for noxious-weed-free forage, mulch, soil, gravel, and other material must be determined by the commissioner in consultation with the director of the Minnesota agricultural experiment station. The commissioner may also certify forage, mulch, soil, gravel, or other material as noxious weed free.\nThe commissioner, in consultation with the Noxious Weed Advisory Committee, shall determine which plants are noxious weeds subject to regulation under sections 18.76 to 18.91. The commissioner shall prepare, publish, and revise as necessary, but at least once every three years, a list of noxious weeds and their designated classification. The list must be distributed to the public by the commissioner who may request the help of University of Minnesota Extension, the county agricultural inspectors, and any other organization the commissioner considers appropriate to assist in the distribution. The commissioner may, in consultation with the Noxious Weed Advisory Committee, accept and consider noxious weed designation petitions from Minnesota citizens or Minnesota organizations or associations.\nA county may petition the commissioner to designate specific noxious weeds which are a control problem in the county.\nThe commissioner, in consultation with the Noxious Weed Advisory Committee, shall develop management strategies and criteria for each noxious weed category listed in section 18.771 and each individually listed species.\nThe commissioner, counties, and municipalities may apply for and accept any gift, grant, contract, or other funds or grants-in-aid from the federal government or other public and private sources for noxious weed control purposes.\nThe commissioner shall investigate the subject of noxious weeds and conduct investigations outside this state to protect the interest of the agricultural industry, forests, or the environment of this state from noxious weeds not generally growing in Minnesota.\n(a) The commissioner shall disseminate information and conduct educational campaigns with respect to control of noxious weeds or invasive plants to enhance regulatory compliance and voluntary efforts to eliminate or manage these plants. The commissioner shall call and attend meetings and conferences dealing with the subject of noxious weeds. The commissioner shall maintain on the department's website noxious weed management information including but not limited to the roles and responsibilities of citizens and government entities under sections 18.76 to 18.91 and specific guidance as to whom a person should contact to report a noxious weed issue.\n(b) The commissioner shall post notice on the department's website when a weed on the eradicate list is confirmed for the first time in a county. The commissioner may notify appropriate media outlets when a weed on the eradicate list is confirmed for the first time in a county.\nThe commissioner shall inform and direct state and federal agencies regarding their responsibility to manage and control noxious weeds on land that those agencies own, control, or manage.\nThe commissioner shall cooperate with agencies of federal, state, and local governments and other persons in carrying out duties under sections 18.76 to 18.91.\nThe commissioner, in consultation with the Noxious Weed Advisory Committee, may establish a noxious weed management site to include a part of one or more counties or all of one or more counties of this state and shall include all the land within the boundaries of the area established. Noxious weed management plans developed for a noxious weed management site must be reviewed and approved by the commissioner in consultation with the Noxious Weed Advisory Committee. Noxious weed management sites may seek funding under section 18.90.",
	"repealed": false
}