{
	"id": "123A.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.73",
	"title": "123A.73 LEVY LIMITATIONS OF REORGANIZED DISTRICTS.",
	"text": "The terms defined in chapters 120B, 122A, 123A, 123B, 124D, 125A, 126C, and 127A, have the same meanings when they are used in this section, unless otherwise clearly indicated.\nAs of the effective date of the voluntary or involuntary dissolution of a district and its attachment to one or more existing districts pursuant to sections 123A.60 or 123A.64 to 123A.72, the authorization for any referendum revenue previously approved by the voters of the dissolved district in that district pursuant to section 126C.17, subdivision 9, or its predecessor or successor provision, is canceled. The authorization for any referendum revenue previously approved by the voters of a district to which all or part of the dissolved district is attached shall not be affected by the attachment and shall apply to the entire area of the district as enlarged by the attachment.\n[Repealed, 1Sp2017 c 5 art 5 s 15]\n(a) As of the effective date of a consolidation pursuant to section 123A.48, if the plan for consolidation so provides, or if the plan for consolidation makes no provision concerning referendum revenues, the authorization for all referendum revenues previously approved by the voters of all affected districts for those districts pursuant to section 126C.17, subdivision 9, or its predecessor provision shall be recalculated as provided in this subdivision. The referendum revenue authorization for the newly created district shall be the revenue per adjusted pupil unit that would raise an amount equal to the combined dollar amount of the referendum revenues authorized by each of the component districts for the year preceding the consolidation, unless the referendum revenue authorization of the newly created district is subsequently modified pursuant to section 126C.17, subdivision 9.\n(b) The referendum allowance for a consolidated district in the years following consolidation equals the average of the consolidating districts' existing authorities for those years, weighted by the districts' adjusted pupil units in the year preceding consolidation. For purposes of this calculation, the referendum authorities used for individual districts shall not decrease from year to year until such time as all existing authorities for all the consolidating districts have fully expired, but shall increase if they were originally approved with consumer price index-based or other annual increases.\n(c) The referendum revenue authorization for the newly created district shall continue for a period of time equal to the longest period authorized for any component district.\n(a) As of the effective date of a consolidation pursuant to section 123A.48, if the plan for consolidation so provides, the authorization for all referendum revenues previously approved by the voters of all affected districts for those districts pursuant to section 126C.17, subdivision 9, or its predecessor provision shall be combined as provided in this subdivision. The referendum revenue authorization for the newly created district may be any allowance per adjusted pupil unit provided in the plan for consolidation, but may not exceed the allowance per adjusted pupil unit that would raise an amount equal to the combined dollar amount of the referendum revenues authorized by each of the component districts for the year preceding the consolidation.\n(b) The referendum allowance for a consolidated district in the years following consolidation equals the average of the consolidating districts' existing authorities for those years, weighted by the districts' adjusted pupil units in the year preceding consolidation. For purposes of this calculation, the referendum authorities used for individual districts shall not decrease from year to year until such time as all existing authorities for all the consolidating districts have fully expired, but shall increase if they were originally approved with consumer price index-based or other annual increases.\n(c) The referendum revenue authorization for the newly created district shall continue for a period of time equal to the longest period authorized for any component district. The referendum revenue authorization for the newly created district may be modified pursuant to section 126C.17, subdivision 9.\nIf the plan for consolidation provides for discontinuance of referendum revenue previously approved by voters of the component districts pursuant to section 126C.17, subdivision 9, or its predecessor provision, the newly created district must not receive referendum revenue unless the voters of the newly created district authorize referendum revenue pursuant to section 126C.17, subdivision 9.\n[Repealed, 1Sp2003 c 9 art 1 s 54]\nAs of the effective date of a consolidation of districts or the dissolution of a district and its attachment to one or more existing districts pursuant to chapter 123A, all the taxable property which is in the newly created or enlarged district and which was previously taxable for the payment of any statutory operating debt theretofore incurred by any preexisting district of which the taxable property was a part prior to the consolidation or dissolution and attachment shall remain taxable for the payment of that debt and shall not become taxable for the payment of any statutory operating debt theretofore incurred by any preexisting district of which the taxable property was not a part prior to the consolidation or dissolution and attachment. The amount of statutory operating debt attributable to that taxable property and to the newly created or enlarged district in which it is located, and the amount of a preexisting district's reserved fund balance reserve account for purposes of statutory operating debt reduction attributable to the newly created or enlarged district, shall be apportioned according to the proportion which the adjusted net tax capacity of that part of the preexisting district bears to the total adjusted net tax capacity of the entire preexisting district at the time of the consolidation or dissolution and attachment. This apportionment shall be made by the county auditor and shall be incorporated as an annex to the order of the commissioner dividing the assets and liabilities of the component districts. As used in this section, \"statutory operating debt\" shall have the meaning given it in section 123B.81.\n(a) A district that receives revenue under section 123A.39, subdivision 3, for cooperation or has combined according to sections 123A.35 to 123A.43 may levy to eliminate reorganization operating debt as defined in section 123B.82, clause (1). The amount of the debt must be certified over a period of five years. After the effective date of combination according to sections 123A.35 to 123A.43, the levy may be certified and spread either\n(1) only on the property in the combined district that would have been taxable in the preexisting district that incurred the debt, or\n(2) on all of the taxable property in the combined district.\n(b) A district that has reorganized according to section 123A.46 or 123A.48 may levy to eliminate reorganization operating debt as defined in section 123B.82, clause (2). The amount of debt must be certified over a period not to exceed five years and may be spread either\n(1) only on the property in the newly created or enlarged district which was taxable in the preexisting district that incurred the debt, or\n(2) on all of the taxable property in the newly created or enlarged district.\n[Repealed, 1Sp2003 c 9 art 1 s 54]\n[Repealed, 1Sp2003 c 9 art 1 s 54]\nThe board of a newly created or enlarged district to which part or all of a dissolved district was attached according to section 123A.46 may levy for severance pay or early retirement incentives for licensed and nonlicensed employees who resign or retire early as a result of the dissolution or consolidation, if the commissioner approves the incentives and the amount to be levied. The amount may be levied over a period of up to five years and must be spread in whole or in part on the property of a preexisting district or the newly created or enlarged district, as determined by the board of the newly created or enlarged district.",
	"repealed": false
}