{
	"id": "144E.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.45",
	"title": "144E.45 CREDITING QUALIFIED AMBULANCE PERSONNEL SERVICE.",
	"text": "The director or the director's designee under section 144E.40, subdivision 2, shall maintain a separate record of potential award accumulations for each qualified ambulance service person under subdivision 2.\n(a) On November 1, annually, the director or the director's designee under section 144E.40, subdivision 2, shall determine the amount of the allocation of the prior year's accumulation to each qualified ambulance service person. The prior year's net investment gain or loss under paragraph (b) must be allocated and that year's general fund appropriation, plus any transfer from the Cooper/Sams volunteer ambulance account under section 144E.42, subdivision 2, and after deduction of administrative expenses, also must be allocated.\n(b) The difference in the market value of the assets of the Cooper/Sams volunteer ambulance trust account as of the immediately previous June 30 and the June 30 occurring 12 months earlier must be reported on or before August 15 by the State Board of Investment. The market value gain or loss must be expressed as a percentage of the total potential award accumulations as of the immediately previous June 30, and that positive or negative percentage must be applied to increase or decrease the recorded potential award accumulation of each qualified ambulance service person.\n(c) The appropriation for this purpose, after deduction of administrative expenses, must be divided by the total number of additional ambulance service personnel years of service recognized since the last allocation or 1,000 years of service, whichever is greater. If the allocation is based on the 1,000 years of service, any allocation not made for a qualified ambulance service person must be credited to the Cooper/Sams volunteer ambulance account under section 144E.42, subdivision 2. A qualified ambulance service person must be credited with a year of service if the person is certified by the chief administrative officer of the ambulance service as having rendered active ambulance service during the 12 months ending as of the immediately previous June 30. If the person has rendered prior active ambulance service, the person must be additionally credited with one-fifth of a year of service for each year of active ambulance service rendered before June 30, 1993, but not to exceed in any year one additional year of service or to exceed in total five years of prior service. Prior active ambulance service means employment by or the provision of service to a licensed ambulance service before June 30, 1993, as determined by the person's current ambulance service based on records provided by the person that were contemporaneous to the service. The prior ambulance service must be reported on or before August 1 to the director in an affidavit from the chief administrative officer of the ambulance service.\n(d) Effective July 1, 2008, notwithstanding paragraphs (a) to (c), the value of each service credit shall be $447.19.",
	"repealed": false
}