{
	"id": "326A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.04",
	"title": "326A.04 CERTIFICATE ISSUANCE AND RENEWAL; COMPETENCY STANDARD.",
	"text": "The board shall grant or renew certificates to a person of good moral character who makes an application and demonstrates that the person's qualifications, including where applicable the qualifications prescribed by section 326A.03, are in accordance with this section and rules adopted by the board.\nThe holder of a certificate issued under this section may only provide attest services in a CPA firm that holds a permit issued under section 326A.05.\nThe board shall establish a temporary military certificate in accordance with section 197.4552.\n(a) Certificates must be initially issued and renewed annually but in any event must expire on December 31 in the year prescribed by the board by rule. Applications for certificates must be made in the form, and in the case of applications for renewal between the dates, specified by the board in rule. The board shall grant or deny an application no later than 90 days after the application is filed in proper form. If the applicant seeks the opportunity to show that issuance or renewal of a certificate was mistakenly denied, or if the board is unable to determine whether it should be granted or denied, the board may issue to the applicant a provisional certificate that expires 90 days after its issuance, or when the board determines whether or not to issue or renew the certificate for which application was made, whichever occurs first.\n(b) Certificate holders who do not provide professional services and do not use the certified public accountant designation in any manner are not required to renew their certificates provided they have notified the board as provided in board rule and comply with the requirements for nonrenewal as specified in board rule.\n(c) Applications for renewal of a certificate that are complete and timely filed with the board and are not granted or denied by the board before January 1 are renewed on a provisional basis as of January 1 and for 90 days thereafter, or until the board grants or denies the renewal of the certificate, whichever occurs first, provided the licensee meets the requirements in this chapter and rules adopted by the board.\n(a) With regard to an applicant who must obtain a certificate in this state because the applicant does not qualify under the substantial equivalency standard in section 326A.14, subdivision 1, the board shall issue a certificate to a holder of a certificate, license, or permit issued by another state upon a showing that:\n(1) the applicant passed the examination required for issuance of a certificate in this state;\n(2) the applicant had four years of experience of the type described in section 326A.03, subdivision 6, paragraph (b); or the applicant meets equivalent requirements prescribed by the board by rule, after passing the examination upon which the applicant's certificate was based and within the ten years immediately preceding the application;\n(3) if the applicant's certificate, license, or permit was issued more than four years prior to the application for issuance of an initial certificate under this subdivision, that the applicant has fulfilled the requirements of continuing professional education that would have been applicable under subdivision 4; and\n(4) the applicant has met the qualifications prescribed by the board by rule.\n(b) A certificate holder licensed by another state who establishes a principal place of business in this state shall request the issuance of a certificate from the board prior to establishing the principal place of business. The board shall issue a certificate to the person if the person's individual certified public accountant qualifications, upon verification, are substantially equivalent to the certified public accountant licensure requirements of this chapter or the person meets equivalent requirements as the board prescribes by rule. Residents of this state who provide professional services in this state at an office location in this state shall be considered to have their principal place of business in this state.\nEach licensee shall participate in a program of learning designed to maintain professional competency. The program of learning must comply with rules adopted by the board. The board may by rule create an exception to this requirement for licensees who do not perform or offer to perform for the public one or more kinds of services involving the use of auditing skills, including issuance of reports on: attest or compilation engagements, management advisory services, financial advisory services, or consulting services. A licensee granted such an exception by the board must place the word \"inactive\" or \"retired,\" if applicable, adjacent to the CPA title on any business card, letterhead, or any other document or device, with the exception of the licensee's certificate on which the CPA title appears.\n(a) The board shall charge a fee for each application for initial issuance or renewal of a certificate or temporary military certificate under this section as provided in paragraph (b).\n(b) The board shall charge the following fees:\n(1) initial issuance of certificate, $150;\n(2) renewal of certificate with an active status, $100 per year;\n(3) initial CPA firm permits, except for sole practitioners, $100;\n(4) renewal of CPA firm permits, except for sole practitioners and those firms specified in clause (16), $35 per year;\n(5) initial issuance and renewal of CPA firm permits for sole practitioners, except for those firms specified in clause (16), $35 per year;\n(6) annual late processing delinquency fee for permit, certificate, or registration renewal applications not received prior to expiration date, $50;\n(7) copies of records, per page, 25 cents;\n(8) registration of noncertificate holders, nonlicensees, and nonregistrants in connection with renewal of firm permits, $45 per year;\n(9) applications for reinstatement, $20;\n(10) initial registration of a registered accounting practitioner, $50;\n(11) initial registered accounting practitioner firm permits, $100;\n(12) renewal of registered accounting practitioner firm permits, except for sole practitioners, $100 per year;\n(13) renewal of registered accounting practitioner firm permits for sole practitioners, $35 per year;\n(14) CPA examination, fee determined by third-party examination administrator;\n(15) renewal of certificates with an inactive status, $25 per year;\n(16) renewal of CPA firm permits for firms that have one or more offices located in another state, $68 per year; and\n(17) temporary military certificate, $100.\nAn applicant for initial issuance or renewal of a certificate under this section shall list in the application all states in which the applicant has applied for or holds certificates, licenses, or permits, and list any past denial, revocation, or suspension of a certificate, license, or permit. Each holder of or applicant for a certificate under this section shall notify the board in writing, within 30 days after its occurrence, of any issuance, denial, revocation, or suspension of a certificate, license, or permit by another state.\nThe board shall issue a certificate to a holder of a generally equivalent foreign country designation, provided that:\n(1) the foreign authority that granted the designation makes similar provision to allow a person who holds a valid certificate issued by this state to obtain the foreign authority's comparable designation;\n(2) the foreign designation:\n(i) was duly issued by a foreign authority that regulates the practice of public accountancy and the foreign designation has not expired or been revoked or suspended;\n(ii) entitles the holder to issue reports upon financial statements; and\n(iii) was issued upon the basis of educational, examination, and experience requirements established by the foreign authority or by law; and\n(3) the applicant:\n(i) received the designation, based on educational and examination standards generally equivalent to those in effect in this state, at the time the foreign designation was granted;\n(ii) has, within the ten years immediately preceding the application, completed an experience requirement that is generally equivalent to the requirement in section 326A.03, subdivision 6, paragraph (b), in the jurisdiction that granted the foreign designation; completed four years of professional experience in this state; or met equivalent requirements prescribed by the board by rule; and\n(iii) passed a uniform qualifying examination in national standards and an examination on the laws, regulations, and code of ethical conduct in effect in this state as the board prescribes by rule.\nAn applicant under subdivision 7 shall list in the application all jurisdictions, foreign and domestic, in which the applicant has applied for or holds a designation to practice public accountancy. Each holder of a certificate issued under subdivision 7 shall notify the board in writing, within 30 days after its occurrence, of any issuance, denial, revocation, or suspension of a designation or commencement of a disciplinary or enforcement action by any jurisdiction.\nThe board has the sole authority to interpret the application of the provisions of subdivisions 7 and 8.\nThe board shall by rule require as a condition for renewal of a certificate under this section by any certificate holder who performs compilation services for the public other than through a CPA firm, that the individual undergo, no more frequently than once every three years, a peer review conducted in a manner specified by the board in rule. The review shall include verification that the individual has met the competency requirements set out in professional standards for the services described in this subdivision as set forth by rule.\nMS 2020 [Repealed, 2022 c 72 s 2]\nThe board shall adopt rules establishing requirements for a professional ethics examination which must be completed before an initial certificate is issued under this section.",
	"repealed": false
}