{
	"id": "123B.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.61",
	"title": "123B.61 PURCHASE OF CERTAIN EQUIPMENT.",
	"text": "The board of a district may issue general obligation certificates of indebtedness or capital notes subject to the district debt limits to: (a) purchase vehicles, computers, telephone systems, cable equipment, photocopy and office equipment, technological equipment for instruction, and other capital equipment having an expected useful life at least as long as the terms of the certificates or notes; (b) purchase computer hardware and software, without regard to its expected useful life, whether bundled with machinery or equipment or unbundled, together with application development services and training related to the use of the computer; and (c) prepay special assessments. The certificates or notes must be payable in not more than 20 years and must be issued on the terms and in the manner determined by the board. The certificates or notes may be issued by resolution and without the requirement for an election. The certificates or notes are general obligation bonds for purposes of section 126C.55. A tax levy must be made for the payment of the principal and interest on the certificates or notes, in accordance with section 475.61, as in the case of bonds. The sum of the tax levies under this section and section 123B.62 for each year must not exceed the lesser of the amount of the district's total operating capital revenue or the sum of the district's levy in the general and community service funds excluding the adjustments under this section for the year preceding the year the initial debt service levies are certified. The district's general fund levy for each year must be reduced by the sum of (1) the amount of the tax levies for debt service certified for each year for payment of the principal and interest on the certificates or notes issued under this section as required by section 475.61, (2) the amount of the tax levies for debt service certified for each year for payment of the principal and interest on bonds issued under section 123B.62, and (3) any excess amount in the debt redemption fund used to retire bonds, certificates, or notes issued under this section or section 123B.62 after April 1, 1997, other than amounts used to pay capitalized interest. If the district's general fund levy is less than the amount of the reduction, the balance shall be deducted first from the district's community service fund levy, and next from the district's general fund or community service fund levies for the following year. A district using an excess amount in the debt redemption fund to retire the certificates or notes shall report the amount used for this purpose to the commissioner by July 15 of the following fiscal year. A district having an outstanding capital loan under section 126C.69 must not use an excess amount in the debt redemption fund to retire the certificates or notes.",
	"repealed": false
}