{
	"id": "43A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.15",
	"title": "43A.15 NONCOMPETITIVE AND QUALIFYING APPOINTMENTS.",
	"text": "Positions in the classified service may be filled other than by appointment from a finalist pool only as provided in this section or other law, provided that appointments made pursuant to subdivisions 5, 6, 10, 12, and 13 shall be subject to applicable provisions of collective bargaining agreements.\nAn appointing authority may make an emergency appointment for up to 45 working days. No person may be employed in any one agency on an emergency basis for more than 45 working days in any 12-month period.\nThe commissioner may authorize an appointing authority to make a temporary appointment of up to six months. The commissioner may, in the best interest of the state, grant an extension of a temporary appointment or approve a temporary appointment to fill a vacancy created by an approved leave of absence to a maximum period of one year. When practicable, the appointing authority may search the employment database for qualified applicants or, when necessary, the commissioner may authorize the appointment of any person deemed qualified by the appointing authority.\nNo person shall be employed on a temporary basis in any one agency for more than 12 months in any 24-month period.\nThe commissioner may authorize an appointing authority to make a provisional appointment if no applicant is suitable or available for appointment and the person to be provisionally appointed is qualified in all respects except for completion of a licensure or certification requirement.\nNo person shall be employed on a provisional basis for more than six months unless the commissioner grants an extension to a maximum of 12 months in the best interest of the state. No extension may be granted beyond 12 months except where there is a lack of applicants and the provisional appointee is continuing to work to complete the licensure or certification requirement.\nAt the request of an appointing authority, the commissioner may authorize the probationary appointment of a provisional appointee who has performed satisfactorily for at least 60 days and has completed the licensure or certification requirement.\nThe commissioner may authorize an appointing authority to promote the incumbent with permanent or probationary status to a reallocated classified position.\nThe commissioner may authorize the transfer or demotion of an employee in the classified service within an agency or between agencies. Prior to authorizing a transfer or demotion, the commissioner shall determine that the employee to be transferred or demoted is qualified for the new position. An authorized transfer may result in the movement of an employee between agencies in the same class or between or within agencies in different classes provided that the compensation for the classes is similar.\nThe commissioner may enter into arrangements with public personnel agencies in other jurisdictions for the purpose of effecting transfers or voluntary demotions of employees between jurisdictions.\nThe commissioner may authorize the probationary appointment of an incumbent who has passed a qualifying selection process and who has served at least one year in an unclassified position which has been placed in the classified service by proper authority.\n[Repealed, 2004 c 207 s 31]\n[Repealed, 2004 c 207 s 31]\nThe commissioner may authorize the administration of a qualifying selection process if a class is of a routine, service nature involving unskilled tasks, the performance of which cannot be directly related to qualifications beyond a minimum competency level.\n[Repealed, 2004 c 207 s 31]\nThe commissioner may authorize the probationary appointment of persons who successfully complete on-the-job state training programs which have been approved by the commissioner.\nThe commissioner may authorize the administration of a qualifying selection process for the filling of seasonal positions in the Department of Revenue used in the processing of returns and providing information during the tax season. The commissioner of revenue may consider any candidate found qualified through this process for probationary appointment.\n(a) The commissioner shall consult with the Department of Employment and Economic Development's Vocational Rehabilitation Services and State Services for the Blind and other disability experts in establishing, reviewing, and modifying the qualifying procedures for applicants whose disabilities are of such a significant nature that the applicants are unable to demonstrate their abilities in the selection process. The qualifying procedures must consist of up to 700 hours of on-the-job demonstration experience. The 700-hour on-the-job demonstration experience is an alternative, noncompetitive hiring process for qualified applicants with disabilities. All permanent executive branch classified positions are eligible for a 700-hour on-the-job demonstration experience, and all permanent classified job postings must provide information regarding the on-the-job demonstration overview and certification process.\n(b) The commissioner may authorize the probationary appointment of an applicant based on the request of the appointing authority that documents that the applicant has successfully demonstrated qualifications for the position through completion of an on-the-job demonstration experience. A qualified applicant should be converted to permanent, probationary appointments at the point in the 700-hour on-the-job experience when the applicant has demonstrated the ability to perform the essential functions of the job with or without reasonable accommodation. The implementation of this subdivision may not be deemed a violation of chapter 43A or 363A.\n(c) The commissioner and the ADA and disability employment director, described in section 43A.19, subdivision 1, paragraph (e), are responsible for the administration and oversight of the 700-hour on-the-job demonstration experience, including the establishment of policies and procedures, data collection and reporting requirements, and compliance.\n(d) The commissioner or the commissioner's designee shall design and implement a training curriculum for the 700-hour on-the-job demonstration experience. All executive leaders, managers, supervisors, human resources professionals, affirmative action officers, and ADA coordinators must receive annual training on the program.\n(e) The commissioner or the commissioner's designee shall develop, administer, and make public a formal grievance process for individuals in the 700-hour on-the-job demonstration experience under this subdivision and supported work program under section 43A.421, subdivision 2.\n(f) An appointing authority must make reasonable accommodations in response to a request from an applicant with a disability, including providing accommodations in a timely manner during the application and hiring process and throughout the 700-hour on-the-job demonstration experience. Requirements for accessibility for public records under section 363A.42, continuing education under section 363A.43, and technology under section 16E.03, subdivision 2, clauses (3) and (9), apply to an agency filling an appointment during the application and hiring process and through the on-the-job demonstration experience period.\n(a) The commissioner shall annually collect enterprise-wide statistics on the 700-hour on-the-job demonstration experience under subdivision 14. The statistics collected and reported annually must include:\n(1) the number of certifications submitted, granted, and rejected;\n(2) the number of applicants interviewed, appointed, and converted to probationary status;\n(3) the number of employees retained after one year in state employment;\n(4) the number of employees with terminated appointments and the reason for termination;\n(5) the average length of time in an on-the-job demonstration appointment;\n(6) the number and category of entity certifications; and\n(7) by department or agency, the number of appointments and hires and the number of managers and supervisors trained.\n(b) The commissioner shall administer an annual survey of participants in the 700-hour on-the-job demonstration experience who are hired and those who are not hired, as well as the managers of participants in the 700-hour on-the-job demonstration experience.\n(c) The commissioner must consult at least annually with the Department of Employment and Economic Development's Vocational Rehabilitation Services and State Services for the Blind and other disability experts to review the survey results, assess program satisfaction, and recommend areas for continuous improvement.\n(d) The commissioner shall annually publish a report on the department's website that includes the data described in paragraph (a), survey results described in paragraph (b), and recommendations for continuous improvement described in paragraph (c).\nAn appointing authority may directly reinstate a person who is a former permanent or probationary employee of the job class, within four years of separation from the class. The four-year limitation does not apply to former permanent or probationary employees of the class who are receiving disability benefits under a state retirement plan.",
	"repealed": false
}