{
	"id": "40A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.02",
	"title": "40A.02 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the meanings given them.\n[Repealed, 1991 c 345 art 2 s 69]\n\"Agricultural use\" means the production of livestock, dairy animals, dairy products, poultry or poultry products, fur-bearing animals, horticultural or nursery stock, fruit, vegetables, forage, grains, timber, trees, or bees and apiary products. \"Agricultural use\" also includes wetlands, pasture, forest land, wildlife land, and other uses that depend on the inherent productivity of the land.\n\"Board\" means the Board of Water and Soil Resources.\n\"Commissioner\" means the commissioner of agriculture.\n\"Crop equivalent rating\" means a rating that reflects the net economic return per acre of soil when managed for cultivated crops, permanent pasture, or forest, whichever provides the highest net return.\n\"Department\" means the Department of Agriculture.\n\"Development\" means the subdivision and partitioning of land or the construction of residences on land or the conversion to competing land uses.\n\"District\" means a soil and water conservation district.\n\"Agricultural preserve\" or \"preserve\" means a preserve created under this chapter.\n\"Forest land\" means land that is at least ten percent stocked by trees of any size and capable of producing timber, or of exerting an influence on the climate or on the water regime; land that the trees described above have been removed from to less than ten percent stocking and that has not been developed for other use; and afforested areas.\n\"Local government\" means a county or municipality.\n\"Metropolitan area\" has the meaning given in section 473.121, subdivision 2.\n\"Municipality\" means a statutory or home rule charter city or town.\n\"Official controls\" or \"controls\" has the meaning given in section 394.22, subdivision 6.\n\"Soil survey\" means the comprehensive inventory and classification of soil types being conducted by the Minnesota Cooperative Soil Survey.",
	"repealed": false
}