{
	"id": "176.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.155",
	"title": "176.155 EXAMINATIONS.",
	"text": "(a) The injured employee must submit to examination by the employer's physician, if requested by the employer, and at reasonable times thereafter upon the employer's request. Examinations shall not be conducted in hotel or motel facilities. The examination must be scheduled at a location within 150 miles of the employee's residence unless the employer can show cause to the office to order an examination at a location further from the employee's residence. The employee is entitled upon request to have a personal physician or witness present at any such examination. Each party shall defray the cost of that party's physician.\n(b) Any report or written statement made by the employer's physician as a result of an examination of the employee, regardless of whether the examination preceded the injury or was made subsequent to the injury or whether litigation is pending, must be served upon the employee and the attorney representing the employee, if any, no later than 14 calendar days within the issuance of the report or written statement.\n(c) The employer shall pay reasonable travel expenses incurred by the employee in attending the examination including mileage, parking, and, if necessary, lodging and meals. The employer shall also pay the employee for any lost wages resulting from attendance at the examination.\n(d) A self-insured employer or insurer who is served with a claim petition pursuant to section 176.271, subdivision 1, or 176.291, shall schedule any necessary examinations of the employee, if an examination by the employer's physician or health care provider is necessary to evaluate benefits claimed. The examination shall be completed and the report of the examination shall be served on the employee and filed with the commissioner within 120 days of service of the claim petition. Any request for a good cause extension pursuant to paragraph (e) must be made within 120 days of service of the claim petition, except that a request may be made after 120 days of service of a claim petition in the following circumstances:\n(1) a change to the employee's claim regarding the nature and extent of the injury;\n(2) a change to the permanency benefits claimed by the employee, including a change in permanent partial disability percentage;\n(3) a new claim for indemnity benefits; or\n(4) the employment relationship is not admitted by the uninsured employer.\n(e) No evidence relating to the examination or report shall be received or considered by the commissioner, a compensation judge, or the court of appeals in determining any issues unless the report has been served and filed as required by this section, unless a written extension has been granted by the commissioner or compensation judge. The commissioner or a compensation judge shall extend the time for completing the adverse examination and filing the report upon good cause shown. The extension must not be for the purpose of delay and the insurer must make a good faith effort to comply with this subdivision. Good cause shall include but is not limited to:\n(1) that the extension is necessary because of the limited number of physicians or health care providers available with expertise in the particular injury or disease, or that the extension is necessary due to the complexity of the medical issues, or\n(2) that the extension is necessary to gather additional information which was not included on the petition as required by section 176.291.\nIn each case of dispute as to the injury the commissioner of labor and industry, or in case of a hearing the compensation judge conducting the hearing, or the Workers' Compensation Court of Appeals if the matter is before it, may with or without the request of any interested party, designate a neutral physician to make an examination of the injured worker and report the findings to the commissioner of labor and industry, compensation judge, or the Workers' Compensation Court of Appeals; provided that the request of the interested party must comply with the rules of the commissioner of labor and industry, the office, or the Workers' Compensation Court of Appeals, regulating the proper time and forms for the request, and further provided that when an interested party requests, not later than 30 days prior to a scheduled prehearing conference, that a neutral physician be designated, the compensation judge shall make such a designation. When a party has requested the designation of a neutral physician prior to a prehearing conference, that party may withdraw the request at any time prior to the hearing. The commissioner of labor and industry, compensation judge, or the Workers' Compensation Court of Appeals, may request the neutral physician to answer any particular question with reference to the medical phases of the case, including questions calling for an opinion as to the cause and occurrence of the injury insofar as medical knowledge is relevant in the answer. A copy of the signed certificate of the neutral physician shall be mailed to the parties in interest and either party, within five days from date of mailing, may demand that the physician be produced for purposes of cross-examination. The signed certificate of a neutral physician is competent evidence of the facts stated therein. The expense of the examination shall be paid as ordered by the commissioner of labor and industry, compensation judge, or the Workers' Compensation Court of Appeals.\nIf the injured employee refuses to comply with any reasonable request for examination, the right to compensation may be suspended by order of the commissioner or a compensation judge, and no compensation shall be paid while the employee continues in the refusal.\nIn all death claims where the cause of death is obscure or disputed any interested party may request an autopsy and, if denied, the compensation judge, or Workers' Compensation Court of Appeals upon appeal, upon petition and proper showing, shall order an autopsy. If any dependent claiming compensation or benefits does not consent to such autopsy within the time fixed by the order, all dependents shall forfeit all rights to compensation. The party demanding an autopsy shall bear the cost thereof.\nAny physician or other health care provider designated by the commissioner or compensation judge, or whose services are furnished or paid for by the employer, or who treats, examines, or is present at any examination, of an injured employee, may be required to testify as to any knowledge acquired by the physician or health care provider in the course of the treatment or examination relative to the injury or disability resulting from the injury only in cases involving occupational disease, cardiopulmonary injuries or diseases, injuries resulting from cumulative trauma, issues of apportionment of liability, and mental disorders, or upon an order of a compensation judge. In all other cases all evidence related to health care must be submitted by written report as prescribed by the chief administrative law judge. A party may cross-examine by deposition a physician or health care provider who has examined or treated the employee. If a physician or health care provider is not available for cross-examination prior to the hearing and the physician's or health care provider's written report is submitted at the hearing, the compensation judge shall, upon request of the adverse party, require the physician or health care provider to testify at the hearing or to be present at a posthearing deposition for the purpose of being cross-examined by the adverse party. All written evidence relating to health care must be submitted prior to or at the time of the hearing and no evidence shall be considered which was submitted after the hearing unless the compensation judge orders otherwise, and, in no case later than 30 days following the final hearing date unless an extension is granted by the chief administrative law judge. Existing medical reports must be submitted with a claim petition or answer as provided in sections 176.291 and 176.321. All reports shall substantially conform to rules prescribed by the chief administrative law judge. When a written report is used to present the testimony, it shall be admitted into evidence without the necessity for foundational testimony and shall be considered as prima facie evidence of the opinions it contains.",
	"repealed": false
}