{
	"id": "243.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.55",
	"title": "243.55 CONTRABAND ARTICLES; EXCEPTIONS; PENALTY.",
	"text": "Any person who brings, sends, or in any manner causes to be introduced into any state correctional facility or state hospital, or within or upon the grounds belonging to or land or controlled by any such facility or hospital, or is found in possession of any controlled substance as defined in section 152.01, subdivision 4, or any firearms, weapons or explosives of any kind, without the consent of the chief executive officer thereof, shall be guilty of a felony and, upon conviction thereof, punished by imprisonment for a term of not more than ten years. Any person who brings, sends, or in any manner causes to be introduced into any state correctional facility or within or upon the grounds belonging to or land controlled by the facility, or is found in the possession of any intoxicating or alcoholic liquor or malt beverage of any kind without the consent of the chief executive officer thereof, shall be guilty of a gross misdemeanor. The provisions of this section shall not apply to physicians carrying drugs or introducing any of the above described liquors into such facilities for use in the practice of their profession; nor to sheriffs or other peace officers carrying revolvers or firearms as such officers in the discharge of duties.\nThe chief executive officer of any state correctional facility may, under rules prescribed by the commissioner of corrections, provide for the search of all persons admitted into the facility or upon the grounds thereof. The head of any state hospital may, under rules prescribed by the Direct Care and Treatment executive board, provide for the search of all persons admitted into the hospital or upon the grounds thereof. Any contraband as described in subdivision 1 is subject to confiscation by the chief executive officer of a facility or the head of a hospital.\nAs used in this section, \"state hospital\" or \"hospital\" means any state-operated facility or hospital under the authority of the Direct Care and Treatment executive board for (a) persons with mental illness, developmental disability, or substance use disorder, (b) sex offenders, (c) persons with a sexual psychopathic personality, or (d) sexually dangerous person.",
	"repealed": false
}