{
	"id": "52.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.01",
	"title": "52.01 ORGANIZATION.",
	"text": "Any seven residents of the state may apply to the commissioner of commerce for permission to organize a credit union.\nA credit union is a cooperative society, incorporated for the twofold purpose of promoting thrift among its members and creating a source of credit for them at legitimate rates of interest for provident purposes.\nA credit union is organized in the following manner:\n(1) The applicants execute, in duplicate, a certificate of organization by the terms of which they agree to be bound, which shall state:\n(a) the name and location of the proposed credit union;\n(b) the names and addresses of the subscribers to the certificate and the number of shares subscribed by each;\n(2) The applicants submit the following in the form prescribed by the commissioner of commerce:\n(a) a statement of the common bond of the proposed credit union;\n(b) the number of potential members;\n(c) the geographic dispersion of the potential members;\n(d) evidence of interest, including willingness of potential members to assume responsibility for leadership and service;\n(e) a two-year forecast of probable levels of assets, shares and deposits, and income and expense;\n(f) the availability of other credit union services to the potential members;\n(g) other information the commissioner requires;\n(3) They next prepare and adopt bylaws for the general governance of the credit union consistent with the provisions of this chapter, and execute them in duplicate;\n(4) The certificate and the bylaws, both executed in duplicate, are forwarded to the commissioner of commerce with a $1,000 application fee, which may be waived by the commissioner for a credit union to be located in a low- or moderate-income area as defined in Code of Federal Regulations, title 12, part 25(1), (n)(1) and (n)(2), and where no other depository institution operates an office;\n(5) The commissioner of commerce shall, within 60 days of the receipt of the certificate, the information required by paragraph (2), and the bylaws determine whether they comply with the provisions of this chapter, and whether or not the organization of the credit union in question would benefit its members, be economically feasible, and be consistent with the purposes of this chapter;\n(6) Thereupon the commissioner of commerce shall notify the applicants of the decision. If it is favorable, the commissioner shall upon receipt of a commitment for insurance of accounts as required by section 52.24, subdivision 2, issue a certificate of approval, attached to the duplicate certificate of organization, and return them with the duplicate bylaws to the applicants. If it is unfavorable, the applicants may, within 60 days after the decision, appeal for a review in a court of competent jurisdiction;\n(7) The applicants shall thereupon file the duplicate of the certificate of organization, with the certificate of approval attached thereto, with the secretary of state, who shall make a record of the certificate and return it, with a certificate of record attached thereto, to the commissioner of commerce for permanent records; and\n(8) Thereupon the applicants shall be a credit union incorporated in accordance with the provisions of this chapter.\nIn order to simplify the organization of credit unions, the commissioner of commerce shall prepare approved forms of certificate of organization and bylaws, consistent with this chapter, which may be used by credit union incorporators for their guidance, and on written application of seven residents of the state, shall supply them without charge with a blank certificate of organization and a copy of the form of suggested bylaws.",
	"repealed": false
}