{
	"id": "51A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.21",
	"title": "51A.21 POWERS OF ASSOCIATION.",
	"text": "Every association incorporated pursuant to or operating under the provisions of sections 51A.01 to 51A.57 shall have all the powers enumerated, authorized, and permitted by sections 51A.01 to 51A.57 and such other rights, privileges, and powers as may be incidental to or reasonably necessary or appropriate for the accomplishment of the objects and purposes of the association, and in addition shall have those powers possessed by corporations organized under chapter 302A. Among others, and except as otherwise limited by the provisions of sections 51A.01 to 51A.57, every association shall have the powers set forth in this section.\nTo have perpetual existence; to adopt and use a corporate seal, which may be affixed by imprint, facsimile, or otherwise; and to adopt and amend bylaws as provided in sections 51A.01 to 51A.57.\nTo sue and be sued, complain and defend in any court of law or equity.\nTo acquire, hold, sell, dispose of and convey real and personal estate consistent with its objects and powers; to mortgage, pledge, or lease any real or personal estate; and to take property by gifts, devise, or bequest.\nTo borrow from sources, individual or corporate, not more than an aggregate amount equal to one-half of its total assets on the date of borrowing and additional sums the commissioner approves. The advance written approval of the commissioner, who has sole discretionary authority to grant or withhold such approval, is required for sources of borrowing other than financial institutions or federal home loan banks. A subsequent reduction of total assets shall not affect in any way outstanding obligations for borrowed money. All borrowing under this subdivision may be secured by property of the association, and may be evidenced by notes, bonds, debentures, commercial paper, bankers' acceptances, or other obligations or securities, (except capital stock and capital certificates).\n[Repealed, 1988 c 666 s 75]\nTo make, sell, purchase, invest in, and participate or otherwise deal in loans and conditional sale contracts and other forms of indebtedness and leases, and to take any manner of security for the loans and contracts.\nTo acquire or own real property or interests in real property the directors consider necessary or convenient for the conduct of the business of the association, which for the purposes of sections 51A.01 to 51A.57 includes the ownership of stock of a wholly owned subsidiary corporation having as its exclusive activity the ownership and management of this property or interests. The amount so invested must not exceed the sum equal to five percent of net assets of the association, provided that the commissioner may authorize a greater amount to be so invested.\nTo obtain and maintain insurance of its savings accounts by the Federal Savings and Loan Insurance Corporation or any other federal agency established for the purpose of insuring savings accounts in associations.\nTo qualify as and become a member of a federal home loan bank.\nTo appoint and remove officers, agents, and employees as its business shall require and to provide them suitable compensation; to provide for life, health, and casualty insurance for officers and employees, and to adopt and operate reasonable bonus plans and retirement benefits for such officers and employees; and to provide for indemnification of its officers, employees, and directors as prescribed or permitted in sections 51A.01 to 51A.57 whether by insurance or otherwise.\nTo become a member of, deal with, or make reasonable payments or contributions to any organization to the extent such organization assists in furthering or facilitating the association's purposes, powers, or community responsibilities, and to comply with any reasonable conditions of eligibility.\nTo maintain and let safes, boxes, or other receptacles for the safekeeping of personal property upon such terms and conditions as may be agreed upon, other statutory provisions withstanding.\nTo sell money orders, travel checks, and similar instruments, or as agent for any organization empowered to sell such instruments through agents within this state.\nIf and when an association is a member of a federal home loan bank, to act as fiscal agent of the United States, and, when so designated by the Secretary of the Treasury, to perform, under such regulations as the secretary may prescribe, all such reasonable duties as fiscal agent of the United States as the secretary may require; and to act as agent for any instrumentality of the United States and as agent of this state or any instrumentality thereof.\nTo service loans and investments for others.\nTo acquire deposits and pay earnings thereon, and to lend and commit to lend, extend credit, and invest its funds as provided in sections 51A.01 to 51A.57.\n[Repealed, 1982 c 473 s 30]\n[Repealed, 1982 c 473 s 30]\nTo act as agent or holder of an escrow for others in any transaction incidental to the operation of its business.\nTo accept and maintain treasury tax and loan accounts of the United States and to pledge collateral to secure the treasury tax or loan accounts, in accordance with the regulations of the Department of the Treasury of the United States.\n[Repealed, 1988 c 666 s 75]\nTo issue and sell, directly or through underwriters, capital certificates which shall represent nonwithdrawable capital contributions, and constitute part of the reserves and net worth of the association. The certificates shall have no voting rights, shall be subordinate to all savings accounts, debt obligations, and claims of creditors of the association and shall constitute a claim in liquidation against any reserves, surplus, and other net worth accounts remaining after the payment in full of all savings accounts, debt obligations, and claims of creditors. The capital certificates shall be entitled to the payment of earnings prior to the allocation of any income to surplus or other net worth accounts of the association and may be issued with a fixed rate of earnings or with a prior claim to distribution of a specified percentage of any net income remaining after required allocations to reserves, or a combination thereof. Losses shall be charged against capital certificates only after reserves, surplus, and other net worth accounts have been exhausted.\nTo declare and pay dividends on capital stock in cash or property out of the unreserved and unrestricted earned surplus of the association, or its own shares from time to time except when the association has failed within the preceding 12 months to make any minimum allocation to surplus or reserve accounts required by section 51A.20 or to maintain any minimum required level, and except when the association is in an impaired condition or when the payment thereof would cause the association to be in an impaired condition.\nTo act and receive compensation as trustee of a trust created or organized in the United States and forming a part of a stock bonus, pension, or profit-sharing plan that qualifies or is qualified for specific tax treatment under section 401 of the Internal Revenue Code of 1986, as amended through December 31, 1987, and to act as trustee or custodian of an individual retirement account within the meaning of section 408 of that code if the funds of the trust or account are invested only in savings accounts of the association or in obligations or securities issued by the association. All funds held in a fiduciary capacity by the association under the authority of this subdivision may be commingled and consolidated for appropriate purposes of investment if records reflecting each separate beneficial interest are maintained by the fiduciary unless the responsibility is lawfully assumed by another appropriate party.\nTo own or use automated teller machines and establish electronic financial terminals and transmission facilities as provided in sections 47.61 to 47.74.\nTo contract with an employer with respect to the following:\n(1) Soliciting, collecting, and receiving savings by payroll deduction. These savings are to be credited to a designated account of an employee who may voluntarily participate in a payroll deduction plan.\n(2) Direct deposit of wages or salary paid by the employer to an employee's account in a financial depository institution. Deposits may be made by electronic or other medium. Direct deposits may be made if the employee authorizes the deposits in writing and designates the association or other financial depository institution as the recipient of these deposits.\nTo issue drafts and similar instruments drawn on the association to aid in effecting withdrawals and for other purposes of the association.\nTo raise funds in the form of (1) savings accounts; (2) time deposit accounts; (3) NOW accounts; (4) demand deposit accounts; and (5) treasury tax and loan accounts.\nUpon application and approval by the commissioner, to act as trustee, executor, administrator, personal representative, conservator, custodian, guardian, or in any other fiduciary capacity in which state banks, trust companies, or other corporations are permitted to act, and to receive reasonable compensation therefore.\nTo contract with depositors for service charges in connection with the opening and maintaining of deposit accounts and for providing services ancillary to the opening and maintaining of deposit accounts. Service charges are a matter of contract between the association and the depositor, and any such contract is fully enforceable according to its stated terms.",
	"repealed": false
}