{
	"id": "296A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.23",
	"title": "296A.23 CRIMINAL PENALTIES.",
	"text": "A person who knowingly provides false information, including, but not limited to, false odometer readings, or who knowingly makes a false statement in a report, record, claim, or sales ticket required by this chapter, is guilty of a gross misdemeanor.\nA person who willfully attempts in any manner to evade or defeat any tax imposed by this chapter, including, but not limited to, making and subscribing any false statement in any report, record, claim, or sales ticket required by this chapter; or making a false claim for a refund under section 296A.16, subdivision 2, is guilty of a felony.\nA person who operates, or causes to be operated, a licensed motor vehicle on the public highways of this state on special fuel on which the excise tax provided by this chapter has not been paid, or the liability assumed by another person licensed under this chapter, is guilty of a misdemeanor.\nA person who uses gasoline, which has been delivered into an on-farm bulk storage tank, and on which no tax has been paid as provided in section 296A.15, subdivision 5, and who uses this gasoline for propelling a motor vehicle on the public highways of this state is guilty of a misdemeanor.\nAn officer or employee of the state of Minnesota charged with the enforcement of a provision of this chapter who is employed by or who engages in business as a distributor or dealer in petroleum products is guilty of a misdemeanor.\nA person other than the commissioner who is authorized to collect excise taxes on behalf of the state of Minnesota, establishes a fiduciary relationship, and whoever violates that relationship is guilty of a violation of this chapter, and of section 609.54, and may be punished accordingly.\nA minimum fine of $200 shall be imposed on a person who fails to obtain a license or trip permit required under section 168D.05 or 168D.12.\nThe blending of gasoline on which the tax has been paid or the liability accrued, with any substance on which the tax has not been paid or the liability thereafter accrued, is prohibited.\nThis section does not preclude the addition of any of the various inhibitors which in total do not exceed one-half of one percent by volume of the product treated, nor the addition to fuel for two-cycle gasoline engines of a lubricant not exceeding five percent by volume or the product treated; nor does this subdivision preclude the addition of fuel oil to gasoline for the purpose of generating power for the propulsion of farm tractors.\nAny violation of this chapter, unless otherwise specified, is a gross misdemeanor.\nProsecutions under this section may be brought in the county in which the defendant resides or in Ramsey County. On request of the commissioner of revenue, the county attorney of a county in which the action is commenced shall prosecute violations of this chapter. Costs, fees, and expenses incurred by any county attorney in litigation in connection with the action may be paid from appropriations to the commissioner of revenue for the administration of this chapter.\nNo action or suit for recovery of one penalty shall be a bar to or affect the recovery of any other penalty or be a bar to any criminal prosecution against any licensee or any other person under the provisions of this chapter.\nNotwithstanding section 628.26, or any other provision of the criminal laws of this state, an indictment may be found and filed, or a complaint filed, upon a criminal offense named in this section, in the proper court within six years after the offense is committed.",
	"repealed": false
}