{
	"id": "204B.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.29",
	"title": "204B.29 ELECTION JUDGES; ELECTION SUPPLIES; DUTIES.",
	"text": "Before 9:00 p.m. on the day preceding an election, at least one election judge from each precinct in each municipality, or school district if applicable, shall secure voter registration files, ballots, forms, envelopes and other required supplies from the municipal clerk, school district clerk, or other legal custodian. The election judge shall deliver the materials to the polling place before the time when voting is scheduled to begin on election day. The county auditor shall send or deliver the election supplies enumerated in this section to the election judges in the precincts in unorganized territory. The election supplies may be sent by certified mail, parcel post, express mail or any other postal service providing assured delivery by no later than the day before the election. If the election supplies are delivered by any other means, they shall be delivered by no later than the day before the election.\nEach precinct shall be furnished with 100 ballots of each kind for every 85 individuals who voted in that precinct at the last election for the same office or on similar questions, or with ballots of each kind in an amount at least ten percent greater than the number of votes which are reasonably expected to be cast in that precinct in that election, whichever supply of ballots is greater. No precinct shall be furnished with any ballots containing the name of any candidate who cannot properly be voted for in that precinct.\nThe election judges shall be responsible for the preservation of all election materials received by them until returned to the appropriate election officials after the voting has ended.\nIf no election judge secures the election materials for a precinct in any municipality, or school district if applicable, as provided in subdivision 1, the municipal or school district clerk shall deliver them to an election judge for that precinct not later than the time when voting is scheduled to begin. The municipal or school district clerk shall require the election judge accepting delivery of the election supplies to sign a receipt for them. The election judges of that precinct shall pay the expenses of delivery of the materials and shall be liable for the penalty provided by law for neglect of duty.",
	"repealed": false
}