{
	"id": "243.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.05",
	"title": "243.05 COMMISSIONER OF CORRECTIONS; POWERS, LIMITATIONS.",
	"text": "(a) The Supervised Release Board may parole any person sentenced to confinement in any state correctional facility for adults under the control of the commissioner of corrections, provided that:\n(1) no inmate serving a life sentence for committing murder before May 1, 1980, other than murder committed in violation of clause (1) of section 609.185 who has not been previously convicted of a felony shall be paroled without having served 20 years, less the diminution that would have been allowed for good conduct had the sentence been for 20 years;\n(2) no inmate serving a life sentence for committing murder before May 1, 1980, who has been previously convicted of a felony or though not previously convicted of a felony is serving a life sentence for murder in the first degree committed in violation of clause (1) of section 609.185 shall be paroled without having served 25 years, less the diminution which would have been allowed for good conduct had the sentence been for 25 years;\n(3) any inmate sentenced prior to September 1, 1963, who would be eligible for parole had the inmate been sentenced after September 1, 1963, shall be eligible for parole; and\n(4) any new rule or policy or change of rule or policy adopted by the commissioner of corrections which has the effect of postponing eligibility for parole has prospective effect only and applies only with respect to persons committing offenses after the effective date of the new rule or policy or change.\n(b) Upon being paroled and released, an inmate is and remains in the legal custody and under the control of the commissioner, subject at any time to be returned to a facility of the Department of Corrections established by law for the confinement or treatment of convicted persons and the parole rescinded by the commissioner.\n(c) The written order of the commissioner of corrections, is sufficient authority for any peace officer, state correctional investigator, or state parole and probation agent to retake and place in actual custody any person on parole or supervised release. In addition, when it appears necessary in order to prevent escape or enforce discipline, any state parole and probation agent or state correctional investigator may, without order of warrant, take and detain a parolee or person on supervised release or work release and bring the person to the commissioner for action.\n(d) The written order of the commissioner of corrections is sufficient authority for any peace officer, state correctional investigator, or state parole and probation agent to retake and place in actual custody any person on probation under the supervision of the commissioner pursuant to section 609.135. Additionally, when it appears necessary in order to prevent escape or enforce discipline, any state parole and probation agent or state correctional investigator may, without an order, retake and detain a probationer and bring the probationer before the court for further proceedings under section 609.14.\n(e) The written order of the commissioner of corrections is sufficient authority for any peace officer, state correctional investigator, or state parole and probation agent to detain any person on pretrial release who absconds from pretrial release or fails to abide by the conditions of pretrial release.\n(f) Persons conditionally released, and those on probation under the supervision of the commissioner of corrections pursuant to section 609.135 may be placed within or outside the boundaries of the state at the discretion of the commissioner of corrections or the court, and the limits fixed for these persons may be enlarged or reduced according to their conduct.\n(g) Except as otherwise provided in subdivision 1b, in considering applications for conditional release or discharge, the commissioner is not required to hear oral argument from any attorney or other person not connected with an adult correctional facility of the Department of Corrections in favor of or against the parole or release of any inmates. The commissioner may institute inquiries by correspondence, taking testimony, or otherwise, as to the previous history, physical or mental condition, and character of the inmate and, to that end, has the authority to require the attendance of the chief executive officer of any state adult correctional facility and the production of the records of these facilities, and to compel the attendance of witnesses. The commissioner is authorized to administer oaths to witnesses for these purposes.\n(h) Before revoking a nonviolent controlled substance offender's parole or probation based on a technical violation, when the offender does not present a risk to the public and the offender is amenable to continued supervision in the community, a parole or probation agent must identify community options to address and correct the violation including, but not limited to, inpatient substance use disorder treatment. If a probation or parole agent determines that community options are appropriate and available in the state, the agent must seek to restructure the offender's terms of release to incorporate those options. If an offender on probation stipulates in writing to restructure the terms of release, a probation agent must forward a report to the district court containing:\n(1) the specific nature of the technical violation of probation;\n(2) the recommended restructure to the terms of probation; and\n(3) a copy of the offender's signed stipulation indicating that the offender consents to the restructuring of probation.\n(i) The recommended restructuring of probation becomes effective when confirmed by a judge. The order of the court is proof of confirmation and amends the terms of the sentence imposed by the court under section 609.135.\n(j) If a nonviolent controlled substance offender's parole or probation is revoked, the offender's agent must first attempt to place the offender in a local jail.\n(k) For purposes of paragraphs (h) to (k):\n(1) \"nonviolent controlled substance offender\" means a person who meets the criteria described under section 244.0513, subdivision 2, clauses (1), (2), and (5); and\n(2) \"technical violation\" means any violation of a court order of probation or a condition of parole, except an allegation of a subsequent criminal act that is alleged in a formal complaint, citation, or petition.\nThe commissioner of corrections shall assist law enforcement agencies in locating and taking into custody any person who has been convicted of a felony for which a prison sentence is presumed under the Sentencing Guidelines and applicable statutes, and who absconds pending sentencing in violation of the conditions of release imposed by the court under rule 27.01 of the Rules of Criminal Procedure. The written order of the commissioner of corrections is sufficient authority for any state parole and probation agent to take the person into custody without a warrant and to take the person before the court without further delay.\n(a) This subdivision applies to parole decisions relating to inmates convicted of first-degree murder who are described in subdivision 1, clauses (a) and (b). As used in this subdivision, \"victim\" has the meaning given in section 611A.01, paragraph (b).\n(b) The commissioner shall make reasonable efforts to notify the victim, in advance, of the time and place of the inmate's parole review hearing. The victim has a right to submit an oral or written statement at the review hearing. The statement may summarize the harm suffered by the victim as a result of the crime and give the victim's recommendation on whether the inmate should be paroled at that time. The commissioner must consider the victim's statement when making the parole decision.\nThe commissioner of corrections may adopt rules in accordance with chapter 14, the Administrative Procedure Act, governing the procedures for granting of conditional release and final discharge. The rules may provide for the conduct and employment of persons conditionally released, and other matters necessary to implement the duties conferred by law upon the commissioner with respect to conditional release and discharge of persons. For purposes of this subdivision, \"conditional release\" means a person on parole, work release, or supervised release.\nIt is the duty of the Supervised Release Board to keep in communication, as far as possible, with all persons who are on parole and with their employers. The board may grant a person on parole a final discharge from any sentence when:\n(1) the person on parole has complied with the conditions of parole for a period of time sufficient to satisfy the board that the parolee is reliable and trustworthy;\n(2) the board is satisfied the person on parole will remain at liberty without violating the law; and\n(3) final discharge is not incompatible with the welfare of society.\nUpon the granting of a final discharge, the board shall issue a certificate of final discharge to the person discharged and also cause a record of the acts of the inmate to be made. The record shall show the date of the inmate's confinement, the inmate's record while in prison, the date of parole, the inmate's record while on parole, reasons underlying the decision for final discharge, and other facts which the board regards as appropriate. Nothing in this section or section 244.05 shall be construed as impairing the power of the board of pardons to grant a pardon or commutation in any case.\nTo carry out the powers and duties conferred by this section, the commissioner of corrections may designate from among staff members, one or more hearing officers and delegate to them any of the powers and duties conferred by this section. In the exercise of their delegated powers and duties the hearing officers shall be subject to the rules prescribed by the commissioner of corrections.\nThe commissioner of corrections may deputize any person regularly employed by another state to act as an officer and agent of this state in effecting the return of any person who has violated the terms and conditions of parole or probation as granted by this state. In any matter relating to the return of that person, any agent so deputized has all the powers of a police officer of this state. Any deputization pursuant to this subdivision shall be in writing and carried by the agent as formal evidence of deputization and must be produced upon demand. Subject to the approval of the commissioner of management and budget, the commissioner of corrections may enter into contracts with similar officials of any other state for the purpose of sharing an equitable portion of the cost of effecting the return of any person who has violated the terms and conditions of release or probation as granted by this state.\n(a) The commissioner of corrections, as far as possible, shall exercise supervision over persons released on parole or probation pursuant to this section and section 242.19.\n(b) The commissioner of corrections shall exercise supervision over probationers as provided in section 609.135, and over persons conditionally released pursuant to section 241.26.\n(c) For the purposes of clauses (a) and (b), and sections 609.115 and 609.135, subdivision 1, the commissioner shall appoint state agents who shall be in the classified service of the state civil service. The commissioner may also appoint suitable persons in any part of the state or enter into agreements with individuals and public or private agencies, for the same purposes, and pay the costs incurred under the agreements. Each agent or person shall perform the duties the commissioner may prescribe in behalf of or in the supervision of those persons described in clause (b). In addition, each agent or person shall act under the orders of the commissioner in the supervision of those persons conditionally released as provided in clause (a). Agents shall provide assistance to conditionally released persons in obtaining employment, and shall conduct relevant investigations and studies of persons under supervision upon the request of the commissioner. Regional supervisors may also supervise state parole agents as directed by the commissioner of corrections. This duty shall not interfere with the supervisor's responsibility under the County Probation Act, Laws 1959, chapter 698.",
	"repealed": false
}