{
	"id": "609.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.75",
	"title": "609.75 GAMBLING; DEFINITIONS.",
	"text": "(a) A lottery is a plan which provides for the distribution of money, property or other reward or benefit to persons selected by chance from among participants some or all of whom have given a consideration for the chance of being selected. A participant's payment for use of a 900 telephone number or another means of communication that results in payment to the sponsor of the plan constitutes consideration under this paragraph.\n(b) An in-package chance promotion is not a lottery if all of the following are met:\n(1) participation is available, free and without purchase of the package, from the retailer or by mail or toll-free telephone request to the sponsor for entry or for a game piece;\n(2) the label of the promotional package and any related advertising clearly states any method of participation and the scheduled termination date of the promotion;\n(3) the sponsor on request provides a retailer with a supply of entry forms or game pieces adequate to permit free participation in the promotion by the retailer's customers;\n(4) the sponsor does not misrepresent a participant's chances of winning any prize;\n(5) the sponsor randomly distributes all game pieces and maintains records of random distribution for at least one year after the termination date of the promotion;\n(6) all prizes are randomly awarded if game pieces are not used in the promotion; and\n(7) the sponsor provides on request of a state agency a record of the names and addresses of all winners of prizes valued at $100 or more, if the request is made within one year after the termination date of the promotion.\n(c) Except as provided by section 299L.07, acts in this state in furtherance of a lottery conducted outside of this state are included notwithstanding its validity where conducted.\n(d) The distribution of property, or other reward or benefit by an employer to persons selected by chance from among participants, all of whom:\n(1) have made a contribution through a payroll or pension deduction campaign to a registered combined charitable organization, within the meaning of section 43A.50; or\n(2) have paid other consideration to the employer entirely for the benefit of such a registered combined charitable organization, as a precondition to the chance of being selected, is not a lottery if:\n(i) all of the persons eligible to be selected are employed by or retirees of the employer; and\n(ii) the cost of the property or other reward or benefit distributed and all costs associated with the distribution are borne by the employer.\nA bet is a bargain whereby the parties mutually agree to a gain or loss by one to the other of specified money, property or benefit dependent upon chance although the chance is accompanied by some element of skill.\nThe following are not bets:\n(1) a contract to insure, indemnify, guarantee or otherwise compensate another for a harm or loss sustained, even though the loss depends upon chance;\n(2) a contract for the purchase or sale at a future date of securities or other commodities;\n(3) offers of purses, prizes or premiums to the actual contestants in any bona fide contest for the determination of skill, speed, strength, endurance, or quality or to the bona fide owners of animals or other property entered in such a contest;\n(4) the game of bingo when conducted in compliance with sections 349.11 to 349.23;\n(5) a private social bet not part of or incidental to organized, commercialized, or systematic gambling;\n(6) the operation of equipment or the conduct of a raffle under sections 349.11 to 349.22, by an organization licensed by the Gambling Control Board or an organization exempt from licensing under section 349.166;\n(7) pari-mutuel betting on horse racing when the betting is conducted under chapter 240; and\n(8) the purchase and sale of State Lottery tickets under chapter 349A.\nA gambling device is a contrivance the purpose of which is that for a consideration a player is afforded an opportunity to obtain something of value, other than free plays, automatically from the machine or otherwise, the award of which is determined principally by chance, whether or not the contrivance is actually played. \"Gambling device\" also includes a video game of chance, as defined in subdivision 8.\nAssociated equipment means any equipment used in connection with gambling that would not be classified as a gambling device, including but not limited to: cards, dice, computerized systems of betting at a race book or sports pool, computerized systems for monitoring slot machines or games of chance, devices for weighing or counting money, and links which connect progressive slot machines.\nA gambling place is a location or structure, stationary or movable, or any part thereof, wherein, as one of its uses, betting is permitted or promoted, a lottery is conducted or assisted or a gambling device is operated.\nA bucket shop is a place wherein the operator is engaged in making bets in the form of purchases or sales on public exchanges of securities, commodities or other personal property for future delivery to be settled at prices dependent on the chance of those prevailing at the public exchanges without a bona fide purchase or sale being in fact made on a board of trade or exchange.\nSports bookmaking is the activity of intentionally receiving, recording or forwarding within any 30-day period more than five bets, or offers to bet, that total more than $2,500 on any one or more sporting events.\nA video game of chance is a game or device that simulates one or more games commonly referred to as poker, blackjack, craps, hi-lo, roulette, or other common gambling forms, though not offering any type of pecuniary award or gain to players. The term also includes any video game having one or more of the following characteristics:\n(1) it is primarily a game of chance, and has no substantial elements of skill involved;\n(2) it awards game credits or replays and contains a meter or device that records unplayed credits or replays. A video game that simulates horse racing that does not involve a prize payout is not a video game of chance.\nA 900 telephone number is a ten-digit number, the first three numbers of which are from 900 to 999.\nA game means any game played with cards, dice, equipment, or any mechanical or electronic device or machine for money or other value, whether or not approved by law, and includes, but is not limited to: card and dice games of chance, slot machines, banking or percentage games, video games of chance, sports pools, pari-mutuel betting, and race book. \"Game\" does not include any private social bet.\nAn authorized gambling activity means any form of gambling authorized by and operated in conformance with law.\nAn authorized gambling establishment means any premises where gambling authorized by law is occurring.\n[Repealed, 2015 c 29 s 9]\nA \"savings promotion raffle\" means a contest or promotion in which a chance of winning designated prizes is obtained by the deposit of a specified amount of money in a savings account, share account, savings association, share certificate, or other savings program offered by a state or federally chartered credit union or bank.\n\"Qualifying account\" means a savings account, share account, savings association, share certificate, or other savings program through which depositors may obtain chances to win prizes in a savings promotion raffle by depositing specified sums of money.\n\"Nonqualifying account\" means a savings account, share account, savings association, share certificate, or other savings program that is not a qualifying account.\nFor the purposes of sections 609.75 to 609.762, the terms defined in this section have the meanings given, unless the context clearly indicates otherwise.",
	"repealed": false
}