{
	"id": "299A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.61",
	"title": "299A.61 CRIMINAL ALERT NETWORK.",
	"text": "The commissioner of public safety, in cooperation with the Department of Information Technology Services, shall develop and maintain an integrated criminal alert network to facilitate the communication of crime prevention information by electronic means among state agencies, law enforcement officials, and the private sector. The network shall disseminate data regarding the commission of crimes, including information on missing and endangered children or vulnerable adults, and attempt to reduce theft and other crime by the use of electronic transmission of information. In addition, the commissioner shall evaluate the feasibility of using the network to disseminate data regarding the use of fraudulent checks and the coordination of security and antiterrorism efforts with the Federal Bureau of Investigation. If the commissioner determines that one or both of these uses are feasible, the commissioner shall ensure that the network disseminates data in the area or areas determined to be feasible.\nData that identify individuals or businesses as members of the criminal alert network, including names, addresses, telephone and fax numbers, are private data on individuals or nonpublic data, as defined in section 13.02, subdivision 9 or 12.\nA financial institution, including its employees or company agents, that provides or reasonably attempts to provide information regarding stolen, forged, or fraudulent checks for use by the crime alert network, check verification services, consumer reporting agencies, a banking industry antifraud database consistent with federal privacy law, or by law enforcement agencies that are investigating a crime is not liable to any person for disclosing the information, provided that the financial institution is acting in good faith.\nThe commissioner of public safety may charge a fee to members of the network for the services that the network provides. Money collected from these fees is appropriated to the commissioner of public safety and must be used for network expenses.",
	"repealed": false
}