{
	"id": "245.4901",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4901",
	"title": "245.4901 SCHOOL-LINKED BEHAVIORAL HEALTH GRANTS.",
	"text": "The commissioner of human services shall establish a school-linked behavioral health grant program to provide early identification and intervention for students with mental health and substance use disorder needs and to build the capacity of schools to support students with mental health and substance use disorder needs in the classroom.\nAn eligible applicant for a school-linked behavioral health grant is an entity or provider that is:\n(1) a mental health clinic certified under section 245I.20;\n(2) a community mental health center under section 256B.0625, subdivision 5;\n(3) an Indian health service facility or a facility owned and operated by a tribe or tribal organization operating under United States Code, title 25, section 5321;\n(4) a provider of children's therapeutic services and supports as defined in section 256B.0943;\n(5) enrolled in medical assistance as a mental health or substance use disorder provider agency and employs at least two full-time equivalent mental health professionals qualified according to section 245I.04, subdivision 2, or two alcohol and drug counselors licensed or exempt from licensure under chapter 148F who are qualified to provide clinical services to children and families;\n(6) licensed under chapter 245G and in compliance with the applicable requirements in chapters 245A, 245C, and 260E, section 626.557, and Minnesota Rules, chapter 9544; or\n(7) a licensed professional in private practice as defined in section 245G.01, subdivision 17, who meets the requirements of section 254B.05, subdivision 1, paragraph (b).\n(a) Allowable grant activities and related expenses may include but are not limited to:\n(1) identifying and diagnosing mental health conditions and substance use disorders of students;\n(2) delivering mental health and substance use disorder treatment and services to students and their families, including via telehealth consistent with section 256B.0625, subdivision 3b;\n(3) supporting families in meeting their child's needs, including navigating health care, social service, and juvenile justice systems;\n(4) providing transportation for students receiving school-linked behavioral health services when school is not in session;\n(5) building the capacity of schools to meet the needs of students with mental health and substance use disorder concerns, including school staff development activities for licensed and nonlicensed staff; and\n(6) purchasing equipment, connection charges, on-site coordination, set-up fees, and site fees in order to deliver school-linked behavioral health services via telehealth.\n(b) Grantees shall obtain all available third-party reimbursement sources as a condition of receiving a grant. For purposes of this grant program, a third-party reimbursement source excludes a public school as defined in section 120A.20, subdivision 1. Grantees shall serve students regardless of health coverage status or ability to pay.\nGrantees shall provide data to the commissioner for the purpose of evaluating the effectiveness of the school-linked behavioral health grant program, no more frequently than twice per year. Data provided by grantees must include only the number of clients served, client demographics, payor information, client-related clinical and ancillary services including hours of direct client services, and hours of ancillary support services. Qualitative data may also be collected to demonstrate outcomes. The commissioner must consult with grantees to develop ongoing outcome measures for program capacity and performance.\nIn administering the grant program, the commissioner shall consult with school districts that have not received grants under this section but that wish to collaborate with a community mental health provider. The commissioner shall also work with culturally specific providers to allow the providers to serve students from their community in multiple schools. When awarding grants, the commissioner shall consider the need to have consistency of providers over time among schools and students.",
	"repealed": false
}