{
	"id": "354A.0961",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.0961",
	"title": "354A.0961 SERVICE CREDIT PURCHASE FOR TEACHING SERVICE IN OTHER STATES.",
	"text": "(a) A teacher who has at least three years of allowable service credit with the St. Paul Teachers Retirement Fund Association is entitled to purchase up to five years of allowable and formula service credit for periods of service as an elementary or secondary public or charter school teacher in another state by making payment of the purchase payment amount under subdivision 4.\n(b) Periods of service that may be purchased are:\n(1) periods of service as a teacher in another state before becoming a member of the association; and\n(2) periods of service as a teacher in another state during any period of employment after terminating teaching service as a member of the association and before returning to teaching service as a member of the association.\n(c) A teacher is not permitted to purchase a period of service if the purchase would result in an entitlement to service credit for the same period of service in more than one pension or retirement plan.\nA teacher who desires to purchase service credit under subdivision 1 must apply with the executive director to make the purchase. The application must include:\n(1) documentation showing the teacher's period of employment as a teacher in another state;\n(2) the period of employment for which service credit is being purchased;\n(3) permission to allow the executive director to request and receive verification of such employment;\n(4) documentation showing that the teacher has forfeited all rights to benefits for the period of employment as a teacher in another state; and\n(5) any other relevant information requested by the executive director.\nThe St. Paul Teachers Retirement Fund Association must grant allowable service credit to the teacher making the purchase for the period being purchased upon receipt of the purchase payment amount. Payment must be made by the earlier of the teacher's termination of teaching service or one year after the executive director's approval of the teacher's application to purchase service credit. Purchasing allowable service credit under this section does not change the date the teacher first became a member of the association for the purpose of computing an annuity under section 354A.31, subdivision 6.\nThe purchase payment amount is the amount determined under section 356.551 for the period or periods of service requested, except that, for purposes of calculating the purchase payment amount to purchase allowable service credit for service as a teacher in another state that occurred before becoming a member of the association or between periods of teaching service as a member of the association, section 356.551, subdivision 2, paragraph (c), shall not apply.",
	"repealed": false
}