{
	"id": "387.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/387.41",
	"title": "387.41 REMOVAL AFTER HEARING.",
	"text": "If, after investigation and trial by civil service commission, an employee who is found guilty of inefficiency, breach of duty, or misconduct, may be removed, reduced, or suspended and the employee's name may be stricken from the service register. If the board determines that the charges are not sustained, the accused, if suspended pending investigation, shall be immediately reinstated and shall be paid all back pay due for the period of suspension.\nFindings, determinations, and orders of the commission for suspension, reduction, or removal, shall be in writing and shall be filed within three days after the completion of the hearing with the secretary of the commission. The secretary shall notify the employee of the decision in writing. Any person suspended, reduced, or removed by the commission after investigation may appeal in accordance with chapter 14.\nThe question to be determined by the court shall be:\n\"Upon the evidence, was the order of the commission reasonable?\"\nWhenever the sheriff or county attorney deems the civil service commissioners, or any one of them, to be failing their duties as outlined in sections 387.31 to 387.45, the sheriff or county attorney, shall request the county board to hold a hearing regarding the matter. The county board shall then determine this question: \"Is the sheriff's civil service commission or any member thereof failing in the duties prescribed by sections 387.31 to 387.45?\" Upon an affirmative finding by resolution, the commission or member shall be deemed removed. The county board shall fill the vacancy by appointment for the balance of the term.\nAn applicant for examination, appointment, or promotion in the sheriff's department of the county who shall, either directly or indirectly, give, render, or pay or promise to give, render, or pay any money, service, or other thing to any person, for or on account of or in connection with the examination, appointment, or proposed appointment or promotion shall be guilty of a misdemeanor and shall also be subject to suspension or removal.\nAny officer or employee of the sheriff's department, when operating under civil service in accordance with the provisions of this chapter, who participates in any manner in activities in support of any candidate or party, directly or indirectly solicits, receives, or pays, or participates in any manner in soliciting, receiving, or paying any assessment, subscription, or contribution for any candidate, party, or political purpose, is guilty of a misdemeanor and shall be subject to suspension or removal.",
	"repealed": false
}