{
	"id": "192.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.26",
	"title": "192.26 STATE AND MUNICIPAL OFFICERS AND EMPLOYEES NOT TO LOSE PAY WHILE ON AUTHORIZED LEAVE FOR MILITARY DUTY.",
	"text": "Subject to the conditions hereinafter prescribed, any officer or employee of the state or of any political subdivision, municipal corporation, or other public agency of the state who shall be a member of the National Guard, or any other component of the militia of the state now or hereafter organized or constituted under state or federal law, or who shall be a member of the officers' reserve corps, the enlisted reserve corps, the Naval Reserve, the Marine Corps reserve, or any other reserve component of the military or naval forces of the United States now or hereafter organized or constituted under federal law, shall be entitled to leave of absence from the public office or employment without loss of pay, seniority status, efficiency rating, vacation, sick leave, or other benefits for all the time when engaged with such organization or component in training or active service ordered or authorized by proper authority pursuant to law, whether for state or federal purposes, but not exceeding a total of 15 days in any calendar year. The state or political subdivision, municipal corporation, or other public agency shall allow the officer or employee to choose when during the calendar year to take the 15 days of paid military leave. The officer or employee may choose to use all of the 15 days of paid military leave at one time or, in the alternative, the 15 days of paid military leave may be divided and taken throughout the calendar year at the discretion of the officer or employee. Such leave shall be allowed only in case the required military or naval service is satisfactorily performed, which shall be presumed unless the contrary is established. Such leave shall not be allowed unless the officer or employee (1) returns to the public position immediately on being relieved from such military or naval service and not later than the expiration of the time herein limited for such leave, or (2) is prevented from so returning by physical or mental disability or other cause not due to the officer's or employee's own fault, or (3) is required by proper authority to continue in such military or naval service beyond the time herein limited for such leave.\n[Repealed, 1963 c 658 s 20]",
	"repealed": false
}