{
	"id": "353.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.34",
	"title": "353.34 RIGHTS UPON TERMINATION OF MEMBERSHIP.",
	"text": "(a) A former member is entitled to either a refund of accumulated employee deductions under subdivision 2, or to a deferred annuity under subdivision 3. Application for a refund may not be made before the date of termination of public service. A refund must be paid within 120 days following receipt of the application unless the applicant has again become a public employee required to be covered by the association.\n(b) If an individual was placed on layoff under section 353.01, subdivision 12 or 12c, a refund is not payable before termination of service under section 353.01, subdivision 11a.\n(c) An individual who terminates public service covered by the Public Employees Retirement Association general employees retirement plan, except members of the former Minneapolis Employees Retirement Fund under section 353.01, subdivision 2b, paragraph (d), the Public Employees Retirement Association police and fire retirement plan, or the public employees local government correctional service retirement plan, and who is employed by a different employer and who becomes an active member covered by one of the other two plans, may receive a refund of employee contributions plus annual compound interest from the plan from which the member terminated service at the applicable rate specified in subdivision 2.\n(d) Refunds payable to members of the former Minneapolis Employees Retirement Fund under section 353.01, subdivision 2a, paragraph (d), are governed by Minnesota Statutes 2008, chapter 422A.\n(a) Except as provided in subdivision 1, any person who ceases to be a member is entitled to receive a refund in an amount equal to accumulated deductions, less the sum of any disability benefits that have been paid by the fund, plus annual compound interest at the applicable rate or rates under paragraph (b) to the first day of the month in which the refund is processed.\n(b) Annual compound interest rates shall be as follows:\n(1) six percent to June 30, 2011;\n(2) four percent after June 30, 2011, to June 30, 2018; and\n(3) three percent after June 30, 2018.\n(c) If a person repays a refund and subsequently applies for another refund, the repayment amount, including interest, is added to the fiscal year balance in which the repayment was made.\n(d) If the refund payable to a member is based on employee deductions that are determined to be invalid under section 353.27, subdivision 7, the interest payable on the invalid employee deductions is annual compound interest at the applicable rate or rates under paragraph (b).\n(a) A member who is partially or 100 percent vested under section 353.01, subdivision 47, when termination of public service or termination of membership occurs has the option of leaving the member's accumulated deductions in the fund and being entitled to a deferred retirement annuity commencing at normal retirement age or to a deferred early retirement annuity under section 353.30, subdivision 1a, 1b, 1c, or 5.\n(b) The deferred annuity must be computed under section 353.29, subdivision 3, on the basis of the law in effect on the date of termination of public service or termination of membership, whichever is later, and, if the later of termination of public service or termination of membership is on or before December 31, 2011, the deferred annuity must be augmented as provided in paragraphs (c) to (e).\n(c) The deferred annuity of any former member must be augmented from the first day of the month following the termination of active service, or July 1, 1971, whichever is later, to the effective date of retirement or, if earlier, December 31, 2018.\n(d) For a person who became a public employee before July 1, 2006, and who has a termination of public service before January 1, 2012, the deferred annuity must be augmented at the following rate or rates, compounded annually:\n(1) five percent until January 1, 1981;\n(2) three percent from January 1, 1981, until January 1 of the year following the year in which the former member attains age 55 or December 31, 2011, whichever is earlier;\n(3) five percent from January 1 of the year following the year in which the former member attains age 55, or December 31, 2011, whichever is earlier;\n(4) one percent from January 1, 2012, until December 31, 2018; and\n(5) after December 31, 2018, the deferred annuity must not be augmented.\n(e) For a person who became a public employee after June 30, 2006, and who has a termination of public service before January 1, 2012, the deferred annuity must be augmented at the following rate or rates, compounded annually:\n(1) 2.5 percent until December 31, 2011;\n(2) one percent from January 1, 2012, until December 31, 2018; and\n(3) after December 31, 2018, the deferred annuity must not be augmented.\n(f) For a person who has a termination of public service after December 31, 2011, the deferred annuity must not be augmented.\n(g) The retirement annuity or disability benefit of, or the survivor benefit payable on behalf of, a former member who terminated service before July 1, 1997, or the survivor benefit payable on behalf of a basic or police and fire member who was receiving disability benefits before July 1, 1997, which is first payable after June 30, 1997, must be increased on an actuarial equivalent basis to reflect the change in the investment return actuarial assumption under section 356.215, subdivision 8, from five percent to six percent under a calculation procedure and tables adopted by the board and approved by the actuary retained under section 356.214.\n(h) A former member qualified to apply for a deferred retirement annuity may revoke this option at any time before the commencement of deferred annuity payments by making application for a refund. The person is entitled to a refund of accumulated member contributions within 30 days following date of receipt of the application by the executive director.\nAny member employed by a public hospital, as defined in section 355.01, subdivision 3k, who has at least three years of allowable service credit on the date the public hospital is taken over by a private corporation or organization, may elect to receive a deferred annuity pursuant to subdivision 3 notwithstanding the length of service requirement contained therein.\n[Repealed, 1Sp2005 c 8 art 10 s 81]\n(a) If a person who is entitled to an annuity has more than one period of uninterrupted service, the person is entitled to augmentation under subdivision 3, applied to each period of uninterrupted service. The average salary used to calculate the annuity for each period of uninterrupted service must be applied as if the person was a new employee at the beginning of each period of uninterrupted service. The actuarial assumptions used to calculate the annuity must be those in effect on the effective date of retirement.\n(b) For the purpose of this subdivision, \"uninterrupted service\" means periods of covered employment during which the person has not been separated from public service for more than two years.\n(c) If a person repays a refund, the restored service must be considered as continuous with the next period of service for which the person has credit with the association.\n(d) This subdivision applies to persons who become deferred annuitants on or after July 1, 1971. For a person who became a deferred annuitant before July 1, 1971, the paragraph applies from July 1, 1971, if the former active member applies for an annuity after July 1, 1973.\n(e) This subdivision must not reduce the annuity otherwise payable under this chapter.\n[Repealed, 1971 c 106 s 40]\nThe right to a refund provided in this chapter, and laws amendatory thereof, is not restricted as to time unless specifically provided and the statute of limitation does not apply thereto.\nMS 2016 [Repealed, 2018 c 211 art 17 s 3]\n[Repealed, 2007 c 134 art 2 s 50]",
	"repealed": false
}