{
	"id": "219.995",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.995",
	"title": "219.995 RAILROAD PEACE OFFICERS.",
	"text": "A railroad that intends to employ railroad peace officers as defined in section 626.84, subdivision 1, paragraph (h), shall appoint a chief law enforcement officer to oversee and take responsibility for all railroad peace officers employed by the railroad. The chief law enforcement officer of a railroad company must be a Minnesota-licensed peace officer. Before appointing a railroad chief law enforcement officer, the railroad must submit a request for license for a license-eligible applicant, or a notice of appointment for an officer already licensed in Minnesota, to the Board of Peace Officer Standards and Training attesting that the appointee has met all education, training, and minimum selection standards in Minnesota Rules, chapter 6700. The appointee may not exercise peace officer powers until the request for license or notification form is received and approved by the board.\nAfter appointing a railroad chief law enforcement officer, a railroad may employ railroad peace officers to aid and supplement law enforcement agencies in the protection of property owned by or in the care, custody, or control of a railroad and to protect the persons and property of railroad passengers and employees.\nA railroad company that employs railroad peace officers must cooperate with the Board of Peace Officer Standards and Training with respect to the board's authority to oversee peace officer licensing. Upon request by the board, a railroad company that employs railroad peace officers must share or produce any public, private, or confidential data that the board has the authority to request from other state and local law enforcement agencies. Failure by the railroad company to comply with the board's exercise of its regulatory and oversight authority may result in implementation of sanctions as described in subdivision 7.\nA railroad chief law enforcement officer has the same duties and responsibilities as the chief law enforcement officer of any state or local law enforcement agency, including but not limited to appointing and supervising peace officers, ensuring ongoing continuing education of peace officers, maintaining agency and peace officer records, reporting misconduct and policy compliance, and any other duty or responsibility described in chapter 626 or Minnesota Rules, chapter 6700.\n(a) Except as otherwise provided by this section, a railroad peace officer has all powers and privileges of a licensed peace officer in this state in connection with the prevention, investigation, arrest, or prosecution of an offense occurring on railroad property and involving injury to passengers or employees of a railroad or involving an offense against property owned by or in the care, custody, or control of a railroad. A railroad peace officer's law enforcement powers shall apply only on railroad property, except that an officer may exercise the authority given to peace officers under section 629.40, subdivisions 2 and 4. If a search warrant is obtained by a railroad peace officer, the officer shall notify the chief of police of an organized full-time police department of the municipality or, if there is no local chief of police, the sheriff or a deputy sheriff of the county in which service of the warrant is to be made, prior to execution.\n(b) A railroad must not direct, require, or allow a railroad peace officer to enforce a railroad's rules, policies, or procedures that are unrelated to the commission of a criminal offense, or investigate any matter involving civil litigation by or against a railroad. A railroad company that employs railroad peace officers must adopt or update any applicable policy to be consistent with this paragraph and must provide a copy of the policy to the representatives of any labor organization that represents employees of the railroad, including but not limited to any labor organization subject to the Federal Railway Labor Act. Notwithstanding any law to the contrary, a railroad peace officer who makes a representation of being a peace officer and performs or attempts to perform any of those acts is subject to discipline as if the peace officer violated the standards of conduct set forth in Minnesota Rules, chapter 6700.\nThe Board of Peace Officer Standards and Training shall license railroad peace officers appointed by the railroad's chief law enforcement officer under subdivision 1 who meet the board's standards for peace officer licensure under chapter 626 and Minnesota Rules, chapter 6700. Except as otherwise provided in this section, railroad peace officers are subject to all of the provisions applicable to peace officers under chapter 626 and Minnesota Rules, chapter 6700.\nAt the sole discretion of the Board of Peace Officer Standards and Training, the board may immediately suspend or revoke the license of the chief law enforcement officer of a railroad company for any reason within the board's jurisdiction. If the board suspends or revokes the license of the chief law enforcement officer, the railroad's law enforcement agency shall be deemed disbanded and the licenses of all peace officers on the railroad agency roster will be placed in inactive status. The requirement to place a peace officer's license in inactive status does not apply to a railroad peace officer who also works as a licensed peace officer for a different law enforcement agency in Minnesota, but such an officer must no longer be designated a railroad peace officer. Except as noted in this section, the licenses of railroad peace officers are subject to the requirements, restrictions, and disciplinary procedures that apply to any other licensed peace officer.\n(a) A railroad peace officer shall be compensated by the railroad by which the officer is employed.\n(b) A railroad peace officer is not entitled to receive any compensation, benefits, or other remuneration provided or required to be provided to other licensed peace officers by this state or any political subdivision or agency of this state.\n(c) A railroad peace officer may attend any training course offered to peace officers of this state, provided that railroad peace officers pay reasonable tuition and costs.\nA railroad company employing a railroad peace officer in this state is liable for all acts, errors, and omissions of a railroad peace officer occurring in the course and scope of the peace officer's employment by the railroad and shall indemnify its peace officers for civil damages, penalties, or fines claimed or levied against the officer according to section 181.970. Neither this state nor any political subdivision or agency of the state is liable for any act, error, or omission of a railroad peace officer.\nNothing in this section shall be construed to limit or in any way restrict the rights, powers, or privileges granted to a peace officer in this state who is not a railroad peace officer.",
	"repealed": false
}