{
	"id": "297I.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.20",
	"title": "297I.20 OFFSETS AGAINST PREMIUM TAXES.",
	"text": "(a) An insurance company or health maintenance organization may offset against its premium tax liability to this state any amount paid for assessments made for insolvencies under sections 60C.01 to 60C.22; and any amount paid for assessments under sections 61B.18 to 61B.32 as follows:\n(1) Each such assessment shall give rise to an amount of offset equal to 20 percent of the amount of the assessment for each of the five calendar years following the year in which the assessment was paid.\n(2) The amount of offset initially determined for each taxable year is the sum of the amounts determined under clause (1) for that taxable year.\n(b)(1) Each year the commissioner shall compare total guaranty association assessments levied over the preceding five calendar years to the sum of all premium tax and corporate franchise tax revenues collected from insurance companies and health maintenance organizations, without reduction for any guaranty association assessment offset in the preceding calendar year, referred to in this subdivision as \"preceding year insurance tax revenues.\"\n(2) If total guaranty association assessments levied over the preceding five years exceed the preceding year insurance tax revenues, insurance companies and health maintenance organizations must be allowed only a proportionate part of the premium tax offset calculated under paragraph (a) for the current calendar year.\n(3) The proportionate part of the premium tax offset allowed in the current calendar year is determined by multiplying the amount calculated under paragraph (a) by a fraction. The numerator of the fraction equals the preceding year insurance tax revenues, and its denominator equals total guaranty association assessments levied over the preceding five-year period.\n(4) The proportionate part of the premium tax offset that is not allowed must be carried forward to subsequent tax years and added to the amount of premium tax offset calculated under paragraph (a) prior to application of the limitation imposed by this paragraph.\n(5) Any amount carried forward from prior years must be allowed before allowance of the offset for the current year calculated under paragraph (a).\n(6) The premium tax offset limitation must be calculated separately for (i) insurance companies subject to assessment under sections 60C.01 to 60C.22, and (ii) insurance companies or health maintenance organizations subject to assessment under sections 61B.18 to 61B.32.\n(7) When the premium tax offset is limited by this provision, the commissioner shall notify affected insurance companies or health maintenance organizations on a timely basis for purposes of completing premium and corporate franchise tax returns.\n(8) The guaranty associations created under sections 60C.01 to 60C.22 and 61B.18 to 61B.32 shall provide the commissioner with the necessary information on guaranty association assessments.\n(c)(1) If the offset determined by the application of paragraphs (a) and (b) exceeds the insurance company's or health maintenance organization's premium tax liability under this section prior to allowance of the credit for premium taxes, then the insurance company or health maintenance organization may carry forward the excess, referred to in this subdivision as the \"carryforward credit\" to subsequent taxable years.\n(2) The carryforward credit is allowed as an offset against premium tax liability for the first succeeding year to the extent that the premium tax liability for that year exceeds the amount of the allowable offset for the year determined under paragraphs (a) and (b).\n(3) The carryforward credit must be reduced, but not below zero, by the amount of the carryforward credit allowed as an offset against the premium tax under this paragraph. The remainder, if any, of the carryforward credit must be carried forward to succeeding taxable years until the entire carryforward credit has been credited against the insurance company's or health maintenance organization's liability for premium tax under this chapter if applicable for that taxable year.\n(d) When an insurer or health maintenance organization has offset against taxes its payment of an assessment of the Minnesota Life and Health Guaranty Association, and the association pays the insurer or health maintenance organization a refund with respect to the assessment under section 61B.24, subdivision 6, then the refund reduces the insurer's or health maintenance organization's carryforward credit under paragraph (c). If the refund exceeds the amount of the carryforward credit, the excess amount must be repaid to the state by the insurers or health maintenance organizations to the extent of the offset in the manner the commissioner requires.\nAn insurance company may offset against its premium tax liability to this state any amount paid for an assessment made pursuant to section 62I.06, subdivision 6. The offset against premium tax liability must be claimed beginning with the taxable year that the assessment is paid. To the extent that the allowable offset exceeds the tax liability, the remaining offset must be carried forward to succeeding taxable years until the entire offset has been credited against the insurance company's liability for premium tax under this chapter.\nAn insurance company may claim a credit against the premiums tax imposed under this chapter equal to the amount of the credit certificate issued to it, or to a person who has assigned the credit to the insurance company, under section 290.0681. If the amount of the credit exceeds the liability for tax under this chapter, the commissioner shall refund the excess to the insurance company. An amount sufficient to pay the refunds under this section is appropriated to the commissioner from the general fund. This credit does not affect the calculation of fire state aid under section 477B.03 and police state aid under section 477C.03.\n(a) A taxpayer may claim a credit against the premiums tax imposed under this chapter equal to the amount indicated on the credit certificate statement issued to the company under section 116U.27. If the amount of the credit exceeds the taxpayer's liability for tax under this chapter, the excess is a credit carryover to each of the five succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. This credit does not affect the calculation of fire state aid under section 477B.03 and police state aid under section 477C.03.\n(b) This subdivision expires January 1, 2025, for taxable years beginning after and premiums received after December 31, 2024.\nA taxpayer may claim a credit against the premiums tax imposed under this chapter equal to the amount indicated on the credit certificate statement issued to the taxpayer under section 290.0683. If the amount of the credit exceeds the liability for tax under this chapter, the excess is a credit carryover to each of the ten succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. This credit does not affect the calculation of fire state aid under section 477B.03 and police state aid under section 477C.03.\n[See Note.]\nA taxpayer may claim a credit against the premiums tax imposed under this chapter equal to the amount indicated on the credit certificate statement issued to the company under section 290.0695, provided that the taxpayer is not also claiming a credit under that section for the same qualified railroad reconstruction or replacement expenditures. If the amount of the credit exceeds the taxpayer's liability for tax under this chapter, the excess is a credit carryover to each of the five succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. This credit does not affect the calculation of fire state aid under section 477B.03 and police state aid under section 477C.03. This subdivision expires January 1, 2031, for taxable years beginning after December 31, 2030.",
	"repealed": false
}