{
	"id": "299F.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.036",
	"title": "299F.036 FIREFIGHTER; PREVIOUS EMPLOYMENT INVESTIGATION.",
	"text": "The fire chief or administrative head of a fire department as defined under section 299F.092, subdivision 6, may conduct a previous employment investigation on an applicant for a fire protection service position.\n(a) Upon request of a fire chief or an administrative head, an employer shall disclose or otherwise make available for inspection employment information of an employee or former employee who is the subject of an investigation under subdivision 1. The request for disclosure of employment information must be in writing, must be accompanied by an original authorization and release signed by the employee or former employee, and must be signed by the fire chief or administrative head conducting the previous employment investigation.\n(b) Upon request, the fire chief or administrative head shall disclose to the applicant the information obtained under this subdivision.\nIf an employer refuses to disclose employment information in accordance with this section, upon request the district court may issue an ex parte order directing the disclosure of the employment information. The request must be made by the fire chief or administrative head conducting the investigation and must include a copy of the original request for disclosure made upon the employer or former employer and the authorization and release signed by the employee or former employee. The request must be signed by the fire chief or administrative head requesting the order and an attorney representing the state or the political subdivision on whose behalf the investigation is being conducted. It is not necessary for the request or the order to be filed with the court administrator. Failure to comply with the court order subjects the person who fails to comply to civil or criminal contempt of court.\nIn the absence of fraud or malice, an employer is immune from civil liability for employment information released to a fire department under this section, or for any subsequent publication made by the employee or former employee of information released to a fire department under this section.\nIf employment information is subject to a confidentiality agreement between the employee or former employee and the employer, the employer shall disclose the fact that such an agreement exists. If the employee or former employee has authorized the release of employment information without regard to any previous agreement to the contrary, the employer shall also disclose the employment information according to subdivision 2. If employment information is sealed or otherwise subject to a nondisclosure order by a court of competent jurisdiction, the employer shall disclose the fact that this order exists, along with information identifying the court and court's file number.\nFor purposes of this section, \"employment information\" means written information in connection with job applications, performance evaluations, attendance records, disciplinary actions, and eligibility for rehire.\nFor purposes of this section, \"employer\" does not include an entity that is subject to chapter 13.",
	"repealed": false
}