{
	"id": "10A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.01",
	"title": "10A.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them unless the context clearly indicates otherwise.\n\"Administrative action\" means an action by any official, board, commission or agency of the executive branch to adopt, amend, or repeal a rule under chapter 14. \"Administrative action\" does not include the application or administration of an adopted rule, except in cases of rate setting, power plant and powerline siting, and granting of certificates of need under section 216B.243.\n\"Advance of credit\" means any money owed for goods provided or services rendered. \"Advance of credit\" does not mean a loan as defined in subdivision 20.\n\"Approved expenditure\" means an expenditure made on behalf of a candidate or a local candidate by an entity other than the candidate's principal campaign committee or the local candidate, if the expenditure is made with the authorization or expressed or implied consent of, or in cooperation or in concert with, or at the request or suggestion of the candidate or local candidate, the candidate's principal campaign committee, or the candidate's or local candidate's agent. An approved expenditure is a contribution to that candidate or local candidate.\n(a) \"Associated business\" means an association, corporation, partnership, limited liability company, limited liability partnership, or other organized legal entity from which the individual or the individual's spouse receives compensation in excess of $250, except for actual and reasonable expenses, in any month during the reporting period as a director, officer, owner, member, partner, employer or employee, or whose securities the individual or the individual's spouse holds worth more than $10,000 at fair market value.\n(b) Associated business also means a lobbyist, principal, or interested person by whom the individual is compensated in excess of $250, except for actual and reasonable expenses, in any month for providing services as an independent contractor or consultant. If an individual is compensated by a person or association for providing services to a lobbyist, principal, or interested person, associated business includes both the person or association that pays the compensation and the lobbyist, principal, or interested person to whom the services are provided.\n(c) \"Interested person\" means a person or a representative of a person or association that has a direct financial interest in a decision that the individual receiving the compensation is authorized to make as a public or local official or will be authorized to make if the individual becomes a public or local official. To be direct, the financial interest of the person or association paying the compensation to the individual must be of greater consequence to the payer than the general interest of other residents or taxpayers of the individual's governmental unit.\n\"Association\" means a group of two or more persons, who are not all members of an immediate family, acting in concert.\n\"Ballot question\" means a question or proposition that is placed on the ballot and that may be voted on by:\n(1) all voters of the state; or\n(2) all voters of a county, city, school district, township, or special district.\n\"Promoting or defeating a ballot question\" includes activities, other than lobbying activities, related to qualifying the question for placement on the ballot.\n[Repealed by amendment, 1999 c 220 s 1]\n[Renumbered subd 13]\n\"Ballot question political committee\" means a political committee that makes only expenditures to promote or defeat a ballot question and disbursements permitted under section 10A.121, subdivision 1.\n\"Ballot question political fund\" means a political fund that makes only expenditures to promote or defeat a ballot question and disbursements permitted under section 10A.121, subdivision 1.\n\"Board\" means the state Campaign Finance and Public Disclosure Board.\n\"Campaign expenditure\" or \"expenditure\" means a purchase or payment of money or anything of value, or an advance of credit, made or incurred for the purpose of influencing the nomination or election of a candidate or a local candidate or for the purpose of promoting or defeating a ballot question.\nAn expenditure is considered to be made in the year in which the candidate made the purchase of goods or services or incurred an obligation to pay for goods or services.\nAn expenditure made for the purpose of defeating a candidate or a local candidate is considered made for the purpose of influencing the nomination or election of that candidate or local candidate or any opponent of that candidate or local candidate.\nExcept as provided in clause (1), \"expenditure\" includes the dollar value of a donation in kind.\n\"Expenditure\" does not include:\n(1) noncampaign disbursements as defined in subdivision 26;\n(2) services provided without compensation by an individual volunteering personal time on behalf of a candidate or a local candidate, ballot question, political committee, political fund, principal campaign committee, or party unit;\n(3) the publishing or broadcasting of news items or editorial comments by the news media; or\n(4) an individual's unreimbursed personal use of an automobile owned by the individual and used by the individual while volunteering personal time.\n[Renumbered subd 16]\n\"Candidate\" means an individual who seeks nomination or election as a state constitutional officer, legislator, or judge. An individual is deemed to seek nomination or election if the individual has taken the action necessary under the law of this state to qualify for nomination or election, has received contributions or made expenditures in excess of $750, or has given implicit or explicit consent for any other person to receive contributions or make expenditures in excess of $750, for the purpose of bringing about the individual's nomination or election. A candidate remains a candidate until the candidate's principal campaign committee is dissolved as provided in section 10A.243.\n[Renumbered subd 4]\n[Renumbered subd 18]\n[Renumbered subd 26]\n\"Local candidate\" means an individual who seeks nomination or election to a county, city, school district, township, or special district office.\n(a) \"Contribution\" means money, a negotiable instrument, or a donation in kind that is given to a political committee, political fund, principal campaign committee, local candidate, or party unit. An allocation by an association of general treasury money to be used for activities that must be or are reported through the association's political fund is considered to be a contribution for the purposes of disclosure required by this chapter.\n(b) \"Contribution\" includes a loan or advance of credit to a political committee, political fund, principal campaign committee, local candidate, or party unit, if the loan or advance of credit is: (1) forgiven; or (2) repaid by an individual or an association other than the political committee, political fund, principal campaign committee, local candidate, or party unit to which the loan or advance of credit was made. If an advance of credit or a loan is forgiven or repaid as provided in this paragraph, it is a contribution in the year in which the loan or advance of credit was made.\n(c) \"Contribution\" does not include services provided without compensation by an individual volunteering personal time on behalf of a candidate, local candidate, ballot question, political committee, political fund, principal campaign committee, or party unit; the publishing or broadcasting of news items or editorial comments by the news media; or an individual's unreimbursed personal use of an automobile owned by the individual while volunteering personal time.\n\"Depository\" means a bank, savings association, or credit union organized under federal or state law and transacting business within this state. The depositories of a political committee or political fund include any depository in which the committee or fund has a savings, checking, or similar account, or purchases a money market certificate or certificate of deposit.\n\"Designated lobbyist\" means the lobbyist responsible for reporting the lobbying disbursements and activity of the entity the lobbyist represents.\n\"Donation in kind\" means anything of value that is given, other than money or negotiable instruments. An approved expenditure is a donation in kind.\n[Repealed, 1976 c 307 s 35]\n\"Election\" means a primary, special primary, general, or special election.\n\"Election cycle\" means the period from January 1 following a general election for an office to December 31 following the next general election for that office, except that \"election cycle\" for a special election means the period from the date the special election writ is issued to 15 days after the special election is held. For a regular election, the period from January 1 of the year prior to an election year through December 31 of the election year is the \"election segment\" of the election cycle. Each other two-year segment of an election cycle is a \"nonelection segment\" of the election cycle. An election cycle that consists of two calendar years has only an election segment. The election segment of a special election cycle includes the entire special election cycle.\n\"Expressly advocating\" means that a communication:\n(1) clearly identifies a candidate or a local candidate and uses words or phrases of express advocacy; or\n(2) when taken as a whole and with limited reference to external events, such as the proximity to the election, could only be interpreted by a reasonable person as containing advocacy of the election or defeat of one or more clearly identified candidates because:\n(i) the electoral portion of the communication is unmistakable, unambiguous, and suggestive of only one meaning; and\n(ii) reasonable minds could not differ as to whether the communication encourages actions to elect or defeat one or more clearly identified candidates or encourages some other kind of action.\n\"Employee of a political subdivision\" includes an individual hired or appointed by the political subdivision. An individual is also an employee of a political subdivision if the individual is:\n(1) hired to provide the political subdivision services as a consultant or independent contractor; or\n(2) employed by a business that has contracted with the political subdivision to provide legal counsel, professional services, or policy recommendations to the political subdivision.\n\"Financial institution\" means a lending institution chartered by an agency of the federal government or regulated by the commissioner of commerce.\n[Renumbered subd 30]\n[Renumbered subd 34]\n\"General treasury money\" means money that an association other than a principal campaign committee, party unit, or political committee accumulates through membership dues and fees, donations to the association for its general purposes, and income from the operation of a business. General treasury money does not include money collected to influence the nomination or election of candidates or local candidates or to promote or defeat a ballot question.\n\"General lobbying category\" means an area of interest for lobbying for an entity that is on a list of categories specified by the board.\n\"Independent expenditure\" means an expenditure expressly advocating the election or defeat of a clearly identified candidate or local candidate, if the expenditure is made without the express or implied consent, authorization, or cooperation of, and not in concert with or at the request or suggestion of, any candidate or any candidate's principal campaign committee or agent or any local candidate or local candidate's agent. An independent expenditure is not a contribution to that candidate or local candidate. An independent expenditure does not include the act of announcing a formal public endorsement of a candidate or local candidate for public office, unless the act is simultaneously accompanied by an expenditure that would otherwise qualify as an independent expenditure under this subdivision.\n\"Independent expenditure political committee\" means a political committee that makes only independent expenditures and disbursements permitted under section 10A.121, subdivision 1.\n\"Independent expenditure political fund\" means a political fund that makes only independent expenditures and disbursements permitted under section 10A.121, subdivision 1.\n[Repealed by amendment, 1999 c 220 s 1]\n\"Legislative action\" means any of the following:\n(1) the development of prospective legislation, including the development of amendment language to prospective legislation;\n(2) the review, modification, adoption, or rejection by a member of the legislature or an employee of the legislature, if applicable, of any (i) bill, (ii) amendment, (iii) resolution, (iv) confirmation considered by the legislature, or (v) report;\n(3) the development of, in conjunction with a constitutional officer, prospective legislation or a request for support or opposition to introduced legislation; and\n(4) the action of the governor in approving or vetoing any act of the legislature or portion of an act of the legislature.\n\"Loan\" means an advance of money or anything of value made to a political committee, political fund, principal campaign committee, local candidate, or party unit.\n(a) \"Lobbyist\" means an individual:\n(1) engaged for pay or other consideration of more than $3,000 from all sources in any year:\n(i) for the purpose of attempting to influence legislative or administrative action, or the official action of a political subdivision, by communicating with public or local officials; or\n(ii) from a business whose primary source of revenue is derived from facilitating government relations or government affairs services if the individual's job duties include offering direct or indirect consulting or advice that helps the business provide those services to clients; or\n(2) who spends more than $3,000 of the individual's personal funds, not including the individual's own traveling expenses and membership dues, in any year for the purpose of attempting to influence legislative or administrative action, or the official action of a political subdivision, by communicating with public or local officials.\n(b) \"Lobbyist\" does not include:\n(1) a public official;\n(2) an employee of the state, including an employee of any of the public higher education systems;\n(3) an elected local official;\n(4) a nonelected local official or an employee of a political subdivision acting in an official capacity, unless the nonelected official or employee of a political subdivision spends more than 50 hours in any month attempting to influence legislative or administrative action, or the official action of a political subdivision other than the political subdivision employing the official or employee, by communicating or urging others to communicate with public or local officials, including time spent monitoring legislative or administrative action, or the official action of a political subdivision, and related research, analysis, and compilation and dissemination of information relating to legislative or administrative policy in this state, or to the policies of political subdivisions;\n(5) a party or the party's representative appearing in a proceeding before a state board, commission, or agency of the executive branch unless the board, commission, or agency is taking administrative action;\n(6) an individual while engaged in selling goods or services to be paid for by public funds;\n(7) a news medium or its employees or agents while engaged in the publishing or broadcasting of news items, editorial comments, or paid advertisements which directly or indirectly urge official action;\n(8) a paid expert witness whose testimony is requested by the body before which the witness is appearing, but only to the extent of preparing or delivering testimony;\n(9) a party or the party's representative appearing to present a claim to the legislature and communicating to legislators only by the filing of a claim form and supporting documents and by appearing at public hearings on the claim; or\n(10) an individual providing information or advice to members of a collective bargaining unit when the unit is actively engaged in the collective bargaining process with a state agency or a political subdivision.\n(c) An individual who volunteers personal time to work without pay or other consideration on a lobbying campaign, and who does not spend more than the limit in paragraph (a), clause (2), need not register as a lobbyist.\n(d) An individual who provides administrative support to a lobbyist and whose salary and administrative expenses attributable to lobbying activities are reported as lobbying expenses by the lobbyist, but who does not communicate or urge others to communicate with public or local officials, need not register as a lobbyist.\n\"Local official\" means a person who holds elective office in a political subdivision or who is appointed to or employed in a public position in a political subdivision in which the person has authority to make, to recommend, or to vote on as a member of the governing body, major decisions regarding the expenditure or investment of public money.\n\"Major political party\" means a major political party as defined in section 200.02, subdivision 7.\n\"Metropolitan governmental unit\" means any of the seven counties in the metropolitan area as defined in section 473.121, subdivision 2, a regional railroad authority established by one or more of those counties under section 398A.03, a city with a population of over 50,000 located in the seven-county metropolitan area, the Metropolitan Council, or a metropolitan agency as defined in section 473.121, subdivision 5a.\n\"Minor political party\" means a minor political party as defined in section 200.02, subdivision 23.\n(a) \"Noncampaign disbursement\" means a purchase or payment of money or anything of value made, or an advance of credit incurred, or a donation in kind received, by a principal campaign committee for any of the following purposes:\n(1) payment for accounting and legal services related to operating the candidate's campaign committee, serving in office, or security for the candidate or the candidate's immediate family, including but not limited to seeking and obtaining a harassment restraining order;\n(2) return of a contribution to the source;\n(3) repayment of a loan made to the principal campaign committee by that committee;\n(4) return of a public subsidy;\n(5) payment for food, beverages, and necessary utensils and supplies, entertainment, and facility rental for a fundraising event;\n(6) services for a constituent by a member of the legislature or a constitutional officer in the executive branch as provided in section 10A.173, subdivision 1;\n(7) payment for food and beverages consumed by a candidate or volunteers while they are engaged in campaign activities;\n(8) payment for food or a beverage consumed while attending a reception or meeting directly related to legislative duties;\n(9) payment of expenses incurred by elected or appointed leaders of a legislative caucus in carrying out their leadership responsibilities;\n(10) payment by a principal campaign committee of the candidate's expenses for serving in public office, other than for personal uses;\n(11) costs of child care for the candidate's children when campaigning;\n(12) fees paid to attend a campaign school;\n(13) costs of a postelection party during the election year when a candidate's name will no longer appear on a ballot or the general election is concluded, whichever occurs first;\n(14) interest on loans paid by a principal campaign committee on outstanding loans;\n(15) filing fees;\n(16) post-general election holiday or seasonal cards, thank-you notes, or advertisements in the news media mailed or published prior to the end of the election cycle;\n(17) the cost of campaign material purchased to replace defective campaign material, if the defective material is destroyed without being used;\n(18) contributions to a party unit;\n(19) payments for funeral gifts or memorials;\n(20) the cost of a magnet less than six inches in diameter containing legislator contact information and distributed to constituents;\n(21) costs associated with a candidate attending a political party state or national convention in this state;\n(22) other purchases or payments specified in board rules or advisory opinions as being for any purpose other than to influence the nomination or election of a candidate or to promote or defeat a ballot question;\n(23) costs paid to a third party for processing contributions made by a credit card, debit card, or electronic check;\n(24) costs paid by a candidate's principal campaign committee to support the candidate's participation in a recount of ballots affecting the candidate's election;\n(25) a contribution to a fund established to support a candidate's participation in a recount of ballots affecting that candidate's election;\n(26) costs paid by a candidate's principal campaign committee for a single reception given in honor of the candidate's retirement from public office after the filing period for affidavits of candidacy for that office has closed;\n(27) a donation from a terminating principal campaign committee to the state general fund;\n(28) a donation from a terminating principal campaign committee to a county obligated to incur special election expenses due to that candidate's resignation from state office;\n(29) during a period starting January 1 in the year following a general election and ending on December 31 of the year of general election, total payments of up to $3,000 for detection-related security monitoring expenses for a candidate, including home security hardware, maintenance of home security monitoring hardware, identity theft monitoring services, and credit monitoring services; and\n(30) costs paid to repair or replace campaign property that was: (i) lost or stolen, or (ii) damaged or defaced to such a degree that the property no longer serves its intended purpose. For purposes of this clause, campaign property includes but is not limited to campaign lawn signs. The candidate must document the need for these costs in writing or with photographs.\n(b) The board must determine whether an activity involves a noncampaign disbursement within the meaning of this subdivision.\n(c) A noncampaign disbursement is considered to be made in the year in which the candidate made the purchase of goods or services or incurred an obligation to pay for goods or services.\n\"Person\" means an individual, an association, a political subdivision, or a public higher education system.\n\"Official action of a political subdivision\" means any action that requires a vote or approval by one or more elected local officials while acting in their official capacity; or an action by an appointed or employed local official to make, to recommend, or to vote on as a member of the governing body, major decisions regarding the expenditure or investment of public money.\n\"Political committee\" means an association whose major purpose is to influence the nomination or election of one or more candidates or local candidates or to promote or defeat a ballot question, other than a principal campaign committee, local candidate, or a political party unit.\n\"Political fund\" means an accumulation of dues or voluntary contributions by an association other than a political committee, principal campaign committee, or party unit, if the accumulation is collected or expended to influence the nomination or election of one or more candidates or local candidates or to promote or defeat a ballot question. The term political fund as used in this chapter may also refer to the association acting through its political fund.\n\"Political party\" means a major political party or a minor political party. A political party is the aggregate of all its political party units in this state.\n\"Political party unit\" or \"party unit\" means the state committee, the party organization within a house of the legislature, or any other party organization designated by the chair of the political party in an annual certification of party units provided to the board.\n\"Political subdivision\" means the Metropolitan Council, a metropolitan agency as defined in section 473.121, subdivision 5a, or a municipality as defined in section 471.345, subdivision 1.\n\"Population\" means the population established by the most recent federal census, by a special census taken by the United States Bureau of the Census, by an estimate made by the Metropolitan Council, or by an estimate made by the state demographer under section 4A.02, whichever has the latest stated date of count or estimate.\nA prima facie determination is a determination that a complaint filed under section 10A.022, subdivision 3, is sufficient to allege a violation of this chapter or of those sections of chapter 211B listed in section 10A.022, subdivision 3.\n\"Principal\" means an individual or association that:\n(1) spends more than $3,000 in the aggregate in any calendar year to engage a lobbyist, compensate a lobbyist, or authorize the expenditure of money by a lobbyist; or\n(2) spends a total of at least $50,000 in any calendar year to influence legislative action, administrative action, or the official action of political subdivisions, as described in section 10A.04, subdivision 6.\n\"Principal campaign committee\" means a principal campaign committee formed under section 10A.105.\n\"Public official\" means any:\n(1) member of the legislature;\n(2) individual employed by the legislature as secretary of the senate, legislative auditor, director of the Legislative Budget Office, chief clerk of the house of representatives, revisor of statutes, or researcher, legislative analyst, fiscal analyst, or attorney in the Office of Senate Counsel, Research and Fiscal Analysis, House Research, or the House Fiscal Analysis Department;\n(3) constitutional officer in the executive branch and the officer's chief administrative deputy;\n(4) solicitor general or deputy, assistant, or special assistant attorney general;\n(5) commissioner, deputy commissioner, or assistant commissioner of any state department or agency as listed in section 15.01 or 15.06, or the state chief information officer;\n(6) member, chief administrative officer, or deputy chief administrative officer of a state board or commission that has either the power to adopt, amend, or repeal rules under chapter 14, or the power to adjudicate contested cases or appeals under chapter 14;\n(7) individual employed in the executive branch who is authorized to adopt, amend, or repeal rules under chapter 14 or adjudicate contested cases under chapter 14;\n(8) executive director of the State Board of Investment;\n(9) deputy of any official listed in clauses (7) and (8);\n(10) judge of the Workers' Compensation Court of Appeals;\n(11) administrative law judge or compensation judge in the State Office of Administrative Hearings or unemployment law judge in the Department of Employment and Economic Development;\n(12) member, regional administrator, division director, general counsel, or operations manager of the Metropolitan Council;\n(13) member or chief administrator of a metropolitan agency;\n(14) director of the Division of Alcohol and Gambling Enforcement in the Department of Public Safety;\n(15) member or executive director of the Higher Education Facilities Authority;\n(16) member of the board of directors or president of Enterprise Minnesota, Inc.;\n(17) member of the board of directors or executive director of the Minnesota State High School League;\n(18) member of the Minnesota Ballpark Authority established in section 473.755;\n(19) citizen member of the Legislative-Citizen Commission on Minnesota Resources;\n(20) manager of a watershed district, or member of a watershed management organization as defined under section 103B.205, subdivision 13;\n(21) supervisor of a soil and water conservation district;\n(22) director of Explore Minnesota Tourism;\n(23) citizen member of the Lessard-Sams Outdoor Heritage Council established in section 97A.056;\n(24) citizen member of the Clean Water Council established in section 114D.30;\n(25) member or chief executive of the Minnesota Sports Facilities Authority established in section 473J.07;\n(26) district court judge, appeals court judge, or supreme court justice;\n(27) county commissioner;\n(28) member of the Greater Minnesota Regional Parks and Trails Commission;\n(29) member of the Destination Medical Center Corporation established in section 469.41; or\n(30) chancellor or member of the Board of Trustees of the Minnesota State Colleges and Universities.\n(a) \"Securities\" means any stock, share, bond, warrant, option, pledge, note, mortgage, annuity, debenture, lease, or commercial paper in any corporation, partnership, trust, or other association.\n(b) Securities do not include deposits in a savings account; certificates of deposit; money market certificates; treasury bills; treasury bonds; treasury notes; dividends from securities; shares in a mutual fund; shares in an exchange traded fund; or the underlying holdings owned by an annuity or in a defined benefit pension plan. For beneficiaries of a blind trust, securities do not include the underlying assets owned by the blind trust.\n\"Services for a constituent\" or \"constituent services\" means services performed or provided by an incumbent legislator or constitutional officer for the benefit of one or more residents of the official's district, but does not include gifts, congratulatory advertisements, or charitable contributions.\n\"Specific subject of interest\" means a particular topic or area of lobbying interest within a general lobbying category.\n\"State committee\" means the organization that, by virtue of the bylaws of a political party, is responsible for the day-to-day operation of the political party at the state level.\n\"Virtual currency\" means any digital currency which is only available in an electronic form and not as a physical form of money. Virtual currency functions as a medium of exchange, units of account, or a store of value. Virtual currency includes cryptocurrencies. Virtual currency does not include currencies issued by a government.",
	"repealed": false
}