{
	"id": "62D.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.14",
	"title": "62D.14 EXAMINATIONS.",
	"text": "The commissioner of health may make an examination of the affairs of any health maintenance organization and its contracts, agreements, or other arrangements with any participating entity as often as the commissioner of health deems necessary for the protection of the interests of the people of this state, but not less frequently than once every five years. Examinations of participating entities pursuant to this subdivision shall be limited to their dealings with the health maintenance organization and its enrollees, except that examinations of major participating entities may include inspection of the entity's financial statements kept in the ordinary course of business. The commissioner may require major participating entities to submit the financial statements directly to the commissioner. Financial statements of major participating entities are subject to the provisions of section 13.37, subdivision 1, clause (b), upon request of the major participating entity or the health maintenance organization with which it contracts.\nThe commissioner will notify the organization and any involved participating entity in writing when an examination has been initiated. The commissioner will include in this notice a full statement of the pertinent facts and of the matters being examined, and may include a statement that the organization or participating entity must submit to the commissioner within 30 days from the date of the notice a complete written report concerning those matters.\nIn order to accomplish the duties under this section with respect to the dealings of the participating entities with the health maintenance organization, the commissioner of health shall have the right to:\n(1) inspect or otherwise evaluate the quality, appropriateness, and timeliness of services performed;\n(2) audit and inspect any books and records of a health maintenance organization and a participating entity which pertain to services performed and determinations of amounts payable under such contract;\n(3) require persons or organizations under examination to be deposed and to answer interrogatories, regardless of whether an administrative hearing or other civil proceeding has been or will be initiated; and\n(4) employ site visits, public hearings, or any other procedures considered appropriate to obtain the information necessary to determine the issues.\n[Repealed, 2000 c 468 s 33]\nAny data or information obtained by the commissioner under this section or section 62D.145 shall be classified as private data on individuals as defined in chapter 13. Such data shall be protected and may be released consistent with the provisions of section 60A.03, subdivision 9.\nThe commissioner of health shall have the power to administer oaths to and examine witnesses, and to issue subpoenas.\nReasonable expenses of examinations under this section shall be assessed by the commissioner of health against the organization being examined, and shall be remitted to the commissioner of health for deposit in the general fund of the state treasury.\nFailure to provide relevant information necessary for conducting examinations pursuant to this section shall be subject to the levy of a fine up to $200 for each day the information is not provided. A fine levied under this subdivision shall be subject to the contested case and judicial review provisions of chapter 14. In the event a timely request for review is made, accrual of a fine levied shall be stayed pending completion of the contested case and judicial review proceeding.",
	"repealed": false
}