{
	"id": "245A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.65",
	"title": "245A.65 MALTREATMENT OF VULNERABLE ADULTS.",
	"text": "All license holders serving vulnerable adults shall establish and enforce written policies and procedures related to suspected or alleged maltreatment, and shall orient clients and mandated reporters who are under the control of the license holder to these procedures, as defined in section 626.5572, subdivision 16.\n(a) License holders must establish policies and procedures allowing but not mandating the internal reporting of alleged or suspected maltreatment. License holders shall ensure that the policies and procedures on internal reporting:\n(1) meet all the requirements identified for the optional internal reporting policies and procedures in section 626.557, subdivision 4a; and\n(2) identify the primary and secondary person or position to whom internal reports may be made and the primary and secondary person or position responsible for forwarding internal reports to the common entry point as defined in section 626.5572, subdivision 5. The secondary person must be involved when there is reason to believe that the primary person was involved in the alleged or suspected maltreatment.\n(b) The license holder shall:\n(1) establish and maintain policies and procedures to ensure that an internal review is completed within 30 calendar days and that corrective action is taken as necessary to protect the health and safety of vulnerable adults when the facility has reason to know that an internal or external report of alleged or suspected maltreatment has been made. The review must include an evaluation of whether related policies and procedures were followed, whether the policies and procedures were adequate, whether there is a need for additional staff training, whether the reported event is similar to past events with the vulnerable adults or the services involved, and whether there is a need for corrective action by the license holder to protect the health and safety of vulnerable adults. Based on the results of this review, the license holder must develop, document, and implement a corrective action plan designed to correct current lapses and prevent future lapses in performance by individuals or the license holder, if any;\n(2) identify the primary and secondary person or position who will ensure that, when required, internal reviews are completed. The secondary person shall be involved when there is reason to believe that the primary person was involved in the alleged or suspected maltreatment; and\n(3) document and make internal reviews accessible to the commissioner immediately upon the commissioner's request. For the purposes of this section, the documentation provided to the commissioner by the license holder may consist of a completed checklist that verifies completion of each of the requirements of the review.\n(c) The license holder shall provide an orientation to the internal and external reporting procedures to all persons receiving services. The orientation shall include the telephone number for the license holder's common entry point as defined in section 626.5572, subdivision 5. If applicable, the person's legal representative must be notified of the orientation. The program shall provide this orientation for each new person within 24 hours of admission, or for persons who would benefit more from a later orientation, the orientation may take place within 72 hours.\n(d) The license holder shall post a copy of the internal and external reporting policies and procedures, including the telephone number of the common entry point as defined in section 626.5572, subdivision 5, in a prominent location in the program and have it available upon request to mandated reporters, persons receiving services, and the person's legal representatives.\n(a) A license holder that provides services to adults who are excluded from the definition of vulnerable adult under section 626.5572, subdivision 21, paragraph (a), clause (2), must determine whether the person is a vulnerable adult under section 626.5572, subdivision 21, paragraph (a), clause (4). This determination must be made within 24 hours of:\n(1) admission to the licensed program; and\n(2) any incident that:\n(i) was reported under section 626.557; or\n(ii) would have been required to be reported under section 626.557, if one or more of the adults involved in the incident had been vulnerable adults.\n(b) Upon determining that a person receiving services is a vulnerable adult under section 626.5572, subdivision 21, paragraph (a), clause (4), all requirements relative to vulnerable adults under this chapter and section 626.557 must be met by the license holder.\nAll license holders shall establish and enforce ongoing written program abuse prevention plans and individual abuse prevention plans as required under section 626.557, subdivision 14.\n(a) The scope of the program abuse prevention plan is limited to the population, physical plant, and environment within the control of the license holder and the location where licensed services are provided. In addition to the requirements in section 626.557, subdivision 14, the program abuse prevention plan shall meet the requirements in clauses (1) to (5).\n(1) The assessment of the population shall include an evaluation of the following factors: age, gender, mental functioning, physical and emotional health or behavior of the client; the need for specialized programs of care for clients; the need for training of staff to meet identified individual needs; and the knowledge a license holder may have regarding previous abuse that is relevant to minimizing risk of abuse for clients.\n(2) The assessment of the physical plant where the licensed services are provided shall include an evaluation of the following factors: the condition and design of the building as it relates to the safety of the clients; and the existence of areas in the building which are difficult to supervise.\n(3) The assessment of the environment for each facility and for each site when living arrangements are provided by the agency shall include an evaluation of the following factors: the location of the program in a particular neighborhood or community; the type of grounds and terrain surrounding the building; the type of internal programming; and the program's staffing patterns.\n(4) The license holder shall provide an orientation to the program abuse prevention plan for clients receiving services. If applicable, the client's legal representative must be notified of the orientation. The license holder shall provide this orientation for each new person within 24 hours of admission, or for persons who would benefit more from a later orientation, the orientation may take place within 72 hours.\n(5) The license holder's governing body or the governing body's delegated representative shall review the plan at least annually using the assessment factors in the plan and any substantiated maltreatment findings that occurred since the last review. The governing body or the governing body's delegated representative shall revise the plan, if necessary, to reflect the review results.\n(6) A copy of the program abuse prevention plan shall be posted in a prominent location in the program and be available upon request to mandated reporters, persons receiving services, and legal representatives.\n(b) In addition to the requirements in section 626.557, subdivision 14, the individual abuse prevention plan shall meet the requirements in clauses (1) and (2).\n(1) The plan shall include a statement of measures that will be taken to minimize the risk of abuse to the vulnerable adult when the individual assessment required in section 626.557, subdivision 14, paragraph (b), indicates the need for measures in addition to the specific measures identified in the program abuse prevention plan. The measures shall include the specific actions the program will take to minimize the risk of abuse within the scope of the licensed services, and will identify referrals made when the vulnerable adult is susceptible to abuse outside the scope or control of the licensed services. When the assessment indicates that the vulnerable adult does not need specific risk reduction measures in addition to those identified in the program abuse prevention plan, the individual abuse prevention plan shall document this determination.\n(2) An individual abuse prevention plan shall be developed for each new person as part of the initial individual program plan or service plan required under the applicable licensing rule or statute. The review and evaluation of the individual abuse prevention plan shall be done as part of the review of the program plan, service plan, or treatment plan. The person receiving services shall participate in the development of the individual abuse prevention plan to the full extent of the person's abilities. If applicable, the person's legal representative shall be given the opportunity to participate with or for the person in the development of the plan. The interdisciplinary team shall document the review of all abuse prevention plans at least annually, using the individual assessment and any reports of abuse relating to the person. The plan shall be revised to reflect the results of this review.\nThe license holder shall ensure that each new mandated reporter, as defined in section 626.5572, subdivision 16, who is under the control of the license holder, receives an orientation within 72 hours of first providing direct contact services as defined in section 245C.02, subdivision 11, to a vulnerable adult and annually thereafter. The orientation and annual review shall inform the mandated reporters of the reporting requirements and definitions in sections 626.557 and 626.5572, the requirements of this section, the license holder's program abuse prevention plan, and all internal policies and procedures related to the prevention and reporting of maltreatment of individuals receiving services.",
	"repealed": false
}