{
	"id": "47.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.65",
	"title": "47.65 TRANSMISSION FACILITY.",
	"text": "Any person may establish a transmission facility in this state upon approval by the commissioner pursuant to the provisions of this section, except that a financial institution may establish a transmission facility in this state after giving the commissioner written notice of its intent to do so, provided that the commissioner does not issue an order disallowing such establishment within 15 days after receiving a completed notice. Any such notice must be made using a form prescribed by the commissioner. A transmission facility which is used by, or made available to, any financial institution must be made available to all other financial institutions upon request of such financial institution and agreement by the financial institution to pay fees on a fair, equitable, and nondiscriminatory basis. A person requesting use of a transmission facility shall be permitted its use only if the person conforms to reasonable technical operating standards which have been established by the transmission facility provider. The charges required to be paid to any person establishing a transmission facility shall be related to an equitable proportion of the direct costs of establishing, operating and maintaining such facility plus a reasonable return on those costs to the owner of the facility. The charges may provide for amortization of development costs and capital expenditures over a reasonable period of time.\nA Minnesota transmission facility which is used by, or made available to, any other Minnesota transmission facility must be made available on fair, equitable, and nondiscriminatory terms to all other Minnesota transmission facilities upon request of such Minnesota transmission facility. Such person requesting use of a Minnesota transmission facility shall be permitted its use only if the person conforms to reasonable technical operating standards which have been established by the Minnesota transmission facility.\nThe charges required to be paid to any Minnesota transmission facility shall be related to the costs of establishing, operating, and maintaining such facility plus a reasonable return on those costs to the owner of the facility and may provide for amortization of development costs and capital expenditures over a reasonable period of time; provided such charges as may be separately determined and established from time to time by each Minnesota transmission facility are fair, equitable, and nondiscriminatory.\nNothing in subdivision 1a shall prevent a corporation contracting with Minnesota state and local governmental units to provide electronic benefits transfer or electronic fund transfer services from utilizing their point of service terminals, networks, or attendant support systems for commercial purposes.\nBefore installation and operation, a transmission facility application by a person who is required to submit an application under subdivision 1 shall be submitted to the commissioner on a form provided by the commissioner which states:\n(a) the location where the transmission facility will be operated;\n(b) the ownership of the transmission facility;\n(c) if applicable, the bonding or insurance company which has provided the bond for the transmission facility; and\n(d) such other information as the commissioner requires.\nIf the commissioner finds that (a) the facility will be properly and safely managed, (b) the applicant is financially sound, (c) there is a reasonable probability of success for the facility, (d) the proposed charges for making the services of the facility available to financial institutions are fair, equitable and nondiscriminatory, and (e) all information has been furnished by the applicant, the commissioner shall approve the application within 90 days. If the commissioner has not denied the application within 90 days of the submission of the application, the authorization shall be deemed granted. For each application, a $500 fee shall be paid to the commissioner. For each application for change in pricing structure, a $50 fee shall be paid to the commissioner. If the $500 fee or the $50 fee is less than the costs incurred by the commissioner in approving or disapproving the application, the application fee shall be equal to those costs.\nTo insure payment to any person who suffers loss due to negligence or intentional misconduct in the operation of a transmission facility any person seeking to establish a transmission facility shall, at the option of the commissioner, file in the commissioner's office either a financial statement in an acceptable form, or a bond, rider to an existing bond, or other collateral security acceptable to and in an amount set by the commissioner. The commissioner shall permit the filing of a financial statement in lieu of a bond or other security only if the financial statement demonstrates that the person seeking to establish the transmission facility has the financial ability to insure payment to any person who suffers loss due to negligence or intentional misconduct in the operation of the transmission facility. If the filing of a financial statement is permitted, additional periodic financial information shall be filed as required by the commissioner.",
	"repealed": false
}