{
	"id": "145D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/145D.01",
	"title": "145D.01 REQUIREMENTS FOR CERTAIN HEALTH CARE ENTITY TRANSACTIONS.",
	"text": "(a) For purposes of this section and section 145D.02, the following terms have the meanings given.\n(b) \"Captive professional entity\" means a professional corporation, limited liability company, or other entity formed to render professional services in which a beneficial owner is a health care provider employed by, controlled by, or subject to the direction of a hospital or hospital system.\n(c) \"Commissioner\" means the commissioner of health.\n(d) \"Control,\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with,\" means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a health care entity, whether through the ownership of voting securities, membership in an entity formed under chapter 317A, by contract other than a commercial contract for goods or nonmanagement services, or otherwise, unless the power is the result of an official position with, corporate office held by, or court appointment of, the person. Control is presumed to exist if any person, directly or indirectly, owns, controls, holds with the power to vote, or holds proxies representing 40 percent or more of the voting securities of any other person, or if any person, directly or indirectly, constitutes 40 percent or more of the membership of an entity formed under chapter 317A. The attorney general may determine that control exists in fact, notwithstanding the absence of a presumption to that effect.\n(e) \"Health care entity\" means:\n(1) a hospital;\n(2) a hospital system;\n(3) a captive professional entity;\n(4) a medical foundation;\n(5) a health care provider group practice;\n(6) an entity organized or controlled by an entity listed in clauses (1) to (5); or\n(7) an entity that owns or exercises control over an entity listed in clauses (1) to (5).\n(f) \"Health care provider\" means a physician licensed under chapter 147, a physician assistant licensed under chapter 147A, or an advanced practice registered nurse as defined in section 148.171, subdivision 3, who provides health care services, including but not limited to medical care, consultation, diagnosis, or treatment.\n(g) \"Health care provider group practice\" means two or more health care providers legally organized in a partnership, professional corporation, limited liability company, medical foundation, nonprofit corporation, faculty practice plan, or other similar entity:\n(1) in which each health care provider who is a member of the group provides services that a health care provider routinely provides, including but not limited to medical care, consultation, diagnosis, and treatment, through the joint use of shared office space, facilities, equipment, or personnel;\n(2) for which substantially all services of the health care providers who are group members are provided through the group and are billed in the name of the group practice and amounts so received are treated as receipts of the group; or\n(3) in which the overhead expenses of, and the income from, the group are distributed in accordance with methods previously determined by members of the group.\nAn entity that otherwise meets the definition of health care provider group practice in this paragraph shall be considered a health care provider group practice even if its shareholders, partners, members, or owners include a professional corporation, limited liability company, or other entity in which any beneficial owner is a health care provider and that is formed to render professional services.\n(h) \"Hospital\" means a health care facility licensed as a hospital under sections 144.50 to 144.56.\n(i) \"Medical foundation\" means a nonprofit legal entity through which health care providers perform research or provide medical services.\n(j) \"Transaction\" means a single action, or a series of actions within a five-year period, which occurs in part within the state of Minnesota or involves a health care entity formed or licensed in Minnesota, that constitutes:\n(1) a merger or exchange of a health care entity with another entity;\n(2) the sale, lease, or transfer of 40 percent or more of the assets of a health care entity to another entity;\n(3) the granting of a security interest of 40 percent or more of the property and assets of a health care entity to another entity;\n(4) the transfer of 40 percent or more of the shares or other ownership of a health care entity to another entity;\n(5) an addition, removal, withdrawal, substitution, or other modification of one or more members of the health care entity's governing body that transfers control, responsibility for, or governance of the health care entity to another entity;\n(6) the creation of a new health care entity;\n(7) an agreement or series of agreements that results in the sharing of 40 percent or more of the health care entity's revenues with another entity, including affiliates of such other entity;\n(8) an addition, removal, withdrawal, substitution, or other modification of the members of a health care entity formed under chapter 317A that results in a change of 40 percent or more of the membership of the health care entity; or\n(9) any other transfer of control of a health care entity to, or acquisition of control of a health care entity by, another entity.\n(k) A transaction as defined in paragraph (j) does not include:\n(1) an action or series of actions that meets one or more of the criteria set forth in paragraph (j), clauses (1) to (9), if, immediately prior to all such actions, the health care entity directly, or indirectly through one or more intermediaries, controls, is controlled by, or is under common control with, all other parties to the action or series of actions;\n(2) a mortgage or other secured loan for business improvement purposes entered into by a health care entity that does not directly affect delivery of health care or governance of the health care entity;\n(3) a clinical affiliation of health care entities formed solely for the purpose of collaborating on clinical trials or providing graduate medical education;\n(4) the mere offer of employment to, or hiring of, a health care provider by a health care entity;\n(5) contracts between a health care entity and a health care provider primarily for clinical services; or\n(6) a single action or series of actions within a five-year period involving only entities that operate solely as a nursing home licensed under chapter 144A; a boarding care home licensed under sections 144.50 to 144.56; a supervised living facility licensed under sections 144.50 to 144.56; an assisted living facility licensed under chapter 144G; a foster care setting licensed under Minnesota Rules, parts 9555.5105 to 9555.6265, for a physical location that is not the primary residence of the license holder; a community residential setting as defined in section 245D.02, subdivision 4a; or a home care provider licensed under sections 144A.471 to 144A.483.\n[See Note.]\n(a) This subdivision applies to all transactions where:\n(1) the health care entity involved in the transaction has average revenue of at least $80,000,000 per year; or\n(2) the transaction will result in an entity projected to have average revenue of at least $80,000,000 per year once the entity is operating at full capacity.\n(b) A health care entity must provide notice to the attorney general and the commissioner and comply with this subdivision before entering into a transaction. Notice must be provided at least 60 days before the proposed completion date of the transaction, subject to waiver of all or any part of this waiting period under paragraph (f).\n(c) Subject to waiver of all or any part of these disclosure requirements under paragraph (f), as part of the notice required under this subdivision, at least 60 days before the proposed completion date of the transaction, a health care entity must affirmatively disclose the following to the attorney general and the commissioner:\n(1) the entities involved in the transaction;\n(2) the leadership of the entities involved in the transaction, including all board members, managing partners, member managers, and officers;\n(3) the services provided by each entity and the attributed revenue for each entity by location;\n(4) the primary service area for each location;\n(5) the proposed service area for each location;\n(6) the current relationships between the entities and the affected health care providers and practices, the locations of affected health care providers and practices, the services provided by affected health care providers and practices, and the proposed relationships between the entities and the affected health care providers and practices;\n(7) the terms of the transaction agreement or agreements;\n(8) all consideration related to the transaction;\n(9) markets in which the entities expect postmerger synergies to produce a competitive advantage;\n(10) potential areas of expansion, whether in existing markets or new markets;\n(11) plans to close facilities, reduce workforce, or reduce or eliminate services;\n(12) the brokers, experts, and consultants used to facilitate and evaluate the transaction;\n(13) the number of full-time equivalent positions at each location before and after the transaction by job category, including administrative and contract positions; and\n(14) any other information relevant to evaluating the transaction that is requested by the attorney general or commissioner.\n(d) Subject to waiver of all or any part of these submission requirements under paragraph (f), as part of the notice required under this subdivision, at least 60 days before the proposed completion date of the transaction, a health care entity must affirmatively submit the following to the attorney general and the commissioner:\n(1) the current governing documents for all entities involved in the transaction and any amendments to these documents;\n(2) the transaction agreement or agreements and all related agreements;\n(3) any collateral agreements related to the principal transaction, including leases, management contracts, and service contracts;\n(4) all expert or consultant reports or valuations conducted in evaluating the transaction, including any valuation of the assets that are subject to the transaction prepared within three years preceding the anticipated transaction completion date and any reports of financial or economic analysis conducted in anticipation of the transaction;\n(5) the results of any projections or modeling of health care utilization or financial impacts related to the transaction, including but not limited to copies of reports by appraisers, accountants, investment bankers, actuaries, and other experts;\n(6) for a transaction described in subdivision 1, paragraph (j), clauses (1), (2), (4), or (7) to (9), a financial and economic analysis and report prepared by an independent expert or consultant on the effects of the transaction;\n(7) for a transaction described in subdivision 1, paragraph (j), clauses (1), (2), (4), or (7) to (9), an impact analysis report prepared by an independent expert or consultant on the effects of the transaction on communities and the workforce, including any changes in availability or accessibility of services;\n(8) all documents reflecting the purposes of or restrictions on any related nonprofit entity's charitable assets;\n(9) copies of all filings submitted to federal regulators, including any filing the entities submitted to the Federal Trade Commission under United States Code, title 15, section 18a, in connection with the transaction;\n(10) a certification sworn under oath by each board member and chief executive officer for any nonprofit entity involved in the transaction containing the following: an explanation of how the completed transaction is in the public interest, addressing the factors in subdivision 5, paragraph (a); a disclosure of each declarant's compensation and benefits relating to the transaction for the three years following the transaction's anticipated completion date; and a disclosure of any conflicts of interest;\n(11) audited and unaudited financial statements from all entities involved in the transaction and tax filings for all entities involved in the transaction covering the preceding five fiscal years; and\n(12) any other information or documents relevant to evaluating the transaction that are requested by the attorney general or commissioner.\n(e) The attorney general may extend the notice and waiting period required under paragraph (b) for an additional 90 days by notifying the health care entity in writing of the extension.\n(f) The attorney general may waive all or any part of the waiting period required under paragraph (b). The attorney general may waive all or any part of the disclosure requirements under paragraph (c) and submission requirements under paragraph (d), including requirements for disclosure or submission to the commissioner.\n(g) The attorney general or the commissioner may hold public listening sessions or forums to obtain input on the transaction from providers or community members who may be impacted by the transaction.\n(h) The attorney general or the commissioner may bring an action in district court to compel compliance with the notice, waiting period, disclosure, and submission requirements in this subdivision.\nNo health care entity may enter into a transaction that will:\n(1) substantially lessen competition; or\n(2) tend to create a monopoly or monopsony.\nA health care entity that is incorporated under chapter 317A or organized under section 322C.1101, or that is a subsidiary of any such entity, must, before entering into a transaction, ensure that:\n(1) the transaction complies with chapters 317A and 501B and other applicable laws;\n(2) the transaction does not involve or constitute a breach of charitable trust;\n(3) the nonprofit health care entity will receive full and fair value for its public benefit assets, unless the discount between the full and fair value of the assets and the value received for the assets will further the nonprofit purposes of the nonprofit health care entity or is in the public interest;\n(4) the value of the public benefit assets to be transferred has not been manipulated in a manner that causes or has caused the value of the assets to decrease;\n(5) the proceeds of the transaction will be used in a manner consistent with the public benefit for which the assets are held by the nonprofit health care entity;\n(6) the transaction will not result in a breach of fiduciary duty; and\n(7) there are procedures and policies in place to prohibit any officer, director, trustee, or other executive of the nonprofit health care entity from directly or indirectly benefiting from the transaction.\n(a) The attorney general may bring an action in district court to enjoin or unwind a transaction or seek other equitable relief necessary to protect the public interest if a health care entity or transaction violates this section, if the transaction is contrary to the public interest, or if both a health care entity or transaction violates this section and the transaction is contrary to the public interest. Factors informing whether a transaction is contrary to the public interest include but are not limited to whether the transaction:\n(1) will harm public health;\n(2) will reduce the affected community's continued access to affordable and quality care and to the range of services historically provided by the entities or will prevent members in the affected community from receiving a comparable or better patient experience;\n(3) will have a detrimental impact on competing health care options within primary and dispersed service areas;\n(4) will reduce delivery of health care to disadvantaged, uninsured, underinsured, and underserved populations and to populations enrolled in public health care programs;\n(5) will have a substantial negative impact on medical education and teaching programs, health care workforce training, or medical research;\n(6) will have a negative impact on the market for health care services, health insurance services, or skilled health care workers;\n(7) will increase health care costs for patients;\n(8) will adversely impact provider cost trends and containment of total health care spending;\n(9) will have a negative impact on wages paid by, or the number of employees employed by, a health care entity involved in a transaction; or\n(10) will have a negative impact on wages, collective bargaining units, and collective bargaining agreements of existing or future workers employed by a health care entity involved in a transaction.\n(b) The attorney general may enforce this section under section 8.31.\n(c) Failure of the entities involved in a transaction to provide timely information as required by the attorney general or the commissioner shall be an independent and sufficient ground for a court to enjoin or unwind the transaction or provide other equitable relief, provided the attorney general notified the entities of the inadequacy of the information provided and provided the entities with a reasonable opportunity to remedy the inadequacy.\n(d) The commissioner shall provide to the attorney general, upon request, data and research on broader market trends, impacts on prices and outcomes, public health and population health considerations, and health care access, for the attorney general to use when evaluating whether a transaction is contrary to public interest. The commissioner may share with the attorney general, according to section 13.05, subdivision 9, any not public data, as defined in section 13.02, subdivision 8a, held by the commissioner to aid in the investigation and review of the transaction, and the attorney general must maintain this data with the same classification according to section 13.03, subdivision 4, paragraph (c).\n(a) Notwithstanding any law to the contrary, the commissioner may use data or information submitted under this section, section 62U.04, and sections 144.695 to 144.703 to conduct analyses of the aggregate impact of health care transactions on access to or the cost of health care services, health care market consolidation, and health care quality.\n(b) The commissioner shall issue periodic public reports on the number and types of transactions subject to this section and on the aggregate impact of transactions on health care cost, quality, and competition in Minnesota.\nSection 13.39 applies to data provided by a health care entity and the commissioner to the attorney general and data provided by a health care entity to the commissioner under this section. The attorney general or the commissioner may make any data classified as confidential or protected nonpublic under this subdivision accessible to any civil or criminal law enforcement agency if the attorney general or commissioner determines that the access will aid the law enforcement process.\n(a) The powers and authority under this section are in addition to, and do not affect or limit, all other rights, powers, and authority of the attorney general or the commissioner under chapters 8, 309, 317A, 325D, and 501B, or other law.\n(b) Nothing in this section shall suspend any obligation imposed under chapters 8, 309, 317A, 325D, and 501B, or other law on the entities involved in a transaction.",
	"repealed": false
}