{
	"id": "144A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.11",
	"title": "144A.11 LICENSE SUSPENSION OR REVOCATION; HEARING; RELICENSING.",
	"text": "The commissioner of health may institute proceedings to suspend or revoke a nursing home license, or may refuse to grant or renew the license of a nursing home if any action by a controlling person or employee of the nursing home:\n(1) violates any of the provisions of sections 144A.01 to 144A.08, 144A.13 or 144A.155, or the rules promulgated thereunder;\n(2) permits, aids, or abets the commission of any illegal act in the nursing home;\n(3) performs any act contrary to the welfare of a patient or resident of the nursing home; or\n(4) obtains, or attempts to obtain, a license by fraudulent means or misrepresentation.\n(a) The commissioner of health shall initiate proceedings within 60 days of notification to suspend or revoke a nursing home license or shall refuse to renew a license if within the preceding two years the nursing home has incurred the following number of uncorrected or repeated violations:\n(1) two or more uncorrected violations or one or more repeated violations which created an imminent risk to direct resident care or safety; or\n(2) four or more uncorrected violations or two or more repeated violations of any nature for which the fines are in the four highest daily fine categories prescribed in rule.\n(b) Notwithstanding paragraph (a), the commissioner is not required to revoke, suspend, or refuse to renew a facility's license if the facility corrects the violation.\nWithin five working days after proceedings are initiated by the commissioner to revoke, suspend, or not renew a nursing home license, the controlling person of the nursing home or a designee must provide to the commissioner and the ombudsman for long-term care the names of residents and the names and addresses of the residents' guardians, representatives, and designated family contacts. The controlling person or designees must provide updated information each month until the proceeding is concluded. If the controlling person or designee fails to provide the information within this time, the nursing home is subject to the issuance of a correction order and penalty assessment under sections 144.653 and 144A.10. Notwithstanding those sections, any correction order issued under this subdivision must require that the facility immediately comply with the request for information and that as of the date of the issuance of the correction order, the facility shall forfeit to the state a $100 fine the first day of noncompliance and an increase in the $100 fine by $50 increments for each day the noncompliance continues. Information provided under this subdivision may be used by the commissioner or the ombudsman only for the purpose of providing affected consumers information about the status of the proceedings. Within ten working days after the commissioner initiates proceedings to revoke, suspend, or not renew a nursing home license, the commissioner of health shall send a written notice of the action and the process involved to each resident of the nursing home and the resident's legal guardian, representative, or designated family contact. The commissioner shall provide the ombudsman with monthly information on the department's actions and the status of the proceedings.\nNo nursing home license may be suspended or revoked, and renewal may not be denied, without a hearing held as a contested case in accordance with chapter 14. The hearing must commence within 60 days after the proceedings are initiated. If the controlling person designated under section 144A.03, subdivision 2, as an agent to accept service on behalf of all of the controlling persons of the nursing home has been notified by the commissioner of health that the facility will not receive an initial license or that a license renewal has been denied, the controlling person or a legal representative on behalf of the nursing home may request and receive a hearing on the denial. This hearing shall be held as a contested case in accordance with chapter 14.\nNotwithstanding the provisions of subdivision 3, the commissioner shall revoke a nursing home license if a controlling person is convicted of a felony or gross misdemeanor that relates to operation of the nursing home or directly affects resident safety or care. The commissioner shall notify the nursing home 30 days in advance of the date of revocation.\nIf a nursing home license is revoked a new application for license may be considered by the commissioner of health when the conditions upon which revocation was based have been corrected and satisfactory evidence of this fact has been furnished to the commissioner of health. A new license may be granted after an inspection has been made and the facility has been found to comply with all provisions of sections 144A.01 to 144A.155 and the rules promulgated thereunder.",
	"repealed": false
}