{
	"id": "356.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.635",
	"title": "356.635 INTERNAL REVENUE CODE COMPLIANCE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Beneficiary\" means the person designated as the beneficiary under the terms of the applicable covered retirement plan.\n(c) \"Covered retirement plan\" means a pension or retirement plan listed in section 356.611, subdivision 6.\n(d) \"Designated beneficiary\" means an individual beneficiary within the meaning of section 401(a)(9)(E)(i) of the Internal Revenue Code.\n(e) \"Distribution calendar year\" means a calendar year for which a minimum distribution is required. For distributions beginning before the participant's death, the first distribution calendar year is the calendar year immediately preceding the calendar year which contains the participant's required beginning date. For distributions beginning after the participant's death, the first distribution calendar year is the calendar year in which distributions are required to begin under subdivision 2a, paragraph (b). The required minimum distribution for the participant's first distribution calendar year shall be made on or before the participant's required beginning date.\n(f) \"Eligible designated beneficiary\" means a designated beneficiary who meets the additional criteria under section 401(a)(9)(E)(ii) of the Internal Revenue Code.\n(g) \"Participant's account balance\" means the account balance as of the last valuation date in the valuation calendar year increased by the amount of any contributions made and allocated to the account balance as of dates in the valuation calendar year after the valuation date and decreased by distributions made in the valuation calendar year after the valuation date. The account balance for the valuation calendar year includes any amounts rolled over or transferred to the plan either in the valuation calendar year or in the distribution calendar year if distributed or transferred in the valuation calendar year.\n(h) \"Required beginning date\" means April 1 of the calendar year following the later of:\n(1) the calendar year in which the member or the participant attains the age specified in section 401(a)(9)(C)(i)(I) of the Internal Revenue Code; or\n(2) the calendar year in which the member or participant terminates employment.\n(i) \"Valuation calendar year\" means the calendar year immediately preceding the distribution calendar year.\n(a) Notwithstanding any state law to the contrary, the retirement benefit of a member or participant must begin to be distributed or, if a lump sum, be distributed no later than the member's or participant's required beginning date.\n(b) A pension or retirement plan is not required to obtain the consent of a member or participant to a distribution if the distribution is required to satisfy the requirements of paragraph (a). If the plan is unable to obtain the consent of a member or participant to a distribution that is required to satisfy the requirements of paragraph (a), the plan must make the required distribution to the member or participant. If the plan is a defined benefit plan that permits the distribution to be in the form of an annuity, the required distribution must be:\n(1) in the form of a single life annuity if the plan administrator's records do not indicate that the member is married; or\n(2) in the form of a 50 percent joint and survivor annuity naming the member's spouse as survivor if the plan administrator's records indicate that the member is married.\nNotwithstanding any state law to the contrary:\n(1) distributions from a covered retirement plan must be determined and made in accordance with a reasonable, good faith interpretation of the requirements of section 401(a)(9) of the Internal Revenue Code as applicable to governmental plans, as defined under section 414(d) of the Internal Revenue Code, and the treasury regulations adopted under section 401(a)(9), including, but not limited to, the incidental death benefit provisions of section 401(a)(9)(G) of the Internal Revenue Code; and\n(2) the entire interest of a member or participant under a covered retirement plan must begin to be distributed or, if a lump sum, be distributed no later than the member's or participant's required beginning date.\n(a) This section applies to any covered retirement plan that is a defined contribution plan, including but not limited to the following:\n(1) the unclassified state employees retirement plan, established by chapter 352D;\n(2) the public employees defined contribution plan, established by chapter 353D;\n(3) the defined contribution plan that is part of the statewide volunteer firefighter retirement plan, established by chapter 353G;\n(4) the higher education individuals retirement account plan, established by chapter 354B;\n(5) the higher education supplemental retirement plan, established by chapter 354C; and\n(6) a defined contribution relief association, as defined under section 424A.001, subdivision 1c.\n(b) If the participant dies before the required minimum distribution begins, the participant's account must be distributed in a lump sum no later than as follows:\n(1) if the participant's account balance is payable to an eligible designated beneficiary, the distribution must be made by December 31 of the calendar year immediately following the calendar year in which the participant died. If the eligible designated beneficiary is the surviving spouse, the surviving spouse may elect to delay payment until December 31 of the calendar year in which the participant would have attained the participant's required beginning date. Effective for calendar years beginning after December 31, 2023, a surviving spouse who is the member's sole designated beneficiary may elect to be treated as if the surviving spouse were the member as provided under section 401(a)(9)(B)(iv) of the Internal Revenue Code;\n(2) if the participant's account balance is payable to a beneficiary that is not a designated beneficiary, the participant's account must be distributed by December 31 of the calendar year containing the fifth anniversary of the participant's death; or\n(3) if the participant's account balance is payable to a designated beneficiary who is not an eligible designated beneficiary, the participant's account must be distributed by December 31 of the calendar year containing the tenth anniversary of the participant's death.\n(c) Upon the death of the participant after distribution of the participant's account balance begins, any remaining portion of the participant's account balance shall continue to be distributed at least as rapidly as under the method of distribution in effect at the time of the participant's death, provided that the portion of the participant's account balance payable to a designated beneficiary who is not an eligible designated beneficiary must be distributed in its entirety by December 31 of the calendar year containing the tenth anniversary of the participant's death.\n(d) Upon the death of an eligible designated beneficiary, or the attainment of the age of majority of an eligible designated beneficiary who is a minor child of the participant, before distribution of the participant's entire account balance under paragraph (b) or (c), the remainder of the participant's account balance shall be distributed by December 31 of the calendar year containing the tenth anniversary of the eligible designated beneficiary's death, or by December 31 of the calendar year in which the child attains the age of majority plus ten years, as applicable.\n(e) Notwithstanding any other provisions of this subdivision, a participant or beneficiary, who would have been required to receive required minimum distributions in 2020 (or paid in 2021 for the 2020 calendar year for a participant with a required beginning date of April 1, 2021) but for the enactment of section 401(a)(9)(I) of the Internal Revenue Code, and who would have satisfied that requirement by receiving a distribution that satisfies the required minimum distribution for 2020, will receive that distribution unless the participant or beneficiary chooses not to receive the distribution. Solely for purposes of applying the direct rollover provisions of section 356.633, such distributions will be treated as eligible rollover distributions in 2020.\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nContributions, benefits, including death and disability benefits under section 401(a)(37) of the federal Internal Revenue Code, and service credit with respect to qualified military service must be provided according to section 414(u) of the federal Internal Revenue Code. For deaths occurring on or after January 1, 2007, while a member is performing qualified military service as defined in United States Code, title 38, chapter 43, to the extent required by section 401(a)(37) of the Internal Revenue Code, survivors of a member in the system are entitled to any additional benefits that the system would have provided if the member had resumed employment and then died, including but not limited to accelerated vesting or survivor benefits that are contingent on the member's death while employed. In any event, a deceased member's period of qualified military service must be counted for vesting purposes.\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]\nMS 2022 [Repealed, 2024 c 102 art 8 s 16]",
	"repealed": false
}