{
	"id": "86B.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.321",
	"title": "86B.321 NOISE LIMITS.",
	"text": "A person may not operate a motorboat under any condition of load, acceleration, or deceleration in a manner that exceeds the noise limits contained in subdivision 2.\n(a) The noise limits for the total noise from the marine engine or motorboat may not exceed:\n(1) for marine engines or motorboats manufactured before January 1, 1982, a noise level of 84 decibels on the A scale measured at a distance of 50 feet from the motorboat or equivalent noise levels at other distances as specified by the commissioner in a pass-by test or 86 decibels on the A scale measured at idle in a stationary test at least four feet above the water and at least four feet behind the transom of the motorboat being tested; and\n(2) for marine engines or motorboats manufactured on or after January 1, 1982, a noise level of 82 decibels on the A scale measured at a distance of 50 feet from the motorboat or equivalent noise levels at other distances as specified by the commissioner in a pass-by test or 84 decibels on the A scale measured at idle in a stationary test at least four feet above the water and at least four feet behind the transom of the motorboat being tested.\n(b) The noise limits in paragraph (a) do not preclude enforcement of other laws relating to motorboat noise. The officer or deputy doing the testing shall determine which test or tests shall be used. Failure to pass either the pass-by or stationary idle test is a violation of this section.\n(c) Equivalent noise levels under paragraph (a) shall be specified by the commissioner by written order and published in the State Register. The noise level determinations are exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.\nThe provisions of this section do not apply to motorboats operating under a permit issued under section 86B.121 or a United States Coast Guard marine event permit in a regatta or race while on trial runs or while on official trials for speed records during the time and in the designated area authorized by the permit.",
	"repealed": false
}