{
	"id": "93.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.52",
	"title": "93.52 OWNERSHIP OF SEVERED MINERAL INTERESTS.",
	"text": "The purpose of sections 93.52 to 93.551 is to identify and clarify the obscure and divided ownership condition of severed mineral interests in this state. Because the ownership condition of many severed mineral interests is becoming more obscure and further fractionalized with the passage of time, the development of mineral interests in this state is often impaired. Therefore, it is in the public interest and serves a public purpose to identify and clarify these interests.\nExcept as provided in subdivision 3, from and after January 1, 1970, every owner of a fee simple interest in minerals, hereafter referred to as a mineral interest, in lands in this state, which interest is owned separately from the fee title to the surface of the property upon or beneath which the mineral interest exists, shall record in the office of the county recorder or, if registered property, in the office of the registrar of titles in the county where the mineral interest is located a verified statement, in triplicate, citing sections 93.52 to 93.551 and setting forth the owner's address, interest in the minerals, and both (1) the legal description of the property upon or beneath which the interest exists, and (2) the book and page number or the document number, in the records of the county recorder or registrar of titles, of the instrument by which the mineral interest is created or acquired. No statement may be recorded which contains mineral interests from more than one government section unless the instrument by which the mineral interest is created or acquired includes mineral interests from more than one government section. The county recorder and registrar of titles shall file with the county auditor a copy of each document so recorded within 60 days after recording in the office of county recorder or registrar of titles.\nSections 93.52 to 93.551 do not apply to the following owners of mineral interests: the United States of America, the state of Minnesota, and any American Indian tribe or band owning reservation lands in this state.",
	"repealed": false
}