{
	"id": "148.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.171",
	"title": "148.171 DEFINITIONS; TITLE.",
	"text": "Sections 148.171 to 148.285 shall be referred to as the \"Minnesota Nurse Practice Act.\"\nAs used in sections 148.171 to 148.285, the definitions in this section have the meanings given.\n\"Advanced practice registered nurse,\" abbreviated APRN, means an individual licensed as an advanced practice registered nurse by the board and certified by a national nurse certification organization acceptable to the board to practice as a clinical nurse specialist, nurse anesthetist, nurse-midwife, or nurse practitioner. The national nursing certification organization must:\n(1) be endorsed by a national professional nursing organization that describes scope and standards statements specific to the practice as a clinical nurse specialist, nurse-midwife, nurse practitioner, or registered nurse anesthetist for the population focus for which the individual will be certified;\n(2) be independent from the national professional nursing organization in decision-making for all matters pertaining to certification or recertification;\n(3) administer a professional nursing certification program that is psychometrically sound and legally defensible, and meets nationally recognized accreditation standards for certification programs; and\n(4) require periodic recertification or be affiliated with an organization that provides recertification.\n\"Assignment\" means the designation of nursing tasks or activities to be performed by another nurse or unlicensed assistive person.\n\"Board\" means the Minnesota Board of Nursing.\n\"Certification\" means the formal recognition of knowledge, skills, and experience demonstrated by the achievement of standards identified by the National Professional Nursing Organization acceptable to the Minnesota Board of Nursing.\n\"Clinical nurse specialist practice\" means:\n(1) the diagnosis and treatment of health and illness states;\n(2) disease management;\n(3) prescribing pharmacologic and nonpharmacologic therapies;\n(4) ordering, performing, supervising, and interpreting diagnostic studies, excluding interpreting computed tomography scans, magnetic resonance imaging scans, positron emission tomography scans, nuclear scans, and mammography;\n(5) prevention of illness and risk behaviors;\n(6) nursing care for individuals, families, and communities;\n(7) consulting with, collaborating with, or referring to other health care providers as warranted by the needs of the patient; and\n(8) integration of care across the continuum to improve patient outcomes.\n\"Collaboration\" means the process in which two or more health care professionals work together to meet the health care needs of a patient, as warranted by the patient.\n[Repealed, 2014 c 235 s 42; 2014 c 312 art 24 s 43]\n\"Consultation\" means the process in which an advanced practice registered nurse who maintains primary management responsibility for a patient's care seeks advice or opinion of a physician or another member of the health care team.\n\"Delegation\" means the transfer of authority to another nurse or competent, unlicensed assistive person to perform a specific nursing task or activity in a specific situation.\n\"Encumbered\" means (1) a license that is revoked, suspended, or contains limitations on the full and unrestricted practice of nursing when the revocation, suspension, or limitation is imposed by a state licensing board, or (2) a license that is voluntarily surrendered.\n\"Intervention\" means any act or action based upon clinical judgment and knowledge that a nurse performs to enhance the health outcome of a patient.\n\"Licensed practical nurse,\" abbreviated LPN, means an individual licensed by the board to practice practical nursing.\n\"Monitoring\" means the periodic inspection by a registered nurse or licensed practical nurse of a delegated or assigned nursing task or activity and includes: (1) watching during the performance of the task or activity; (2) periodic checking and tracking of the progress of the task or activity being performed; (3) updating a supervisor on the progress or completion of the task or activity performed; and (4) contacting a supervisor as needed for direction and consultation.\n\"Nurse\" means advanced practice registered nurse, registered nurse, and licensed practical nurse unless the context clearly refers to only one category.\n\"Nurse-midwife practice\" means:\n(1) the management, diagnosis, and treatment of women's primary health care including pregnancy, childbirth, postpartum period, care of the newborn, family planning, partner care management relating to sexual health, and gynecological care of women across the life span;\n(2) ordering, performing, supervising, and interpreting diagnostic studies, excluding interpreting computed tomography scans, magnetic resonance imaging scans, positron emission tomography scans, nuclear scans, and mammography;\n(3) prescribing pharmacologic and nonpharmacologic therapies; and\n(4) consulting with, collaborating with, or referring to other health care providers as warranted by the needs of the patient.\n\"Nurse practitioner practice\" means the provision of care including:\n(1) health promotion, disease prevention, health education, and counseling;\n(2) providing health assessment and screening activities;\n(3) diagnosing, treating, and facilitating patients' management of their acute and chronic illnesses and diseases;\n(4) ordering, performing, supervising, and interpreting diagnostic studies, excluding interpreting computed tomography scans, magnetic resonance imaging scans, positron emission tomography scans, nuclear scans, and mammography;\n(5) prescribing pharmacologic and nonpharmacologic therapies; and\n(6) consulting with, collaborating with, or referring to other health care providers as warranted by the needs of the patient.\n[Repealed, 2013 c 31 s 11]\n\"Patient\" means a recipient of nursing care, including an individual, family, group, or community.\n\"Population focus\" means the categories of patients for which the advanced practice registered nurse has the educational preparation to provide care and services. The categories of population foci are:\n(1) family and individual across the life span;\n(2) adult gerontology;\n(3) neonatal;\n(4) pediatrics;\n(5) women's and gender-related health; and\n(6) psychiatric and mental health.\n(a) The \"practice of advanced practice registered nursing\" means the performance of an expanded scope of nursing in at least one of the recognized advanced practice registered nurse roles for at least one population focus. The scope and practice standards of an advanced practice registered nurse are defined by the national professional nursing organizations specific to the practice as a clinical nurse specialist, nurse-midwife, nurse practitioner, or registered nurse anesthetist in the population focus. The scope of advanced practice registered nursing includes, but is not limited to, performing acts of advanced assessment, diagnosing, prescribing, and ordering. The practice includes functioning as a primary care provider, direct care provider, case manager, consultant, educator, and researcher.\n(b) The practice of advanced practice registered nursing requires the advanced practice registered nurse to be accountable: (1) to patients for the quality of advanced nursing care rendered; (2) for recognizing limits of knowledge and experience; and (3) for planning for the management of situations beyond the advanced practice registered nurse's expertise. The practice of advanced practice registered nursing includes accepting referrals from, consulting with, collaborating with, or referring to other health care providers as warranted by the needs of the patient.\nThe \"practice of practical nursing\" means the performance, with or without compensation, of those services that incorporates caring for individual patients in all settings through nursing standards recognized by the board at the direction of a registered nurse, advanced practice registered nurse, or other licensed health care provider and includes, but is not limited to:\n(1) conducting a focused assessment of the health status of an individual patient through the collection and comparison of data to normal findings and the individual patient's current health status, and reporting changes and responses to interventions in an ongoing manner to a registered nurse or the appropriate licensed health care provider for delegated or assigned tasks or activities;\n(2) participating with other health care providers in the development and modification of a plan of care;\n(3) determining and implementing appropriate interventions within a nursing plan of care or when delegated or assigned by a registered nurse;\n(4) implementing interventions that are delegated, ordered, or prescribed by a licensed health care provider;\n(5) assigning nursing activities or tasks to other licensed practical nurses (LPNs);\n(6) assigning and monitoring nursing tasks or activities to unlicensed assistive personnel;\n(7) providing safe and effective nursing care delivery;\n(8) promoting a safe and therapeutic environment;\n(9) advocating for the best interests of individual patients;\n(10) assisting in the evaluation of responses to interventions;\n(11) collaborating and communicating with other health care providers;\n(12) providing health care information to individual patients;\n(13) providing input into the development of policies and procedures; and\n(14) accountability for the quality of care delivered, recognizing the limits of knowledge and experience; addressing situations beyond the nurse's competency; and performing to the level of education, knowledge, and skill ordinarily expected of an individual who has completed an approved practical nursing education program described in section 148.211, subdivision 1.\nThe \"practice of professional nursing\" means the performance, with or without compensation, of those services that incorporates caring for all patients in all settings through nursing standards recognized by the board and includes, but is not limited to:\n(1) providing a comprehensive assessment of the health status of a patient through the collection, analysis, and synthesis of data used to establish a health status baseline and plan of care, and address changes in a patient's condition;\n(2) collaborating with the health care team to develop and coordinate an integrated plan of care;\n(3) developing nursing interventions to be integrated with the plan of care;\n(4) implementing nursing care through the execution of independent nursing interventions;\n(5) implementing interventions that are delegated, ordered, or prescribed by a licensed health care provider;\n(6) delegating nursing tasks or assigning nursing activities to implement the plan of care;\n(7) providing safe and effective nursing care;\n(8) promoting a safe and therapeutic environment;\n(9) advocating for the best interests of individual patients;\n(10) evaluating responses to interventions and the effectiveness of the plan of care;\n(11) collaborating and coordinating with other health care professionals in the management and implementation of care within and across care settings and communities;\n(12) providing health promotion, disease prevention, care coordination, and case finding;\n(13) designing and implementing teaching plans based on patient need, and evaluating their effectiveness;\n(14) participating in the development of health care policies, procedures, and systems;\n(15) managing, supervising, and evaluating the practice of nursing;\n(16) teaching the theory and practice of nursing; and\n(17) accountability for the quality of care delivered, recognizing the limits of knowledge and experience; addressing situations beyond the nurse's competency; and performing to the level of education, knowledge, and skill ordinarily expected of an individual who has completed an approved professional nursing education program as described in section 148.211, subdivision 1.\n\"Prescribing\" means the act of generating a prescription for the preparation of, use of, or manner of using a drug or therapeutic device in accordance with the provisions of section 148.235. Prescribing does not include recommending the use of a drug or therapeutic device which is not required by the federal Food and Drug Administration to meet the labeling requirements for prescription drugs and devices. Prescribing also does not include recommending or administering a drug or therapeutic device for anesthesia care by a certified registered nurse anesthetist.\n\"Prescription\" means a written direction or an oral direction reduced to writing provided to or for an individual patient for the preparation or use of a drug or therapeutic device. In the case of a prescription for a drug, the requirements of section 151.01, subdivisions 16, 16a, and 16b, shall apply.\n\"Primary care provider\" means a licensed health care provider who acts as the first point of care for comprehensive health maintenance and promotion, preventive care, and undiagnosed health concerns and who provides continuing care of varied health conditions not limited by cause, organ systems, or diagnosis.\n\"Public health nurse\" means a registered nurse who meets the voluntary registration requirements established by the board by rule.\n\"Referral\" means the process in which an advanced practice registered nurse directs a patient to a physician or another health care professional for management of a particular problem or aspect of the patient's care.\n\"Registered nurse,\" abbreviated RN, means an individual licensed by the board to practice professional nursing.\n(a) \"Registered nurse anesthetist practice\" means the provision of anesthesia care and related services including:\n(1) selecting, obtaining, and administering drugs and therapeutic devices to facilitate diagnostic, therapeutic, and surgical procedures;\n(2) ordering, performing, supervising, and interpreting diagnostic studies, excluding interpreting computed tomography scans, magnetic resonance imaging scans, positron emission tomography scans, nuclear scans, and mammography;\n(3) prescribing pharmacologic and nonpharmacologic therapies; and\n(4) consulting with, collaborating with, or referring to other health care providers as warranted by the needs of the patient.\n(b) A registered nurse anesthetist may perform nonsurgical therapies for acute and chronic pain symptoms upon referral and in collaboration with a physician licensed under chapter 147. For purposes of providing nonsurgical therapies for acute and chronic pain symptoms, the registered nurse anesthetist and one or more physicians licensed under chapter 147 must have a mutually agreed upon plan that designates the scope of collaboration necessary for providing nonsurgical therapies to patients with acute and chronic pain. The registered nurse anesthetist must perform the nonsurgical therapies at the same licensed health care facility as the physician.\n(c) Notwithstanding section 148.235, for purposes of providing nonsurgical pain therapies for chronic pain symptoms, the registered nurse anesthetist must have a written prescribing agreement with a physician licensed under chapter 147 that defines the delegated responsibilities related to prescribing drugs and therapeutic devices within the scope of the agreement and the practice of the registered nurse anesthetist.\n\"Registered nurse, certified,\" abbreviated RN,C, means a registered nurse who has received certification from a national nursing organization or national nurse certification organization for practice according to subdivision 15 in a specialized field of professional nursing. A registered nurse, certified, shall not practice advanced practice registered nursing as described in subdivision 5, 10, 11, 13, or 21.\n\"Role\" means one of four recognized advanced practice registered nurse roles: certified registered nurse anesthetist (CRNA); certified nurse-midwife (CNM); certified clinical nurse specialist (CNS); or certified nurse practitioner (CNP).\n\"Supervision\" means the guidance by a registered nurse in the accomplishment of a nursing task or activity. Supervision consists of monitoring, as well as establishing, the initial direction, delegating, setting expectations, directing activities and courses of action, evaluating, and changing a course of action.\n\"Unlicensed assistive personnel\" (UAP) means any unlicensed person to whom nursing tasks or activities may be delegated or assigned, as approved by the board.",
	"repealed": false
}