{
	"id": "473.864",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.864",
	"title": "473.864 PLANS; ADOPTION; AMENDMENT.",
	"text": "Each local governmental unit shall adopt its comprehensive plan with required modifications within nine months following a final decision, order, or judgment made pursuant to section 473.866.\nBy December 31, 1998, and at least once every ten years thereafter, each local governmental unit shall review and, if necessary, amend its entire comprehensive plan and its fiscal devices and official controls. Such review and, if necessary, amendment shall ensure that, as provided in section 473.865, the fiscal devices and official controls of each local government unit are not in conflict with its comprehensive plan. Upon completion of review and, if necessary, amendment of its comprehensive plan, fiscal devices, and official controls as required by this section, each local government unit shall either:\n(a) submit to the Metropolitan Council the entire current comprehensive plan together with written certification by the governing body of the local government unit that it has complied with this section and that no amendments to its plan or fiscal devices or official controls are necessary; or\n(b)(1) submit the entire updated comprehensive plan and amendment or amendments to its comprehensive plan necessitated by its review to the Metropolitan Council for review; and\n(2) submit the amendment or amendments to its fiscal devices or official controls necessitated by its review to the Metropolitan Council for information purposes as provided by section 473.865.\nExcept as otherwise provided in this paragraph, local governments shall consider, in preparing their updated comprehensive plans, amendments to metropolitan system plans in effect on December 31, 1996. For metropolitan system plans, or amendments thereto, adopted after December 31, 1996, local governments shall review their comprehensive plans to determine if an amendment is necessary to conform to the metropolitan system plans. If an amendment is necessary, the local government shall prepare the amendment and submit it to the council for review by September 30, 1999, or nine months after the council transmits the metropolitan system plan amendment to the local government, whichever is later.\nThe periodic review required in this subdivision shall be in addition to the review required by section 473.856.\nThe Metropolitan Council may grant extensions to local government units in order to allow local government units to complete the review and, if necessary, amendment required by this subdivision. Such extensions, if granted by the Metropolitan Council, must include a timetable and plan for completion of the review and amendment.\nAmendments to comprehensive plans of local governmental units shall be prepared, submitted, and adopted in conformance with guidelines adopted by the Metropolitan Council pursuant to section 473.854.",
	"repealed": false
}