{
	"id": "84A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.02",
	"title": "84A.02 DEPARTMENT TO MANAGE PRESERVE.",
	"text": "(a) The Department of Natural Resources shall manage and control the Red Lake Game Preserve. The department may adopt and enforce rules for the care, preservation, protection, breeding, propagation, and disposition of all species of wildlife in the preserve. The department may adopt and enforce rules for the regulation, issuance, sale, and revocation of special licenses or special permits for hunting, fishing, camping, and other uses of this area, consistent with sections 84A.01 to 84A.101. The department may by rule set the terms, conditions, and charges for these licenses and permits.\n(b) The rules may specify and control the terms under which wildlife may be taken, captured, or killed in the preserve, and under which fur-bearing animals, or animals and fish otherwise having commercial value, may be taken, captured, trapped, killed, sold, and removed from it. These rules may also provide for (1) the afforestation and reforestation of state lands in the preserve, (2) the sale of merchantable timber from these lands when, in the opinion of the department, it can be sold and removed without damage or injury to the further use and development of the land for wildlife and game in the preserve, and (3) the purposes for which the preserve is established by sections 84A.01 to 84A.101.\n(c) The department may provide for the policing of the preserve as necessary for its proper development and use for the purposes specified. The commissioner of natural resources may employ and designate individuals according to section 84.0835 to enforce laws governing the use of the preserve.\n(d) The department shall also adopt and enforce rules concerning the burning of grass, timber slashings, and other flammable matter, and the clearing, development, and use of lands in the preserve as necessary to prevent forest fires and grass fires that would injure the use and development of this area for wildlife preservation and propagation and to protect its forest and wooded areas.\n(e) Lands within the preserve are subject to the rules, whether owned by the state or privately, consistent with the rights of the private owners and with applicable state law. The rules may establish areas and zones within the preserve where hunting, fishing, trapping, or camping is prohibited or specially regulated, to protect and propagate particular wildlife in the preserve.\n(f) Rules adopted under sections 84A.01 to 84A.101 must be posted on the boundaries of the preserve.",
	"repealed": false
}