{
	"id": "145.9255",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9255",
	"title": "145.9255 MINNESOTA EDUCATION NOW AND BABIES LATER; HEALTH.",
	"text": "To the extent funds are available for the purposes of this subdivision, the commissioner of health, in consultation with a representative from Minnesota planning, the commissioner of human services, and the commissioner of education, shall develop and implement the Minnesota education now and babies later (MN ENABL) program, targeted to adolescents ages 12 to 14, with the goal of reducing the incidence of adolescent pregnancy in the state and promoting abstinence until marriage. The program must provide a multifaceted, primary prevention, community health promotion approach to educating and supporting adolescents in the decision to postpone sexual involvement modeled after the ENABL program in California. The commissioner of health shall consult with the chief of the health education section of the California Department of Health Services for general guidance in developing and implementing the program.\n\"Community-based local contractor\" or \"contractor\" includes community health boards under section 145A.02, nonprofit organizations, or school districts. The community-based local contractors may provide the education component of MN ENABL in a variety of settings including, but not limited to, schools, religious establishments, local community centers, and youth camps.\nThe commissioner shall:\n(1) manage the grant process, including awarding and monitoring grants to community-based local contractors, and may contract with community-based local contractors that can demonstrate at least a 25 percent local match and agree to participate in the four MN ENABL program components under subdivision 4;\n(2) provide technical assistance to the community-based local contractors as necessary under subdivision 4;\n(3) develop and implement the evaluation component, and provide centralized coordination at the state level of the evaluation process; and\n(4) explore and pursue the federal funding possibilities and specifically request funding from the United States Department of Health and Human Services to supplement the development and implementation of the program.\n(a) The program must include the following four major components:\n(b) A community organization component in which the community-based local contractors shall include:\n(1) use of a postponing sexual involvement education curriculum targeted to boys and girls ages 12 to 14 in schools and community settings;\n(2) planning and implementing community organization strategies to convey and reinforce the MN ENABL message of postponing sexual involvement, including activities promoting awareness and involvement of parents and other primary caregivers/significant adults, schools, and community; and\n(3) development of local media linkages.\n(c) A statewide, comprehensive media and public relations campaign to promote changes in sexual attitudes and behaviors, and reinforce the message of postponing adolescent sexual involvement and promoting abstinence from sexual activity until marriage. Nothing in this paragraph shall be construed to prevent the commissioner from targeting populations that historically have had a high incidence of adolescent pregnancy with culturally appropriate messages on abstinence from sexual activity.\nThe commissioner of health, in consultation with the commissioner of education, shall develop and implement the media and public relations campaign. In developing the campaign, the commissioner of health shall coordinate and consult with representatives from ethnic and local communities to maximize effectiveness of the social marketing approach to health promotion among the culturally diverse population of the state. The commissioner may continue to use any campaign materials or media messages developed or produced prior to July 1, 1999.\nThe local community-based contractors shall collaborate and coordinate efforts with other community organizations and interested persons to provide school and community-wide promotional activities that support and reinforce the message of the MN ENABL curriculum.\n(d) An evaluation component which evaluates the process and the impact of the program.\nThe \"process evaluation\" must provide information to the state on the breadth and scope of the program. The evaluation must identify program areas that might need modification and identify local MN ENABL contractor strategies and procedures which are particularly effective. Contractors must keep complete records on the demographics of clients served, number of direct education sessions delivered and other appropriate statistics, and must document exactly how the program was implemented. The commissioner may select contractor sites for more in-depth case studies.\nThe \"impact evaluation\" must provide information to the state on the impact of the different components of the MN ENABL program and an assessment of the impact of the program on adolescents' related sexual knowledge, attitudes, and risk-taking behavior.\nThe commissioner shall compare the MN ENABL evaluation information and data with similar evaluation data from other states pursuing a similar adolescent pregnancy prevention program modeled after ENABL and use the information to improve MN ENABL and build on aspects of the program that have demonstrated a delay in adolescent sexual involvement.\n(e) A training component requiring the commissioner of health, in consultation with the commissioner of education, to provide comprehensive uniform training to the local MN ENABL community-based local contractors and the direct education program staff.\nThe local community-based contractors may use adolescent leaders slightly older than the adolescents in the program to impart the message to postpone sexual involvement provided:\n(1) the contractor follows a protocol for adult mentors/leaders and older adolescent leaders established by the commissioner of health;\n(2) the older adolescent leader is accompanied by an adult leader; and\n(3) the contractor uses the curriculum as directed and required by the commissioner of the Department of Health to implement this part of the program. The commissioner of health shall provide technical assistance to community-based local contractors.",
	"repealed": false
}