{
	"id": "469.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.53",
	"title": "469.53 REGIONAL EXCHANGE DISTRICT PUBLIC INFRASTRUCTURE PROJECTS.",
	"text": "(a) The following projects shall be eligible for state appropriation support payments upon approval by the Duluth City Council. Costs may be reimbursed for eligible projects that begin construction prior to September 30, 2020, but in no case may the total state payment per project exceed the amount established in this section. Eligible costs for the projects in this paragraph may include expenditures as defined in section 469.54, subdivision 1, including but not limited to planning, acquisition, predesign, design, construction, site preparation, demolition costs, furnishing, and equipping. Eligible projects include:\n(1) demolition and replacement of a skywalk connected to an existing medical district parking ramp in an amount not to exceed $2,100,000, including any land acquisition;\n(2) a ramp with up to 1,400 new parking stalls to serve medical entity west in an amount not to exceed $37,900,000, including any land acquisition;\n(3) extension of 6th Avenue East from 2nd Street to 1st Street in an amount not to exceed $6,650,000, including any land acquisition;\n(4) demolition of existing hospital structure for site reuse, to accomplish the purposes in section 469.51, subdivision 2, in an amount not to exceed $11,820,000;\n(5) roadway, utility, and site improvements and capacity upgrades to support medical entity west hospital construction in an amount not to exceed $13,950,000;\n(6) district energy connections, capacity enhancement, a pressure pump station, and district energy utility improvements outside of the district reasonably necessary and advantageous to services developments within the district in an amount not to exceed $7,000,000;\n(7) a ramp with up to 400 new parking stalls to serve medical entity east in an amount not to exceed $14,000,000; and\n(8) site improvements made upon private property and within the public realm, including retaining walls, public sidewalks, public stairs, and other related infrastructure, necessary to support medical entity west hospital construction in an amount not less than $1,300,000 or in excess of $4,300,000.\n(b) Upon notice to the commissioner of employment and economic development, any unexpended amount for the projects described in paragraph (a), clauses (1) to (4) and (8), that have been substantially completed may fund the project in paragraph (a), clause (5). The unexpended amounts applied to the project in paragraph (a), clause (5), shall be in addition to the amount specified for that project. The Duluth City Council must submit a written plan to the commissioner of employment and economic development to use unexpended funds in the manner under this paragraph.\n(c) For any public infrastructure project that will not be let by the city for which state support is sought, the project must proceed and comply with any state and local contracting requirements otherwise applicable to the city had the city let the project. The city shall have the right to inspect, upon reasonable notice, the construction contracts and related documentation for any public infrastructure project for which state support is sought.",
	"repealed": false
}