{
	"id": "120B.117",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.117",
	"title": "120B.117 INCREASING PERCENTAGE OF TEACHERS OF COLOR AND AMERICAN INDIAN TEACHERS IN MINNESOTA.",
	"text": "This section sets short-term and long-term attainment goals for increasing the percentage of teachers of color and who are American Indian teachers in Minnesota and for ensuring all students have equitable access to effective and racially and ethnically diverse teachers who reflect the diversity of students. The goals and report required under this section are important for meeting attainment goals for comprehensive achievement and civic readiness under section 120B.11, achievement and integration under section 124D.861, and higher education attainment under section 135A.012, all of which have been established to close persistent opportunity and achievement gaps that limit students' success in school and life and impede the state's economic growth.\nThe percentage of teachers in Minnesota who are of color or who are American Indian should increase at least two percentage points per year to have a teaching workforce that more closely reflects the state's increasingly diverse student population and to ensure all students have equitable access to effective and diverse teachers by 2040.\nThe attainment goal in this section is not to the exclusion of any other goals and does not confer a right or create a claim for any person.\nThe Professional Educator Licensing and Standards Board must collaborate with the Department of Education and the Office of Higher Education to publish a summary report of each of the programs they administer and any other programs receiving state appropriations that have or include an explicit purpose of increasing the racial and ethnic diversity of the state's teacher workforce to more closely reflect the diversity of students. The report must include programs under sections 122A.59, 122A.63, 122A.635, 122A.70, 122A.73, 124D.09, 124D.861, 136A.1274, 136A.1276, and 136A.1791, along with any other programs or initiatives that receive state appropriations to address the shortage of teachers of color and American Indian teachers. The board must, in coordination with the Office of Higher Education and Department of Education, provide policy and funding recommendations related to state-funded programs to increase the recruitment, preparation, licensing, hiring, and retention of racially and ethnically diverse teachers and the state's progress toward meeting or exceeding the goals of this section. The report must include recommendations for state policy and funding needed to achieve the goals of this section, plans for sharing the report and activities of grant recipients, and opportunities among grant recipients of various programs to share effective practices with each other. The initial report must also include a recommendation of whether a state advisory council should be established to address the shortage of racially and ethnically diverse teachers and what the composition and charge of such an advisory council would be if established. The board must consult with the Indian Affairs Council and other ethnic councils along with other community partners, including students of color and American Indian students, in developing the report. The board must submit the report to the chairs and ranking minority members of the legislative committees with jurisdiction over education and higher education policy and finance by November 3, 2025, for the initial report, and by November 3 each even-numbered year thereafter. The report must be available to the public on the board's website.",
	"repealed": false
}