{
	"id": "124D.862",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.862",
	"title": "124D.862 ACHIEVEMENT AND INTEGRATION REVENUE.",
	"text": "(a) An eligible district's initial achievement and integration revenue equals the lesser of 100.3 percent of the district's expenditures under the budget approved by the commissioner under section 124D.861, subdivision 3, paragraph (c), excluding expenditures used to generate incentive revenue under subdivision 2, or the sum of (1) $350 times the district's adjusted pupil units for that year times the ratio of the district's enrollment of protected students for the previous school year to total enrollment for the previous school year and (2) the greater of zero or 66 percent of the difference between the district's integration revenue for fiscal year 2013 and the district's integration revenue for fiscal year 2014 under clause (1).\n(b) In each year, an amount equal to 0.3 percent of each district's initial achievement and integration revenue for the second prior fiscal year is transferred to the department for the oversight and accountability activities required under this section and section 124D.861.\nAn eligible school district's maximum incentive revenue equals $10 per adjusted pupil unit. A district's incentive revenue equals the lesser of the maximum incentive revenue or the district's expenditures for implementing a voluntary plan to reduce racial and economic enrollment disparities through intradistrict and interdistrict activities that have been approved as a part of the district's achievement and integration plan under the budget approved by the commissioner under section 124D.861, subdivision 3, paragraph (c).\nAchievement and integration revenue equals the sum of initial achievement and integration revenue and incentive revenue.\nFor fiscal year 2015 and later, a district's achievement and integration aid equals 70 percent of its achievement and integration revenue.\nA district's achievement and integration levy equals its achievement and integration revenue times 30 percent. For Special School District No. 1, Minneapolis; Independent School District No. 625, St. Paul; and Independent School District No. 709, Duluth, 100 percent of the levy certified under this subdivision is shifted into the prior calendar year for purposes of sections 123B.75, subdivision 5, and 127A.441.\n(a) At least 80 percent of a district's achievement and integration revenue received under this section must be used for innovative and integrated learning environments, school enrollment choices, family engagement activities, and other approved programs providing direct services to students.\n(b) Up to 20 percent of the revenue may be used for professional development and staff development activities and placement services.\n(c) No more than ten percent of the total amount of revenue may be spent on administrative services.\nIntegration revenue received under this section must be reserved and used only for the programs authorized in subdivision 2.\n(a) The commissioner must review the results of each district's integration and achievement plan by August 1 at the end of the third year of implementing the plan and determine if the district met its goals.\n(b) If a district met its goals, it may submit a new three-year plan to the commissioner for review.\n(c) If a district has not met its goals, the commissioner must:\n(1) guide the district in the development of an improvement plan and timeline that identifies strategies and practices designed to meet the district's goals under this section and section 120B.11; and\n(2) use up to 20 percent of the district's integration revenue, until the district's goals are reached, to implement the improvement plan.",
	"repealed": false
}