{
	"id": "462A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.09",
	"title": "462A.09 BONDS AND NOTES; RESOLUTIONS AUTHORIZING, ADDITIONAL TERMS, SALE.",
	"text": "The notes and bonds of the agency shall be authorized by a resolution or resolutions adopted by the agency, shall bear such date or dates, shall mature at such time or times, shall bear interest at such rate or rates, be in such denominations, be in such form, carry such registration privileges, be executed in such manner, be payable in lawful money of the United States of America, at such place or places within or without the state, and be subject to such terms of redemption prior to maturity as such resolutions or certificates may provide. If, for any reason, whether existing at the date of issue of any bonds or notes or at the date of making or purchasing any loan or securities from the proceeds or thereafter, the interest on any bonds or notes shall be or become subject to federal income taxation, this shall not impair or affect the validity or the provisions made for the security of the bonds or notes. The agency may make such covenants and take or cause to be taken such actions as are in its judgment necessary or desirable to comply with conditions established by federal law or regulations for the exemption of interest on its obligations. The agency may refrain from compliance with such conditions if in its judgment this would serve the purposes and policies set forth in this chapter with respect to any particular issue of bonds or notes, unless this would violate covenants made by the agency. No note shall mature more than ten years from its date or from the date of any note refunded thereby. The maximum maturity of any bond, whether or not issued for the purpose of refunding, shall be 50 years from its date. The notes and bonds of the agency may be sold at public or private sale, at such price or prices as the agency shall determine; provided that (i) the aggregate price at which an issue of notes or bonds is initially offered by underwriters to investors, as set forth in the agency's official statement with respect to the offering, shall not exceed by more than three percent the aggregate price paid by the underwriters to the agency at the time of delivery; (ii) the commission paid by the agency to an underwriter or agent for placing an issue of notes or bonds with investors shall not exceed three percent of the aggregate price at which the issue is offered to investors as set forth in the agency's offering statement; and (iii) the spread or commission shall be an amount determined by the agency to be reasonable in the light of the risk assumed and the expenses of issuance, if any, required to be paid by the underwriters or agent.",
	"repealed": false
}