{
	"id": "149A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.04",
	"title": "149A.04 ENFORCEMENT.",
	"text": "The provisions of this chapter and all laws, now in force or later enacted, rules, orders, stipulation agreements, settlements, compliance agreements, licenses, and permits adopted or issued for the regulation of the removal, preparation, transportation, arrangements for disposition, or final disposition of dead human bodies or for the regulation of the practice of mortuary science may be enforced under this section.\nThe regulatory agency or a designee of the regulatory agency shall conduct initial licensure inspections and corrective order reinspections. As a condition of continued licensure, compliance reviews or premises inspections of licensees shall be conducted by the regulatory agency or a designee of the regulatory agency at least biennially. A compliance review or an inspection of the premises of any person subject to regulation under this chapter may also be conducted when the regulatory agency reasonably suspects that there may be a violation or a threat of a violation of any law now in force or later enacted, rule, order, stipulation agreement, settlement, compliance agreement, license, or permit issued by the regulatory agency. When possible, all inspections and compliance reviews shall be conducted without prior notice to the subject of the inspection or review and shall be performed in the presence of the subject of the inspection or review or an authorized representative of the subject of the inspection or review.\nThe regulatory agency or a designee of the regulatory agency, upon presentation of credentials, may:\n(1) examine and copy any relevant books, papers, records, memoranda, or data of any person subject to regulation under this chapter; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized under this chapter or rules, orders, stipulation agreements, settlements, compliance agreements, licenses, or permits adopted or issued by the regulatory agency, including obtaining information from a person that has a duty to provide information under this chapter or conducting inspections or investigations.\nThe regulatory agency may, as part of an investigation, issue subpoenas to require the attendance and testimony of witnesses and production of books, records, correspondence, and other information relevant to any matter involved in the investigation. The regulatory agency or the regulatory agency's designee may administer oaths to witnesses or take their affirmation. The subpoenas may be served upon any person named therein anywhere in the state by any person authorized to serve subpoenas or other processes in civil actions of the district courts. If a person to whom a subpoena is issued does not comply with the subpoena, the regulatory agency may apply to the district court in any district and the court may order compliance with the subpoena. Failure to obey the order of the court may be punished as contempt of court.\nData relating to any disciplinary measures or actions anticipated or taken by the regulatory agency are classified as follows:\n(1) data on persons other than individuals are civil investigative data under section 13.39;\n(2) data on individuals are licensing data under section 13.41; and\n(3) data on individuals who submit complaints to the regulatory agency regarding activities or practices regulated under this chapter are confidential data on individuals while an investigation is active and private data on individuals when an investigation becomes inactive.\nThe regulatory agency shall encourage and promote cooperation between and among other state and federal authorities where there is concurrent or overlapping enforcement or licensing jurisdiction.",
	"repealed": false
}