{
	"id": "58.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.06",
	"title": "58.06 APPLICATION REQUIREMENTS FOR RESIDENTIAL MORTGAGE ORIGINATORS AND SERVICERS.",
	"text": "Application for a residential mortgage originator or a residential mortgage servicer license must be in writing, under oath, and on a form obtained from and prescribed by the commissioner.\n(a) The application must contain the name and complete business address or addresses of the license applicant. The license applicant must be a partnership, limited liability partnership, association, limited liability company, corporation, or other form of business organization, and the application must contain the names and complete business addresses of each partner, member, director, and principal officer. The application must also include a description of the activities of the license applicant, in the detail and for the periods the commissioner may require.\n(b) A residential mortgage originator applicant must submit a surety bond that meets the requirements of section 58.08, subdivision 1a.\n(c) The application must also include all of the following:\n(1) an affirmation under oath that the applicant:\n(i) is in compliance with the requirements of section 58.125;\n(ii) will advise the commissioner of any material changes to the information submitted in the most recent application within ten days of the change;\n(iii) will advise the commissioner in writing immediately of any bankruptcy petitions filed against or by the applicant or licensee;\n(iv) will maintain at all times a surety bond in the amount of at least $100,000;\n(v) complies with federal and state tax laws; and\n(vi) complies with sections 345.31 to 345.60, the Minnesota unclaimed property law;\n(2) information as to the mortgage lending, servicing, or brokering experience of the applicant and persons in control of the applicant;\n(3) information as to criminal convictions, excluding traffic violations, of persons in control of the license applicant;\n(4) whether a court of competent jurisdiction has found that the applicant or persons in control of the applicant have engaged in conduct evidencing gross negligence, fraud, misrepresentation, or deceit in performing an act for which a license is required under this chapter;\n(5) whether the applicant or persons in control of the applicant have been the subject of: an order of suspension or revocation, cease and desist order, or injunctive order, or order barring involvement in an industry or profession issued by this or another state or federal regulatory agency or by the Secretary of Housing and Urban Development within the ten-year period immediately preceding submission of the application; and\n(6) other information required by the commissioner.\nThe commissioner may, for good cause shown, waive any requirement of this section with respect to an initial license application or to permit a license applicant to submit substituted information in its license application in lieu of the information required by this section.\nSection 58A.04, subdivisions 2 and 3, apply to this section.\nIn connection with an application for a residential mortgage loan originator or servicer license, any person in control of an applicant must, at a minimum, provide the Nationwide Multistate Licensing System and Registry information concerning the person's identity, including:\n(1) fingerprints for submission to the Federal Bureau of Investigation and a governmental agency or entity authorized to receive the information for a state, national, and international criminal history background check; and\n(2) personal history and experience in a form prescribed by the Nationwide Multistate Licensing System and Registry, including the submission of authorization for the Nationwide Multistate Licensing System and Registry and the commissioner to obtain:\n(i) an independent credit report obtained from a consumer reporting agency described in United States Code, title 15, section 1681a(p); and\n(ii) information related to administrative, civil, or criminal findings by a governmental jurisdiction.\nFor the purposes of this section and in order to reduce the points of contact the Federal Bureau of Investigation may have to maintain for purposes of subdivision 5, clauses (1) and (2), the commissioner may use the Nationwide Multistate Licensing System and Registry as a channeling agent to request information from and distribute information to the United States Department of Justice or any governmental agency.\nFor the purposes of this section and in order to reduce the points of contact the commissioner may have to maintain for purposes of subdivision 5, clause (2), the commissioner may use the Nationwide Multistate Licensing System and Registry as a channeling agent to request and distribute information from and to any source, as directed by the commissioner.",
	"repealed": false
}