{
	"id": "28A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.05",
	"title": "28A.05 CLASSIFICATION.",
	"text": "All persons required to have a license under section 28A.04 shall be classified into one of the following classes of food handlers, according to their principal mode of business.\n(a) Retail food handlers are persons who sell or process and sell food directly to the ultimate consumer or who custom process meat or poultry. The term includes a person who sells food directly to the ultimate consumer through the use of vending machines, and a person who sells food for consumption on site or off site if the sale is conducted on the premises that are part of a grocery or convenience store operation.\n(b) Wholesale food handlers are persons who sell to others for resale. A person who handles food in job lots (jobbers) is included in this classification.\n(c) Wholesale food processors or manufacturers are persons who process or manufacture raw materials and other food ingredients into food items, or who reprocess food items, or who package food for sale to others for resale, or who commercially slaughter animals or poultry. Included herein are persons who can, extract, ferment, distill, pickle, bake, freeze, dry, smoke, grind, mix, stuff, pack, bottle, recondition, or otherwise treat or preserve food for sale to others for resale, cold storage warehouse operators as defined in section 28.01, subdivision 3, salvage food processors as defined in section 31.495, subdivision 1, and dairy plants as defined in section 32D.01, subdivision 6.\n(d) Custom exempt food handlers are persons who only conduct custom exempt processing as defined in section 31A.02, subdivision 5. A retail or wholesale transaction may not take place in a facility operated by a person with a custom exempt food handler license.\n(e) A food broker is a person who buys and sells food and who negotiates between a buyer and a seller of food, but who at no time has custody of the food being bought and sold.",
	"repealed": false
}