{
	"id": "550.365",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.365",
	"title": "550.365 MEDIATION NOTICE AND REQUIREMENTS FOR AGRICULTURAL PROPERTY.",
	"text": "A person may not attach, execute on, levy on, or seize agricultural property subject to sections 583.20 to 583.32 that has secured a debt of more than the amount provided in section 583.24, subdivision 5, unless: (1) a mediation notice is served on the judgment debtor and a copy served on the director and the debtor and creditor have completed mediation under sections 583.20 to 583.32; or (2) as otherwise allowed under sections 583.20 to 583.32.\nA mediation notice must contain the following notice with the blanks properly filled in.\n\"TO: ....(Name of Judgment Debtor)....\nA JUDGMENT WAS ORDERED AGAINST YOU BY ....(Name of Court).... ON....(Date of Judgment).\nAS A JUDGMENT CREDITOR, ....(Name of Judgment Creditor).... INTENDS TO TAKE ACTION AGAINST THE AGRICULTURAL PROPERTY DESCRIBED AS....(Description of Agricultural Property).... TO SATISFY THE JUDGMENT IN THE AMOUNT OF ....(Amount of Debt)....\nYOU HAVE THE RIGHT TO HAVE THE DEBT REVIEWED FOR MEDIATION. IF YOU REQUEST MEDIATION, A DEBT THAT IS IN DEFAULT WILL BE MEDIATED ONLY ONCE. IF YOU DO NOT REQUEST MEDIATION, THIS DEBT WILL NOT BE SUBJECT TO FUTURE MEDIATION IF THE SECURED PARTY ENFORCES THE DEBT.\nIF YOU PARTICIPATE IN MEDIATION, THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE WILL PROVIDE AN ORIENTATION MEETING AND A FINANCIAL ANALYST TO HELP YOU PREPARE FINANCIAL INFORMATION. IF YOU DECIDE TO PARTICIPATE IN MEDIATION, IT WILL BE TO YOUR ADVANTAGE TO ASSEMBLE YOUR FARM FINANCE AND OPERATION RECORDS AND TO CONTACT A COUNTY EXTENSION OFFICE AS SOON AS POSSIBLE. MEDIATION WILL ATTEMPT TO ARRIVE AT AN AGREEMENT FOR HANDLING FUTURE FINANCIAL RELATIONS.\nTO HAVE THE DEBT REVIEWED FOR MEDIATION YOU MUST FILE A MEDIATION REQUEST WITH THE DIRECTOR WITHIN 14 DAYS AFTER YOU RECEIVE THIS NOTICE. THE MEDIATION REQUEST FORM IS AVAILABLE FROM THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE.\nFROM: ....(Name and Address of Judgment Creditor)....\"",
	"repealed": false
}