{
	"id": "62D.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.045",
	"title": "62D.045 INVESTMENT RESTRICTIONS.",
	"text": "Funds of a health maintenance organization shall be invested only in securities and property designated by law for investment by domestic life insurance companies, except that money may be used to purchase real estate, including leasehold estates and leasehold improvements, for the convenient accommodation of the organization's business operations, including the home office, branch offices, medical facilities, and field office operations, on the following conditions:\n(1) a parcel of real estate acquired under this subdivision may include excess space for rent to others if it is reasonably anticipated that the excess will be required by the organization for expansion or if the excess is reasonably required in order to have one or more buildings that will function as an economic unit;\n(2) the real estate may be subject to a mortgage; and\n(3) the purchase price of the asset, including capitalized permanent improvements, less depreciation spread evenly over the life of the property or less depreciation computed on any basis permitted under the Internal Revenue Code and its regulations, or the organization's equity, plus all encumbrances on the real estate owned by a company under this subdivision, whichever is greater, does not exceed 20 percent of its admitted assets, except if, when calculated in combination with the assets described in section 62D.044, clause (17), the total of said assets and the real estate assets described hereunder do not exceed the total combined percent limitations allowable under this section and section 62D.044, clause (17), or, if permitted by the commissioner upon a finding that the percentage of the health maintenance organization's admitted assets is insufficient to provide convenient accommodation for the organization's business. However, a health maintenance organization that owns property used in the delivery of medical services for its enrollees may invest an additional 20 percent of its admitted assets in real estate, not requiring the permission of the commissioner.\nA health maintenance organization shall not make or engage in a loan or investment unless the loan or investment has been authorized or ratified by the board of directors or by a committee supervising investments and loans. In addition, a health maintenance organization must comply with section 60A.112.\nA health maintenance organization shall not pay a commission or brokerage for the purchase or sale of real or personal property that exceeds usual and customary commissions or brokerage at the time and place of the purchases or sales. Information regarding payments of commissions and brokerage must be maintained by the health maintenance organization.\nA health maintenance organization shall not knowingly, directly or indirectly, invest in or loan upon any real or personal property, in which any principal officer or director of the organization has a financial interest. An organization shall not make a loan to a principal officer or director of the organization.\nThis section shall not apply to a health maintenance organization which has a city or county as a guaranteeing organization.",
	"repealed": false
}