{
	"id": "169A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.40",
	"title": "169A.40 ARREST POWERS.",
	"text": "A peace officer may lawfully arrest a person for violation of section 169A.20 (driving while impaired), 169A.31 (alcohol-related school bus or Head Start bus driving), or 169A.33 (underage drinking and driving), without a warrant upon probable cause, without regard to whether the violation was committed in the officer's presence.\nWhen a peace officer has probable cause to believe that a person is driving or operating a motor vehicle in violation of section 169A.20 (driving while impaired), 169A.31 (alcohol-related school bus or Head Start bus driving), or 169A.33 (underage drinking and driving) and before a stop or arrest can be made the person escapes from the geographical limits of the officer's jurisdiction, the officer in fresh pursuit of the person may stop or arrest the person in another jurisdiction within this state and may exercise the powers and perform the duties of a peace officer under this chapter. An officer acting in fresh pursuit pursuant to this section is serving in the regular line of duty as fully as though within the officer's jurisdiction.\n(a) Notwithstanding rule 6.01 of the Rules of Criminal Procedure, a peace officer acting without a warrant who has decided to proceed with the prosecution of a person for violating section 169A.20 (driving while impaired), shall arrest and take the person into custody if the officer has reason to believe that the violation occurred:\n(1) under the circumstances described in section 169A.24 (first-degree driving while impaired);\n(2) under the circumstances described in section 169A.25 (second-degree driving while impaired);\n(3) under the circumstances described in section 169A.26 (third-degree driving while impaired) if the person is under the age of 19;\n(4) in the presence of an aggravating factor described in section 169A.03, subdivision 3, clause (2) or (3); or\n(5) while the person's driver's license or driving privileges have been canceled under section 171.04, subdivision 1, clause (10) (persons not eligible for drivers' licenses, inimical to public safety).\n(b) A person described in paragraph (a), clause (1) or (5), must be detained until the person's first court appearance.\nThe express grant of arrest powers in this section does not limit the arrest powers of peace officers pursuant to sections 626.65 to 626.70 (uniform law on fresh pursuit) or section 629.40 (allowing arrests anywhere in state) in cases of arrests for violation of section 169A.20 (driving while impaired), 169A.31 (alcohol-related school bus or Head Start bus driving), 169A.33 (underage drinking and driving), or any other provision of law.",
	"repealed": false
}