{
	"id": "326B.986",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.986",
	"title": "326B.986 FEES FOR INSPECTION.",
	"text": "The fees for the inspection of the hull, boiler, machinery, and equipment of vessels operated on inland waters and that carry passengers for hire are as follows:\n(1) annual operating permit and safety inspections shall be $200; and\n(2) other inspections, including dry-dock inspections, boat stability tests, and plan reviews, are billed at the hourly rate set in subdivision 4.\n[Repealed, 2010 c 347 art 3 s 75]\nThe fees for the annual inspection of boilers and biennial inspection of pressure vessels are as follows:\n(1) boiler inaccessible for internal inspection, $55;\n(2) boiler accessible for internal inspection, $55;\n(3) boiler internal inspection over 2,000 square feet heating surface shall be billed at the hourly rate set in subdivision 4;\n(4) boiler accessible for internal inspection requiring one-half day or more of inspection time shall be billed at the hourly rate set in subdivision 4;\n(5) pressure vessel for internal inspection via manhole, $35; and\n(6) pressure vessel inaccessible for internal inspection, $35.\nThe hourly rate for an inspection not set elsewhere in sections 326B.954 to 326B.998 is $80 per hour. Inspection time includes all time related to the inspection. Travel time, billed at the hourly rate, and travel expenses shall be billed for shop inspections, triennial audits, boat stability tests, hydrostatic tests of a boiler or pressure vessel, or any other inspection or consultation requiring a special trip.\n(a) For purposes of calculating license fees and renewal license fees required under section 326B.092:\n(1) the boiler special engineer license is an entry level license;\n(2) the following licenses are journeyworker licenses: first class engineer, Grade A; first class engineer, Grade B; first class engineer, Grade C; second class engineer, Grade A; second class engineer, Grade B; second class engineer, Grade C; and provisional license; and\n(3) the following licenses are master licenses: boiler chief engineer, Grade A; boiler chief engineer, Grade B; boiler chief engineer, Grade C; boiler inspector certificate of competency; and traction or hobby boiler engineer.\n(b) Notwithstanding section 326B.092, subdivision 7, paragraph (a), the license duration for steam traction and hobby engineer licenses are one year only for the purpose of calculating license fees under section 326B.092, subdivision 7, paragraph (b).\nThe fee for an examination of an applicant for a National Board of Boiler and Pressure Vessels Inspectors commission is $100.\nThe fee for each examination of an applicant for a National Board of Boiler and Pressure Vessels commissioned inspectors nuclear endorsement is $100.\n(a) The fee for issuance of the original certificate of competency is $85 for inspectors who did not pay the national board examination fee specified in subdivision 6, or $35 for inspectors who paid that examination fee. Each applicant for a certificate of competency must complete an interview with the chief boiler inspector before issuance of the certificate of competency.\n(b) All initial certificates of competency shall be effective for more than one calendar year and shall expire on December 31 of the year after the year in which the application is made.\n(c) All renewed certificates of competency shall be valid for two calendar years. The fee for renewal of the state of Minnesota certificate of competency is $70, and is due the day after the certificate expires.\nThe annual registration fee for boilers and pressure vessels in use and required to be inspected per section 326B.958 shall be $10 per boiler and pressure vessel.\nThe commissioner shall assess a late fee of $100 for each invoice issued under subdivision 1, 3, or 4 that is not paid in full by the due date stated on the invoice.",
	"repealed": false
}