{
	"id": "46.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.045",
	"title": "46.045 MANDATORY INSURANCE OF ACCOUNTS.",
	"text": "Every bank shall at all times maintain in effect insurance of its deposits by the Federal Deposit Insurance Corporation, an agency of this state or a federal agency established for the purpose of insuring deposits in banking institutions. In the case of fiduciary funds deposited with the bank, this insurance requirement may be met by depositing collateral security under section 48.74. A bank which fails to meet this requirement for insurance of its deposits shall either dissolve, merge or consolidate with another bank which is insured by the Federal Deposit Insurance Corporation, an agency of this state or a federal agency established for the purpose of insuring deposits in banks. For purposes of this section, \"bank\" means a bank defined in section 46.046, subdivision 2, which accepts deposits.\n[Repealed, 2014 c 222 art 1 s 58]\nThe requirements of this section may be met by trust companies not exercising banking powers, with the exception of deposit activities as defined in this subdivision, provided the following conditions are met:\n(a) the number of nonfiduciary deposit accounts does not exceed 35, and;\n(b) the total amount held in nonfiduciary deposit accounts does not exceed five percent of the aggregate of the trust company's capital stock, surplus, and undivided profits, and;\n(c) the nonfiduciary funds deposited with the trust company referred to in (a) and (b) shall be secured against loss by the assignment, transfer to, and deposit with the commissioner of commerce or a designee, of direct obligations of the United States government in an amount, based upon the securities market value, of not less than 110 percent of such deposited funds, with the right of the trust company to collect the income and to substitute other like securities of equal value, and;\n(d) each account holder must be disclosed to in writing that the account is not insured by the federal or state governments or their agencies, and;\n(e) the determination of the limitations in (a) and (b) shall be made by the trust company from the records of the trust company and based upon statement of financial condition at the close of each business day, and security deposit defined in (c) adjusted if needed within one business day thereafter, and;\n(f) any violation of the requirements in (a) to (e) shall be grounds for action by the commissioner under sections 46.24 to 46.33.\nNo bank shall be issued a certificate of authorization after the effective date of Laws 1982, chapter 473, sections 1 to 29 unless the bank has obtained a commitment for insurance of its deposits by the Federal Deposit Insurance Corporation, an agency of this state or a federal agency established for the purpose of insuring deposits of banks.\nIn any case where Minnesota Statutes require, either generally or by reference to a specific program, that deposits in any financial institution be insured, the requirement shall be deemed satisfied if the deposits are insured in the requisite amount by an agency of the federal government insuring deposits.",
	"repealed": false
}