{
	"id": "308B.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.601",
	"title": "308B.601 MEMBERSHIP INTERESTS.",
	"text": "The authorized amount and divisions of patron membership interests and, if authorized, nonpatron membership interests may be increased, decreased, established, or altered, in accordance with the restrictions in this chapter by amending the articles or bylaws at a regular members' meeting or at a special members' meeting called for the purpose of the amendment.\nAuthorized membership interests may be issued on terms and conditions prescribed in the articles, bylaws, or if authorized in the articles or bylaws as determined by the board. The cooperative shall disclose to any person or entity acquiring membership interests to be issued by the cooperative, the organization, capital structure, and known business prospects and risks of the cooperative, the nature of the governance and financial rights of the membership interest being acquired and of other classes of membership and membership interests. The cooperative shall notify all members of the membership interests being issued by the cooperative. A membership interest may not be issued until the subscription price of the membership interest has been paid for in money or property with the value of the property to be contributed approved by the board.\nThe patron membership interests collectively shall have not less than 60 percent of the cooperative's financial rights to profit allocations and distributions. If authorized in the original articles as filed, or articles or bylaws adopted by an affirmative vote of the patron members, or the articles or bylaws are amended by the affirmative vote of patron members, then the cooperative's financial rights to profit allocations and distributions to patron members collectively may be not less than 15 percent.\nAfter issuance by the cooperative, membership interests in a cooperative may only be sold or transferred with the approval of the board. The board may adopt resolutions prescribing procedures to prospectively approve transfers.\nIf authorized by the articles, the cooperative may solicit and issue nonpatron membership interests on terms and conditions determined by the board and disclosed in the articles, bylaws, or by separate disclosure to the members. Each member acquiring nonpatron membership interests shall sign a member control agreement or agree to the conditions of the bylaws, either of which shall describe the rights and obligations of the member as it relates to the nonpatron membership interests, the financial and governance rights, the transferability of the nonpatron membership interests, the division and allocations of profits and losses among the membership interests and membership classes, and financial rights upon liquidation. If the articles or bylaws do not otherwise provide for the allocation of the profits and losses between patron membership interests and nonpatron membership interests, then the allocation of profits and losses among nonpatron membership interests individually and patron membership interests collectively shall be allocated on the basis of the value of contributions to capital made according to the patron membership interests collectively and the nonpatron membership interests individually to the extent the contributions have been accepted by the cooperative. Distributions of cash or other assets of the cooperative shall be allocated among the membership interests as provided in the articles and bylaws, subject to the provisions of this chapter. If not otherwise provided in the articles or bylaws, distributions shall be made on the basis of value of the capital contributions of the patron membership interests collectively and the nonpatron membership interests to the extent the contributions have been accepted by the cooperative.\nThe articles or bylaws may provide that the cooperative or the patron members, individually or collectively, have the first privilege of purchasing the membership interests of any class of membership interests offered for sale. The first privilege to purchase membership interests may be satisfied by notice to other members that the membership interests are for sale and a procedure by which members may proceed to attempt to purchase and acquire the membership interests. A membership interest acquired by the cooperative may be held to be reissued or may be retired and canceled.\nSubject to the provisions in the articles and bylaws, a member may dissent from and obtain payment for the fair value of the member's nonpatron membership interests in the cooperative if the articles or bylaws are amended in a manner that materially and adversely affects the rights and preferences of the nonpatron membership interests of the dissenting member. The dissenting member shall file a notice of intent to demand fair value of the membership interest with the records officer of the cooperative within 30 days after the amendment of the bylaws and notice of the amendment to members, otherwise the right of the dissenting member to demand payment of fair value for the membership interest is waived. If a proposed amendment of the articles or bylaws must be approved by the members, a member who is entitled to dissent and who wishes to exercise dissenter's rights shall file a notice to demand fair value of the membership interest with the records officer of the cooperative before the vote on the proposed action and shall not vote in favor of the proposed action, otherwise the right to demand fair value for the membership interest by the dissenting member is waived. After receipt of the dissenting member's demand notice and approval of the amendment, the cooperative has 60 days to rescind the amendment or otherwise the cooperative shall remit the fair value for the member's interest to the dissenting member by 180 days after receipt of the notice. Upon receipt of the fair value for the membership interest, the member has no further member rights in the cooperative.",
	"repealed": false
}