{
	"id": "508A.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.58",
	"title": "508A.58 REGISTRATION AFTER FORECLOSURE; NEW CPT.",
	"text": "Any person who has, by an action or other proceeding to enforce or foreclose a mortgage, lien, or other charge upon land registered under sections 508A.01 to 508A.85, become the owner in fee of the land, or any part of it, may have the title registered. Except as provided in subdivision 2, the person shall apply by duly verified petition to the court for a new CPT to the land, and the court shall then, after due notice to all parties in interest and upon the hearing as the court may direct, make an order for the issuance of a new CPT to the person entitled thereto, and the registrar shall then enter a new CPT to the land, or of the part of it to which the petitioner is entitled as in the case of a voluntary conveyance.\nAny person who has become the owner in fee of land registered under sections 508A.01 to 508A.85, or any part of the land, pursuant to a mortgage foreclosure by action under chapter 581 is entitled to a new CPT for the land described in the sheriff's certificate of sale or so much of the land as may be described in the CPT, after the redemption period expires. The registrar shall enter a new CPT only pursuant to the court order provided in subdivision 1 or upon the written directive of the examiner of titles as to the legal sufficiency of the mortgage foreclosure proceeding. The directive of the examiner of titles also must specify the instruments the registrar shall omit from the new CPT by virtue of the foreclosure.\nThe registrar shall carry the memorials of all documents relating to a contract for deed cancellation until directed to remove them by court order or written examiner's directive. The examiner of titles may issue a written directive upon the request of the registered owner or other person in interest if documents evidencing a legally sufficient cancellation under section 559.21 have been of record on the CPT for at least five years. The documents must include a copy of the notice of cancellation of contract for deed with proof of service thereof, and the affidavit of the seller, the seller's agent, or the seller's attorney showing that the purchaser has not complied with the terms of the notice. The court order or written directive of the examiner of titles must also specify the instruments the registrar shall omit from any successor CPT or certificate of title because of cancellation of the contract for deed.",
	"repealed": false
}