{
	"id": "256K.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.26",
	"title": "256K.26 LONG-TERM HOMELESS SUPPORTIVE SERVICES.",
	"text": "The commissioner shall establish the long-term homeless supportive services fund to provide integrated services needed to stabilize individuals, families, and youth living in supportive housing developed to further the goals set forth in Laws 2003, chapter 128, article 15, section 9.\nThe commissioner, in consultation with the commissioners of the Department of Corrections and the Minnesota Housing Finance Agency, counties, Tribes, providers, and funders of supportive housing and services, shall develop application requirements and make funds available according to this section, with the goal of providing maximum flexibility in program design.\nFor purposes of this section, the following terms have the meanings given:\n(1) \"long-term homelessness\" means lacking a permanent place to live continuously for one year or more or at least four times in the past three years; and\n(2) \"household\" means an individual, family, or unaccompanied minor experiencing long-term homelessness.\nCounties and tribes are eligible for funding under this section. Priority will be given to proposals submitted on behalf of multicounty and tribal partnerships.\nProposals will be evaluated on the extent to which they:\n(1) include partnerships with providers of services or other partners;\n(2) develop strategies to enhance housing stability for people experiencing long-term homelessness by integrating services and establishing consistent services and procedures across jurisdictions as appropriate;\n(3) evidence a commitment to working with the commissioners of human services, corrections, and the Housing Finance Agency to identify appropriate households to be served under this section and serve households as defined in subdivision 3. The commissioner may also set criteria for serving people at significant risk of experiencing long-term homelessness, with a priority on serving families with minor children;\n(4) ensure that projects make maximum use of mainstream resources, including employment, social, and health services, and leverage additional public and private resources in order to serve the maximum number of households;\n(5) demonstrate cost-effectiveness by identifying and prioritizing those services most necessary for housing stability; and\n(6) evaluate and report on outcomes of the projects according to protocols developed by the commissioner of human services in cooperation with the commissioners of corrections and the Housing Finance Agency. Evaluation would include methods for determining the quality of the integrated service approach, improvement in outcomes, cost savings, or reduction in service disparities that may result.\nProjects will be selected to further the following outcomes:\n(1) reduce the number of Minnesota individuals and families that experience long-term homelessness;\n(2) increase the number of housing opportunities with supportive services;\n(3) develop integrated, cost-effective service models that address the multiple barriers to obtaining housing stability faced by people experiencing long-term homelessness, including abuse, neglect, substance use disorder, disability, chronic health problems, or other factors including ethnicity and race that may result in poor outcomes or service disparities;\n(4) encourage partnerships among counties, Tribes, community agencies, schools, and other providers so that the service delivery system is seamless for people experiencing long-term homelessness;\n(5) increase employability, self-sufficiency, and other social outcomes for individuals and families experiencing long-term homelessness; and\n(6) reduce inappropriate use of emergency health care, shelter, substance use disorder treatment, foster care, child protection, corrections, and similar services used by people experiencing long-term homelessness.\nServices eligible for funding under this section are all services needed to maintain households in permanent supportive housing, as determined by the counties or Tribes administering the project or projects.\nThe commissioner, in consultation with the commissioners of housing finance and corrections, shall assess whether the definition of long-term homelessness impacts the ability of families with minor children experiencing homelessness to obtain services necessary to support housing stability.",
	"repealed": false
}