{
	"id": "356.612",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.612",
	"title": "356.612 LIMITATION ON BENEFITS AND CONTRIBUTIONS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Annual addition\" means the sum for the limitation year of all pretax and after-tax contributions made by the member or the member's employer and credited to an account in the name of the member in any defined contribution plan maintained by the employer.\n(c) \"Annuity starting date\" means the first day of the first period for which an amount is payable as an annuity or, in the case of a benefit not payable in the form of an annuity, the first day on which all events have occurred which entitle the member to the benefit.\n(d) \"Compensation\" means the compensation actually paid or made available to a member or participant for any limitation year, including all items of remuneration described in Code of Federal Regulations, title 26, section 1.415 (c)-2(b), and excluding all items of remuneration described in Code of Federal Regulations, title 26, section 1.415 (c)-2(c). Compensation for pension plan purposes for any limitation year shall not exceed the applicable federal compensation limit described in section 356.611, subdivision 2.\n(e) \"Limitation year\" means the calendar year or fiscal year, whichever is applicable to the particular pension plan.\n(f) \"Maximum permissible benefit\" means an annual benefit of $160,000, automatically adjusted under section 415(d) of the Internal Revenue Code for each limitation year ending after December 31, 2001, payable in the form of a single life annuity. The new limitation shall apply to limitation years ending with or within the calendar year of the date of the adjustment, but a member's benefits shall not reflect the adjusted limit prior to January 1 of that calendar year. The maximum permissible benefit amount shall be further adjusted as follows:\n(1) if the member has less than ten years of participation, the maximum permissible benefit shall be multiplied by a fraction, the numerator of which is the number of years, or part thereof, but not less than one year, of participation in the plan, and the denominator of which is ten;\n(2) for a member who is not a qualified participant, if the annual benefit begins before the member has attained 62 years of age, the determination as to whether the maximum permissible benefit limit has been satisfied shall be made, in accordance with regulations prescribed by the United States secretary of the treasury, by reducing the limit so that the limit, as so reduced, equals an annual benefit, beginning when the annual benefit actually begins, which is equivalent to a $160,000, as adjusted, annual benefit beginning at 62 years of age; and\n(3) if the annual benefit begins after the member has attained 65 years of age, the determination as to whether the maximum permissible benefit limit has been satisfied shall be made, in accordance with regulations prescribed by the United States secretary of the treasury, by increasing the limit so that the limit, as so increased, equals an annual benefit, beginning when the annual benefit actually begins, which is equivalent to a $160,000, as adjusted, annual benefit beginning at 65 years of age.\n(g) \"Qualified participant\" means a member of a defined benefit plan listed in section 356.611, subdivision 6, with respect to whom the period of service taken into account in determining the amount of the benefit under such defined benefit plan includes at least 15 years of service of the member:\n(1) as a full-time employee of any police department or fire department which is organized and operated by the state, Indian Tribal government, or any political subdivision maintaining such defined benefit plan to provide police protection, firefighting services, or medical services for any area within the jurisdiction of the state, Indian Tribal government, or political subdivision; or\n(2) as a member of the Armed Forces of the United States.\n(a) For a defined benefit plan listed in section 356.611, subdivision 6, the annual benefit payable to a member shall not exceed the maximum permissible benefit. If the benefit the member would otherwise receive for a limitation year would result in the payment of an annual benefit in excess of the maximum permissible benefit, the benefit shall be reduced to the extent necessary so the benefit does not exceed the maximum permissible benefit.\n(b) For purposes of applying the limitation in paragraph (a), an annual benefit that is payable in any form other than a single life annuity shall be adjusted to an actuarially equivalent single life annuity that equals, if the annuity starting date is in a plan year beginning after 2005, the annual amount of the single life annuity commencing at the same annuity starting date that has the same actuarial present value as the member's form of benefit, using whichever of the following produces the greatest annual amount:\n(1) the interest rate and the mortality table or other tabular factor specified in the plan for adjusting benefits in the same form;\n(2) a 5.5 percent interest rate assumption and the applicable mortality table; or\n(3) the applicable interest rate under section 417(e)(3) of the Internal Revenue Code and the applicable mortality table, divided by 1.05.\n(c) If a member participated in more than one pension plan in which the employer participates, the benefits under each plan must be reduced proportionately to satisfy the limitation in paragraph (a).\nFor any limitation year, the annual additions by or on behalf of a member to a defined contribution plan listed in section 356.611, subdivision 6, shall not exceed the lesser of:\n(1) 100 percent of the member's compensation for the limitation year; or\n(2) the dollar limit in effect for the limitation year under section 415(c)(1)(A) of the Internal Revenue Code, as adjusted by the United States secretary of the treasury under section 415(d)(1)(C) of the Internal Revenue Code.\nAny requirements of sections 415(b) and (c) of the Internal Revenue Code and related regulations and agency guidance not addressed by this section shall be considered incorporated by reference, including provisions applicable to a qualified participant and to survivor and disability benefits. This section shall be interpreted in a manner that is consistent with the requirements of sections 415(b) and (c) of the Internal Revenue Code and the related regulations.",
	"repealed": false
}