{
	"id": "325F.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.22",
	"title": "325F.22 UNFAIR AND DECEPTIVE ADVERTISING PRACTICES.",
	"text": "It shall be considered an unfair and deceptive practice to violate any of the provisions of this section.\nNo advertisement for insulation to be used or offered for sale in Minnesota shall state that a percentage of fuel costs or a certain dollar amount of fuel costs will be saved unless the statement is accompanied by the following or substantially similar disclaimer in letters the same size as the claim of savings: \"Stated savings are estimates only. Actual savings may vary depending on type of home, weather conditions, occupant lifestyle, energy prices and other factors.\"\nNo advertisement for insulation to be used or offered for sale in Minnesota shall contain any claim which is false or misleading, or for which there exists no reasonable substantiation at the time the claim is made. Prohibited claims include, but are not limited to, the following: does not burn, noncombustible, self-extinguishing, nonpoisonous, nonirritating, vermin-proof, rodent-proof, resists mildewing, will not shrink, will not crack, permanent, no deterioration, complete coverage, fills all voids, never needs replacing, will not settle. This prohibition shall not apply if the claim is substantiated by tests identified in the specifications established under section 325F.20, subdivision 1, or by appropriate testing procedures of the American Society for Testing and Materials where no test required under section 325F.20, subdivision 1, applies. Such tests shall be made by a laboratory qualified to test thermal insulation. When tests are not designed to duplicate actual conditions, substantiated claims must so state.\nNo representation about the thermal resistance value of insulation shall be made unless the R value is given and has been determined by the tests required in the specification established under section 325F.20, subdivision 1, or by appropriate testing procedures of the American Society for Testing and Materials where no test required under section 325F.20, subdivision 1, applies. Such tests shall be made by an approved laboratory qualified to test thermal insulation.",
	"repealed": false
}