{
	"id": "256B.4914",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.4914",
	"title": "256B.4914 HOME AND COMMUNITY-BASED SERVICES WAIVERS; RATE SETTING.",
	"text": "The payment methodologies in this section apply to home and community-based services waivers under sections 256B.092 and 256B.49. This section does not change existing waiver policies and procedures.\n(a) For purposes of this section, the following terms have the meanings given them, unless the context clearly indicates otherwise.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Comparable occupations\" means the occupations, excluding direct care staff, as represented by the Bureau of Labor Statistics standard occupational classification codes that have the same classification for:\n(1) typical education needed for entry;\n(2) work experience in a related occupation; and\n(3) typical on-the-job training competency as the most predominant classification for direct care staff.\n(d) \"Component value\" means underlying factors that are part of the cost of providing services that are built into the waiver rates methodology to calculate service rates.\n(e) \"Customized living tool\" means a methodology for setting service rates that delineates and documents the amount of each component service included in a recipient's customized living service plan.\n(f) \"Direct care staff\" means employees providing direct service to people receiving services under this section. Direct care staff excludes executive, managerial, and administrative staff.\n(g) \"Disability waiver rates system\" means a statewide system that establishes rates that are based on uniform processes and captures the individualized nature of waiver services and recipient needs.\n(h) \"Individual direct staffing hours\" means the time spent as a one-to-one interaction specific to an individual recipient by staff to provide direct support and assistance with activities of daily living, instrumental activities of daily living, and training to participants, and is based on the requirements in each individual's support plan under section 245D.02, subdivision 4b; any support plan addendum under section 245D.02, subdivision 4c; and an assessment tool. Provider observation of an individual's needs must also be considered.\n(i) \"Lead agency\" means a county, partnership of counties, or Tribal agency charged with administering waivered services under sections 256B.092 and 256B.49.\n(j) \"Payment or rate\" means reimbursement to an eligible provider for services provided to a qualified individual based on an approved service authorization.\n(k) \"Rates management system\" means a web-based software application that uses a framework and component values, as determined by the commissioner, to establish service rates.\n(l) \"Recipient\" means a person receiving home and community-based services funded under any of the disability waivers.\n(m) \"Shared direct staffing hours\" means time spent by employees, not defined under paragraph (f), providing or available to provide more than one individual with direct support and assistance with activities of daily living as defined under section 256B.0659, subdivision 1, paragraph (b); instrumental activities of daily living as defined under section 256B.0659, subdivision 1, paragraph (i); ancillary activities needed to support individual services; and training to participants, and is based on the requirements in each individual's support plan under section 245D.02, subdivision 4b; any support plan addendum under section 245D.02, subdivision 4c; an assessment tool; and provider observation of an individual's service need. Total shared staffing hours are divided proportionally by the number of individuals who receive the shared service provisions.\n(n) \"Staffing ratio\" means the number of recipients a service provider employee supports during a unit of service based on a uniform assessment tool, provider observation, case history, and the recipient's services of choice, and not based on the staffing ratios under section 245D.31.\n(a) Applicable services are those authorized under the state's home and community-based services waivers under sections 256B.092 and 256B.49, including the following, as defined in the federally approved home and community-based services plan:\n(1) 24-hour customized living;\n(2) adult day services;\n(3) adult day services bath;\n(4) community residential services;\n(5) customized living;\n(6) day support services;\n(7) employment development services;\n(8) employment exploration services;\n(9) employment support services;\n(10) family residential services;\n(11) individualized home supports;\n(12) individualized home supports with family training;\n(13) individualized home supports with training;\n(14) integrated community supports;\n(15) life sharing;\n(16) night supervision;\n(17) positive support services;\n(18) prevocational services;\n(19) residential support services;\n(20) respite services;\n(21) transportation services; and\n(22) other services as approved by the federal government in the state home and community-based services waiver plan.\n(b) Effective January 1, 2024, or upon federal approval, whichever is later, respite services under paragraph (a), clause (20), are not an applicable service under this section.\n[See Note.]\n(a) Rates for applicable home and community-based waivered services, including customized rates under subdivision 12, are set by the rates management system.\n(b) Data and information in the rates management system must be used to calculate an individual's rate.\n(c) Service providers, with information from the support plan and oversight by lead agencies, shall provide values and information needed to calculate an individual's rate in the rates management system. Lead agencies must use forms provided by the commissioner to collect this information. The determination of service levels must be part of a discussion with members of the support team as defined in section 245D.02, subdivision 34. This discussion must occur prior to the final establishment of each individual's rate. The values and information include:\n(1) shared staffing hours;\n(2) individual staffing hours;\n(3) direct registered nurse hours;\n(4) direct licensed practical nurse hours;\n(5) staffing ratios;\n(6) information to document variable levels of service qualification for variable levels of reimbursement in each framework;\n(7) shared or individualized arrangements for unit-based services, including the staffing ratio;\n(8) number of trips and miles for transportation services; and\n(9) service hours provided through monitoring technology.\n(d) Updates to individual data must include:\n(1) data for each individual that is updated annually when renewing service plans; and\n(2) requests by individuals or lead agencies to update a rate whenever there is a change in an individual's service needs, with accompanying documentation.\n(e) Lead agencies shall review and approve all services reflecting each individual's needs, and the values to calculate the final payment rate for services with variables under subdivisions 6 to 9 for each individual. Lead agencies must notify the individual and the service provider of the final agreed-upon values and rate, and provide information that is identical to what was entered into the rates management system. If a value used was mistakenly or erroneously entered and used to calculate a rate, a provider may petition lead agencies to correct it. Lead agencies must respond to these requests. When responding to the request, the lead agency must consider:\n(1) meeting the health and welfare needs of the individual or individuals receiving services by service site, identified in their support plan under section 245D.02, subdivision 4b, and any addendum under section 245D.02, subdivision 4c;\n(2) meeting the requirements for staffing under subdivision 2, paragraphs (h), (n), and (o); and meeting or exceeding the licensing standards for staffing required under section 245D.09, subdivision 1; and\n(3) meeting the staffing ratio requirements under subdivision 2, paragraph (o), and meeting or exceeding the licensing standards for staffing required under section 245D.31.\n[See Note.]\n(a) The base wage index is established to determine staffing costs associated with providing services to individuals receiving home and community-based services. For purposes of calculating the base wage, Minnesota-specific wages taken from job descriptions and standard occupational classification (SOC) codes from the Bureau of Labor Statistics as defined in the Occupational Handbook must be used.\n(b) The commissioner shall update the base wage index in subdivision 5a, publish these updated values, and load them into the rate management system as follows:\n(1) on January 1, 2022, based on wage data by SOC from the Bureau of Labor Statistics available as of December 31, 2019;\n(2) on January 1, 2024, based on wage data by SOC from the Bureau of Labor Statistics published in March 2022; and\n(3) on January 1, 2026, and every two years thereafter, based on wage data by SOC from the Bureau of Labor Statistics published in the spring approximately 21 months prior to the scheduled update.\n[See Note.]\nThe base wage index must be calculated as follows:\n(1) for supervisory staff, 100 percent of the median wage for community and social services specialist (SOC code 21-1099), with the exception of the supervisor of positive supports professional, positive supports analyst, and positive supports specialist, which is 100 percent of the median wage for clinical counseling and school psychologist (SOC code 19-3031);\n(2) for registered nurse staff, 100 percent of the median wage for registered nurses (SOC code 29-1141);\n(3) for licensed practical nurse staff, 100 percent of the median wage for licensed practical nurses (SOC code 29-2061);\n(4) for residential asleep-overnight staff, the minimum wage in Minnesota for large employers;\n(5) for residential direct care staff, the sum of:\n(i) 15 percent of the subtotal of 50 percent of the median wage for home health and personal care aide (SOC code 31-1120); 30 percent of the median wage for nursing assistant (SOC code 31-1131); and 20 percent of the median wage for social and human services aide (SOC code 21-1093); and\n(ii) 85 percent of the subtotal of 40 percent of the median wage for home health and personal care aide (SOC code 31-1120); 20 percent of the median wage for nursing assistant (SOC code 31-1131); 20 percent of the median wage for psychiatric technician (SOC code 29-2053); and 20 percent of the median wage for social and human services aide (SOC code 21-1093);\n(6) for adult day services staff, 70 percent of the median wage for nursing assistant (SOC code 31-1131); and 30 percent of the median wage for home health and personal care aide (SOC code 31-1120);\n(7) for day support services staff and prevocational services staff, 20 percent of the median wage for nursing assistant (SOC code 31-1131); 20 percent of the median wage for psychiatric technician (SOC code 29-2053); and 60 percent of the median wage for social and human services aide (SOC code 21-1093);\n(8) for positive supports analyst staff, 100 percent of the median wage for substance abuse, behavioral disorder, and mental health counselor (SOC code 21-1018);\n(9) for positive supports professional staff, 100 percent of the median wage for clinical counseling and school psychologist (SOC code 19-3031);\n(10) for positive supports specialist staff, 100 percent of the median wage for psychiatric technicians (SOC code 29-2053);\n(11) for individualized home supports with family training staff, 20 percent of the median wage for nursing aide (SOC code 31-1131); 30 percent of the median wage for community social service specialist (SOC code 21-1099); 40 percent of the median wage for social and human services aide (SOC code 21-1093); and ten percent of the median wage for psychiatric technician (SOC code 29-2053);\n(12) for individualized home supports with training services staff, 40 percent of the median wage for community social service specialist (SOC code 21-1099); 50 percent of the median wage for social and human services aide (SOC code 21-1093); and ten percent of the median wage for psychiatric technician (SOC code 29-2053);\n(13) for employment support services staff, 50 percent of the median wage for rehabilitation counselor (SOC code 21-1015); and 50 percent of the median wage for community and social services specialist (SOC code 21-1099);\n(14) for employment exploration services staff, 50 percent of the median wage for education, guidance, school, and vocational counselor (SOC code 21-1012); and 50 percent of the median wage for community and social services specialist (SOC code 21-1099);\n(15) for employment development services staff, 50 percent of the median wage for education, guidance, school, and vocational counselors (SOC code 21-1012); and 50 percent of the median wage for community and social services specialist (SOC code 21-1099);\n(16) for individualized home support without training staff, 50 percent of the median wage for home health and personal care aide (SOC code 31-1120); and 50 percent of the median wage for nursing assistant (SOC code 31-1131); and\n(17) for night supervision staff, 40 percent of the median wage for home health and personal care aide (SOC code 31-1120); 20 percent of the median wage for nursing assistant (SOC code 31-1131); 20 percent of the median wage for psychiatric technician (SOC code 29-2053); and 20 percent of the median wage for social and human services aide (SOC code 21-1093).\n[See Note.]\nThe commissioner shall update the client and programming support, transportation, and program facility cost component values as required in subdivisions 6 to 9 and the rates identified in subdivision 19 for changes in the Consumer Price Index. The commissioner shall adjust these values higher or lower, publish these updated values, and load them into the rate management system as follows:\n(1) on January 1, 2022, by the percentage change in the CPI-U from the date of the previous update to the data available on December 31, 2019;\n(2) on January 1, 2024, by the percentage change in the CPI-U from the date of the previous update to the data available as of December 31, 2022; and\n(3) on January 1, 2026, and every two years thereafter, by the percentage change in the CPI-U from the date of the previous update to the data available 24 months and one day prior to the scheduled update.\n[See Note.]\nAny rate adjustments applied to the service rates calculated under this section outside of the cost components and rate methodology specified in this section shall be removed from rate calculations upon implementation of the updates under subdivisions 5 and 5b.\nIf Bureau of Labor Statistics occupational codes or Consumer Price Index items specified in subdivision 5 or 5b are unavailable in the future, the commissioner shall recommend to the legislature codes or items to update and replace.\n(a) At least 80 percent of the marginal increase in revenue from the rate adjustment applied to the service rates calculated under subdivisions 5 and 5b beginning on January 1, 2022, for services rendered between January 1, 2022, and March 31, 2024, must be used to increase compensation-related costs for employees directly employed by the program on or after January 1, 2022.\n(b) For the purposes of this subdivision, compensation-related costs include:\n(1) wages and salaries;\n(2) the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, workers' compensation, and mileage reimbursement;\n(3) the employer's paid share of health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, pensions, and contributions to employee retirement accounts; and\n(4) benefits that address direct support professional workforce needs above and beyond what employees were offered prior to January 1, 2022, including retention and recruitment bonuses and tuition reimbursement.\n(c) Compensation-related costs for persons employed in the central office of a corporation or entity that has an ownership interest in the provider or exercises control over the provider, or for persons paid by the provider under a management contract, do not count toward the 80 percent requirement under this subdivision.\n(d) A provider agency or individual provider that receives a rate subject to the requirements of this subdivision shall prepare, and upon request submit to the commissioner, a distribution plan that specifies the amount of money the provider expects to receive that is subject to the requirements of this subdivision, including how that money was or will be distributed to increase compensation-related costs for employees. Within 60 days of final implementation of a rate adjustment subject to the requirements of this subdivision, the provider must post the distribution plan and leave it posted for a period of at least six months in an area of the provider's operation to which all direct support professionals have access.\n(e) This subdivision expires June 30, 2024.\n(a) For purposes of this section, residential support services includes 24-hour customized living services, community residential services, customized living services, and integrated community supports.\n(b) A unit of service for residential support services is a day. Any portion of any calendar day, within allowable Medicaid rules, where an individual spends time in a residential setting is billable as a day. The number of days authorized for all individuals enrolling in residential support services must include every day that services start and end.\n(c) When the available shared staffing hours in a residential setting are insufficient to meet the needs of an individual who enrolled in residential support services after January 1, 2014, then individual staffing hours shall be used.\n[See Note.]\n(a) Component values for community residential services are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) general administrative support ratio: 13.25 percent;\n(6) program-related expense ratio: 1.3 percent; and\n(7) absence and utilization factor ratio: 3.9 percent.\n(b) Payments for community residential services must be calculated as follows:\n(1) determine the number of shared direct staffing and individual direct staffing hours to meet a recipient's needs provided on site or through monitoring technology;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of shared direct staffing and individual direct staffing hours provided on site or through monitoring technology and nursing hours by the appropriate staff wages;\n(6) multiply the number of shared direct staffing and individual direct staffing hours provided on site or through monitoring technology and nursing hours by the product of the supervision span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), excluding any shared direct staffing and individual direct staffing hours provided through monitoring technology, and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing cost;\n(8) for employee-related expenses, multiply the direct staffing cost, excluding any shared direct staffing and individual hours provided through monitoring technology, by one plus the employee-related cost ratio;\n(9) for client programming and supports, add $2,260.21 divided by 365. The commissioner shall update the amount in this clause as specified in subdivision 5b;\n(10) for transportation, if provided, add $1,742.62 divided by 365, or $3,111.81 divided by 365 if customized for adapted transport, based on the resident with the highest assessed need. The commissioner shall update the amounts in this clause as specified in subdivision 5b;\n(11) subtotal clauses (8) to (10) and the direct staffing cost of any shared direct staffing and individual direct staffing hours provided through monitoring technology that was excluded in clause (8);\n(12) sum the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(13) divide the result of clause (11) by one minus the result of clause (12). This is the total payment amount; and\n(14) adjust the result of clause (13) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) Component values for family residential services are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) general administrative support ratio: 3.3 percent;\n(6) program-related expense ratio: 1.3 percent; and\n(7) absence factor: 1.7 percent.\n(b) Payments for family residential services must be calculated as follows:\n(1) determine the number of shared direct staffing and individual direct staffing hours to meet a recipient's needs provided on site or through monitoring technology;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of shared direct staffing and individual direct staffing hours provided on site or through monitoring technology and nursing hours by the appropriate staff wages;\n(6) multiply the number of shared direct staffing and individual direct staffing hours provided on site or through monitoring technology and nursing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), excluding any shared direct staffing and individual direct staffing hours provided through monitoring technology, and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing cost;\n(8) for employee-related expenses, multiply the direct staffing cost, excluding any shared and individual direct staffing hours provided through monitoring technology, by one plus the employee-related cost ratio;\n(9) for client programming and supports, add $2,260.21 divided by 365. The commissioner shall update the amount in this clause as specified in subdivision 5b;\n(10) for transportation, if provided, add $1,742.62 divided by 365, or $3,111.81 divided by 365 if customized for adapted transport, based on the resident with the highest assessed need. The commissioner shall update the amounts in this clause as specified in subdivision 5b;\n(11) subtotal clauses (8) to (10) and the direct staffing cost of any shared direct staffing and individual direct staffing hours provided through monitoring technology that was excluded in clause (8);\n(12) sum the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(13) divide the result of clause (11) by one minus the result of clause (12). This is the total payment rate; and\n(14) adjust the result of clause (13) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) Component values for integrated community supports are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) general administrative support ratio: 13.25 percent;\n(6) program-related expense ratio: 1.3 percent; and\n(7) absence and utilization factor ratio: 3.9 percent.\n(b) Payments for integrated community supports must be calculated as follows:\n(1) determine the number of shared direct staffing and individual direct staffing hours to meet a recipient's needs. The base shared direct staffing hours must be eight hours divided by the number of people receiving support in the integrated community support setting, and the individual direct staffing hours must be the average number of direct support hours provided directly to the service recipient;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of shared direct staffing and individual direct staffing hours in clause (1) by the appropriate staff wages;\n(6) multiply the number of shared direct staffing and individual direct staffing hours in clause (1) by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6) and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing cost;\n(8) for employee-related expenses, multiply the direct staffing cost by one plus the employee-related cost ratio;\n(9) for client programming and supports, add $2,260.21 divided by 365. The commissioner shall update the amount in this clause as specified in subdivision 5b;\n(10) add the results of clauses (8) and (9);\n(11) add the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(12) divide the result of clause (10) by one minus the result of clause (11). This is the total payment amount; and\n(13) adjust the result of clause (12) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) The payment methodology for customized living and 24-hour customized living must be the customized living tool. The commissioner shall revise the customized living tool to reflect the services and activities unique to disability-related recipient needs and adjust for regional differences in the cost of providing services.\n(b) The rate adjustments described in section 256S.205 do not apply to rates paid under this section.\n(c) Customized living and 24-hour customized living rates determined under this section shall not include more than 24 hours of support in a daily unit.\n(d) The commissioner shall establish the following acuity-based customized living tool input limits, based on case mix, for customized living and 24-hour customized living rates determined under this section:\n(1) no more than two hours of mental health management per day for people assessed for case mixes A, D, and G;\n(2) no more than four hours of activities of daily living assistance per day for people assessed for case mix B; and\n(3) no more than six hours of activities of daily living assistance per day for people assessed for case mix D.\n(a) For the purposes of this section, day programs include adult day services, day support services, and prevocational services.\n(b) The staffing ratios for the units of service provided by a day program to a recipient in a typical week must be averaged to determine an individual's staffing ratio.\n(c) The commissioner, in consultation with service providers, shall develop a uniform staffing ratio worksheet to be used by day programs to determine staffing ratios for day programs.\n(a) Component values for adult day services are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) program plan support ratio: 5.6 percent;\n(6) client programming and support ratio: 7.4 percent, updated as specified in subdivision 5b;\n(7) general administrative support ratio: 13.25 percent;\n(8) program-related expense ratio: 1.8 percent; and\n(9) absence and utilization factor ratio: 9.4 percent.\n(b) A unit of service for adult day services is either a day or 15 minutes. A day unit of service is six or more hours of time spent providing direct service.\n(c) Payments for adult day services must be calculated as follows:\n(1) determine the number of units of service and the staffing ratio to meet a recipient's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of day program direct staffing hours and nursing hours by the appropriate staff wage;\n(6) multiply the number of day program direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for program plan support, multiply the result of clause (7) by one plus the program plan support ratio;\n(9) for employee-related expenses, multiply the result of clause (8) by one plus the employee-related cost ratio;\n(10) for client programming and supports, multiply the result of clause (9) by one plus the client programming and support ratio;\n(11) for program facility costs, add $19.30 per week with consideration of staffing ratios to meet individual needs, updated as specified in subdivision 5b;\n(12) for adult day bath services, add $7.01 per 15 minute unit;\n(13) this is the subtotal rate;\n(14) sum the standard general administrative rate support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(15) divide the result of clause (13) by one minus the result of clause (14). This is the total payment amount; and\n(16) adjust the result of clause (15) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) Component values for day support services are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) program plan support ratio: 5.6 percent;\n(6) client programming and support ratio: 10.37 percent, updated as specified in subdivision 5b;\n(7) general administrative support ratio: 13.25 percent;\n(8) program-related expense ratio: 1.8 percent; and\n(9) absence and utilization factor ratio: 9.4 percent.\n(b) A unit of service for day support services is 15 minutes.\n(c) Payments for day support services must be calculated as follows:\n(1) determine the number of units of service and the staffing ratio to meet a recipient's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of day program direct staffing hours and nursing hours by the appropriate staff wage;\n(6) multiply the number of day program direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for program plan support, multiply the result of clause (7) by one plus the program plan support ratio;\n(9) for employee-related expenses, multiply the result of clause (8) by one plus the employee-related cost ratio;\n(10) for client programming and supports, multiply the result of clause (9) by one plus the client programming and support ratio;\n(11) for program facility costs, add $19.30 per week with consideration of staffing ratios to meet individual needs, updated as specified in subdivision 5b;\n(12) this is the subtotal rate;\n(13) sum the standard general administrative rate support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(14) divide the result of clause (12) by one minus the result of clause (13). This is the total payment amount; and\n(15) adjust the result of clause (14) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) Component values for prevocational services are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) program plan support ratio: 5.6 percent;\n(6) client programming and support ratio: 10.37 percent, updated as specified in subdivision 5b;\n(7) general administrative support ratio: 13.25 percent;\n(8) program-related expense ratio: 1.8 percent; and\n(9) absence and utilization factor ratio: 9.4 percent.\n(b) A unit of service for prevocational services is either a day or 15 minutes. A day unit of service is six or more hours of time spent providing direct service.\n(c) Payments for prevocational services must be calculated as follows:\n(1) determine the number of units of service and the staffing ratio to meet a recipient's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of day program direct staffing hours and nursing hours by the appropriate staff wage;\n(6) multiply the number of day program direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for program plan support, multiply the result of clause (7) by one plus the program plan support ratio;\n(9) for employee-related expenses, multiply the result of clause (8) by one plus the employee-related cost ratio;\n(10) for client programming and supports, multiply the result of clause (9) by one plus the client programming and support ratio;\n(11) for program facility costs, add $19.30 per week with consideration of staffing ratios to meet individual needs, updated as specified in subdivision 5b;\n(12) this is the subtotal rate;\n(13) sum the standard general administrative rate support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(14) divide the result of clause (12) by one minus the result of clause (13). This is the total payment amount; and\n(15) adjust the result of clause (14) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) For the purpose of this section, unit-based services with programming include employment exploration services, employment development services, employment support services, individualized home supports with family training, individualized home supports with training, and positive support services provided to an individual outside of any service plan for a day program or residential support service.\n(b) Component values for unit-based services with programming are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) program plan support ratio: 15.5 percent;\n(6) client programming and support ratio: 4.7 percent, updated as specified in subdivision 5b;\n(7) general administrative support ratio: 13.25 percent;\n(8) program-related expense ratio: 6.1 percent; and\n(9) absence and utilization factor ratio: 3.9 percent.\n(c) A unit of service for unit-based services with programming is 15 minutes.\n(d) Payments for unit-based services with programming must be calculated as follows, unless the services are reimbursed separately as part of a residential support services or day program payment rate:\n(1) determine the number of units of service to meet a recipient's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of direct staffing hours by the appropriate staff wage;\n(6) multiply the number of direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for program plan support, multiply the result of clause (7) by one plus the program plan support ratio;\n(9) for employee-related expenses, multiply the result of clause (8) by one plus the employee-related cost ratio;\n(10) for client programming and supports, multiply the result of clause (9) by one plus the client programming and support ratio;\n(11) this is the subtotal rate;\n(12) sum the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(13) divide the result of clause (11) by one minus the result of clause (12). This is the total payment amount;\n(14) for services provided in a shared manner, divide the total payment in clause (13) as follows:\n(i) for employment exploration services, divide by the number of service recipients, not to exceed five;\n(ii) for employment support services, divide by the number of service recipients, not to exceed six;\n(iii) for individualized home supports with training and individualized home supports with family training, divide by the number of service recipients, not to exceed three; and\n(iv) for night supervision, divide by the number of service recipients, not to exceed two; and\n(15) adjust the result of clause (14) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) For the purposes of this section, unit-based services without programming include individualized home supports without training and night supervision provided to an individual outside of any service plan for a day program or residential support service. Unit-based services without programming do not include respite.\n(b) Component values for unit-based services without programming are:\n(1) competitive workforce factor: 6.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) program plan support ratio: 7.0 percent;\n(6) client programming and support ratio: 2.3 percent, updated as specified in subdivision 5b;\n(7) general administrative support ratio: 13.25 percent;\n(8) program-related expense ratio: 2.9 percent; and\n(9) absence and utilization factor ratio: 3.9 percent.\n(c) A unit of service for unit-based services without programming is 15 minutes.\n(d) Payments for unit-based services without programming must be calculated as follows unless the services are reimbursed separately as part of a residential support services or day program payment rate:\n(1) determine the number of units of service to meet a recipient's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 to 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring customization for deaf and hard-of-hearing language accessibility under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of direct staffing hours by the appropriate staff wage;\n(6) multiply the number of direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for program plan support, multiply the result of clause (7) by one plus the program plan support ratio;\n(9) for employee-related expenses, multiply the result of clause (8) by one plus the employee-related cost ratio;\n(10) for client programming and supports, multiply the result of clause (9) by one plus the client programming and support ratio;\n(11) this is the subtotal rate;\n(12) sum the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(13) divide the result of clause (11) by one minus the result of clause (12). This is the total payment amount;\n(14) for individualized home supports without training provided in a shared manner, divide the total payment amount in clause (13) by the number of service recipients, not to exceed three; and\n(15) adjust the result of clause (14) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) For the purposes of this section, respite services include respite services provided to an individual outside of any service plan for a day program or residential support service.\n(b) Component values for respite services are:\n(1) competitive workforce factor: 4.7 percent;\n(2) supervisory span of control ratio: 11 percent;\n(3) employee vacation, sick, and training allowance ratio: 8.71 percent;\n(4) employee-related cost ratio: 23.6 percent;\n(5) general administrative support ratio: 13.25 percent;\n(6) program-related expense ratio: 2.9 percent; and\n(7) absence and utilization factor ratio: 3.9 percent.\n(c) A unit of service for respite services is 15 minutes.\n(d) Payments for respite services must be calculated as follows unless the service is reimbursed separately as part of a residential support services or day program payment rate:\n(1) determine the number of units of service to meet an individual's needs;\n(2) determine the appropriate hourly staff wage rates derived by the commissioner as provided in subdivisions 5 and 5a;\n(3) except for subdivision 5a, clauses (1) to (4), multiply the result of clause (2) by the product of one plus the competitive workforce factor;\n(4) for a recipient requiring deaf and hard-of-hearing customization under subdivision 12, add the customization rate provided in subdivision 12 to the result of clause (3);\n(5) multiply the number of direct staffing hours by the appropriate staff wage;\n(6) multiply the number of direct staffing hours by the product of the supervisory span of control ratio and the appropriate supervisory staff wage in subdivision 5a, clause (1);\n(7) combine the results of clauses (5) and (6), and multiply the result by one plus the employee vacation, sick, and training allowance ratio. This is defined as the direct staffing rate;\n(8) for employee-related expenses, multiply the result of clause (7) by one plus the employee-related cost ratio;\n(9) this is the subtotal rate;\n(10) sum the standard general administrative support ratio, the program-related expense ratio, and the absence and utilization factor ratio;\n(11) divide the result of clause (9) by one minus the result of clause (10). This is the total payment amount;\n(12) for respite services provided in a shared manner, divide the total payment amount in clause (11) by the number of service recipients, not to exceed three; and\n(13) adjust the result of clause (12) by a factor to be determined by the commissioner to adjust for regional differences in the cost of providing services.\n[See Note.]\n(a) The commissioner shall, within available resources, conduct research and gather data and information from existing state systems or other outside sources on the following items:\n(1) differences in the underlying cost to provide services and care across the state;\n(2) mileage, vehicle type, lift requirements, incidents of individual and shared rides, and units of transportation for all day services, which must be collected from providers using the rate management worksheet and entered into the rates management system; and\n(3) the distinct underlying costs for services provided by a license holder under sections 245D.05, 245D.06, 245D.07, 245D.071, 245D.081, and 245D.09, and for services provided by a license holder certified under section 245D.33.\n(b) The commissioner, in consultation with stakeholders, shall review and evaluate the following values already in subdivisions 6 to 9, or issues that impact all services, including, but not limited to:\n(1) values for transportation rates;\n(2) values for services where monitoring technology replaces staff time;\n(3) values for indirect services;\n(4) values for nursing;\n(5) values for the facility use rate in day services, and the weightings used in the day service ratios and adjustments to those weightings;\n(6) values for workers' compensation as part of employee-related expenses;\n(7) values for unemployment insurance as part of employee-related expenses;\n(8) direct care workforce labor market measures;\n(9) any changes in state or federal law with a direct impact on the underlying cost of providing home and community-based services;\n(10) outcome measures, determined by the commissioner, for home and community-based services rates determined under this section; and\n(11) different competitive workforce factors by service, as determined under subdivision 10b.\n(c) Beginning July 1, 2022, the commissioner shall renew analysis and implement changes to the regional adjustment factors once every six years. Prior to implementation, the commissioner shall consult with stakeholders on the methodology to calculate the adjustment.\n[See Note.]\n(a) The commissioner must ensure that wage values and component values in subdivisions 5 to 9 reflect the cost to provide the service. As determined by the commissioner, in consultation with stakeholders identified in subdivision 17, a provider enrolled to provide services with rates determined under this section must submit requested cost data to the commissioner to support research on the cost of providing services that have rates determined by the disability waiver rates system. Requested cost data may include, but is not limited to:\n(1) worker wage costs;\n(2) benefits paid;\n(3) supervisor wage costs;\n(4) executive wage costs;\n(5) vacation, sick, and training time paid;\n(6) taxes, workers' compensation, and unemployment insurance costs paid;\n(7) administrative costs paid;\n(8) program costs paid;\n(9) transportation costs paid;\n(10) vacancy rates; and\n(11) other data relating to costs required to provide services requested by the commissioner.\n(b) At least once in any five-year period, a provider must submit cost data for a fiscal year that ended not more than 18 months prior to the submission date. The commissioner shall provide each provider a 90-day notice prior to its submission due date. If a provider fails to submit required reporting data, the commissioner shall provide notice to providers that have not provided required data 30 days after the required submission date, and a second notice for providers who have not provided required data 60 days after the required submission date. The commissioner shall temporarily suspend payments to the provider if cost data is not received 90 days after the required submission date. Withheld payments shall be made once data is received by the commissioner.\n(c) The commissioner shall conduct a random validation of data submitted under paragraph (a) to ensure data accuracy. The commissioner shall analyze cost documentation in paragraph (a) and provide recommendations for adjustments to cost components.\n(d) The commissioner shall analyze cost data submitted under paragraph (a). The commissioner shall release cost data in an aggregate form. Cost data from individual providers must not be released except as provided for in current law.\n(e) The commissioner shall use data collected in paragraph (a) to determine the compliance with requirements identified under subdivision 10d. The commissioner shall identify providers who have not met the thresholds identified under subdivision 10d on the Department of Human Services website for the year for which the providers reported their costs.\n[See Note.]\n(a) Providers enrolled to provide services with rates determined under section 256B.4914, subdivision 3, shall submit labor market data to the commissioner annually on or before November 1, including but not limited to:\n(1) number of direct care staff;\n(2) wages of direct care staff;\n(3) overtime wages of direct care staff;\n(4) hours worked by direct care staff;\n(5) overtime hours worked by direct care staff;\n(6) benefits provided to direct care staff;\n(7) direct care staff job vacancies; and\n(8) direct care staff retention rates.\n(b) The commissioner shall publish annual reports on provider and state-level labor market data, including but not limited to the data obtained under paragraph (a).\n(c) The commissioner may temporarily suspend payments to the provider if data requested under paragraph (a) is not received 90 days after the required submission date. Withheld payments shall be made once data is received by the commissioner.\n(d) Providers who receive payment under this section for less than 25 percent of their clients in the year prior to the report may attest to the commissioner in a manner determined by the commissioner that they are declining to provide the data required under paragraph (a) and will not be subject to the payment suspension in paragraph (c).\n(a) Beginning February 1, 2025, and every two years thereafter, the commissioner shall report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health and human services policy and finance an analysis of the competitive workforce factor.\n(b) The report must include:\n(1) the most recently available wage data by SOC code for the weighted average wage for direct care staff for residential services and direct care staff for day services;\n(2) the most recently available wage data by SOC code of the weighted average wage of comparable occupations; and\n(3) workforce data as required under subdivision 10b.\n(c) This subdivision expires June 30, 2031.\n(a) A provider paid with rates determined under subdivision 6 must use a minimum of 66 percent of the revenue generated by rates determined under that subdivision for direct care staff compensation.\n(b) A provider paid with rates determined under subdivision 7 must use a minimum of 45 percent of the revenue generated by rates determined under that subdivision for direct care staff compensation.\n(c) A provider paid with rates determined under subdivision 8 or 9 must use a minimum of 60 percent of the revenue generated by rates determined under those subdivisions for direct care staff compensation.\n(d) Compensation under this subdivision includes:\n(1) wages;\n(2) taxes and workers' compensation;\n(3) health insurance;\n(4) dental insurance;\n(5) vision insurance;\n(6) life insurance;\n(7) short-term disability insurance;\n(8) long-term disability insurance;\n(9) retirement spending;\n(10) tuition reimbursement;\n(11) wellness programs;\n(12) paid vacation time;\n(13) paid sick time; or\n(14) other items of monetary value provided to direct care staff.\nMS 2020 [Repealed by amendment, 2022 c 33 s 1]\n(a) For persons determined to have higher needs based on being deaf or hard-of-hearing, the direct-care costs must be increased by an adjustment factor prior to calculating the rate under subdivisions 6 to 9. The customization rate with respect to deaf or hard-of-hearing persons shall be $2.50 per hour for waiver recipients who meet the respective criteria as determined by the commissioner.\n(b) For the purposes of this section, \"deaf and hard-of-hearing\" means:\n(1) the person has a developmental disability and:\n(i) an assessment score which indicates a hearing impairment that is severe or that the person has no useful hearing;\n(ii) an expressive communications score that indicates the person uses single signs or gestures, uses an augmentative communication aid, or does not have functional communication, or the person's expressive communications is unknown; and\n(iii) a communication score which indicates the person comprehends signs, gestures, and modeling prompts or does not comprehend verbal, visual, or gestural communication, or that the person's receptive communication score is unknown; or\n(2) the person receives long-term care services and has an assessment score that indicates the person hears only very loud sounds, the person has no useful hearing, or a determination cannot be made; and the person receives long-term care services and has an assessment that indicates the person communicates needs with sign language, symbol board, written messages, gestures, or an interpreter; communicates with inappropriate content, makes garbled sounds or displays echolalia, or does not communicate needs.\n[See Note.]\nThe commissioner shall require that the purchase of transportation services be cost-effective and be limited to market rates where the transportation mode is generally available and accessible.\n(a) In a format prescribed by the commissioner, lead agencies must identify individuals with exceptional needs that cannot be met under the disability waiver rate system. The commissioner shall use that information to evaluate and, if necessary, approve an alternative payment rate for those individuals. Whether granted, denied, or modified, the commissioner shall respond to all exception requests in writing. The commissioner shall include in the written response the basis for the action and provide notification of the right to appeal under paragraph (h).\n(b) Lead agencies must act on an exception request within 30 days and notify the initiator of the request of their recommendation in writing. A lead agency shall submit all exception requests along with its recommendation to the commissioner.\n(c) An application for a rate exception may be submitted for the following criteria:\n(1) an individual has service needs that cannot be met through additional units of service;\n(2) an individual's rate determined under subdivisions 6 to 9 is so insufficient that it has resulted in an individual receiving a notice of discharge from the individual's provider; or\n(3) an individual's service needs, including behavioral changes, require a level of service which necessitates a change in provider or which requires the current provider to propose service changes beyond those currently authorized.\n(d) Exception requests must include the following information:\n(1) the service needs required by each individual that are not accounted for in subdivisions 6 to 9;\n(2) the service rate requested and the difference from the rate determined in subdivisions 6 to 9;\n(3) a basis for the underlying costs used for the rate exception and any accompanying documentation; and\n(4) any contingencies for approval.\n(e) Approved rate exceptions shall be managed within lead agency allocations under sections 256B.092 and 256B.49.\n(f) Individual disability waiver recipients, an interested party, or the license holder that would receive the rate exception increase may request that a lead agency submit an exception request. A lead agency that denies such a request shall notify the individual waiver recipient, interested party, or license holder of its decision and the reasons for denying the request in writing no later than 30 days after the request has been made and shall submit its denial to the commissioner in accordance with paragraph (b). The reasons for the denial must be based on the failure to meet the criteria in paragraph (c).\n(g) The commissioner shall determine whether to approve or deny an exception request no more than 30 days after receiving the request. If the commissioner denies the request, the commissioner shall notify the lead agency and the individual disability waiver recipient, the interested party, and the license holder in writing of the reasons for the denial.\n(h) The individual disability waiver recipient may appeal any denial of an exception request by either the lead agency or the commissioner, pursuant to sections 256.045 and 256.0451. When the denial of an exception request results in the proposed demission of a waiver recipient from a residential or day habilitation program, the commissioner shall issue a temporary stay of demission, when requested by the disability waiver recipient, consistent with the provisions of section 256.045, subdivisions 4a and 6, paragraph (c). The temporary stay shall remain in effect until the lead agency can provide an informed choice of appropriate, alternative services to the disability waiver.\n(i) Providers may petition lead agencies to update values that were entered incorrectly or erroneously into the rate management system, based on past service level discussions and determination in subdivision 4, without applying for a rate exception.\n(j) The starting date for the rate exception will be the later of the date of the recipient's change in support or the date of the request to the lead agency for an exception.\n(k) The commissioner shall track all exception requests received and their dispositions. The commissioner shall issue quarterly public exceptions statistical reports, including the number of exception requests received and the numbers granted, denied, withdrawn, and pending. The report shall include the average amount of time required to process exceptions.\n(l) Approved rate exceptions remain in effect in all cases until an individual's needs change as defined in paragraph (c).\n(m) Rates determined under subdivision 19 are ineligible for rate exceptions.\n[See Note.]\n(a) The commissioner shall establish a method of tracking and reporting the fiscal impact of the disability waiver rates management system on individual lead agencies.\n(b) The commissioner shall make annual adjustments to lead agencies' home and community-based waivered service budget allocations to adjust for rate differences and the resulting impact on county allocations upon implementation of the disability waiver rates system.\n(c) Lead agencies exceeding their allocations shall be subject to the provisions under sections 256B.0916, subdivision 11, and 256B.49, subdivision 26.\n[Repealed, 1Sp2017 c 6 art 1 s 54]\n(a) The commissioner shall continue consultation at regular intervals with the existing stakeholder group established as part of the rate-setting methodology process and others, to gather input, concerns, and data, to assist in the implementation of the rate payment system, and to make pertinent information available to the public through the department's website.\n(b) The commissioner shall offer training at least annually for county personnel responsible for administering the rate-setting framework in a manner consistent with this section.\n(c) The commissioner shall maintain an online instruction manual explaining the rate-setting framework. The manual shall be consistent with this section, and shall be accessible to all stakeholders including recipients, representatives of recipients, county or Tribal agencies, and license holders.\n(d) The commissioner shall not defer to the county or Tribal agency on matters of technical application of the rate-setting framework, and a county or Tribal agency shall not set rates in a manner that conflicts with this section.\n(a) The commissioner shall provide a public notice via LISTSERV in October of each year containing information detailing legislatively approved changes in:\n(1) calculation values including derived wage rates and related employee and administrative factors;\n(2) service utilization;\n(3) county and Tribal allocation changes; and\n(4) information on adjustments made to calculation values and the timing of those adjustments.\n(b) The information in this notice must be effective January 1 of the following year.\nThe commissioner shall establish rates for family residential services and life sharing services based on a person's assessed need, as described in the federally-approved waiver plans. Rates for life sharing services must be ten percent higher than the corresponding family residential services rate.\n[See Note.]",
	"repealed": false
}