{
	"id": "245.4835",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4835",
	"title": "245.4835 COUNTY MAINTENANCE OF EFFORT.",
	"text": "(a) Counties must maintain a level of expenditures for mental health services under sections 245.461 to 245.484 and 245.487 to 245.4889 so that each year's county expenditures are at least equal to that county's average expenditures for those services for calendar years 2004 and 2005. The commissioner will adjust each county's base level for minimum expenditures in each year by the amount of any increase or decrease in that county's state grants or other noncounty revenues for mental health services under sections 245.461 to 245.484 and 245.487 to 245.4889.\n(b) In order to simplify administration and improve budgeting predictability, the commissioner:\n(1) shall use each county's actual prior year revenues to adjust the county's minimum required expenditures for the coming year;\n(2) may use more current information regarding major changes in revenues if the change is known early enough to allow counties time to adjust their budgets;\n(3) shall allocate each county's revenues proportionally across applicable expenditures; and\n(4) may adjust a county's base if the county's population is substantially declining and the county's per capita mental health expenditures are substantially higher than the state average, and the commissioner has determined that mental health services in that county would not be negatively impacted.\n(a) If a county does not comply with subdivision 1, the commissioner shall require the county to develop a corrective action plan according to a format and timeline established by the commissioner. If the commissioner determines that a county has not developed an acceptable corrective action plan within the required timeline, or that the county is not in compliance with an approved corrective action plan, the protections provided to that county under section 245.485 do not apply.\n(b) The commissioner shall consider the following factors to determine whether to approve a county's corrective action plan:\n(1) the degree to which a county is maximizing revenues for mental health services from noncounty sources;\n(2) the degree to which a county is expanding use of alternative services that meet mental health needs, but do not count as mental health services within existing reporting systems. If approved by the commissioner, the alternative services must be included in the county's base as well as subsequent years. The commissioner's approval for alternative services must be based on the following criteria:\n(i) the service must be provided to children with emotional disturbance or adults with mental illness;\n(ii) the services must be based on an individual treatment plan or individual community support plan as defined in the Comprehensive Mental Health Act; and\n(iii) the services must be supervised by a mental health professional and provided by staff who meet the staff qualifications defined in sections 256B.0943, subdivision 7, and 256B.0623, subdivision 5.\n(c) Additional county expenditures to make up for the prior year's underspending may be spread out over a two-year period.",
	"repealed": false
}