{
	"id": "270C.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.41",
	"title": "270C.41 AGREEMENTS WITH FEDERAL GOVERNMENT.",
	"text": "Pursuant to section 270B.12, the commissioner may enter into an agreement with the Internal Revenue Service to identify taxpayers who have refunds due from the department and liabilities owing to the Internal Revenue Service. In accordance with the procedures established in the agreement, the Internal Revenue Service may levy against the refunds to be paid by the department. For each refund levied upon, the commissioner shall first deduct from the refund a fee of $20, and then remit the refund or the amount of the levy, whichever is less, to the Internal Revenue Service. The proceeds of fees shall be deposited into the Department of Revenue recapture revolving fund under section 270A.07, subdivision 1.\n(a) The commissioner is authorized to enter into agreements with the federal Department of the Treasury that provide for offsetting state payments against federal nontax obligations. Except as provided in paragraph (d), the commissioner may charge a fee of $20 per transaction for such offsets and may collect this offset fee from the debtor by deducting it from the state payment. The agreement may provide for offsetting federal payments, as authorized by federal law, against state tax and nontax obligations, and collecting the offset cost from the debtor. The agreement shall provide that the federal Department of the Treasury may deduct a fee from each administrative offset and state payment offset. Setoffs to collect state and other entity obligations under this chapter and chapters 16D and 270A, and any other provision of Minnesota Statutes, occur before a state payment offset. For purposes of this paragraph \"administrative offset\" is any offset of federal payments to collect state debts and \"state payment offset\" is any offset of state payments to collect federal nontax debts.\n(b) A debt is eligible for offset under this program if notice of intent to offset the debt is sent at least 60 days prior to filing an offset claim or a shorter period of time, if required by federal law or an agreement with the federal Department of the Treasury. When there is an agreement for scheduled payments on an account, the debtor must be sent this notice each time an additional debt is claimed.\n(c) The debtor shall have the time period required for notice under paragraph (b) to contest the offset. An agreement under this section must not allow for offset of payments if the debt that would be subject to the offset is being contested or if the time for appealing the determination of the debt has not yet expired. The treasury offset program agreement entered into by the state must not require federal agencies to provide different due process than the requirements under Code of Federal Regulations, title 31, section 285.6.\n(d) Notwithstanding the fee authorized under paragraph (a), if the commissioner enters into a contingency fee agreement with a nonstate vendor to provide assistance under this section, the commissioner may charge a debtor a fee for the processing of state payment offsets for the recovery of federal nontax debts or the processing of federal payment offsets for the recovery of state tax and nontax debt. The fee is a separate debt and may be withheld from any refund, reimbursement, or other money held for the debtor. The fee may not exceed 15 percent of the original debt. Section 16A.1283 does not apply to fees charged under this paragraph.",
	"repealed": false
}