{
	"id": "149A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.61",
	"title": "149A.61 COMPLAINTS; REPORTING OBLIGATIONS; FORM; RESPONSE.",
	"text": "Any person, agency, political subdivision, organization, or association that has knowledge of any conduct constituting grounds for disciplinary action relating to licensure, licensed activities or practices, or unlicensed activities under this chapter may report the conduct to the regulatory agency.\nA federal or state agency, political subdivision, agency of a local unit of government, or private agency or organization located in this state or any other state in the United States may report to the regulatory agency any conduct that is regulated under this chapter and that might constitute grounds for disciplinary action. The agency, political subdivision, or organization may report:\n(1) any action taken to revoke, suspend, restrict, or condition a license issued by the agency, political subdivision, or organization;\n(2) any denial of privileges granted by the agency, political subdivision, or organization;\n(3) the resignation of any licensee prior to the conclusion of any disciplinary action or proceeding for conduct that might constitute grounds for disciplinary action under this chapter; or\n(4) any other disciplinary action taken by the agency, political subdivision, or organization for conduct that might constitute grounds for disciplinary action under this chapter.\nA national, regional, state, or local professional society or association for licensees may forward to the regulatory agency any complaint received concerning conduct or activity that is regulated under this chapter. The society or association may report to the regulatory agency any disciplinary action taken against a member of that society or association.\nA licensee, intern, or transfer care specialist regulated under this chapter may report to the commissioner any conduct that the licensee, intern, or transfer care specialist has personal knowledge of, and reasonably believes constitutes grounds for, disciplinary action under this chapter.\nThe court administrator of district court or any court of competent jurisdiction shall report to the commissioner any judgment or other determination of the court that adjudges or includes a finding that a licensee, intern, or transfer care specialist is a person who is mentally ill, mentally incompetent, guilty of a felony or gross misdemeanor, guilty of violations of federal or state narcotics laws or controlled substances acts; appoints a guardian or conservator for the licensee, intern, or transfer care specialist; or commits a licensee, intern, or transfer care specialist.\nComplaints or reports made under this section may be submitted to the regulatory agency on forms provided by the regulatory agency. The regulatory agency, where appropriate, shall provide each complainant with a written acknowledgment of the receipt of the completed complaint form.\nThe regulatory agency shall furnish to a complainant a statement of the result of an investigation of the complaint and a description of the activities and actions of the regulatory agency relating to the complaint to the extent that the statement is consistent with section 149A.04, subdivision 5.\nSection 149A.04, subdivision 5, applies to data submitted to the regulatory agency under this section.",
	"repealed": false
}