{
	"id": "349.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.12",
	"title": "349.12 DEFINITIONS.",
	"text": "As used in sections 349.11 to 349.23 the terms in this section have the meanings given them.\n\"Active member\" means a member:\n(1) who has paid all dues to the organization;\n(2) who is 18 years of age or older;\n(3) who has equal voting rights with all other members;\n(4) who has equal opportunity to be an elected officer;\n(5) who has equal right and responsibilities of attendance at the regularly scheduled meetings of the organization;\n(6) whose name and membership origination date appear with the member's knowledge and consent on a list of members of the organization; and\n(7) who has been a member of the organization for at least the most recent 90 days.\n\"Affiliate\" is any person or entity directly or indirectly controlling, controlled by, or under common control or ownership with a licensee of the board or any officer or director of a licensee of the board.\n\"Allowable expense\" means the percentage of the total cost incurred by the organization in the purchase of any good, service, or other item which corresponds to the proportion of the total actual use of the good, service, or other item that is directly related to conduct of lawful gambling.\n\"Bar operation\" means a method of selling and redeeming disposable gambling equipment by an employee of the lessor within a leased premises which is licensed for the on-sale of alcoholic beverages.\n\"Bar bingo\" is a bingo occasion conducted at a permitted premises in an area where on-sale intoxicating liquor or on-sale 3.2 percent malt beverages are sold and where a licensed organization conducts another form of lawful gambling and consents to the conduct of bar bingo on the premises. Bar bingo does not include bingo games linked to other permitted premises.\n\"Bingo\" means a game where each player has a bingo hard card, bingo paper sheet, or facsimile of a bingo paper sheet when used in conjunction with an electronic bingo device, for which a consideration has been paid, and played in accordance with this chapter and with rules of the board for the conduct of bingo. \"Bingo\" also includes a linked bingo game.\n\"Bingo occasion\" means a single gathering or session at which a series of one or more successive bingo games is played. There is no limit on the number of games conducted during a bingo occasion. A bingo occasion must not last longer than eight consecutive hours, except that linked bingo games played on electronic bingo devices may be played during regular business hours of the permitted premises, and all play during this period is considered a bingo occasion for reporting purposes. For permitted premises where the primary business is bingo, regular business hours shall be defined as the hours between 8:00 a.m. and 2:00 a.m.\n\"Board\" is the Gambling Control Board.\n\"Booth operation\" means a method of selling and redeeming disposable gambling equipment by an employee of a licensed organization in a premises the organization leases or owns.\n\"Capital assets\" means property, real or personal, except gambling equipment, with an expected useful life of at least two years and a minimum value of $2,000.\n\"Charitable contribution\" means one or more of the lawful purposes expenditures under subdivision 25, paragraph (a), clauses (1) to (7), (10) to (15), and (19).\n\"Checker\" means a person who records the number of bingo hard cards purchased and played during each game and records the prizes awarded to the recorded hard cards, but does not collect the payment for the hard cards.\n\"Continuation raffle\" means the selection of winning entries from previously selected winning entries until a final selection of winning entries is determined and no additional consideration is required beyond the initial consideration to enter the raffle. A continuation raffle may be conducted over a period of time but cannot exceed 12 months.\n\"Deal\" means each separate package, or series of packages, consisting of one game of pull-tabs or tipboards with the same serial number.\n\"Director\" is the director of the Gambling Control Board.\n\"Distributor\" is a person who sells gambling equipment for use within the state to licensed organizations, or to organizations conducting excluded or exempt activities under section 349.166.\n\"Distributor salesperson\" means a person who in any manner receives orders for gambling equipment or who solicits a licensed, exempt, or excluded organization to purchase gambling equipment from a licensed distributor.\nMS 1990 [Repealed, 1991 c 233 s 110]\n\"Electronic bingo device\" means a handheld and portable electronic device that:\n(1) is used by a bingo player to:\n(i) monitor bingo paper sheets or a facsimile of a bingo paper sheet purchased and played at the time and place of an organization's bingo occasion, or to play an electronic bingo game that is linked with other permitted premises;\n(ii) activate numbers announced or displayed, and to compare the numbers to the bingo faces previously stored in the memory of the device;\n(iii) identify a winning bingo pattern or game requirement; and\n(iv) play against other bingo players;\n(2) limits the play of bingo faces to 36 faces per game;\n(3) requires coded entry to activate play but does not allow the use of a coin, currency, or tokens to be inserted to activate play;\n(4) may only be used for play against other bingo players in a bingo game;\n(5) has no additional function as an amusement or gambling device other than as an electronic pull-tab game defined under section 349.12, subdivision 12c;\n(6) has the capability to ensure adequate levels of security internal controls;\n(7) has the capability to permit the board to electronically monitor the operation of the device and the internal accounting systems;\n(8) has the capability to allow use by a player who is visually impaired; and\n(9) contains no spinning reels or other representations that mimic a video slot machine, including but not limited to free plays, bonus games, screens, or game features that are triggered after the initial symbols are revealed that display the results of the game.\n(a) \"Electronic pull-tab device\" means a handheld and portable electronic device that:\n(1) is used to play one or more electronic pull-tab games;\n(2) requires coded entry to activate play but does not allow the use of coin, currency, or tokens to be inserted to activate play;\n(3) requires that a player must individually activate or individually open each electronic pull-tab ticket and each individual line, row, or column of each electronic pull-tab ticket;\n(4) maintains information pertaining to accumulated win credits that may be applied to games in play or redeemed upon termination of play;\n(5) has no spinning reels or other representations that mimic a video slot machine;\n(6) has no additional function as a gambling device other than as an electronic-linked bingo game played on a device defined under section 349.12, subdivision 12a;\n(7) may incorporate an amusement game feature as part of the pull-tab game but may not require additional consideration for that feature or award any prize, or other benefit for that feature;\n(8) may have auditory or visual enhancements to promote or provide information about the game being played, provided the component does not affect the outcome of a game or display the results of a game;\n(9) maintains, on nonresettable meters, a printable, permanent record of all transactions involving each device and electronic pull-tab games played on the device;\n(10) is not a pull-tab dispensing device as defined under subdivision 32a; and\n(11) has the capability to allow use by a player who is visually impaired.\n(b) An electronic pull-tab device must not include representations that mimic the display or user interface of a video slot machine by requiring a player to manually activate the reveal or result of each single row of symbols with a separate and distinct action for each electronic pull-tab ticket.\n(a) \"Electronic pull-tab game\" means a pull-tab game containing:\n(1) facsimiles of pull-tab tickets that are played on an electronic pull-tab device;\n(2) a predetermined, finite number of winning and losing tickets, not to exceed 7,500 tickets;\n(3) the same price for each ticket in the game;\n(4) a price paid by the player of not less than 25 cents per ticket;\n(5) tickets that are in conformance with applicable board rules for pull-tabs;\n(6) winning tickets that comply with prize limits under section 349.211;\n(7) a unique serial number that may not be regenerated;\n(8) an electronic flare that displays the game name; form number; predetermined, finite number of tickets in the game; and prize tier;\n(9) no spinning reels or other representations that mimic a video slot machine, including but not limited to free plays, bonus games, screens, or game features that are triggered after the initial symbols are revealed that display the results of the game;\n(10) a mechanism requiring a player to manually activate each electronic pull-tab ticket to be opened; and\n(11) a mechanism requiring a player to manually activate the reveal of each single row of symbols with a separate and distinct action.\n(b) Each electronic pull-tab game shall include a certification from a board-approved testing laboratory that the game and device meets the standards and requirements established in Minnesota Statutes and Minnesota Rules and is in conformance with game procedures provided by the manufacturer.\n\"Electronic pull-tab game system\" means the equipment leased from a licensed distributor and used by a licensed organization to conduct, manage, and record electronic pull-tab games, and to report and transmit the game results as prescribed by the board and the Department of Revenue. The system must provide security and access levels sufficient so that internal control objectives are met as prescribed by the board. The system must contain a point of sale station.\n\"Electronic raffle selection system\" means a system which uses a random number generator to select winning raffle numbers and includes raffle sales devices.\n\"Face value\" means the price per ticket printed on the ticket or the flare.\nMS 2000 [Repealed, 2002 c 386 art 1 s 12]\n\"501(c)(3) organization\" is an organization exempt from the payment of federal income taxes under section 501(c)(3) of the Internal Revenue Code.\nMS 2010 [Renumbered subd 15c]\n\"501(c)(19) organization\" is an organization exempt from the payment of federal income taxes under section 501(c)(19) of the Internal Revenue Code.\n\"Festival organization\" is an organization conducting a community festival that is exempt from the payment of federal income taxes under section 501(c)(4) of the Internal Revenue Code.\n\"Flare\" is the posted display, with registration stamp affixed or bar code imprinted or affixed, that sets forth the rules of a particular game of pull-tabs or tipboards and that is associated with a specific deal of pull-tabs or grouping of tipboards.\n\"Fraternal organization\" means a nonprofit organization which is a branch, lodge, or chapter of a national or state organization registered by the Internal Revenue Service as a 501(c)8 or a 501(c)10 nonprofit organization and exists for the common business, fraternal, or other interests of its members. The term does not include college and high school fraternities and sororities.\n\"Free play\" means a winning ticket that is labeled as a free play or its equivalent.\n\"Gambling equipment\" means gambling equipment that is either disposable or permanent gambling equipment.\n(a) Disposable gambling equipment includes the following:\n(1) bingo hard cards or paper sheets, including linked bingo paper sheets;\n(2) paper and electronic pull-tabs;\n(3) jar tickets;\n(4) paddle tickets and paddle ticket cards;\n(5) tipboards and tipboard tickets;\n(6) promotional tickets that mimic a pull-tab or tipboard;\n(7) application software and those computer programs provided by a licensed manufacturer in the production, play, and reporting of board-approved electronic pull-tab games or electronic bingo games;\n(8) raffle boards; and\n(9) a disposable sealed placard, containing all 75 randomly placed bingo letter and number combinations, that, when opened, is used to select the bingo numbers in a single game of bingo.\n(b) Permanent gambling equipment includes the following:\n(1) devices for selecting bingo numbers;\n(2) electronic bingo devices;\n(3) electronic pull-tab devices;\n(4) pull-tab dispensing devices;\n(5) programmable electronic devices that have no effect on the outcome of a game and are used to provide a visual or auditory enhancement of a game;\n(6) paddlewheels;\n(7) paddlewheel tables; and\n(8) electronic raffle selection systems.\n\"Gambling manager\" means a person who has been designated by the organization to supervise the lawful gambling conducted by it, has been an active member of the organization for at least the most recent 90 days at the time of the application for a gambling manager license, and meets other qualifications as prescribed by the board by rule.\n\"Gross profit\" means the gross receipts collected from lawful gambling, less reasonable sums necessarily and actually expended for prizes.\n\"Gross receipts\" means all receipts derived from lawful gambling activity including, but not limited to, the following items:\n(1) gross sales of bingo hard cards, paper sheets, facsimiles of bingo paper sheets when used in conjunction with an electronic bingo device, and rental of electronic bingo devices before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(2) the ideal gross of pull-tab and tipboard deals or games less the value of unsold and defective tickets and before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(3) gross sales of raffle tickets and paddle tickets before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(4) admission, commission, cover, or other charges imposed on participants in lawful gambling activity as a condition for or cost of participation; and\n(5) interest, dividends, annuities, profit from transactions, or other income derived from the accumulation or use of gambling proceeds.\nGross receipts does not include rental proceeds from premises owned by an organization and leased to one or more other organizations for the purposes of conducting lawful gambling.\n\"Hot-ball bingo prize\" is an additional prize awarded for a winning bingo face for which the last bingo number called in the bingo game matches a previously designated bingo number announced to all players immediately prior to the beginning of the bingo game or the bingo occasion.\n\"Ideal gross\" means the total amount of receipts that would be received if every individual ticket in the pull-tab or tipboard deal was sold at its face value. In the calculation of ideal gross and prizes, a free play ticket shall be valued at face value.\n\"Ideal net\" means the pull-tab or tipboard deal's ideal gross, as defined under subdivision 22, less the total predetermined prize amounts available to be paid out. When the prize is not entirely a monetary one, the ideal net is 50 percent of the ideal gross.\n\"Lawful gambling\" is the operation, conduct or sale of bingo, raffles, paddlewheels, tipboards, and pull-tabs.\n(a) \"Lawful purpose\" means one or more of the following:\n(1) any expenditure by or contribution to a 501(c)(3) or festival organization, as defined in subdivision 15c, provided that the organization and expenditure or contribution are in conformity with standards prescribed by the board under section 349.154, which standards must apply to both types of organizations in the same manner and to the same extent;\n(2) a contribution to or expenditure for goods and services for an individual or family suffering from poverty, homelessness, or disability, which is used to relieve the effects of that suffering;\n(3) a contribution to a program recognized by the Minnesota Department of Human Services for the education, prevention, or treatment of problem gambling;\n(4) a contribution to or expenditure on a public or private nonprofit educational institution registered with or accredited by this state or any other state;\n(5) a contribution to an individual, public or private nonprofit educational institution registered with or accredited by this state or any other state, or to a scholarship fund of a nonprofit organization whose primary mission is to award scholarships, for defraying the cost of education to individuals where the funds are awarded through an open and fair selection process;\n(6) activities by an organization or a government entity which recognize military service to the United States, the state of Minnesota, or a community, subject to rules of the board, provided that the rules must not include mileage reimbursements in the computation of the per diem reimbursement limit and must impose no aggregate annual limit on the amount of reasonable and necessary expenditures made to support:\n(i) members of a military marching or color guard unit for activities conducted within the state;\n(ii) members of an organization solely for services performed by the members at funeral services;\n(iii) members of military marching, color guard, or honor guard units may be reimbursed for participating in color guard, honor guard, or marching unit events within the state or states contiguous to Minnesota at a per participant rate of up to $50 per diem; or\n(iv) active military personnel and their immediate family members in need of support services;\n(7) recreational, community, and athletic facilities and activities, intended primarily for persons under age 21, provided that such facilities and activities do not discriminate on the basis of gender and the organization complies with section 349.154, subdivision 3a;\n(8) payment of local taxes authorized under this chapter, including local gambling taxes authorized under section 349.213, subdivision 3, taxes imposed by the United States on receipts from lawful gambling, the taxes imposed by section 297E.02, subdivisions 1 and 6, and the tax imposed on unrelated business income by section 290.05, subdivision 3;\n(9) payment of real estate taxes and assessments on permitted gambling premises owned by the licensed organization paying the taxes, or wholly leased by a licensed veterans organization under a national charter recognized under section 501(c)(19) of the Internal Revenue Code;\n(10) a contribution to the United States, this state or any of its political subdivisions, or any agency or instrumentality thereof other than a direct contribution to a law enforcement or prosecutorial agency;\n(11) a contribution to or expenditure by a nonprofit organization which is a church or body of communicants gathered in common membership for mutual support and edification in piety, worship, or religious observances;\n(12) an expenditure for citizen monitoring of surface water quality by individuals or nongovernmental organizations that is consistent with section 115.06, subdivision 4, and Minnesota Pollution Control Agency guidance on monitoring procedures, quality assurance protocols, and data management, provided that the resulting data is submitted to the Minnesota Pollution Control Agency for review and inclusion in the state water quality database;\n(13) a contribution to or expenditure on projects or activities approved by the commissioner of natural resources for:\n(i) wildlife management projects that benefit the public at large;\n(ii) grant-in-aid trail maintenance and grooming established under sections 84.83 and 84.927, and other trails open to public use, including purchase or lease of equipment for this purpose; and\n(iii) supplies and materials for safety training and educational programs coordinated by the Department of Natural Resources, including the Enforcement Division;\n(14) conducting nutritional programs, food shelves, and congregate dining programs primarily for persons who are age 62 or older or disabled;\n(15) a contribution to a community arts organization, or an expenditure to sponsor arts programs in the community, including but not limited to visual, literary, performing, or musical arts;\n(16) an expenditure by a licensed fraternal organization or a licensed veterans organization for payment of water, fuel for heating, electricity, and sewer costs for:\n(i) up to 100 percent for a building wholly owned or wholly leased by and used as the primary headquarters of the licensed veteran or fraternal organization; or\n(ii) a proportional amount subject to approval by the director and based on the portion of a building used as the primary headquarters of the licensed veteran or fraternal organization;\n(17) expenditure by a licensed veterans organization of up to $5,000 in a calendar year in net costs to the organization for meals and other membership events, limited to members and spouses, held in recognition of military service. No more than $5,000 can be expended in total per calendar year under this clause by all licensed veterans organizations sharing the same veterans post home;\n(18) payment of fees authorized under this chapter imposed by the state of Minnesota to conduct lawful gambling in Minnesota;\n(19) a contribution or expenditure to honor an individual's humanitarian service as demonstrated through philanthropy or volunteerism to the United States, this state, or local community;\n(20) a contribution by a licensed organization to another licensed organization with prior board approval, with the contribution designated to be used for one or more of the following lawful purposes under this section: clauses (1) to (7), (11) to (15), (19), and (25);\n(21) an expenditure that is a contribution to a parent organization, if the parent organization: (i) has not provided to the contributing organization within one year of the contribution any money, grants, property, or other thing of value, and (ii) has received prior board approval for the contribution that will be used for a program that meets one or more of the lawful purposes under subdivision 7a;\n(22) an expenditure for the repair, maintenance, or improvement of real property and capital assets owned by an organization, or for the replacement of a capital asset that can no longer be repaired, with a fiscal year limit of five percent of gross profits from the previous fiscal year, with no carryforward of unused allowances. The fiscal year is July 1 through June 30. Total expenditures for the fiscal year may not exceed the limit unless the board has specifically approved the expenditures that exceed the limit due to extenuating circumstances beyond the organization's control. An expansion of a building or bar-related expenditures are not allowed under this provision.\n(i) The expenditure must be related to the portion of the real property or capital asset that must be made available for use free of any charge to other nonprofit organizations, community groups, or service groups, and is used for the organization's primary mission or headquarters.\n(ii) An expenditure may be made to bring an existing building that the organization owns into compliance with the Americans with Disabilities Act.\n(iii) An organization may apply the amount that is allowed under item (ii) to the erection or acquisition of a replacement building that is in compliance with the Americans with Disabilities Act if the board has specifically approved the amount. The cost of the erection or acquisition of a replacement building may not be made from gambling proceeds, except for the portion allowed under this item;\n(23) an expenditure for the acquisition or improvement of a capital asset with a cost greater than $2,000, excluding real property, that will be used exclusively for lawful purposes under this section if the board has specifically approved the amount;\n(24) an expenditure for the acquisition, erection, improvement, or expansion of real property, if the board has first specifically authorized the expenditure after finding that the real property will be used exclusively for lawful purpose under this section;\n(25) an expenditure, including a mortgage payment or other debt service payment, for the erection or acquisition of a comparable building to replace an organization-owned building that was destroyed or made uninhabitable by fire or catastrophe or to replace an organization-owned building that was taken or sold under an eminent domain proceeding. The expenditure may be only for that part of the replacement cost not reimbursed by insurance for the fire or catastrophe or compensation not received from a governmental unit under the eminent domain proceeding, if the board has first specifically authorized the expenditure; or\n(26) a contribution to a 501(c)(19) organization that does not have an organization license under section 349.16 and is not affiliated with the contributing organization, and whose owned or leased property is not a permitted premises under section 349.165. The 501(c)(19) organization may only use the contribution for lawful purposes under this subdivision or for the organization's primary mission. The 501(c)(19) organization may not use the contribution for expansion of a building or for bar-related expenditures. A contribution may not be made to a statewide organization representing a consortia of 501(c)(19) organizations.\n(b) Expenditures authorized by the board under paragraph (a), clauses (24) and (25), must be 51 percent completed within two years of the date of board approval; otherwise the organization must reapply to the board for approval of the project. \"Fifty-one percent completed\" means that the work completed must represent at least 51 percent of the value of the project as documented by the contractor or vendor.\n(c) Notwithstanding paragraph (a), \"lawful purpose\" does not include:\n(1) any expenditure made or incurred for the purpose of influencing the nomination or election of a candidate for public office or for the purpose of promoting or defeating a ballot question;\n(2) any activity intended to influence an election or a governmental decision-making process;\n(3) a contribution to a statutory or home rule charter city, county, or town by a licensed organization with the knowledge that the governmental unit intends to use the contribution for a pension or retirement fund; or\n(4) a contribution to a 501(c)(3) organization or other entity with the intent or effect of not complying with lawful purpose restrictions or requirements.\n\"Linked bingo game\" means a bingo game played at two or more locations where licensed organizations are authorized to conduct bingo, where there is a common prize pool and a common selection of numbers or symbols conducted at one location, and where the results of the selection are transmitted to all participating locations by satellite, telephone, or other means by a linked bingo game provider.\n\"Linked bingo game provider\" means any person who provides the means to link bingo games, who provides linked bingo prize management, and who provides the linked bingo game system.\n\"Linked bingo game system\" means the equipment used by the linked bingo provider to conduct, transmit, and track a linked bingo game. The system must be approved by the board before its use in this state and it must have the capability to permit the board to electronically monitor its operation remotely. For linked electronic bingo games, the system includes electronic bingo devices.\n\"Linked bingo prize pool\" means the total of all prize money that each participating organization has contributed to a linked bingo game prize and includes any portion of the prize pool that is carried over from one game to another in a progressive linked bingo game.\nFor purposes of this section, \"manually activate\" means that a person must either touch an icon on the electronic pull-tab device screen or press a button located elsewhere on the electronic pull-tab device, or, exclusively for purposes of accommodating use by a player who is visually impaired, perform some other action that initiates activity on an electronic pull-tab device.\n\"Manufacturer\" means a person or entity who assembles from raw materials or subparts a completed piece of gambling equipment, and who sells or furnishes the equipment for resale or for use in the state. The term includes a person who converts, modifies, adds to, or removes parts or a portion from an item, device, or assembly to further its promotion, sale, or use as gambling equipment in this state. A person only adding or modifying promotional flares to advise the public of the prizes available, the rules of play, and the consideration required is not a manufacturer.\n\"Master flare\" is the posted display, with registration stamp affixed or bar code imprinted or affixed, that is used in conjunction with sealed groupings of 100 or fewer sequentially numbered paddle ticket cards.\n\"Net profit\" means gross profit less reasonable sums actually expended for allowable expenses.\n\"Organization\" means any fraternal, religious, veterans, or other nonprofit organization.\n\"Paddle ticket\" means a preprinted ticket that can be used to place wagers on the spin of a paddlewheel.\n\"Paddle ticket card\" means a card to which detachable paddle tickets are attached.\n\"Paddle ticket card number\" means the unique serial number preprinted by the manufacturer on the stub of a paddle ticket card and the paddle tickets attached to the card.\n\"Paddlewheel\" means a vertical wheel marked off into sections containing one or more numbers, and which, after being turned or spun, uses a pointer or marker to indicate winning chances, and may only be used to determine a winning number or numbers matching a winning paddle ticket purchased by a player. A paddlewheel may be an electronic device that simulates a paddlewheel.\n\"Person\" is an individual, organization, firm, association, partnership, limited liability company, corporation, trustee, or legal representative.\n\"Profit carryover\" means cumulative net profit less cumulative lawful purpose expenditures.\nA paper pull-tab ticket or paper tipboard ticket created and printed by a licensed manufacturer with the words \"no purchase necessary\" and \"for promotional use only\" and for which no consideration is given is a promotional ticket.\n\"Pull-tab\" means a single folded or banded paper ticket, multi-ply card with perforated break-open tabs, or a facsimile of a paper pull-tab ticket used in conjunction with an electronic pull-tab device, the face of which is initially covered to conceal one or more numbers or symbols, and where one or more of each set of tickets, cards, or facsimiles has been designated in advance as a winner.\n\"Pull-tab dispensing device\" means a mechanical device that dispenses paper pull-tabs and has no additional function as an amusement or gambling device. A pull-tab dispensing device may have as a component an auditory or visual enhancement to promote or provide information about a game being dispensed, provided the component does not affect the outcome of a game or display the results of a game or an individual ticket.\n\"Raffle\" means a game in which a participant buys a ticket or other certificate of participation in an event where the prize determination is based on a method of random selection and all entries have an equal chance of selection.\n\"Raffle board\" means a placard with up to 200 squares whereby participants in the raffle write their names to indicate entry.\n\"Raffle sales device\" is an attendant-operated cashier station used as a point of sale for raffle tickets from which a raffle participant may purchase a raffle ticket to participate in an electronic raffle selection system.\n\"Share the pot raffle\" means a raffle in which the prize amount is a percentage of the raffle's gross receipts.\n\"Tipboard\" means a board, placard or other device containing a seal that conceals the winning number or symbol, and that serves as the game flare for a tipboard game. A sports-themed tipboard is a board, placard, or other device that contains a grid of predesignated numbers for which the winning numbers are determined in whole or in part by the numerical outcome of one or more professional sporting events, serves as the game flare for player registration, but is not required to contain a seal. For a sports-themed tipboard, the winning numbers must be determined solely by the numerical outcome.\n\"Tipboard ticket\" is a single folded or banded ticket, or multi-ply card, the face of which is initially covered or otherwise hidden from view to conceal a number, symbol, or set of symbols, some of which have been designated in advance and at random as prize winners. For a sports-themed tipboard, the tipboard ticket contains a set of numbers used to determine the winner based on the numerical outcome of a professional sporting event.\n\"Veterans post home\" means a building, or portion of a building, that is leased or owned by one or more licensed veterans organizations, and that is considered the post home for all licensed veterans organizations at that site.\n\"Wholly leased building\" means a building that is leased in its entirety by a licensed organization, and no part or portion of the building is subleased to any other entity or licensed organization.\n\"Wholly owned building\" means a building that is owned in its entirety by a licensed organization, and no part or portion of the building is subleased to any other entity or licensed organization.",
	"repealed": false
}