{
	"id": "563.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/563.02",
	"title": "563.02 INMATE LIABILITY FOR FEES AND COSTS.",
	"text": "For purposes of this section, \"inmate\" means a person who is not represented by counsel, who has been convicted of a felony, who is committed to the custody of the commissioner of corrections, and is:\n(1) confined in a state correctional facility; or\n(2) released from a state correctional facility under section 244.065 or 244.07.\n(a) An inmate who wishes to commence a civil action by proceeding in forma pauperis must meet the following requirements, in addition to the requirements of section 563.01, subdivision 3:\n(1) exhaust the inmate complaint procedure developed under the commissioner of corrections policy and procedure before commencing a civil action against the department, and state in the application to proceed in forma pauperis that the inmate has done so; and\n(2) include the following information in an affidavit submitted under section 563.01:\n(i) a statement that the inmate's claim is not substantially similar to a previous claim brought by the inmate against the same party, arising from the same operative facts, and in which there was an action that operated as an adjudication on the merits;\n(ii) complete information on the inmate's identity, the nature and amount of the inmate's income, spouse's income, if available to the inmate, real property owned by the inmate, and the inmate's bank accounts, debts, monthly expenses, and number of dependents; and\n(iii) the most recent monthly statement provided by the commissioner of corrections showing the balance in the inmate's inmate account.\n(b) The inmate shall also attach a written authorization for the court to obtain at any time during pendency of the present action, without further authorization from the inmate, a current statement of the inmate's inmate account balance, if needed to determine eligibility to proceed with bringing a civil action in forma pauperis. An inmate who has no funds in an inmate account satisfies the requirement of section 563.01, subdivision 3, clause (c).\n(c) An inmate who seeks to proceed as a plaintiff in forma pauperis must file with the court the complaint in the action and the affidavit under this section before serving the complaint on an opposing party.\n(d) An inmate who has funds in an inmate account may only proceed as a plaintiff in a civil action by paying the lesser of:\n(1) the applicable court filing fee; or\n(2) 50 percent of the balance shown in the inmate's account according to the statement filed with the court under this subdivision, consistent with the requirements of section 243.23, subdivision 3.\n(e) If an inmate elects to proceed under paragraph (d), the court shall notify the commissioner of corrections to withdraw from the inmate's account the amount required under this section and forward the amount to the court administrator in the county where the action was commenced. The court shall also notify the commissioner of corrections of the amount of the filing fee remaining unpaid. The commissioner shall continue making withdrawals from the inmate's account and forwarding the amounts withdrawn to the court administrator, at intervals as the applicable funds in the inmate's account equal at least $10, until the entire filing fee and any costs have been paid in full.\n(a) The court may, as provided by this subdivision, dismiss, in whole or in part, an action in which an affidavit has been filed under section 563.01 by an inmate seeking to proceed as a plaintiff. The action shall be dismissed without prejudice on a finding that the allegation of financial inability to pay fees, costs, and security for costs is false. The action shall be dismissed with prejudice if it is frivolous or malicious. The court shall provide a copy of its order dismissing an action or claim under this section to the commissioner of corrections.\n(b) In determining whether an action is frivolous or malicious, the court may consider whether:\n(1) the claim has no arguable basis in law or fact; or\n(2) the claim is substantially similar to a previous claim that was brought against the same party, arises from the same operative facts, and in which there was an action that operated as an adjudication on the merits.\n(c) An order dismissing the action or specific claims asserted in the action may be entered before or after service of process, and with or without holding a hearing.\n(d) If the court dismisses a specific claim in the action, it shall designate any issue and defendant on which the action is to proceed without the payment of fees and costs. An order under this subdivision is not subject to interlocutory appeal.\n(e) To determine whether the allegation of financial inability to pay fees, costs, and security for costs is false or whether the claim is frivolous or malicious, the court may:\n(1) request the commissioner of corrections to file a report under oath responding to the issues described in paragraph (b), clause (1) or (2);\n(2) order the commissioner of corrections to furnish information on the balance in the inmate's inmate account, if authorized by the inmate under subdivision 2; or\n(3) hold a hearing at the correctional facility where the inmate is confined on the issue of whether the allegation of financial inability to pay is false, or whether the claim is frivolous or malicious.\nA natural person who is named as a defendant in a civil action brought by an inmate may appear and defend the action, including any appeal in the action, without prepayment of the filing fee. If the action is dismissed under rule 12 or 56 of the Rules of Civil Procedure, the inmate is liable for the person's fees and costs, including reasonable attorney fees. In all other instances, the defendant shall pay the defendant's filing fee at the conclusion of the action or when ordered by the court.",
	"repealed": false
}