{
	"id": "92.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.12",
	"title": "92.12 APPRAISAL OF SCHOOL AND OTHER STATE LANDS.",
	"text": "The commissioner may have any school trust or other state lands appraised. The appraisals must be made by regularly appointed and qualified state appraisers. To be qualified, an appraiser must hold a state appraiser license issued by the Department of Commerce. The appraisal must be in conformity with the Uniform Standards of Professional Appraisal Practice of the Appraisal Foundation.\nThe appraiser shall view and appraise the lands, including the merchantable timber and improvements on them, and make a report to the commissioner. The valuation of the lands and the merchantable timber and improvements on them must each be made. The minimum price established by the appraisal is the minimum price for the lands until changed by later appraisal. The price may not be less than $5 an acre.\n[Repealed, 1961 c 657 s 3]\nThe commissioner shall hold frequent sales of school trust and other state lands. The commissioner shall sell lands the commissioner considers best for the public interest.\nWhen the appraisal or other reports show that the land is mainly valuable for agricultural purposes and contains only small quantities of timber, the commissioner may either sell the timber separately as provided by law for state timber sales or sell the land as agricultural land. If the land is sold as agricultural land the purchaser must pay down as first payment an amount equal to the value of the timber, in addition to the first payment required on the land. If the appraisal and other reports show land should be sold for continuous forest production or other conservation purpose, the commissioner may require that the full appraised value of land and timber must be paid by the purchaser at the time of purchase.\nThe appraisers must report to the commissioner lands that they believe should be drained. After the state has constructed or has been assessed for a public ditch or drain, the lands assessed or improved must be reappraised before being offered for sale.",
	"repealed": false
}