{
	"id": "383B.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.116",
	"title": "383B.116 PAYMENT PROCEDURES AND ACCOUNTING.",
	"text": "The county shall pay for obligations in accordance with appropriations duly made. Payment and distribution shall be made in accordance with methods and procedures established by the county administrator, pursuant to section 383B.111 and consistent with sections 471.35 to 471.41.\nPayments of claims and obligations of the county may be made by warrant, check, or all forms of electronic or wire funds transfer. Section 471.38 does not apply to any claim for which payment is made by electronic or wire funds transfer. Where the county is authorized by law to make investments, the county may make electronic or wire transfers of funds notwithstanding any other law to the contrary.\nThe making of payments or the incurring of obligations in excess of appropriations or when sufficient moneys are not or will not be available to cover claims or meet obligations when they become due and payable shall be prohibited. This subdivision shall not apply to investments authorized by law to be made on behalf of the county.\nA commissioner who knowingly authorizes or makes a payment or incurs an obligation in violation of the provisions of sections 383B.111 to 383B.119 is guilty of a gross misdemeanor. When deficits are incurred or anticipated as a result of services required to be performed pursuant to chapters 393 and 401 and Laws 1963, chapter 738, as amended, this subdivision shall not apply.\nSubject to procedures developed by the administrator, warrants issued on one fund in which there is a temporary insufficiency of money may be redeemed by the county treasury through temporary borrowing from any other fund in the treasury for a period not to exceed one year.\nThe county may accept payment by use of a credit card, debit card, or all forms of electronic or wire funds transfer. Subject to any other law to the contrary, the county may add to the amount due a service charge for the acceptance of a payment method authorized in this subdivision. The county shall adopt policies and procedures regarding the payments.",
	"repealed": false
}