{
	"id": "169.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.21",
	"title": "169.21 PEDESTRIAN.",
	"text": "Pedestrians shall be subject to traffic-control signals at intersections as heretofore declared in this chapter, but at all other places pedestrians shall be accorded the privileges and shall be subject to the restrictions stated in this section and section 169.22.\n(a) Where traffic-control signals are not in place or in operation, the driver of a vehicle shall stop to yield the right-of-way to a pedestrian crossing the roadway within a marked crosswalk or at an intersection with no marked crosswalk. The driver must remain stopped until the pedestrian has passed the lane in which the vehicle is stopped. No pedestrian shall suddenly leave a curb or other place of safety and walk or run into the path of a vehicle which is so close that it is impossible for the driver to yield. This provision shall not apply under the conditions as otherwise provided in this subdivision.\n(b) When any vehicle is stopped at a marked crosswalk or at an intersection with no marked crosswalk to permit a pedestrian to cross the roadway, the driver of any other vehicle approaching from the rear shall not overtake and pass the stopped vehicle.\n(c) It is unlawful for any person to drive a motor vehicle through a column of school children crossing a street or highway or past a member of a school safety patrol or adult crossing guard, while the member of the school safety patrol or adult crossing guard is directing the movement of children across a street or highway and while the school safety patrol member or adult crossing guard is holding an official signal in the stop position. A peace officer may arrest the driver of a motor vehicle if the peace officer has probable cause to believe that the driver has operated the vehicle in violation of this paragraph within the past four hours.\n(d) A person who violates this subdivision is guilty of a misdemeanor. A person who violates this subdivision a second or subsequent time within one year of a previous conviction under this subdivision is guilty of a gross misdemeanor.\n(a) Every pedestrian crossing a roadway at any point other than within a marked crosswalk or at an intersection with no marked crosswalk shall yield the right-of-way to all vehicles upon the roadway.\n(b) Any pedestrian crossing a roadway at a point where a pedestrian tunnel or overhead pedestrian crossing has been provided shall yield the right-of-way to all vehicles upon the roadway.\n(c) Between adjacent intersections at which traffic-control signals are in operation pedestrians shall not cross at any place except in a marked crosswalk.\n(d) Notwithstanding the other provisions of this section every driver of a vehicle shall (1) exercise due care to avoid colliding with any bicycle or pedestrian upon any roadway and (2) give an audible signal when necessary and exercise proper precaution upon observing any child or any obviously confused or incapacitated person upon a roadway.\nPedestrians shall move when practicable upon the right half of crosswalks.\nPedestrians when walking or moving in a wheelchair along a roadway shall, when practicable, walk or move on the left side of the roadway or its shoulder giving way to oncoming traffic. Where sidewalks are provided and are accessible and usable it shall be unlawful for any pedestrian to walk or move in a wheelchair along and upon an adjacent roadway.\n[Renumbered 171.0701, subd 1b]",
	"repealed": false
}