{
	"id": "469.004",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.004",
	"title": "469.004 COUNTY AND MULTICOUNTY AUTHORITIES.",
	"text": "There is created in each county in this state other than those counties in which a county housing authority has been created by special act, a public body, corporate and politic, to be known as the housing and redevelopment authority of that county, hereinafter referred to as \"county authority.\" No county authority shall transact any business or exercise any powers until the governing body of the county, by resolution, finds that there is need for a county authority to function in the county. The governing body shall consider the need for a county authority to function (1) on the governing body's own motion or (2) upon the filing of a petition signed by 25 qualified voters of the county asserting that there is need for a county authority to function in the county and requesting that the governing body so declare. The governing body shall adopt a resolution declaring that there is need for a county authority to function in the county if it makes the findings required in section 469.003, subdivision 1.\nRamsey County may exercise the powers of a housing and redevelopment authority. Before the commencement of a project by Ramsey County acting as a housing and redevelopment authority, the governing body of the municipality in which the project is to be located shall, by majority vote, approve the project as recommended by the authority. A resolution of the county board may provide that the board will constitute the county housing and redevelopment authority.\nIf the governing body of each of two or more cities or counties, or combinations of cities and counties, hereinafter referred to as \"political subdivisions,\" by resolution declares that there is a need for one housing and redevelopment authority to exercise in those political subdivisions the powers and other functions prescribed for a multicounty housing and redevelopment authority, a public body corporate and politic to be known as a multicounty housing and redevelopment authority shall exist for all of those political subdivisions. That authority shall exercise its powers and other functions in those political subdivisions in lieu of the authority for each such political subdivision.\nThe governing body shall make that declaration if it finds (1) that substandard, slum, or deteriorated areas exist in the political subdivision which cannot be redeveloped without government assistance, or there is a shortage of decent, safe and sanitary dwelling accommodations available to persons of low income at rentals or prices they can afford, and (2) that a multicounty authority would be a more effective, efficient or economical administrative unit than the housing and redevelopment authority of the political subdivision to carry out the purposes of sections 469.001 to 469.047, in the political subdivision.\nIn determining whether dwelling accommodations are unsafe or unsanitary a governing body may take into consideration the factors provided in section 469.003.\nWhen the resolution becomes finally effective, it shall be deemed sufficient and conclusive for all purposes if it declares that there is need for a county or multicounty authority and finds in substantially the terms provided in subdivision 3 that the conditions therein described exist.\nA county or multicounty housing authority will serve, program, develop, and manage all housing programs under its jurisdiction. Where a county or multicounty authority has been established, additional city housing and redevelopment authorities shall not be created within the area of operation of the county or multicounty authority without the explicit concurrence of the county or multicounty housing and redevelopment authority and the commissioner of employment and economic development. City housing and redevelopment authorities must petition the county or multicounty authority for authorization to establish a local housing authority and this petition must be approved by the commissioner of employment and economic development. This subdivision does not apply if a county or multicounty authority has not initiated or does not have in progress an active program or has not applied for a public housing, Section 8, or redevelopment program from the federal government for a period of 12 months after its establishment.\nWhen the resolution becomes finally effective, the clerk of the political subdivision shall file a certified copy with the commissioner of employment and economic development. The provisions of section 469.003, subdivision 4, regarding establishment of authorities apply to filings under this subdivision.",
	"repealed": false
}