{
	"id": "43A.316",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.316",
	"title": "43A.316 PUBLIC EMPLOYEES INSURANCE PROGRAM.",
	"text": "The legislature finds that the creation of a statewide program to provide public employees and other eligible persons with life insurance and hospital, medical, and dental benefit coverage through provider organizations would result in a greater utilization of government resources and would advance the health and welfare of the citizens of the state.\nFor the purpose of this section, the terms defined in this subdivision have the meaning given them.\n(a) Commissioner. \"Commissioner\" means the commissioner of management and budget.\n(b) Employee. \"Employee\" means:\n(1) a person who is a public employee within the definition of section 179A.03, subdivision 14, who is insurance eligible and is employed by an eligible employer;\n(2) an elected public official of an eligible employer who is insurance eligible;\n(3) a person employed by a labor organization or employee association certified as an exclusive representative of employees of an eligible employer or by another public employer approved by the commissioner, so long as the plan meets the requirements of a governmental plan under United States Code, title 29, section 1002(32); or\n(4) a person employed by a county or municipal hospital.\n(c) Eligible employer. \"Eligible employer\" means:\n(1) a public employer within the definition of section 179A.03, subdivision 15, that is a town, county, city, school district as defined in section 120A.05, service cooperative as defined in section 123A.21, intermediate district as defined in section 136D.01, Cooperative Center for Vocational Education as defined in section 123A.22, regional management information center as defined in section 123A.23, or an education unit organized under the joint powers action, section 471.59; or\n(2) an exclusive representative of employees, as defined in paragraph (b);\n(3) a county or municipal hospital; or\n(4) another public employer approved by the commissioner.\n(d) Exclusive representative. \"Exclusive representative\" means an exclusive representative as defined in section 179A.03, subdivision 8.\n(e) Program. \"Program\" means the statewide public employees insurance program created by subdivision 3.\nThe commissioner shall be the administrator of the public employee insurance program and may determine its funding arrangements. The commissioner shall model the program after the plan established in section 43A.18, subdivision 2, but may modify that plan.\n[Repealed, 2014 c 286 art 1 s 5]\n(a) Participation in the program is subject to the conditions in this subdivision.\n(b) Each exclusive representative for an eligible employer determines whether the employees it represents will participate in the program. The exclusive representative shall give the employer notice of intent to participate at least 30 days before the expiration date of the collective bargaining agreement preceding the collective bargaining agreement that covers the date of entry into the program. The exclusive representative and the eligible employer shall give notice to the commissioner of the determination to participate in the program at least 30 days before entry into the program. Entry into the program is governed by a schedule established by the commissioner.\n(c) Employees not represented by exclusive representatives may become members of the program upon a determination of an eligible employer to include these employees in the program. Either all or none of the employer's unrepresented employees must participate. The eligible employer shall give at least 30 days' notice to the commissioner before entering the program. Entry into the program is governed by a schedule established by the commissioner.\n(d) Participation in the program is for a four-year term. Participation is automatically renewed for an additional four-year term unless the exclusive representative, or the employer for unrepresented employees, gives the commissioner notice of withdrawal at least 30 days before expiration of the participation period. A group that withdraws must wait two years before rejoining. An exclusive representative, or employer for unrepresented employees, may also withdraw if premiums increase 20 percent or more from one insurance year to the next.\n(e) The exclusive representative shall give the employer notice of intent to withdraw to the commissioner at least 30 days before the expiration date of a collective bargaining agreement that includes the date on which the term of participation expires.\n(f) Each participating eligible employer shall notify the commissioner of names of individuals who will be participating within two weeks of the commissioner receiving notice of the parties' intent to participate. The employer shall also submit other information as required by the commissioner for administration of the program.\n(a) By January 1, 1989, the commissioner shall announce the benefits of the program. The program shall include employee hospital, medical, dental, and life insurance for employees and hospital and medical benefits for dependents. Health maintenance organization options and other delivery system options may be provided if they are available, cost-effective, and capable of servicing the number of people covered in the program. Participation in optional coverages may be provided by collective bargaining agreements. For employees not represented by an exclusive representative, the employer may offer the optional coverages to eligible employees and their dependents provided in the program.\n(b) The commissioner shall periodically assess whether it is financially feasible for the program to offer or to continue an individual retiree program that has competitive premium rates and benefits. If the commissioner determines it to be feasible to offer an individual retiree program, the commissioner shall announce the applicable benefits, premium rates, and terms of participation. Eligibility to participate in the individual retiree program is governed by subdivision 8, but applies to retirees of eligible employers that do not participate in the program and to those retirees' dependents and surviving spouses.\nAll benefits provided by the program or a successor program relating to expenses incurred for medical treatment or services of a physician must also include chiropractic treatment and services of a chiropractor to the extent that the chiropractic services and treatment are within the scope of chiropractic licensure.\nThis subdivision is intended to provide equal access to benefits for program members who choose to obtain treatment for illness or injury from a doctor of chiropractic, as long as the treatment falls within the chiropractor's scope of practice. This subdivision is not intended to change or add to the benefits provided for in the program.\nThe proportion of premium paid by the employer and employee is subject to collective bargaining or personnel policies. If, at the beginning of the coverage period, no collective bargaining agreement has been finalized, the increased dollar costs, if any, from the previous year is the sole responsibility of the individual participant until a collective bargaining agreement states otherwise. Premiums, including an administration fee, shall be established by the commissioner. Each employer shall pay monthly the amounts due for employee benefits including the amounts under subdivision 8 to the commissioner no later than the dates established by the commissioner. If an employer fails to make the payments as required, the commissioner may cancel program benefits and pursue other civil remedies.\n(a) A former employee of an employer participating in the program who is receiving a public pension disability benefit or an annuity or has met the age and service requirements necessary to receive an annuity under chapter 353, 353C, 354, 354A, 356, or 423, or Minnesota Statutes 2008, chapter 422A, and the former employee's dependents, are eligible to participate in the program. This participation is at the person's expense unless a collective bargaining agreement or personnel policy provides otherwise. Premiums for these participants must be established by the commissioner.\nThe commissioner may provide policy exclusions for preexisting conditions only when there is a break in coverage between a participant's coverage under the employment-based group insurance program and the participant's coverage under this section. An employer shall notify an employee of the option to participate under this paragraph no later than the effective date of retirement. The retired employee or the employer of a participating group on behalf of a current or retired employee shall notify the commissioner within 30 days of the effective date of retirement of intent to participate in the program according to the rules established by the commissioner.\n(b) The spouse of a deceased employee or former employee may purchase the benefits provided at premiums established by the commissioner if the spouse was a dependent under the employee's or former employee's coverage under this section at the time of the death. The spouse remains eligible to participate in the program as long as the group that included the deceased employee or former employee participates in the program. Coverage under this clause must be coordinated with relevant insurance benefits provided through the federally sponsored Medicare program.\n(c) The program benefits must continue in the event of strike permitted by section 179A.18, if the exclusive representative chooses to have coverage continue and the employee pays the total monthly premiums when due.\n(d) A participant who discontinues coverage may not reenroll.\nPersons participating under these paragraphs shall make appropriate premium payments in the time and manner established by the commissioner.\nThe insurance trust fund in the state treasury consists of deposits of the premiums received from employers participating in the program and transfers before July 1, 1994, from the excess contributions holding account established by Minnesota Statutes 1995 Supplement, section 353.65, subdivision 7. All money in the fund is appropriated to the commissioner to pay insurance premiums, approved claims, refunds, administrative costs, and other related service costs. Premiums paid by employers to the fund are exempt from the taxes imposed by chapter 297I. The commissioner shall reserve an amount of money to cover the estimated costs of claims incurred but unpaid. The State Board of Investment shall invest the money according to section 11A.24. Investment income and losses attributable to the fund must be credited to the fund.\nThe public employee insurance program and, where applicable, the employers participating in it are exempt from chapters 60A, 62A, 62C, 62D, 62E, and 62H; section 471.617, subdivisions 2 and 3; and the bidding requirements of section 471.6161. The public employee insurance program must follow the requirements of section 471.6161, subdivision 8.\nUpon receipt of a request for a proposal from a school district pursuant to section 471.6161, subdivision 8, the public employees insurance program shall respond to the request within 60 days.",
	"repealed": false
}