{
	"id": "144G.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.09",
	"title": "144G.09 COMMISSIONER OVERSIGHT AND AUTHORITY OVER ASSISTED LIVING FACILITIES.",
	"text": "The commissioner shall regulate assisted living facilities pursuant to this chapter. The regulations shall include the following:\n(1) provisions to assure, to the extent possible, the health, safety, well-being, and appropriate treatment of residents while respecting individual autonomy and choice;\n(2) requirements that facilities furnish the commissioner with specified information necessary to implement this chapter;\n(3) standards of training of facility personnel;\n(4) standards for the provision of assisted living services;\n(5) standards for medication management;\n(6) standards for supervision of assisted living services;\n(7) standards for resident evaluation or assessment;\n(8) standards for treatments and therapies;\n(9) requirements for the involvement of a resident's health care provider, the documentation of the health care provider's orders, if required, and the resident's service plan;\n(10) standards for the maintenance of accurate, current resident records;\n(11) the establishment of levels of licenses based on services provided; and\n(12) provisions to enforce these regulations and the assisted living bill of rights.\n(a) The commissioner shall:\n(1) license, survey, and monitor without advance notice assisted living facilities in accordance with this chapter and rules;\n(2) survey every provisional licensee within one year of the provisional license issuance date subject to the provisional licensee providing assisted living services to residents;\n(3) survey assisted living facility licensees at least once every two years;\n(4) investigate complaints of assisted living facilities;\n(5) issue correction orders and assess civil penalties under sections 144G.30 and 144G.31;\n(6) take action as authorized in section 144G.20; and\n(7) take other action reasonably required to accomplish the purposes of this chapter.\n(b) The commissioner shall review blueprints for all new facility construction and must approve the plans before construction may be commenced.\n(c) The commissioner shall provide on-site review of the construction to ensure that all physical environment standards are met before the facility license is complete.\n(a) The commissioner shall adopt rules for all assisted living facilities that promote person-centered planning and service delivery and optimal quality of life, and that ensure resident rights are protected, resident choice is allowed, and public health and safety is ensured.\n(b) On July 1, 2019, the commissioner shall begin rulemaking.\n(c) The commissioner shall adopt rules that include but are not limited to the following:\n(1) staffing appropriate for each licensure category to best protect the health and safety of residents no matter their vulnerability;\n(2) training prerequisites and ongoing training, including dementia care training and standards for demonstrating competency;\n(3) procedures for discharge planning and ensuring resident appeal rights;\n(4) initial assessments, continuing assessments, and a uniform assessment tool;\n(5) emergency disaster and preparedness plans;\n(6) uniform checklist disclosure of services;\n(7) a definition of serious injury that results from maltreatment;\n(8) conditions and fine amounts for planned closures;\n(9) procedures and timelines for the commissioner regarding termination appeals between facilities and the Office of Administrative Hearings;\n(10) establishing base fees and per-resident fees for each category of licensure;\n(11) considering the establishment of a maximum amount for any one fee;\n(12) procedures for relinquishing an assisted living facility with dementia care license and fine amounts for noncompliance; and\n(13) procedures to efficiently transfer existing housing with services registrants and home care licensees to the new assisted living facility licensure structure.\n(d) The commissioner shall publish the proposed rules by December 31, 2019, and shall publish final rules by December 31, 2020.",
	"repealed": false
}