{
	"id": "256B.0916",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0916",
	"title": "256B.0916 EXPANSION OF HOME AND COMMUNITY-BASED SERVICES.",
	"text": "[Repealed, 2002 c 220 art 14 s 20]\n(a) Beginning with fiscal year 2000, the commissioner shall distribute all funding available for home and community-based waiver services for persons with developmental disabilities to individual counties or to groups of counties that form partnerships to jointly plan, administer, and authorize funding for eligible individuals. The commissioner shall encourage counties to form partnerships that have a sufficient number of recipients and funding to adequately manage the risk and maximize use of available resources.\n(b) Counties must submit a request for funds and a plan for administering the program as required by the commissioner. The plan must identify the number of clients to be served, their ages, and their priority listing based on:\n(1) requirements in Minnesota Rules, part 9525.1880; and\n(2) statewide priorities identified in section 256B.092, subdivision 12.\nThe plan must also identify changes made to improve services to eligible persons and to improve program management.\n(c) In allocating resources to counties, priority must be given to groups of counties that form partnerships to jointly plan, administer, and authorize funding for eligible individuals and to counties determined by the commissioner to have sufficient waiver capacity to maximize resource use.\n(d) Within 30 days after receiving the county request for funds and plans, the commissioner shall provide a written response to the plan that includes the level of resources available to serve additional persons.\n(e) Counties are eligible to receive medical assistance administrative reimbursement for administrative costs under criteria established by the commissioner.\n(f) The commissioner shall manage waiver allocations in such a manner as to fully use available state and federal waiver appropriations.\n[See Note.]\n(a) By October 1 of each year the commissioner shall notify the county board if any county determined by the commissioner to have insufficient capacity to maximize use of available resources fails to develop a partnership with other counties or fails to submit a plan as required in subdivision 2. The commissioner shall provide needed technical assistance to a county or group of counties that fails to form a partnership or submit a plan. If a county has not joined a county partnership or submitted a plan within 30 days following the notice by the commissioner of its failure, the commissioner shall require and assist that county to develop a plan or contract with another county or group of counties to plan and administer the waiver services program in that county.\n(b) Counties may request technical assistance, management information, and administrative support from the commissioner at any time. The commissioner shall respond to county requests within 30 days. Priority shall be given to activities that support the administrative needs of newly formed county partnerships.\n[See Note.]\nCounties or groups of counties participating in partnerships that have submitted a plan under this section may develop an allowed reserve amount to meet crises and other unmet needs of current home and community-based waiver recipients. The amount of the allowed reserve shall be a county specific amount based upon documented past experience and projected need for the coming year described in an allowed reserve plan submitted for approval to the commissioner with the allocation request for the fiscal year.\n[See Note.]\n(a) The commissioner shall monitor county utilization of allocated resources and, as appropriate, reassign resources not utilized.\n(b) Effective July 1, 2002, the commissioner shall authorize the spending of new diversion resources beginning January 1 of each year.\n(c) Effective July 1, 2002, the commissioner shall manage the reassignment of waiver resources that occur from persons who have left the waiver in a manner that results in the cost reduction equivalent to delaying the reuse of those waiver resources by 180 days.\n(d) Priority consideration for reassignment of resources shall be given to counties that form partnerships. In addition to the priorities listed in Minnesota Rules, part 9525.1880, the commissioner shall also give priority consideration to persons whose living situations are unstable due to the age or incapacity of the primary caregiver and to children to avoid out-of-home placement.\n[See Note.]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\nMS 2012 [Expired, 2012 c 216 art 9 s 23]\n(a) The commissioner shall make available financial and waiting list information on the department's website.\n(b) The financial information must include:\n(1) the most recent end of session forecast available for the disability home and community-based waiver programs authorized under sections 256B.092 and 256B.49; and\n(2) the most current financial information, updated at least monthly for the disability home and community-based waiver program authorized under section 256B.092 and three disability home and community-based waiver programs authorized under section 256B.49 for each county and tribal agency, including:\n(i) the amount of resources allocated;\n(ii) the amount of resources authorized for participants; and\n(iii) the amount of allocated resources not authorized and the amount not used as provided in subdivision 12, and section 256B.49, subdivision 27.\n(c) The waiting list information must be provided quarterly beginning August 1, 2016, and must include at least:\n(1) the number of persons screened and waiting for services listed by urgency category, the number of months on the wait list, age group, and the type of services requested by those waiting;\n(2) the number of persons beginning waiver services who were on the waiting list, and the number of persons beginning waiver services who were not on the waiting list;\n(3) the number of persons who left the waiting list but did not begin waiver services; and\n(4) the number of persons on the waiting list with approved funding but without a waiver service agreement and the number of days from funding approval until a service agreement is effective for each person.\n(d) By December 1 of each year, the commissioner shall compile a report posted on the department's website that includes:\n(1) the financial information listed in paragraph (b) for the most recently completed allocation period;\n(2) for the previous four quarters, the waiting list information listed in paragraph (c);\n(3) for a 12-month period ending October 31, a list of county and tribal agencies required to submit a corrective action plan under subdivisions 11 and 12, and section 256B.49, subdivisions 26 and 27; and\n(4) for a 12-month period ending October 31, a list of the county and tribal agencies from which resources were moved as authorized in section 256B.092, subdivision 12, and section 256B.49, subdivision 11a, the amount of resources taken from each agency, the counties that were given increased resources as a result, and the amounts provided.\n[See Note.]\nThe commissioner, in cooperation with representatives of counties, service providers, service recipients, family members, legal representatives and advocates, shall develop criteria to allow legal representatives to be reimbursed for providing specific support services to meet the person's needs when a plan which assures health and safety has been agreed upon and carried out by the legal representative, the person, and the county. Legal representatives providing support under the home and community-based waiver for persons with developmental disabilities or the consumer support grant program pursuant to section 256.476, shall not be considered to have a direct or indirect service provider interest under section 256B.092, subdivision 7, if a health and safety plan which meets the criteria established has been agreed upon and implemented. By August 1, 2001, the commissioner shall submit, for federal approval, amendments to allow legal representatives to provide support and receive reimbursement under the home and community-based waiver plan.\nMS 2022 [Repealed, 2024 c 125 art 1 s 48; 2024 c 127 art 46 s 48]\n[See Note.]\nCounty and tribal agencies are responsible for spending in excess of the allocation made by the commissioner. In the event a county or tribal agency spends in excess of the allocation made by the commissioner for a given allocation period, they must submit a corrective action plan to the commissioner for approval. The plan must state the actions the agency will take to correct their overspending for the two years following the period when the overspending occurred. The commissioner shall recoup spending in excess of the allocation only in cases where statewide spending exceeds the appropriation designated for the home and community-based services waivers. Nothing in this subdivision shall be construed as reducing the county's responsibility to offer and make available feasible home and community-based options to eligible waiver recipients within the resources allocated to them for that purpose.\n[See Note.]\nCounty and tribal agencies are responsible for spending the annual allocation made by the commissioner. In the event a county or tribal agency spends less than 97 percent of the allocation, while maintaining a list of persons waiting for waiver services, the county or tribal agency must submit a corrective action plan to the commissioner for approval. The commissioner may determine a plan is unnecessary given the size of the allocation and capacity for new enrollment. The plan must state the actions the agency will take to assure reasonable and timely access to home and community-based waiver services for persons waiting for services. If a county or tribe does not submit a plan when required or implement the changes required, the commissioner shall assure access to waiver services within the county's or tribe's available allocation and take other actions needed to assure that all waiver participants in that county or tribe are receiving appropriate waiver services to meet their needs.\n[See Note.]",
	"repealed": false
}