{
	"id": "126C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.12",
	"title": "126C.12 LEARNING AND DEVELOPMENT REVENUE AMOUNT AND USE.",
	"text": "Of a district's general education revenue for fiscal year 2015 and thereafter each school district shall reserve an amount equal to the following calculation:\n(1) average daily membership, according to section 126C.05, subdivision 5, in kindergarten times $299; plus\n(2) average daily membership, according to section 126C.05, subdivision 5, in grades 1 to 6 times $459.\n(a) \"Classroom teacher\" means a public employee licensed by the Professional Educator Licensing and Standards Board who is authorized to teach all subjects to children in any grade in kindergarten through grade 6 and whose duties are full-time regular classroom instruction, excluding a teacher for whom federal aids are received or for whom categorical aids are received under section 125A.76 or who is an itinerant teacher or provides instruction outside of the regular classroom. Except as provided in section 122A.68, subdivision 6, classroom teacher does not include supervisory and support personnel defined in section 122A.15. A classroom teacher whose duties are less than full-time instruction must be included as an equivalent only for the number of hours of instruction in kindergarten through grade 3.\n(b) \"Class size\" means the districtwide ratio at each grade level of the number of full-time students in kindergarten through grade 3 served at least 40 percent of the time in regular classrooms to the number of full-time classroom teachers in kindergarten through grade 3, determined as of October 1 of each school year.\nInstruction may be provided by a classroom teacher or by a team of classroom teachers, or by a teacher resident supervised by a classroom teacher. The district must maximize classroom teacher to learner average instructional contact time in the core subjects of reading and mathematics.\n(a) Revenue must be used to reduce and maintain the district's average class size in kindergarten through grade 3 to a level of 17 to 1 on average in each of the respective grades.\n(b) A district must not increase the districtwide class sizes in other grades as a result of reducing class sizes in kindergarten through grade 3. Revenue may not be used to provide instructor preparation. A district may use a portion of the revenue reserved under this section to employ up to the same number of full-time equivalent education assistants or aides as the district employed during the 1992-1993 school year under Minnesota Statutes 1992, section 124.331, subdivision 2, through fiscal year 2002. Beginning in fiscal year 2003, class size reduction revenue may only be reserved to employ classroom teachers contributing to lower class sizes in kindergarten through grade 3.\nIf the board of a district determines that the district has achieved and is maintaining the class sizes specified in subdivision 4, the board may use the revenue to reduce class size in grades 4, 5, and 6, prepare and use individualized learning plans, improve program offerings, purchase instructional material, services, or technology, or provide staff development needed for reduced class sizes.\n[Repealed, 1Sp2015 c 3 art 1 s 28]\nA school district must annually report the district's class size ratios by each grade to the commissioner of education in the form and manner specified by the commissioner. The department must annually submit a report beginning December 1, 2024, to the chairs and ranking minority members of the legislative committees with jurisdiction over kindergarten through grade 12 education detailing the statewide ratios by grade starting with the 2023-2024 school year.",
	"repealed": false
}