{
	"id": "253B.141",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.141",
	"title": "253B.141 AUTHORITY TO DETAIN AND TRANSPORT A MISSING PATIENT.",
	"text": "(a) If a patient committed under this chapter or detained in a treatment facility or state-operated treatment program under a judicial hold is absent without authorization, and either: (1) does not return voluntarily within 72 hours of the time the unauthorized absence began; or (2) is considered by the head of the facility or program to be a danger to self or others, then the head of the facility or program shall report the absence to the local law enforcement agency. The head of the facility or program shall also notify the committing court that the patient is absent and that the absence has been reported to the local law enforcement agency. The committing court may issue an order directing the law enforcement agency to transport the patient to an appropriate treatment facility, state-operated treatment program, or community-based treatment program.\n(b) Upon receiving a report that a patient subject to this section is absent without authorization, the local law enforcement agency shall enter information on the patient into the missing persons file of the National Crime Information Center computer according to the missing persons practices.\n(a) Upon receiving the report of absence from the head of the treatment facility, state-operated treatment program, or community-based treatment program or the committing court, a patient may be apprehended and held by a peace officer in any jurisdiction pending return to the facility or program from which the patient is absent without authorization. A patient may also be returned to any state-operated treatment program or any other treatment facility or community-based treatment program willing to accept the person. A person who has a mental illness and is dangerous to the public and detained under this subdivision may be held in a jail or lockup only if:\n(1) there is no other feasible place of detention for the patient;\n(2) the detention is for less than 24 hours; and\n(3) there are protections in place, including segregation of the patient, to ensure the safety of the patient.\n(b) If a patient is detained under this subdivision, the head of the facility or program from which the patient is absent shall arrange to pick up the patient within 24 hours of the time detention was begun and shall be responsible for securing transportation for the patient to the facility or program. The expense of detaining and transporting a patient shall be the responsibility of the facility or program from which the patient is absent. The expense of detaining and transporting a patient to a state-operated treatment program shall be paid by the commissioner unless paid by the patient or persons on behalf of the patient.\nImmediately after an absent patient is located, the head of the facility or program from which the patient is absent, or the law enforcement agency that located or returned the absent patient, shall notify the law enforcement agency that first received the absent patient report under this section and that agency shall cancel the missing persons entry from the National Crime Information Center computer.",
	"repealed": false
}