{
	"id": "518.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.175",
	"title": "518.175 PARENTING TIME.",
	"text": "(a) In all proceedings for dissolution or legal separation, subsequent to the commencement of the proceeding and continuing thereafter during the minority of the child, the court shall, upon the request of either parent, grant such parenting time on behalf of the child and a parent as will enable the child and the parent to maintain a child to parent relationship that will be in the best interests of the child. The court, when issuing a parenting time order, may reserve a determination as to the future establishment or expansion of a parent's parenting time. In that event, the best interest standard set forth in subdivision 5, paragraph (a), shall be applied to a subsequent motion to establish or expand parenting time.\n(b) If the court finds, after a hearing, that parenting time with a parent is likely to endanger the child's physical, mental, or emotional health or safety or impair the child's emotional development, the court shall restrict parenting time with that parent as to time, place, duration, or supervision and may deny parenting time entirely, as the circumstances warrant. The court shall consider the age of the child and the child's relationship with the parent prior to the commencement of the proceeding.\n(c) A parent's failure to pay support because of the parent's inability to do so shall not be sufficient cause for denial of parenting time.\n(d) The court may provide that a law enforcement officer or other appropriate person will accompany a party seeking to enforce or comply with parenting time.\n(e) Upon request of either party, to the extent practicable an order for parenting time must include a specific schedule for regular parenting time, including the frequency and duration of parenting time and parenting time during holidays, vacations, and school breaks unless parenting time is restricted, denied, or reserved.\n(f) The court administrator shall provide a form for a pro se motion regarding parenting time disputes, which includes provisions for indicating the relief requested, an affidavit in which the party may state the facts of the dispute, and a brief description of the parenting time expeditor process under section 518.1751. The form may not include a request for a change of custody. The court shall provide instructions on serving and filing the motion.\n(g) In the absence of other evidence, there is a rebuttable presumption that a child must receive a minimum of at least 25 percent of the parenting time with each parent. For purposes of this paragraph, the percentage of parenting time may be determined by calculating the number of overnights that a child spends with a parent or by using a method other than overnights if the parent has significant time periods on separate days when the child is in the parent's physical custody but does not stay overnight. The court may consider the age of the child in determining whether a child is with a parent for a significant period of time.\n(a) If a parent requests supervised parenting time under subdivision 1 or 5 and an order for protection under chapter 518B or a similar law of another state is in effect against the other parent to protect the parent with whom the child resides or the child, the judge or judicial officer must consider the order for protection in making a decision regarding parenting time.\n(b) The state court administrator, in consultation with representatives of parents and other interested persons, shall develop standards to be met by persons who are responsible for supervising parenting time. Either parent may challenge the appropriateness of an individual chosen by the court to supervise parenting time.\nUpon the request of either parent, the court may inform any child of the parties, if eight years of age or older, or otherwise of an age of suitable comprehension, of the rights of the child and each parent under the order or decree or any substantial amendment thereof. The parent with whom the child resides shall present the child for parenting time with the other parent, at such times as the court directs.\n(a) The parent with whom the child resides shall not move the residence of the child to another state except upon order of the court or with the consent of the other parent, if the other parent has been given parenting time by the decree. If the purpose of the move is to interfere with parenting time given to the other parent by the decree, the court shall not permit the child's residence to be moved to another state.\n(b) The court shall apply a best interests standard when considering the request of the parent with whom the child resides to move the child's residence to another state. The factors the court must consider in determining the child's best interests include, but are not limited to:\n(1) the nature, quality, extent of involvement, and duration of the child's relationship with the person proposing to relocate and with the nonrelocating person, siblings, and other significant persons in the child's life;\n(2) the age, developmental stage, needs of the child, and the likely impact the relocation will have on the child's physical, educational, and emotional development, taking into consideration special needs of the child;\n(3) the feasibility of preserving the relationship between the nonrelocating person and the child through suitable parenting time arrangements, considering the logistics and financial circumstances of the parties;\n(4) the child's preference, taking into consideration the age and maturity of the child;\n(5) whether there is an established pattern of conduct of the person seeking the relocation either to promote or thwart the relationship of the child and the nonrelocating person;\n(6) whether the relocation of the child will enhance the general quality of the life for both the custodial parent seeking the relocation and the child including, but not limited to, financial or emotional benefit or educational opportunity;\n(7) the reasons of each person for seeking or opposing the relocation; and\n(8) the effect on the safety and welfare of the child, or of the parent requesting to move the child's residence, of domestic abuse, as defined in section 518B.01.\n(c) The burden of proof is upon the parent requesting to move the residence of the child to another state, except that if the court finds that the person requesting permission to move has been a victim of domestic abuse by the other parent, the burden of proof is upon the parent opposing the move. The court must consider all of the factors in this subdivision in determining the best interests of the child.\n[Repealed, 1996 c 391 art 1 s 6]\n(a) If a parenting plan or an order granting parenting time cannot be used to determine the number of overnights or overnight equivalents the child has with each parent, the court shall modify the parenting plan or order granting parenting time so that the number of overnights or overnight equivalents the child has with each parent can be determined. For purposes of this section, \"overnight equivalents\" has the meaning given in section 518A.36, subdivision 1.\n(b) If modification would serve the best interests of the child, the court shall modify the decision-making provisions of a parenting plan or an order granting or denying parenting time, if the modification would not change the child's primary residence. Consideration of a child's best interest includes a child's changing developmental needs.\n(c) Except as provided in section 631.52, the court may not restrict parenting time unless it finds that:\n(1) parenting time is likely to endanger the child's physical or emotional health or impair the child's emotional development; or\n(2) the parent has chronically and unreasonably failed to comply with court-ordered parenting time.\nA modification of parenting time which increases a parent's percentage of parenting time to an amount that is between 45.1 to 54.9 percent parenting time is not a restriction of the other parent's parenting time.\n(d) If a parent makes specific allegations that parenting time by the other parent places the parent or child in danger of harm, the court shall hold a hearing at the earliest possible time to determine the need to modify the order granting parenting time. Consistent with subdivision 1a, the court may require a third party, including the local social services agency, to supervise the parenting time or may restrict a parent's parenting time if necessary to protect the other parent or child from harm. If there is an existing order for protection governing the parties, the court shall consider the use of an independent, neutral exchange location for parenting time.\n(a) Each party must follow a court's order for custody and parenting time unless the parties have made another agreement in writing as defined by section 645.44, subdivision 14.\n(b) For the purposes of this subdivision, \"court-ordered parenting time\" means:\n(1) parenting time that a court has ordered, regardless of whether the order is temporary or permanent and whether family court or juvenile court has issued the order;\n(2) an order by a parenting time consultant, parenting coordinator, special master, or other court-appointed individual who is authorized to establish or modify parenting time; or\n(3) a binding agreement or decision under section 518.1751, subdivision 3.\n(c) The court shall fully consider providing compensatory parenting time when a parent has intentionally made a substantial amount of court-ordered parenting time unavailable to the other parent unless providing the compensatory parenting time is not consistent with the child's best interests. The court must consider all relevant evidence to determine whether a parent has made a substantial amount of court-ordered parenting time unavailable to the other parent.\n(d) If the court finds that a person has been deprived of court-ordered parenting time under paragraph (b), the court shall order the parent who has interfered to allow compensatory parenting time to the other parent. When compensatory parenting time is awarded, additional parenting time must be:\n(1) at least of the same type and duration as the deprived parenting time and, at the discretion of the court, may be in excess of or of a different type than the deprived parenting time;\n(2) taken within one year after the deprived parenting time; and\n(3) at a time acceptable to the parent deprived of parenting time.\n(e) If the court finds that a party has repeatedly and intentionally denied or interfered with court-ordered parenting time, the court must, in addition to awarding compensatory parenting time, require the party to reimburse the other party for costs incurred as a result of the party's denial of or interference with court-ordered parenting time and award reasonable attorney fees to the other party, provided that the court finds that the party from whom fees, costs, and disbursements are sought has the means to pay them. The court may:\n(1) impose a sanction of up to $500 against the party who denied or interfered with parenting time that is payable to the other party;\n(2) modify legal and physical custody of the child by awarding custody of the child to the party whose parenting time was denied or interfered with, in accordance with the procedures under section 518.18; or\n(3) award any other remedy that the court finds to be in the best interests of the children involved.\n(f) The court shall provide one or more of the remedies available in paragraph (e), clauses (1) and (2), if the court finds that a party has repeatedly and intentionally denied or interfered with court-ordered parenting time after a previous finding that the party repeatedly and intentionally denied or interfered with court-ordered parenting time.\n(g) If the court makes written findings that any denial of or interference with court-ordered parenting time was necessary to protect a child's physical or emotional health, the court is not required to comply with paragraphs (d) to (f).\n(h) If the court finds that a party has been denied parenting time and has incurred expenses in connection with the denied parenting time, the court may require the party who denied parenting time to post a bond in favor of the other party in the amount of prepaid expenses associated with upcoming planned parenting time.\n(i) Proof of an unwarranted denial of or interference with duly established parenting time may constitute contempt of court and may be sufficient cause for reversal of custody.\n(j) All parenting time orders must include notice of the provisions of this subdivision.\n(k) The required notice under paragraph (j) must be substantially as follows:\n\"NOTICE REGARDING COMPLIANCE WITH PARENTING TIME ORDER:\nThe parties are expected to fully comply with the court's order unless the parties mutually agree otherwise in writing as defined by Minnesota Statutes, section 645.44, subdivision 14. Pursuant to Minnesota Statutes, section 518.175, subdivision 6, and Minnesota Statutes, section 518.131, subdivision 11, the parties are hereby notified that:\n(1) The court shall award compensatory parenting time to a parent who has been prevented from exercising parenting time.\n(2) Deprivation of parental rights is a FELONY crime pursuant to Minnesota Statutes, section 609.375.\n(3) If the court finds that one parent has repeatedly and intentionally denied or interfered with another parent's parenting time, then the court shall award attorney fees to the parent who has been denied parenting time and require the parent who has been denying or interfering with parenting time to pay the other parent for costs incurred as a result of enforcing the decision.\n(4) If the court finds that one parent has repeatedly and intentionally denied or interfered with parenting time, then the court may also:\n(i) transfer custody of the child to the other parent;\n(ii) impose a sanction of up to $500 on the parent who repeatedly and intentionally denied or interfered with parenting time; or\n(iii) award other relief as determined to be in the best interests of the children involved.\"\n(l) An order issued under this section requiring reimbursement of costs or fees does not require a party to have direct contact with another party.\n[Renumbered 518.1752]\nThe court may allow additional parenting time to a parent to provide child care while the other parent is working if this arrangement is reasonable and in the best interests of the child, as defined in section 518.17, subdivision 1. In addition, the court shall consider:\n(1) the ability of the parents to cooperate;\n(2) methods for resolving disputes regarding the care of the child, and the parents' willingness to use those methods; and\n(3) whether domestic abuse, as defined in section 518B.01, has occurred between the parties.",
	"repealed": false
}