{
	"id": "121A.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.47",
	"title": "121A.47 EXCLUSION AND EXPULSION PROCEDURES.",
	"text": "No exclusion or expulsion shall be imposed without a hearing, unless the right to a hearing is waived in writing by the pupil and parent or guardian. The action shall be initiated by the school board or its agent.\nWritten notice of intent to take action shall:\n(a) be served upon the pupil and the pupil's parent or guardian personally or by mail;\n(b) contain a complete statement of the facts, a list of the witnesses and a description of their testimony;\n(c) state the date, time, and place of the hearing;\n(d) be accompanied by a copy of sections 121A.40 to 121A.56;\n(e) describe the nonexclusionary disciplinary practices accorded the pupil in an attempt to avoid the expulsion proceedings; and\n(f) inform the pupil and parent or guardian of the right to:\n(1) have a representative of the pupil's own choosing, including legal counsel, at the hearing. The district must advise the pupil's parent or guardian that free or low-cost legal assistance may be available and that a legal assistance resource list is available from the Department of Education and is posted on their website;\n(2) examine the pupil's records before the hearing;\n(3) present evidence; and\n(4) confront and cross-examine witnesses.\nThe hearing shall be scheduled within ten days of the service of the written notice unless an extension, not to exceed five days, is requested for good cause by the school board, pupil, parent or guardian.\nThe hearing shall be at a time and place reasonably convenient to pupil, parent or guardian.\nThe hearing shall be closed unless the pupil, parent or guardian requests an open hearing.\nThe hearing shall take place before:\n(1) an independent hearing officer;\n(2) a member of the school board;\n(3) a committee of the school board; or\n(4) the full school board;\nas determined by the school board. The hearing shall be conducted in a fair and impartial manner.\nThe school board shall record the hearing proceedings at district expense, and a party may obtain a transcript at its own expense. Testimony shall be given under oath. The hearing officer or a member of the school board shall have the power to issue subpoenas and administer oaths.\nAt a reasonable time prior to the hearing, the pupil, parent or guardian, or representative, shall be given access to all public school system records pertaining to the pupil, including any tests or reports upon which the proposed action may be based.\nThe pupil, parent or guardian, or representative, shall have the right to compel the attendance of any official employee or agent of the public school system or any public employee or any other person who may have evidence upon which the proposed action may be based, and to confront and to cross-examine any witness testifying for the public school system.\nThe pupil, parent or guardian, or representative, shall have the right to present evidence and testimony, including expert psychological or educational testimony.\nThe pupil cannot be compelled to testify in the dismissal proceedings.\nThe recommendation of the hearing officer or school board member or committee shall be based solely upon substantial evidence presented at the hearing and must be made to the school board and served upon the parties within two days of the end of the hearing.\nThe school board shall base its decision upon the recommendation of the hearing officer or school board member or committee and shall render its decision at a meeting held within five days after receiving the recommendation. The school board may provide the parties with the opportunity to present exceptions and comments to the hearing officer's recommendations provided that neither party presents any evidence not admitted at the hearing. The decision by the school board must be based on the record, must be in writing, and must state the controlling facts on which the decision is made in sufficient detail to apprise the parties and the commissioner of education of the basis and reason for the decision.\n(a) A school administrator must prepare and enforce an admission or readmission plan for any pupil who is excluded or expelled from school. The plan must include measures to improve the pupil's behavior, which may include completing a character education program, consistent with section 120B.232, subdivision 1, social and emotional learning, counseling, social work services, mental health services, referrals for special education or 504 evaluation, and evidence-based academic interventions. The plan must include reasonable attempts to obtain parental involvement in the admission or readmission process, and may indicate the consequences to the pupil of not improving the pupil's behavior.\n(b) The definition of suspension under section 121A.41, subdivision 10, does not apply to a student's dismissal from school for less than one school day, except as provided under federal law for a student with a disability. Each suspension action may include a readmission plan. A readmission plan must provide, where appropriate, alternative education services, which must not be used to extend the student's current suspension period. Consistent with section 125A.091, subdivision 5, a readmission plan must not obligate a parent or guardian to provide psychotropic drugs to their student as a condition of readmission. School officials must not use the refusal of a parent or guardian to consent to the administration of psychotropic drugs to their student or to consent to a psychiatric evaluation, screening or examination of the student as a ground, by itself, to prohibit the student from attending class or participating in a school-related activity, or as a basis of a charge of child abuse, child neglect or medical or educational neglect.",
	"repealed": false
}