{
	"id": "471.6161",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.6161",
	"title": "471.6161 GROUP INSURANCE; GOVERNMENTAL UNITS.",
	"text": "For purposes of this section, \"group insurance coverage\" means benefit coverage provided to a group through an entity authorized under section 43A.316 or 123A.21, subdivision 7; or chapter 61A, 62A, 62C, or 62D to do business in the state.\nEvery political subdivision authorized by law to purchase group insurance for its employees and providing or intending to provide group insurance coverage and benefits for 25 or more of its employees shall request proposals from and enter into contracts with entities referenced in subdivision 1 that in the judgment of the political subdivision are best qualified to provide coverage. The request for proposals shall be in writing and at a minimum shall include: coverage to be provided, criteria for evaluation of proposals from entities referenced in subdivision 1, and the aggregate claims records for the appropriate period. A political subdivision may exclude from consideration proposals requiring self-insurance. Public notice of the request for proposals must be provided in a newspaper or trade journal at least 21 days before the final date for submitting proposals.\nThe political subdivision shall make benefit and cost comparisons and evaluate the proposals using the written criteria. The political subdivision may negotiate with an entity referenced in subdivision 1 on benefits, premiums, and other contract terms. Any entity providing group insurance coverage to the political subdivision must provide the political subdivision with aggregate claims records for the appropriate period. The political subdivision must prepare a written rationale for its decision before entering into a contract with an entity referenced in subdivision 1.\nGroup insurance contracts may not exceed five years in length, including all extensions. The political subdivision shall request proposals for coverage at least once every 60 months. Employees may be added to an existing group pursuant to a joint powers agreement under section 471.59.\nThe aggregate value of benefits provided by a group insurance contract for employees covered by a collective agreement shall not be reduced, unless the public employer and exclusive representative of the employees of an appropriate bargaining unit, certified under section 179A.12, agree to a reduction in benefits.\nEvery political subdivision contracting for and providing group insurance coverage as provided in this section shall file with the clerk or other comparable officer of the subdivision a copy of the group insurance contract and make the copy available for public inspection.\nMS 1994 [Repealed, 1996 c 305 art 1 s 102]\n(a) Any entity providing group health insurance coverage to a school district must provide the school district with school district-specific nonidentifiable aggregate claims records for the most recent 24 months within 30 days of the request.\n(b) School districts shall request proposals for group health insurance coverage as provided in subdivision 2 from a minimum of three potential sources of coverage. One of these requests must go to an administrator governed by chapter 43A. Entities referenced in subdivision 1 must respond to requests for proposals received directly from a school district. School districts that are self-insured must also follow these provisions, except as provided in paragraph (g). School districts must make requests for proposals at least 150 days prior to the expiration of the existing contract but not more frequently than once every 24 months. The request for proposals must include the most recently available 24 months of nonidentifiable aggregate claims data. The request for proposals must be publicly released at or prior to its release to potential sources of coverage.\n(c) School district contracts for group health insurance must not be longer than two years unless the exclusive representative of the largest employment group and the school district agree otherwise.\n(d) All proposals for group health insurance coverage, including coverage offered under chapters 43A and 123A, must include the information described in this paragraph for each separate health plan being proposed. The information must be on the first page of each proposal in a summary section and in a separate tabular format. The information must use a uniform set of assumptions, including but not limited to enrollment projections by plan, enrollment projections by tier, and number of members. Proposals that do not include all of the following information are not eligible to be selected by a school district. All proposals must include the:\n(1) structure of the health plan, designating either exclusive provider organization, preferred provider organization, point of service, or health maintenance organization;\n(2) health plan actuarial value, using the minimum value calculator described in Code of Federal Regulations, title 45, section 156.145;\n(3) type of provider network, designating either narrow network, broad network, narrow tiered network, or broad tiered network;\n(4) agent or broker commissions paid as part of the premium, as requested by the proposal, displayed in dollars per member per month;\n(5) total premium dollars in the first 12-month period of the quote, not including commissions;\n(6) total premium dollars, per member per month, not including commissions; and\n(7) number of expected members used for the premium quote calculation.\n(e) All initial proposals shall be sealed upon receipt until they are all opened no less than 90 days prior to the plan's renewal date in the presence of up to three representatives selected by the exclusive representative of the largest group of employees. Section 13.591, subdivision 3, paragraph (b), applies to data in the proposals. The representatives of the exclusive representative must maintain the data according to this classification and are subject to the remedies and penalties under sections 13.08 and 13.09 for a violation of this requirement.\n(f) A school district, in consultation with the same representatives referenced in paragraph (e), may continue to negotiate with any entity that submitted a proposal under paragraph (e) in order to reduce costs or improve services under the proposal. Following the negotiations any entity that submitted an initial proposal may submit a final proposal incorporating the negotiations, which is due no less than 75 days prior to the plan's renewal date. All the final proposals submitted must be opened at the same time in the presence of up to three representatives selected by the exclusive representative of the largest group of employees. Notwithstanding section 13.591, subdivision 3, paragraph (b), following the opening of the final proposals, all the proposals, including any made under paragraph (e), and other data submitted in connection with the proposals are public data. The school district may choose from any of the initial or final proposals without further negotiations and in accordance with subdivision 5, but not sooner than 15 days after the proposals become public data.\n(g) School districts that are self-insured shall follow all of the requirements of this section, except that:\n(1) their requests for proposals may be for third-party administrator services, where applicable;\n(2) these requests for proposals must be from a minimum of three different sources, which may include both entities referenced in subdivision 1 and providers of third-party administrator services;\n(3) for purposes of fulfilling the requirement to request a proposal for group insurance coverage from an administrator governed by chapter 43A, self-insured districts are not required to include in the request for proposal the coverage to be provided;\n(4) a district that is self-insured on or before the date of enactment, or that is self-insured with more than 1,000 insured lives, or a district in which the school board adopted a motion on or before May 14, 2014, to approve a self-insured health care plan to be effective July 1, 2014, may, but need not, request a proposal from an administrator governed by chapter 43A;\n(5) requests for proposals must be sent to providers no less than 90 days prior to the expiration of the existing contract; and\n(6) proposals must be submitted at least 60 days prior to the plan's renewal date and all proposals shall be opened at the same time and in the presence of the exclusive representative, where applicable.\n(h) Nothing in this section shall restrict the authority granted to school district boards of education by section 471.59, except that districts will not be considered self-insured for purposes of this subdivision solely through participation in a joint powers arrangement.\n(i) An entity providing group health insurance to a school district under a multiyear contract must give notice of any rate or plan design changes applicable under the contract at least 90 days before the effective date of any change. The notice must be given to the school district and to the exclusive representatives of employees.",
	"repealed": false
}