{
	"id": "120B.236",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.236",
	"title": "120B.236 CARDIOPULMONARY RESUSCITATION AND AUTOMATIC EXTERNAL DEFIBRILLATOR INSTRUCTION.",
	"text": "(a) School districts must provide onetime cardiopulmonary resuscitation and automatic external defibrillator instruction as part of their grade 7 to 12 curriculum for all students in that grade beginning in the 2014-2015 school year and later. Training and instruction provided under this section need not result in cardiopulmonary resuscitation certification. Cardiopulmonary resuscitation and automatic external defibrillator instruction must include cardiopulmonary resuscitation and automatic external defibrillator training that has been developed:\n(1) by the American Heart Association or the American Red Cross and incorporate psychomotor skills to support the instruction; or\n(2) using nationally recognized, evidence-based guidelines for cardiopulmonary resuscitation and incorporates psychomotor skills to support the instruction.\n\"Psychomotor skills\" under this paragraph means hands-on practice to support cognitive learning; it does not mean cognitive-only instruction and training.\n(b) School districts may use community members such as emergency medical technicians, paramedics, police officers, firefighters, and representatives of the Minnesota Resuscitation Consortium, the American Heart Association, or the American Red Cross, among others, to provide instruction and training under this section. Community members are encouraged to provide needed training and instructional resources such as cardiopulmonary resuscitation kits and other materials at no cost to the school districts. A school administrator may waive this curriculum requirement for a high school transfer student regardless of whether or not the student previously received instruction under this section, an enrolled student absent on the day the instruction occurred under this section, or an eligible student who has a disability. If a school district requests resources, the Minnesota Resuscitation Consortium must provide them to the district for instruction and training provided to students under this section.",
	"repealed": false
}