{
	"id": "383E.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/383E.21",
	"title": "383E.21 COUNTYWIDE PUBLIC SAFETY IMPROVEMENTS AND EQUIPMENT; BONDING AND TAX LEVIES.",
	"text": "(a) To finance the cost of designing, constructing, and acquiring countywide public safety improvements and equipment, including personal property, benefiting both Anoka County and the municipalities located within Anoka County, the governing body of Anoka County may levy property taxes for public safety improvements and equipment, and issue:\n(1) capital improvement bonds under the provisions of section 373.40 as if the infrastructure and equipment qualified as a \"capital improvement\" within the meaning of section 373.40, subdivision 1, paragraph (b); and\n(2) capital notes under the provisions of section 373.01, subdivision 3, as if the equipment qualified as \"capital equipment\" within the meaning of section 373.01, subdivision 3. Personal property acquired with the proceeds of the bonds or capital notes issued under this section must have an expected useful life at least as long as the term of debt.\n(b) The outstanding principal amount of the bonds and the capital notes issued under this section may not exceed $8,000,000 at any time. Any bonds or notes issued pursuant to this section must only be issued after approval by a majority vote of the Anoka County Joint Law Enforcement Council, a joint powers board.\n(a) Anoka County shall not include any taxes levied under this section in its levy certified under section 275.07, subdivision 1, paragraph (a). Anoka County shall separately certify taxes levied under this section to the county auditor.\n(b) Notwithstanding sections 275.065, subdivision 3, and 276.04, the county may report the tax attributable to any levy to fund public safety capital improvements or equipment projects approved by the Anoka County Joint Law Enforcement Council or pay principal and interest on bonds or notes issued under this section as a separate line item on the proposed property tax notice and the property tax statement.\nThis section expires on December 31, 2033. The county may not issue a bond or note under this section with a maturity or payment date after the expiration date of this section. No property tax may be levied under this section for taxes payable in a calendar year after the calendar year in which this section expires. Expiration of this section does not affect the obligation to pay or the authority to collect taxes levied under this section before its expiration.",
	"repealed": false
}