{
	"id": "13.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.83",
	"title": "13.83 MEDICAL EXAMINER DATA.",
	"text": "As used in this section, \"medical examiner data\" means data relating to deceased individuals and the manner and circumstances of their death which is created, collected, used or maintained by a county coroner or medical examiner in the fulfillment of official duties pursuant to chapter 390, or any other general or local law on county coroners or medical examiners.\nUnless specifically classified otherwise by state statute or federal law, the following data created or collected by a medical examiner or coroner on a deceased individual are public: name of the deceased; date of birth; date of death; address; sex; race; citizenship; height; weight; hair color; eye color; build; complexion; age, if known, or approximate age; identifying marks, scars and amputations; a description of the decedent's clothing; marital status; location of death including name of hospital where applicable; name of spouse; whether or not the decedent ever served in the armed forces of the United States; occupation; business; father's name (also birth name, if different); mother's name (also birth name, if different); birthplace; birthplace of parents; cause of death; causes of cause of death; whether an autopsy was performed and if so, whether it was conclusive; date and place of injury, if applicable, including work place; how injury occurred; whether death was caused by accident, suicide, homicide, or was of undetermined cause; certification of attendance by physician, advanced practice registered nurse, or physician assistant; physician's, advanced practice registered nurse's, or physician assistant's name and address; certification by coroner or medical examiner; name and signature of coroner or medical examiner; type of disposition of body; burial place name and location, if applicable; date of burial, cremation or removal; funeral home name and address; and name of local register or funeral director.\nA county coroner or medical examiner unable during an investigation to identify a deceased individual, may release to the public any relevant data which would assist in ascertaining identity.\nData created or collected by a county coroner or medical examiner which are part of an active investigation mandated by chapter 390, or any other general or local law relating to coroners or medical examiners are confidential data or protected nonpublic data, until the completion of the coroner's or medical examiner's final summary of findings but may be disclosed to a state or federal agency charged by law with investigating the death of the deceased individual about whom the medical examiner or coroner has medical examiner data. Upon completion of the coroner's or medical examiner's final summary of findings, the data collected in the investigation and the final summary of it are private or nonpublic data. However, if the final summary and the record of death indicate the manner of death is homicide, undetermined, or pending investigation and there is an active law enforcement investigation, within the meaning of section 13.82, subdivision 7, relating to the death of the deceased individual, the data remain confidential or protected nonpublic. Upon review by the county attorney of the jurisdiction in which the law enforcement investigation is active, the data may be released to persons described in subdivision 8 if the county attorney determines release would not impede the ongoing investigation. When the law enforcement investigation becomes inactive, the data are private or nonpublic data. Nothing in this subdivision shall be construed to make not public the data elements identified in subdivision 2 at any point in the investigation or thereafter.\nAll other medical examiner data on deceased individuals are nonpublic and shall not be disclosed except:\n(1) pursuant to the provisions of chapter 390, or any other general or local law on county coroners or medical examiners;\n(2) to a state or federal agency charged by law with investigating the death of the deceased individual about whom the medical examiner or coroner has medical examiner data; or\n(3) pursuant to a valid court order.\nUnless a statute specifically provides a different classification, all other data created or collected by a county coroner or medical examiner that are not data on deceased individuals or the manner and circumstances of their death are public pursuant to section 13.03.\nAny person may petition the district court located in the county where medical examiner data is being maintained to authorize disclosure of nonpublic, protected nonpublic, or confidential medical examiner data. The petitioner shall notify the medical examiner or coroner. The court may notify other interested persons and require their presence at a hearing. A hearing may be held immediately if the parties agree, and in any event shall be held as soon as practicable. After examining the data in camera, the court may order disclosure of the data if it determines that disclosure would be in the public interest.\nThe data made nonpublic by this section are accessible to the physician who attended the decedent at the time of death, the legal representative of the decedent's estate and to the decedent's surviving spouse, parents, children, and siblings and their legal representatives.\nData classified as nonpublic, protected nonpublic, or confidential by this section shall be classified as public 30 years after the date of death of the decedent.\nData described in sections 390.11, subdivision 7, and 390.32, subdivision 6, shall be classified as described therein.",
	"repealed": false
}