{
	"id": "216C.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.17",
	"title": "216C.17 ENERGY FORECASTS AND STATISTICS; REPORT.",
	"text": "In order to further the purposes of sections 216C.05 to 216C.30, the commissioner shall develop and maintain an effective program of collection, compilation, and analysis of energy statistics. The statistical program shall be developed to insure a central state repository of energy data and so that the state may coordinate and cooperate with other governmental data collection and record-keeping programs.\nExcept as provided in subdivision 3, in addition to supplying the current statistical and short-range forecasting information the commissioner requires, each utility, coal supplier, petroleum supplier and large energy facility in the state shall prepare and transmit to the commissioner by July 1 of each year, a report specifying in five-, ten-, and 15-year forecasts the projected demand for energy within their respective service areas and the facilities necessary to meet the demand.\nThe report shall be in a form specified by the commissioner and contain all information deemed relevant by the commissioner.\nThe commissioner shall, to the maximum extent feasible, provide that forecasts required under this section be consistent with material required by other state and federal agencies in order to prevent unnecessary duplication. Electric utilities submitting advance forecasts as part of an integrated resource plan filed pursuant to section 216B.2422 and Public Utilities Commission rules are excluded from the annual reporting requirement in subdivision 2.\nReports issued pursuant to this section, other than individual corporate reports classified as nonpublic data in section 13.68, shall be available for public inspection in the office of the department during normal business hours.\nThe commissioner shall review and evaluate forecasts of energy demands and resources as they relate to the most current population growth and development estimates, statewide and regional land use, transportation, and economic development programs and forecasts.",
	"repealed": false
}