{
	"id": "60K.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.36",
	"title": "60K.36 EXAMINATIONS.",
	"text": "A resident individual applying for an insurance producer license shall pass a written examination unless exempt under subdivision 2 or section 60K.40. The examination must test the knowledge of the individual concerning the lines of authority for which the application is made, the duties and responsibilities of an insurance producer, and the insurance laws and rules of this state. Examinations required by this section must be approved by the commissioner.\nA resident individual applying for a limited lines credit insurance, title insurance, travel insurance, or bail bonds license is not required to take a written examination.\nThe commissioner may make arrangements, including contracting with an outside testing service, for administering examinations.\nThe examination must be given only after the applicant has completed a program of studies, through classroom study, verifiable self-study, or a combination of both, which must not include a course sponsored by, offered by, or affiliated with an insurance company or its producers; except that this limitation does not preclude a bona fide professional association of insurance producers, not acting on behalf of an insurer, from offering courses. The course of study must consist of 20 hours per major line of authority in which the producer seeks to be licensed. The program of studies or study course must have been approved by the commissioner in order to qualify under this subdivision. If the applicant has been previously licensed for the particular line of insurance in the state of Minnesota, the requirement of a program of studies or a study course must be waived. A certification of compliance by the organization offering the course must accompany the applicant's license application.\nA prelicensing program of studies does not apply to:\n(1) an applicant for the limited lines farm property liability line of authority or the variable life and variable annuity line of authority;\n(2) an applicant who has received a two-year Minnesota vocational school degree in insurance;\n(3) an applicant who has received a four-year college degree in business with an insurance emphasis;\n(4) an applicant for the life line of authority who holds any of the following professional designations or successor designations: Certified Employee Benefit Specialist (CEBS), Chartered Financial Consultant (ChFC), Certified Insurance Counselor (CIC), Certified Financial Planner (CFP), Chartered Life Underwriter (CLU), Fellow of the Life Management Institute (FLMI), or Life Underwriter Training Council Fellow (LUTCF);\n(5) an applicant for the health line of authority who holds any of the following professional designations or successor designations: Registered Health Underwriter (RHU), Certified Employee Benefit Specialist (CEBS), Registered Employee Benefits Counselor (REBC), or Health Insurance Associate (HIA); or\n(6) an applicant for the Property, Casualty, or Personal Lines P & C lines of authority who provides satisfactory evidence of currently holding any of the following professional designations or successor designations: Accredited Advisor in Insurance (AAI), Associate in Risk Management (ARM), Certified Insurance Counselor (CIC), or Chartered Property and Casualty Underwriter (CPCU).\nAn individual who fails to appear for the examination as scheduled or fails to pass the examination shall reapply for an examination and remit all required fees and forms before being rescheduled for another examination.\nExamination results are valid for three years from the date of the examination.",
	"repealed": false
}