{
	"id": "319B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.06",
	"title": "319B.06 FURNISHING SERVICES.",
	"text": "(a) A professional firm may provide professional services within Minnesota in one of the categories listed in section 319B.02, subdivision 19, if:\n(1) the professional firm's election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, specifies that category; and\n(2) each of the professional firm's owners meet the requirements of section 319B.07 with regard to that category.\n(b) A professional firm may provide professional services within Minnesota in more than one of the categories listed in section 319B.02, subdivision 19, if:\n(1) the professional firm's election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, specifies those categories;\n(2) each of the professional firm's owners meet the requirements of section 319B.07 with regard to at least one of those categories; and\n(3) the relevant licensing statutes, as listed in section 319B.02, subdivision 19, or rules in effect under those statutes, specifically authorize those categories of services to be practiced in combination.\n(c) A professional firm may exercise any powers accorded it by its generally applicable governing law, so long as the professional firm exercises those powers solely to provide the pertinent professional services or to accomplish tasks ancillary to providing those services.\n(d) A professional firm may not conduct any other business or provide any other services beyond those authorized in this subdivision, either within or outside of Minnesota.\n(e) A professional firm may not adopt, implement, or follow a policy, procedure, or practice that would give a board grounds for disciplinary action against a professional who follows, agrees to, or acquiesces in the policy, procedure, or practice.\n(a) A professional firm may furnish professional services within Minnesota only through professionals licensed or otherwise authorized by the state of Minnesota to furnish the pertinent professional services. Firm owners who are properly licensed professionals may provide professional services on a professional firm's behalf, and a professional firm may also hire or retain properly licensed professionals as employees, nonemployee agents, or independent contractors to furnish professional services on the professional firm's behalf.\n(b) If a professional firm is authorized under subdivision 1, paragraph (b), to furnish more than one category of professional services, a professional furnishing professional services on behalf of the professional firm is required to be licensed or authorized only with respect to the category or categories of services which the professional actually furnishes.\n(a) Sections 319B.01 to 319B.12 do not alter any law applicable to the relationship between a person furnishing professional services and a person receiving the professional services, including liability arising out of the professional services and the confidential relationship and privilege of communications between the person furnishing professional services and the person receiving the professional services.\n(b) Sections 319B.01 to 319B.12 do not alter any law applicable to the relationship between a professional firm furnishing professional services and a person receiving the professional services, including liability arising out of the professional services and the confidential relationship and privilege of communications between the professional firm furnishing professional services and the person receiving the professional services.\n(c) Whether a professional firm's owners and persons who control, manage, or act for the firm are personally liable for the firm's debts and obligations is determined according to the firm's generally applicable governing law.",
	"repealed": false
}