{
	"id": "142G.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.13",
	"title": "142G.13 ELIGIBILITY; MINOR CHILD IN ASSISTANCE UNIT; PHYSICAL PRESENCE.",
	"text": "The assistance unit must include at least one minor child or a pregnant woman. If a minor child is a recipient of Supplemental Security Income or Minnesota supplemental aid, the assistance unit is eligible for MFIP, but the needs of the minor child receiving Supplemental Security Income or Minnesota supplemental aid must not be taken into account when the county agency determines the amount of the assistance payment to be paid to the assistance unit.\nA minor child and a caregiver must live together except as provided in the following paragraphs.\n(a) The physical presence requirement is met when a minor child is required to live away from the caregiver's home to meet the need for educational curricula that cannot be met by, but is approved by, the local public school district, the home is maintained for the minor child's return during periodic school vacations, and the caregiver continues to maintain responsibility for the support and care of the minor child.\n(b) The physical presence requirement is met when an applicant caregiver or applicant minor child is away from the home due to illness or hospitalization, when the home is maintained for the return of the absent family member, the absence is not expected to last more than six months beyond the month of departure, and the conditions of clause (1), (2), or (3) apply:\n(1) when the minor child and caregiver lived together immediately prior to the absence, the caregiver continues to maintain responsibility for the support and care of the minor child, and the absence is reported at the time of application;\n(2) when the pregnant mother is hospitalized or out of the home due to the pregnancy; or\n(3) when the newborn child and mother are hospitalized at the time of birth.\n(c) The absence of a caregiver or minor child does not affect eligibility for the month of departure when the caregiver or minor child received assistance for that month and lived together immediately prior to the absence. Eligibility also exists in the following month when the absence ends on or before the tenth day of that month. A temporary absence of a caregiver or a minor child which continues beyond the month of departure must not affect eligibility when the home is maintained for the return of the absent family member, the caregiver continues to maintain responsibility for the support and care of the minor child, and one of clauses (1) to (7) applies:\n(1) a participant caregiver or participant child is absent due to illness or hospitalization, and the absence is expected to last no more than six months beyond the month of departure;\n(2) a participant child is out of the home due to placement in foster care as defined in sections 260B.007, subdivision 7, and 260C.007, subdivision 18, when the placement will not be paid under title IV-E of the Social Security Act, and when the absence is expected to last no more than six months beyond the month of departure;\n(3) a participant minor child is out of the home for a vacation, the vacation is not with an absent parent, and the absence is expected to last no more than two months beyond the month of departure;\n(4) a participant minor child is out of the home due to a visit or vacation with an absent parent, the home of the minor child remains with the caregiver, the absence meets the conditions of this paragraph and the absence is expected to last no more than two months beyond the month of departure;\n(5) a participant caregiver is out of the home due to a death or illness of a relative, incarceration, training, or employment search and suitable arrangements have been made for the care of the minor child, or a participant minor child is out of the home due to incarceration, and the absence is expected to last no more than two months beyond the month of departure;\n(6) a participant caregiver and a participant minor child are both absent from Minnesota due to a situation described in clause (5), except for incarceration, and the absence is expected to last no more than one month beyond the month of the departure; or\n(7) a participant minor child has run away from home, and another person has not made application for that minor child, assistance must continue for no more than two months following the month of departure.",
	"repealed": false
}