{
	"id": "116J.8732",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8732",
	"title": "116J.8732 SEED CAPITAL INVESTMENT CREDIT; COMMISSIONER'S RESPONSIBILITIES.",
	"text": "This section establishes rules that businesses must satisfy to qualify for the seed capital investment credit under section 290.06, subdivision 35, and the commissioner's responsibility for certifying the qualifying businesses.\n(a) For purposes of this section and section 290.06, subdivision 35, the following terms have the meanings given.\n(b) \"Border city\" means a city qualifying to designate a border city development zone under section 469.1731.\n(c) \"Pass-through entity\" means a corporation that for the applicable tax year is treated as an S corporation or a general partnership, limited partnership, limited liability partnership, trust, or limited liability company and which for the applicable taxable year is not taxed as a corporation under chapter 290.\n(d) \"Primary sector business\" means a qualified business that through the employment of knowledge or labor adds value to a product, process, or service and increases revenues to a Minnesota business generated by sales of products or services to customers outside of the state or increases revenues to a qualified business the customers of which previously were unable to acquire, or had limited availability of the product or service from a Minnesota provider.\n(e) \"Qualified business\" means a business certified by the commissioner as meeting the requirements of subdivision 3.\n(a) The commissioner shall certify whether a business that has requested to become a qualified business meets the requirements of paragraph (b).\n(b) For purposes of this section, a qualified business must be a primary sector business, other than a real estate investment trust, that:\n(1) is incorporated or its satellite operation is incorporated as a for-profit corporation or is a partnership, limited partnership, limited liability company, limited liability partnership, or joint venture;\n(2) is in compliance with the requirements for filings with the commissioner of commerce under the securities laws of this state;\n(3) has Minnesota residents as a majority of its employees in its principal office or the satellite operation, which is located in a border city;\n(4) has its principal office in a border city and has the majority of its business activity performed in a border city, except sales activity, or has a significant operation in a border city that has or is projected to have more than ten employees or $150,000 of sales annually; and\n(5) relies on innovation, research, or the development of new products and processes in its plans for growth and profitability.\n(c) The commissioner shall establish the necessary forms and procedures for certifying qualified businesses.\n(d) A qualified business may apply to the commissioner for a recertification. Only one recertification is available to a qualified business. The application for recertification must be filed with the commissioner within 90 days before the original certification expiration date. The recertification issued by the director must comply with the provisions of paragraph (e).\n(e) The commissioner shall issue a certification letter to a business the commissioner determines is a qualified business. The certification letter must include:\n(1) the certification effective date; and\n(2) the certification expiration date, which may not be more than four years from the certification effective date.\nWithin 30 days after the date that an investment in a qualified business is purchased, the qualified business shall file with the commissioner and the commissioner of revenue and provide to the investor completed forms prescribed by the commissioner of revenue that show as to each investment in the qualified business the following:\n(1) the name, address, and Social Security number of the taxpayer who made the investment; and\n(2) the dollar amount paid for the investment by the taxpayer.",
	"repealed": false
}