{
	"id": "103F.535",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.535",
	"title": "103F.535 RESERVATION OF MARGINAL LAND AND WETLANDS.",
	"text": "(a) Marginal land and wetlands are withdrawn from sale or exchange unless:\n(1) notice of the existence of the nonforested marginal land or wetlands, in a form prescribed by the Board of Water and Soil Resources, is provided to prospective purchasers; and\n(2) the deed contains a restrictive covenant, in a form prescribed by the Board of Water and Soil Resources, that precludes enrollment of the land in a state-funded program providing compensation for conservation of marginal land or wetlands.\n(b) This section does not apply to transfers of land by the Board of Water and Soil Resources to correct errors in legal descriptions under section 103F.515, subdivision 8, or to transfers by the commissioner of natural resources for:\n(1) land that is currently in nonagricultural commercial use if a restrictive covenant would interfere with the commercial use;\n(2) land in platted subdivisions;\n(3) conveyances of land to correct errors in legal descriptions under section 84.0273;\n(4) exchanges of nonagricultural land with the federal government, or exchanges of class A, class B, and riparian nonagricultural land with local units of government under sections 94.342, 94.343, and 94.344;\n(5) land transferred to political subdivisions for public purposes under sections 84.027, subdivision 10, and 94.10; and\n(6) land not needed for trail purposes that is sold to adjacent property owners and lease holders under section 85.015, subdivision 1, paragraph (b).\n(c) This section does not apply to transfers of land by the commissioner of administration or transportation or by the Minnesota Housing Finance Agency, or to transfers of tax-forfeited land under chapter 282 if:\n(1) the land is in platted subdivisions; or\n(2) the conveyance is a transfer to correct errors in legal descriptions.\n(d) This section does not apply to transfers of land by the commissioner of administration or by the Minnesota Housing Finance Agency for:\n(1) land that is currently in nonagricultural commercial use if a restrictive covenant would interfere with the commercial use; or\n(2) land transferred to political subdivisions for public purposes under sections 84.027, subdivision 10, and 94.10.\n[Repealed, 1992 c 502 s 7; 1992 c 561 s 10]\n[Repealed, 1992 c 502 s 7; 1992 c 561 s 10]\n[Repealed, 1992 c 561 s 10]\n(a) Conservation easements may be altered, released, or terminated by the board after consultation with the commissioners of agriculture and natural resources. The board may alter, release, or terminate a conservation easement only if the board determines that the public interest and general welfare are better served by the alteration, release, or termination.\n(b) The board may adopt policies and procedures to implement this subdivision, including provisions to ensure at least equal resource value as a condition of approving a request to alter, release, or terminate a conservation easement.\n(c) The landowner must compensate the board for damages and loss of benefits to the conservation easement that result from the alteration, release, or termination. The board may require the landowner to reimburse the board's administrative expenses and costs incurred in altering, releasing, or terminating a conservation easement.",
	"repealed": false
}