{
	"id": "115B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.02",
	"title": "115B.02 DEFINITIONS.",
	"text": "For the purposes of sections 115B.01 to 115B.20, the following terms have the meanings given them.\n[Repealed, 2003 c 128 art 2 s 56]\n\"Act of God\" means an unanticipated grave natural disaster or other natural phenomenon of an exceptional, inevitable, and irresistible character, the effects of which could not have been prevented or avoided by the exercise of due care or foresight.\n\"Agency\" means the commissioner of agriculture for actions, duties, or authorities relating to agricultural chemicals, or for other substances, the Pollution Control Agency.\n\"Agricultural chemical\" has the meaning given in section 18D.01, subdivision 3.\n\"Commissioner\" means the commissioner of agriculture for actions, duties, or authorities related to agricultural chemicals or the commissioner of the Pollution Control Agency for other substances.\n\"Facility\" means:\n(1) any building, structure, installation, equipment, pipe or pipeline (including any pipe into a sewer or publicly owned treatment works), well, pit, pond, lagoon, impoundment, ditch, landfill, storage container, motor vehicle, rolling stock, or aircraft;\n(2) any watercraft of any description, or other artificial contrivance used or capable of being used as a means of transportation on water; or\n(3) any site or area where a hazardous substance, or a pollutant or contaminant, has been deposited, stored, disposed of, or placed, or otherwise come to be located.\nFacility does not include any consumer product in consumer use.\n\"Federal Superfund Act\" means the Comprehensive Environmental Response, Compensation and Liability Act of 1980, United States Code, title 42, section 9601 et seq.\n[Renumbered subd 1a]\n\"Hazardous substance\" means:\n(1) any commercial chemical designated pursuant to the Federal Water Pollution Control Act, under United States Code, title 33, section 1321(b)(2)(A);\n(2) any hazardous air pollutant listed pursuant to the Clean Air Act, under United States Code, title 42, section 7412; and\n(3) any hazardous waste.\nHazardous substance does not include natural gas, natural gas liquids, liquefied natural gas, synthetic gas usable for fuel, or mixtures of such synthetic gas and natural gas, nor does it include petroleum, including crude oil or any fraction thereof which is not otherwise a hazardous waste.\n\"Hazardous waste\" means:\n(1) any hazardous waste as defined in section 116.06, subdivision 11, and any substance identified as a hazardous waste pursuant to rules adopted by the agency under section 116.07; and\n(2) any hazardous waste as defined in the Resource Conservation and Recovery Act, under United States Code, title 42, section 6903, which is listed or has the characteristics identified under United States Code, title 42, section 6921, not including any hazardous waste the regulation of which has been suspended by act of Congress.\n\"Institutional controls\" means legally enforceable restrictions, conditions, or controls on the use of real property, groundwater, or surface water located at or adjacent to a facility where response actions are taken that are reasonably required to assure that the response actions are protective of public health or welfare or the environment. Institutional controls include restrictions, conditions, or controls enforceable by contract, easement, restrictive covenant, statute, ordinance, or rule, including official controls such as zoning, building codes, and official maps. An affidavit required under section 115B.16, subdivision 2, or similar notice of a release recorded with real property records is also an institutional control.\n\"Natural resources\" has the meaning given it in section 116B.02, subdivision 4.\n\"Owner of real property\" means a person who is in possession of, has the right of control, or controls the use of real property, including without limitation a person who may be a fee owner, lessee, renter, tenant, lessor, contract for deed vendee, licensor, licensee, or occupant; provided that:\n(1) a lessor of real property under a lease which in substance is a financing device and is treated as such under the United States Internal Revenue Code, common law, or statute, is not an owner of the real property;\n(2) a public utility holding a public utility easement is an owner of the real property described in the easement only for the purpose of carrying out the specific use for which the easement was granted;\n(3) any person holding a remainder or other nonpossessory interest or estate in real property is an owner of the real property beginning when that person's interest or estate in the real property vests in possession or that person obtains the unconditioned right to possession, or to control the use of, the real property; and\n(4) the state or an agency of the state is not an owner of real property solely because it holds title to the property in trust for taxing districts as a result of forfeiture of title for nonpayment of taxes.\n\"Person\" means any individual, partnership, association, public or private corporation or other entity including the United States government, any interstate body, the state and any agency, department or political subdivision of the state.\n(a) \"Pollutant or contaminant\" means any element, substance, compound, mixture, or agent, other than a hazardous substance, which after release from a facility and upon exposure of, ingestion, inhalation, or assimilation into any organism, either directly from the environment or indirectly by ingestion through food chains, will or may reasonably be anticipated to cause death, disease, behavioral abnormalities, cancer, genetic mutation, physiological malfunctions (including malfunctions in reproduction) or physical deformations, in the organisms or their offspring.\n(b) Pollutant or contaminant does not include natural gas, natural gas liquids, liquefied natural gas, synthetic gas usable for fuel, or mixtures of such synthetic gas and natural gas.\n\"Public utility easement\" means an easement used for the purposes of transmission, distribution, or furnishing, at wholesale or retail, natural or manufactured gas, or electric or telephone service, by a public utility as defined in section 216B.02, subdivision 4, a cooperative electric association organized under the provisions of chapter 308A, a telephone company as defined in section 237.01, subdivisions 3 and 7, or a municipality producing or furnishing gas, electric, or telephone service.\n(a) \"Release\" means any spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, escaping, leaching, dumping, or disposing into the environment which occurred at a point in time or which continues to occur.\n(b) Release does not include:\n(1) emissions from the engine exhaust of a motor vehicle, rolling stock, aircraft, watercraft, or pipeline pumping station engine;\n(2) release of source, by-product, or special nuclear material from a nuclear incident, as those terms are defined in the Atomic Energy Act of 1954, under United States Code, title 42, section 2014, if the release is subject to requirements with respect to financial protection established by the federal Nuclear Regulatory Commission under United States Code, title 42, section 2210;\n(3) release of source, by-product or special nuclear material from any processing site designated pursuant to the Uranium Mill Tailings Radiation Control Act of 1978, under United States Code, title 42, section 7912(a)(1) or 7942(a); or\n(4) any release resulting from the application of fertilizer or agricultural or silvicultural chemicals, or disposal of emptied pesticide containers or residues from a pesticide as defined in section 18B.01, subdivision 18.\n(a) \"Remedy\" or \"remedial action\" means those actions consistent with permanent remedy taken instead of or in addition to removal actions in the event of a release or threatened release of a hazardous substance, or a pollutant or contaminant, into the environment, to prevent, minimize or eliminate the release in order to protect the public health or welfare or the environment.\n(b) Remedy or remedial action includes, but is not limited to:\n(1) actions at the location of the release such as storage, confinement, perimeter protection using dikes, trenches, or ditches, clay cover, neutralization, cleanup of released hazardous substances, pollutants or contaminants, or contaminated materials, recycling or reuse, diversion, destruction, segregation of reactive wastes, dredging or excavations, repair or replacement of leaking containers, collection of leachate and runoff, on-site treatment or incineration, provision of alternative water supplies, any monitoring and maintenance, and institutional controls reasonably required to assure that these actions protect the public health and welfare and the environment; and\n(2) the costs of permanent relocation of residents and businesses and community facilities when the agency determines that, alone or in combination with other measures, relocation is more cost-effective than and environmentally preferable to the transportation, storage, treatment, destruction, or secure disposition off-site of hazardous substances, or pollutants or contaminants, or may otherwise be necessary to protect the public health or welfare.\n(c) Remedy or remedial action does not include off-site transport of hazardous substances, pollutants or contaminants, or contaminated materials or their storage, treatment, destruction, or secure disposition off site unless the agency determines that these actions:\n(1) are more cost-effective than other remedial actions;\n(2) will create new capacity to manage hazardous substances in addition to those located at the affected facility, in compliance with section 116.07 and subtitle C of the Solid Waste Disposal Act, United States Code, title 42, section 6921 et seq.; or\n(3) are necessary to protect the public health or welfare or the environment from a present or potential risk which may be created by further exposure to the continued presence of the hazardous substances, pollutants or contaminants, or contaminated materials.\n(a) \"Remove\" or \"removal\" means:\n(1) the cleanup or removal of a released hazardous substance, or a pollutant or contaminant, from the environment;\n(2) necessary actions taken in the event of a threatened release of a hazardous substance, or a pollutant or contaminant, into the environment;\n(3) actions necessary to monitor, test, analyze, and evaluate a release or threatened release of a hazardous substance, or a pollutant or contaminant;\n(4) disposal or processing of removed material; or\n(5) other actions necessary to prevent, minimize, or mitigate damage to the public health or welfare or the environment, which may otherwise result from a release or threatened release.\n(b) Remove or removal includes, but is not limited to, security fencing or other measures to limit access, provision of alternative water supplies, temporary evacuation and housing of threatened individuals not otherwise provided for, action taken pursuant to the federal Superfund Act, under United States Code, title 42, section 9604(b), and any emergency assistance which may be provided under the Disaster Relief Act of 1974, United States Code, title 42, section 5121 et seq.\n\"Respond\" or \"response\" means remove, removal, remedy, and remedial action.\n\"Water\" has the meaning given to the term \"waters of the state\" in section 115.01, subdivision 22.",
	"repealed": false
}