{
	"id": "273.112",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.112",
	"title": "273.112 PRIVATE OUTDOOR RECREATIONAL, OPEN SPACE AND PARK LAND TAX.",
	"text": "This section may be cited as the \"Minnesota Open Space Property Tax Law.\"\nThe present general system of ad valorem property taxation in the state of Minnesota does not provide an equitable basis for the taxation of certain private outdoor recreational, open space and park land property and has resulted in excessive taxes on some of these lands. Therefore, it is hereby declared that the public policy of this state would be best served by equalizing tax burdens upon private outdoor, recreational, open space and park land within this state through appropriate taxing measures to encourage private development of these lands which would otherwise not occur or have to be provided by governmental authority.\nReal estate shall be entitled to valuation and tax deferment under this section only if it is:\n(a) actively and exclusively devoted to golf, skiing, lawn bowling, croquet, polo, or archery or firearms range recreational use or other recreational uses carried on at the establishment;\n(b) five acres in size or more, except in the case of a lawn bowling or croquet green or an archery or firearms range;\n(c)(1) operated by private individuals or, in the case of a lawn bowling or croquet green, by private individuals or corporations, and open to the public; or\n(2) operated by firms or corporations for the benefit of employees or guests; or\n(3) operated by private clubs having a membership of 50 or more or open to the public, provided that the club does not discriminate in membership requirements or selection on the basis of sex or marital status; and\n(d) made available for use in the case of real estate devoted to golf without discrimination on the basis of sex during the time when the facility is open to use by the public or by members, except that use for golf may be restricted on the basis of sex no more frequently than one, or part of one, weekend each calendar month for each sex and no more than two, or part of two, weekdays each week for each sex.\nIf a golf club membership allows use of golf course facilities by more than one adult per membership, the use must be equally available to all adults entitled to use of the golf course under the membership, except that use may be restricted on the basis of sex as permitted in this section. Memberships that permit play during restricted times may be allowed only if the restricted times apply to all adults using the membership. A golf club may not offer a membership or golfing privileges to a spouse of a member that provides greater or less access to the golf course than is provided to that person's spouse under the same or a separate membership in that club, except that the terms of a membership may provide that one spouse may have no right to use the golf course at any time while the other spouse may have either limited or unlimited access to the golf course.\nA golf club may have or create an individual membership category which entitles a member for a reduced rate to play during restricted hours as established by the club. The club must have on record a written request by the member for such membership.\nA golf club that has food or beverage facilities or services must allow equal access to those facilities and services for both men and women members in all membership categories at all times. Nothing in this paragraph shall be construed to require service or access to facilities to persons under the age of 21 years or require any act that would violate law or ordinance regarding sale, consumption, or regulation of alcoholic beverages.\nFor purposes of this subdivision and subdivision 7a, discrimination means a pattern or course of conduct and not linked to an isolated incident.\nThe value of any real estate described in subdivision 3 shall upon timely application by the owner, in the manner provided in subdivision 6, be determined solely with reference to its appropriate private outdoor, recreational, open space and park land classification and value notwithstanding sections 272.03, subdivision 8, and 273.11. In determining such value for ad valorem tax purposes the assessor shall not consider the value such real estate would have if it were converted to commercial, industrial, residential or seasonal residential use.\nReal estate devoted to golf and operated by a private club that does not meet the requirements of subdivision 3, and is not eligible for valuation and deferment under this section, must be valued for ad valorem tax purposes by the assessor as if it were converted to commercial, industrial, residential, or seasonal residential use and were platted and available for sale as individual parcels.\nThe assessor shall, however, make a separate determination of the market value of such real estate. The tax based upon the appropriate local tax rate applicable to such property in the taxing district shall be recorded on the property assessment records.\nApplication for deferment of taxes and assessment under this section shall be made at least 60 days prior to January 2 of each year. Such application shall be filed with the assessor of the taxing district in which the real property is located on such form as may be prescribed by the commissioner of revenue. The assessor may require proof by affidavit or other written verification that the property qualifies under subdivision 3. In the case of property operated by private clubs pursuant to subdivision 3, clause (c)(3), in order to qualify for valuation and tax deferment under this section, the taxpayer must submit to the assessor proof by affidavit or other written verification that the bylaws or rules and regulations of the club meet the eligibility requirements provided under this section. The signed affidavit or other written verification shall be sufficient demonstration of eligibility for the assessor unless the county attorney determines otherwise.\nThe county assessor shall refer any question regarding the eligibility for valuation and deferment under this section to the county attorney for advice and opinion under section 388.051, subdivision 1. Upon request of the county attorney, the taxpayer shall furnish information that the county attorney considers necessary in order to determine eligibility under this section.\nReal estate is not entitled to valuation and deferment under this section unless the county assessor has filed with the assessor's tax records prior to October 16 a statement that the application has been accepted.\nThe commissioner of revenue shall develop and issue guidelines for qualification by private golf clubs under this section covering the access to and use of the golf course by members and other adults so as to be consistent with the purposes and terms of this section.\nWhen real property which is being, or has been, valued and assessed under this section no longer qualifies under subdivision 3, the portion which no longer qualifies shall be subject to additional taxes, in the amount equal to the difference between the taxes determined in accordance with subdivision 4, and the amount determined under subdivision 5, provided, however, that the amount determined under subdivision 5 shall not be greater than it would have been had the actual bona fide sale price of the real property at an arm's-length transaction been used in lieu of the market value determined under subdivision 5. The additional taxes shall be extended against the property on the tax list for the current year, provided, however, that no interest or penalties shall be levied on the additional taxes if timely paid, and provided further, that the additional taxes shall only be levied with respect to the last seven years that the property has been valued and assessed under this section. This subdivision does not apply to real property that ceases to qualify under subdivision 3 because it is acquired by the state of Minnesota or a political subdivision, agency, or instrumentality of the state, provided that the property continues to be used for a qualifying purpose for at least five years from the date that the property was acquired.\nNotwithstanding subdivision 7, when real property ceases to qualify under subdivision 3 because of failure to comply with prohibitions against discrimination on the basis of sex, payment of additional taxes imposed under subdivision 7 is not required.\nThe tax imposed by this section shall be a lien upon the property assessed to the same extent and for the same duration as other taxes imposed upon property within this state. The tax shall be annually extended by the county auditor and shall be collected and distributed in the manner provided by law for the collection and distribution of other property taxes.\nMS 1986 [Repealed, 1987 c 268 art 6 s 53]\nWhen title to real property qualifying under subdivision 3 is transferred, no additional taxes shall be extended against the property if (a) the property continues to qualify pursuant to subdivision 3 and (b) the purchaser files an application for continued deferment of taxes pursuant to subdivision 6 within 30 days after the sale.",
	"repealed": false
}