{
	"id": "144.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.95",
	"title": "144.95 MOSQUITO RESEARCH PROGRAM.",
	"text": "The commissioner of health shall establish and maintain a long-range program of research to study:\n(1) the basic biology, distribution, population ecology, and biosystematics of Minnesota mosquitoes;\n(2) the impact of mosquitoes on human and animal health and the economy, including such areas as recreation, tourism, and livestock production;\n(3) the baseline population and environmental status of organisms other than mosquitoes that may be affected by mosquito management;\n(4) the effects of mosquito management strategies on animals and plants that may result in changes in ecology of specific areas;\n(5) the development of mosquito management strategies that are effective, practical, and environmentally safe; and\n(6) the costs and benefits of development of local and regional management and educational programs.\n(a) The commissioner of health shall establish and maintain mosquito management research and development facilities, including but not limited to field research stations in the major mosquito ecologic regions and a center for basic mosquito management research and development. The commissioner shall, to the extent possible, contract with the University of Minnesota in establishing, maintaining, and staffing the research facilities.\n(b) The commissioner of health shall establish and implement a program of contractual research grants with public and private agencies and individuals in order to:\n(1) undertake supplemental research studies on basic mosquito biology, physiology, and life cycle history beyond those described in subdivision 1;\n(2) undertake research into the effects of mosquitoes on human health, including vector-borne diseases, and on animal health, including agricultural and wildlife effects;\n(3) undertake studies of other economic factors including tourism and recreation;\n(4) collect and analyze baseline data on the ecology and distribution of organisms other than mosquitoes that may be affected as a result of mosquito management strategies;\n(5) develop new, effective, practical, and biologically compatible control methods and materials;\n(6) conduct additional monitoring of the environmental effects of mosquito control methods and materials; and\n(7) undertake demonstration, training, and education programs for development of local and regional mosquito management programs.\nThe commissioner of health may develop and conduct research trials of mosquito management methods and materials. Trials may be conducted, with the agreement of the public or private landholder, wherever and whenever the commissioner considers necessary to provide accurate data for determining the efficacy of a method or material in controlling mosquitoes.\nResearch trials of mosquito management methods and materials are subject to the following laws and rules unless a specific written exemption, license, or waiver is granted; sections 84.0895, 103G.615, 97A.045, subdivision 1, 103A.201, 103G.255, and 103G.275 to 103G.285; and Minnesota Rules, chapters 1505, 6115, 6120, 6134, and 6140.\n(a) To carry out subdivisions 1 to 4, the commissioner of health may:\n(1) accept money, property, or services from any source;\n(2) receive and hold lands;\n(3) accept gifts;\n(4) cooperate with city, state, federal, or private agencies whose research on mosquito control or on other environmental matters may be affected by the commissioner's mosquito management and research activities; and\n(5) enter into contracts with any public or private entity.\n(b) The contracts must specify the duties performed, services provided, and the amount and method of reimbursement for them. Money collected by the commissioner under contracts made under this subdivision is appropriated to the commissioner for the purposes specified in the contracts. Contractual agreements must be processed under section 16C.08.\nThe commissioner of health, officers, employees, or agents may, with express permission of the owner, enter upon any property at reasonable times to:\n(1) determine whether mosquito breeding exists;\n(2) examine, count, study, or collect laboratory samples to determine the property's geographic, geologic, and biologic characteristics; or\n(3) study and collect laboratory samples to determine the effect on animals and vegetation of an insecticide, herbicide, or other method used to control mosquitoes.\nThe commissioner of health may lease and maintain experimental plots of land for mosquito research. The commissioner of health shall determine the locations of the experimental plots and may enter into agreements with any public or private agency or individual to lease the land. The commissioners of agriculture, natural resources, transportation, and iron range resources and rehabilitation shall cooperate with the commissioner of health.\nThe commissioner may suspend or revoke a contract, agreement, or delegated authority granted in this section at any time and without prior notice if an emergency, accident, or hazard threatens the public health.\n[Repealed, 1997 c 7 art 2 s 67]\nThis section is effective only if the tax on cigarettes imposed by United States Code, title 26, section 5701, as amended, is reduced after June 1, 1985, or if other public or private funds sufficient to fund the program are made available to the commissioner for the purposes of this program.",
	"repealed": false
}