{
	"id": "340A.802",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.802",
	"title": "340A.802 NOTICE OF INJURY; DISCOVERY BEFORE ACTIONS.",
	"text": "A person who claims damages and a person or insurer who claims contribution or indemnity from a licensed retailer of alcoholic beverages or municipal liquor store for or because of an injury within the scope of section 340A.801 must give a written notice to the licensee or municipality stating:\n(1) the time and date when and person to whom the alcoholic beverages were sold or bartered;\n(2) the name and address of the person or persons who were injured or whose property was damaged; and\n(3) the approximate time and date, and the place where the injury to person or property occurred.\nA licensee or municipality who claims contribution or indemnification from another licensee or municipality must give a written notice to the other licensee or municipality in the form and manner specified in this section.\nAn error or omission in the notice does not void the notice's effect if the notice is otherwise valid unless the error or omission is of a substantially material nature.\nIn the case of a claim for damages, the notice must be served by the claimant's attorney within 240 days of the date of entering an attorney-client relationship with the person in regard to the claim. In the case of claims for contribution or indemnity, the notice must be served within 120 days after the injury occurs or within 60 days after receiving written notice of a claim for contribution or indemnity, whichever is applicable. No action for damage or for contribution or indemnity may be maintained unless the notice has been given. If requested to do so, a municipality or licensee receiving a notice shall promptly furnish claimant's attorney the names and addresses of other municipalities or licensees who sold or bartered liquor to the person identified in the notice, if known. Actual notice of sufficient facts reasonably to put the licensee or governing body of the municipality on notice of a possible claim complies with the notice requirement.\nNo action may be maintained under section 340A.801 unless commenced within two years after the injury.\nA claimant who in bad faith gives notice to a licensee who did not sell or barter liquor to the alleged intoxicated person is subject to liability for actual damages, which shall include the reasonable out-of-pocket attorney fees incurred by the licensee in the defense of the bad faith notice.",
	"repealed": false
}