{
	"id": "518E.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/518E.102",
	"title": "518E.102 DEFINITIONS.",
	"text": "(a) The definitions in this section apply to this chapter.\n(b) \"Adult\" means an individual who has attained 18 years of age or an emancipated minor.\n(c) \"Caretaking authority\" means the right to live with and care for a child on a day-to-day basis. The term includes physical custody, parenting time, right to access, and visitation.\n(d) \"Child\" means:\n(1) an unemancipated individual who has not attained 18 years of age; or\n(2) an adult son or daughter by birth or adoption, or under law of this state other than this chapter, who is the subject of a court order concerning custodial responsibility.\n(e) \"Court\" means a tribunal, including an administrative agency, authorized under law of this state other than this chapter to make, enforce, or modify a decision regarding custodial responsibility.\n(f) \"Custodial responsibility\" includes all powers and duties relating to caretaking authority and decision-making authority for a child. The term includes physical custody, legal custody, parenting time, right to access, visitation, and authority to grant limited contact with a child.\n(g) \"Decision-making authority\" means the power to make important decisions regarding a child, including decisions regarding the child's education, religious training, health care, extracurricular activities, and travel. The term does not include the power to make decisions that necessarily accompany a grant of caretaking authority.\n(h) \"Deploying parent\" means a service member, who is deployed or has been notified of impending deployment and is:\n(1) a parent of a child under law of this state other than this chapter; or\n(2) an individual who has custodial responsibility for a child under law of this state other than this chapter.\n(i) \"Deployment\" means the movement or mobilization of a service member for more than 90 days but less than 18 months pursuant to uniformed service orders that:\n(1) are designated as unaccompanied;\n(2) do not authorize dependent travel; or\n(3) otherwise do not permit the movement of family members to the location to which the service member is deployed.\n(j) \"Family member\" means a sibling, aunt, uncle, cousin, stepparent, or grandparent of a child or an individual recognized to be in a familial relationship with a child under law of this state other than this chapter.\n(k) \"Limited contact\" means the authority of a nonparent to visit a child for a limited time. The term includes authority to take the child to a place other than the residence of the child.\n(l) \"Nonparent\" means an individual other than a deploying parent or other parent.\n(m) \"Other parent\" means an individual who, in common with a deploying parent, is:\n(1) a parent of a child under law of this state other than this chapter; or\n(2) an individual who has custodial responsibility for a child under law of this state other than this chapter.\n(n) \"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(o) \"Return from deployment\" means the conclusion of service of the deploying parent:\n(1) as specified in the deploying parent's service orders;\n(2) as specified in the deploying parent's command service orders; or\n(3) as specified in a letter to the deploying parent from the deploying parent's command, on command letterhead, stating that the deploying parent has concluded service.\n(p) \"Service member\" means a member of a uniformed service.\n(q) \"Sign\" means, with present intent to authenticate or adopt a record:\n(1) to execute or adopt a tangible symbol; or\n(2) to attach to or logically associate with the record an electronic symbol, sound, or process.\n(r) \"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n(s) \"Uniformed service\" means:\n(1) active and reserve components of the Army, Navy, Air Force, Marine Corps, or Coast Guard of the United States;\n(2) the United States Merchant Marine;\n(3) the commissioned corps of the United States Public Health Service;\n(4) the commissioned corps of the National Oceanic and Atmospheric Administration of the United States; or\n(5) the National Guard of a state.",
	"repealed": false
}