{
	"id": "480.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.35",
	"title": "480.35 STATE GUARDIAN AD LITEM BOARD.",
	"text": "(a) The State Guardian Ad Litem Board is established in the judicial branch. The board is not subject to the administrative control of the judiciary. The State Guardian Ad Litem Board shall consist of seven members including:\n(1) three members appointed by the supreme court, at least one of whom must have former guardian ad litem experience, and who include two attorneys admitted to practice law in the state and one public member; and\n(2) four members appointed by the governor.\nThe appointing authorities may not appoint an active judge to be a member of the State Guardian Ad Litem Board, but may appoint a retired judge. The appointing authorities may not appoint a registered lobbyist to be a member of the State Guardian Ad Litem Board.\n(b) All candidates shall demonstrate an interest in maintaining a high quality, independent guardian ad litem program for the advocacy of the best interests of children as required in juvenile and family court. The candidates shall be well acquainted with the guardian ad litem program, as well as laws that affect a guardian ad litem's work, including the Minnesota Indian Family Preservation Act under sections 260.751 to 260.835; the federal Multiethnic Placement Act of 1994 under United States Code, title 42, section 662 and amendments; and the federal Indian Child Welfare Act under United States Code, title 25, section 1901 et seq. At least three members of the board shall be from judicial districts other than the First, Second, Fourth, and Tenth Judicial Districts. The terms, compensation, and removal of members shall be as provided in section 15.0575. The members shall elect the chair from among the membership for a term of two years.\n(a) The State Guardian Ad Litem Board shall create and administer a statewide, independent guardian ad litem program to advocate for the best interests of children, minor parents, and incompetent adults in juvenile and family court cases as defined in Rule 901.01 of the Rules of Guardian Ad Litem Procedure in Juvenile and Family Court matters.\n(b) The board shall:\n(1) approve and recommend to the legislature a budget for the board and the guardian ad litem program;\n(2) establish procedures for distribution of funding under this section to the guardian ad litem program; and\n(3) establish guardian ad litem program standards, administrative policies, procedures, and rules consistent with statute, rules of court, and laws that affect a volunteer or employee guardian ad litem's work, including the Minnesota Indian Family Preservation Act under sections 260.751 to 260.835; the federal Multiethnic Placement Act of 1994 under United States Code, title 42, section 662 and amendments; and the federal Indian Child Welfare Act under United States Code, title 25, section 1901 et seq.\n(c) The board may:\n(1) adopt standards, policies, or procedures necessary to ensure quality advocacy for the best interests of children; and\n(2) propose statutory changes to the legislature and rule changes to the supreme court that are in the best interests of children and the operation of the guardian ad litem program.\nThe State Guardian Ad Litem Board shall appoint a program administrator who serves at the pleasure of the board. The program administrator is not required to be licensed to practice law. The program administrator shall attend all meetings of the board, but may not vote, and shall:\n(1) carry out all administrative functions necessary for the efficient and effective operation of the board and the guardian ad litem program, including but not limited to hiring, supervising, and disciplining program staff and guardians ad litem;\n(2) implement, as necessary, resolutions, standards, rules, regulations, and policies of the board;\n(3) keep the board fully advised as to its financial condition, and prepare and submit to the board the annual guardian ad litem program and State Guardian Ad Litem Board budget and other financial information as requested by the board;\n(4) recommend to the board the adoption of rules and regulations necessary for the efficient operation of the board and the state guardian ad litem program; and\n(5) perform other duties prescribed by the board.\nThe board may contract with the Office of State Court Administrator for administrative support services for the fiscal years following fiscal year 2011.\nAny guardian ad litem employee who transferred to state employment on or before July 1, 2005, may retain county benefits elected under section 480.181.\nAccess to records of the state guardian ad litem program is subject to the Rules of Public Access for Records of the Judicial Branch. The State Guardian Ad Litem Board may propose amendments for supreme court consideration.\nSections 15.039 and 15.471 to 15.474 apply to the State Guardian Ad Litem Board.",
	"repealed": false
}