{
	"id": "604.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.15",
	"title": "604.15 CIVIL LIABILITY FOR RECEIVING MOTOR FUEL WITHOUT PAYING.",
	"text": "For purposes of this section:\n(1) \"motor fuel\" means a liquid, regardless of its properties, used to propel a vehicle;\n(2) \"retailer\" means a person that sells motor fuel at retail; and\n(3) \"vehicle\" means a motor vehicle or watercraft that is self-propelled and that uses motor fuel for propulsion.\n(a) The owner of a vehicle that receives motor fuel that was not paid for is liable to the retailer for the price of the motor fuel received and a service charge of $30. This charge may be imposed immediately upon the mailing of the notice under subdivision 3, if notice of the service charge was conspicuously displayed on the premises from which the motor fuel was received. The notice must include a statement that additional civil penalties will be imposed if payment is not received within 30 days. Only one service charge may be imposed under this paragraph for each incident. If a law enforcement agency obtains payment for the motor fuel on behalf of the retailer, the service charge may be retained by the law enforcement agency for its expenses.\n(b) If the price of the motor fuel received is not paid within 30 days after the retailer has mailed notice under subdivision 3, the owner is liable to the retailer for the price of the motor fuel received, the service charge as provided in paragraph (a), plus a civil penalty not to exceed $100 or the price of the motor fuel, whichever is greater. In determining the amount of the penalty, the court shall consider the amount of the fuel taken and the reason for the nonpayment. The retailer shall also be entitled to:\n(1) interest at the legal rate for judgments under section 549.09 from the date of nonpayment; and\n(2) reasonable attorney fees, but not to exceed $500.\nThe civil penalty may not be imposed until 30 days after the mailing of the notice under subdivision 3.\nNotice of nonpayment that includes a citation to this section and a description of the penalties contained in it shall be sent by the retailer to the owner by regular mail, supported by an affidavit of service by mailing, to the address indicated by records on the vehicle under section 86B.401 or 168.346. The notice must include a signed statement by the employee who reported the act describing what the employee observed and the license number of the motor vehicle. Failure of the owner to receive a notice is not a defense to liability under this section.\nAn affidavit of service by mailing must be retained by the retailer.\nIf, within the 30-day period referred to in subdivision 2, paragraph (b), the owner sends written notice to the retailer disputing the retailer's claim that the owner received motor fuel from the retailer without paying for it, the retailer may collect the price of the motor fuel and the civil penalties imposed by this section only pursuant to a judgment rendered by a court of competent jurisdiction.\nUpon receipt of the notice, the retailer shall cease all collection efforts.\nA trade association recognized by the Internal Revenue Service as an exempt organization under section 501(c)(6) of the Internal Revenue Code may, on behalf of a member retailer, give and receive notices authorized by this section and collect payments for motor fuel and the service charge specified under subdivision 2.\nCivil liability under this section does not preclude criminal liability under applicable law.",
	"repealed": false
}