{
	"id": "469.089",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.089",
	"title": "469.089 WINONA.",
	"text": "The Winona City Council may by resolution establish the Port Authority of Winona.\nSections 469.048 to 469.068 apply to the Winona Port Authority and to the city of Winona. The sections apply just as they apply to a port authority established by section 469.049, except a seaway port authority, and to the port authority's city, except as otherwise provided in this section. For the Winona Port Authority, when \"industrial\" is used in the context of industrial development district under sections 469.048 to 469.068, \"industrial\" or \"industrial development\" includes \"economic\" or \"economic development.\" Sections 469.056, subdivision 1, 469.067, and 469.053, subdivision 6, and the per meeting payment provision of section 469.050, subdivision 5, do not apply to the Winona Port Authority.\nAction taken by the Winona Port Authority under section 469.058, 469.059, subdivision 4, or 469.061, must be approved by city council resolution to take effect.\nThe city of Winona, by resolution of its city council, may provide the port authority with personnel and staff, temporarily, provisionally, or permanently on terms and conditions it considers appropriate. In the same way, the city may appropriate and budget the funds to administer the port authority as the city considers necessary and appropriate. The money must be budgeted, used, and accounted for according to the charter and ordinances of the city.\nA port authority's decision that property it seeks is marginal under section 469.058 is prima facie evidence in eminent domain proceedings that the property is marginal. The decision must be made in a resolution. The resolution must state the characteristics that the authority thinks makes the property marginal. The port authority resolution must then be approved by city council resolution.\nThe port authority has the powers granted to port authorities by sections 469.152 to 469.165. The powers may be exercised within and outside its corporate limits. The exercise of the powers is subject to approval by resolution of the city council.\nRevenue bonds issued by the port authority may be negotiated and sold at a price resulting in an average annual net interest rate on the bonds of not more than seven percent per year computed to the stated maturities.\nThe port authority must not levy special assessments or establish local improvement districts. The city of Winona, or its port authority with the approval by resolution of the city council, may exercise the powers in section 471.191 to acquire and to improve recreational land, buildings, and facilities within or outside their corporate limits.\nOn or before October 15 in each year the port authority shall report to the city council the amount of surplus funds that are in its judgment available for transfer to the sinking fund for any general obligation bonds of the authority, to reduce tax levies to pay the bonds. The council shall then decide by resolution what amount to transfer.\nThe port authority may purchase or lease real property in Wisconsin for barge fleeting or for recreation activities or for both.\nThe city of Winona may transfer, with or without consideration and on other terms the city council considers desirable, its interest in any real property, including fee title, to the port authority of Winona. The transfer must be authorized by ordinance. The ordinance must contain the following:\n(1) the general location and the specific legal description of the property;\n(2) a finding by the city council that the real property is marginal under section 469.058, supported by reference to one or more of the conditions listed in section 469.048, subdivision 5;\n(3) a statement as to the consideration, or absence of it, to be received by the city at the time of transfer; and\n(4) other information considered appropriate by the city council.\nA conveyance of fee title under this subdivision must be by quitclaim deed.\nThe port authority may conduct meetings as provided by section 13D.015.",
	"repealed": false
}