{
	"id": "169.797",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.797",
	"title": "169.797 PENALTIES FOR FAILURE TO PROVIDE VEHICLE INSURANCE.",
	"text": "Every owner of a vehicle for which security has not been provided as required by section 65B.48, shall not by the provisions of chapter 65B be relieved of tort liability arising out of the operation, ownership, maintenance, or use of the vehicle.\nAny owner of a vehicle with respect to which security is required under sections 65B.41 to 65B.71 who operates the vehicle or permits it to be operated upon a public highway, street, or road in this state and who knows or has reason to know that the vehicle does not have security complying with the terms of section 65B.48 is guilty of a crime and shall be sentenced as provided in subdivision 4.\nAny person who operates a vehicle upon a public highway, street, or road in this state who knows or has reason to know that the owner does not have security complying with the terms of section 65B.48 in full force and effect is guilty of a crime and shall be sentenced as provided in subdivision 4.\nAny owner of a vehicle who falsely claims to have a plan of reparation security in effect at the time of registration of a vehicle pursuant to section 65B.48 is guilty of a crime and shall be sentenced as provided in subdivision 4.\n(a) A person who violates this section is guilty of a misdemeanor. A person is guilty of a gross misdemeanor who violates this section within ten years of the first of two prior convictions under this section, section 169.791, or a statute or ordinance in conformity with one of those sections. The operator of a vehicle who violates subdivision 3 and who causes or contributes to causing a vehicle accident that results in the death of any person or in substantial bodily harm to any person, as defined in section 609.02, subdivision 7a, is guilty of a gross misdemeanor. The same prosecuting authority who is responsible for prosecuting misdemeanor violations of this section is responsible for prosecuting gross misdemeanor violations of this section. In addition to any sentence of imprisonment that the court may impose on a person convicted of violating this section, the court shall impose a fine of not less than $200 nor more than the maximum amount authorized by law. The court may allow community service in lieu of any fine imposed if the defendant is indigent.\n(b) A driver who is the owner of the vehicle may, no later than the date and time specified in the citation for the driver's first court appearance, produce proof of insurance stating that security had been provided for the vehicle that was being operated at the time of demand to the court administrator. The required proof of insurance may be sent by mail by the driver as long as it is received no later than the date and time specified in the citation for the driver's first court appearance. If a citation is issued, no person shall be convicted of violating this section if the court administrator receives the required proof of insurance no later than the date and time specified in the citation for the driver's first court appearance. If the charge is made other than by citation, no person shall be convicted of violating this section if the person presents the required proof of insurance at the person's first court appearance after the charge is made.\n(c) If the driver is not the owner of the vehicle, the driver shall, no later than the date and time specified in the citation for the driver's first court appearance, provide the district court administrator with proof of insurance or the name and address of the owner. Upon receipt of the name and address of the owner, the district court administrator shall communicate the information to the law enforcement agency.\n(d) If the driver is not the owner of the vehicle, the officer may send or provide a notice to the owner of the vehicle requiring the owner to produce proof of insurance for the vehicle that was being operated at the time of the demand. Notice by mail is presumed to be received five days after mailing and shall be sent to the owner's current address or the address listed on the owner's driver's license. Within ten days after receipt of the notice, the owner shall produce the required proof of insurance to the place stated in the notice received by the owner. The required proof of insurance may be sent by mail by the owner as long as it is received within ten days. Any owner who fails to produce proof of insurance within ten days of an officer's request under this subdivision is guilty of a misdemeanor. The peace officer may mail the citation to the owner's current address or address stated on the owner's driver's license. It is an affirmative defense to a charge against the owner that the driver used the owner's vehicle without consent, if insurance would not have been required in the absence of the unauthorized use by the driver. It is not a defense that a person failed to notify the Department of Public Safety of a change of name or address as required under section 171.11. The citation may be sent after the ten-day period.\n(e) The court may impose consecutive sentences for offenses arising out of a single course of conduct as permitted in section 609.035, subdivision 2.\n(f) In addition to the criminal penalty, the driver's license of an operator convicted under this section shall be revoked for not more than 12 months. If the operator is also an owner of the vehicle, the registration of the vehicle shall also be revoked for not more than 12 months. Before reinstatement of a driver's license or registration, the operator shall file with the commissioner of public safety the written certificate of an insurance carrier authorized to do business in this state stating that security has been provided by the operator as required by section 65B.48.\n(g) The commissioner shall include a notice of the penalties contained in this section on all forms for registration of vehicles required to maintain a plan of reparation security.\nThe commissioner of public safety shall revoke the registration of any vehicle and shall suspend the driver's license of any operator, without preliminary hearing upon a showing by department records, including accident reports required to be submitted by section 169.09, or other sufficient evidence that security required by section 65B.48 has not been provided and maintained. Before reinstatement of the registration, there shall be filed with the commissioner of public safety the written certificate of an insurance carrier authorized to do business in the state stating that security has been provided as required by section 65B.48. The commissioner of public safety may require the certificate of insurance provided to satisfy this subdivision to be certified by the insurance carrier to be noncancelable for a period not to exceed one year. The commissioner of public safety may also require a certificate of insurance to be filed with respect to all vehicles required to be insured under section 65B.48 and owned by any person whose driving privileges have been suspended or revoked as provided in this section before reinstating the person's driver's license.\nWhen a nonresident's operating privilege is suspended pursuant to this section, the commissioner of public safety or a designee shall transmit a copy of the record of the action to the official in charge of the issuance of licenses in the state in which the nonresident resides.\nUpon receipt of notification that the operating privilege of a resident of this state has been suspended or revoked in any other state pursuant to a law providing for its suspension or revocation for failure to deposit security for the payment of judgments arising out of a vehicle accident, or for failure to provide security covering a vehicle if required by the laws of that state, the commissioner of public safety shall suspend the operator's license of the resident until the resident furnishes evidence of compliance with the laws of this state and if applicable the laws of the other state.\nA driver's license suspension under this section is subject to the notice requirements of section 171.18, subdivision 2.",
	"repealed": false
}