{
	"id": "252.293",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.293",
	"title": "252.293 EMERGENCY RELOCATIONS.",
	"text": "In emergency situations, the commissioner of human services may order the relocation of existing intermediate care facility for persons with developmental disabilities beds, transfer residents, and establish an interim payment rate under the procedures contained in Minnesota Rules, part 9553.0075, for up to two years, as necessary to ensure the replacement of the original services for the residents. The payment rate must be based on projected costs and is subject to settle up. An emergency situation exists when it appears to the commissioner of human services that the health, safety, or welfare of residents may be in jeopardy due to imminent or actual loss of use of the physical plant or damage to the physical plant making it temporarily or permanently uninhabitable. The subsequent rate for a facility providing services for the same resident following the temporary emergency situation must be based upon the costs incurred during the interim period if the residents are permanently placed in the same facility. If the residents need to be relocated for permanent placements, the temporary emergency location must close and the procedures for establishing rates for newly constructed or newly established facilities must be followed. This provision regarding emergency situations does not apply to facilities placed in receivership by the commissioner of human services under section 245A.12 or 245A.13, or facilities that have rates set under section 252.292, subdivision 4, or to relocations of residents to existing facilities.\nThe commissioner of human services shall notify the commissioner of health of the existence of the emergency and the decision to order the relocation of residents. This notice shall also identify the temporary location or locations selected by the commissioner of human services for the relocation of the residents. Notwithstanding the provisions of section 252.291, the commissioner of health may license and certify the temporary location or locations as an intermediate care facility for persons with developmental disabilities if the location complies with the applicable state rules and federal regulations. The facility from which the residents were relocated shall not be used to house residents until the commissioner of human services authorizes the return of residents to the facility and the commissioner of health verifies that the facility complies with the applicable state and federal regulations. If the temporary location closes under the provisions of subdivision 1, the license and certification of the temporary location is voided. The voiding of the license and certification shall not be considered as a suspension, revocation, or nonrenewal of the license or as an involuntary decertification of the facility.",
	"repealed": false
}