{
	"id": "13.6435",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.6435",
	"title": "13.6435 AGRICULTURAL DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 13 are codified outside this chapter. Those sections classify agricultural data as other than public, place restrictions on access to government data, or involve data sharing.\n(a) Agriculture best management practices loan program. Data collected by the commissioner on applicants or borrowers for the agriculture best management practices loan program are governed by section 17.117.\n(b) Aquaculture data. Data on aquatic farming held by the Pollution Control Agency are classified under section 17.498.\n(c) Aquatic farm license. Data, kept by licensees, on the operation of an aquatic farm are governed by section 17.4984, subdivision 7.\n(d) Agricultural Commodities Promotion Council. Financial information on producers of agricultural commodities that is provided to the Agricultural Commodities Promotion Council is governed by section 17.62.\n(e) Agricultural producer association and commodity handlers. Access to data filed with the commissioner of agriculture by agricultural producer associations and agricultural commodity handlers is governed by section 17.694, subdivision 1.\n(a) Registration. Disclosure of data relating to pesticide registration is governed by section 18B.26, subdivision 3, paragraph (c).\n(b) Dealer and applicator records. Records of pesticide dealers and applicators inspected or copied by the commissioner of agriculture are classified under sections 18B.37, subdivision 5, and 18B.38.\nTreatment of data submitted to the commissioner of agriculture for the purpose of substantiating claims made by a product under section 18C.401 is governed by section 18C.405.\nCertain data provided to the commissioner by a licensee or applicant for a license to grow or process industrial hemp is classified under section 18K.04.\nMS 2018 [Repealed, 2020 c 89 art 1 s 21]\nAccess to information obtained by the commissioner of agriculture under the meat inspection law is governed by section 31A.27, subdivision 3.\n[Repealed, 1Sp2001 c 2 s 162]\nMS 2022 [Repealed, 2024 c 85 s 115]\n[Repealed, 2010 c 382 s 87]\nCertain data received or prepared by the Rural Finance Authority are classified pursuant to section 41B.211.\nFinancial data submitted to the commissioner by grain buyer's license applicants are classified under section 223.17, subdivision 6.\nData on debtors and creditors under the Farmer-Lender Mediation Act are classified under section 583.29.\nAudited financial statements and notes and disclosure statements submitted to the commissioner of agriculture regarding ethanol producer payments pursuant to section 41A.09 are governed by section 41A.09, subdivision 3a.\nData collected under the Minnesota agricultural water quality certification program are classified under section 17.9899.",
	"repealed": false
}