{
	"id": "144H.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/144H.08",
	"title": "144H.08 ADMINISTRATION AND MANAGEMENT.",
	"text": "(a) The owner of a PPEC center shall have full legal authority and responsibility for the operation of the center. A PPEC center must be organized according to a written table of organization, describing the lines of authority and communication to the child care level. The organizational structure must be designed to ensure an integrated continuum of services for the children served.\n(b) The owner must designate one person as a center administrator, who is responsible and accountable for overall management of the center.\nThe center administrator is responsible and accountable for overall management of the center. The administrator must:\n(1) designate in writing a person to be responsible for the center when the administrator is absent from the center for more than 24 hours;\n(2) maintain the following written records, in a place and form and using a system that allows for inspection of the records by the commissioner during normal business hours:\n(i) a daily census record, which indicates the number of children currently receiving services at the center;\n(ii) a record of all accidents or unusual incidents involving any child or staff member that caused, or had the potential to cause, injury or harm to a person at the center or to center property;\n(iii) copies of all current agreements with providers of supportive services or contracted services;\n(iv) copies of all current agreements with consultants employed by the center, documentation of each consultant's visits, and written, dated reports; and\n(v) a personnel record for each employee, which must include an application for employment, references, employment history for the preceding five years, and copies of all performance evaluations;\n(3) develop and maintain a current job description for each employee;\n(4) provide necessary qualified personnel and ancillary services to ensure the health, safety, and proper care for each child; and\n(5) develop and implement infection control policies that comply with rules adopted by the commissioner regarding infection control.",
	"repealed": false
}