{
	"id": "116J.8752",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8752",
	"title": "116J.8752 MINNESOTA FORWARD FUND.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Agreement\" or \"business subsidy agreement\" means a business subsidy agreement under section 116J.994 that must include but is not limited to the specification of the duration of the agreement, job goals and a timeline for achieving those goals over the duration of the agreement, construction and other investment goals and a timeline for achieving those goals over the duration of the agreement, and the value of benefits the firm may receive following achievement of capital investment and employment goals.\n(c) \"Business\" means an individual, corporation, partnership, limited liability company, association, or other business entity.\n(d) \"Capital investment\" means money that is expended for the purpose of building or improving real fixed property where employees are or will be employed, equipment and machinery in the building, and operating expenses related to the building.\n(e) \"Commissioner\" means the commissioner of employment and economic development.\n(f) \"Fund\" means the Minnesota forward fund account.\nThe Minnesota forward fund account is created to increase the state's competitiveness by providing the state the authority and flexibility to facilitate private investment. The fund serves as a closing fund to allow the authority and flexibility to negotiate incentives to better compete with other states for business retention, expansion and attraction of projects in existing and new industries, develop properties for business use, and leverage to meet matching requirements of federal funding for resiliency in economic security and economic enhancement opportunities that provide the public high-quality employment opportunities.\n(a) The Minnesota forward fund account is created as a separate account in the treasury. Except as otherwise appropriated in law, money in the account is appropriated to the commissioner of employment and economic development for the purposes of this section. All money earned by the account, loan repayments of principal, and interest must be credited to the account and remain available until expended.\n(b) The commissioner shall use the fund to:\n(1) create and retain permanent private-sector jobs in order to create above-average economic growth consistent with environmental protection;\n(2) stimulate or leverage private investment to ensure economic renewal and competitiveness;\n(3) increase the local tax base, based on demonstrated measurable outcomes, to guarantee a diversified industry mix;\n(4) improve the quality of existing jobs, based on increases in wages or improvements in the job duties, training, or education associated with those jobs;\n(5) improve employment and economic opportunity for residents in the region to create a reasonable standard of living, consistent with federal and state guidelines on low- to moderate-income persons;\n(6) stimulate productivity growth through improved manufacturing or new technologies; and\n(7) match or leverage private or public funding to increase investment and opportunity in the state.\n(a) The commissioner may use money in the Minnesota forward fund account to make grants and loans to businesses that are making large private capital investments in existing and new industries. The commissioner may also use money in the fund to make grants to communities and higher education institutions to support such capital investments and related activities to support the industries. Money may be used to address capital needs of businesses for machinery and equipment purchases; building construction and remodeling; land development; water and sewer lines, roads, rail lines, and natural gas and electric infrastructure; and working capital. Money in the fund may also be used for administration and monitoring of the program and to pay for the costs of carrying out the commissioner's due diligence duties under this section.\n(b) The commissioner may use money in the fund to make grants to a municipality or local unit of government for public and private infrastructure needed to support an eligible project under this section. Grant money may be used by the municipality or local unit of government to predesign, design, construct, and equip roads and rail lines; acquire and prepare land for development; and, in cooperation with municipal utilities, to predesign, design, construct, and equip natural gas pipelines, electric infrastructure, water supply systems, and wastewater collection and treatment systems. The maximum grant award per local unit of government under this section is $7,500,000 or no more than 50 percent of the total infrastructure project.\nThe commissioner of management and budget, in consultation with the commissioners of employment and economic development and commerce, may transfer money between the Minnesota forward fund account, the Minnesota climate innovation authority account, and the state competitiveness fund account. The commissioner of management and budget must notify the Legislative Advisory Commission within 15 days of making transfers under this subdivision.\nIndividual business expansion projects are limited to no more than $15,000,000 in grants or loans combined. The commissioner shall not be precluded from using other funding sources from the Department of Employment and Economic Development to facilitate a project. Total funding per business under this section shall not exceed $15,000,000, of which no more than $10,000,000 may be grants. Grants under this subdivision are available until expended.\n(a) Eligible applicants for the state-funded portion of the fund also include development authorities as defined in section 116J.552, subdivision 4, provided that the governing body of the municipality approves, by resolution, the application of the development authority. Institutions of higher education also constitute eligible applicants for the purpose of developing and deploying workforce training programs and for developing and deploying research and development partnerships for projects eligible under this section.\n(b) The business, municipality, or local unit of government must request and submit an application to the commissioner. Applications must be in the form and procedure specified by the commissioner.\n(c) The commissioner must conduct due diligence, including contracting with professionals as needed to assist in the due diligence.\n(d) Notwithstanding any other law to the contrary, grant and loan agreements through the Minnesota forward fund account may exceed five years but not more than ten years.\nDisbursements of loan funds pursuant to a commitment may not be made until:\n(1) commitments for the remainder of a project's funding are made that are satisfactory to the commissioner and disbursements made from the other commitments are sufficient to protect the interests of the state in its grant or loan;\n(2) performance requirements are met, if any;\n(3) the municipality or local unit of government in which the project will be located has passed a resolution of support for the project and submitted this resolution of support to the department; and\n(4) all of a project's funding is satisfactory to the commissioner and disbursements made from other commitments are sufficient to protect the interests of the state.\nThe municipality, local unit of government, or business must report to the commissioner on the business performance using the forms developed by the commissioner.\nThe commissioner shall provide the Legislative Advisory Commission and the ranking members of the committees with jurisdiction over economic development with an annual report on all projects that have been approved by February 15 of each year until this section is repealed or the funding has been exhausted.",
	"repealed": false
}