{
	"id": "181A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.04",
	"title": "181A.04 MINIMUM AGE AND MAXIMUM HOURS.",
	"text": "No minors under the age of 14 shall be permitted employment in this state except as authorized by section 181A.07.\nOn school days, during school hours, no minor under the age of 16 years shall be permitted employment except as provided in section 181A.05.\nNo minor under the age of 16 shall be permitted to work any day before 7:00 a.m. or after 9:00 p.m.\nNo employer shall be permitted to work a minor under the age of 16 more than 40 hours a week or more than eight hours in any 24-hour period.\nNo minor under the age of 18 shall be permitted to work in any occupation which the commissioner shall find to be particularly hazardous for the employment of children under 18 years of age or detrimental to their well-being. A list of such occupations shall be established and promulgated by rule pursuant to section 181A.09. Notwithstanding any law or rule to the contrary, this subdivision does not apply to minors employed in retail stores that are nonseasonal and are of a nontransient nature and which sell or offer for sale explosives or pyrotechnics.\nA high school student must not be permitted to work after 11:00 p.m. on an evening before a school day or before 5:00 a.m. on a school day, except:\n(1) as permitted by section 181A.07, subdivisions 1, 2, 3, and 4;\n(2) this subdivision does not apply to a high school student age 18 or older, unless the student provides a written request for the hours restrictions to the employer at least two weeks before any restricted hours begin; or\n(3) if a high school student under the age of 18 has supplied the employer with a note signed by the parent or guardian of the student, the student may be permitted to work until 11:30 p.m. on the evening before a school day and beginning at 4:30 a.m. on a school day.\nFor the purpose of this subdivision, a high school student does not include a student enrolled in an alternative education program approved by the commissioner of education or an area learning center, including area learning centers under sections 123A.05 to 123A.08.\n(a) Minors 16 or 17 years of age may be employed in the operation of amusement rides or loading and unloading of passengers from amusement rides if all of the requirements of this subdivision are met. For the purposes of this subdivision, \"operation of an amusement ride\" does not include maintenance, testing, repair, erection, or dismantling of an amusement ride.\n(b) The following requirements must be met in order for an employer to employ a minor under this exception:\n(1) employers shall comply with:\n(i) all other applicable child labor standards in chapter 181A and Minnesota Rules, chapter 5200; and\n(ii) all requirements of chapter 184B;\n(2) the amusement ride or rides to be operated by minors 16 or 17 years of age must be located in a fixed site amusement park;\n(3) the minor shall not operate or load and unload passengers on more than one amusement ride at a time;\n(4) at any time during which a minor is operating an amusement ride or loading and unloading passengers on an amusement ride, the employer shall ensure that a supervisor is present on the employer's premises and is supervising the minor in accordance with the employer's written supervision policy. Supervision required by the policy shall address, at a minimum, the type and design of the ride, the location of the ride in the employer's facility, the location of assigned ride operators on the ride, and the distance between rides in the facility. Notwithstanding the specific job title assigned by the employer, for purposes of this subdivision, \"supervisor\" is defined as any employee, at least 18 years of age, trained in the operation of the ride being operated by a minor, and who has been assigned by the employer the responsibility of supervising a ride operator's operation of the amusement ride or loading and unloading of passengers on the amusement ride; and\n(5) the incident report log and reporting required by section 184B.045 shall apply to minors allowed to be employed under this subdivision for injuries or illnesses, other than minor injuries and illnesses, resulting from their operation or loading and unloading passengers on an amusement ride.",
	"repealed": false
}