{
	"id": "18B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.01",
	"title": "18B.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Agricultural pesticide\" means a pesticide that bears labeling that meets federal worker protection agricultural use requirements established in Code of Federal Regulations, title 40, parts 156 and 170.\n\"Agricultural pesticide dealer\" means a person who distributes an agricultural pesticide in the state or into the state to an end user. This action would commonly be described as a retail sale.\n\"Apiary\" means a place where a collection of one or more hives or colonies of bees or the nuclei of bees are kept.\n\"Application or use of a pesticide\" includes:\n(1) the dispersal of a pesticide on, in, at, or directed toward a target site;\n(2) preapplication activities that involve the mixing and loading of a restricted use pesticide; and\n(3) other restricted use pesticide-related activities, including but not limited to transporting or storing pesticide containers that have been opened; cleaning equipment; and disposing of excess pesticides, spray mix, equipment wash waters, pesticide containers, and other materials that contain pesticide.\n\"Approved agency\" means a state agency, other than the Department of Agriculture, or an agency of a county, municipality, or other political subdivision that has signed a joint powers agreement under section 471.59 with the commissioner.\n\"Bee\" means any stage of the common honeybee, Apis mellifera (L).\n\"Bee owner\" means a person who owns a bee colony or colonies.\n\"Bee kill incident\" means an acute pesticide poisoning of a bee colony or colonies located within one-half mile of each other at a single time point.\n\"Beneficial insects\" means insects that are: (1) effective pollinators of plants; (2) parasites or predators of pests; or (3) otherwise beneficial.\n\"Bulk pesticide\" means a pesticide that is held in an individual container, with a pesticide content of 56 United States gallons or more, or 100 pounds or greater net dry weight.\nMS 2012 [Renumbered subd 4b]\n\"Bulk pesticide storage facility\" means a facility that is required to have a permit under section 18B.14.\n\"Collection site\" means a permanent or temporary designated location with scheduled hours for authorized collection where pesticide end users may bring their waste pesticides.\n\"Colony\" means the aggregate of worker bees, drones, the queen, and developing young bees living together as a family unit in a hive or other dwelling.\n\"Cleaning product\" means a pesticide used primarily for domestic, commercial, or institutional cleaning purposes, including but not limited to an air care product, an automotive maintenance product, a general cleaning product, or a polish or floor maintenance product.\n\"Commercial applicator\" means a person who has or is required to have a commercial applicator license.\n\"Commissioner\" means the commissioner of agriculture or an agent authorized by the commissioner.\n\"Container\" means a portable device in which a material is stored, transported, treated, disposed of, or otherwise handled.\n\"Corrective action\" means an action taken to minimize, eliminate, or clean up an incident.\n\"Currently unavoidable use\" means a use of PFAS that is essential for the health, safety, or functioning of society and for which alternatives are not reasonably available. Currently unavoidable use may include consideration of the need to prevent or minimize potential pest resistance and the potential human health and environmental impacts of alternative products.\n\"Device\" means an instrument or contrivance, other than a firearm, that is intended or used to destroy, repel, or mitigate a pest, a form of plant or animal life other than humans, or a bacterium, virus, or other microorganism on or in living animals, including humans. A device does not include equipment used for the application of pesticides if the equipment is sold separately from the instrument or contrivance.\n\"Distribute\" means offer for sale, sell, barter, ship, deliver for shipment, receive and deliver, and offer to deliver pesticides in this state or into this state.\n\"Environment\" means surface water, groundwater, air, land, plants, humans, and animals and their interrelationships.\n[Renumbered subd 9d]\n\"Experimental use permit\" means a permit issued by the United States Environmental Protection Agency as authorized in Section 5 of the Federal Insecticide, Fungicide, and Rodenticide Act.\n\"Experimental use pesticide product\" means any federally registered or unregistered pesticide whose use is authorized by an experimental use permit issued by the United States Environmental Protection Agency.\n\"Fixed location\" means all stationary restricted and bulk pesticide facility operations owned or operated by a person located in the same plant location or locality.\n\"FIFRA\" means the Federal Insecticide, Fungicide, Rodenticide Act, United States Code, title 7, sections 136 to 136y, and regulations under Code of Federal Regulations, title 40, subchapter E, parts 150 to 180.\n[Repealed, 2017 c 88 art 2 s 93]\n[Repealed, 2017 c 88 art 2 s 93]\n\"Hazardous waste\" means any substance identified or listed as hazardous waste in the rules adopted under section 116.07, subdivision 4.\n\"Hive\" means a frame hive, box hive, box, barrel, log gum, skep, or any other receptacle or container, natural or artificial, or any part of one, which is used as a domicile for bees.\n\"Incident\" means a flood, fire, tornado, transportation accident, storage container rupture, leak, spill, emission discharge, escape, disposal, or other event that releases or immediately threatens to release a pesticide accidentally or otherwise into the environment, and may cause unreasonable adverse effects on the environment. \"Incident\" does not include a release from normal use of a pesticide or practice in accordance with law.\n\"Intentionally added\" means PFAS deliberately added during the manufacture of a product where the continued presence of PFAS is desired in the final product or one of the product's components to perform a specific function.\n\"Label\" means the written, printed, or graphic matter on, or attached to, the pesticide or device or their containers or wrappers.\n\"Labeling\" means all labels and other written, printed, or graphic matter:\n(1) accompanying the pesticide or device;\n(2) referred to by the label or literature accompanying the pesticide or device; or\n(3) that relates or refers to the pesticide or to induce the sale of the pesticide or device.\n\"Labeling\" does not include current official publications of the United States Environmental Protection Agency, United States Department of Agriculture, United States Department of Interior, United States Department of Health, Education and Welfare, state agricultural experiment stations, state agricultural colleges, and other similar federal or state institutions or agencies authorized by law to conduct research in the field of pesticides.\n\"Local unit of government\" means a statutory or home rule charter city, town, county, soil and water conservation district, watershed district, another special purpose district, and local or regional board.\n\"Nonagricultural pesticide\" means a pesticide that does not bear labeling that meets federal worker protection agricultural use requirements established in Code of Federal Regulations, title 40, parts 156 and 170.\n\"Minimum risk pesticide\" means a pesticide or class of pesticides that is exempt from the United States Environmental Protection Agency's registration requirements under section 25(b) of the federal Insecticide, Fungicide, and Rodenticide Act in Code of Federal Regulations, title 40, section 152.25(f).\n\"Noncommercial applicator\" means a person who has or is required to have a noncommercial applicator license.\n\"Organism\" means an animal, plant, bacterium, cyanobacterium, fungus, protist, or virus.\n\"Owner of real property\" means a person who is in possession of, has the right of control, or controls the use of real property, including a person who has legal title to property and a person who has the right to use or contract use of the property under a lease, contract for deed, or license.\n\"Perfluoroalkyl and polyfluoroalkyl substances\" or \"PFAS\" means a class of fluorinated organic chemicals containing at least one fully fluorinated carbon atom.\n[Repealed, 1996 c 310 s 1]\n\"Pest\" means an insect, rodent, nematode, fungus, weed, terrestrial or aquatic plant, animal life, virus, bacteria, or other organism designated by rule as a pest, except a virus, bacteria, or other microorganism on or in living humans or other living animals.\n\"Pesticide\" means a substance or mixture of substances intended to prevent, destroy, repel, or mitigate a pest, and a substance or mixture of substances intended for use as a plant regulator, defoliant, or desiccant.\n\"Pesticide dealer\" means a person who has or is required to have a pesticide dealer license.\n\"Pesticide end user\" means a farmer or other person who uses, intends to use, or owns a pesticide. Pesticide end user does not include a dealer, manufacturer, formulator, or packager.\n\"Plant regulator\" means a substance or mixture of substances intended through physiological action to accelerate or retard the rate of growth or rate of maturation of a plant, or to otherwise alter the behavior of ornamental or crop plants or the produce of the plants. Plant regulator does not include substances to the extent that they are intended as plant nutrients, trace elements, nutritional chemicals, plant inoculants, or soil amendments.\n\"Pollinator\" means an insect that pollinates flowers.\n\"Private applicator\" means a person certified or required to be certified to use restricted use pesticides.\n\"Registrant\" means a person that has registered a pesticide under this chapter.\n[Repealed, 2017 c 88 art 2 s 93]\n\"Responsible party\" means a person who at the time of an incident has custody of, control of, or responsibility for a pesticide, pesticide container, or pesticide rinsate.\n\"Restricted use pesticide\" means a pesticide formulation designated as a restricted use pesticide under FIFRA or by the commissioner under this chapter.\n\"Returnable container\" means a container for distributing pesticides that enables the unused pesticide product to be returned to the distributor, manufacturer, or packager, and includes bulk, mini-bulk, or dedicated containers designed to protect the integrity of the pesticide and prevent contamination through the introduction of unauthorized materials.\n\"Rinsate\" means a dilute mixture of a pesticide or pesticides with water, solvents, oils, commercial rinsing agents, or other substances, that is produced by or results from the cleaning of pesticide application equipment or pesticide containers.\n\"Safeguard\" means a facility, equipment, device, or system, or a combination of these, designed to prevent an incident as required by rule.\n\"School pest management coordinator\" means a person employed by a Minnesota kindergarten through 12th grade public school who is responsible for the school's pest management plans and implementation of pest management at the school, including the application of pesticides to the inside or outdoor property of the school.\n\"Site\" means all land and water areas, including air space, and all plants, animals, structures, buildings, contrivances, and machinery whether fixed or mobile, including anything used for transportation.\n\"Structural pest\" means an invertebrate pest or commensal rodent in, on, under, or near a structure such as a residential or commercial building.\n\"Structural pest control\" means the control of any structural pest through the application of pesticides or through other means in or around a building or other structures, including trucks, boxcars, ships, aircraft, docks, and fumigation vaults.\n\"Structural pest control applicator\" means a person who has or is required to have a structural pest control applicator license.\n\"Substantially altering,\" \"substantially alter,\" or \"substantial alteration\" means modifying a bulk agricultural chemical storage facility by:\n(1) changing the capacity of a safeguard;\n(2) adding storage containers in excess of the capacity of a safeguard as required by rule; or\n(3) increasing the size of the single largest storage container in a safeguard as approved or permitted by the Department of Agriculture. This does not include routine maintenance of safeguards, storage containers, appurtenances, piping, mixing, blending, weighing, or handling equipment.\n\"Unreasonable adverse effects on the environment\" means any unreasonable risk to humans or the environment, taking into account the economic, social, and environmental costs and benefits of the use of any pesticide or seed treated with pesticide.\n\"Waste pesticide\" means a pesticide that the pesticide end user considers a waste. A waste pesticide can be a canceled pesticide, an unusable pesticide, or a usable pesticide.\n\"Wildlife\" means all living things that are not human, domesticated, or pests.",
	"repealed": false
}