{
	"id": "624.712",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.712",
	"title": "624.712 DEFINITIONS.",
	"text": "As used in sections 624.711 to 624.717, the terms defined in this section shall have the meanings given them.\n\"Pistol\" includes a weapon designed to be fired by the use of a single hand and with an overall length less than 26 inches, or having a barrel or barrels of a length less than 18 inches in the case of a shotgun or having a barrel of a length less than 16 inches in the case of a rifle (1) from which may be fired or ejected one or more solid projectiles by means of a cartridge or shell or by the action of an explosive or the igniting of flammable or explosive substances; or (2) for which the propelling force is a spring, elastic band, carbon dioxide, air or other gas, or vapor.\n\"Pistol\" does not include a device firing or ejecting a shot measuring .18 of an inch, or less, in diameter and commonly known as a \"BB gun,\" a scuba gun, a stud gun or nail gun used in the construction industry or children's pop guns or toys.\n\"Antique firearm\" means any firearm, including any pistol, with a matchlock, flintlock, percussion cap, or similar type of ignition system, manufactured before 1899 and any replica of any firearm described herein if such replica is not designed or redesigned, made or remade, or intended to fire conventional rimfire or conventional centerfire ammunition, or uses conventional rimfire or conventional centerfire ammunition which is not readily available in the ordinary channels of commercial trade.\n\"Saturday night special pistol\" means a pistol other than an antique firearm or a pistol for which the propelling force is carbon dioxide, air or other vapor, or children's pop guns or toys, having a frame, barrel, cylinder, slide or breechblock:\n(1) of any material having a melting point (liquidus) of less than 1,000 degrees Fahrenheit, or\n(2) of any material having an ultimate tensile strength of less than 55,000 pounds per square inch, or\n(3) of any powdered metal having a density of less than 7.5 grams per cubic centimeter.\n\"Crime of violence\" means: felony convictions of the following offenses: sections 609.185 (murder in the first degree); 609.19 (murder in the second degree); 609.195 (murder in the third degree); 609.20 (manslaughter in the first degree); 609.205 (manslaughter in the second degree); 609.215 (aiding suicide and aiding attempted suicide); 609.221 (assault in the first degree); 609.222 (assault in the second degree); 609.223 (assault in the third degree); 609.2231 (assault in the fourth degree); 609.224 (assault in the fifth degree); 609.2242 (domestic assault); 609.2247 (domestic assault by strangulation); 609.229 (crimes committed for the benefit of a gang); 609.235 (use of drugs to injure or facilitate crime); 609.24 (simple robbery); 609.245 (aggravated robbery); 609.247 (carjacking); 609.25 (kidnapping); 609.255 (false imprisonment); 609.322 (solicitation, inducement, and promotion of prostitution; sex trafficking); 609.342 (criminal sexual conduct in the first degree); 609.343 (criminal sexual conduct in the second degree); 609.344 (criminal sexual conduct in the third degree); 609.345 (criminal sexual conduct in the fourth degree); 609.377 (malicious punishment of a child); 609.378 (neglect or endangerment of a child); 609.486 (commission of crime while wearing or possessing a bullet-resistant vest); 609.52 (involving theft of a firearm and theft involving the theft of a controlled substance, an explosive, or an incendiary device); 609.561 (arson in the first degree); 609.562 (arson in the second degree); 609.582, subdivision 1 or 2 (burglary in the first and second degrees); 609.66, subdivision 1e (drive-by shooting); 609.67 (unlawfully owning, possessing, operating a machine gun or short-barreled shotgun); 609.71 (riot); 609.713 (terroristic threats); 609.749 (harassment); 609.855, subdivision 5 (shooting at a public transit vehicle or facility); and chapter 152 (drugs, controlled substances); and an attempt to commit any of these offenses.\n\"Transfer\" means a sale, gift, loan, assignment or other delivery to another, whether or not for consideration, of a pistol or semiautomatic military-style assault weapon or the frame or receiver of a pistol or semiautomatic military-style assault weapon.\n\"Semiautomatic military-style assault weapon\" means:\n(1) any of the following firearms:\n(i) Avtomat Kalashnikov (AK-47) semiautomatic rifle type;\n(ii) Beretta AR-70 and BM-59 semiautomatic rifle types;\n(iii) Colt AR-15 semiautomatic rifle type;\n(iv) Daewoo Max-1 and Max-2 semiautomatic rifle types;\n(v) Famas MAS semiautomatic rifle type;\n(vi) Fabrique Nationale FN-LAR and FN-FNC semiautomatic rifle types;\n(vii) Galil semiautomatic rifle type;\n(viii) Heckler & Koch HK-91, HK-93, and HK-94 semiautomatic rifle types;\n(ix) Ingram MAC-10 and MAC-11 semiautomatic pistol and carbine types;\n(x) Intratec TEC-9 semiautomatic pistol type;\n(xi) Sigarms SIG 550SP and SIG 551SP semiautomatic rifle types;\n(xii) SKS with detachable magazine semiautomatic rifle type;\n(xiii) Steyr AUG semiautomatic rifle type;\n(xiv) Street Sweeper and Striker-12 revolving-cylinder shotgun types;\n(xv) USAS-12 semiautomatic shotgun type;\n(xvi) Uzi semiautomatic pistol and carbine types; or\n(xvii) Valmet M76 and M78 semiautomatic rifle types;\n(2) any firearm that is another model made by the same manufacturer as one of the firearms listed in clause (1), and has the same action design as one of the listed firearms, and is a redesigned, renamed, or renumbered version of one of the firearms listed in clause (1), or has a slight modification or enhancement, including but not limited to a folding or retractable stock; adjustable sight; case deflector for left-handed shooters; shorter barrel; wooden, plastic, or metal stock; larger clip size; different caliber; or a bayonet mount; and\n(3) any firearm that has been manufactured or sold by another company under a licensing agreement with a manufacturer of one of the firearms listed in clause (1) entered into after the effective date of Laws 1993, chapter 326, to manufacture or sell firearms that are identical or nearly identical to those listed in clause (1), or described in clause (2), regardless of the company of production or country of origin.\nThe weapons listed in clause (1), except those listed in items (iii), (ix), (x), (xiv), and (xv), are the weapons the importation of which was barred by the Bureau of Alcohol, Tobacco, and Firearms of the United States Department of the Treasury in July 1989.\nExcept as otherwise specifically provided in paragraph (d), a firearm is not a \"semiautomatic military-style assault weapon\" if it is generally recognized as particularly suitable for or readily adaptable to sporting purposes under United States Code, title 18, section 925, paragraph (d)(3), or any regulations adopted pursuant to that law.\nBy August 1, 1993, and annually thereafter, the superintendent of the Bureau of Criminal Apprehension shall publish a current authoritative list of the firearms included within the definition of \"semiautomatic military-style assault weapon\" under this section. Dealers, purchasers, and other persons may rely on the list in complying with this chapter.\n\"Business day\" means a day on which state offices are open for normal business and excludes weekends and legal holidays.\n\"Crime punishable by imprisonment for a term exceeding one year\" does not include:\n(1) any federal or state offense pertaining to antitrust violations, unfair trade practices, restraints of trade, or other similar offenses relating to the regulation of business practices; or\n(2) any state offense classified by the laws of this state or any other state as a misdemeanor and punishable by a term of imprisonment of two years or less.\nWhat constitutes a conviction of a crime shall be determined in accordance with the law of the jurisdiction in which the proceedings were held. Any conviction which has been expunged, or set aside, or for which a person has been pardoned or has had civil rights restored shall not be considered a conviction for purposes of this definition, unless such pardon, expungement, or restoration of civil rights expressly provides that the person may not ship, transport, possess, or receive firearms.\n\"Commissioner\" means the commissioner of public safety unless otherwise indicated.\n\"Ammunition\" has the meaning given in section 609.02, subdivision 17.\n\"Adult-use cannabis flower\" has the meaning given in section 342.01, subdivision 3.\n\"Adult-use cannabis product\" has the meaning given in section 342.01, subdivision 4.\n\"Medical cannabis flower\" has the meaning given in section 342.01, subdivision 54.\n\"Medical cannabinoid product\" has the meaning given in section 342.01, subdivision 52.\n\"Patient\" has the meaning given in section 342.01, subdivision 59.\n\"Qualifying medical condition\" has the meaning given in section 342.01, subdivision 63.\n\"Registry\" or \"registry program\" has the meaning given in section 342.01, subdivision 65.\n\"Hemp-derived consumer product\" has the meaning given in section 342.01, subdivision 37.\n\"Lower-potency hemp edible\" has the meaning given in section 342.01, subdivision 50.",
	"repealed": false
}