{
	"id": "115B.414",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.414",
	"title": "115B.414 THIRD-PARTY CLAIMS; MEDIATION; DEFENSE.",
	"text": "For the purposes of this section, \"third-party claims\" means claims made against mixed municipal solid waste generators by a responsible person or group of responsible persons under state or federal law for payment of response costs and related costs at a qualified facility, when the claimant or claimants do not produce evidence, other than statistical or circumstantial evidence, that the persons against whom the claims are made ever arranged for disposal or transported for disposal mixed municipal solid waste containing a hazardous substance or pollutant or contaminant to the facility.\nA third-party claim or group of third-party claims that all arise from the same facility may be submitted to the Minnesota Office of Dispute Resolution for mediation under the Minnesota Civil Mediation Act, sections 572.31 to 572.40. The costs of mediation must be allocated equally between the person or persons against whom the claims are made and the person or persons making the claims.\nA person or persons against whom one or more third-party claims are made may seek reimbursement from the commissioner of one-half of the costs of mediation allocated to the person or persons under subdivision 2. The commissioner shall reimburse the person or persons that request reimbursement unless the commissioner finds that the mediation was not entered into and conducted in good faith by the person or persons seeking reimbursement.\nIf a person or persons against whom one or more third-party claims are made request the person or persons making the claims to submit the claims to mediation and the claimants refuse to submit to mediation or if the person or persons against whom third-party claims are made enter into and conduct the mediation in good faith but the mediation fails to resolve the claims, the person or persons, in cooperation with other persons against whom third-party claims have been made that arise from the same facility, may retain legal counsel to defend them against the claims and may seek partial reimbursement from the commissioner for reasonable attorney fees. The commissioner shall provide partial reimbursement for reasonable attorney fees under this subdivision of $75 per hour for a maximum number of hours to be established by the commissioner by rule. The maximum number of hours for reimbursement must increase as the number of persons who collectively retain legal counsel to defend against related claims increases but need not increase proportionately to the increase in the number of persons seeking collective defense. Under no circumstances may a person or group of persons receive reimbursement of more than 75 percent of their reasonable attorney fees under this subdivision.",
	"repealed": false
}