{
	"id": "524.5-107",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-107",
	"title": "524.5-107 TRANSFER OF JURISDICTION.",
	"text": "(a) Following the appointment of a guardian or conservator or entry of another protective order, the court making the appointment or entering the order may transfer the proceeding to a court or another county in this state or in the case of a minor to another state if the court is satisfied that a transfer will serve the best interest of the person subject to guardianship or conservatorship.\n(b) A guardian of a minor, conservator of a minor, or like fiduciary for a minor appointed in another state may petition the court for appointment as a guardian or conservator in this state if the state has jurisdiction. The appointment may be made upon proof of appointment in the other state and presentation of a certified copy of the portion of the court record in the other state specified by the court in this state. Notice of hearing on the petition, together with a copy of the petition, must be given to the person subject to guardianship or conservatorship, if the person subject to guardianship or conservatorship has attained 14 years of age, and to the persons who would be entitled to notice if the regular procedures for appointment of a guardian or conservator under this article were applicable. The court shall make the appointment in this state unless it concludes that the appointment would not be in the best interest of the person subject to guardianship or conservatorship. Upon the filing of an acceptance of office and any required bond, the court shall issue appropriate letters of guardianship or conservatorship. Within 14 days after an appointment, the guardian or conservator shall send or deliver a copy of the order of appointment to the person subject to guardianship or conservatorship, if the person subject to guardianship or conservatorship has attained 14 years of age, and to all persons given notice of the hearing on the petition.",
	"repealed": false
}