{
	"id": "44.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/44.04",
	"title": "44.04 PERSONNEL BOARD.",
	"text": "Within 30 days after the effective date of the merit system ordinance in any municipality, a personnel board shall be appointed. Except as provided in subdivisions 2 and 3, the board shall consist of three members and be appointed by the mayor with the consent of the council. Each member shall serve for a term of three years, except that of the members first appointed, one shall be appointed for a term of one year, one for a term of two years, and one for a term of three years; and each shall serve until a successor is appointed and qualified. A member may be removed by the mayor with the consent of the council for cause after written notice and an opportunity to be heard. No member shall hold any other municipal position. Before entering upon the duties of office, each member shall subscribe and file with the city clerk or recorder an oath for the faithful discharge of the duties. A chair shall be elected under such rules as the board may adopt.\nWhen a merit system ordinance is adopted in any municipality having a police or firefighter's civil service commission, the existing commission shall become the personnel board and its members shall serve for the duration of terms for which they were originally appointed. Successors shall be appointed for three-year terms as provided in subdivision 1.\nWhen a merit system ordinance is adopted in any municipality having both police and fire civil service commissions, all the members of such commission shall become the members of the board established under sections 44.01 to 44.16 and shall continue to serve as members of the new board for the remainder of the terms for which they were originally appointed. No successor shall be appointed for the members whose terms are the first, third, and fifth of the six to end, but at the end of every other term, one member shall be appointed for a three-year term, thus reducing the board membership to five by the end of the first year, four by the end of the second year, and three by the end of the third year.\nThe board shall hold regular and special meetings as provided by its rules. All meetings and hearings shall be open to the public. Two members of the board shall constitute a quorum. Members shall be paid all necessary expenses. The board shall select a secretary to serve at the pleasure of the board. The secretary may be a member of the board or an employee of the municipality. The council may authorize the payment of compensation for the secretary's services and for the members of the board in an amount to be determined by the council.",
	"repealed": false
}