{
	"id": "53C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.02",
	"title": "53C.02 SALES FINANCE COMPANY; LICENSE, FEES, REFUND.",
	"text": "(a) No person shall engage in the business of a sales finance company in this state without a license therefor as provided in sections 53C.01 to 53C.14 provided, however, that no bank, trust company, savings bank, savings association, or credit union, whether state or federally chartered, industrial loan and thrift company, or licensee under the Minnesota Regulated Loan Act authorized to do business in this state shall be required to obtain a license under sections 53C.01 to 53C.14.\n(b) The application for a license shall be in writing, under oath and in the form prescribed by the commissioner. The application shall contain the name of the applicant; date of incorporation, if incorporated; the address where the business is or is to be conducted and similar information as to any branch office of the applicant; the name and resident address of the owner or partners, or, if a corporation or association, of the directors, trustees and principal officers, and other pertinent information the commissioner requires.\n(c) The licensee fee for the fiscal year beginning July 1 and ending June 30 of the following year, or any part thereof shall be the sum of $250 for the principal place of business of the licensee, and the sum of $125 for each branch of the licensee. Any licensee who proves to the satisfaction of the commissioner, by affidavit or other proof satisfactory to the commissioner, that during the 12 calendar months of the immediately preceding fiscal year, for which the license has been paid that the licensee has not held retail installment contracts exceeding $15,000 in amount, shall be entitled to a refund of that portion of each license fee paid in excess of $25. The commissioner shall certify that the licensee is entitled to a refund, and payment of the refund shall be made by the commissioner. The amount necessary to pay for the refundment of the license fee is appropriated from the financial institutions account under section 46.131, subdivision 11. All license fees received by the commissioner under sections 53C.01 to 53C.14 shall be deposited with the commissioner of management and budget.\n(d) Each license shall specify the location of the office or branch and must be conspicuously displayed there. In case the location be changed, the commissioner shall endorse the change of location on the license.\n(e) Upon the filing of such application, and the payment of the fee, the commissioner shall issue a license to the applicant to engage in the business of a sales finance company under and in accordance with the provisions of sections 53C.01 to 53C.14 for a period which shall expire the last day of June next following the date of its issuance. The license shall not be transferable or assignable. No licensee shall transact any business provided for by sections 53C.01 to 53C.14 under any other name.\n(f) Section 58A.04, subdivisions 2 and 3, apply to this section.",
	"repealed": false
}