{
	"id": "244.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.13",
	"title": "244.13 INTENSIVE COMMUNITY SUPERVISION AND INTENSIVE SUPERVISED RELEASE.",
	"text": "The commissioner of corrections shall establish programs for those designated by the commissioner to serve all or part of a sentence on intensive community supervision or all or part of a supervised release or parole term on intensive supervised release. The adoption and modification of policies and procedures to implement sections 244.05, subdivision 6, and 244.12 to 244.15 are not subject to the rulemaking procedures of chapter 14 because these policies and procedures are excluded from the definition of a rule under section 14.03, subdivision 3, paragraph (b), clause (1). The commissioner shall locate the programs so that at least one-half of the money appropriated for the programs in each year is used for programs in Community Corrections Act counties. In awarding contracts for intensive supervision programs in Community Corrections Act counties, the commissioner shall give first priority to programs that utilize county employees as intensive supervision agents and shall give second priority to programs that utilize state employees as intensive supervision agents. The commissioner may award contracts to other providers in Community Corrections Act counties only if doing so will result in a significant cost savings or a significant increase in the quality of services provided, and only after notifying the chairs of the committees in the senate and house of representatives with jurisdiction over criminal justice policy.\nThe commissioner shall develop specialized training programs for intensive supervision agents assigned to the intensive community supervision and intensive supervised release programs. The agent caseload shall not exceed the ratio of 30 offenders to two intensive supervision agents. An intensive supervision agent must have qualifications comparable to those for a state corrections agent.\nThe commissioner shall develop a system for gathering and analyzing information concerning the value and effectiveness of the intensive community supervision and intensive supervised release programs.\nFor purposes of section 244.05, subdivision 6, and sections 244.12 to 244.15, \"intensive supervision agent\" means a probation officer, a corrections agent, or any other qualified person employed in supervising offenders serving a period of intensive community supervision or intensive supervised release.",
	"repealed": false
}