{
	"id": "123B.595",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.595",
	"title": "123B.595 LONG-TERM FACILITIES MAINTENANCE REVENUE.",
	"text": "(a) Long-term facilities maintenance revenue equals the greater of (1) the sum of (i) $380 times the district's adjusted pupil units times the lesser of one or the ratio of the district's average building age to 35 years, plus (ii) the cost approved by the commissioner for indoor air quality, fire alarm and suppression, and asbestos abatement projects under section 123B.57, subdivision 6, with an estimated cost of $100,000 or more per site, plus (iii) for a school district with an approved voluntary prekindergarten program under section 142D.08, the cost approved by the commissioner for remodeling existing instructional space to accommodate prekindergarten instruction, or (2) the sum of (i) the amount the district would have qualified for under Minnesota Statutes 2014, section 123B.57, Minnesota Statutes 2014, section 123B.59, and Minnesota Statutes 2014, section 123B.591, and (ii) for a school district with an approved voluntary prekindergarten program under section 142D.08, the cost approved by the commissioner for remodeling existing instructional space to accommodate prekindergarten instruction.\n(b) Notwithstanding paragraph (a), a school district that qualified for eligibility under Minnesota Statutes 2014, section 123B.59, subdivision 1, paragraph (a), for fiscal year 2010 remains eligible for funding under this section as a district that would have qualified for eligibility under Minnesota Statutes 2014, section 123B.59, subdivision 1, paragraph (a), for fiscal year 2017 and later.\nLong-term facilities maintenance revenue for a charter school equals $132 times the adjusted pupil units.\n(a) Upon approval through the adoption of a resolution by each member district school board of an intermediate district or other cooperative unit under section 123A.24, subdivision 2, or a joint powers district under section 471.59, and the approval of the commissioner of education, a school district may include in its authority under this section a proportionate share of the long-term maintenance costs of the intermediate district, cooperative unit, or joint powers district. The cooperative unit or joint powers district may issue bonds to finance the project costs or levy for the costs using long-term maintenance revenue transferred from member districts to make debt service payments or pay project costs or, for leased facilities, pay the portion of lease costs attributable to the amortized cost of long-term facilities maintenance projects completed by the landlord. Authority under this subdivision is in addition to the authority for individual district projects under subdivision 1.\n(b) The resolution adopted under paragraph (a) may specify which member districts will share the project costs under this subdivision, except that debt service payments for bonds issued by a cooperative unit or joint powers district to finance long-term maintenance project costs must be the responsibility of all member districts.\n(a) To qualify for revenue under this section, a school district or intermediate district, not including a charter school, must have a ten-year facility plan adopted by the school board and approved by the commissioner. The plan must include provisions for implementing a health and safety program that complies with health, safety, and environmental regulations and best practices, including indoor air quality management and remediation of lead hazards. For planning purposes, the plan must also address provisions for providing a gender-neutral single-user restroom at each school site.\n(b) The district must annually update the plan, submit the plan to the commissioner for approval by July 31, and indicate whether the district will issue bonds to finance the plan or levy for the costs.\n(c) For school districts issuing bonds to finance the plan, the plan must include a debt service schedule demonstrating that the debt service revenue required to pay the principal and interest on the bonds each year will not exceed the projected long-term facilities revenue for that year.\n(a) A school district may issue general obligation bonds under this section to finance facilities plans approved by its board and the commissioner. Chapter 475, except sections 475.58 and 475.59, must be complied with. The authority to issue bonds under this section is in addition to any bonding authority authorized by this chapter or other law. The amount of bonding authority authorized under this section must be disregarded in calculating the bonding or net debt limits of this chapter, or any other law other than section 475.53, subdivision 4.\n(b) At least 20 days before the earliest of the issuance of bonds or the final certification of levies under subdivision 6, the district must publish notice of the intended projects, the amount of the bond issue, and the total amount of district indebtedness.\n(c) The portion of revenue under this section for bonded debt must be recognized in the debt service fund.\nA district may levy for costs related to an approved plan under subdivision 4 as follows:\n(1) if the district has indicated to the commissioner that bonds will be issued, the district may levy for the principal and interest payments on outstanding bonds issued under subdivision 5 after reduction for any aid receivable under subdivision 9;\n(2) if the district has indicated to the commissioner that the plan will be funded through levy, the district may levy according to the schedule approved in the plan after reduction for any aid receivable under subdivision 9; or\n(3) if the debt service revenue for a district required to pay the principal and interest on bonds issued under subdivision 5 exceeds the district's long-term facilities maintenance revenue for the same fiscal year, the district's general fund levy must be reduced by the amount of the excess.\n(a) A district's long-term facilities maintenance equalization revenue equals the lesser of (1) $380 times the adjusted pupil units, or (2) the district's revenue under subdivision 1.\n(b) Notwithstanding paragraph (a), a district's long-term facilities maintenance equalization revenue must not be less than the lesser of the district's long-term facilities maintenance revenue or the amount of aid the district received for fiscal year 2015 under Minnesota Statutes 2014, section 123B.59, subdivision 6.\n(a) A district's long-term facilities maintenance equalized levy equals the district's long-term facilities maintenance equalization revenue minus the greater of:\n(1) the lesser of the district's long-term facilities maintenance equalization revenue or the amount of aid the district received for fiscal year 2015 under Minnesota Statutes 2014, section 123B.59, subdivision 6; or\n(2) the district's long-term facilities maintenance equalization revenue times the greater of (i) zero, or (ii) one minus the ratio of its adjusted net tax capacity per adjusted pupil unit in the year preceding the year the levy is certified to 123 percent of the state average adjusted net tax capacity per adjusted pupil unit for all school districts in the year preceding the year the levy is certified.\n(b) For purposes of this subdivision, \"adjusted net tax capacity\" means the value described in section 126C.01, subdivision 2, paragraph (b).\nA district's long-term facilities maintenance unequalized levy equals the difference between the district's revenue under subdivision 1 and the district's equalization revenue under subdivision 7.\nA district's long-term facilities maintenance equalized aid equals its long-term facilities maintenance equalization revenue minus its long-term facilities maintenance equalized levy times the ratio of the actual equalized amount levied to the permitted equalized levy.\n(a) A district may use revenue under this section for any of the following:\n(1) deferred capital expenditures and maintenance projects necessary to prevent further erosion of facilities;\n(2) increasing accessibility of school facilities;\n(3) health and safety capital projects under section 123B.57;\n(4) remodeling or constructing a gender-neutral single-user restroom at each school site; or\n(5) by board resolution, to transfer money from the general fund reserve for long-term facilities maintenance to the debt redemption fund to pay the amounts needed to meet, when due, principal and interest on general obligation bonds issued under subdivision 5.\n(b) A charter school may use revenue under this section for any purpose related to the school.\nNotwithstanding subdivision 10, long-term facilities maintenance revenue may not be used:\n(1) for the construction of new facilities, remodeling of existing facilities, or the purchase of portable classrooms, except for the costs associated with constructing or remodeling existing facilities to include at least one gender-neutral single-user restroom authorized under subdivision 10;\n(2) to finance a lease purchase agreement, installment purchase agreement, or other deferred payments agreement;\n(3) for energy-efficiency projects under section 123B.65, for a building or property or part of a building or property used for postsecondary instruction or administration, or for a purpose unrelated to elementary and secondary education; or\n(4) for violence prevention and facility security, ergonomics, or emergency communication devices.\nThe portion of long-term facilities maintenance revenue not recognized under subdivision 5, paragraph (c), must be maintained in a reserve account within the general fund.",
	"repealed": false
}