{
	"id": "176.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.275",
	"title": "176.275 FILING OF PAPERS; PROOF OF SERVICE.",
	"text": "If a document is required to be filed by this chapter or any rules adopted pursuant to authority granted by this chapter, the filing shall be completed upon acceptance of the document by the agency. Any document that lacks information required by statute or rule, or is not filed in the manner and format required by this chapter, may be rejected. A document rejected for any of these reasons is not considered filed. An agency is not required to maintain, and may destroy, a duplicate of a document that has already been filed. If a workers' compensation identification number has been assigned by the department, it must be substituted for the Social Security number on a document. The commissioner may request additional proof of an injured worker's identity before assigning an identification number.\nA notice or other document required to be served or filed at either the department, the office, or the court of appeals which is inadvertently served or filed at the wrong one of these agencies by an unrepresented employee shall be deemed to have been served or filed with the proper agency. The receiving agency shall note the date of receipt of a document and shall forward the documents to the proper agency no later than two working days following receipt.\n(a) Whenever a provision of this chapter or rules adopted pursuant to authority granted by this chapter require either a proof of service, an affidavit of service, or a notarized statement on a document, the requirement is satisfied by a document that meets the definition of an affidavit under Rule 15 of the General Rules of Practice for the district courts.\n(b) An agency is not required to verify the accuracy of a proof or affidavit of service filed by a party before accepting a document for filing. This does not prevent a party from asserting insufficient or lack of service in a proceeding.\n(c) Service on a party's attorney constitutes service on the represented party, unless service on the employee is specifically required by this chapter.\n(d) A party is not required to file a proof or affidavit of service of a document on a person when the party uses the agency's electronic system to serve the person.\n(e) A party to a claim who uses an agency's electronic system to (1) improperly file a document that is unrelated to the workers' compensation claim in which the document was filed, or (2) send or serve a document on a recipient who is not entitled to receive it under this chapter must, upon discovery or notification of the improper release, promptly notify the recipient, the agency, and the subject whose data was improperly released. The agency whose electronic system was used to send, serve, or file the document is not responsible under section 3.971 and chapter 13 for the improper release, but must promptly correct its files or remove the document from its electronic system upon discovery or notification.",
	"repealed": false
}