{
	"id": "147.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.03",
	"title": "147.03 LICENSURE BY ENDORSEMENT; RECIPROCITY; TEMPORARY PERMIT.",
	"text": "(a) The board may issue a license to practice medicine to any person who satisfies the requirements in paragraphs (b) to (e).\n(b) The applicant shall satisfy all the requirements established in section 147.02, subdivision 1, paragraphs (a), (b), (d), (e), and (f), or section 147.037, subdivision 1, paragraphs (a) to (e).\n(c) The applicant shall:\n(1) have passed an examination prepared and graded by the Federation of State Medical Boards, the National Board of Medical Examiners, or the United States Medical Licensing Examination (USMLE) program in accordance with section 147.02, subdivision 1, paragraph (c), clause (2); the National Board of Osteopathic Medical Examiners; or the Medical Council of Canada; and\n(2) have a current license from the equivalent licensing agency in another state or Canada and, if the examination in clause (1) was passed more than ten years ago, either:\n(i) pass the Special Purpose Examination of the Federation of State Medical Boards (SPEX) within three attempts; or\n(ii) have a current certification by a specialty board of the American Board of Medical Specialties, the American Osteopathic Association, the Royal College of Physicians and Surgeons of Canada, or the College of Family Physicians of Canada; or\n(3) if the applicant fails to meet the requirement established in section 147.02, subdivision 1, paragraph (c), clause (2), because the applicant failed to pass within the permitted three attempts each of steps or levels one, two, and three of the USMLE or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX-USA), the applicant may be granted a license provided the applicant:\n(i) has passed each of steps or levels one, two, and three within no more than four attempts for any of the three steps or levels with passing scores as recommended by the USMLE or COMLEX-USA program;\n(ii) is currently licensed in another state; and\n(iii) has current certification by a specialty board of the American Board of Medical Specialties, the American Osteopathic Association, the Royal College of Physicians and Surgeons of Canada, or the College of Family Physicians of Canada.\n(d) The applicant must not be under license suspension or revocation by the licensing board of the state or jurisdiction in which the conduct that caused the suspension or revocation occurred.\n(e) The applicant must not have engaged in conduct warranting disciplinary action against a licensee, or have been subject to disciplinary action other than as specified in paragraph (d). If an applicant does not satisfy the requirements stated in this paragraph, the board may issue a license only on the applicant's showing that the public will be protected through issuance of a license with conditions or limitations the board considers appropriate.\n(f) Upon the request of an applicant, the board may conduct the final interview of the applicant by teleconference.\n(a) An applicant for licensure under this section may request the board to issue a temporary permit in accordance with this subdivision. Upon receipt of the application for licensure, a request for a temporary permit, and a nonrefundable physician application fee specified under section 147.01, subdivision 7, the board may issue a temporary permit to practice medicine as a physician if the applicant is:\n(1) currently licensed in good standing to practice medicine as a physician in another state, territory, or Canadian province; and\n(2) not the subject of a pending investigation or disciplinary action in any state, territory, or Canadian province.\n(b) A temporary permit issued under this subdivision is nonrenewable and shall be valid until a decision is made on the physician's application for licensure or for 90 days, whichever occurs first.\n(c) The board may revoke a temporary permit that has been issued under this subdivision if the physician is the subject of an investigation or disciplinary action, or is disqualified for licensure for any other reason.\n(d) Notwithstanding section 13.41, subdivision 2, the board may release information regarding action taken by the board pursuant to this subdivision.\nNotwithstanding subdivision 2, the board may issue a temporary permit to practice medicine to an applicant who has not satisfied the requirements of subdivision 1, paragraph (c), clause (2), item (i) or (ii), but has satisfied all other requirements for licensure under this section, and has paid a nonrefundable fee set by the board. The permit remains valid for six months.",
	"repealed": false
}