{
	"id": "16C.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.14",
	"title": "16C.14 ENERGY EFFICIENCY INSTALLMENT PURCHASES.",
	"text": "The commissioner may contract to purchase by installment payments capital or other equipment or services intended to improve the energy efficiency or reduce the energy costs of a state building or facility if:\n(1) the term of the contract does not exceed 15 years, with not more than a 15-year payback beginning at the completion of the project;\n(2) the entire cost of the contract is a percentage of the resultant savings in energy costs and measurable operational costs. \"Savings in energy cost\" means a comparison of energy cost and energy usage under the precontract conditions, including reasonable projections of energy cost and usage if no change is made to the precontract conditions, against energy cost and usage with the changes made under the contract. If it is not cost effective to directly measure energy cost and/or energy usage, reasonable engineering estimates may be substituted for measured results. \"Savings in measurable operational costs\" may include savings from inventory reductions and outside maintenance expense, but do not include savings from in-house staff labor;\n(3) the contract for purchase must be completed using a solicitation;\n(4) the commissioner has determined that the contract vendor is a responsible vendor;\n(5) the contract vendor can finance or obtain financing for the performance of the contract without state assistance or guarantee; and\n(6) the state may unilaterally cancel the agreement if the legislature fails to appropriate funds to continue the contract or if the contractor at any time during the term of the contract fails to perform its contractual obligations, including failure to deliver or install equipment or materials, failure to replace faulty equipment or materials in a timely fashion, and failure to maintain the equipment as agreed in the contract.\nThe commissioner may spend money appropriated for energy costs in payment of a contract under this section.\nNotwithstanding any other law to the contrary, fuel cost savings resulting from energy conservation actions shall be available at the managerial level at which the actions took place for expenditure for other purposes within the biennium in which the actions occur or in the case of a shared savings agreement for the contract period of the shared savings agreement. For purposes of this subdivision \"shared savings agreement\" means a contract meeting the terms and conditions of subdivision 1.\n(a) The entire cost of an energy efficiency installment purchase contract must be a percentage of the resultant savings in energy and operational costs. Neither the state nor any agency is liable to make payments on the contract except to the extent that there are savings in energy and operational costs that must be shared with other parties to the contract.\n(b) The state and the contract vendor may agree to a reasonable floor price for each type of energy used in the savings calculations at the time of contract execution. If the state and the vendor agree to a floor price, that floor price shall be used throughout the term of the contract.",
	"repealed": false
}