{
	"id": "518F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/518F.04",
	"title": "518F.04 ENFORCEMENT OF CANADIAN ORDER FOR PROTECTION BY COURT.",
	"text": "(a) A court may issue an order enforcing or refusing to enforce a Canadian order for protection on application of:\n(1) a person authorized by law of this state other than this chapter to seek enforcement of an order for protection; or\n(2) a respondent.\n(b) In a proceeding under paragraph (a), the court shall follow the procedures of this state for enforcement of an order for protection. An order entered under this section is limited to the enforcement of the terms of the Canadian order for protection.\n(c) A Canadian order for protection is enforceable under this section if:\n(1) the order states the name of the protected individual and the individual against whom enforcement is sought;\n(2) the order has not expired;\n(3) the order was issued by a court or tribunal that had jurisdiction over the parties and subject matter under the law of the foreign jurisdiction; and\n(4) the order was issued in accordance with the respondent's due process rights, either after the respondent was provided with reasonable notice and an opportunity to be heard before the court or tribunal that issued the order, or in the case of an ex parte order, the respondent was granted notice and an opportunity to be heard within a reasonable time after the order was issued.\n(d) A Canadian order for protection on its face is prima facie evidence of its enforceability under this section.\n(e) A person claiming that a Canadian order for protection is not enforceable has the burden to show, by a preponderance of the evidence, that the requirements under paragraph (c) were not met. If the court determines that the order is not enforceable, the court shall issue an order that the Canadian order for protection is not enforceable under this section and section 518F.03 and may not be registered under section 518F.05.\n(f) This section applies to enforcement of a provision of a Canadian order for protection against a party to the order in which each party is a protected individual and respondent only if:\n(1) the party seeking enforcement of the order filed a pleading requesting the order from the issuing court; and\n(2) the court made specific findings that entitled the party to the enforcement sought.\n(g) A person who violates a valid Canadian order for protection is subject to the penalties provided in section 518B.01, subdivision 14, paragraphs (b) to (d).",
	"repealed": false
}