{
	"id": "160.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.26",
	"title": "160.26 MOVING BUILDINGS OVER HIGHWAYS.",
	"text": "Buildings or structures moved or caused to be moved upon, across, or along any road or street, including city streets, shall be moved in such manner as not to unnecessarily interfere with, damage, or destroy any bridges, trees, hedges, fences, telephone or electric power poles, wires, cables, or any appurtenance upon the road or street.\n(a) Buildings or structures together with the vehicle or vehicles moving same of a size or weight exceeding the maximums specified in chapter 169 and acts amendatory thereto shall not be moved or caused to be moved upon, across, or along any road or street without first obtaining a written permit from the road authority including road authorities of cities having supervision over such road or street. The county board as to highways under its jurisdiction may authorize the county engineer to issue the permits.\n(b) When a permit is granted by the commissioner for the moving of buildings or structures exclusively on trunk highways no other permit shall be required from any political subdivision of the state for the moving of such buildings or structures on such trunk highways. When a permit is granted by the county board or county engineer for the moving of buildings or structures exclusively on highways under the jurisdiction of the county board no other permit shall be required from any political subdivision for moving such buildings or structures on such county highways.\nMS 1982 [Repealed, 1983 c 293 s 115]\nNo person, firm, or corporation shall be required to displace or temporarily remove the fences, poles, wires, cables, or other appurtenances of that person, firm, or corporation to permit the moving of any building or structure upon, along, or across the road or street, nor shall guard rails and appurtenances placed upon the road or street be displaced or moved for like reason until the reasonable cost of the displacement, removal, and replacement shall have been paid or tendered.\nThe provisions of this section shall not apply to road-building or maintenance equipment while operating on a road or street under construction or maintenance.",
	"repealed": false
}