{
	"id": "325G.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.58",
	"title": "325G.58 PROHIBITED CONDUCT.",
	"text": "For purposes of this section, \"agreement\" means an indefinite subscription agreement, as defined in section 325G.56, and a contract, as defined in section 325G.23.\nA seller must not charge the consumer's credit or debit card or the consumer's account with a third party in connection with an agreement before the agreement has been duly authorized by the seller and consumer and made effective.\nAn agreement must not require the consumer to permit the seller to match any offer the consumer has received. A provision in an agreement that violates this subdivision is void and unenforceable.\n(a) A seller that has received a notice of cancellation or notice of termination of an agreement from a consumer cannot:\n(1) make any misrepresentation or undertake any unfair or abusive tactic to delay, unreasonably delay, or avoid the cancellation or termination of the agreement; or\n(2) make or provide additional benefits, contract modifications, gifts, or similar offers to the consumer until the seller has obtained permission from the consumer, granted by the consumer after notice of cancellation or termination was given to the seller, for the seller to engage in any such activity.\n(b) A seller can only seek a consumer's permission under this paragraph once per cancellation or termination attempt. A consumer's grant of permission under this paragraph is limited to the immediate cancellation or termination attempt and does not apply to subsequent attempts.\nThis section does not prohibit a seller from:\n(1) asking the consumer the reasons for cancellation or termination, provided that a consumer is not required to answer as a condition of cancellation or termination;\n(2) informing the consumer of any consequences of canceling or terminating the subscription;\n(3) verifying the identity of the consumer; or\n(4) describing options to maintain an ongoing relationship with the seller, including but not limited to for downgrading, pausing, or suspending the subscription.",
	"repealed": false
}