{
	"id": "299A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.13",
	"title": "299A.13 ADDITIONAL SAFETY REQUIREMENTS.",
	"text": "Any vehicle used to provide transportation service must be equipped with seat belts that are approved by the commissioner of public safety. The seat belts required by this subdivision must be adequate to secure the occupant of a wheelchair who is being transported by the vehicle. The seat belts must be used only to secure the person and must not be used to secure the wheelchair unless the wheelchair securement force is not cumulative to the seat belt. The seat belts must meet all other applicable state and federal requirements for safety.\nWhen transportation service is provided to an individual in an electrically powered wheelchair, the main power switch of the wheelchair must be placed in the \"off\" position at all times while the vehicle is in motion.\n(a) Vehicles equipped with wheelchair securement devices must provide a level-change mechanism or boarding device such as a lift or ramp that complies with Code of Federal Regulations, title 49, section 38.23.\n(b) Wheelchair lifts must comply with the National Highway Traffic Safety Administration's Federal Motor Vehicle Safety Standards for public use lifts as outlined in Code of Federal Regulations, title 49, sections 571.403 and 571.404.\n(a) The driver of a vehicle equipped with a wheelchair securement device has the duties outlined in this subdivision.\n(b) The driver or a person designated by the driver must ensure that an occupied wheelchair is properly secured before the driver sets the vehicle in motion.\n(c) The driver or a person designated by the driver must ensure that the seat belt assembly is properly adjusted and fastened around the wheelchair user in a manner consistent with the manufacturer's recommendations before the driver sets the vehicle in motion when:\n(1) requested by the wheelchair user;\n(2) the wheelchair user is unable to communicate;\n(3) seat belt usage is required of all passengers in the vehicle; or\n(4) the vehicle is a school bus.\nThe seat belt assembly must not be fastened if the wheelchair user or other responsible person advises the driver that to do so would aggravate a physical condition of the wheelchair user. If a restraint device is available that would not aggravate the physical condition of the user, it must be fastened in the required manner.\n(d) The driver or a person designated by the driver shall ensure that securement devices and seat belt assemblies are retracted, removed, or otherwise stored when not in use to prevent tripping of persons and damage to devices.",
	"repealed": false
}