{
	"id": "524.5-429",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-429",
	"title": "524.5-429 CLAIMS AGAINST PERSON SUBJECT TO CONSERVATORSHIP.",
	"text": "(a) A conservator may pay, or secure by encumbering assets of the estate, claims against the estate or against the person subject to conservatorship arising before or during the conservatorship upon their presentation and allowance in accordance with the priorities stated in paragraph (d). A claimant may present a claim by:\n(1) sending or delivering to the conservator a written statement of the claim, indicating its basis, the name and address of the claimant, and the amount claimed; or\n(2) filing a written statement of the claim, in the form prescribed by rule, with the clerk of court and sending or delivering a copy of the statement to the conservator.\n(b) A claim is deemed presented on receipt of the written statement of claim by the conservator or the filing of the claim with the court, whichever occurs first. A presented claim is allowed if it is not disallowed by written statement sent or delivered by the conservator to the claimant within 60 days after its presentation. The conservator before payment may change an allowance to a disallowance in whole or in part, but not after allowance by a court order or judgment or an order directing payment of the claim. The presentation of a claim tolls the running of any statute of limitations relating to the claim until 30 days after its disallowance.\n(c) A claimant whose claim has not been paid may petition the court for determination of the claim at any time before it is barred by a statute of limitations and, upon due proof, procure an order for its allowance, payment, or security by encumbering assets of the estate. If a proceeding is pending against a person subject to conservatorship at the time of appointment of a conservator or is initiated against the person subject to conservatorship thereafter, the moving party shall give to the conservator notice of any proceeding that could result in creating a claim against the estate.\n(d) If it appears that the estate is likely to be exhausted before all existing claims are paid, the conservator shall distribute the estate in money or in kind in payment of claims in the following order:\n(1) costs and expenses of administration;\n(2) claims of the federal or state government having priority under other law;\n(3) reasonable and necessary medical, hospital, or nursing home expenses of the person subject to conservatorship, including compensation of persons attending the person subject to guardianship, person subject to conservatorship, or respondent;\n(4) claims incurred by the conservator for support, care, education, health, and welfare previously provided to the person subject to conservatorship or individuals who are in fact dependent on the person subject to conservatorship;\n(5) claims arising before the conservatorship; and\n(6) all other claims.\n(e) Preference may not be given in the payment of a claim over any other claim of the same class, and a claim due and payable may not be preferred over a claim not due.\n(f) If assets of the conservatorship are adequate to meet all existing claims, the court, acting in the best interest of the person subject to conservatorship, may order the conservator to give a mortgage or other security on the conservatorship estate to secure payment at some future date of any or all claims.",
	"repealed": false
}