{
	"id": "120B.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.115",
	"title": "120B.115 REGIONAL CENTERS OF EXCELLENCE.",
	"text": "(a) Regional centers of excellence are established to assist and support school boards, school districts, school sites, and charter schools in implementing research-based interventions and practices to increase the students' achievement within a region. The centers must develop partnerships with local and regional service cooperatives, postsecondary institutions, integrated school districts, the department, children's mental health providers, or other local or regional entities interested in providing a cohesive and consistent regional delivery system that serves all schools equitably. Centers must assist school districts, school sites, and charter schools in developing similar partnerships. Center support may include assisting school districts, school sites, and charter schools with common principles of effective practice, including:\n(1) defining measurable education goals under sections 120B.022, subdivisions 1a and 1b, and 120B.11, subdivision 2;\n(2) implementing evidence-based practices, including applied and experiential learning, contextualized learning, competency-based curricula and assessments, and other nontraditional learning opportunities, among other practices;\n(3) engaging in data-driven decision-making;\n(4) providing multilayered levels of support;\n(5) supporting culturally responsive teaching and learning aligning the development of academic English proficiency, state and local academic standards, and career and college readiness benchmarks;\n(6) engaging parents, families, youth, and local community members in programs and activities at the school district, school site, or charter school that foster collaboration and shared accountability for the achievement of all students; and\n(7) translating district forms and other information such as a multilingual glossary of commonly used education terms and phrases.\nCenters must work with school site leadership teams to build the expertise and experience to implement programs that close the achievement gap, provide effective and differentiated programs and instruction for different types of English learners, including English learners with limited or interrupted formal schooling and long-term English learners under section 124D.59, subdivisions 2 and 2a, increase students' progress and growth toward career and college readiness, and increase student graduation rates.\n(b) The department must assist the regional centers of excellence to meet staff, facilities, and technical needs, provide the centers with programmatic support, and work with the centers to establish a coherent statewide system of regional support, including consulting, training, and technical support, to help school boards, school districts, school sites, and charter schools effectively and efficiently implement the comprehensive achievement and civic readiness goals under section 120B.11 and other state and federal education initiatives, including secondary and postsecondary career pathways and technical education.",
	"repealed": false
}