{
	"id": "84.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.82",
	"title": "84.82 EXEMPTIONS; COLLECTOR SNOWMOBILES; UNLIMITED USE.",
	"text": "[Repealed, 1984 c 654 art 2 s 155]\nA person may not operate a snowmobile unless the snowmobile has been registered under this section. A person may not sell a snowmobile without furnishing the buyer a bill of sale on a form prescribed by the commissioner.\n(a) Application for registration or reregistration shall be made to the commissioner or an authorized deputy registrar of motor vehicles in a format prescribed by the commissioner and shall state the legal name and address of every owner of the snowmobile.\n(b) A person who purchases a snowmobile from a retail dealer shall make application for registration to the dealer at the point of sale. The dealer shall issue a dealer temporary 21-day registration permit to each purchaser who applies to the dealer for registration. The temporary permit must contain the dealer's identification number and phone number. Each retail dealer shall submit completed registration and fees to the deputy registrar at least once a week. No fee may be charged by a dealer to a purchaser for providing the temporary permit.\n(c) Upon receipt of the application and the appropriate fee, the commissioner or deputy registrar shall issue to the applicant, or provide to the dealer, an assigned registration number or a commissioner or deputy registrar temporary 21-day permit. The registration number must be printed on a registration decal issued by the commissioner or a deputy registrar. Once issued, the registration decal must be affixed to the snowmobile in a clearly visible and permanent manner for enforcement purposes according to subdivision 3b. A dealer subject to paragraph (b) shall provide the registration materials or temporary permit to the purchaser within the temporary 21-day permit period. The registration is not valid unless signed by at least one owner.\n(d) Each deputy registrar of motor vehicles acting pursuant to section 168.33 shall also be a deputy registrar of snowmobiles. The commissioner of natural resources in agreement with the commissioner of public safety may prescribe the accounting and procedural requirements necessary to ensure efficient handling of registrations and registration fees. Deputy registrars shall strictly comply with these accounting and procedural requirements.\n(e) In addition to other fees prescribed by law, an issuing fee of $4.50 is charged for each snowmobile registration renewal, duplicate or replacement registration card, and replacement decal, and an issuing fee of $7 is charged for each snowmobile registration and registration transfer issued by:\n(1) a registrar or a deputy registrar and must be deposited in the manner provided in section 168.33, subdivision 2; or\n(2) the commissioner and must be deposited in the state treasury and credited to the snowmobile trails and enforcement account in the natural resources fund.\nA snowmobile may be registered for nontrail use. A snowmobile registered under this subdivision may not be operated on a state or grant-in-aid snowmobile trail. The fee for a nontrail use registration of a snowmobile with an engine displacement that is greater than 125 cubic centimeters is $45 for three years. A nontrail use registration is not transferable. In addition to other penalties prescribed by law, the penalty for violation of this subdivision is immediate revocation of the nontrail use registration. The commissioner shall ensure that the registration provided for limited nontrail use is of a different color and is distinguishable from other snowmobile registration provided.\n[See Note.]\n(a) The fee for registration of each snowmobile, other than those used for an agricultural purpose, as defined in section 84.92, subdivision 1c; those registered by a dealer or manufacturer pursuant to paragraph (b) or (c); or those registered under subdivision 2a shall be as follows: $105 for three years and $10 for a duplicate or transfer.\n(b) The total registration fee for all snowmobiles owned by a dealer and operated for demonstration or testing purposes shall be $50 per year.\n(c) The total registration fee for all snowmobiles owned by a manufacturer and operated for research, testing, experimentation, or demonstration purposes shall be $150 per year. Dealer and manufacturer registrations are not transferable.\n(d) The onetime fee for registration of an exempt snowmobile under subdivision 6a is $6.\nAll snowmobile registrations, excluding temporary registration permits, required under this section expire June 30 of the year of expiration.\n(a) A person must not operate a snowmobile in the state or allow another to operate the person's snowmobile in the state unless the snowmobile has its unexpired registration decal affixed to each side of the snowmobile and the decals are legible.\n(b) The registration decal must be affixed:\n(1) for snowmobiles made after June 30, 1972, in the areas provided by the manufacturer under section 84.821, subdivision 2; and\n(2) for all other snowmobiles, on each side of the cowling on the upper half of the snowmobile.\n(c) When any previously affixed registration decal is destroyed or lost, a duplicate must be affixed in the same manner as provided in paragraph (b).\nEvery owner of a snowmobile shall renew its registration in such manner as the commissioner shall prescribe, upon payment of the same registration fees provided in subdivision 3 hereof.\nA registration number shall be issued without the payment of a fee for snowmobiles owned by the state of Minnesota or a political subdivision thereof upon application therefor.\nRegistration is not required under this section for:\n(1) a snowmobile owned and used by the United States, an Indian tribal government, another state, or a political subdivision thereof;\n(2) a snowmobile registered in a country other than the United States temporarily used within this state;\n(3) a snowmobile that is covered by a valid license of another state and has not been within this state for more than 30 consecutive days or that is registered by an Indian tribal government to a tribal member and has not been outside the tribal reservation boundary for more than 30 consecutive days;\n(4) a snowmobile used exclusively in organized track-racing events;\n(5) a snowmobile in transit by a manufacturer, distributor, or dealer;\n(6) a snowmobile at least 15 years old in transit by an individual for use only on land owned or leased by the individual;\n(7) a snowmobile while being used to groom a state or grant-in-aid trail; or\n(8) a snowmobile with an engine displacement that is 125 cubic centimeters or less and the snowmobile is not operated on a state or grant-in-aid trail.\nSnowmobiles may be issued an exempt registration if the machine is at least 25 years old. Exempt registration is valid from the date of issuance until ownership of the snowmobile is transferred. Exempt registrations are not transferable.\nThe commissioner of natural resources may issue special permits to out-of-state snowmobiles from a state or country where registration is not required to operate in Minnesota for limited periods of time not to exceed 30 days in connection with organized group outings, trail rides, races, rallies and other promotional events.\nThe commissioner may issue a special permit to a person or organization to operate a collector snowmobile without registration in parades or organized group outings, such as races, rallies, and other promotional events and for up to ten days each year for personal transportation. The commissioner may impose a reasonable restriction on a permittee and may revoke, amend, suspend, or modify a permit for cause.\nNo person under the age of 18 years may register a snowmobile.\n[Repealed, 1985 c 54 s 3]\n(a) A person applying for initial registration of a snowmobile must provide a receipt, invoice, or other document to prove that:\n(1) the sales and use tax under chapter 297A was paid;\n(2) the purchase was exempt from tax under chapter 297A; or\n(3) the snowmobile was purchased from a retailer that is maintaining a place of business in this state as defined in section 297A.66, subdivision 1, and is a dealer.\n(b) The commissioner or authorized deputy registrars, acting as agents of the commissioner of revenue under an agreement between the commissioner and the commissioner of revenue, as provided in section 297A.825:\n(1) must collect use tax from the applicant if the applicant does not provide the proof required under paragraph (a); and\n(2) are authorized to issue refunds of use tax paid to them in error.\n(c) Subdivision 11 does not apply to refunds under this subdivision.\nThe commissioner may issue a refund on a registration, not including any issuing fees paid under subdivision 2, paragraph (e), or section 84.027, subdivision 15, paragraph (a), clause (2), if the refund request is received within 60 days of the original registration, the registration is not used or transferred, and:\n(1) the snowmobile was registered incorrectly; or\n(2) the snowmobile was registered twice, once by the dealer and once by the customer.\n[See Note.]",
	"repealed": false
}