{
	"id": "237.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.04",
	"title": "237.04 WIRE CROSSING OR PARALLELING UTILITY LINE; RULES.",
	"text": "(a) The department, upon the complaint of any person, railroad, municipal utility, cooperative electric association, telephone company, telecommunications carrier, cable company, fiber optic carrier, or other public utility claiming to be injuriously affected or subjected to hazard by any crossing or paralleling of the lines of any railroad or other similar public service corporation, constructed or about to be constructed, shall, after a hearing, make such order and prescribe such terms and conditions for the construction, maintenance, and operation of the lines in question as may be just and reasonable.\n(b) The department may, upon request of any municipal utility, electric cooperative association, public utility, telephone company, telecommunications carrier, cable company, or fiber optic carrier determine the just and reasonable charge which a railroad, or owner of an abandoned railroad right-of-way, other than the state or a regional railroad authority, can prescribe for a new or existing crossing of a railroad right-of-way by any telephone, telegraph, telecommunications, cable, fiber optic, electric, or gas line, or new or existing telephone, telegraph, telecommunications, cable, fiber optic, electric, or gas line more or less paralleling a railroad right-of-way, based on the diminution in value caused by the crossing or paralleling of the right-of-way by the telephone, telegraph, telecommunications, cable, fiber optic, electric, or gas line. This section shall not be construed to eliminate the right of a public utility, municipal utility, or electric cooperative association to have any of the foregoing issues determined pursuant to an eminent domain proceeding commenced under chapter 117. Unless the railroad, or owner of an abandoned railroad right-of-way, other than the state or a regional railroad authority, asserts in writing that the proposed crossing or paralleling is a serious threat to the safe operations of the railroad or to the current use of the railroad right-of-way, a crossing can be constructed following filing of the requested action with the department, pending review of the requested action by the department.\n(c) The department shall assess the cost of reviewing the requested action, and of determining a just and reasonable charge, equally among the parties.\n(d) For the purposes of this section, \"parallel\" or \"paralleling\" means that the relevant utility facilities run adjacent to and alongside the lines of a railroad for no more than one mile, or another distance agreed to by the parties, before the utility facilities cross the railroad lines, terminate, or exit the railroad right-of-way.",
	"repealed": false
}