{
	"id": "241.336",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.336",
	"title": "241.336 BLOOD SAMPLE COLLECTION FOR TESTING.",
	"text": "(a) If a blood sample is not otherwise available, the correctional facility shall obtain consent from the inmate before collecting a blood sample for testing for blood-borne pathogens. The consent process shall include informing the inmate that the inmate may refuse to provide a blood sample and that the inmate's refusal may result in a request for a court order under subdivision 2 to require the inmate to provide a blood sample.\n(b) If the inmate consents to provide a blood sample, the correctional facility shall collect a blood sample and ensure that the sample is tested for blood-borne pathogens.\n(c) The correctional facility shall inform the corrections employee's health care provider about the inmate's test results without the inmate's name or other uniquely identifying information. The correctional facility shall inform the inmate of the test results.\n(d) If the inmate refuses to provide a blood sample for testing, the correctional facility shall inform the corrections employee of the inmate's refusal.\n(a) A correctional facility or a corrections employee may bring a petition for a court order to require an inmate to provide a blood sample for testing for blood-borne pathogens. The petition shall be filed in the district court in the county where the inmate is confined. The correctional facility shall serve the petition on the inmate three days before a hearing on the petition. The petition shall include one or more affidavits attesting that:\n(1) the correctional facility followed the procedures in sections 241.33 to 241.342 and attempted to obtain blood-borne pathogen test results according to those sections;\n(2) a licensed physician knowledgeable about the most current recommendations of the United States Public Health Service has determined that a significant exposure has occurred to the corrections employee under section 241.341; and\n(3) a physician has documented that the corrections employee has provided a blood sample and consented to testing for blood-borne pathogens and blood-borne pathogen test results are needed for beginning, continuing, modifying, or discontinuing medical treatment for the corrections employee under section 241.341.\n(b) Facilities shall cooperate with petitioners in providing any necessary affidavits to the extent that facility staff can attest under oath to the facts in the affidavits.\n(c) The court may order the inmate to provide a blood sample for blood-borne pathogen testing if:\n(1) there is probable cause to believe the corrections employee has experienced a significant exposure to the inmate;\n(2) the court imposes appropriate safeguards against unauthorized disclosure that must specify the persons who have access to the test results and the purposes for which the test results may be used;\n(3) a licensed physician for the corrections employee needs the test results for beginning, continuing, modifying, or discontinuing medical treatment for the corrections employee; and\n(4) the court finds a compelling need for the test results. In assessing compelling need, the court shall weigh the need for the court-ordered blood collection and test results against the interests of the inmate, including, but not limited to, privacy, health, safety, or economic interests. The court shall also consider whether involuntary blood collection and testing would serve the public interests.\n(d) The court shall conduct the proceeding in camera unless the petitioner or the inmate requests a hearing in open court and the court determines that a public hearing is necessary to the public interest and the proper administration of justice.\n(e) The inmate may arrange for counsel in any proceeding brought under this subdivision.\n(a) As used in this subdivision, \"qualified physician\" means a person who:\n(1) is a licensed physician employed by or under contract with the correctional facility to provide services to employees and inmates; and\n(2) is an infectious disease specialist or consults with an infectious disease specialist or a hospital infectious disease officer.\n(b) An inmate in a correctional facility is subject to the release of medical information related to blood-borne pathogen infections or the collection and testing of a blood sample if a significant exposure occurs as determined by procedures in section 241.331, subdivision 2, clause (1). In the absence of affirmative consent and cooperation in the release of medical information or collection of a blood sample, the head of a correctional facility, having reported to and consulted with the state epidemiologist, may order an inmate to provide release of medical information related to blood-borne pathogen infections or a blood sample for testing for blood-borne pathogens if:\n(1) the correctional facility followed the procedures in sections 241.33 to 241.336, subdivision 1, and 241.337 to 241.342 and attempted to obtain blood-borne pathogen test results according to those sections;\n(2) a qualified physician has determined that a significant exposure has occurred to the corrections employee under section 241.341;\n(3) a qualified physician has documented that the corrections employee has received vaccinations for preventing blood-borne pathogens, provided a blood sample, and consented to testing for blood-borne pathogens, and that blood-borne pathogen test results are needed for beginning, continuing, modifying, or discontinuing medical treatment for the corrections employee under section 241.341;\n(4) the head of the correctional facility has received affidavits from qualified physicians, treating the corrections worker and the inmate, attesting that a significant exposure has occurred to the corrections employee under section 241.341;\n(5) the correctional facility imposes appropriate safeguards against unauthorized disclosure and use of medical information or samples consistent with those established in sections 241.331 to 241.339;\n(6) a qualified physician for the corrections employee needs the test results for beginning, continuing, modifying, or discontinuing medical treatment for the corrections employee; and\n(7) the head of the correctional facility finds a compelling need for the medical information or test results.\nIn assessing whether a compelling need exists under clause (7), the head of the correctional facility shall weigh the officer's need for the exchange of medical information or blood collection and test results against the interests of the inmate, including, but not limited to, privacy, health, safety, or economic interests. The head of the correctional facility shall also consider whether release of medical information or involuntary blood collection and testing would serve or harm public health interests.\n(c) Each state and local correctional facility shall adopt a plan for implementing by July 1, 2006, policies and procedures for:\n(1) the education and treatment of corrections employees and inmates that are consistent with those established by the Department of Corrections;\n(2) ensuring that corrections employees and inmates are routinely offered and are provided voluntary vaccinations to prevent blood-borne pathogen infections;\n(3) ensuring that corrections employees and inmates are routinely offered and are provided with voluntary postexposure prophylactic treatments for blood-borne pathogen infections in accordance with the most current guidelines of the United States Public Health Service; and\n(4) ensuring voluntary access to treatment for blood-borne pathogen infections in accordance with the most current guidelines of the United States Public Health Service for corrections workers or inmates who are determined to have a blood-borne pathogen infection through procedures established in sections 241.331 to 241.339.\n(d) The commissioner of corrections and the director of each local correctional facility shall provide written notice to each inmate through the inmate handbook, or a comparable document, of the provisions of this subdivision.",
	"repealed": false
}