{
	"id": "123A.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.78",
	"title": "123A.78 JOINT POWERS AGREEMENTS FOR FACILITIES.",
	"text": "Any group of districts may form a joint powers district under section 471.59 representing all participating districts to build or acquire a facility to be used for instructional purposes. The joint powers board must submit the project for review and comment under section 123B.71. The joint powers board must hold a hearing on the proposal. The joint powers district must submit the question of authorizing the borrowing of funds for the project to the voters of the joint powers district at a special election. The question submitted shall state the total amount of funding needed from all sources. The joint powers board may issue the bonds according to chapter 475 and certify the levy required by section 475.61 only if a majority of those voting on the question vote in the affirmative and only after the school boards of each member district have adopted a resolution pledging the full faith and credit of that district. The resolution shall irrevocably commit that district to pay a proportionate share, based on pupil units, of any debt levy shortages that, together with other funds available, would allow the joint powers board to pay the principal and interest on the obligations. The district's payment of its proportionate share of the shortfall shall be made from the district's capital expenditure fund. The clerk of the joint powers board must certify the vote of the bond election to the commissioner.\nA group of governmental units may form a joint powers district under section 471.59 representing all participating units to build or acquire a facility. The joint powers board must submit the project for review and comment under section 123B.71. The joint powers board must hold a hearing on the proposal. The joint powers district must submit the question of authorizing the borrowing of funds for the project to the voters of the joint powers district at a special election. The question submitted shall state the total amount of funding needed from all sources. The joint powers board may issue the bonds according to chapter 475 and certify the levy required by section 475.61 only if a majority of those voting on the question vote in the affirmative and only after the boards of each member unit have adopted a resolution pledging the full faith and credit of that unit. The resolution must irrevocably commit that unit to pay an agreed-upon share of any debt levy shortages that, together with other funds available, would allow the joint powers board to pay the principal and interest on the obligations. The clerk of the joint powers board must certify the vote of the bond election to the commissioner.",
	"repealed": false
}