{
	"id": "53C.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.09",
	"title": "53C.09 FINANCE CHARGE ON INSTALLMENT CONTRACT FOR VEHICLE OR MANUFACTURED HOME.",
	"text": "(a) The finance charge authorized by sections 53C.01 to 53C.14 in a retail installment sale may not exceed the following simple interest annual percentage rates:\nClass 1. Any motor vehicle designated by the manufacturer by a year model of the same or not more than one year prior to the year in which the sale is made - 18 percent per year.\nClass 2. Any motor vehicle designated by the manufacturer by a year model of two or three years prior to the year in which the sale is made - 19.75 percent per year.\nClass 3. Any motor vehicle not in Class 1 or Class 2 - 23.25 percent per year.\n(b) The finance charge must be computed on the principal balance outstanding from time to time. The beginning principal balance must be as originally determined under section 53C.08.\n(c) Retail installment contracts may be interest-bearing or precomputed, and fixed-rate or variable rate. For precomputed retail installment contracts, the finance charge may be calculated in advance on the assumption that all scheduled payments will be made when due and the effect of prepayment in full is governed by section 53C.10.\n(d) To compute time for the purpose of calculating interest under this section and section 53C.10, a day may be considered 1/30 of a month when calculation is made for a fraction of a calendar month. A year is 12 calendar months. A calendar month is that period from a given date in one month to the same numbered date in the following month, and if there is no same-numbered date, to the last day of the following month. When a period of time includes a whole month and a fraction of a month, the fraction of a month is considered to follow the whole month. In the alternative, for interest-bearing retail installment contracts, a retail seller may charge finance charges not to exceed 1/365th of the simple interest annual percentage rate permitted in this section for each actual day elapsed from the date of the retail installment contract through and including the date of payment in full.\n(e) The finance charge is inclusive of all charges incident to investigating and making the contract, and for the extension of the credit provided for in the contract and no fee, commission, expense, or other charge whatsoever may be taken, received, reserved, or contracted for except taxes, fees, and charges that actually are or will be paid to public officials or government agencies for determining the existence of or for perfecting, releasing, or satisfying a security interest, and except as provided in sections 53C.01 to 53C.14.\n(a) A contract holder shall credit a payment to the customer's account as of the date of receipt except when a delay in crediting does not result in a finance or other charge or except as provided in paragraph (b).\n(b) If a retail installment contract or other instructions specify requirements for the consumer to follow in making payments, but the contract holder accepts a payment that does not conform to the requirements, the contract holder shall credit the payment within five days of receipt.\n(c) If a contract holder fails to credit a payment, as required by paragraphs (a) and (b), in time to avoid the imposition of finance or other charges, the contract holder shall adjust the consumer's account so that the charges imposed are credited to the consumer's account promptly.\nA sale of a manufactured home made after July 31, 1983, is governed by the provisions of subdivision 1 for purposes of determining the lawful finance charge rate, except that the maximum finance charge for a class I manufactured home may not exceed 14.5 percent per year. A retail installment sale of a manufactured home that imposes a time price differential rate that is greater than the rate permitted by this subdivision is lawful and enforceable in accordance with its terms until the indebtedness is fully satisfied if the rate was lawful when the sale was made.\nIn lieu of this section and sections 53C.01, subdivisions 2, 4, and 13; 53C.08; 53C.10; and 53C.11, a retail seller may proceed under section 47.59 relating to credit sales made by a third party. In cases where the retail seller proceeds under section 47.59, the remaining provisions of sections 53C.01 to 53C.14 apply notwithstanding section 47.59.",
	"repealed": false
}