{
	"id": "18E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/18E.04",
	"title": "18E.04 REIMBURSEMENT OR PAYMENT OF RESPONSE COSTS.",
	"text": "The commissioner shall reimburse an eligible person from the agricultural chemical response and reimbursement account for the reasonable and necessary costs incurred by the eligible person in taking corrective action as provided in subdivision 4, if the board determines:\n(1) the eligible person takes all reasonable action necessary to minimize and abate an incident and the action is subsequently approved by the commissioner;\n(2) the eligible person complies with any reasonable requests for corrective action issued to the eligible person by the commissioner;\n(3) the eligible person complied with corrective action orders if issued to the eligible person by the commissioner; and\n(4) the incident was reported as required in chapters 18B, 18C, and 18D.\n(a) On request by an eligible person, the board may pay the eligible person for the reasonable and necessary cash disbursements for corrective action costs incurred by the eligible person as provided under subdivision 4 if the board determines:\n(1) the eligible person pays the first $1,000 of the corrective action costs;\n(2) the eligible person provides the board with a sworn affidavit and other convincing evidence that the eligible person is unable to pay additional corrective action costs;\n(3) the eligible person continues to assume responsibility for carrying out the requirements of corrective action orders issued to the eligible person or that are in effect;\n(4) the incident was reported as required in chapters 18B, 18C, and 18D; and\n(5) the eligible person submits an application for payment or reimbursement to the department, along with associated invoices, within three years of (i) performance of the eligible work, or (ii) approval of the related corrective action design or plan for that work, whichever is later.\n(b) An eligible person is not eligible for payment or reimbursement and must refund amounts paid or reimbursed by the board if false statements or misrepresentations are made in the affidavit or other evidence submitted to the commissioner to show an inability to pay corrective action costs.\n(c) The board may pay the eligible person and one or more designees by multiparty check.\nPesticides that are sanitizers and disinfectants and are exempt from surcharges are ineligible for reimbursement or payment under this section.\n(a) If the unencumbered balance of the account drops below $3,000,000, the board may only pay or reimburse an eligible person up to $100,000 within the same fiscal year.\n(b) If the board determines that an incident was caused by a violation of chapter 18B, 18C, or 18D, the board may reimburse or pay a portion of the corrective action costs of the eligible person based on the culpability of the eligible person and the percentage of the costs not attributable to the violation.\n(a) The board shall pay a person that is eligible for reimbursement or payment under subdivisions 1, 2, and 3 from the agricultural chemical response and reimbursement account for 80 percent of the total reasonable and necessary corrective action costs greater than $1,000 and less than or equal to $550,000.\n(b) A reimbursement or payment may not be made until the board has determined that the costs are reasonable and are for a reimbursement of the costs that were actually incurred.\n(c) The board may make periodic payments or reimbursements as corrective action costs are incurred upon receipt of invoices for the corrective action costs.\n(d) Money in the agricultural chemical response and reimbursement account is appropriated to the commissioner to make payments and reimbursements directed by the board under this subdivision.\n(e) The board may not make reimbursement greater than the maximum allowed under paragraph (a) for all incidents on a single site which:\n(1) were not reported at the time of release but were discovered and reported after July 1, 1989; and\n(2) may have occurred prior to July 1, 1989, as determined by the commissioner.\n(f) The board may only reimburse an eligible person for separate incidents within a single site if the commissioner determines that each incident is completely separate and distinct in respect of location within the single site or time of occurrence.\n(g) Except for an emergency incident, the board may not reimburse or pay for more than 60 percent of the corrective action costs of an eligible person or for an incident within five years of a previous incident at a single site resulting from a site recontamination.\n(h) The deduction of $1,000 and 20 percent from the $550,000 remuneration may be waived by the board if the incident took place on or after August 18, 2007, and was caused by flooding associated with Presidential Declaration of Major Disaster DR-1717.\n(a) The board may issue a letter of intent on whether a person is eligible for payment or reimbursement. The letter is not binding on the board.\n(b) The board must issue an order granting or denying a request within 30 days following the board meeting at which the board votes to grant or deny a request for reimbursement or for payment under subdivision 1, 2, or 3.\n(c) After an initial request is made for reimbursement, notwithstanding subdivisions 1 to 4, the board may deny additional requests for reimbursement.\n(d) An eligible person adversely affected by the board's disapproval of a reimbursement or payment application under paragraph (b) or a partial reimbursement under subdivision 3 may, within 60 days of receipt of the board's order, request a hearing of determination before the board. A request for a hearing must be made in writing and specify the grounds for the request.\n(e) Within 30 days of the receipt of a request for hearing under paragraph (d), the eligible person must be notified either as to the date of the hearing for determination or of the denial of the request for a hearing. A hearing must be scheduled immediately following the next regularly scheduled board meeting as determined by the notification letter.\n(f) If a dispute related to the disapproval of a reimbursement is not resolved after a hearing under paragraph (e) or if a request is denied, the eligible person may appeal the decision as a contested case hearing under chapter 14. A request for a contested case hearing must be submitted in writing to the board within 30 days of the date of the hearing or within 30 days of the receipt of notification of denial of the hearing request under paragraph (e).\n(a) If a person other than a responsible party is paid or reimbursed from the response reimbursement account as a condition of payment or reimbursement, the state is subrogated to the rights of action the person paid or reimbursed has against the responsible party. The commissioner shall collect the amounts from the responsible party and on request of the commissioner on behalf of the board the attorney general shall bring an action to enforce the collection.\n(b) Amounts collected under this subdivision must be credited to the agricultural chemical response and reimbursement account.",
	"repealed": false
}