{
	"id": "469.174",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.174",
	"title": "469.174 DEFINITIONS.",
	"text": "In sections 469.174 to 469.179, the terms defined in this section have the meanings given them herein, unless the context indicates a different meaning.\n\"Authority\" means a rural development financing authority created pursuant to sections 469.142 to 469.151; a housing and redevelopment authority created pursuant to sections 469.001 to 469.047; a port authority created pursuant to sections 469.048 to 469.068; an economic development authority created pursuant to sections 469.090 to 469.108; a redevelopment agency as defined in sections 469.152 to 469.165; a municipality that is administering a development district created pursuant to sections 469.124 to 469.133 or any special law; a municipality that undertakes a project pursuant to sections 469.152 to 469.165, except a town located outside the metropolitan area or with a population of 5,000 persons or less; or a municipality that exercises the powers of a port authority pursuant to any general or special law.\n(a) \"Bonds\" means any bonds or other obligations issued:\n(1) by an authority under section 469.178; or\n(2) in aid of a project under any other law, except revenue bonds issued pursuant to sections 469.152 to 469.165, prior to August 1, 1979.\n(b) Bonds or other obligations include:\n(1) refunding bonds;\n(2) notes;\n(3) interim certificates;\n(4) debentures; and\n(5) interfund loans or advances qualifying under section 469.178, subdivision 7.\n\"Captured net tax capacity\" means the amount by which the current net tax capacity of a tax increment financing district or an extended subdistrict exceeds the original net tax capacity, including the value of property normally taxable as personal property by reason of its location on or over property owned by a tax-exempt entity. In the case of a hazardous substance subdistrict, except an extended subdistrict, \"captured net tax capacity\" means the amount, if any, by which the lesser of (1) the original net tax capacity or (2) the current net tax capacity of the portion of the tax increment financing district overlying the subdistrict exceeds the original net tax capacity of the subdistrict.\n\"Governing body\" means the elected council or board of a municipality.\n\"Municipality\" means the city, however organized, in which the district is located, with the following exceptions:\n(1) for a project undertaken pursuant to sections 469.152 to 469.165, \"municipality\" has the meaning given in sections 469.152 to 469.165; and\n(2) for a project undertaken pursuant to sections 469.142 to 469.151, or a county or multicounty project undertaken pursuant to sections 469.004 to 469.008 or special law, \"municipality\" means the county in which the district is located.\n(a) Except as provided in paragraph (b), \"original net tax capacity\" means the tax capacity of all taxable real property within a tax increment financing district as certified by the commissioner of revenue for the previous assessment year, provided that the request by an authority for certification of a new tax increment financing district or for the expansion of an existing district has been made to the county auditor by June 30. The original tax capacity of districts for which requests are filed after June 30 has an original tax capacity based on the current assessment year. In any case, the original tax capacity must be determined together with subsequent adjustments as set forth in section 469.177, subdivisions 1 and 4. In determining the original net tax capacity the net tax capacity of real property exempt from taxation at the time of the request shall be zero, except for real property which is tax exempt by reason of public ownership by the requesting authority and which has been publicly owned for less than one year prior to the date of the request for certification, in which event the net tax capacity of the property shall be the net tax capacity as most recently determined by the commissioner of revenue.\n(b) The original net tax capacity of any designated hazardous substance site or hazardous substance subdistrict shall be determined as of the date the authority certifies to the county auditor that the authority has entered a redevelopment or other agreement for the removal actions or remedial actions specified in a development response action plan, or otherwise provided funds to finance the development response action plan. The original net tax capacity equals (1) the net tax capacity of the parcel or parcels in the site or subdistrict, as most recently determined by the commissioner of revenue, less (2) the estimated costs of the removal actions and remedial actions as specified in a development response action plan to be undertaken with respect to the parcel or parcels, (3) but not less than zero.\n(c) The original net tax capacity of a hazardous substance site or subdistrict shall be increased by the amount by which it was reduced pursuant to paragraph (b), clause (2), upon certification by the municipality that the cost of the removal and remedial actions specified in the development response action plan, except for long-term monitoring and similar activities, have been paid or reimbursed.\n(d) For purposes of this subdivision, \"real property\" shall include any property normally taxable as personal property by reason of its location on or over publicly owned property.\n\"Project\" means a project as described in section 469.142; an industrial development district as described in section 469.058, subdivision 1; an economic development district as described in section 469.101, subdivision 1; a project as defined in section 469.002, subdivision 12; a development district as defined in section 469.125, subdivision 9, or any special law; or a project as defined in section 469.153, subdivision 2, paragraph (a), (b), or (c).\n\"Tax increment financing district\" or \"district\" means a contiguous or noncontiguous geographic area within a project delineated in the tax increment financing plan, as provided by section 469.175, subdivision 1, for the purpose of financing redevelopment, housing or economic development in municipalities through the use of tax increment generated from the captured net tax capacity in the tax increment financing district.\n(a) \"Redevelopment district\" means a type of tax increment financing district consisting of a project, or portions of a project, within which the authority finds by resolution that one or more of the following conditions, reasonably distributed throughout the district, exists:\n(1) parcels consisting of 70 percent of the area of the district are occupied by buildings, streets, utilities, paved or gravel parking lots, or other similar structures and more than 50 percent of the buildings, not including outbuildings, are structurally substandard to a degree requiring substantial renovation or clearance;\n(2) the property consists of vacant, unused, underused, inappropriately used, or infrequently used rail yards, rail storage facilities, or excessive or vacated railroad rights-of-way;\n(3) tank facilities, or property whose immediately previous use was for tank facilities, as defined in section 115C.02, subdivision 15, if the tank facilities:\n(i) have or had a capacity of more than 1,000,000 gallons;\n(ii) are located adjacent to rail facilities; and\n(iii) have been removed or are unused, underused, inappropriately used, or infrequently used; or\n(4) a qualifying disaster area, as defined in subdivision 10b.\n(b) For purposes of this subdivision, \"structurally substandard\" shall mean containing defects in structural elements or a combination of deficiencies in essential utilities and facilities, light and ventilation, fire protection including adequate egress, layout and condition of interior partitions, or similar factors, which defects or deficiencies are of sufficient total significance to justify substantial renovation or clearance.\n(c) A building is not structurally substandard if it is in compliance with the building code applicable to new buildings or could be modified to satisfy the building code at a cost of less than 15 percent of the cost of constructing a new structure of the same square footage and type on the site. The municipality may find that a building is not disqualified as structurally substandard under the preceding sentence on the basis of reasonably available evidence, such as the size, type, and age of the building, the average cost of plumbing, electrical, or structural repairs, or other similar reliable evidence. The municipality may not make such a determination without an interior inspection of the property, but need not have an independent, expert appraisal prepared of the cost of repair and rehabilitation of the building. An interior inspection of the property is not required, if the municipality finds that (1) the municipality or authority is unable to gain access to the property after using its best efforts to obtain permission from the party that owns or controls the property; and (2) the evidence otherwise supports a reasonable conclusion that the building is structurally substandard. Items of evidence that support such a conclusion include recent fire or police inspections, on-site property tax appraisals or housing inspections, exterior evidence of deterioration, or other similar reliable evidence. Written documentation of the findings and reasons why an interior inspection was not conducted must be made and retained under section 469.175, subdivision 3, clause (1). Failure of a building to be disqualified under the provisions of this paragraph is a necessary, but not a sufficient, condition to determining that the building is substandard.\n(d) A parcel is deemed to be occupied by a structurally substandard building for purposes of the finding under paragraph (a) or by the improvements described in paragraph (e) if all of the following conditions are met:\n(1) the parcel was occupied by a substandard building or met the requirements of paragraph (e), as the case may be, within three years of the filing of the request for certification of the parcel as part of the district with the county auditor;\n(2) the substandard building or the improvements described in paragraph (e) were demolished or removed by the authority or the demolition or removal was financed by the authority or was done by a developer under a development agreement with the authority;\n(3) the authority found by resolution before the demolition or removal that the parcel was occupied by a structurally substandard building or met the requirements of paragraph (e) and that after demolition and clearance the authority intended to include the parcel within a district; and\n(4) upon filing the request for certification of the tax capacity of the parcel as part of a district, the authority notifies the county auditor that the original tax capacity of the parcel must be adjusted as provided by section 469.177, subdivision 1, paragraph (f).\n(e) For purposes of this subdivision, a parcel is not occupied by buildings, streets, utilities, paved or gravel parking lots, or other similar structures unless 15 percent of the area of the parcel contains buildings, streets, utilities, paved or gravel parking lots, or other similar structures.\n(f) For districts consisting of two or more noncontiguous areas, each area must qualify as a redevelopment district under paragraph (a) to be included in the district, and the entire area of the district must satisfy paragraph (a).\n(a) \"Renewal and renovation district\" means a type of tax increment financing district consisting of a project, or portions of a project, within which the authority finds by resolution that:\n(1)(i) parcels consisting of 70 percent of the area of the district are occupied by buildings, streets, utilities, paved or gravel parking lots, or other similar structures; (ii) 20 percent of the buildings are structurally substandard; and (iii) 30 percent of the other buildings require substantial renovation or clearance to remove existing conditions such as: inadequate street layout, incompatible uses or land use relationships, overcrowding of buildings on the land, excessive dwelling unit density, obsolete buildings not suitable for improvement or conversion, or other identified hazards to the health, safety, and general well-being of the community; and\n(2) the conditions described in clause (1) are reasonably distributed throughout the geographic area of the district.\n(b) For purposes of determining whether a building is structurally substandard, whether parcels are occupied by buildings, streets, utilities, paved or gravel parking lots, or other similar structures, or whether noncontiguous areas qualify, the provisions of subdivision 10, paragraphs (b) through (f), apply.\nA \"qualified disaster area\" is an area that meets the following requirements:\n(1) parcels consisting of 70 percent of the area of the district were occupied by buildings, streets, utilities, paved or gravel parking lots, or other similar structures immediately before the disaster or emergency;\n(2) the area of the district was subject to a disaster or emergency, as defined in section 273.1231, subdivision 2, within the 18-month period ending on the day the request for certification of the district is made; and\n(3) 50 percent or more of the buildings in the area have suffered substantial damage as a result of the disaster or emergency.\nMS 2013 Supp [Repealed, 2014 c 308 art 9 s 94]\n\"Housing district\" means a type of tax increment financing district which consists of a project, or a portion of a project, intended for occupancy, in part, by persons or families of low and moderate income, as defined in chapter 462A, Title II of the National Housing Act of 1934, the National Housing Act of 1959, the United States Housing Act of 1937, as amended, Title V of the Housing Act of 1949, as amended, any other similar present or future federal, state, or municipal legislation, or the regulations promulgated under any of those acts, and that satisfies the requirements of section 469.1761. Housing project means a project, or a portion of a project, that meets all of the qualifications of a housing district under this subdivision, whether or not actually established as a housing district.\n\"Economic development district\" means a type of tax increment financing district which consists of any project, or portions of a project, which the authority finds to be in the public interest because:\n(1) it will discourage commerce, industry, or manufacturing from moving their operations to another state or municipality;\n(2) it will result in increased employment in the state;\n(3) it will result in preservation and enhancement of the tax base of the state; or\n(4) it satisfies the requirements of a workforce housing project under section 469.176, subdivision 4c, paragraph (d).\nMS 1998 [Repealed, 2000 c 490 art 11 s 44]\n(a) \"Administrative expenses\" or \"administrative costs\" means documented expenditures of an authority or municipality, including but not limited to:\n(1) amounts paid for services provided by bond counsel, fiscal consultants, and economic development consultants;\n(2) allocated expenses and staff time of the authority or municipality for administering a project, including but not limited to preparing the tax increment financing plan, negotiating and preparing agreements, accounting for segregated funds of the district, preparing and submitting required reporting for the district, and reviewing and monitoring compliance with sections 469.174 to 469.1794;\n(3) amounts paid to publish annual disclosures and provide notices under section 469.175;\n(4) amounts to provide for the usual and customary maintenance and operation of properties purchased with tax increments, including necessary reserves for repairs and the cost of any insurance;\n(5) amounts allocated or paid to prepare a development action response plan for a soils condition district or hazardous substance subdistrict; and\n(6) amounts used to pay bonds, interfund loans, or other financial obligations to the extent those obligations were used to finance costs described in clauses (1) to (5).\n(b) Administrative expenses and administrative costs do not include:\n(1) amounts paid for the purchase of land or buildings;\n(2) amounts paid to contractors or others providing materials and services directly connected with the physical development of the real property in the project, including architectural and engineering services and materials and services for demolition, soil correction, and the construction or installation of public improvements;\n(3) relocation benefits paid to or services provided for persons residing or businesses located in the project;\n(4) amounts paid for property taxes or payments in lieu of taxes; and\n(5) amounts used to pay principal or interest on, fund a reserve for, or sell at a discount bonds issued pursuant to section 469.178 or other financial obligations to the extent those obligations were used to finance costs described in clauses (1) to (4).\nThis definition does not apply to administrative expenses or administrative costs referenced under section 469.176, subdivision 4h.\n\"Parcel\" means a tract or plat of land established prior to the certification of the district as a single unit for purposes of assessment.\n\"Designated hazardous substance site\" means any parcel or parcels with respect to which the authority has certified to the county auditor that the authority has entered into a redevelopment or other agreement providing for the removal actions or remedial actions specified in a development response action plan or the authority will use other available money, including without limitation tax increments, to finance the removal or remedial actions. A parcel described in the plan or plan amendment may be designated for inclusion in the hazardous substance subdistrict prior to approval of the development action response plan on the basis of the reasonable expectation of the municipality. Such parcel may not be certified as part of the subdistrict until the development action response plan has been approved.\n\"Development action response plan\" means a plan or proposal for removal actions or remedial actions if the plan or proposal is submitted to the Pollution Control Agency and the actions recommended in the plan or proposal are approved in writing by the commissioner of the agency as reasonable and necessary to protect the public health, welfare, and environment. The commissioner shall review the development action response plan and approve, modify, or reject the recommended actions within 60 days after submission of the plan (or revised plan) by the authority. The commissioner shall notify the authority in writing of the decision on the recommended actions within 30 days after the decision and, if the recommended actions are rejected, shall specify the reasons for rejection.\nThe terms \"removal,\" \"remedy,\" \"remedial action,\" \"response,\" \"hazardous substance,\" and \"pollutant or contaminant\" have the meanings given in section 115B.02. The term \"petroleum\" has the meaning given in section 115C.02.\n(a) \"Soils condition district\" means a type of tax increment financing district consisting of a project, or portions of a project, within which the authority finds by resolution that the following conditions exist:\n(1) the presence of hazardous substances, pollution, or contaminants requires removal or remedial action for use;\n(2) the estimated cost of the proposed removal and remedial action exceeds the fair market value of the land before completion of the preparation.\nThe requirements of clause (2) need not be satisfied, if each parcel of property in the district either satisfies the requirements of clause (2) or the estimated costs of the proposed removal or remedial action exceeds $2 per square foot for the area of the parcel.\n(b) The proposed removal or remediation action must be specified in a development action response plan to satisfy the requirements of paragraph (a).\n\"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended.\n\"Credit enhanced bonds\" means special obligation bonds that are:\n(1) payable primarily from tax increments (i) derived from a tax increment financing district within which the activity, as defined in section 469.1763, subdivision 1, financed by at least the applicable in-district percentage of the bond proceeds is located and (ii) estimated on the date of issuance to be sufficient to pay when due the debt service on the bonds, and\n(2) further secured by tax increments (i) derived from one or more tax increment financing districts and (ii) determined by the issuer to be necessary in order to make the marketing of the bonds feasible.\nFor purposes of this subdivision, \"applicable in-district percentage\" means the percentage under section 469.1763, subdivision 2, for the district.\n\"Tourism facility\" means property that:\n(1) is located in a county where the median income is no more than 85 percent of the state median income;\n(2) is located in a county in development region 1, 2, 3, 4, 5, or 7E, as defined in section 462.385;\n(3) is not located in a city with a population in excess of 20,000; and\n(4) is acquired, constructed, or rehabilitated for use as a convention and meeting facility that is privately owned, marina, hotel, motel, lodging facility, or nonhomestead dwelling unit that in each case is intended to serve primarily individuals from outside the county.\n\"Hazardous substance subdistrict\" or \"subdistrict\" means a hazardous substance subdistrict created under section 469.175, subdivision 7.\n\"Extended subdistrict\" means a hazardous substance subdistrict, but only for any period during which the subdistrict remains in effect after the overlying tax increment district has terminated.\n\"Increment,\" \"tax increment,\" \"tax increment revenues,\" \"revenues derived from tax increment,\" and other similar terms for a district include:\n(1) taxes paid by the captured net tax capacity, but excluding any excess taxes, as computed under section 469.177;\n(2) the proceeds from the sale or lease of property, tangible or intangible, to the extent the property was purchased by the authority with tax increments;\n(3) principal and interest received on loans or other advances made by the authority with tax increments;\n(4) interest or other investment earnings on or from tax increments; and\n(5) repayments or return of tax increments made to the authority under agreements for districts for which the request for certification was made after August 1, 1993.\n\"Population\" means the population established as of December 31 by the most recent of the following:\n(1) the federal census;\n(2) a special census conducted under contract with the United States Bureau of the Census;\n(3) a population estimate made by the Metropolitan Council; and\n(4) a population estimate made by the state demographer under section 4A.02.\nThe population so established applies to the following calendar year.\n\"Small city\" means any home rule charter or statutory city that has a population of 5,000 or less and that is located five miles or more from a home rule charter or statutory city, located in this state, with a population of 10,000 or more. For purposes of this definition, the distance between cities is measured by drawing a straight line from the nearest boundaries of the two cities.\n\"Decertify\" or \"decertification\" means the termination of a tax increment financing district which occurs when the county auditor removes all remaining parcels from the district.\nMS 2006 [Repealed, 2008 c 154 art 9 s 25]\n\"Pay-as-you-go contract and note\" means a written note or contractual obligation under which all of the following apply:\n(1) the note or contractual obligation evidences an authority's commitment to reimburse a developer, property owner, or note holder for the payment of costs of activities, including any interest on unreimbursed costs;\n(2) the reimbursement is made from tax increment revenues identified in the note or contractual obligation as received by a municipality or authority as taxes are paid; and\n(3) the risk that available tax increments may be insufficient to fully reimburse the costs is borne by the developer, property owner, or note holder.",
	"repealed": false
}