{
	"id": "122A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.28",
	"title": "122A.28 TEACHERS OF DEAF AND HARD-OF-HEARING STUDENTS; LICENSURE REQUIREMENTS.",
	"text": "(a) The Professional Educator Licensing and Standards Board must review and determine appropriate licensure requirements for an applicant for a license or an applicant for a continuing license to teach deaf and hard-of-hearing students in prekindergarten through grade 12. In addition to other requirements, an applicant must demonstrate the minimum level of proficiency in American sign language as determined by the board.\n(b) Among other relicensure requirements, each teacher under this section must complete 30 continuing education clock hours on hearing loss topics, including American Sign Language, American Sign Language linguistics, or deaf culture, in each licensure renewal period.\n(a) The Professional Educator Licensing and Standards Board shall adopt a separate licensure rule for an applicant for a license or an applicant for a continuing license to teach in oral/aural deaf education programs or to provide services, including itinerant oral/aural deaf education services, to deaf and hard-of-hearing students in prekindergarten through grade 12.\n(b) The board shall design rule requirements for teaching oral/aural deaf education in collaboration with representatives of parents and educators of deaf and hard-of-hearing students, postsecondary programs preparing teachers of deaf and hard-of-hearing students, and the Department of Education.\n(c) Rule requirements for teaching oral/aural deaf education shall reflect best practice research in oral/aural deaf education. Advanced competencies in teaching deaf and hard-of-hearing students through oral/aural modes shall be included.\n(d) Licensure requirements for teachers of oral/aural deaf education must include minimum competency in American sign language, but are not subject to the guidelines established in Laws 1993, chapter 224, article 3, section 32, as amended by Laws 1998, chapter 398, article 2, section 47. The signed communication proficiency interview shall not be required for teachers licensed to teach deaf and hard-of-hearing students through oral/aural deaf education methods.\n(e) Requirements for teachers or oral/aural deaf education shall include appropriate continuing education requirements for renewing this licensure.",
	"repealed": false
}