{
	"id": "518.1781",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.1781",
	"title": "518.1781 SIX-MONTH REVIEW.",
	"text": "(a) A request for a six-month review hearing form must be attached to a decree of dissolution or legal separation or an order that initially establishes child custody, parenting time, or support rights and obligations of parents. The state court administrator is requested to prepare the request for review hearing form. The form must include information regarding the procedures for requesting a hearing, the purpose of the hearing, and any other information regarding a hearing under this section that the state court administrator deems necessary.\n(b) The six-month review hearing shall be held if any party submits a written request for a hearing within six months after entry of a decree of dissolution or legal separation or order that establishes child custody, parenting time, or support.\n(c) Upon receipt of a completed request for hearing form, the court administrator shall provide notice of the hearing to all other parties and the public authority. The court administrator shall schedule the six-month review hearing as soon as practicable following the receipt of the hearing request form.\n(d) At the six-month hearing, the court must review:\n(1) whether child support is current; and\n(2) whether both parties are complying with the parenting time provisions of the order.\n(e) At the six-month hearing, the obligor has the burden to present evidence to establish that child support payments are current. A party may request that the public authority provide information to the parties and court regarding child support payments. A party must request the information from the public authority at least 14 days before the hearing. The commissioner of children, youth, and families must develop a form to be used by the public authority to submit child support payment information to the parties and court.\n(f) Contempt of court and all statutory remedies for child support and parenting time enforcement may be imposed by the court at the six-month hearing for noncompliance by either party pursuant to this chapter, chapters 518A and 588, and the Minnesota Court Rules.\n(g) A request for a six-month review hearing form must be attached to a decree or order signed on or after January 1, 2007, that initially establishes child support rights and obligations.",
	"repealed": false
}