{
	"id": "349.213",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.213",
	"title": "349.213 LOCAL AUTHORITY.",
	"text": "(a) A statutory or home rule city or county has the authority to adopt more stringent regulation of lawful gambling within its jurisdiction, including the prohibition of lawful gambling.\n(b) A statutory or home rule city or county may require a permit for the conduct of gambling exempt from licensing under section 349.166. The fee for a permit issued under section 349.166 may not exceed $100.\n(c) The authority granted by this subdivision does not include the authority to require a license or fee for a license or permit to conduct gambling by organizations, gambling managers, gambling employees, or sales by distributors or linked bingo game providers licensed by or registered with the board.\n(d) The authority granted by this subdivision does not include the authority to require an organization to make specific expenditures of more than ten percent per year from its net profits derived from lawful gambling.\n(e) For the purposes of this subdivision, net profits are gross profits less amounts expended for allowable expenses and paid in taxes assessed on lawful gambling.\n(f) A statutory or home rule charter city or a county may not require an organization conducting lawful gambling within its jurisdiction to make an expenditure to the city or county as a condition to operate within that city or county, except:\n(1) as authorized under section 349.16, subdivision 8, or 297E.02; or\n(2) by an ordinance requirement that such organizations must contribute ten percent per year of their net profits derived from lawful gambling conducted at premises within the city's or county's jurisdiction to a fund administered and regulated by the responsible local unit of government without cost to such fund. The funds must be disbursed by the local unit of government for (i) charitable contributions as defined in section 349.12, subdivision 7a, or (ii) police, fire, and other emergency or public safety-related services, equipment, and training, excluding pension obligations. A contribution made by an organization is not considered an expenditure to the city or county nor a tax under section 297E.02, and is valid and lawful. A city or county receiving and making expenditures authorized under this clause must by March 15 of each year file a report with the board, on a form the board prescribes, that lists all such revenues collected, interest received on fund balances, and expenditures for the previous calendar year. A home rule or statutory city or county making charitable contributions authorized under this clause must acknowledge financial contributions of organizations conducting lawful gambling to the community and to the recipients of the funds. This may occur in communications about the funds as well as in the distribution of funds.\n(g) A statutory or home rule city or county may by ordinance require that a licensed organization conducting lawful gambling within its jurisdiction expend all or a portion of its expenditures for lawful purposes on lawful purposes conducted or located within the city's or county's trade area. Such an ordinance must be limited to lawful purpose expenditures of gross profits derived from lawful gambling conducted at premises within the city's or county's jurisdiction, must define the city's or county's trade area, and must specify the percentage of lawful purpose expenditures which must be expended within the trade area. A trade area defined by a city under this subdivision must include each city and township contiguous to the defining city.\n(h) A more stringent regulation or prohibition of lawful gambling adopted by a political subdivision under this subdivision must apply equally to all forms of lawful gambling within the jurisdiction of the political subdivision, except a political subdivision may prohibit the use of paddlewheels.\nThe board may not issue an initial premises permit unless approval is received from:\n(1) the city council of the statutory or home rule city in which the organization's premises is located; or\n(2) the county board of the county where the premises is located.\nThe organization must submit a resolution from the city council or county board approving the premises permit. The resolution must have been adopted within 90 days of the date of application for the new permit.\nA statutory or home rule charter city that has one or more licensed organizations operating lawful gambling, and a county that has one or more licensed organizations outside incorporated areas operating lawful gambling, may impose a local gambling tax on each licensed organization within the city's or county's jurisdiction. The tax may be imposed only if the amount to be received by the city or county is necessary to cover the costs incurred by the city or county to regulate lawful gambling. The tax imposed by this subdivision may not exceed three percent per year of the gross receipts of a licensed organization from all lawful gambling less prizes actually paid out by the organization. A city or county may not use money collected under this subdivision for any purpose other than to regulate lawful gambling. All documents pertaining to site inspections, fines, penalties, or other corrective action involving local lawful gambling regulation must be shared with the board within 30 days of filing at the city or county of jurisdiction. A tax imposed under this subdivision is in lieu of all other local taxes and local investigation fees on lawful gambling. A city or county that imposes a tax under this subdivision shall annually, by March 15, file a report with the board in a form prescribed by the board showing (1) the amount of revenue produced by the tax during the preceding calendar year, and (2) the use of the proceeds of the tax.",
	"repealed": false
}