{
	"id": "272.029",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.029",
	"title": "272.029 WIND ENERGY PRODUCTION TAX.",
	"text": "A tax is imposed on the production of electricity from a wind energy conversion system installed after January 1, 1991, and used as an electric power source.\n(a) For the purposes of this section:\n(1) \"wind energy conversion system\" has the meaning given in section 216C.06, subdivision 19, and also includes a substation that is used and owned by one or more wind energy conversion facilities;\n(2) \"large scale wind energy conversion system\" means a wind energy conversion system of more than 12 megawatts, as measured by the nameplate capacity of the system or as combined with other systems as provided in paragraph (b);\n(3) \"medium scale wind energy conversion system\" means a wind energy conversion system of over two and not more than 12 megawatts, as measured by the nameplate capacity of the system or as combined with other systems as provided in paragraph (b); and\n(4) \"small scale wind energy conversion system\" means a wind energy conversion system of two megawatts and under, as measured by the nameplate capacity of the system or as combined with other systems as provided in paragraph (b).\n(b) For systems installed and contracted for after January 1, 2002, the total size of a wind energy conversion system under this subdivision shall be determined according to this paragraph. Unless the systems are interconnected with different distribution systems, the nameplate capacity of one wind energy conversion system shall be combined with the nameplate capacity of any other wind energy conversion system that is:\n(1) located within five miles of the wind energy conversion system;\n(2) constructed within the same 12-month period as the wind energy conversion system; and\n(3) under common ownership.\nIn the case of a dispute, the commissioner of commerce shall determine the total size of the system, and shall draw all reasonable inferences in favor of combining the systems.\nFor the purposes of making a determination under this paragraph, the original construction date of an existing wind energy conversion system is not changed if the system is replaced, repaired, or otherwise maintained or altered.\n(c) In making a determination under paragraph (b), the commissioner of commerce may determine that two wind energy conversion systems are under common ownership when the underlying ownership structure contains similar persons or entities, even if the ownership shares differ between the two systems. Wind energy conversion systems are not under common ownership solely because the same person or entity provided equity financing for the systems.\n(a) The owner of a wind energy conversion system shall pay a tax based on the following schedule:\n(1) for a large scale wind energy conversion system, .12 cents per kilowatt-hour of electricity produced by the system;\n(2) for a medium scale wind energy conversion system, .036 cents per kilowatt-hour of electricity produced by the system; and\n(3) for a small scale wind energy conversion system of two megawatts or less, but greater than .25 megawatts capacity, .012 cents per kilowatt-hour of electricity produced by the system.\n(b) Small scale wind energy conversion systems with the capacity of .25 megawatts or less, and small scale wind energy conversion systems with a capacity of two megawatts or less that are owned by a political subdivision, are exempt from the wind energy production tax.\n(a) An owner of a wind energy conversion system subject to tax under subdivision 3 shall file a report with the commissioner of revenue annually on or before January 15 detailing the amount of electricity in kilowatt-hours that was produced by the wind energy conversion system for the previous calendar year. The commissioner shall prescribe the content, format, and manner of the report pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws. The report must contain the information required by the commissioner to determine the tax due to each county under this section for the current year. If an owner of a wind energy conversion system subject to taxation under this section fails to file the report by the due date, the commissioner of revenue shall determine the tax based upon the nameplate capacity of the system multiplied by a capacity factor of 60 percent.\n(b) If a report is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws.\n(c) On or before February 28, the commissioner of revenue shall notify the owner of the wind energy conversion systems of the tax due to each county for the current year and shall certify to the county auditor of each county in which the systems are located the tax due from each owner for the current year.\nIf the commissioner of revenue determines that the amount of production tax has been erroneously calculated, the commissioner may correct the error. The commissioner must notify the owner of the wind energy conversion system of the correction and the amount of tax due to each county and must certify the correction to the county auditor of each county in which the system is located on or before April 1 of the current year. The commissioner may correct errors that are merely clerical in nature until December 31.\nThe amount of production tax determined under subdivision 4 must be paid to the county treasurer at the time and in the manner provided for payment of property taxes under section 277.01, subdivision 3, and, if unpaid, is subject to the same enforcement, collection, and interest and penalties as delinquent personal property taxes. Except to the extent inconsistent with this section, the provisions of sections 277.01 to 277.24 and 278.01 to 278.13 apply to the taxes imposed under this section, and for purposes of those provisions, the taxes imposed under this section are considered personal property taxes.\nRevenues from the taxes imposed under subdivision 5 must be part of the settlement between the county treasurer and the county auditor under section 276.09. The revenue must be distributed by the county auditor or the county treasurer to local taxing jurisdictions in which the wind energy conversion system is located as follows: 80 percent to counties and 20 percent to cities and townships.\nThe county auditor, on the first Wednesday after such settlement, shall report to the commissioner the amount distributed to each school district under subdivision 6.\nThe tax imposed under this section does not apply to electricity produced by wind energy conversion systems located in a job opportunity building zone for the duration of the zone. The exemption applies beginning for the first calendar year after designation of the zone and applies to each calendar year that begins during the designation of the zone. The exemption only applies if the owner of the system is a qualified business under section 469.310, subdivision 11, who has entered into a business subsidy agreement that covers the land on which the system is situated.\nThe commissioner may, for good cause, extend the time for filing the report required by subdivision 4. The extension must not exceed 15 days.",
	"repealed": false
}