{
	"id": "18E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/18E.02",
	"title": "18E.02 DEFINITIONS.",
	"text": "The definitions contained in this section apply to this chapter. Except for terms defined in this section, the definitions contained in chapters 18B, 18C, and 18D apply to this chapter.\n\"Account\" means the agricultural chemical response and reimbursement account.\n\"Agricultural chemical\" means pesticide, fertilizer, plant amendment, or soil amendment but does not include nitrate and related nitrogen from a natural source.\n\"Board\" means the Agricultural Chemical Response Compensation Board.\n\"Eligible person\" means:\n(1) a responsible party or an owner of real property, but does not include the state, a state agency, or a political subdivision of the state, except as provided in clause (2); common carriers, as defined by section 218.011, subdivision 10; motor carriers as defined by section 221.012, subdivision 25, while transporting agricultural chemicals except as provided in clause (3); or the federal government or an agency of the federal government;\n(2) the owners of municipal airports in Minnesota where a licensed aerial pesticide applicator has caused an incident through storage, handling, or distribution operations for agricultural chemicals if (i) the commissioner has determined that corrective action is necessary and (ii) the commissioner determines, and the Agricultural Chemical Response Compensation Board concurs, that based on an affirmative showing made by the owner, a responsible party cannot be identified or the identified responsible party is unable to comply with an order for corrective action; or\n(3) a person involved in a transaction relating to real property who is not a responsible party or owner of the real property and who voluntarily takes corrective action on the property in response to a request or order for corrective action from the commissioner.\n\"Emergency incident\" means an incident resulting from a flood, fire, tornado, transportation accident, storage container rupture, or other event as determined by the commissioner that immediately, uncontrollably, and unpredictably releases agricultural chemicals into the environment and that may cause unreasonable adverse effects on the public health or the environment.\n\"Recontamination\" means an agricultural chemical incident that occurs in a specific land area where corrective actions were taken to address a previous incident. Recontamination does not include an emergency incident.\n\"Single site\" for purposes of this chapter means all land and water areas, including air space, and all plants, animals, structures, buildings, contrivances, and machinery whether fixed or mobile including anything used for transportation within a one-half mile radius of a discovered or reported incident where agricultural chemical handling, storage, disposal, and distribution activities have occurred or are now occurring.\n\"Incident\" means a flood, fire, tornado, transportation accident, storage container rupture, leak, spill, emission discharge, escape, disposal, or other event that releases an agricultural chemical accidentally or otherwise into the environment and may cause unreasonable adverse effects on the environment. Incident does not include a release from the normal use of a product or practice in accordance with law.",
	"repealed": false
}