{
	"id": "289A.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.381",
	"title": "289A.381 DEFINITIONS; PARTNERSHIPS; FEDERAL ADJUSTMENTS.",
	"text": "Unless otherwise specified, the definitions in this section apply for the purposes of sections 289A.38, subdivisions 7 to 9, 289A.381, and 289A.382.\n\"Administrative adjustment request\" means an administrative adjustment request filed by a partnership under section 6227 of the Internal Revenue Code.\n\"Audited partnership\" means a partnership subject to a federal adjustment resulting from a partnership-level audit.\n\"Corporate partner\" means a partner that is subject to tax under section 290.02.\n\"Direct partner\" means a partner that holds an immediate legal ownership interest in a partnership or pass-through entity.\n\"Exempt partner\" means a partner that is exempt from taxes on its net income under section 290.05, subdivision 1.\n\"Federal adjustment\" means any change in an amount calculated under the Internal Revenue Code, whether to income, gross estate, a credit, an item of preference, or any other item that is used by a taxpayer to compute a tax administered under this chapter for the reviewed year whether that change results from action by the Internal Revenue Service or other competent authority, including a partnership-level audit, or from the filing of an amended federal return, federal refund claim, or an administrative adjustment request by the taxpayer. A federal adjustment is positive to the extent that it increases taxable income as determined under section 290.01, subdivision 29, and is negative to the extent that it decreases taxable income as determined under section 290.01, subdivision 29.\n\"Federal adjustments report\" includes a method or form prescribed by the commissioner for use by a taxpayer to report federal adjustments, including an amended Minnesota tax return or a uniform multistate report.\n\"Federal partnership representative\" means the person the partnership designates for the taxable year as the partnership's representative, or the person the Internal Revenue Service has appointed to act as the partnership representative, pursuant to section 6223(a) of the Internal Revenue Code.\n\"Final determination date\" means:\n(1) for a federal adjustment arising from an audit by the Internal Revenue Service or other competent authority, the first day on which no federal adjustment arising from that audit remains to be finally determined, whether by agreement, or, if appealed or contested, by a final decision with respect to which all rights of appeal have been waived or exhausted;\n(2) for a federal adjustment arising from an audit or other action by the Internal Revenue Service or other competent authority, if the taxpayer filed as a member of a combined report under section 290.17, subdivision 4, the first day on which no related federal adjustments arising from that audit remain to be finally determined as described in clause (1) for the entire combined group;\n(3) for a federal adjustment arising from the filing of an amended federal return, a federal refund claim, or the filing by a partnership of an administrative adjustment request, the date on which the amended return, refund claim, or administrative adjustment request was filed; or\n(4) for agreements required to be signed by the Internal Revenue Service and the taxpayer, the date on which the last party signed the agreement.\n\"Final federal adjustment\" means a federal adjustment after the final determination date for that federal adjustment has passed.\n\"Indirect partner\" means either:\n(1) a partner in a partnership or pass-through entity that itself holds an immediate legal ownership interest in another partnership or pass-through entity; or\n(2) a partner in a partnership or pass-through entity that holds an indirect interest in another partnership or pass-through entity through another indirect partner.\n\"Partner\" means a person that holds an interest directly or indirectly in a partnership or other pass-through entity.\n\"Partnership\" has the meaning provided under section 7701(a)(2) of the Internal Revenue Code.\n\"Partnership-level audit\" means an examination by the Internal Revenue Service at the partnership level pursuant to subtitle F, chapter 63, subchapter C, of the Internal Revenue Code, which results in federal adjustments and adjustments to partnership-related items.\n\"Pass-through entity\" means an entity, other than a partnership, that is not subject to the tax imposed under section 290.02. The term pass-through entity includes but is not limited to S corporations, estates, and trusts other than grantor trusts.\n\"Resident partner\" means an individual, trust, or estate partner who is a resident of Minnesota under section 290.01, subdivision 7, 7a, or 7b, for the relevant tax period.\n\"Reviewed year\" means the taxable year of a partnership that is subject to a partnership-level audit from which federal adjustments arise.\n\"Tiered partner\" means any partner that is a partnership or pass-through entity.\n\"Unrelated business taxable income\" has the meaning provided under section 512 of the Internal Revenue Code.",
	"repealed": false
}