{
	"id": "103B.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.215",
	"title": "103B.215 BOUNDARY CHANGE OF WATERSHED DISTRICTS.",
	"text": "The boundaries of a watershed district wholly within the metropolitan area may be changed pursuant to this section or chapter 103D.\n(a) The governing board of a watershed management organization may petition the Board of Water and Soil resources for an order changing the boundaries of a watershed district wholly within the metropolitan area, by adding new territory to the district or by transferring territory that is within the district to the jurisdiction of another watershed management organization.\n(b) The petition must:\n(1) describe with particularity the change in boundary requested, the territory affected, and the reasons for the change;\n(2) show that the change is consistent with the purposes and requirements of sections 103B.205 to 103B.255; and\n(3) identify property subject to section 103B.225.\n(c) The petition must be accompanied by a written statement of concurrence in the petition from the governing body of each statutory or home rule charter city and town and each watershed management organization having jurisdiction over the territory proposed to be added or transferred.\n(a) Upon the filing of a sufficient petition, the board shall give notice of the filing of the petition by publication once each week for two successive weeks in a legal newspaper in each county affected and by mail to the county auditor of each county affected and to the chief official of each statutory or home rule charter city and township affected.\n(b) The notice must describe the action proposed by the petition and invite written comments on the petition for consideration by the board. The notice must announce that any person who objects to the action proposed in the petition may submit a written request for hearing to the board within 20 days of the last publication of the notice of the filing of the petition, and that if no timely request for hearing is received the board will make a decision on the petition pursuant to this subdivision without conducting the public hearing required under chapter 103D.\n(a) If a timely request for hearing is not received, the board shall make a decision on the petition without a hearing within 30 days after the last publication of the notice.\n(b) If one or more timely requests for hearing are received the board shall hold a hearing on the petition and shall follow the procedures in chapter 103D regarding notice and conduct of hearings.\n(c) After completing the procedures required by this subdivision, the board shall, by its findings and order, make the boundary change requested if the board determines that:\n(1) the governing body of each statutory or home rule charter city and town and each watershed management organization having jurisdiction over the territory proposed to be added or transferred concurs in the petition;\n(2) the change is consistent with the purposes and requirements of sections 103B.205 to 103B.255; and\n(3) the change can be accomplished in conformance with section 103B.225.\n(d) The board shall file a certified copy of the findings and order with the secretary of state. The order making the change must conform to section 103B.225. The order making the change may amend the order prescribing the distribution of managers of the district.",
	"repealed": false
}