{
	"id": "148.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.06",
	"title": "148.06 APPLICATION; EXAMINATION; LICENSE; FEE.",
	"text": "No person shall practice chiropractic in this state without first being licensed by the state Board of Chiropractic Examiners. The applicant shall have earned at least one-half of all academic credits required for awarding of a baccalaureate degree from the University of Minnesota, or other university, college, or community college of equal standing, in subject matter determined by the board, and taken a four-year resident course of at least eight months each in a school or college of chiropractic or in a chiropractic program that is accredited by the Council on Chiropractic Education, is accredited by an agency approved by the United States Office of Education or their successors as of January 1, 1988, or is approved by a Council on Chiropractic Education member organization of the Council on Chiropractic International. The board may issue licenses to practice chiropractic without compliance with prechiropractic or academic requirements listed above if in the opinion of the board the applicant has the qualifications equivalent to those required of other applicants, the applicant satisfactorily passes written and practical examinations as required by the Board of Chiropractic Examiners, and the applicant is a graduate of a college of chiropractic approved by a Council on Chiropractic Education member organization of the Council on Chiropractic International. The board may recommend a two-year prechiropractic course of instruction to any university, college, or community college which in its judgment would satisfy the academic prerequisite for licensure as established by this section.\nAn examination for a license shall be in writing and shall include testing in:\n(a) The basic sciences including but not limited to anatomy, physiology, bacteriology, pathology, hygiene, and chemistry as related to the human body or mind;\n(b) The clinical sciences including but not limited to the science and art of chiropractic, chiropractic physiotherapy, diagnosis, roentgenology, and nutrition; and\n(c) Professional ethics and any other subjects that the board may deem advisable.\nThe board may consider a valid certificate of examination from the National Board of Chiropractic Examiners as evidence of compliance with the examination requirements of this subdivision. The applicant shall be required to give practical demonstration in vertebral palpation, neurology, adjusting and any other subject that the board may deem advisable. A license, countersigned by the members of the board and authenticated by the seal thereof, shall be granted to each applicant who correctly answers 75 percent of the questions propounded in each of the subjects required by this subdivision and meets the standards of practical demonstration established by the board. Each application shall be accompanied by a fee set by the board. The fee shall not be returned but the applicant may, within one year, apply for examination without the payment of an additional fee. The board may grant a license to an applicant who holds a valid license to practice chiropractic issued by the appropriate licensing board of another state, provided the applicant meets the other requirements of this section and satisfactorily passes a practical examination approved by the board. The burden of proof is on the applicant to demonstrate these qualifications or satisfaction of these requirements.\n[Repealed, 1976 c 222 s 209]",
	"repealed": false
}