{
	"id": "383B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.28",
	"title": "383B.28 HUMAN RESOURCES BOARD.",
	"text": "The Hennepin County Human Resources Board and Human Resources Department are created.\n(a) The county board shall by majority vote appoint seven persons to serve for four-year terms. As the term of each member expires, the board of county commissioners shall by majority vote fill the vacancy for a term of four years.\n(b) The expiration date of all expiring terms shall be January 2.\n(c) Any vacancies shall be filled by majority vote of the county board for the unexpired term.\n(d) Each member shall take an oath of office before assuming the duties of office.\n(e) Each member shall hold office until a successor has been appointed and qualified.\n(f) No person shall be appointed or be a member of the board while holding any public office or having filed as a candidate for any office.\n(g) No person shall be appointed or be a member of the board while holding or within one year of holding employment with Hennepin county or a position in a political party, except as a political party delegate.\n(h) Each member of the board shall be a resident of the county and in the event the member becomes a nonresident, the member thereby forfeits the office.\n(i) A board member may be removed from office by the county board for cause, after a copy of the charges has first been given to the member and opportunity of being publicly heard before the county board, upon not less than ten days' written notice. A majority vote of the county board shall be required for removal.\nCompensation for members of the Human Resources Board shall be set by the county board. Members of the board shall be compensated at the rate not to exceed $50 per day spent on board meetings and human resources activities when authorized by the board to represent the board. Expenses shall be allowed in the same manner and amount as received by county employees.\nThe board shall organize by electing one of its members as chair and one as vice-chair. The human resources director shall serve as secretary.\nThe board shall maintain records and hold public meetings as required for the discharge of its duties.",
	"repealed": false
}