{
	"id": "576.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.22",
	"title": "576.22 APPLICABILITY OF CHAPTER AND OF COMMON LAW.",
	"text": "(a) This chapter applies to receiverships provided for in section 576.25, subdivisions 2 to 6, and to receiverships:\n(1) pursuant to section 193.147, in connection with a mortgage on an armory;\n(2) pursuant to section 223.17, subdivision 8, paragraph (b), in connection with a defaulting grain buyer;\n(3) pursuant to section 232.22, subdivision 7, paragraph (c), in connection with a defaulting public grain warehouse;\n(4) pursuant to section 296A.22, in connection with nonpayment of tax;\n(5) pursuant to sections 302A.751, 302A.753, 308A.941, 308A.945, 308B.931, 308B.935, 317A.751, and 317A.753, or in an action relating to the dissolution of a foreign entity with property within the state;\n(6) pursuant to section 321.0703, in connection with the rights of a creditor of a partner or transferee;\n(7) pursuant to section 322.22, in connection with the rights of creditors of limited partners;\n(8) pursuant to section 323A.0504, in connection with a partner's transferable interest;\n(9) pursuant to section 453.55, in connection with bonds and notes;\n(10) pursuant to section 453A.05, in connection with bonds and notes;\n(11) pursuant to section 513.47, in connection with a proceeding for relief with respect to a transfer fraudulent as to a creditor or creditors;\n(12) pursuant to section 514.06, in connection with the severance of a building and resale;\n(13) pursuant to section 515.23, in connection with an action by a unit owners' association to foreclose a lien for nonpayment of delinquent assessments against condominium units;\n(14) pursuant to section 518A.71, in connection with the failure to pay, or to provide security for, maintenance or support payments;\n(15) pursuant to section 559.17, in connection with assignments of rents; however, any receiver appointed under section 559.17 shall be a limited receiver, and the court shall apply the provisions of this chapter to the extent not inconsistent with section 559.17;\n(16) pursuant to section 571.84, in connection with a garnishee in possession of property subject to a garnishment proceeding;\n(17) pursuant to section 575.05, in connection with property applied to judgment;\n(18) pursuant to section 575.06, in connection with adverse claimants;\n(19) pursuant to sections 582.05 to 582.10, in connection with mortgage foreclosures; however, any receiver appointed under sections 582.05 to 582.10 shall be a limited receiver, and the court shall apply the provisions of this chapter to the extent not inconsistent with sections 582.05 to 582.10;\n(20) pursuant to section 609.904, in connection with criminal penalties; or\n(21) pursuant to section 609.907, in connection with preservation of property subject to forfeiture.\n(b) This chapter does not apply to any receivership in which the receiver is a state agency or in which the receiver is appointed, controlled, or regulated by a state agency unless otherwise provided by law.\n(c) In receiverships not specifically referenced in paragraph (a) or (b), the court, in its discretion, may apply provisions of this chapter to the extent not inconsistent with the statutes establishing the receiverships.\n(d) Unless explicitly displaced by this chapter, the provisions of other statutory law and the principles of common law remain in full force and effect and supplement the provisions of this chapter.",
	"repealed": false
}