{
	"id": "154.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.02",
	"title": "154.02 DEFINITIONS.",
	"text": "Any one or any combination of the following practices when done upon the head, face, and neck for cosmetic purposes and not for the treatment of disease or physical or mental ailments and when done for payment directly or indirectly or without payment for the public generally constitutes the practice of barbering within the meaning of sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28: to shave the face or neck, trim the beard, clean, condition, cut, color, shape, or straighten the hair of any person of either sex for compensation or other reward received by the person performing such service or any other person; to give facial and scalp massage with oils, creams, lotions, or other preparations either by hand or mechanical appliances; to singe, shampoo the hair, or apply hair tonics; or to apply cosmetic preparations, antiseptics, powders, oils, clays, or lotions to hair, scalp, face, or neck.\nA \"barber school\" is a place that holds a registration as a barber school in which barbering, as defined in subdivision 1, is practiced by registered student barbers under the direction of registered barber instructors for the purpose of learning and teaching barber skills.\nA \"barber shop\" is a place other than a barber school that holds a registration as a barber shop under this chapter in which barbering, as defined in subdivision 1, is practiced.\nA \"certificate of registration\" means the certificate issued to an individual, barber shop, or barber school that is in compliance with the requirements of sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28.\nThe \"designated registered barber\" is a registered barber designated as the manager of a barber shop.\nA \"registered barber\" is an individual who, for compensation, performs the personal services as defined in subdivision 1, in compliance with this chapter.",
	"repealed": false
}