{
	"id": "168.0135",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.0135",
	"title": "168.0135 MOTOR VEHICLE REGISTRATION SELF-SERVICE KIOSKS.",
	"text": "(a) The commissioner, in consultation with deputy registrars, must establish a process to implement, locate, and install self-service kiosks that may be used for passenger vehicle and motorcycle registration renewals. The commissioner must establish reasonable performance, security, technical, and financial standards to approve a vendor. Self-service kiosks authorized by this section must:\n(1) allow a customer to renew a passenger vehicle or motorcycle registration pursuant to section 168.013 without assistance of a deputy registrar;\n(2) collect the appropriate annual contribution for a special license plate;\n(3) process requests for duplicate license plates, except that the self-service kiosk must not process any request for a special plate that requires documentation to prove eligibility to receive that type of plate;\n(4) dispense license plate registration renewal stickers to the applicant at the time of the application; and\n(5) display the contact phone number and email address of the deputy registrar's office that is responsible for the self-service kiosk.\n(b) This section only applies to deputy registrars appointed pursuant to section 168.33, subdivision 2.\n(a) The commissioner must contract with a vendor to provide the hardware and software necessary to implement the self-service kiosk program. The commissioner must provide fair and reasonable access to department facilities, staff, and technology. The vendor is responsible for the maintenance and installation of all self-service kiosks. The vendor must provide training to deputy registrars on how to operate and troubleshoot issues with a self-service kiosk.\n(b) In order to have a self-service kiosk placed in a deputy registrar's service area, the deputy registrar must make a request to the commissioner. The commissioner must review the request. If the request is approved, the commissioner must direct the vendor to place a self-service kiosk in the requesting deputy registrar's service area.\n(c) The deputy registrar that requested the placement of the self-service kiosk is responsible for the kiosk. The deputy registrar must coordinate with the vendor for administration and to ensure that all registration materials contained within the self-service kiosks are properly handled and accounted for.\n(a) A vendor must not have an ownership interest with a deputy registrar or a driver's license agent.\n(b) A vendor is not eligible to be appointed by the commissioner as a deputy registrar or a driver's license agent.\n(c) An entity that owns, leases, or otherwise provides a location where a self-service kiosk is placed is not eligible to be appointed by the commissioner as a deputy registrar or a driver's license agent. This paragraph does not apply to a deputy registrar or a driver's license agent appointed prior to placement of a self-service kiosk within the office of the deputy registrar or driver's license agent.\n(a) The commissioner may assess a convenience fee of $5 or less for each transaction completed using a self-service kiosk. The vendor must collect and retain the revenue from any convenience fee that is assessed.\n(b) The filing fees in section 168.33, subdivision 7, apply to transactions conducted at a self-service kiosk. The deputy registrar must retain the filing fees.\n(c) The fees authorized in this subdivision are in addition to any transaction fees, convenience fees, or other fees charged by a financial institution for use of a debit or credit card.",
	"repealed": false
}