{
	"id": "18B.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.305",
	"title": "18B.305 PESTICIDE EDUCATION AND TRAINING.",
	"text": "(a) The commissioner, as the lead agency, shall develop, implement or approve, and evaluate, in consultation with University of Minnesota Extension, the Minnesota State Colleges and Universities system, and other educational institutions, innovative educational and training programs addressing pesticide concerns including:\n(1) water quality protection;\n(2) endangered species protection;\n(3) minimizing pesticide residues in food and water;\n(4) worker protection and applicator safety;\n(5) chronic toxicity;\n(6) integrated pest management and pest resistance;\n(7) pesticide disposal;\n(8) pesticide drift;\n(9) relevant laws including pesticide labels and labeling and state and federal rules and regulations;\n(10) current science and technology updates; and\n(11) thresholds and guidance to reduce the impacts of insecticide on pollinators.\n(b) The commissioner shall appoint educational planning committees which must include representatives of industry and applicators.\n(c) Specific current regulatory concerns must be discussed and, if appropriate, incorporated into each training session. Relevant changes to pesticide product labels or labeling or state and federal rules and regulations may be included.\n(d) The commissioner may approve programs from private industry, higher education institutions, and nonprofit organizations that meet minimum requirements for education, training, and certification.\nThe commissioner, in consultation with University of Minnesota Extension and other higher education institutions, shall continually revise and update pesticide applicator training manuals and examinations. The manuals and examinations must be written to meet or exceed the minimum competency standards required by the United States Environmental Protection Agency and pertinent state specific information. Pesticide applicator training manuals and examinations must meet or exceed the competency standards in Code of Federal Regulations, title 40, part 171. Competency standards for training manuals and examinations must be published on the Department of Agriculture website. Questions in the examinations must be determined by the commissioner in consultation with other responsible agencies. Manuals and examinations must include pesticide management practices that discuss prevention of pesticide occurrence in groundwater and surface water of the state, and economic thresholds and guidance for insecticide use.\n[Repealed, 2007 c 133 art 2 s 13]",
	"repealed": false
}