{
	"id": "62A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.03",
	"title": "62A.03 GENERAL PROVISIONS OF POLICY.",
	"text": "No policy of individual accident and sickness insurance may be delivered or issued for delivery to a person in this state unless:\n(1) Premium. The entire money and other considerations therefor are expressed therein.\n(2) Time effective. The time at which the insurance takes effect and terminates is expressed therein.\n(3) One person. It purports to insure only one person, except that a policy may insure, originally or by subsequent amendment, upon the application of an adult member of a family deemed the policyholder, any two or more eligible members of that family, including:\n(a) spouses,\n(b) dependent children as described in sections 62A.302 and 62A.3021, or\n(c) any other person dependent upon the policyholder.\n(4) Appearance. The style, arrangement, and overall appearance of the policy give no undue prominence to any portion of the text and every printed portion of the text of the policy and of any endorsements or attached papers is plainly printed in light-face type of a style in general use. The type size must be uniform and not less than ten point with a lowercase unspaced alphabet length not less than 120 point. The \"text\" includes all printed matter except the name and address of the insurer, name or title of the policy, the brief description, if any, the reference to renewal or cancellation by a separate statement, if any, and the captions and subcaptions.\n(5) Description of policy. The policy, on the first page, indicates or refers to its provisions for renewal or cancellation either in the brief description, if any, or by a separate statement printed in type not smaller than the type used for captions or a separate provision bearing a caption which accurately describes the renewability or cancelability of the policy.\n(6) Exceptions in policy. The exceptions and reductions of indemnity are set forth in the policy and, except those which are set forth in section 62A.04, printed, at the insurer's option, either with the benefit provision to which they apply, or under an appropriate caption such as \"EXCEPTIONS\" or \"EXCEPTIONS AND REDUCTIONS.\" However, if an exception or reduction specifically applies only to a particular benefit of the policy, a statement of the exception or reduction must be included with the benefit provision to which it applies.\n(7) Form number. Each form, including riders and endorsements, is identified by a form number in the lower left hand corner of the first page thereof.\n(8) No incorporation by reference. It contains no provision purporting to make any portion of the charter, rules, constitution, or bylaws of the insurer a part of the policy unless the portion is set forth in full in the policy, except in the case of the incorporation of, or reference to, a statement of rates, classification of risks, or short rate table filed with the commissioner.\n(9) Medical benefits. If the policy contains a provision for medical expense benefits, the term \"medical benefits\" or similar terms as used therein includes treatments by all licensed practitioners of the healing arts unless, subject to the qualifications contained in clause (10), the policy specifically states the practitioners whose services are covered.\n(10) Osteopathic physician, optometrist, chiropractor, or registered nurse services. With respect to any policy of individual accident and sickness insurance issued or entered into subsequent to August 1, 1974, notwithstanding the provisions of the policy, if it contains a provision providing for reimbursement for any service which is in the lawful scope of practice of a duly licensed osteopathic physician, optometrist, chiropractor, or registered nurse meeting the requirements of section 62A.15, subdivision 3a, the person entitled to benefits or person performing services under the policy is entitled to reimbursement on an equal basis for the service, whether the service is performed by a physician, osteopathic physician, optometrist, chiropractor, or registered nurse meeting the requirements of section 62A.15, subdivision 3a, licensed under the laws of this state.\nIf any policy is issued by an insurer domiciled in this state for delivery to a person residing in another state, and if the official having responsibility for the administration of the insurance laws of such other state shall have advised the commissioner that any such policy is not subject to approval or disapproval by such official, the commissioner may by ruling require that such policy meet the standards set forth in subdivision 1 and in section 62A.04.",
	"repealed": false
}