{
	"id": "563.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/563.01",
	"title": "563.01 COURT FEE WAIVER; AUTHORIZATION.",
	"text": "MS 1998 [Repealed, 1999 c 216 art 7 s 45]\nWhenever pursuant to this section the court directs expenses to be paid, the expenses shall be paid by the state.\n(a) Any court of the state of Minnesota or any political subdivision thereof may authorize the commencement or defense of any civil action, or appeal therein, without payment of fees, costs, and security for costs by a natural person who makes affidavit stating (1) the nature of the action, defense or appeal, (2) a belief that affiant is entitled to redress, and (3) that affiant is financially unable to pay the fees, costs and security for costs.\n(b) Upon a finding by the court that the action, defense, or appeal is not of a frivolous nature, the court shall allow the person to proceed without payment of fees, costs, and security for costs if the affidavit is substantially in the language required by this subdivision and is not found by the court to be untrue. Persons presumed to meet the requirements of this subdivision include, but are not limited to, a person who is receiving public assistance described in section 550.37, subdivision 14, who is represented by an attorney on behalf of a civil legal services program or a volunteer attorney program based on indigency, or who has an annual income not greater than 125 percent of the poverty line established under United States Code, title 42, section 9902(2), except as otherwise provided by section 563.02.\n(c) If, at commencement of the action, the court finds that a party does not meet the eligibility criteria under paragraph (b), but the court also finds that the party is not able to pay all of the fees, costs, and security for costs, the court may order payment of a fee of $75 or partial payment of the fees, costs, and security for costs, to be paid as directed by the court.\nThe court administrator shall transmit any fees or payments to the commissioner of management and budget for deposit in the state treasury and credit to the general fund.\n(d) Notwithstanding paragraph (a), a person who is represented by a civil legal services program or a volunteer attorney program based on indigency may be allowed to proceed without payment of fees, costs, and security for costs without additional findings if the attorney representing the person submits an affidavit or makes an oral attestation during a court proceeding stating that civil legal services or a volunteer attorney program services are being provided to the client.\nUpon order of the court, the court administrator and the sheriff of any Minnesota county shall perform their duties without charge to the person proceeding with a court fee waiver. The court shall direct payment of the reasonable expense of service of process pursuant to subdivision 2 if served by a private process server, if the sheriff is unavailable, or by publication.\nIf the court finds that a witness, including an expert witness, has evidence material and necessary to the case and is within the state of Minnesota, the court shall direct payment of the reasonable expenses incurred in subpoenaing the witness, if necessary, and in paying the fees and costs of the witness.\nIf the court finds that a deposition and transcript thereof are necessary to adequately prepare, present or decide an issue presented by the action, the court shall direct payment of the reasonable expenses incurred in taking the deposition and in obtaining the transcript thereof.\nIf the court finds that a transcript of any part or all of the action is necessary to adequately prepare, present or decide an issue presented by the action, the court shall direct the payment of the reasonable expenses incurred in obtaining the transcript.\nThe court administrator shall provide a person who is proceeding with a court fee waiver under subdivision 3 with a copy of the person's court file without charge.\nIn any case on appeal the appellate court shall, upon granting permission to proceed with a court fee waiver as provided in subdivision 3, direct payment of the reasonable expenses incurred in obtaining the record and reproducing the appellate briefs.\nFollowing commencement of the action, the court may order reimbursement of all or a portion of any fees, costs, and security for costs if the party either (1) no longer meets the eligibility criteria under subdivision 3, paragraph (b); or (2) the amount ordered under subdivision 3, paragraph (c), is no longer appropriate because the party is able to pay a higher amount. The reimbursement must be paid as directed by the court.\nUpon motion, the court may rescind its permission to proceed with a court fee waiver under subdivision 3 if it finds the allegations of poverty contained in the affidavit are untrue, or if, following commencement of the action, the party becomes able to pay the fees, costs and security for the costs. In such cases, the court may direct the party to pay to the court administrator any costs allowing the action to proceed. The court administrator shall transmit the costs to the commissioner of management and budget for deposit in the state treasury and credit them to the general fund.\nJudgment may be rendered for costs at the conclusion of the action as in other cases. In the event any person recovers moneys by either settlement or judgment as a result of commencing or defending an action with a court fee waiver under subdivision 3, the costs deferred and the expenses directed by the court to be paid under this section shall be included in such moneys and shall be paid directly to the court administrator by the opposing party. The court administrator shall transmit the costs to the commissioner of management and budget for deposit in the state treasury and credit them to the general fund.\nA person who fraudulently invokes the privilege of this section shall be guilty of perjury and shall, upon conviction thereof, be punished as provided in section 609.48.\nThe provisions of this section do not replace or supersede remedies otherwise provided by law.",
	"repealed": false
}