{
	"id": "41D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/41D.01",
	"title": "41D.01 MINNESOTA AGRICULTURAL EDUCATION LEADERSHIP COUNCIL.",
	"text": "(a) The Minnesota Agricultural Education Leadership Council is established. The council is composed of 16 members as follows:\n(1) a representative of an agricultural education program at a higher education institution that prepares agriculture teachers for licensure;\n(2) a representative of the commissioner of education;\n(3) a representative of the Minnesota State Colleges and Universities recommended by the chancellor;\n(4) the president and the president-elect of the Minnesota Association of Agricultural Educators;\n(5) a representative of the Minnesota FFA Foundation;\n(6) a representative of the commissioner of agriculture;\n(7) the dean of the College of Food, Agricultural and Natural Resource Sciences at the University of Minnesota;\n(8) two members representing agricultural education and agriculture business appointed by the governor;\n(9) the chair and ranking minority member of a senate committee with jurisdiction over agriculture;\n(10) the chair and ranking minority member of a house of representatives committee with jurisdiction over agriculture;\n(11) a member of a senate committee with jurisdiction over education designated by the Subcommittee on Committees of the Committee on Rules and Administration; and\n(12) a member of a house of representatives committee with jurisdiction over education designated by the speaker.\n(b) An ex officio member of the council under paragraph (a), clause (4), (7), (9), (10), (11), or (12), may designate a permanent or temporary replacement member representing the same constituency.\nSpecific powers and duties of the council are to:\n(1) develop recommendations to the legislature and the governor and provide review for agricultural education programs in Minnesota;\n(2) establish a grant program to foster and encourage the development of secondary and postsecondary agricultural education programs;\n(3) coordinate and articulate Minnesota's agricultural education policy across all programs and institutions;\n(4) identify the critical needs for agricultural educators;\n(5) serve as a link between the agribusiness sector and the agricultural education system to communicate mutual concerns, needs, and projections;\n(6) establish and maintain an increased awareness of agricultural education and its continued need to all citizens of Minnesota;\n(7) operate the Minnesota Center for Agricultural Education created in section 41D.03;\n(8) gain broad public support for agricultural education in Minnesota; and\n(9) report annually on its activities to the legislative committees with jurisdiction over agriculture policy.\n(a) The chairs of the legislative committees with jurisdiction over agriculture policy, or their designees, are the cochairs of the council.\n(b) The council's membership terms, compensation, filling of vacancies, and removal of members are as provided in section 15.0575.\n(c) The council may employ an executive director and any other staff to carry out its functions.\n[Repealed, 2017 c 88 art 2 s 93]",
	"repealed": false
}