{
	"id": "349.168",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.168",
	"title": "349.168 GAMBLING EMPLOYEES.",
	"text": "A person may not receive compensation for participating in the conduct of lawful gambling as an employee of a licensed organization unless the person has first registered with the licensed organization on a United States government-required form documenting the person's identity and employment authorization. The form must require each registrant to provide the person's name, address, and date of birth, and the name, address, and license number of the employing organization.\nEach person receiving compensation for the conduct of lawful gambling must publicly display the person's name at all times while conducting the lawful gambling.\nMS 1994 [Repealed, 1996 c 467 s 9]\nMS 2008 [Repealed, 2009 c 124 s 60]\nAn organization paying compensation to persons who participate in the conduct of lawful gambling must maintain a compensation record. The record must itemize each payment made to each recipient of compensation and must include the amount and the full name, address, and membership status of each recipient.\nMS 2008 [Repealed, 2009 c 124 s 60]\nMS 2008 [Repealed, 2009 c 124 s 60]\n(a) A licensed organization may pay a percentage of the gross profit from raffle ticket sales to a nonprofit organization that sells raffle tickets for the licensed organization.\n(b) A licensed organization may compensate an employee of the organization for the sale of gambling equipment at a bar operation if the frequency of the activity is one day or less per week and the games are limited to 32 chances or less per game. For purposes of this paragraph, an employee must not be a lessor, employee of the lessor, or an immediate family member of the lessor.\n(c) An organization that leases a premises may not pay compensation to the lessor, a member of the lessor's immediate family, or the lessor's employees, other than as a seller of pull-tabs and tipboards within a booth operation on the premises. An employee of the lessor or a member of the lessor's immediate family may be compensated by an organization for the conduct of gambling at other sites not owned by the lessor.\nMS 2002 [Repealed, 2003 c 110 s 44]\nMS 2008 [Repealed, 2009 c 124 s 60]",
	"repealed": false
}