{
	"id": "43A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.08",
	"title": "43A.08 UNCLASSIFIED SERVICE.",
	"text": "Unclassified positions are held by employees who are:\n(1) chosen by election or appointed to fill an elective office;\n(2) heads of agencies required by law to be appointed by the governor or other elective officers, and the executive or administrative heads of departments, bureaus, divisions, and institutions specifically established by law in the unclassified service;\n(3) deputy and assistant agency heads and one confidential secretary in the agencies listed in subdivision 1a;\n(4) the confidential secretary to each of the elective officers of this state and, for the secretary of state and state auditor, an additional deputy, clerk, or employee;\n(5) intermittent help employed by the commissioner of public safety to assist in the issuance of vehicle licenses;\n(6) employees in the offices of the governor and of the lieutenant governor and one confidential employee for the governor in the Office of the Adjutant General;\n(7) employees of the Washington, D.C., office of the state of Minnesota;\n(8) employees of the legislature and of legislative committees or commissions; provided that employees of the Legislative Audit Commission, except for the legislative auditor, the deputy legislative auditors, and their confidential secretaries, shall be employees in the classified service;\n(9) presidents, vice-presidents, deans, other managers and professionals in academic and academic support programs, administrative or service faculty, teachers, research assistants, and student employees eligible under terms of the federal Economic Opportunity Act work study program in the Perpich Center for Arts Education and the Minnesota State Colleges and Universities, but not the custodial, clerical, or maintenance employees, or any professional or managerial employee performing duties in connection with the business administration of these institutions;\n(10) officers and enlisted persons in the National Guard;\n(11) attorneys, legal assistants, and three confidential employees appointed by the attorney general or employed with the attorney general's authorization;\n(12) judges and all employees of the judicial branch, referees, receivers, jurors, and notaries public, except referees and adjusters employed by the Department of Labor and Industry;\n(13) members of the State Patrol; provided that selection and appointment of State Patrol troopers must be made in accordance with applicable laws governing the classified service;\n(14) examination monitors and intermittent training instructors employed by the Departments of Management and Budget and Commerce and by professional examining boards and intermittent staff employed by the technical colleges for the administration of practical skills tests and for the staging of instructional demonstrations;\n(15) student workers;\n(16) executive directors or executive secretaries appointed by and reporting to any policy-making board or commission established by statute;\n(17) employees unclassified pursuant to other statutory authority;\n(18) intermittent help employed by the commissioner of agriculture to perform duties relating to pesticides, fertilizer, and seed regulation;\n(19) the administrators and the deputy administrators at the State Academies for the Deaf and the Blind; and\n(20) the chief executive officer of Direct Care and Treatment.\nAppointing authorities for the following agencies may designate additional unclassified positions according to this subdivision: the Departments of Administration; Agriculture; Children, Youth, and Families; Commerce; Corrections; Education; Employment and Economic Development; Explore Minnesota Tourism; Management and Budget; Health; Human Rights; Human Services; Labor and Industry; Natural Resources; Public Safety; Revenue; Transportation; and Veterans Affairs; the Housing Finance and Pollution Control Agencies; the State Lottery; the State Board of Investment; the Office of Administrative Hearings; the Department of Information Technology Services; the Offices of the Attorney General, Secretary of State, and State Auditor; the Minnesota State Colleges and Universities; the Minnesota Office of Higher Education; the Perpich Center for Arts Education; Direct Care and Treatment; the Minnesota Zoological Board; and the Office of Emergency Medical Services.\nA position designated by an appointing authority according to this subdivision must meet the following standards and criteria:\n(1) the designation of the position would not be contrary to other law relating specifically to that agency;\n(2) the person occupying the position would report directly to the agency head or deputy agency head and would be designated as part of the agency head's management team;\n(3) the duties of the position would involve significant discretion and substantial involvement in the development, interpretation, and implementation of agency policy;\n(4) the duties of the position would not require primarily personnel, accounting, or other technical expertise where continuity in the position would be important;\n(5) there would be a need for the person occupying the position to be accountable to, loyal to, and compatible with, the governor and the agency head, the employing statutory board or commission, or the employing constitutional officer;\n(6) the position would be at the level of division or bureau director or assistant to the agency head; and\n(7) the commissioner has approved the designation as being consistent with the standards and criteria in this subdivision.\nThe provisions of Laws 1982, chapter 634 do not apply to the positions contained in Minnesota Statutes 1981 Supplement, section 43A.08, subdivision 1, clause (g).\n[Repealed, 1982 c 560 s 65]\nThe commissioner, upon request of an appointing authority, may authorize the temporary designation of a position in the unclassified service. The commissioner may make this authorization only for professional, managerial or supervisory positions which are fully anticipated to be of limited duration.\nExcept for those positions listed in section 43A.18, subdivisions 4 and 6, when a new position is to be established in the unclassified service, the commissioner shall compare the position to a class in the classified service if a comparable class exists or if not, establish a salary rate or range and official title for the position.\nThe commissioner shall independently or upon request of an appointing authority or employee investigate the duties of a position unclassified under provisions of subdivision 1a or rule. If the commissioner determines the position is incorrectly placed in the unclassified service, the commissioner shall place the position in the classified service. If the commissioner determines the position is improperly compared or assigned to an inappropriate salary range, the commissioner shall recompare the position, change the title or establish a new title or reassign the position to a different salary rate or range.\nIf a new title is established for the position or if the position is reassigned to a different salary rate or range and the position will be covered by a bargaining unit under the provisions of section 179A.10, and if there is an applicable provision in a collective bargaining agreement, the commissioner shall establish the salary rate or range pursuant to the collective bargaining agreement.\nA person may not be employed as a student worker in the unclassified service under subdivision 1 for more than 36 months. Employment at a school that a student attends is not counted for purposes of this 36-month limit. Student workers in the Minnesota Department of Transportation SEEDS program who are actively involved in a four-year degree program preparing for a professional career job in the Minnesota Department of Transportation may be employed as a student worker for up to 48 months.",
	"repealed": false
}