{
	"id": "124D.128",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.128",
	"title": "124D.128 LEARNING YEAR PROGRAM TO PROVIDE INSTRUCTION THROUGHOUT YEAR.",
	"text": "A learning year program provides instruction throughout the year on an extended year calendar, extended school day calendar, or both. A learning year program may begin after the close of the regular school year in June. The program may be for students in one or more grade levels from kindergarten through grade 12.\n(a) A state-approved alternative program designated by the state must be a site. A state-approved alternative program must provide services to students who meet the criteria in section 124D.68 and who are enrolled in:\n(1) a district that is served by the state-approved alternative program; or\n(2) a charter school located within the geographic boundaries of a district that is served by the state-approved alternative program.\n(b) To be designated, a state-approved alternative program must demonstrate to the commissioner that it will:\n(1) provide a program of instruction that permits pupils to receive instruction throughout the entire year; and\n(2) develop and maintain a separate record system that, for purposes of section 126C.05, permits identification of membership attributable to pupils participating in the program. The record system and identification must ensure that the program will not have the effect of increasing the total average daily membership attributable to an individual pupil as a result of a learning year program. The record system must include the date the pupil originally enrolled in a learning year program, the pupil's grade level, the date of each grade promotion, the average daily membership generated in each grade level, the number of credits or standards earned, and the number needed to graduate.\n(c) A student who has not completed a school district's graduation requirements may continue to enroll in courses the student must complete in order to graduate until the student satisfies the district's graduation requirements or the student is 21 years old, whichever comes first. A student with a disability as set forth in section 125A.02 may continue to enroll in courses until the student graduates with a regular high school diploma or the student is 22 years old, whichever comes first.\nA district, charter school, or state-approved alternative program must inform all pupils and their parents about the learning year program and that participation in the program is optional. A continual learning plan must be developed at least annually for each pupil with the participation of the pupil, parent or guardian, teachers, and other staff; each participant must sign and date the plan. The plan must specify the learning experiences that must occur during the entire fiscal year and are necessary for grade progression or, for secondary students, graduation. The plan must include:\n(1) the pupil's learning objectives and experiences, including courses or credits the pupil plans to complete each year and, for a secondary pupil, the graduation requirements the student must complete;\n(2) the assessment measurements used to evaluate a pupil's objectives;\n(3) requirements for grade level or other appropriate progression; and\n(4) for pupils generating more than one average daily membership in a given grade, an indication of which objectives were unmet.\nThe plan may be modified to conform to district schedule changes. The district may not modify the plan if the modification would result in delaying the student's time of graduation.\n[Repealed, 2000 c 254 s 51]\nA district may contract with a licensed employee to provide services in a learning year program that are in addition to the services provided according to the master contract of employment for teachers or an equivalent contract for licensed employees who are not teachers. These additional services and compensation, if any, for the services must not become a part of the employee's continuing contract rights under section 122A.40 or 122A.41.\nAid and levy revenue computations must be based on the total number of hours of education programs for pupils in average daily membership for each fiscal year. Average daily membership shall be computed under section 126C.05, subdivision 15. Hours of participation that occur after the close of the regular instructional year and before July 1 must be attributed to the following fiscal year. For revenue computation purposes, the learning year program shall generate revenue based on the formulas for the fiscal year in which the services are provided. The dates a participating pupil is promoted must be reported in a timely manner to the department.\n(a) If, during an audit of a district's learning year program, the commissioner finds that the district is not meeting program requirements, the commissioner must notify the board of that district in writing. The notice must specify the findings in detail, describe the correction required, set a reasonable time during which the findings should be corrected, and advise that general education revenue to the district may be reduced. The commissioner may extend the time allowed for the correction.\n(b) A board that receives a notice under paragraph (a) may decide by majority vote of the entire board to dispute that:\n(1) the specified finding exists;\n(2) the time allowed is reasonable; or\n(3) the commissioner should reduce district general education revenue.\nThe board must give the commissioner written notice of the board's decision within 30 days of receipt of the audit report. After making any further investigations the commissioner deems necessary, the commissioner must decide whether or not to adhere to the commissioner's original notice and must notify the board of the commissioner's decision.\n(c) The commissioner may reduce or withhold state general education revenues as the result of an audit. The commissioner may decide not to reduce or withhold state general education revenues if the district corrects the specified finding, or after receiving the district's notice disputing the finding, the commissioner decides the finding does not exist.\n[Repealed, 1Sp2001 c 6 art 2 s 78]",
	"repealed": false
}