{
	"id": "398.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.33",
	"title": "398.33 FUNDS.",
	"text": "For the purposes of sections 398.31 to 398.36, the county board of any county may levy taxes on all the taxable property in the county.\nFor the purposes of sections 398.31 to 398.36, the county board of any county may prescribe and provide for the collection of fees for the use of any county park or other unit of the county park system or any facilities, accommodations, or services provided for public use therein.\nContributions of funds for the purposes of sections 398.31 to 398.36 with respect to any county park or other unit of the county park system may be made to the county to which the same belongs by any city, town, or school district within or without the county or by any other county as defined in section 398.31 or otherwise to whose residents the park may be of substantial benefit for park or recreational purposes. Such contributions may be made out of the general funds of the contributing governmental subdivisions or out of funds raised or designated for park purposes or out of funds raised expressly for the purpose of such contributions, and the governing bodies of such subdivisions may levy taxes therefor, subject to any applicable limitations. The governing body of a governmental subdivision making such a contribution may specify the particular purpose for which the same is to be used within the general purposes aforesaid, and such contributions shall be used only for the purposes so specified. Subject to such restrictions, if any, all such contributions shall be paid into the county park fund of the county receiving the same and used for the purposes herein authorized.\nThe county board of any county may, in the name and behalf of the county, accept gifts, grants, or loans of money or other property from the United States, the state, or any other source for any purpose under sections 398.31 to 398.36, may enter into any agreement for repayment or otherwise required in connection therewith, and may hold, use, and dispose of such money or property for said purposes in accordance with the terms of the gift, grant, loan, or agreement relating thereto.\nAll money received from any source specified in sections 398.31 to 398.36 shall be paid into the county treasury, placed in a special fund designated as the county park fund, and used only for the purposes authorized in said sections, as appropriated by the county board, subject to any lawful restrictions, conditions, or pledges applicable to such money or any part thereof.\nTo raise funds for the cost and expense of acquisition of areas for county parks or other units of the county park system or for the improvement thereof, or to refund bonds issued for said purposes, the county board of any county may issue the bonds of the county in the manner and subject to the conditions prescribed by chapter 475, as heretofore or hereafter amended, so far as applicable to counties, except as herein otherwise expressly provided, and may levy all taxes necessary therefor. Such bonds and interest thereon and the expense of issuance thereof may be paid out of the proceeds of tax levies or out of revenue from fees or other sources, or both, and the county board may pledge any such proceeds or revenues thereto. Such bonds may be issued in addition to all other bonds authorized by law. No limitation hereafter prescribed by law shall apply to such bonds unless expressly so provided.",
	"repealed": false
}