{
	"id": "245G.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.10",
	"title": "245G.10 STAFF REQUIREMENTS.",
	"text": "A license holder must have a treatment director.\nA license holder must employ an alcohol and drug counselor supervisor who meets the requirements of section 245G.11, subdivision 4. An individual may be simultaneously employed as a treatment director, alcohol and drug counselor supervisor, and an alcohol and drug counselor if the individual meets the qualifications for each position. If an alcohol and drug counselor is simultaneously employed as an alcohol and drug counselor supervisor or treatment director, that individual must be considered a 0.5 full-time equivalent alcohol and drug counselor for staff requirements under subdivision 4.\nA treatment director must designate a staff member who, when present in the facility, is responsible for the delivery of treatment service. A license holder must have a designated staff member during all hours of operation. A license holder providing room and board and treatment at the same site must have a responsible staff member on duty 24 hours a day. The designated staff member must know and understand the implications of this chapter, sections 245A.65, 626.557, and 626.5572, and chapter 260E.\nIt is the responsibility of the license holder to determine an acceptable group size based on each client's needs. Group counseling shall not exceed 16 clients. The license holder must maintain a record that documents compliance with this subdivision.\nWhen a client is present, a license holder must have at least one staff member on the premises who has a current American Red Cross standard first aid certificate or an equivalent certificate and at least one staff member on the premises who has a current American Red Cross community, American Heart Association, or equivalent CPR certificate. A single staff member with both certifications satisfies this requirement.\nA license holder must notify the commissioner within five business days of a change or vacancy in a key staff position. The key positions are a treatment director as required by subdivision 1, an alcohol and drug counselor supervisor as required by subdivision 2, and a registered nurse as required by section 245G.08, subdivision 5, paragraph (c). The license holder must notify the commissioner of the staffing change on a form approved by the commissioner and include the name of the staff person now assigned to the key staff position and the staff person's qualifications for the position. The license holder must notify the program licensor of a vacancy to discuss how the duties of the key staff position will be fulfilled during the vacancy.",
	"repealed": false
}