{
	"id": "518.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.10",
	"title": "518.10 REQUISITES OF PETITION.",
	"text": "The petition for dissolution of marriage or legal separation shall state and allege:\n(a) the name and address of the petitioner and any prior or other name used by the petitioner;\n(b) the name and, if known, the address of the respondent and any prior or other name used by the respondent and known to the petitioner;\n(c) the place and date of the marriage of the parties;\n(d) in the case of a petition for dissolution, that either the petitioner or the respondent or both:\n(1) has resided in this state for not less than 180 days immediately preceding the commencement of the proceeding, or\n(2) has been a member of the armed services and has been stationed in this state for not less than 180 days immediately preceding the commencement of the proceeding, or\n(3) has been a domiciliary of this state for not less than 180 days immediately preceding the commencement of the proceeding;\n(e) the name at the time of the petition and any prior or other name, Social Security number, age, and date of birth of each living minor or dependent child of the parties born before the marriage or born or adopted during the marriage and a reference to, and the expected date of birth of, a child of the parties conceived during the marriage but not born;\n(f) whether or not a separate proceeding for dissolution, legal separation, or custody is pending in a court in this state or elsewhere;\n(g) in the case of a petition for dissolution, that there has been an irretrievable breakdown of the marriage relationship;\n(h) in the case of a petition for legal separation, that there is a need for a decree of legal separation;\n(i) any temporary or permanent maintenance, child support, child custody, disposition of property, attorneys' fees, costs and disbursements applied for without setting forth the amounts; and\n(j) whether an order for protection under chapter 518B or a similar law of another state that governs the parties or a party and a minor child of the parties is in effect and, if so, the district court or similar jurisdiction in which it was entered.\nThe petition shall be verified by the petitioner or petitioners, and its allegations established by competent evidence.\nIn proceedings where child support or spousal maintenance issues will be addressed, the petition under subdivision 1 must be accompanied by a separate document that contains the Social Security numbers of the petitioner and the respondent. The Social Security number document must be maintained in a portion of the court file or records that are not accessible to the general public.",
	"repealed": false
}