{
	"id": "275.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.08",
	"title": "275.08 AUDITOR TO FIX RATE.",
	"text": "The rate percent of all taxes, except the state tax and taxes the rate of which may be fixed by law, shall be calculated and fixed by the county auditor according to the limitations in this chapter hereinafter prescribed; provided, that if any county, city, town, or school district shall return a greater amount than the prescribed rates will raise, the auditor shall extend only such amount of tax as the limited rate will produce.\nThe county auditor shall compute the net tax capacity for each parcel according to the classification rates specified in section 273.13. The net tax capacity will be the appropriate classification rate multiplied by the parcel's market value.\n(a) The amounts certified to be levied against net tax capacity under section 275.07 by an individual local government unit shall be divided by the total net tax capacity of all taxable properties within the local government unit's taxing jurisdiction. The resulting ratio, the local government's local tax rate, multiplied by each property's net tax capacity shall be each property's net tax capacity tax for that local government unit before reduction by any credits.\n(b) The auditor must also determine the school debt tax rate for each school district equal to (1) the school debt service levy certified under section 275.07, subdivision 2, divided by (2) the total net tax capacity of all taxable property within the district.\n(c) Any amount certified to the county auditor to be levied against market value shall be divided by the total referendum market value of all taxable properties within the taxing district. The resulting ratio, the taxing district's new referendum tax rate, multiplied by each property's referendum market value shall be each property's new referendum tax before reduction by any credits. For the purposes of this subdivision, \"referendum market value\" means the market value as defined in section 126C.01, subdivision 3.\nAfter the local tax rate of a local government has been determined pursuant to subdivision 1b, the auditor shall adjust the local government's local tax rate within each unique taxing jurisdiction as defined in section 273.1398, subdivision 1, in which the local government exercises taxing authority. The adjustment shall equal the unique taxing jurisdiction's disparity reduction aids allocated to the local government pursuant to section 273.1398, subdivision 3, divided by the total tax capacity of all taxable property within the unique taxing jurisdiction. The adjustment shall reduce the local tax rate of the local government within the unique taxing jurisdiction for which the adjustment was calculated.\nIf, after computing each local government's adjusted local tax rate within a unique taxing jurisdiction pursuant to subdivision 1c, the auditor finds that the total adjusted local tax rate of all local governments combined is 90 percent of net tax capacity, the auditor shall increase each local government's adjusted local tax rate proportionately so the total adjusted local tax rate of all local governments combined equals 90 percent. The total amount of the increase in tax resulting from the increased local tax rates must not exceed the amount of disparity aid allocated to the unique taxing district under section 273.1398. The auditor shall certify to the Department of Revenue the difference between the disparity aid originally allocated under section 273.1398, subdivision 3, and the amount necessary to reduce the total adjusted local tax rate of all local governments combined to 90 percent. Each local government's disparity reduction aid payment under section 273.1398, subdivision 6, must be reduced accordingly.\nMS 2000 [Repealed, 1Sp2001 c 5 art 3 s 96]\nIf, by January 15 of any year, the county auditor has not received from another county auditor the local tax rate or gross tax capacity applicable to any taxing district lying in two or more counties, the county auditor who has not received the necessary information may levy taxes for the overlapping district by estimating the local tax rate or the gross tax capacity.\nA county auditor who has not furnished the local tax rate or gross tax capacity of property in the county by January 15 shall, on request, furnish the county auditor of a county in the overlapping district an estimate of the tax capacities or the local tax rate. The auditor may request the assistance of the county assessor in determining the estimate.\nAfter the correct local tax rate or net tax capacity has been certified, the amount of taxes over or under levied shall be computed and notice sent to each affected taxing district. If the estimated tax levy exceeds the correct tax levy based on actual net tax capacity and local tax rate, the county treasurer shall remit any amount of excess collected to the affected taxing district. In the following levy year, the estimating county auditor shall adjust the levy of the affected taxing district to compensate for the amount of variance.\nIn the event that the estimated tax levy is less than the correct tax levy based on actual net tax capacity and local tax rate, the auditor shall adjust the levy of the affected taxing district as provided in section 275.075.",
	"repealed": false
}