{
	"id": "6.715",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.715",
	"title": "6.715 CLASSIFICATION OF STATE AUDITOR'S DATA.",
	"text": "(a) For purposes of this section, \"audit\" means an examination, financial audit, compliance audit, or investigation performed by the state auditor.\n(b) The definitions in section 13.02 apply to this section.\nData relating to an audit are protected nonpublic data or confidential data on individuals, until the final report of the audit has been published or the audit is no longer being actively pursued. Data that support the conclusions of the report and that the state auditor reasonably believes will result in litigation are protected nonpublic data or confidential data on individuals, until the litigation has been completed or is no longer being actively pursued. Data on individuals that could reasonably be used to determine the identity of an individual supplying data for an audit are private if the data supplied by the individual were needed for an audit and the individual would not have provided the data to the state auditor without an assurance that the individual's identity would remain private, or the state auditor reasonably believes that the subject would not have provided the data. Data that could reasonably be used to determine the identity of an individual supplying data pursuant to section 609.456 are private.\nNotwithstanding any provision to the contrary in subdivision 2, chapter 13, or any other statute related to the classification of government data, the state auditor may share data relating to an audit with appropriate law enforcement agencies, including data classified as not public.\nIt is not a violation of chapter 13 or any other statute related to the classification of government data for a state agency, statewide system, or political subdivision, as defined in section 13.02, to provide data or information to the state auditor, including data classified as not public, for the purpose of an audit or pursuant to section 609.456, subdivision 1.\nIf, before releasing a report, the state auditor provides a person with data relating to the audit for the purpose of review and verification of the data, the person must protect the data from unlawful disclosure or be subject to the penalties and liabilities provided in sections 13.08 and 13.09.",
	"repealed": false
}