{
	"id": "45.306",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.306",
	"title": "45.306 CONTINUING EDUCATION COURSES OFFERED OVER THE INTERNET.",
	"text": "MS 2020 [Repealed, 2021 c 16 s 12]\nThe requirements for the design and delivery of an appraiser continuing education course are the requirements established by the Appraiser Qualifications Board of the Appraisal Foundation and published in the most recent version of the Real Property Appraiser Qualification Criteria.\nAn interactive Internet continuing education course must:\n(1) specify the minimum system requirements;\n(2) provide encryption that ensures that all personal information, including the student's name, address, and credit card number, cannot be read as it passes across the Internet;\n(3) include technology to guarantee seat time;\n(4) include a high level of interactivity;\n(5) include graphics that reinforce the content;\n(6) include the ability for the student to contact an instructor within a reasonable amount of time;\n(7) include the ability for the student to get technical support within a reasonable amount of time;\n(8) include a statement that the student's information will not be sold or distributed to any third party without prior written consent of the student. Taking the course does not constitute consent;\n(9) be available 24 hours a day, seven days a week, excluding minimal down time for updating and administration, except that this provision does not apply to live courses taught by an actual instructor and delivered over the Internet;\n(10) provide viewing access to the online course at all times to the commissioner, excluding minimal down time for updating and administration;\n(11) include a process to authenticate the student's identity;\n(12) inform the student and the commissioner how long after its purchase a course will be accessible;\n(13) inform the student that license education credit will not be awarded for taking the course after it loses its status as an approved course;\n(14) provide clear instructions on how to navigate through the course;\n(15) provide automatic bookmarking at any point in the course;\n(16) provide questions after each unit or chapter that must be answered before the student can proceed to the next unit or chapter;\n(17) include a reinforcement response when a quiz question is answered correctly;\n(18) include a response when a quiz question is answered incorrectly;\n(19) include a final examination;\n(20) allow the student to go back and review any unit at any time, except during the final examination;\n(21) provide a course evaluation at the end of the course. At a minimum, the evaluation must ask the student to report any difficulties caused by the online education delivery method; and\n(22) provide a completion certificate when the course and exam have been completed and the provider has verified the completion. Electronic certificates are sufficient.\nThe final examination must be either an encrypted online examination or a paper examination that is monitored by a proctor who certifies that the student took the examination. The student must not be allowed to review the course content once the examination has begun.",
	"repealed": false
}