{
	"id": "62A.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.045",
	"title": "62A.045 PAYMENTS ON BEHALF OF ENROLLEES IN GOVERNMENT HEALTH PROGRAMS.",
	"text": "(a) As a condition of doing business in Minnesota or providing coverage to residents of Minnesota covered by this section, each health insurer shall comply with the requirements for health insurers under the federal Deficit Reduction Act of 2005, Public Law 109-171 and the federal Consolidated Appropriations Act of 2022, Public Law 117-103, including any federal regulations adopted under those acts, to the extent that they impose a requirement that applies in this state and that is not also required by the laws of this state. This section does not require compliance with any provision of the federal acts prior to the effective dates provided for those provisions in the federal acts. The commissioner shall enforce this section.\nFor the purpose of this section, \"health insurer\" includes self-insured plans, group health plans (as defined in section 607(1) of the Employee Retirement Income Security Act of 1974), service benefit plans, managed care organizations, pharmacy benefit managers, or other parties that are by contract legally responsible to pay a claim for a health-care item or service for an individual receiving benefits under paragraph (b).\n(b) No plan offered by a health insurer issued or renewed to provide coverage to a Minnesota resident shall contain any provision denying or reducing benefits because services are rendered to a person who is eligible for or receiving medical benefits pursuant to title XIX of the Social Security Act (Medicaid) in this or any other state; chapter 256 or 256B; or services pursuant to section 252.27; 256L.01 to 256L.10; 260B.331, subdivision 2; 260C.331, subdivision 2; or 393.07, subdivision 1 or 2. No health insurer providing benefits under plans covered by this section shall use eligibility for medical programs named in this section as an underwriting guideline or reason for nonacceptance of the risk.\n(c) If payment for covered expenses has been made under state medical programs for health care items or services provided to an individual, and a third party has a legal liability to make payments, the rights of payment and appeal of an adverse coverage decision for the individual, or in the case of a child their responsible relative or caretaker, will be subrogated to the state agency. The state agency may assert its rights under this section within three years of the date the service was rendered. For purposes of this section, \"state agency\" includes prepaid health plans under contract with the commissioner according to sections 256B.69 and 256L.12; children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing homes under the alternative payment demonstration project under section 256B.434; and county-based purchasing entities under section 256B.692.\n(d) Notwithstanding any law to the contrary, when a person covered by a plan offered by a health insurer receives medical benefits according to any statute listed in this section, payment for covered services or notice of denial for services billed by the provider must be issued directly to the provider. If a person was receiving medical benefits through the Department of Human Services at the time a service was provided, the provider must indicate this benefit coverage on any claim forms submitted by the provider to the health insurer for those services. If the commissioner of human services notifies the health insurer that the commissioner has made payments to the provider, payment for benefits or notices of denials issued by the health insurer must be issued directly to the commissioner. Submission by the department to the health insurer of the claim on a Department of Human Services claim form is proper notice and shall be considered proof of payment of the claim to the provider and supersedes any contract requirements of the health insurer relating to the form of submission. Liability to the insured for coverage is satisfied to the extent that payments for those benefits are made by the health insurer to the provider or the commissioner as required by this section.\n(e) When a state agency has acquired the rights of an individual eligible for medical programs named in this section and has health benefits coverage through a health insurer, the health insurer shall not impose requirements that are different from requirements applicable to an agent or assignee of any other individual covered.\n(f) A health insurer must process a clean claim made by a state agency for covered expenses paid under state medical programs within 90 business days of the claim's submission. A health insurer must process all other claims made by a state agency for covered expenses paid under a state medical program within the timeline set forth in Code of Federal Regulations, title 42, section 447.45(d)(4).\n(g) A health insurer may request a refund of a claim paid in error to the Department of Human Services within two years of the date the payment was made to the department. A request for a refund shall not be honored by the department if the health insurer makes the request after the time period has lapsed.",
	"repealed": false
}