{
	"id": "64B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/64B.40",
	"title": "64B.40 DEFINITIONS.",
	"text": "For the purposes of sections 64B.40 to 64B.48, the terms defined in this section have the meanings given them.\n\"Adjusted risk-based capital report\" means a risk-based capital report that has been adjusted by the commissioner according to section 64B.41, subdivision 3.\n\"Corrective order\" means an order issued by the commissioner specifying corrective actions that the commissioner has determined are required.\n\"NAIC\" means the National Association of Insurance Commissioners.\n\"Negative trend\" means, with respect to a society, negative trend over a period of time, as determined according to the \"trend test calculation\" included in the risk-based capital instructions.\n\"Risk-based capital instructions\" means the risk-based capital report including risk-based capital instructions adopted by the NAIC, as those risk-based instructions may be amended by the NAIC from time to time according to the procedures adopted by the NAIC.\n\"Risk-based capital level\" means a fraternal action level risk-based capital or fraternal authorized control level risk-based capital where:\n(1) \"fraternal action level risk-based capital\" means the product of 2.0 and its authorized control level risk-based capital; and\n(2) \"fraternal authorized control level risk-based capital\" means the number determined under the risk-based capital formula according to the risk-based capital instructions.\n\"Risk-based capital plan\" means a comprehensive financial plan containing the elements specified in section 64B.42. If the commissioner rejects the risk-based capital plan, and it is revised by the society, with or without the commissioner's recommendation, the plan must be called the \"revised risk-based capital plan.\"\n\"Risk-based capital report\" means the report required in section 64B.41.\n\"Society\" means a fraternal benefit society that is admitted to do business in this state under this chapter.\n\"Total adjusted capital\" means the sum of:\n(1) a society's statutory capital and surplus as determined in accordance with statutory accounting applicable to the annual statement required to be filed under section 60A.13; and\n(2) other items, if any, as the risk-based capital instructions may provide.",
	"repealed": false
}