{
	"id": "356.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.48",
	"title": "356.48 REVOCATION OF OPTIONAL ANNUITY DUE TO MARRIAGE DISSOLUTION OR ANNULMENT.",
	"text": "This section applies to the following retirement plans:\n(1) the general state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(2) the correctional state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(3) the State Patrol retirement plan established under chapter 352B;\n(4) the unclassified state employees retirement program of the Minnesota State Retirement System established under chapter 352D;\n(5) the general employee retirement plan of the Public Employees Retirement Association established under chapter 353;\n(6) the public employees police and fire retirement plan established under chapter 353;\n(7) the local government correctional employees retirement plan of the Public Employees Retirement Association established under chapter 353E;\n(8) the Teachers Retirement Association established under chapter 354;\n(9) the St. Paul Teachers Retirement Fund Association established under chapter 354A; and\n(10) the uniform judicial retirement plan established under chapter 490.\n(a) The treatment specified in this section applies if, after the accrual date of an annuity or benefit from an applicable plan or plans, a marriage dissolution decree or annulment decree is rendered that specifies that the designation of an optional annuity must be revoked and if the other requirements specified in this section are satisfied.\n(b) Notwithstanding any law to the contrary, if the applicable pension plan or plans have provisions of law that revise the monthly benefit amount payable to the primary annuitant upon the death of the individual named as the optional joint annuitant, the monthly benefit amount must be recomputed as though the individual that had been named as the optional joint annuitant died on the date a certified copy of the marriage dissolution or annulment decree is received by the chief administrative officer. Payment of any benefit adjustment under this section is prospective only.\n(a) This section does not apply if the marriage dissolution decree or annulment decree is not consistent with the requirements under section 518.58.\n(b) The pension plan benefit recipient must not designate, and the court may not require that the member designate, a subsequent optional annuity beneficiary.\n(c) This section does not apply if more than one surviving individual was named as an optional joint annuitant.\nTo receive the treatment provided in this section, an eligible retiree or disabilitant must provide, to the chief administrative officer of the applicable pension plan, a certified copy of the marriage dissolution or annulment decree. The retiree or disabilitant and the joint annuitant must also submit a form, prescribed by the chief administrative officer of the applicable pension plan and signed by both individuals, requesting the annuity bounce back as provided in subdivision 2. The individuals must also provide any other documentation the chief administrative officer may request.",
	"repealed": false
}