{
	"id": "103C.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.605",
	"title": "103C.605 COUNTY DETERMINATION OF PROJECT.",
	"text": "(a) The county board or joint county board, acting jointly under section 471.59, may take action on a project within the improvement work unit to construct or install works of improvement or part of the works of improvement pursuant to the recommendation report after receiving a petition.\n(b) The petition must be for a project signed by:\n(1) at least 25 percent of the owners of the land over which the proposed improvement work passes;\n(2) at least 25 percent of the owners of land where the proposed improvement is located;\n(3) the owners of at least 30 percent of the land area over which the proposed improvement work passes; or\n(4) the owners of at least 30 percent of the land area where the proposed project is located.\n(c) The petition must describe the land and request the county board or joint county board to hold a hearing on the practicability and desirability of implementing the project in accordance with the preliminary general plan and the recommendation report of the district board.\n(d) If the recommendation report specifies that part of the cost of the project is to be paid from the proceeds of assessments on benefited property, one or more of the petitioners, upon filing the petition and before action is taken on the petition, must file a bond to the county or counties conditioned as provided by section 103E.202, for a county drainage system, to be approved by the chair of the board.\nThe county board or joint county board shall set a time and place for the hearing on the petition, and give notice of the hearing as provided in section 103E.261, subdivision 1.\n(a) After the hearing the county board or joint county board may adopt a resolution directing further action on the project if it makes and states findings that implementation of the project as requested in the petition will be:\n(1) feasible;\n(2) in accordance with the recommendation report;\n(3) in furtherance of the objectives and purposes of the recommendation report; and\n(4) within the estimated cost for which funds may reasonably be expected to be available.\n(b) By the resolution the county board or joint county board shall determine the amount to be paid from the various sources of available or potentially available funds, including federal aid, district funds, assessments on benefited property, and other funds. The amount payable from district funds may not exceed the value of the general public benefit of the project to the district as determined by the district board.",
	"repealed": false
}