{
	"id": "82B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.19",
	"title": "82B.19 CONTINUING EDUCATION.",
	"text": "The commissioner must determine that a licensed real estate appraiser has met the continuing education requirements of this chapter before the commissioner renews a license. This determination must be based on, for a resident appraiser, course completion records uploaded electronically in a manner prescribed by the commissioner and, for a nonresident appraiser, course completion records presented by electronic transmission or uploaded electronically in a manner prescribed by the commissioner.\n[See Note.]\n(a) Deferrals may not be granted to appraisers, except in the case of individuals returning from active military duty, or individuals impacted by a state-declared or federally declared disaster. The commissioner may allow appraisers returning from active military duty to be placed in active status for a period of up to 90 days pending completion of all continuing education requirements. The commissioner may allow appraisers impacted by a state-declared or federally declared disaster that occurs within 90 days before the end of the continuing education cycle to remain or be placed in active status for a period of up to 90 days after the end of the appraiser's continuing education cycle, pending completion of all continuing education requirements.\n(b) This subdivision supersedes any conflicting provision in section 326.56, subdivision 2.\n(a) The commissioner may adopt rules to assure that persons renewing their licenses as licensed real estate appraisers have current knowledge of real property appraisal theories, practices, and techniques that will provide a high degree of service and protection to those members of the public with whom they deal in a professional relationship under authority of their license.\n(b) To the extent the commissioner considers it appropriate, courses or parts of courses may be considered to satisfy both continuing education requirements under this section and continuing real estate education requirements.\n(c) As a prerequisite for course approval, education providers must submit proposed monitoring methods, and systems for recording attendance sufficient to ensure that participants receive course credit only for portions actually attended.\nA license as a real estate appraiser that has been suspended for less than two years as a result of disciplinary action by the commissioner may not be reinstated unless the applicant presents evidence of completion of the continuing education required by this chapter. This requirement may not be imposed upon an applicant for reinstatement who has been required to successfully complete the current experience, education, and examination requirements for real estate appraiser licensure as a condition to reinstatement of a license.\nThe commissioner is authorized to establish a procedure for renewal of course accreditation.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"asynchronous educational offering\" has the meaning given in the most recent version of the Real Property Appraiser Qualification Criteria, as established by the Appraiser Qualifications Board; and\n(2) \"synchronous educational offering\" has the meaning given in the most recent version of the Real Property Appraiser Qualification Criteria, as established by the Appraiser Qualifications Board, and includes an educational process based on live or real-time instruction where there is no geographic separation of instructor and student.\n(b) Notwithstanding section 45.30, subdivisions 1 and 6, a real estate appraiser may submit, in a form prescribed by the commissioner, an application for continuing education credit for a synchronous educational offering that has not been submitted for prior approval in Minnesota. The commissioner must grant a real estate appraiser continuing education credit if:\n(1) the application is submitted on or before August 1 of the year in which the real estate appraiser license is due for renewal;\n(2) the synchronous educational offering has been approved for continuing education credit by the regulator of real estate appraisers in at least one other state or United States territory; and\n(3) an application is submitted by the real estate appraiser to the commissioner within 30 days of successful completion of the synchronous educational offering.\n(c) The application must include a certificate of successful completion from the synchronous educational offering provider. The commissioner must grant a real estate appraiser the same number of continuing education credits for the successful completion of the synchronous educational offering as was approved for the offering by the out-of-state real estate appraiser regulatory authority. The commissioner must grant a real estate appraiser continuing education credit within 60 days of the submission of the completed application for out-of-state continuing education credit.\n(d) The commissioner may charge a fee to a real estate appraiser, in an amount to be determined by the commissioner, to submit an application under this subdivision.\n(e) This subdivision does not apply to asynchronous educational offerings.",
	"repealed": false
}