{
	"id": "469.154",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.154",
	"title": "469.154 DEPARTMENT OF EMPLOYMENT AND ECONOMIC DEVELOPMENT DUTIES.",
	"text": "The Department of Employment and Economic Development shall investigate, assist, and advise municipalities, and report to the governor and the legislature concerning the operation of sections 469.152 to 469.165 and the projects undertaken under those sections.\nAny municipality or redevelopment agency contemplating the exercise of the powers granted by sections 469.152 to 469.165 may apply to the commissioner for information, advice, and assistance. The commissioner may handle such preliminary information in a confidential manner, to the extent requested by the municipality.\nNo municipality or redevelopment agency shall undertake any project authorized by sections 469.152 to 469.165, except a project referred to in section 469.153, subdivision 2, paragraph (g) or (j), unless its governing body finds that the project furthers the purposes stated in section 469.152, nor until the commissioner has approved the project, on the basis of preliminary information the commissioner requires, as tending to further the purposes and policies of sections 469.152 to 469.165. Approval shall not be deemed to be an approval by the commissioner or the state of the feasibility of the project or the terms of the revenue agreement to be executed or the bonds to be issued therefor, and the commissioner shall state this in communicating approval.\nPrior to submitting an application to the department requesting approval of a project pursuant to subdivision 3, the governing body or a committee of the governing body of the municipality or redevelopment agency shall conduct a public hearing on the proposal to undertake and finance the project. Notice of the time and place of hearing, and stating the general nature of the project and an estimate of the principal amount of bonds or other obligations to be issued to finance the project, shall be published at least once not less than 14 days nor more than 30 days prior to the date fixed for the hearing, in the official newspaper and a newspaper of general circulation of the municipality or redevelopment agency. The notice shall state that a draft copy of the proposed application to the department, together with all attachments and exhibits, shall be available for public inspection following the publication of the notice and shall specify the place and times where and when it will be so available. The governing body of the municipality or the redevelopment agency shall give all parties who appear at the hearing an opportunity to express their views with respect to the proposal to undertake and finance the project. Following the completion of the public hearing, the governing body of the municipality or redevelopment agency shall adopt a resolution determining whether or not to proceed with the project and its financing; it may thereafter apply to the department for approval of the project.\nEach municipality and redevelopment agency upon entering into a revenue agreement, except one pertaining to a project referred to in section 469.153, subdivision 2, paragraph (g) or (j), shall furnish the Employment and Economic Development Department on forms the department prescribes the following information concerning the project: The name of the contracting party, the nature of the enterprise, the location, approximate number of employees, the general terms and nature of the revenue agreement, the amount of bonds or notes issued, and other information the Employment and Economic Development Department deems advisable. The Employment and Economic Development Department shall keep a record of the information which shall be available to the public at times the department prescribes.\nMS 1996 [Repealed, 1997 c 203 art 4 s 73]\nEvery municipality, redevelopment agency, or other person undertaking a project financed wholly or in part under sections 469.152 to 469.165 or by similar financing mechanisms is encouraged to target employment opportunities to qualified individuals who are unemployed or economically disadvantaged as defined in the federal Job Training Partnership Act of 1982, Statutes at Large, volume 96, page 1322. The intent of this subdivision may be accomplished by mechanisms such as a first source agreement in which the employer agrees to use a designated employment office as a first source for employment recruitment, referral, and placement, and by other means.\nNot later than July 1, 1987, every municipality, redevelopment agency, or other person who undertakes a project financed wholly or in part by these financing mechanisms shall submit an employment report to the energy and economic development authority. The report shall be on forms provided by the Energy and Economic Development Authority and shall include, but need not be limited to, the following information:\n(1) the total number of jobs created by the project;\n(2) the number of unemployed and economically disadvantaged persons hired; and\n(3) the average wage level of the jobs created.",
	"repealed": false
}