{
	"id": "253B.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.22",
	"title": "253B.22 REVIEW BOARDS.",
	"text": "The executive board shall establish a review board of three or more persons for the Anoka-Metro Regional Treatment Center, Minnesota Security Hospital, and Minnesota Sex Offender Program to review the admission and retention of patients of that program receiving services under this chapter. One member shall be qualified in the diagnosis of mental illness, developmental disability, or chemical dependency, and one member shall be an attorney. The executive board may, upon written request from the appropriate federal authority, establish a review panel for any federal treatment facility within the state to review the admission and retention of patients hospitalized under this chapter. For any review board established for a federal treatment facility, one of the persons appointed by the executive board shall be the commissioner of veterans affairs or the designee of the commissioner of veterans affairs.\nEach program specified in subdivision 1 shall be visited by the review board at least once every six months. Upon request each patient in the program shall have the right to appear before the review board during the visit.\nThe head of each program specified in subdivision 1 shall notify each patient at the time of admission by a simple written statement of the patient's right to appear before the review board and the next date when the review board will visit that program. A request to appear before the review board need not be in writing. Any employee of the program receiving a patient's request to appear before the review board shall notify the head of the program of the request.\nThe review board shall review the admission and retention of patients at the program. The review board may examine the records of all patients admitted and may examine personally at its own instigation all patients who from the records or otherwise appear to justify reasonable doubt as to continued need of confinement in the program. The review board shall report its findings to the executive board and to the head of the program. The review board may also receive reports from patients, interested persons, and employees of the program, and investigate conditions affecting the care of patients.\nEach member of the review board shall receive compensation and reimbursement as established by the executive board.",
	"repealed": false
}