{
	"id": "72B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.03",
	"title": "72B.03 LICENSES.",
	"text": "(a) A person shall not act or hold out as an independent adjuster or public adjuster unless the person is licensed as an independent adjuster or public adjuster in accordance with this chapter, or is exempt from licensure as an independent adjuster or public adjuster under this chapter.\n(b) The definition of adjuster does not include, and a license as an adjuster is not required of, the following:\n(1) attorneys-at-law admitted to practice in this state, when acting in the attorney's professional capacity as an attorney;\n(2) a person employed solely to obtain facts surrounding a claim or to furnish technical assistance to a licensed adjuster;\n(3) an individual who is employed to investigate suspected fraudulent insurance claims but who does not adjust losses or determine claims payments;\n(4) a person who solely performs executive, administrative, managerial, or clerical duties or any combination of these duties and who does not investigate, negotiate, or settle claims with policyholders, claimants, or their legal representative;\n(5) a licensed health care provider or its employee who provides managed care services so long as the services do not include the determination of compensability;\n(6) a managed care organization or any of its employees or an employee of any organization providing managed care services so long as the services do not include the determination of compensability;\n(7) a person who settles only reinsurance or subrogation claims;\n(8) an officer, director, manager, or employee of an authorized insurer, a surplus lines insurer, a risk retention group, or an attorney-in-fact of a reciprocal insurer;\n(9) a United States manager of the United States branch of an alien insurer;\n(10) a person who investigates, negotiates, or settles life, accident and health, annuity, or disability insurance claims;\n(11) an individual employee, under a self-insured arrangement, who adjusts claims on behalf of the employee's employer;\n(12) a licensed insurance producer, attorney-in-fact of a reciprocal insurer, or managing general agent of the insurer to whom claim authority has been granted by the insurer;\n(13) a person authorized to adjust workers' compensation or disability claims under the authority of a third-party administrator license pursuant to section 60A.23, subdivision 8; or\n(14) an individual who:\n(i) collects claim information from, or furnishes claim information to, insureds or claimants; and\n(ii) conducts data entry including entering data into an automated claims adjudication system, provided that the individual is an employee of a licensed independent adjuster or its affiliate where no more than 25 such persons are under the supervision of one licensed independent adjuster or licensed insurance producer who is exempt from licensure under clause (12).\n(a) Unless denied licensure pursuant to section 72B.08, persons who have met the requirements of section 72B.041 must be issued an adjuster license. There shall be three classes of licenses, as follows:\n(1) independent adjuster's license;\n(2) public adjuster's license; and\n(3) crop hail adjuster's license.\n(b) An independent adjuster and a public adjuster may qualify for a license in one or more of the following lines of authority:\n(1) property and casualty; or\n(2) workers' compensation; or\n(3) crop.\n(c) Any person holding a license pursuant to this section is not required to hold any other independent adjuster, public adjuster, insurance, or self-insurance administrator license in this state pursuant to section 60A.23, subdivision 8, or any other provision, provided that the person does not act as an adjuster with respect to life, health, or annuity insurance, other than disability insurance.\n(d) An adjuster license remains in effect unless probated, suspended, revoked, or refused as long as the fee set forth in section 72B.041, subdivision 9, is paid and all other requirements for license renewal are met by the due date, otherwise, the license expires.\n(e) An adjuster whose license expires may, within 12 months of the renewal date, be reissued an adjuster license upon receipt of the renewal request, as prescribed by the commissioner; however, a penalty in the amount of double the unpaid renewal fee is required to reissue the expired license.\n(f) An adjuster who is unable to comply with license renewal procedures and requirements due to military service, long-term medical disability, or some other extenuating circumstance may request a waiver of same and a waiver of any examination requirement, fine, or other sanction imposed for failure to comply with renewal procedures.\n(g) An adjuster is subject to sections 72A.17 to 72A.32.\n(h) The adjuster must inform the commissioner by any means acceptable of any change in resident or business addresses for the home state or in legal name within ten days of the change.\n(i) The license must contain the licensee's name, address, and personal identification number; the dates of issuance and expiration; and any other information the commissioner deems necessary.\n(j) In order to assist in the performance of the commissioner's duties, the commissioner may contract with nongovernmental entities, including the National Association of Insurance Commissioners, its affiliates, or its subsidiaries, to perform any ministerial functions related to licensing that the commissioner may deem appropriate, including the collection of fees and data.\nNo insurer, agent, or other representative of an insurer nor any adjuster shall pay any fee or other compensation to any person for acting as an adjuster, except to a person duly licensed to so act or to a person not required to be licensed by sections 72B.01 to 72B.136; and it shall be unlawful for any person to act as an independent adjuster or a public adjuster who is not duly licensed, or excluded from the licensing requirement.",
	"repealed": false
}