{
	"id": "138.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.36",
	"title": "138.36 LICENSES.",
	"text": "The director of the historical society and the state archaeologist shall formulate and issue such provisions for licenses as are required to carry out and enforce sections 138.31 to 138.42.\nThe director of the Minnesota Historical Society, acting as an agent of the state, may issue a license to a qualified person approved by the state archaeologist to engage in field archaeology on a specified state site. The director of the Minnesota Historical Society may also issue a license to a qualified person, either in connection with the right to engage in field archaeology on a specified site, or alone, to engage in purely preliminary or exploratory activities in a specified area where a site is thought to exist. If a state site or an area to be described in a license is under the jurisdiction of any other agency of the state, or, if the field archaeology to be licensed may interfere with a project of any other agency, the applicant for a permit shall obtain the approval of that agency. The attorney general upon recommendation of the director of the historical society may apply to the district court for injunctive relief to restrain activities which in the director's opinion may damage historical or archaeological sites on public lands or waters.\nThe director of the historical society or the state archaeologist may waive or abridge provisions of sections 138.31 to 138.42 in an emergency in which objects of interest to the state are found in the course of construction or demolition work, or in other situations in which time is of the essence to save objects or gather data. The director of the historical society or the state archaeologist may issue short form emergency licenses to persons not otherwise qualified to enable them to salvage objects or gather data in the time available.\nThe director of the Minnesota Historical Society may renew any license for another calendar year. The application for renewal shall be made in the form and contain the information required by the state archaeologist.\nThe director of the historical society or the state archaeologist may revoke or suspend a license because of the improper conduct of the licensee, the use of improper or substandard methods, or other good cause.\nAny person whose application for a license under this section has been denied or whose license has been modified, suspended, or revoked, may appeal the decision within 30 days of receiving written notice of the decision by filing a written request with the commissioner for a contested case hearing under chapter 14. If the applicant does not request a contested case hearing within 30 days after receiving written notice of the decision, the decision becomes final and the applicant may not appeal the decision.",
	"repealed": false
}