{
	"id": "403.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.21",
	"title": "403.21 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 403.21 to 403.40.\n\"Allied Radio Matrix for Emergency Response,\" \"ARMER,\" \"statewide, shared, trunked radio, and communication system,\" or \"statewide public safety radio system\" means the public safety radio system established under section 403.36.\nMS 2012 [Renumbered subd 7a]\n\"First phase\" or \"first phase of the regionwide public safety radio communication system\" means the initial backbone which serves the following ten-county metropolitan area: Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, and Washington Counties.\n\"Local elected officials\" means any elected official of a local government.\n\"Local government\" means any county, home rule charter or statutory city, or town.\nMS 2012 [Repealed, 2013 c 32 s 12]\n\"Plan\" or \"regionwide public safety radio system communication plan\" means a plan adopted by a regional radio board.\n\"Statewide Radio Board,\" \"radio board,\" or \"board\" means the Statewide Radio Board established under section 403.36 and where the Statewide Radio Board has affirmatively elected to become a Statewide Emergency Communication Board as provided in section 403.382 it shall mean the Statewide Emergency Communication Board as the successor to the Statewide Radio Board.\n\"Subsystems\" or \"public safety radio subsystems\" means systems identified in the plan or a plan developed under section 403.36 as subsystems interconnected by the system backbone and operated by a regional radio board or local government units for their own internal operations.\n\"System backbone\" or \"backbone\" means a public safety radio communication system that consists of a shared, trunked, communication, and interoperability infrastructure network, including, but not limited to, radio towers and associated structures and equipment, the elements of which are identified in the regionwide public safety radio communication system plan and the statewide radio communication plan under section 403.36.\n\"Second phase\" means the enhancement of the phase one backbone by local government units building subsystems in the metropolitan area that did not build their own subsystems in the first phase.\n\"Third phase\" means an extension of the backbone system to serve the southeast and central districts of the State Patrol.\n\"Greater Minnesota\" means the area of the state outside the ten-county metropolitan area served by the first phase.\n\"Regional radio board\" or \"regional board\" means a regional radio board established under section 403.39 and shall include any successor organization to the regional radio board.",
	"repealed": false
}