{
	"id": "507.327",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.327",
	"title": "507.327 MORTGAGES, DEEDS OF TRUST AND OTHER INSTRUMENTS OF PUBLIC UTILITIES; FILING AND RECORDING.",
	"text": "A mortgage or deed of trust to secure a debt executed by a public utility as defined in section 336B.01 covering the whole or part of its easements or other less than fee simple interests in real estate used in the transmission or distribution of gas, electric, or telephone service, and also covering the fixtures of the public utility which are annexed to it, may be filed in the Office of the Secretary of State along with, or as part of, the financing statement covering the fixtures. The filing of the mortgage or deed of trust has the same effect, and is notice of the rights and interests of the mortgagee or trustee in the easements and other less than fee simple interests in real estate to the same extent, as if the mortgage or deed of trust were duly recorded in the office of the county recorder, or duly registered in the office of the registrar of titles, of the counties in which the real estate is situated. The effectiveness of the filing will terminate at the same time as provided in section 336B.02, subdivision 3, for the termination of the effectiveness of fixture filing.\nFor the purposes of this section, a mortgage or deed of trust filed under this section contains a sufficient description to give notice of the rights and interests of the mortgagee or trustee in the easements and other less than fee simple interests in the real estate used for the transmission and distribution of gas, electric, or telephone service of the public utility if the mortgage or deed of trust states that the security includes rights-of-way of or transmission or distribution systems of or lines of the public utility, or all property owned by the public utility.\nA mortgage or deed of trust filed before March 28, 1974, along with, or as part of, the financing statements filed under section 300.112, which complies with the provisions of this section, is filed under this section as of March 28, 1974.\nThis section does not apply to real estate owned in fee simple by a public utility.",
	"repealed": false
}