{
	"id": "124D.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.50",
	"title": "124D.50 SERVICE-LEARNING AND WORK-BASED LEARNING CURRICULUM AND PROGRAMS.",
	"text": "The governor's Workforce Development Board must assist the commissioner in studying how to combine community service activities and service-learning with work-based learning programs.\nThe commissioner, in consultation with the commission, shall develop a service-learning program curriculum that includes a policy framework and strategies for youth community service and an infrastructure for mentoring youth. The commissioner shall include in the curriculum at least the following:\n(1) youth community service strategies that enable young people to make significant contributions to the welfare of their community through such organizations as schools, colleges, government agencies, and community-based organizations or through individual efforts;\n(2) mentoring strategies that enable young people to be matched with caring, responsible individuals who can encourage and guide the young people in their personal growth and development;\n(3) guidelines, criteria, and procedures for community service programs that incorporate the results of the study in subdivision 1; and\n(4) criteria for community service activities and service-learning.\nThe service-learning curriculum must accommodate students' grade level or the last completed grade level of the participants not currently enrolled in school. Schools must provide at least the following:\n(1) for students in grades 7 to 9, an opportunity to learn about service-learning activities and possible occupations;\n(2) for students in grade 10, an opportunity to apply for service-learning under section 124D.19 subdivision 10, and youth apprenticeship programs; and\n(3) for students in grades 11 and 12 and young people not currently enrolled in school, an opportunity to become involved in community service activities, participate in youth apprenticeship programs, and, depending upon the individual's demonstrated abilities, complete high school or pursue postsecondary coursework.\n(a) The Minnesota Commission on National and Community Service in cooperation with the governor's Workforce Development Board, the commissioner and the Minnesota Office of Higher Education, shall provide for those participants who successfully complete youth community service under sections 124D.39 to 124D.44, the following:\n(1) for those who have a high school diploma or its equivalent, an opportunity to participate in a youth apprenticeship program at a community or technical college; and\n(2) for those who are postsecondary students, an opportunity to participate in an educational program that supplements postsecondary courses leading to a degree or a statewide credential of academic and occupational proficiency.\n(b) The governor's Workforce Development Board, in cooperation with the Board of Trustees of the Minnesota State Colleges and Universities, must establish a mechanism to transfer credit earned in a youth apprenticeship program between the technical colleges and other postsecondary institutions offering applied associate degrees.",
	"repealed": false
}