{
	"id": "289A.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.39",
	"title": "289A.39 LIMITATIONS; ARMED SERVICES.",
	"text": "(a) The limitations of time provided by this chapter, chapter 290 relating to income taxes, chapter 271 relating to the Tax Court for filing returns, paying taxes, claiming refunds, commencing action thereon, appealing to the Tax Court from orders relating to income taxes, and the filing of petitions under chapter 278 that would otherwise be due prior to May 1 of the year in which the taxes are payable, and appealing to the supreme court from decisions of the Tax Court relating to income taxes are extended, as provided in section 7508 of the Internal Revenue Code.\n(b) If a member of the National Guard or reserves is called to active duty in the armed forces, the limitations of time provided by this chapter and chapters 290 and 290A relating to income taxes and claims for property tax refunds are extended by the following period of time:\n(1) in the case of an individual whose active service is in the United States, six months; or\n(2) in the case of an individual whose active service includes service abroad, the period of initial service plus six months.\nNothing in this paragraph reduces the time within which an act is required or permitted under paragraph (a).\n(c) If an individual entitled to the benefit of paragraph (a) files a return during the period disregarded under paragraph (a), interest must be paid on an overpayment or refundable credit from the due date of the return, notwithstanding section 289A.56, subdivision 2.\n(d) The provisions of this subdivision apply to the spouse of an individual entitled to the benefits of this subdivision with respect to a joint return filed by the spouses.\nInterest on income tax must not be assessed or collected from an individual, and interest must not be paid upon an income tax refund to any individual, with respect to whom, and for the period during which, the limitations or time are extended as provided in subdivision 1. A penalty will not be assessed or collected from an individual for failure during that period to perform an act required by the laws described in subdivision 1.\nThe time limitations provided for the assessment of a tax, penalty, or interest, are extended, with respect to those individuals and for the period provided in subdivision 1 and for a further period of six months; and the time limitations for the commencement of action to collect a tax, penalty, or interest from those individuals are extended for a period ending six months after the expiration of the time for assessment as provided in this section.\nNothing in this section reduces the time within which an act is required or permitted under this chapter.\nThis section does not extend the time for performing any of the acts set forth in this chapter beyond the expiration of three months after the appointment of a personal representative or guardian, in this state, for any individual described in this section, except as provided in subdivision 6.\nIf an individual dies while in active service as a member of the military or naval forces of the United States or of any of the United Nations, an income tax imposed under chapter 290 will not be imposed for the taxable year in which the individual dies. Income tax imposed for a prior taxable year that is unpaid at the date of death (including additions to the tax, penalties) must not be assessed, and if assessed, the assessment must be abated. In addition, upon the filing of a claim for refund within seven years from the date the return was filed, the tax paid or collected with respect to any taxable year beginning after December 31, 1949, during which the decedent was in active service must be refunded.\nIf an individual dies while a civilian employee of the United States as a result of wounds or injuries incurred while the individual was a civilian employee of the United States, and which were incurred outside the United States in a terroristic or military action, a tax imposed by chapter 290 does not apply with respect to the taxable year in which the death falls and with respect to any prior taxable years in the period beginning with the last taxable year ending before the taxable year in which the wounds or injury were incurred. Terroristic or military action has the meaning given it in section 692(c)(2) of the Internal Revenue Code.",
	"repealed": false
}