{
	"id": "326B.972",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.972",
	"title": "326B.972 LICENSE REQUIREMENT.",
	"text": "(a) To operate a boiler, steam engine, or steam turbine an individual must have received a license for the grade covering that boiler, steam engine, or steam turbine. Except for licenses described in section 326B.956 and except for provisional licenses described in paragraphs (d) to (g):\n(1) all initial licenses shall be for two years;\n(2) the commissioner shall in a manner determined by the commissioner, without the need for any rulemaking under chapter 14, phase in the renewal of licenses from one year to two years; and\n(3) by June 30, 2011, all licenses shall be two-year licenses.\n(b) For purposes of sections 326B.95 to 326B.998, \"operation\" means the act of manipulating and monitoring boilers or appurtenances for their intended purpose and to ensure safety, except that operation does not include remote monitoring of an automatic boiler. When a boiler is monitored from a remote location, the only function that may be performed remotely upon the boiler is an emergency shutdown in alarm situations.\n(c) No individual under the influence of illegal drugs or alcohol may operate a boiler, steam engine, or steam turbine or monitor an automatic boiler.\n(d) The commissioner may issue a provisional license to allow an employee of a high pressure boiler plant to operate boilers greater than 500 horsepower at only that boiler plant if:\n(1) the boiler plant has a designated chief engineer in accordance with Minnesota Rules, part 5225.0410;\n(2) the boiler plant employee holds a valid license as a second-class engineer, Grade A or B;\n(3) the chief engineer in charge of the boiler plant submits an application to the commissioner on a form prescribed by the commissioner;\n(4) the chief engineer in charge of the boiler plant and an authorized representative of the owner of the boiler plant both sign the application for the provisional license;\n(5) the owner of the boiler plant has a documented training program with examination for boilers and equipment at the boiler plant to train and test the boiler plant employee; and\n(6) if the application were to be granted, the total number of provisional licenses for employees of the boiler plant would not exceed the total number of properly licensed first-class engineers and chief engineers responsible for the safe operation of the boilers at the boiler plant.\n(e) A public utility, cooperative electric association, generation and transmission cooperative electric association, municipal power agency, or municipal electric utility that employs licensed boiler operators who are subject to an existing labor contract may use a provisional licensee as an operator only if using the provisional licensee does not violate the labor contract.\n(f) A provisional license is valid for 36 months from the date of issue, unless revoked before the expiration date. A provisional license may not be renewed.\n(g) The commissioner may issue no more than two provisional licenses to any individual within a four-year period.",
	"repealed": false
}