{
	"id": "414.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.061",
	"title": "414.061 INCORPORATED LAND; CONCURRENT DETACHMENT, ANNEXATION.",
	"text": "Property of one municipality which abuts another may be concurrently detached and annexed by the procedure set forth in this section. The proceeding shall be initiated by (1) submitting to the chief administrative law judge resolutions of both municipalities describing the land and stating their desire to detach and annex the land, or (2) submitting to the chief administrative law judge the petition of property owners and the resolution of at least one municipality describing the land and stating its desire to have the land concurrently detached and annexed as provided in the property owners' petition.\nIf both municipalities have submitted resolutions under subdivision 1 and the resolutions are in order, the chief administrative law judge may order the detachment and annexation.\nThe concurrent detachment and annexation shall be effective upon the issuance of the order, or at such later date as provided by the order.\nA copy of the annexation order must be delivered immediately by the chief administrative law judge to the appropriate county auditors.\nFor the purposes of taxation, if the annexation becomes effective on or before August 1 of a levy year, the municipality acquiring the detached area of another municipality may levy on it beginning with that same levy year. If the annexation becomes effective after August 1 of a levy year, the municipality losing the detached area may continue to levy on it for that levy year, and the municipality acquiring the detached area may not levy on it until the following levy year.\nThe chief administrative law judge (1) may initiate proceedings for the concurrent detachment and annexation of portions of one municipality completely surrounded by another municipality, or (2) may act upon the petition of all of the owners of property in the completely surrounded area. In such cases the chief administrative law judge shall conduct hearings and issue an order pursuant to section 414.09. In arriving at a decision, the chief administrative law judge shall consider the factors in section 414.02, subdivision 3. The chief administrative law judge shall order the proposed action on finding that it will be for the best interests of the municipalities and the property owners. In all cases, the chief administrative law judge shall set forth the factors which are the basis for the decision.\nMS 1994 [Repealed, 1996 c 303 s 19]\nProperty owners may initiate proceedings for the concurrent detachment of their property from one municipality and its annexation to an adjacent municipality by a petition signed by all of them that they submit to the chief administrative law judge accompanied by a resolution of the city council of at least one of the affected municipalities. The chief administrative law judge shall conduct hearings and issue an order pursuant to section 414.09. In arriving at a decision, the chief administrative law judge shall consider the factors in section 414.02, subdivision 3. The chief administrative law judge shall order the proposed action on finding that it will be for the best interests of the municipalities and the property owner. In all cases, the chief administrative law judge shall set forth the factors which are the basis for the decision.",
	"repealed": false
}