{
	"id": "204C.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.19",
	"title": "204C.19 COUNTING VOTES; PENALTY.",
	"text": "When the hours for voting have ended and all voting has concluded, the election judges shall immediately count the votes cast at the election. The count shall be held at the polling place and shall be public. It shall be continued without intermission until it is completed and the results are declared, except that the election judges may recess for meals or other necessary purposes. During the count no one except the election judges shall handle the ballots. Any other individual who touches or interferes with ballots during the counting or any election judge who permits such touching or interference is guilty of a misdemeanor.\nExcept as otherwise provided in this subdivision, the ballot boxes shall be opened, the votes counted, and the total declared. The election judges on each counting team shall be evenly divided between the major political parties. The numbers entered on the summary sheet shall not be considered final until the ballots in all the boxes have been counted and corrections have been made if ballots have been deposited in the wrong boxes.\nNo count results from any precinct shall be disclosed by any election judge or other individual until all count results from that precinct are available, nor shall the public media disclose any count results from any precinct before the time when voting is scheduled to end in the state. Count results from absentee ballots received by the county after 3:00 p.m. on election day may be added to the total count results after the initial results reporting of the precinct. If the precinct results do not include all absentee ballots, the county must report to the secretary of state and on the county's website the number of absentee ballots remaining to be processed. After processing the remaining ballots, the county must post on the county's website how many of the remaining ballots were accepted and added to the totals and how many were rejected and therefore not counted.",
	"repealed": false
}