{
	"id": "18B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.14",
	"title": "18B.14 PESTICIDE STORAGE.",
	"text": "(a) A person may store or display pesticides and their containers only in the original container and separated from food, feed, seed, livestock remedies, drugs, plants, and other products or materials stored, displayed, or offered for sale in a manner that prevents contamination which would cause injury or damage to the other products or materials.\n(b) A person may not allow open pesticide containers to be displayed for sale under any circumstances.\n(a) A person storing pesticides in containers of a rated capacity of 500 gallons or more for more than ten consecutive days at a bulk pesticide storage facility must obtain a pesticide storage permit from the commissioner as required by rule.\n(b) Applications must be on forms provided by the commissioner containing information established by rule. The initial application for a permit must be accompanied by a nonrefundable application fee of $100 for each location where the pesticides are stored. An application for a facility that includes both fertilizers as regulated under chapter 18C and bulk pesticides as regulated under this chapter shall pay only one application fee of $100.\n(c) The commissioner shall by rule develop and implement a program to regulate bulk pesticides. The rules must include installation of secondary containment devices, storage site security, safeguards, notification of storage site locations, criteria for permit approval, a schedule for compliance, and other appropriate requirements necessary to minimize potential adverse effects on the environment. The rules must conform with existing rules of the Pollution Control Agency.\n(d) A person must obtain a permit from the commissioner on forms provided by the commissioner before the person constructs or substantially alters a bulk pesticide storage facility. If an application is incomplete, the commissioner must notify the applicant as soon as possible. The permit must be acted upon within 30 days after receiving a completed application.\n(e) An application to substantially alter a facility must be accompanied by a $50 fee. An application for a facility that includes both fertilizers regulated under chapter 18C and bulk pesticides regulated under this chapter shall pay only one application fee of $50.\n(f) An additional fee of $250 must be paid by a person who begins construction of or substantially alters a bulk agricultural chemical storage facility before a permit is issued by the commissioner, except that the $250 additional fee may not be assessed if the person submits a permit application with the required fee to the commissioner before completing the construction or substantial alteration.",
	"repealed": false
}