{
	"id": "296A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.24",
	"title": "296A.24 CONTRABAND.",
	"text": "The commissioner or authorized agents may seize gasoline or special fuel being transported for delivery in violation of section 296A.03, subdivision 1, and any vehicle or other method of conveyance used for transporting the gasoline or special fuel. Any untaxed motor vehicle fuel that is received by a person other than a licensee is subject to seizure along with the vehicle or other means of transportation used to transport the motor vehicle fuel. Any motor vehicle fuel, along with the transporting vehicle, brought into the state of Minnesota by a transporter for use, distribution, storage, or sale that is not supported by a manifest, bill of lading, or invoice, reflecting the licensed distributor responsible for the tax and/or fees is subject to seizure by the Minnesota Department of Revenue. Property seized under this subdivision is subject to forfeiture as provided in subdivision 2.\n(a) Within ten days after the seizure, the person making the seizure shall serve by certified mail an inventory of the vehicle or property seized on the person from whom the seizure was made, if known, and on any person known or believed to have any right, title, interest, or lien on the vehicle or property, at the last known address, and file a copy with the commissioner. The notice must include an explanation of the right to demand a judicial forfeiture determination.\n(b) Within 60 days after the date of service of the inventory, which is the date of mailing, the person from whom the vehicle or property was seized or any person claiming an interest in it may file a demand for a judicial determination of whether the vehicle or property was lawfully subject to seizure and forfeiture. The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service of a copy of the complaint on the commissioner of revenue, and the standard filing fee for civil actions unless the petitioner has the right to sue in forma pauperis under section 563.01. If the value of the seized property or vehicle is $15,000 or less, the claimant may file an action in conciliation court for its recovery. If the value of the seized property or vehicle is less than $500, the claimant does not have to pay the conciliation court filing fee.\n(c) The complaint must be captioned in the name of the claimant as plaintiff and the seized property or vehicle as defendant, and must state with specificity the grounds on which the claimant alleges the property or vehicle was improperly seized and the plaintiff's interest in the property or vehicle seized. No responsive pleading is required of the commissioner and no court fees may be charged for the commissioner's appearance in the matter. The proceedings are governed by the Rules of Civil Procedure. Notwithstanding any law to the contrary, an action for the return of property or a vehicle seized under this section may not be maintained by or on behalf of any person who has been served with an inventory unless the person has complied with this subdivision. The court shall hear the action without a jury and shall try and determine the issues of fact and law involved.\n(d) When a judgment of forfeiture is entered, the commissioner may, unless the judgment is stayed pending an appeal, either:\n(1) cause the forfeited gasoline or special fuel to be destroyed; or\n(2) cause the forfeited property in clause (1) or vehicle to be sold at public auction as provided by law. After deducting the expense of keeping the property and vehicle and the costs of the sale, the commissioner shall pay from the funds collected all liens according to their priority, which are established as being bona fide and as existing without the lienor having any notice or knowledge that the property or vehicle was being used or was intended to be used for or in connection with any violation, and shall pay the balance of the proceeds into the general fund.\n(e) If no demand for judicial determination is made, the property or vehicle seized must be considered forfeited to the state by operation of law and may be disposed of by the commissioner as provided where there has been a judgment of forfeiture.\n[Repealed, 1Sp2001 c 5 art 18 s 11]",
	"repealed": false
}