{
	"id": "259.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.25",
	"title": "259.25 AGREEMENT CONFERRING AUTHORITY TO PLACE FOR ADOPTION.",
	"text": "The parents and guardian, if there be one, of a child may enter into a written agreement with the commissioner of children, youth, and families or an agency, giving the commissioner or such agency authority to place the child for adoption. If an unmarried parent is under the age of 18 years the written consent of the parents and guardian, if any, of the minor parent also shall be required; if either or both of the parents are disqualified from giving such consent for any of the reasons enumerated in section 259.24, subdivision 1, then the written consent of the guardian shall be required. The agreement and consent shall be in the form prescribed by the commissioner and shall contain notice to the parent of the substance of subdivision 2a providing for the right to revoke the agreement. The agreement and consent must contain the following written notice in all capital letters at least one-eighth inch high:\n\"This agency will submit your consent to adoption to the court. The consent itself does not terminate your parental rights. Parental rights to a child may be terminated only by an adoption decree or by a court order terminating parental rights. Unless the child is adopted or your parental rights are terminated, you may be asked to support the child.\"\nThe agreement shall be executed by the commissioner or agency, or one of their authorized agents, and all other necessary parties, and shall be filed, together with the consent, in the proceedings for the adoption of the child.\nIf, after the execution of an agreement and consent under this section, the child is diagnosed with a medical or psychological condition that may present a substantial barrier to adoption, the child-placing agency shall make reasonable efforts to give notice of this fact to a party to the agreement and consent. If a child is not adopted within two years after an agreement and consent are executed under this subdivision, the agency that executed the agreement shall so notify a parent who was a party to the agreement and request the parent to take custody of the child or to file a petition for termination of parental rights. This notice must be provided to the parent in a personal and confidential manner. A parent who has executed an agreement under this subdivision shall, upon request to the agency, be informed of whether the child has been adopted.\n[Repealed, 1980 c 561 s 14]\nA parent's agreement to authorize placing a child for adoption may be revoked for any reason within ten working days after the agreement is executed. Written notification of revocation must be received by the agency which was given authority to place the child no later than the tenth working day after the agreement is executed. On the day following the tenth working day after execution the agreement shall become irrevocable, except upon order of a court of competent jurisdiction after written findings that the agreement was obtained by fraud. Proceedings to determine the existence of fraud shall be conducted as provided in section 259.24, subdivision 6a, for proceedings to determine fraud in obtaining consent.",
	"repealed": false
}