{
	"id": "216C.264",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.264",
	"title": "216C.264 COORDINATING RESIDENTIAL WEATHERIZATION PROGRAMS.",
	"text": "The department is the state agency to apply for, receive, and disburse money made available to the state by federal law for the purpose of weatherizing the residences of low-income persons. The commissioner must coordinate available federal money with state money appropriated for this purpose.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Low-income conservation program\" means a utility program that offers energy conservation services to low-income households under sections 216B.2403, subdivision 5, and 216B.241, subdivision 7.\n(c) \"Preweatherization measure\" has the meaning given in section 216B.2402, subdivision 20.\n(d) \"Weatherization assistance program\" means the federal program described in Code of Federal Regulations, title 10, part 440 et seq., designed to assist low-income households reduce energy use.\n(e) \"Weatherization assistance services\" means the energy measures installed in households under the weatherization assistance program.\nA preweatherization program is established in the department. The purpose of the program is to provide grants for preweatherization services, as defined under section 216B.2402, subdivision 20, in order to expand the breadth and depth of services provided to income-eligible households in Minnesota.\n(a) A preweatherization account is created as a separate account in the special revenue fund of the state treasury. The account consists of money provided by law, donated, allotted, transferred, or otherwise provided to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund and remains in the account until expended. The commissioner must manage the account.\n(b) Money in the account is appropriated to the commissioner to pay for (1) grants issued under the program, and (2) the reasonable costs incurred by the commissioner to administer the program.\nThe commissioner must make grants of federal and state money to community action agencies and other public or private nonprofit agencies for the purpose of weatherizing the residences of low-income persons.\nIn the case of any grant made to an owner of a rental dwelling unit for weatherization, the commissioner must require that (1) the benefits of weatherization assistance in connection with the dwelling unit accrue primarily to the low-income family that resides in the unit; (2) the rents on the dwelling unit will not be raised because of any increase in value due solely to the weatherization assistance; and (3) no undue or excessive enhancement will occur to the value of the dwelling unit.\n[Repealed by amendment, 2011 c 97 s 28]\n(a) The commissioner must distribute supplementary state grants in a manner consistent with the goal of producing the maximum number of weatherized units. Supplementary state grants are provided primarily to pay for and may be used to:\n(1) address physical deficiencies in a residence that increase heat loss, including deficiencies that prohibit the residence from being eligible to receive federal weatherization assistance;\n(2) install eligible preweatherization measures established by the commissioner, as required under section 216B.241, subdivision 7, paragraph (g);\n(3) increase the number of weatherized residences;\n(4) conduct outreach activities to make income-eligible households aware of available weatherization services, to assist applicants in filling out applications for weatherization assistance, and to provide translation services when necessary;\n(5) enable projects in multifamily buildings to proceed even if the project cannot comply with the federal requirement that projects must be completed within the same federal fiscal year in which the project is begun;\n(6) expand weatherization training opportunities in existing and new training programs;\n(7) pay additional labor costs for the federal weatherization program; and\n(8) provide an incentive for the increased production of weatherized units.\n(b) Criteria used to allocate state grants to local agencies include existing local agency production levels, emergency needs, and the potential to maintain or increase acceptable levels of production in the area.\n(c) An eligible local agency may receive advance funding for 90 days' production, but thereafter must receive grants solely on the basis of the program criteria under this subdivision.\nTo the extent allowed by federal regulations, the commissioner must ensure that the same income eligibility criteria apply to both the weatherization program and the energy assistance program.\nThe commissioner must provide grants to weatherization service providers to address physical deficiencies and install weatherization and preweatherization measures in residential buildings occupied by eligible low-income households.",
	"repealed": false
}