{
	"id": "253D.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.18",
	"title": "253D.18 ADMINISTRATIVE RESTRICTION.",
	"text": "(a) A committed person has the right to be free from unnecessary or excessive administrative restriction. Administrative restriction shall not be used for the convenience of staff, for retaliation for filing complaints, or as a substitute for program treatment. Administrative restriction may not involve any further deprivation of privileges than is necessary.\n(b) Administrative restriction may include separate and secure housing.\n(c) Committed persons under administrative restriction shall not be limited in access to their attorney.\n(d) If a committed person is placed on administrative restriction because the committed person is suspected of committing a crime, the secure treatment facility must report the crime to the appropriate police agency within 24 hours of the beginning of administrative restriction. The committed person must be released from administrative restriction if a police agency does not begin an investigation within 72 hours of the report.\n(e) A committed person placed on administrative restriction because the committed person is a subject of a criminal investigation must be released from administrative restriction when the investigation is completed. If the committed person is charged with a crime following the investigation, administrative restriction may continue until the charge is disposed of.\n(f) The secure treatment facility must notify the committed person's attorney of the committed person being placed on administrative restriction within 24 hours after the beginning of administrative restriction.\n(g) The executive board shall establish policies and procedures according to section 246C.10, regarding the use of administrative restriction. The policies and procedures shall identify the implementation and termination of administrative restrictions. Use of administration restriction and the reason associated with the use shall be documented in the committed person's medical record.",
	"repealed": false
}