{
	"id": "541.024",
	"url": "https://www.revisor.mn.gov/statutes/cite/541.024",
	"title": "541.024 LIMITATION OF ACTIONS AFFECTING TITLE TO OR POSSESSION OF TAX-FORFEITED LANDS.",
	"text": "As against a real estate title based upon or derived from a county auditor's certificate of forfeiture, or auditor's certificate of sale or state assignment certificate which has been of record for at least four years in the office of the county recorder or in the office of the registrar of titles, no action affecting the possession or title of the real estate shall be commenced on or after June 15, 1978, to enforce any adverse right, claim, interest, incumbrance, or lien, based upon the alleged invalidity of the county auditor's certificate of forfeiture, or auditor's certificate of sale or state assignment certificate.\nThis section shall not affect any rights of the federal government or any rights of a person in actual, open, hostile, notorious, and exclusive possession of the real estate on the date of the placing of record of the county auditor's certificate of forfeiture, auditor's certificate of sale or state assignment certificate and continuously thereafter to the time of the commencement of an action.\nA claimant under any instrument, event or transaction barred by this section shall be conclusively presumed to have abandoned all right, claim, interest, incumbrance or lien based thereon; and the title based upon or derived from the county auditor's certificate of forfeiture, auditor's certificate of sale, or state assignment certificate shall be deemed marketable. It is the policy of the state of Minnesota that, except as provided by Laws 1977, Chapter 265, unadjudicated adverse rights shall not fetter the marketability of tax titles of real estate.\nThis section does not extend the right to commence any action beyond the date on which the right would be extinguished under section 284.28 or any other law.\nThis section applies to real estate titles based upon or derived from a county auditor's certificate of forfeiture, or auditor's certificate of sale, or state assignment certificate issued prior to June 15, 1977.",
	"repealed": false
}