{
	"id": "245A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.06",
	"title": "245A.06 CORRECTION ORDER AND CONDITIONAL LICENSE.",
	"text": "(a) If the commissioner finds that the applicant or license holder has failed to comply with an applicable law or rule and this failure does not imminently endanger the health, safety, or rights of the persons served by the program, the commissioner may issue a correction order and an order of conditional license to the applicant or license holder. When issuing a conditional license, the commissioner shall consider the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of persons served by the program. The correction order or conditional license must state the following in plain language:\n(1) the conditions that constitute a violation of the law or rule;\n(2) the specific law or rule violated;\n(3) the time allowed to correct each violation; and\n(4) if a license is made conditional, the length and terms of the conditional license, and the reasons for making the license conditional.\n(b) Nothing in this section prohibits the commissioner from proposing a sanction as specified in section 245A.07, prior to issuing a correction order or conditional license.\n(c) The commissioner may issue a correction order and an order of conditional license to the applicant or license holder through the provider licensing and reporting hub.\n(a) For programs licensed under both this chapter and chapter 245D, if the license holder operates more than one service site under a single license governed by chapter 245D, the order issued under this section shall be specific to the service site or sites at which the violations of applicable law or rules occurred. The order shall not apply to other service sites governed by chapter 245D and operated by the same license holder unless the commissioner has included in the order the articulable basis for applying the order to another service site.\n(b) If the commissioner has issued more than one license to the license holder under this chapter, the conditions imposed under this section shall be specific to the license for the program at which the violations of applicable law or rules occurred and shall not apply to other licenses held by the same license holder if those programs are being operated in substantial compliance with applicable law and rules.\n(a) If the applicant or license holder believes that the contents of the commissioner's correction order are in error, the applicant or license holder may ask the Department of Human Services to reconsider the parts of the correction order that are alleged to be in error. The request for reconsideration must be made in writing and must be postmarked and sent to the commissioner within 20 calendar days after receipt of the correction order by the applicant or license holder or submitted in the provider licensing and reporting hub within 20 calendar days from the date the commissioner issued the order through the hub, and:\n(1) specify the parts of the correction order that are alleged to be in error;\n(2) explain why they are in error; and\n(3) include documentation to support the allegation of error.\nUpon implementation of the provider licensing and reporting hub, the provider must use the hub to request reconsideration. A request for reconsideration does not stay any provisions or requirements of the correction order. The commissioner's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\n(b) This paragraph applies only to licensed family child care providers. A licensed family child care provider who requests reconsideration of a correction order under paragraph (a) may also request, on a form and in the manner prescribed by the commissioner, that the commissioner expedite the review if:\n(1) the provider is challenging a violation and provides a description of how complying with the corrective action for that violation would require the substantial expenditure of funds or a significant change to their program; and\n(2) describes what actions the provider will take in lieu of the corrective action ordered to ensure the health and safety of children in care pending the commissioner's review of the correction order.\nIf the commissioner finds that the applicant or license holder has not corrected the violations specified in the correction order or conditional license, the commissioner may impose a fine and order other licensing sanctions pursuant to section 245A.07.\n(a) If a license is made conditional, the license holder must be notified of the order by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the notice must be mailed to the address shown on the application or the last known address of the license holder. The notice must state the reasons the conditional license was ordered and must inform the license holder of the right to request reconsideration of the conditional license by the commissioner. The license holder may request reconsideration of the order of conditional license by notifying the commissioner by certified mail, by personal service, or through the provider licensing and reporting hub. The request must be made in writing. If sent by certified mail, the request must be postmarked and sent to the commissioner within ten calendar days after the license holder received the order. If a request is made by personal service, it must be received by the commissioner within ten calendar days after the license holder received the order. If the order is issued through the provider hub, the request must be received by the commissioner within ten calendar days from the date the commissioner issued the order through the hub. The license holder may submit with the request for reconsideration written argument or evidence in support of the request for reconsideration. A timely request for reconsideration shall stay imposition of the terms of the conditional license until the commissioner issues a decision on the request for reconsideration. If the commissioner issues a dual order of conditional license under this section and an order to pay a fine under section 245A.07, subdivision 3, the license holder has a right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The scope of the contested case hearing shall include the fine and the conditional license. In this case, a reconsideration of the conditional license will not be conducted under this section. If the license holder does not appeal the fine, the license holder does not have a right to a contested case hearing and a reconsideration of the conditional license must be conducted under this subdivision.\n(b) The commissioner's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\n[Repealed by amendment, 1Sp2001 c 9 art 14 s 20]\n[Repealed by amendment, 1Sp2001 c 9 art 14 s 20]\n[Repealed by amendment, 1Sp2001 c 9 art 14 s 20]\n[Repealed by amendment, 1Sp2001 c 9 art 14 s 20]\n[Renumbered 142B.16, subd 5]\n[Renumbered 142B.16, subd 6]",
	"repealed": false
}