{
	"id": "244.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.04",
	"title": "244.04 GOOD TIME.",
	"text": "Notwithstanding the provisions of section 609.11, subdivision 6, and Minnesota Statutes 2004, section 609.109, subdivision 1, the term of imprisonment of any inmate sentenced to a presumptive fixed sentence after May 1, 1980, and whose crime was committed before August 1, 1993, shall be reduced in duration by one day for each two days during which the inmate violates none of the disciplinary offense rules promulgated by the commissioner. The reduction shall accrue to the period of supervised release to be served by the inmate, except that the period of supervised release for a sex offender conditionally released by the commissioner under section 609.3455 is governed by that provision.\nExcept as otherwise provided in subdivision 2, if an inmate whose crime was committed before August 1, 1993, violates a disciplinary offense rule promulgated by the commissioner, good time earned prior to the violation may not be taken away, but the inmate may be required to serve an appropriate portion of the term of imprisonment after the violation without earning good time.\nEvery inmate sentenced before May 1, 1980, for any term other than life, confined in a state adult correctional facility or on parole therefrom, may diminish the maximum term of sentence one day for each two days during which the inmate has not violated any facility rule or discipline.\nThe commissioner of corrections, in view of the aggravated nature and frequency of offenses, may take away any or all of the good time previously gained, and, in consideration of mitigating circumstances or ignorance on the part of the inmate, may afterwards restore the inmate, in whole or in part, to the standing the inmate possessed before such good time was taken away.\nBy May 1, 1980, the commissioner shall promulgate rules specifying disciplinary offenses which may result in the loss of good time and the amount of good time which may be lost as a result of each disciplinary offense, including provision for restoration of good time. In no case shall an individual disciplinary offense result in the loss of more than 90 days of good time; except that no inmate confined in segregation for violation of a disciplinary rule shall be placed on supervised release until discharged or released from punitive segregation confinement, nor shall an inmate in segregation for violation of a disciplinary rule for which the inmate could also be prosecuted under the criminal laws earn good time while in segregation. The loss of good time shall be considered to be a disciplinary sanction imposed upon an inmate, and the procedure for the loss of good time and the rights of the inmate in the procedure shall be those in effect for the imposition of other disciplinary sanctions at each state correctional institution.\nThe provisions of this section do not apply to an inmate serving a mandatory life sentence or to persons whose crimes were committed on or after August 1, 1993.",
	"repealed": false
}