{
	"id": "94.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.10",
	"title": "94.10 SURVEYS, APPRAISALS, AND SALE.",
	"text": "(a) Before offering any surplus state-owned lands for sale, the commissioner of natural resources must establish the value of the lands. The commissioner shall have the lands appraised if the estimated value is in excess of $100,000. No parcel of state-owned land shall be sold for less than $1,000.\n(b) The appraisals must be made by regularly appointed and qualified state appraisers. To be qualified, an appraiser must hold a state appraiser license issued by the Department of Commerce. The appraisal must be in conformity with the Uniform Standards of Professional Appraisal Practice of the Appraisal Foundation.\n(c) Before offering surplus state-owned lands for public sale, the lands must first be offered to the city, county, town, school district, or other public body corporate or politic in which the lands are situated for public purposes and the lands may be sold for public purposes for not less than the appraised value of the lands. To determine whether a public body desires to purchase the surplus land, the commissioner of natural resources shall give a written notice to the governing body of each political subdivision whose jurisdictional boundaries include or are adjacent to the surplus land. If a public body desires to purchase the surplus land, the public body must submit a written offer to the commissioner no later than two weeks after receipt of notice setting forth in detail the reasons for desiring to acquire and the intended use of the land. If more than one public body tenders an offer, the commissioner shall determine which party shall receive the property and shall submit written findings regarding the decision. If lands are offered for sale for public purposes and if a public body notifies the commissioner of its desire to acquire the lands, the public body may have up to two years from the date of the accepted offer to begin paying for the lands in the manner provided by law.\n(d) Before offering surplus state-owned lands that are located within the reservation boundary of a federally recognized Indian tribe for public sale or before offering the lands to an entity specified in paragraph (c), the lands must first be offered to the federally recognized Indian tribe with governing authority over the reservation where the lands are located. If the lands are located within the reservation boundary of a federally recognized tribe that is one of the six constituent tribes of the Minnesota Chippewa Tribe, then the lands must be offered to both the Minnesota Chippewa Tribe and the constituent tribe where the lands are located. The lands may be sold for not less than the appraised value of the lands. To determine whether an Indian tribe desires to purchase the lands, the commissioner of natural resources must give a written notice to the governing body of the Indian tribe and, when applicable, to the Minnesota Chippewa Tribe if the tribe is a member of the Minnesota Chippewa Tribe. If the Indian tribe desires to purchase the lands, the Indian tribe must notify the commissioner in writing of the intent to purchase the lands no later than two weeks after receiving the notice. If the Indian tribe notifies the commissioner of its intent to acquire the lands, the Indian tribe has up to two years from the date that the notice of intent to purchase the lands was submitted to begin paying for the lands in the manner provided by law.\n(a) After complying with subdivision 1 and before any public sale of surplus state-owned land is made and at least 30 days before the sale, the commissioner of natural resources shall publish a notice of the sale in a newspaper of general distribution in the county in which the real property to be sold is situated. The notice shall specify the time and place at which the sale will commence, a general description of the lots or tracts to be offered, and a general statement of the terms of sale. The commissioner shall provide electronic notice of the sale.\n(b) The minimum bid for a parcel of land must include the estimated value or appraised value of the land and any improvements and, if any of the land is valuable for merchantable timber, the value of the merchantable timber. The minimum bid may include expenses incurred by the commissioner in rendering the property salable, including survey, appraisal, legal, advertising, and other expenses.\n(c) The purchaser of state land must pay recording fees and the state deed tax.\n(d) Except as provided under paragraph (e), parcels remaining unsold after the offering may be sold to anyone agreeing to pay at least 75 percent of the appraised value. The sale must continue until all parcels are sold or until the commissioner orders a reappraisal or withdraws the remaining parcels from sale.\n(e) The commissioner may retain the services of a licensed real estate broker to find a buyer for parcels remaining unsold after the offering. The sale price may be negotiated by the broker, but must not be less than 90 percent of the appraised value as determined by the commissioner. The broker's fee must be established by prior agreement between the commissioner and the broker and must not exceed ten percent of the sale price for sales of $10,000 or more. The broker's fee must be paid to the broker from the proceeds of the sale.\n(f) Public sales of surplus state-owned land may be conducted through online auctions.",
	"repealed": false
}