{
	"id": "146B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.08",
	"title": "146B.08 INVESTIGATION AND GROUNDS FOR DISCIPLINARY ACTION.",
	"text": "The commissioner may initiate an investigation upon receiving a signed complaint or other signed written communication that alleges or implies that an individual or establishment has violated this chapter. According to section 214.13, subdivision 6, in the receipt, investigation, and hearing of a complaint that alleges or implies an individual or establishment has violated this chapter, the commissioner shall follow the procedures in section 214.10.\nThe rights of an applicant denied licensure are stated in section 146B.03, subdivision 5. A licensee may not be subjected to disciplinary action under this section without first having an opportunity for a contested case hearing under chapter 14.\nThe commissioner may take any of the disciplinary actions listed in subdivision 4 on proof that a technician or an operator of an establishment has:\n(1) intentionally submitted false or misleading information to the commissioner;\n(2) failed, within 30 days, to provide information in response to a written request by the commissioner;\n(3) violated any provision of this chapter;\n(4) failed to perform services with reasonable judgment, skill, or safety due to the use of alcohol or drugs, or other physical or mental impairment;\n(5) aided or abetted another person in violating any provision of this chapter;\n(6) been or is being disciplined by another jurisdiction, if any of the grounds for the discipline are the same or substantially equivalent to those under this chapter;\n(7) not cooperated with the commissioner in an investigation conducted according to subdivision 1;\n(8) advertised in a manner that is false or misleading;\n(9) engaged in conduct likely to deceive, defraud, or harm the public;\n(10) demonstrated a willful or careless disregard for the health, welfare, or safety of a client;\n(11) obtained money, property, or services from a client through the use of undue influence, harassment, duress, deception, or fraud;\n(12) failed to refer a client to a health care professional for medical evaluation or care when appropriate; or\n(13) been convicted of a felony-level criminal sexual conduct offense. \"Conviction\" means a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by a court.\nIf the commissioner finds that a technician or an operator of an establishment should be disciplined according to subdivision 3, the commissioner may take any one or more of the following actions:\n(1) refuse to grant or renew licensure;\n(2) suspend licensure for a period not exceeding one year;\n(3) revoke licensure;\n(4) take any reasonable lesser action against an individual upon proof that the individual has violated this chapter; or\n(5) impose, for each violation, a civil penalty not exceeding $10,000 that deprives the licensee of any economic advantage gained by the violation and that reimburses the department for costs of the investigation and proceedings resulting in disciplinary action, including the amount paid for services of the Office of Administrative Hearings, the amount paid for services of the Office of the Attorney General, attorney fees, court reporters, witnesses, reproduction of records, department staff time, and expenses incurred by department staff.\nUpon the suspension or revocation of licensure, the technician or establishment shall cease to:\n(1) perform body art procedures;\n(2) use titles protected under this chapter; and\n(3) represent to the public that the technician or establishment is licensed by the commissioner.\nA technician who has had licensure suspended may petition on forms provided by the commissioner for reinstatement following the period of suspension specified by the commissioner. The requirements of section 146B.03 for renewing licensure must be met before licensure may be reinstated.",
	"repealed": false
}