{
	"id": "322C.0102",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0102",
	"title": "322C.0102 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Articles of organization\" means the articles of organization required by section 322C.0201. The term includes the articles of organization as amended or restated.\n\"Board\" means the board of governors, however designated, of a board-managed limited liability company.\n\"Board-managed limited liability company\" means a limited liability company that qualifies as such under section 322C.0407, subdivision 1.\n\"Contribution\" means any benefit provided by a person to a limited liability company:\n(1) in order to become a member upon formation of the company and in accordance with an agreement between or among the persons that have agreed to become the initial members of the company;\n(2) in order to become a member after formation of the company and in accordance with an agreement between the person and the company; or\n(3) in the person's capacity as a member and in accordance with the operating agreement or an agreement between the member and the company.\n\"Debtor in bankruptcy\" means a person that is the subject of:\n(1) an order for relief under United States Code, title 11, or a successor statute of general application; or\n(2) a comparable order under federal, state, or foreign law governing insolvency.\n\"Distribution,\" except as otherwise provided in section 322C.0405, subdivision 7, means a transfer of money or other property from a limited liability company to another person on account of a transferable interest.\n\"Effective,\" with respect to a record required or permitted to be filed with the secretary of state under this chapter, means effective under section 322C.0205, subdivision 3.\n\"Filed\" or \"filed with the secretary of state\" means that a document meeting the applicable requirements of this chapter, signed and accompanied by any required filing fees, has been delivered to the secretary of state. The secretary of state shall endorse on the original or an image thereof the word \"Filed\" and the month, day, and year of filing, record the document or an image thereof in the Office of the Secretary of State, and return a document or the image thereof to the person who delivered it for filing.\n\"Foreign limited liability company\" means an unincorporated entity formed under the law of a jurisdiction other than this state and denominated by that law as a limited liability company.\n\"Governor\" means a member of the board, however designated, of a board-managed limited liability company.\n\"Limited liability company,\" except in the phrase \"foreign limited liability company,\" means an entity formed under this chapter.\n\"Manager\" means a person that under the operating agreement of a manager-managed limited liability company is responsible, alone or in concert with others, for performing the management functions stated in section 322C.0407, subdivision 3.\n\"Manager-managed limited liability company\" means a limited liability company that qualifies as such under section 322C.0407, subdivision 1.\n\"Member\" means a person that has become a member of a limited liability company under section 322C.0401 and has not dissociated under section 322C.0602.\n\"Member-managed limited liability company\" means a limited liability company that is not a manager-managed limited liability company or a board-managed limited liability company.\n\"Operating agreement\" means the agreement, whether or not referred to as an operating agreement and whether oral, in a record, implied, or in any combination thereof, of all the members of a limited liability company, including a sole member, concerning the matters described in section 322C.0110, subdivision 1. The term includes the agreement as amended or restated.\n(a) \"Oppressive,\" with respect to an application brought by a member under section 322C.0701, subdivision 1, clause (5), item (ii), means conduct:\n(1) engaged in by one or more:\n(i) members in a member-managed limited liability company or who are otherwise in control of any limited liability company;\n(ii) managers in a manager-managed limited liability company; or\n(iii) governors of a board-managed limited liability company;\n(2) that occurs with respect to the applicant member's capacity as:\n(i) a member, manager, or governor of a limited liability company; or\n(ii) an employee of a limited liability company with 35 or fewer members; and\n(3) that is unfairly prejudicial to the applicant member in a capacity listed in clause (2), because the conduct frustrated an expectation of the applicant member that:\n(i) is reasonable in light of the reasonable expectations of the other members;\n(ii) was material to the applicant's decision to become a member of the limited liability company or for a substantial time has been material during the member's continuing membership;\n(iii) was known to other members or that the other members had reason to know; and\n(iv) is not contrary to the operating agreement as applied consistently with the contractual obligation of good faith and fair dealing under section 322C.0409, subdivision 4.\n(b) For the purposes of paragraph (a), conduct:\n(1) includes words, action, inaction, and any combination of words, action, or inaction; and\n(2) is not oppressive solely by reason of a good faith disagreement as to the content, interpretation, or application of the company's operating agreement.\n\"Organizer\" means a person that acts under section 322C.0201 to form a limited liability company.\n\"Person\" means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, public corporation, government or governmental subdivision, agency, or instrumentality, or any other legal or commercial entity.\n\"Principal place of business\" means the principal executive office of a limited liability company or foreign limited liability company, whether or not the office is located in this state.\n\"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n\"Recorded in the real property records\" means that a certified copy of a statement meeting the applicable requirements of this chapter, including containing a legal description of the property affected by the statement, as filed with the secretary of state, has been recorded in the Office of the County Recorder in the county in which the real property affected by the statement is located or, if the real property is registered under chapter 508 or 508A, has been recorded in the office of the applicable registrar of titles and memorialized on the certificate of title for that property.\n\"Registered office\" means:\n(1) the office that a limited liability company is required to designate and maintain under section 322C.0113; or\n(2) the office that a foreign limited liability company is required to designate and maintain under sections 5.36 and 322C.0802.\n\"Sign\" means, with the present intent to authenticate or adopt a record:\n(1) to execute or adopt a tangible symbol; or\n(2) to attach to or logically associate with the record an electronic symbol, sound, or process.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n\"Transfer\" includes an assignment, conveyance, deed, bill of sale, lease, mortgage, security interest, encumbrance, gift, and transfer by operation of law.\n\"Transferable interest\" means the right, as originally associated with a person's capacity as a member, to receive distributions from a limited liability company in accordance with the operating agreement, whether or not the person remains a member or continues to own any part of the right.\n\"Transferee\" means a person to which all or part of a transferable interest has been transferred, whether or not the transferor is a member.",
	"repealed": false
}