{
	"id": "256B.0759",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0759",
	"title": "256B.0759 SUBSTANCE USE DISORDER DEMONSTRATION PROJECT.",
	"text": "The commissioner shall develop and implement a medical assistance demonstration project to test reforms of Minnesota's substance use disorder treatment system to ensure individuals with substance use disorders have access to a full continuum of high-quality care.\n(a) Programs licensed by the Department of Human Services as nonresidential substance use disorder treatment programs that receive payment under this chapter must enroll as demonstration project providers and meet the requirements of subdivision 3 by January 1, 2025. Programs that do not meet the requirements of this paragraph are ineligible for payment for services provided under section 256B.0625.\n(b) Programs licensed by the Department of Human Services as residential treatment programs according to section 245G.21 that receive payment under this chapter must enroll as demonstration project providers and meet the requirements of subdivision 3 by January 1, 2024. Programs that do not meet the requirements of this paragraph are ineligible for payment for services provided under section 256B.0625.\n(c) Programs licensed by the Department of Human Services as residential treatment programs according to section 245G.21 that receive payment under this chapter, are licensed as a hospital under sections 144.50 to 144.581, and provide only ASAM 3.7 medically monitored inpatient level of care are not required to enroll as demonstration project providers. Programs meeting these criteria must submit evidence of providing the required level of care to the commissioner to be exempt from enrolling in the demonstration.\n(d) Programs licensed by the Department of Human Services as withdrawal management programs according to chapter 245F that receive payment under this chapter must enroll as demonstration project providers and meet the requirements of subdivision 3 by January 1, 2024. Programs that do not meet the requirements of this paragraph are ineligible for payment for services provided under section 256B.0625.\n(e) Out-of-state residential substance use disorder treatment programs that receive payment under this chapter must enroll as demonstration project providers and meet the requirements of subdivision 3 by January 1, 2024. Programs that do not meet the requirements of this paragraph are ineligible for payment for services provided under section 256B.0625.\n(f) Tribally licensed programs may elect to participate in the demonstration project and meet the requirements of subdivision 3. The Department of Human Services must consult with Tribal Nations to discuss participation in the substance use disorder demonstration project.\n(g) The commissioner shall allow providers enrolled in the demonstration project before July 1, 2021, to receive applicable rate enhancements authorized under subdivision 4 for all services provided on or after the date of enrollment, except that the commissioner shall allow a provider to receive applicable rate enhancements authorized under subdivision 4 for services provided on or after July 22, 2020, to fee-for-service enrollees, and on or after January 1, 2021, to managed care enrollees, if the provider meets all of the following requirements:\n(1) the provider attests that during the time period for which the provider is seeking the rate enhancement, the provider took meaningful steps in their plan approved by the commissioner to meet the demonstration project requirements in subdivision 3; and\n(2) the provider submits attestation and evidence, including all information requested by the commissioner, of meeting the requirements of subdivision 3 to the commissioner in a format required by the commissioner.\n(h) The commissioner may recoup any rate enhancements paid under paragraph (g) to a provider that does not meet the requirements of subdivision 3 by July 1, 2021.\n(a) The commissioner must establish requirements for participating providers that are consistent with the federal requirements of the demonstration project.\n(b) A participating residential provider must obtain applicable licensure under chapter 245F or 245G or other applicable standards for the services provided and must:\n(1) deliver services in accordance with standards published by the commissioner pursuant to paragraph (d);\n(2) maintain formal patient referral arrangements with providers delivering step-up or step-down levels of care in accordance with ASAM standards; and\n(3) offer substance use disorder treatment services with medications for opioid use disorder on site or facilitate access to substance use disorder treatment services with medications for opioid use disorder off site.\n(c) A participating outpatient provider must obtain applicable licensure under chapter 245G or other applicable standards for the services provided and must:\n(1) deliver services in accordance with standards published by the commissioner pursuant to paragraph (d); and\n(2) maintain formal patient referral arrangements with providers delivering step-up or step-down levels of care in accordance with ASAM standards.\n(d) If the provider standards under chapter 245G or other applicable standards conflict or are duplicative, the commissioner may grant variances to the standards if the variances do not conflict with federal requirements. The commissioner must publish service components, service standards, and staffing requirements for participating providers that are consistent with ASAM standards and federal requirements by October 1, 2020.\n(a) Payment rates for participating providers must be increased for services provided to medical assistance enrollees. To receive a rate increase, participating providers must meet demonstration project requirements and provide evidence of formal referral arrangements with providers delivering step-up or step-down levels of care. Providers that have enrolled in the demonstration project but have not met the provider standards under subdivision 3 as of July 1, 2022, are not eligible for a rate increase under this subdivision until the date that the provider meets the provider standards in subdivision 3. Services provided from July 1, 2022, to the date that the provider meets the provider standards under subdivision 3 shall be reimbursed at rates according to section 254B.05, subdivision 5, paragraph (b). Rate increases paid under this subdivision to a provider for services provided between July 1, 2021, and July 1, 2022, are not subject to recoupment when the provider is taking meaningful steps to meet demonstration project requirements that are not otherwise required by law, and the provider provides documentation to the commissioner, upon request, of the steps being taken.\n(b) The commissioner may temporarily suspend payments to the provider according to section 256B.04, subdivision 21, paragraph (d), if the provider does not meet the requirements in paragraph (a). Payments withheld from the provider must be made once the commissioner determines that the requirements in paragraph (a) are met.\n(c) For outpatient individual and group substance use disorder services under section 254B.05, subdivision 5, paragraph (b), clause (1), and adolescent treatment programs that are licensed as outpatient treatment programs according to sections 245G.01 to 245G.18, provided on or after January 1, 2021, payment rates must be increased by 20 percent over the rates in effect on December 31, 2020.\n(d) Effective January 1, 2021, and contingent on annual federal approval, managed care plans and county-based purchasing plans must reimburse providers of the substance use disorder services meeting the criteria described in paragraph (a) who are employed by or under contract with the plan an amount that is at least equal to the fee-for-service base rate payment for the substance use disorder services described in paragraph (c). The commissioner must monitor the effect of this requirement on the rate of access to substance use disorder services and residential substance use disorder rates. Capitation rates paid to managed care organizations and county-based purchasing plans must reflect the impact of this requirement. This paragraph expires if federal approval is not received at any time as required under this paragraph.\n(e) Effective July 1, 2021, contracts between managed care plans and county-based purchasing plans and providers to whom paragraph (d) applies must allow recovery of payments from those providers if, for any contract year, federal approval for the provisions of paragraph (d) is not received, and capitation rates are adjusted as a result. Payment recoveries must not exceed the amount equal to any decrease in rates that results from this provision.\n(f) For substance use disorder services with medications for opioid use disorder under section 254B.05, subdivision 5, clause (7), provided on or after January 1, 2021, payment rates must be increased by 20 percent over the rates in effect on December 31, 2020. Upon implementation of new rates according to section 254B.121, the 20 percent increase will no longer apply.\nThe commissioner shall seek federal approval to implement the demonstration project under this section and to receive federal financial participation.\nMS 2022 [Repealed, 2023 c 61 art 4 s 28]\nThe state shall post the final documents, for example, monitoring reports, close out report, approved evaluation design, interim evaluation report, and summative evaluation report, on the state's Medicaid website within 30 calendar days of approval by CMS.\nThe commissioner shall seek a five-year extension of the demonstration project under this section and to receive enhanced federal financial participation.\nBeginning October 1, 2021, the commissioner shall assemble a work group of relevant stakeholders, including but not limited to demonstration project participants and the Minnesota Association of Resources for Recovery and Chemical Health, that shall meet at least quarterly for the duration of the demonstration to evaluate the long-term sustainability of any improvements to quality or access to substance use disorder treatment services caused by participation in the demonstration project. The work group shall also determine how to implement successful outcomes of the demonstration project once the project expires.",
	"repealed": false
}