{
	"id": "326.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.55",
	"title": "326.55 NONPAYMENT OF LICENSE FEES.",
	"text": "As used in this section:\n(1) \"Employment essential to the prosecution of the present war and to the national defense\" means employment by the United States of America, any of its agencies, or any contractor under the United States of America, or subcontractor under such contractor, in work connected with the prosecution of the present war or for the defense of the United States of America and others of the United Nations during such war.\n(2) \"Outside of the United States\" means outside of the territorial limits of the 50 states of the United States and the District of Columbia.\nAny person required by law to be licensed or registered in order to carry on or practice a trade, employment, occupation or profession in the state of Minnesota who is also required by law to renew the license or certificate of registration at stated intervals and to pay a fee for such renewal on or before a specified date, or be subject to revocation of the license or certificate or other penalties, who has since the enactment by the Congress of the United States of the Selective Service and Training Act of 1940 entered, or shall hereafter enter, the armed forces of the United States of America, or who has since the enactment of said act been engaged, or shall hereafter be engaged, in employment, outside of the United States, essential to the prosecution of the present war and to the national defense, whose license or certificate of registration was effective at the time of entry into the armed forces or engagement in the employment aforesaid, is hereby exempted from the payment of all renewal fees and from the filing of any application for renewal, which but for this section would have been required as a condition of the renewal of the license or certificate, during the time the person has been in such armed forces or in such employment, and from any penalties for nonpayment or late payment, and is hereby exempted from further payment of such renewal fees and from the making of any application for renewal during the period the person shall remain in such armed forces or is engaged in such employment, and for a further period of six months from discharge from the armed forces, if a member thereof, or from the date of return within the boundaries of the United States if engaged in the employment hereinbefore referred to. The license or certificate in the meantime shall remain in full force and effect, and if it has been canceled or revoked since the date of the enactment of the Selective Service and Training Act of 1940 solely on the ground of nonpayment of renewal fees, or failure to apply for a renewal, it shall be reinstated upon the application of the licensee or registrant or any one on the licensee's or registrant's behalf without the payment of any penalties or costs. Any such person may within six months from the date of release from the armed forces of the United States, if the person has been a member of such armed forces, or from the date of return within the boundaries of the United States if the person has been engaged in employment hereinbefore referred to, make application for a renewal of the license or certificate without penalty and in the same manner as if the person had made application therefor at the time or times specified by existing laws.",
	"repealed": false
}