{
	"id": "529.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/529.12",
	"title": "529.12 DECLINATION, RESIGNATION, INCAPACITY, DEATH, OR REMOVAL OF CUSTODIAL TRUSTEE; DESIGNATION OF SUCCESSOR CUSTODIAL TRUSTEE.",
	"text": "(a) Before accepting the custodial trust property, a person designated as custodial trustee may decline to serve by notifying the person who made the designation, the transferor, or the transferor's legal representative. If an event giving rise to a transfer has not occurred, the substitute custodial trustee designated under section 529.03 becomes the custodial trustee, or, if a substitute custodial trustee has not been designated, the person who made the designation may designate a substitute custodial trustee pursuant to section 529.03. In other cases, the transferor or the transferor's legal representative may designate a substitute custodial trustee.\n(b) A custodial trustee who has accepted the custodial trust property may resign by (i) delivering written notice to a successor custodial trustee, if any, the beneficiary and, if the beneficiary is incapacitated, to the beneficiary's conservator, if any, and (ii) transferring or registering, or recording an appropriate instrument relating to, the custodial trust property, in the name of, and delivering the records to, the successor custodial trustee identified under subsection (c).\n(c) If a custodial trustee or successor custodial trustee is ineligible, resigns, dies, or becomes incapacitated, the successor designated under section 529.02, subsection (g), or 529.03 becomes custodial trustee. If there is no effective provision for a successor, the beneficiary, if not incapacitated, or the holder of the beneficiary's power of attorney, may designate a successor custodial trustee.\n(d) If a successor custodial trustee is not designated pursuant to subsection (c), the transferor, the legal representative of the transferor or of the custodial trustee, an adult member of the beneficiary's family, the conservator of the beneficiary, a person interested in the custodial trust property, or a person interested in the welfare of the beneficiary, may petition the court to designate a successor custodial trustee in accordance with the procedures set forth in sections 501C.0201 to 501C.0208.\n(e) A custodial trustee who declines to serve or resigns, or the legal representative of a deceased or incapacitated custodial trustee, as soon as practicable, shall put the custodial trust property and records in the possession and control of the successor custodial trustee. The successor custodial trustee may enforce the obligation to deliver custodial trust property and records and becomes responsible for each item as received.\n(f) A beneficiary, the beneficiary's conservator, an adult member of the beneficiary's family, a guardian of the beneficiary, a person interested in the custodial trust property, or a person interested in the welfare of the beneficiary, may petition the court to remove the custodial trustee for cause and designate a successor custodial trustee, to require the custodial trustee to furnish a bond or other security for the faithful performance of fiduciary duties, or for other appropriate relief.",
	"repealed": false
}