{
	"id": "297F.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.25",
	"title": "297F.25 CIGARETTE SALES TAX.",
	"text": "(a) A tax is imposed on distributors on the sale of cigarettes by a cigarette distributor to a retailer or cigarette subjobber for resale in this state. The tax is equal to the combined tax rate under section 297A.62, multiplied by the weighted average retail price and must be expressed in cents per pack rounded to the nearest one-tenth of a cent. The weighted average retail price must be determined annually, with new rates published by November 1, and effective for sales on or after January 1 of the following year. The weighted average retail price must be established by surveying cigarette retailers statewide in a manner and time determined by the commissioner. The commissioner shall make an inflation adjustment in accordance with the Consumer Price Index for all urban consumers inflation indicator as published in the most recent state budget forecast. The commissioner shall use the inflation factor for the calendar year in which the new tax rate takes effect. If the survey indicates that the average retail price of cigarettes has not increased relative to the average retail price in the previous year's survey, then the commissioner shall not make an inflation adjustment. The determination of the commissioner pursuant to this subdivision is not a \"rule\" and is not subject to the Administrative Procedure Act contained in chapter 14. For packs of cigarettes with other than 20 cigarettes, the tax must be adjusted proportionally.\n(b) Notwithstanding paragraph (a), and in lieu of a survey of cigarette retailers, the tax calculation of the weighted average retail price for the sales of cigarettes from August 1, 2011, through December 31, 2011, shall be calculated by: (1) increasing the average retail price per pack of 20 cigarettes from the most recent survey by the percentage change in a weighted average of the presumed legal prices for cigarettes during the year after completion of that survey, as reported and published by the Department of Commerce under section 325D.371; (2) subtracting the sales tax included in the retail price; and (3) adjusting for expected inflation. The rate must be published by May 1 and is effective for sales after July 31. If the weighted average of the presumed legal prices indicates that the average retail price of cigarettes has not increased relative to the average retail price in the most recent survey, then no inflation adjustment must be made. For packs of cigarettes with other than 20 cigarettes, the tax must be adjusted proportionally.\nEach taxpayer must remit payments of the taxes to the commissioner on the same dates prescribed under section 297F.09, subdivision 1, for cigarette tax returns, including the accelerated remittance of the June liability.\nA taxpayer must file a return with the commissioner on the same dates prescribed under section 297F.09, subdivision 1, for cigarette tax returns. Notwithstanding any other provisions of this chapter, the tax due on the return is based upon actual stamps purchased during the reporting period.\n(a) On or before the 18th day of each calendar month, a consumer who, during the preceding calendar month, has acquired title to or possession of cigarettes for use or storage in this state, upon which the sales tax imposed by this section has not been paid, shall file a return with the commissioner showing the quantity of cigarettes so acquired or possessed. The return must be made in the form and manner prescribed by the commissioner, and must contain any other information required by the commissioner. The return must be accompanied by a remittance for the full unpaid sales tax liability shown by it.\n(b) The tax imposed under paragraph (a) does not apply if (1) the consumer has acquired title to or possession of cigarettes for use or storage in this state in quantities of 200 or fewer in the month, and (2) the cigarettes were carried into this state by that consumer.\nThe return must contain the information and be in the form prescribed by the commissioner.\nThe tax that is required to be paid by the distributor is a debt from the retailer or cigarette subjobber to the distributor recoverable at law in the same manner as other debts. A cigarette retailer or subjobber must pay the tax imposed under subdivision 1 to the distributor before the 12th day of the month following the month in which the cigarettes were purchased from the distributor.\nPayment of the tax imposed under section 297F.05 and by this section must be evidenced by a dual-purpose single stamp affixed to each package.\nThe stamping, audit, assessment, interest, penalty, appeal, refund, and collection provisions applicable to the taxes imposed under this chapter apply to taxes imposed under this section.\nNotwithstanding the provisions of section 297F.10, the commissioner shall deposit all revenues, including penalties and interest, derived from the tax imposed by this section, in the general fund.",
	"repealed": false
}