{
	"id": "216B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.36",
	"title": "216B.36 MUNICIPAL REGULATORY AND TAXING POWERS.",
	"text": "Any public utility furnishing the utility services enumerated in section 216B.02 or occupying streets, highways, or other public property within a municipality may be required to obtain a license, permit, right, or franchise in accordance with the terms, conditions, and limitations of regulatory acts of the municipality, including the placing of distribution lines and facilities underground. Under the license, permit, right, or franchise, the utility may be obligated by any municipality to pay to the municipality fees to raise revenue or defray increased municipal costs accruing as a result of utility operations, or both. The fee may include but is not limited to a sum of money based upon gross operating revenues or gross earnings from its operations in the municipality so long as the public utility shall continue to operate in the municipality, unless upon request of the public utility it is expressly released from the obligation at any time by such municipality. Notwithstanding the definition of \"public utility\" in section 216B.02, subdivision 4, a municipality may require payment of a fee under this section by a cooperative electric association organized under chapter 308A that furnishes utility services within the municipality. All existing licenses, permits, franchises, and other rights acquired by any public utility or municipality prior to April 11, 1974, including the payment of existing franchise fees, shall not be impaired or affected in any respect by the passage of this chapter, except with respect to matters of rate and service regulation, service area assignments, securities, and indebtedness that are vested in the jurisdiction of the commission by this chapter. However, in the event that a court of competent jurisdiction determines, or the parties by mutual agreement determine, that an existing license, permit, franchise, or other right has been abrogated or impaired by this chapter, or its execution, the municipality affected shall impose and the public utility shall collect an excise tax on the utility charges which from year to year yields an amount which is reasonably equivalent to that amount of revenue which then would be due as a fee, charges or other thing or service of value to the municipality under the franchise, license, or permit. The authorization shall be over and above taxing limitations including, but not limited to, those of section 477A.016. Franchises granted pursuant to this section shall be exempt from the provisions of chapter 80C. For purposes of this section, a public utility shall include a cooperative electric association.",
	"repealed": false
}