{
	"id": "48.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.185",
	"title": "48.185 OPEN END LOAN ACCOUNT ARRANGEMENTS.",
	"text": "Any bank organized under the laws of this state, any national banking association doing business in this state, any savings bank organized and operated pursuant to chapter 50, any savings association organized under chapter 51A, and any federally chartered savings association, may extend credit through an open end loan account arrangement with a debtor, pursuant to which the debtor may obtain loans from time to time by cash advances, purchase or satisfaction of the obligations of the debtor incurred pursuant to a credit card plan, or otherwise under a credit card or overdraft checking plan.\n[Repealed, 1980 c 599 s 9]\nA financial institution referred to in subdivision 1, may collect a periodic rate of finance charge in connection with extensions of credit under this section, which finance charge does not exceed the equivalent of an annual percentage rate of 18 percent computed on a 365-day year and in accordance with the Truth in Lending Act, United States Code, title 15, section 1601 et seq., and the Code of Federal Regulations, title 12, part 226 (1985).\nIf credit is extended pursuant to an overdraft checking plan on the day on which an increase in the periodic rate of finance charge is made effective pursuant to this section, the rate in effect prior to the increase shall be the maximum lawful rate chargeable on the amount of credit so extended until that credit is fully repaid according to the terms of the plan.\nAny periodic statement evidencing an overdraft checking plan loan balance shall clearly state that all or any part of said balance may be prepaid at any time.\nNo charges other than those provided for in subdivision 3 shall be made directly or indirectly for any credit extended under the authority of this section, except that there may be charged to the debtor:\n(a) annual charges, not to exceed $50 per annum, payable in advance, for the privilege of using a bank credit card;\n(b) charges for premiums on credit life, credit accident and health, and credit involuntary unemployment insurance if:\n(1) the insurance is not required by the financial institution and this fact is clearly disclosed in writing to the debtor; and\n(2) the debtor is notified in writing of the cost of the insurance and affirmatively elects, in writing, to purchase the insurance;\n(c) charges for the use of an automated teller machine when cash advances are obtained pursuant to this section through the use of an automated teller machine;\n(d) in the case of a financial institution referred to in subdivision 1 that does not charge an annual fee, delinquency and collection charges as follows:\n(1) on each payment in arrears for a period not less than ten days, in an amount not in excess of the delinquency and collection charge permitted in section 53C.08;\n(2) for any monthly or other periodic payment period where the debtor has exceeded or thereby exceeds the maximum approved credit limit under the open-end loan account arrangement, in an amount not in excess of the service charge limitations in section 604.113; and\n(3) for any returned check or returned automatic payment withdrawal request, in an amount not in excess of the service charge limitation in section 604.113; and\n(e) to the extent not otherwise prohibited by law, charges for other goods or services offered by or through a financial institution referred to in subdivision 1 which the debtor elects to purchase, including, but not limited to, charges for check and draft copies and for the replacement of lost or stolen cards.\n[Repealed, 1986 c 376 s 4]\nIf the balance in a revolving loan account under a credit card plan is attributable solely to purchases of goods or services charged to the account during one billing cycle, and the account is paid in full before the due date of the first statement issued after the end of that billing cycle, no finance charge shall be charged on that balance.\nThis section shall apply to all open end credit transactions of a bank or savings bank in extending credit under an open end loan account or other open end credit arrangement to persons who are residents of this state, if the bank or savings bank induces such persons to enter into such arrangements by a continuous and systematic solicitation either personally or by an agent or by mail, and retail merchants and banks or savings banks within this state are contractually bound to honor credit cards issued by the bank or savings bank, and the goods, services and loans are delivered or furnished in this state and payment is made from this state. A term of a writing or credit card device executed or signed by a person to evidence an open end credit arrangement specifying:\n(a) that the law of another state shall apply;\n(b) that the person consents to the jurisdiction of another state; and\n(c) which fixes venue,\nis invalid with respect to open end credit transactions to which this section applies. An open end credit arrangement made in another state with a person who was a resident of that state when the open end credit arrangement was made is valid and enforceable in this state according to its terms to the extent that it is valid and enforceable under the laws of the state applicable to the transaction.\nAny bank or savings bank extending credit in compliance with the provisions of this section, which is injured competitively by violations of this section by another bank or savings bank, may institute a civil action in the district court of this state against that bank or savings bank for an injunction prohibiting any violation of this section. The court, upon proper proof that the defendant has engaged in any practice in violation of this section, may enjoin the future commission of that practice. Proof of monetary damage or loss of profits shall not be required. Costs and attorneys' fees may be allowed to the plaintiff, unless the court directs otherwise. The relief provided in this subdivision is in addition to remedies otherwise available against the same conduct under the common law or statutes of this state.\nService of process shall be as in any other civil suit, except that if a defendant in the action is a foreign corporation or a national banking association with its principal place of business in another state, service of process may also be made by personal service outside the state, or in the manner provided by section 5.25, or in such manner as the court may direct, or in accordance with section 45.028, subdivision 2. Process is valid if it satisfies the requirements of due process of law, whether or not defendant is doing business in Minnesota regularly or habitually.",
	"repealed": false
}