{
	"id": "219.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.51",
	"title": "219.51 VIOLATIONS AND PENALTIES.",
	"text": "A common carrier, corporation, or person subject to sections 219.45 to 219.53 violating any of the provisions of those sections, is liable to a penalty of not more than $500 for each violation.\nIf a common carrier, person, or corporation (1) fails to correct a violation of sections 219.45 to 219.53 when ordered by the commissioner of transportation within the time provided in the order, and (2) does not appeal the order, then failure to correct the violation as ordered by the commissioner constitutes a new and separate offense distinct from the original violation of sections 219.45 to 219.53.\nThe penalty must be recovered in a suit brought in the name of the state by the attorney general in a court having jurisdiction in the locality where the violation was committed. Under the direction of the commissioner, the attorney general shall bring suit upon receipt of duly verified information from any person of a violation being committed. The commissioner shall lodge with the attorney general information of any violation as may come to their knowledge.\nWhen the commissioner finds that rail carrier employees who frequently work adjacent to a portion of track performing switching activities are exposed to safety hazards due to the lack of a walkway or to the condition of a walkway constructed before July 1, 2008, the commissioner may, under the provisions of this section, order a rail carrier to construct a walkway adjacent to a portion of track where employees are performing switching activities, or require a rail carrier to modify an existing walkway in conformance with the standards set forth in section 219.501, within a reasonable period of time.\nNo formal complaint of an alleged violation of sections 219.45 to 219.53 may be filed until the filing party has attempted to address the alleged violations with the rail carrier. Any complaint of an alleged violation must contain a written statement that the filing party has made a reasonable, good-faith attempt to address the alleged violation.",
	"repealed": false
}