{
	"id": "290.0688",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0688",
	"title": "290.0688 CREDIT FOR SUSTAINABLE AVIATION FUEL.",
	"text": "For purposes of this section, the terms defined in section 41A.30, subdivision 1, have the meanings given, except that \"commissioner\" means the commissioner of revenue.\nA qualifying taxpayer is allowed a credit against the tax imposed by this chapter for sustainable aviation fuel sold for use as fuel in an aircraft departing from an airport in Minnesota. The credit equals up to the amount and applies to the taxable year indicated on the credit certificate issued to the qualifying taxpayer under section 41A.30.\nCredits granted to a partnership, a limited liability company taxed as a partnership, an S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each partner, member, shareholder, or owner based on their share of the entity's assets or as specially allocated in their organizational documents or any other executed agreement, as of the last day of the taxable year.\nIf the amount of credit that a qualifying taxpayer is allowed under this section exceeds the claimant's tax liability under this chapter, the commissioner must refund the excess to the claimant.\nNotwithstanding the credit certificate issued by the commissioner of agriculture under section 41A.30, the commissioner may utilize any audit and examination powers under chapter 270C or 289A to the extent necessary to verify that the taxpayer is eligible for the credit and to assess for the amount of any improperly claimed credit.\nAn amount sufficient to pay the refunds required by this section is appropriated to the commissioner from the general fund.\nThis section expires at the same time and on the same terms as section 41A.30, subdivision 7, except that the expiration of this section does not affect the commissioner of revenue's authority to audit or power of examination and assessment for credits claimed under this section.",
	"repealed": false
}