{
	"id": "148.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.102",
	"title": "148.102 REPORTS OF STATE OR LOCAL SOCIETIES.",
	"text": "If a state or local chiropractic society receives a complaint which might be grounds for discipline under section 148.10 against a member doctor of chiropractic, the society shall report the complaint or shall direct the complainant to the Board of Chiropractic Examiners.\nA licensed health professional shall report to the board personal knowledge of any conduct which the professional reasonably believes constitutes grounds for disciplinary action under section 148.10 by any doctor of chiropractic including any conduct indicating that the doctor of chiropractic may be incompetent, or may have engaged in unprofessional conduct, or may be physically unable to engage safely in the practice of chiropractic. No report shall be required if the information was obtained in the course of a patient relationship if the patient is a doctor of chiropractic and the treating health professional successfully counsels the doctor of chiropractic to limit or withdraw from practice to the extent required by the impairment; or (2) is a patient or former patient of the doctor of chiropractic and the treating professional is a psychologist from whom the patient is receiving psychotherapeutic services.\nTwo times each year each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to chiropractors shall submit to the board a report concerning the chiropractors against whom malpractice settlements or awards have been made to the plaintiff. The report must contain at least the following information:\n(1) the total number of malpractice settlements or awards made to the plaintiff;\n(2) the date the malpractice settlements or awards to the plaintiff were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made to the plaintiff;\n(4) the dollar amount of each malpractice settlement or award;\n(5) the regular address of the practice of the doctor of chiropractic against whom an award was made or with whom a settlement was made; and\n(6) the name of the doctor of chiropractic against whom an award was made or with whom a settlement was made.\nThe insurance company shall, in addition to the above information, report to the board any information it possesses which tends to substantiate a charge that a doctor of chiropractic may have engaged in conduct violating section 148.10 and this section.\nThe court administrator of district court or any other court of competent jurisdiction shall report to the board any judgment or other determination of the court which adjudges or includes a finding that a doctor of chiropractic is mentally ill, mentally incompetent, guilty of a felony, guilty of an abuse or fraud, appoints a guardian of the doctor of chiropractic under sections 524.5-101 to 524.5-502 or commits a doctor of chiropractic under chapter 253B.\nA doctor of chiropractic shall report to the board any action concerning that doctor which would require that a report be filed with the board by any person, health care facility, business, or organization under subdivision 4.\nReports required by subdivisions 1 to 5 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 1 to 5 or any related documents.\nOn or after August 1, 2012, any person or insurer that fails to report as required under subdivisions 2 to 4 shall be subject to civil penalties for failing to report as required by law.",
	"repealed": false
}