{
	"id": "473H.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.08",
	"title": "473H.08 DURATION.",
	"text": "Agricultural preserves shall continue until the landowner, the authority, or a state agency or governmental unit initiates expiration as provided in this section.\nA landowner may initiate expiration by notifying the authority on a form provided by the commissioner of agriculture. The notice shall describe the property for which expiration is desired and shall state the date of expiration which shall be at least eight years from the date of notice. The notice and expiration may be rescinded by the owner at any time during the first two years following notice.\nThe authority may initiate expiration by notifying the landowner by registered letter on a form provided by the commissioner of agriculture, provided that before notification (i) the comprehensive plan and the zoning for the land have been officially amended so that the land is no longer planned for long-term agriculture and is no longer zoned for long-term agriculture, evidenced by a maximum residential density permitting more than one unit per quarter/quarter, and (ii) the authority has certified such changes pursuant to section 473H.04, subdivision 2. The notice shall describe the property for which expiration is desired and shall state the date of expiration which shall be at least eight years from the date of notice.\n(a) An agricultural preserve expires immediately when a state agency or other governmental unit purchases the property or obtains an easement over the property for the purpose of creating or expanding a public trail or public park. This subdivision applies only to the portion of the agricultural preserve acquired for trail or park purposes, and any portion of the property not acquired for trail or park purposes shall remain an agricultural preserve, even if the total acreage is reduced below 40 acres.\n(b) The acquiring state agency or governmental unit shall give notice to the authority as provided in subdivision 4. The notice must specify the portion of the property being removed from the agricultural preserve and the date on which that portion expires.\nUpon receipt of the notice provided in subdivision 2 or 3a, or upon notice served by the authority as provided in subdivision 3, the authority shall forward the original notice to the county recorder for recording, or to the registrar of titles if the land is registered, and shall notify the county auditor, county assessor, the Metropolitan Council, and the county soil and water conservation district of the date of expiration. Designation as an agricultural preserve and all benefits and limitations accruing through sections 473H.02 to 473H.17 for the preserve shall cease on the date of expiration. The restrictive covenant contained in the application shall terminate on the date of expiration.",
	"repealed": false
}