{
	"id": "349A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/349A.08",
	"title": "349A.08 LOTTERY PRIZES.",
	"text": "A person who buys a lottery ticket agrees to be bound by the rules applicable to the particular lottery game for which the ticket is purchased. The player acknowledges that the determination of whether a ticket is a valid winning ticket is subject to the rules of the director, claims procedures established by the director for that game, and any confidential or public validation tests established by the director for that game.\nA prize in the state lottery is not assignable except that:\n(1) if a prize winner dies before the prize is paid, the director shall pay the prize to the prize winner's estate; and\n(2) the director may pay a prize to a person other than the winner of that prize under an appropriate court order.\nMS 2016 [Repealed, 1Sp2017 c 4 art 2 s 66]\nThe payment of a prize by the director discharges the director and the state of all liability for the prize.\nA prize in the state lottery must be claimed by the winner within one year of the date of the drawing at which the prize was awarded or the last day sales were authorized for a game where a prize was determined in a manner other than by means of a drawing. If a valid claim is not made for a prize payable directly by the lottery by the end of this period, the prize money is considered unclaimed and the winner of the prize shall have no further claim to the prize. A prize won by a person who purchased the winning ticket in violation of section 349A.12, subdivision 1, or won by a person ineligible to be awarded a prize under subdivision 7 must be treated as an unclaimed prize under this section. The director must transfer all unclaimed prize money at the end of each fiscal year from the lottery cash flow account to the general fund.\nIf the director decides to pay all or part of a prize in the form of installments over a period of years, the director shall provide for the payment of all installments by:\n(1) entering into a contract with a financially responsible person or firm or by purchasing an annuity to provide for the payment of the installments; or\n(2) establishing and maintaining as a separate and independent fund outside the state treasury a reserve account with sufficient funds for the payment of the installments as they become due.\n(a) No prize may be paid to the director or an employee of the lottery, or a member of their families residing in the same household of the member, director, or employee. No prize may be paid to an officer or employee of a vendor which at the time the game or drawing was being conducted was involved with providing goods or services to the lottery under a lottery procurement contract.\n(b) No prize may be paid for a stolen, altered, or fraudulent ticket.\nThe director shall report the name, address, and Social Security number of each winner of a lottery prize of $600 or more to the Department of Revenue to determine whether the person who has won the prize is delinquent in payment of state taxes or owes a debt as defined in section 270A.03, subdivision 5. If the person is delinquent in payment of state taxes or owes a debt as defined in section 270A.03, subdivision 5, the director shall withhold the delinquent amount from the person's prize for remittance to the Department of Revenue for payment of the delinquent taxes or distribution to a claimant agency in accordance with chapter 270A. Section 270A.10 applies to the priority of claims.\n(a) The phone number and street address of a winner of a lottery prize is private data on individuals under chapter 13.\n(b) Data on an individual, including name, physical and electronic address, and telephone number, that are given to the lottery for direct marketing purposes are private data on individuals as defined in section 13.02. For purposes of this subdivision, \"direct marketing\" means marketing conducted by the lottery directly with the consumer.\n(c) The name of the winner of a lottery prize that includes a cash payment greater than $10,000, and the name of a winner of a second chance drawing prize that includes a cash payment greater than $10,000, are private data on individuals under chapter 13.\n(d) The name of the winner of a lottery prize that is classified under paragraph (c) may be made public if the winner provides written consent after the director has informed the winner of the director's intended use of the winner's name.",
	"repealed": false
}