{
	"id": "148.9965",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9965",
	"title": "148.9965 DESIGNATION OF DOULA CERTIFICATION ORGANIZATIONS BY COMMISSIONER.",
	"text": "The commissioner shall periodically review the doula certification organizations listed in section 148.995, subdivision 2, or designated by the commissioner under this section. The commissioner may: (1) designate additional organizations from which individuals, if maintaining current doula certification from such an organization, are eligible for inclusion on the registry of certified doulas; and (2) remove the designation of a doula certification organization previously designated by the commissioner.\nA doula certification organization seeking designation under this section shall provide the commissioner with evidence that the organization satisfies designation criteria established by the commissioner. If the commissioner designates a doula certification organization under this section, the commissioner shall provide notice of the designation by publication in the State Register and on the Department of Health website for the registry of certified doulas and shall specify the date after which a certification by the organization authorizes a doula certified by the organization to be included on the registry.\n(a) The commissioner may remove the designation of a doula certification organization previously designated by the commissioner under this section upon a determination by the commissioner that the organization does not meet the commissioner's criteria for designation. If the commissioner removes a designation, the commissioner shall provide notice of the removal by publication in the State Register and shall specify the date after which a certification by the organization no longer authorizes a doula certified by the organization to be included on the registry.\n(b) Following removal of a designation, the Department of Health website for the registry of certified doulas shall be modified to reflect the removal.",
	"repealed": false
}