{
	"id": "609.495",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.495",
	"title": "609.495 AIDING AN OFFENDER.",
	"text": "(a) Whoever harbors, conceals, aids, or assists by word or acts another whom the actor knows or has reason to know has committed a crime under the laws of this or another state or of the United States with intent that such offender shall avoid or escape from arrest, trial, conviction, or punishment, may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $5,000, or both if the crime committed or attempted by the other person is a felony.\n(b) Whoever knowingly harbors, conceals, or aids a person who is on probation, parole, or supervised release because of a felony level conviction and for whom an arrest and detention order has been issued, with intent that the person evade or escape being taken into custody under the order, may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $5,000, or both. As used in this paragraph, \"arrest and detention order\" means a written order to take and detain a probationer, parolee, or supervised releasee that is issued under section 243.05, subdivision 1; 244.195; or 401.025.\n[Repealed, 1996 c 408 art 3 s 40]\nWhoever intentionally aids another person whom the actor knows or has reason to know has committed a criminal act, by destroying or concealing evidence of that crime, providing false or misleading information about that crime, receiving the proceeds of that crime, or otherwise obstructing the investigation or prosecution of that crime is an accomplice after the fact and may be sentenced to not more than one-half of the statutory maximum sentence of imprisonment or to payment of a fine of not more than one-half of the maximum fine that could be imposed on the principal offender for the crime of violence. For purposes of this subdivision, \"criminal act\" means an act that is a crime listed in section 609.11, subdivision 9, under the laws of this or another state, or of the United States, and also includes an act that would be a criminal act if committed by an adult.\n(a) Unless the person is convicted of the underlying crime, a person who assumes responsibility for a criminal act with the intent to obstruct, impede, or prevent a criminal investigation may be sentenced to not more than one-half of the statutory maximum sentence of imprisonment or to payment of a fine of not more than one-half of the maximum fine that could be imposed on the principal offender for the criminal act.\n(b) Nothing in this subdivision shall be construed to impair the right of any individual or group to engage in speech protected by the United States Constitution or the Minnesota Constitution.\nAn offense committed under subdivision 1 or 3 may be prosecuted in:\n(1) the county where the aiding or obstructing behavior occurred; or\n(2) the county where the underlying criminal act occurred.",
	"repealed": false
}