{
	"id": "333.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/333.18",
	"title": "333.18 DEFINITIONS.",
	"text": "(a) The term \"trademark\" as used in sections 333.18 to 333.31 means any word, name, symbol, or device or any combination thereof adopted and used by a person to identify goods made or sold by that person and to distinguish them from goods made or sold by others. Trademark includes a mark used on or in connection with the goods of one or more persons other than the owner of the mark to certify regional or other origin, material, mode of manufacture, quality, accuracy, or other characteristics of the goods or that the work or labor on the goods was performed by the members of a union or other organization. The term also includes a mark by members of a cooperative, an association, or other collective group or organization and includes marks used to indicate membership in a union, an association, or other organization.\n(b) The term \"service mark\" as used in sections 333.18 to 333.31 means a word, name, symbol, or device or any combination thereof adopted and used by a person to identify that person's services and to distinguish them from services of others and includes without limitation the marks, names, symbols, titles, designations, slogans, character names, and distinctive features of radio or other advertising used in commerce. Service mark includes a mark used in connection with the services of one or more persons other than the owner of the mark to certify regional or other origin, material, quality, accuracy, or other characteristics of the service or that the work or labor on the services was performed by members of a union or other organization. The term also includes a mark used by members of a cooperative, an association, or other collective group or organization and includes marks used to indicate membership in a union, an association, or other organization.\n(c) The term \"certification mark\" means a mark used upon or in connection with the products or services of one or more persons other than the owner of the mark to certify regional or other origin, material, mode of manufacture, quality, accuracy or other characteristics of the goods or services or that the work or labor on the goods or services was performed by members of a union or other organization.\n(d) The term \"collective mark\" means a trademark or service mark used by the members of a cooperative, an association or other collective group or organization and includes marks used to indicate membership in a union, an association or other organization.\nThe term \"person\" as used in sections 333.18 to 333.31 means any individual, firm, partnership, limited partnership, limited liability partnership, corporation, limited liability company, whether domestic or foreign, association, union or other organization.\nThe term \"applicant\" as used in sections 333.18 to 333.31 embraces the person filing an application for registration of a mark under sections 333.18 to 333.31, the applicant's legal representatives, successors or assigns.\nThe term \"registrant\" as used in sections 333.18 to 333.31 embraces the person to whom the registration of a mark under sections 333.18 to 333.31 is issued, a legal representative, successors or assigns.\n(a) For the purposes of sections 333.18 to 333.31, a trademark is \"used\" in this state when it is placed in any manner on the goods or their containers or on the tags or labels affixed to them or on displays associated with the goods and the goods are sold or otherwise distributed in this state for marketing or other legitimate business purposes.\n(b) For the purpose of sections 333.18 to 333.31, a service mark is \"adopted and used\" when it is adopted and used in connection with the rendering, selling, or advertising of services in this state to identify the services of one person and distinguish them from the services of others, and the services are rendered for marketing or other legitimate business purposes.\nFor purposes of sections 333.18 to 333.31, a trademark or service mark is considered abandoned when either of the following occurs:\n(1) when its use has been discontinued with intent not to resume that use. Intent not to resume use may be inferred from circumstances. Nonuse for two consecutive years constitutes prima facie evidence of abandonment; or\n(2) when a course of conduct of the owner, including acts of omission as well as commission, causes the mark to lose its significance as a mark.\nThe term \"dilution\" means the lessening of the capacity of a famous mark to identify and distinguish goods and services, regardless of the presence or absence of:\n(1) competition between the owner of a famous mark and other parties; or\n(2) the likelihood of confusion, mistake, or deception.\nThe term \"generic\" means that the registered mark is no longer considered by the public to identify exclusively the goods or services of the mark holder as described in the application for the mark.",
	"repealed": false
}