{
	"id": "257C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/257C.08",
	"title": "257C.08 RIGHTS OF VISITATION TO UNMARRIED PERSONS.",
	"text": "If a parent of an unmarried minor child is deceased, the parents and grandparents of the deceased parent may be granted reasonable visitation rights to the unmarried minor child during minority by the district court upon finding that visitation rights would be in the best interests of the child and would not interfere with the parent child relationship. The court shall consider the amount of personal contact between the parents or grandparents of the deceased parent and the child prior to the application.\n(a) In all proceedings for dissolution, custody, legal separation, annulment, or parentage, after the commencement of the proceeding, or at any time after completion of the proceedings, and continuing during the minority of the child, the court may, upon the request of the parent or grandparent of a party, grant reasonable visitation rights to the unmarried minor child, after dissolution of marriage, legal separation, annulment, or determination of parentage during minority if it finds that: (1) visitation rights would be in the best interests of the child; and (2) such visitation would not interfere with the parent-child relationship. The court shall consider the amount of personal contact between the parents or grandparents of the party and the child prior to the application.\n(b) If a motion for grandparent visitation has been heard and denied, unless agreed to in writing by the parties, no subsequent motion may be filed within six months after disposition of a prior motion on its merits.\nIf an unmarried minor has resided with grandparents or great-grandparents for a period of 12 months or more, and is subsequently removed from the home by the minor's parents, the grandparents or great-grandparents may petition the district court for an order granting them reasonable visitation rights to the child during minority. The court shall grant the petition if it finds that visitation rights would be in the best interests of the child and would not interfere with the parent and child relationship.\nIf an unmarried minor has resided in a household with a person, other than a foster parent, for two years or more and no longer resides with the person, the person may petition the district court for an order granting the person reasonable visitation rights to the child during the child's minority. The court shall grant the petition if it finds that:\n(1) visitation rights would be in the best interests of the child;\n(2) the petitioner and child had established emotional ties creating a parent and child relationship; and\n(3) visitation rights would not interfere with the relationship between the custodial parent and the child.\nThe court shall consider the reasonable preference of the child, if the court considers the child to be of sufficient age to express a preference.\nThis section shall not apply if the child has been adopted by a person other than a stepparent or grandparent. Any visitation rights granted pursuant to this section prior to the adoption of the child shall be automatically terminated upon such adoption.\n(a) A grandparent of a child adopted by a stepparent may petition and a court may grant an order setting visitation with the child if:\n(1) the grandparent is the parent of:\n(i) a deceased parent of the child; or\n(ii) a parent of the child whose parental relationship was terminated by a decree of adoption according to section 259.57, subdivision 1; and\n(2) the court determines that the requested visitation:\n(i) is in the best interests of the child; and\n(ii) would not interfere with the parent and child relationship.\n(b) Failure to comply with the terms of an order for visitation granted under this subdivision is not a basis for revoking, setting aside, or otherwise challenging the validity of a consent, relinquishment, or adoption of a child.\nThe court may not deny visitation rights under this section based on allegations that the visitation rights would interfere with the relationship between the custodial parent and the child unless after a hearing the court determines by a preponderance of the evidence that interference would occur.\n[See Note.]\nProceedings under this section may not be combined with a proceeding under chapter 518B.",
	"repealed": false
}