{
	"id": "145A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.17",
	"title": "145A.17 FAMILY HOME VISITING PROGRAMS.",
	"text": "The commissioner shall establish a program to fund family home visiting programs designed to foster healthy beginnings, improve pregnancy outcomes, promote school readiness, prevent child abuse and neglect, reduce juvenile delinquency, promote positive parenting and resiliency in children, and promote family health and economic self-sufficiency for children and families. The commissioner shall promote partnerships, collaboration, and multidisciplinary visiting done by teams of professionals and paraprofessionals from the fields of public health nursing, social work, and early childhood education. A program funded under this section must serve families at or below 200 percent of the federal poverty guidelines, and other families determined to be at risk, including but not limited to being at risk for child abuse, child neglect, or juvenile delinquency. Programs must begin prenatally whenever possible and must be targeted to families with:\n(1) adolescent parents;\n(2) a history of alcohol or other drug abuse;\n(3) a history of child abuse, domestic abuse, or other types of violence;\n(4) a history of domestic abuse, rape, or other forms of victimization;\n(5) reduced cognitive functioning;\n(6) a lack of knowledge of child growth and development stages;\n(7) low resiliency to adversities and environmental stresses;\n(8) insufficient financial resources to meet family needs;\n(9) a history of homelessness;\n(10) a risk of long-term welfare dependence or family instability due to employment barriers;\n(11) a serious mental health disorder, including maternal depression as defined in section 145.907; or\n(12) other risk factors as determined by the commissioner.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n(a) Community health boards and tribal governments that receive funding under this section must submit a plan to the commissioner describing a multidisciplinary approach to targeted home visiting for families. The plan must be submitted on forms provided by the commissioner. At a minimum, the plan must include the following:\n(1) a description of outreach strategies to families prenatally or at birth;\n(2) provisions for the seamless delivery of health, safety, and early learning services;\n(3) methods to promote continuity of services when families move within the state;\n(4) a description of the community demographics;\n(5) a plan for meeting outcome measures; and\n(6) a proposed work plan that includes:\n(i) coordination to ensure nonduplication of services for children and families;\n(ii) a description of the strategies to ensure that children and families at greatest risk receive appropriate services; and\n(iii) collaboration with multidisciplinary partners including public health, ECFE, Head Start, community health workers, social workers, community home visiting programs, school districts, and other relevant partners. Letters of intent from multidisciplinary partners must be submitted with the plan.\n(b) Each program that receives funds must accomplish the following program requirements:\n(1) use a community-based strategy to provide preventive and early intervention home visiting services;\n(2) offer a home visit by a trained home visitor. If a home visit is accepted, the first home visit must occur prenatally or as soon after birth as possible and must include a public health nursing assessment by a public health nurse;\n(3) offer, at a minimum, information on infant care, child growth and development, positive parenting, preventing diseases, preventing exposure to environmental hazards, and support services available in the community;\n(4) provide information on and referrals to health care services, if needed, including information on and assistance in applying for health care coverage for which the child or family may be eligible; and provide information on preventive services, developmental assessments, and the availability of public assistance programs as appropriate;\n(5) provide youth development programs when appropriate;\n(6) recruit home visitors who will represent, to the extent possible, the races, cultures, and languages spoken by families that may be served;\n(7) train and supervise home visitors in accordance with the requirements established under subdivision 4;\n(8) maximize resources and minimize duplication by coordinating or contracting with local social and human services organizations, education organizations, and other appropriate governmental entities and community-based organizations and agencies;\n(9) utilize appropriate racial and ethnic approaches to providing home visiting services; and\n(10) connect eligible families, as needed, to additional resources available in the community, including, but not limited to, early care and education programs, health or mental health services, family literacy programs, employment agencies, social services, and child care resources and referral agencies.\n(c) When available, programs that receive funds under this section must offer or provide the family with a referral to center-based or group meetings that meet at least once per month for those families identified with additional needs. The meetings must focus on further enhancing the information, activities, and skill-building addressed during home visitation; offering opportunities for parents to meet with and support each other; and offering infants and toddlers a safe, nurturing, and stimulating environment for socialization and supervised play with qualified teachers.\n(d) Funds available under this section shall not be used for medical services. The commissioner shall establish an administrative cost limit for recipients of funds. The outcome measures established under subdivision 6 must be specified to recipients of funds at the time the funds are distributed.\n(e) Data collected on individuals served by the home visiting programs must remain confidential and must not be disclosed by providers of home visiting services without a specific informed written consent that identifies disclosures to be made. Upon request, agencies providing home visiting services must provide recipients with information on disclosures, including the names of entities and individuals receiving the information and the general purpose of the disclosure. Prospective and current recipients of home visiting services must be told and informed in writing that written consent for disclosure of data is not required for access to home visiting services.\n(f) Upon initial contact with a family, programs that receive funding under this section must receive permission from the family to share with other family service providers information about services the family is receiving and unmet needs of the family in order to select a lead agency for the family and coordinate available resources. For purposes of this paragraph, the term \"family service providers\" includes local public health, social services, school districts, Head Start programs, health care providers, and other public agencies.\nThe commissioner shall establish training requirements for home visitors and minimum requirements for supervision. The requirements for nurses must be consistent with chapter 148. The commissioner must provide training for home visitors. Training must include the following:\n(1) effective relationships for engaging and retaining families and ensuring family health, safety, and early learning;\n(2) effective methods of implementing parent education, conducting home visiting, and promoting quality early childhood development;\n(3) early childhood development from birth to age five;\n(4) diverse cultural practices in child rearing and family systems;\n(5) recruiting, supervising, and retaining qualified staff;\n(6) increasing services for underserved populations; and\n(7) relevant issues related to child welfare and protective services, with information provided being consistent with state child welfare agency training.\nThe county social service agency and the local public health department may mutually agree to utilize home visitors under this section as MFIP employment and training service providers under section 142G.50, subdivision 3, for MFIP participants who are: (1) ill or incapacitated under section 142G.42, subdivision 3; or (2) minor caregivers under section 142G.57. The county social service agency and the local public health department may also mutually agree to utilize home visitors to provide outreach to MFIP families who are being sanctioned or who have been terminated from MFIP due to the 60-month time limit.\nThe commissioner shall provide administrative and technical assistance to each program, including assistance in data collection and other activities related to conducting short- and long-term evaluations of the programs as required under subdivision 7. The commissioner may request research and evaluation support from the University of Minnesota.\nThe commissioner shall establish measures to determine the impact of family home visiting programs funded under this section on the following areas:\n(1) appropriate utilization of preventive health care;\n(2) rates of substantiated child abuse and neglect;\n(3) rates of unintentional child injuries;\n(4) rates of children who are screened and who pass early childhood screening;\n(5) rates of children accessing early care and educational services;\n(6) program retention rates;\n(7) number of home visits provided compared to the number of home visits planned;\n(8) participant satisfaction;\n(9) rates of at-risk populations reached; and\n(10) any additional qualitative goals and quantitative measures established by the commissioner.\nUsing the qualitative goals and quantitative outcome and performance measures established under subdivisions 1 and 6, the commissioner shall conduct ongoing evaluations of the programs funded under this section. Community health boards and tribal governments shall cooperate with the commissioner in the evaluations and shall provide the commissioner with the information necessary to conduct the evaluations. As part of the ongoing evaluations, the commissioner shall rate the impact of the programs on the outcome measures listed in subdivision 6, and shall periodically determine whether home visiting programs are the best way to achieve the qualitative goals established under subdivisions 1 and 6. If the commissioner determines that home visiting programs are not the best way to achieve these goals, the commissioner shall provide the legislature with alternative methods for achieving them.\nBy January 15, 2002, and January 15 of each even-numbered year thereafter, the commissioner shall submit a report to the legislature on the family home visiting programs funded under this section and on the results of the evaluations conducted under subdivision 7.\nFunding available under this section may be used only to supplement, not to replace, nonstate funds being used for home visiting services as of July 1, 2001.",
	"repealed": false
}