{
	"id": "322C.0806",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0806",
	"title": "322C.0806 REVOCATION OF CERTIFICATE OF AUTHORITY.",
	"text": "The certificate of authority of a foreign limited liability company to transact business in this state shall be revoked by the secretary of state if it fails:\n(1) to pay any fee due under the provisions of this chapter;\n(2) to designate a registered agent when a vacancy occurs in that office, or when the appointed registered agent resigns or becomes disqualified or incapacitated;\n(3) to file certificates of merger or name change, as required in section 322C.0805, subdivision 2; or\n(4) to file an annual renewal.\nOn finding that a default has occurred under subdivision 1, clauses (1) to (3), the secretary of state shall notify the foreign limited liability company that the default exists and that its certificate of authority will be revoked unless the default shall be cured within 30 days.\n(1) The secretary of state shall revoke the certificate of authority of a foreign limited liability company that is in default under subdivision 1, clause (4), for failure to file an annual renewal under section 5.34.\n(2) The secretary of state shall revoke the certificate of authority of a foreign limited liability company that is in default under subdivision 1, clauses (1) to (3), if the default is not cured within the time provided under subdivision 2; provided that for good cause shown the secretary of state may extend the 30-day period from time to time, but in no event may the aggregate of all extensions granted exceed 180 days or the period of time of any applicable extension granted by the Department of Revenue for filing the income tax return of the corporation, whichever is greater.\n(1) Upon revoking the certificate of authority of a foreign limited liability company because of a default under subdivision 1, clauses (1) to (3), the secretary of state shall:\n(i) issue a certificate of revocation; and\n(ii) provide a notice of the revocation to the foreign limited liability company.\n(2) Upon revoking the certificate of authority of a foreign limited liability company because of a default under subdivision 1, clause (4), the secretary of state shall issue a certificate of revocation, and the certificate must be filed in the Office of the Secretary of State. No further notice to the foreign limited liability company is required.\n(3) The secretary of state shall also make the names of the revoked foreign limited liability companies available in an electronic format.\nUpon the issuance of such certificate of revocation, the authority of the foreign limited liability company to transact business in this state shall cease.",
	"repealed": false
}