{
	"id": "365.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/365.51",
	"title": "365.51 ANNUAL MEETING; NOTICE, BUSINESS, ELECTIONS.",
	"text": "(a) A town's annual town meeting must be held on the second Tuesday of March at the place named by the last annual town meeting. If no place was named then, the meeting must be held at the place named by the town board. The place may be outside the town if the place is within five miles of a town boundary. If, on the day of the meeting and election in March, the National Weather Service or a law enforcement agency has issued storm warnings or travel advisories such that the clerk determines travel to a polling place would be difficult or hazardous for voters and election judges, the clerk may postpone the election and meeting. If the meeting and election are postponed, the meeting and election shall be held on the third Tuesday in March. Prior to providing notice of the election and meeting, the town board shall by resolution set another date for the meeting and election within 30 days of the third Tuesday in March on which the meeting and election shall be held if bad weather forces postponement of the meeting and election on the third Tuesday in March. The decision to postpone the meeting and election must be made no later than three hours before the opening of the polling place or the convening of the meeting, whichever comes first. The clerk shall notify the election judges and local media offices of the decision to postpone the meeting and election. If the meeting and election are postponed, the notice requirements in subdivision 2 shall apply to the postponed meeting and election.\nThe balloting of the town election must be concluded on the same day the election is commenced.\n(b) If any other political subdivision is conducting an election in conjunction with the township election, postponement of the election shall be subject to section 205.105, 205A.055, or 373.50. If an election is postponed under section 205.105, 205A.055, or 373.50, the town meeting shall also be postponed as if postponed under this section.\nThe clerk shall give ten days' published notice of the time and place of the meeting in a qualified newspaper having general circulation in the town. An alternative to published notice is posted notice, as directed by the town board unless the electors at an earlier annual town meeting direct otherwise. The notice must include the date on which the election will be held if postponement due to bad weather is necessary.\nAn annual town election shall be held on the same day as the annual town meeting to elect all town officers required by law to be elected and to consider ballot questions, except as provided in section 205.075, subdivision 2. Other town business shall be conducted at the town meeting as provided by law.\nThe town board may, with respect to an election by ballot at the annual town meeting for the purpose of determining any matter of town business, provide for the casting of ballots in precincts and at polling places. Precincts and polling places shall be designated by the town board in the manner prescribed by sections 204B.14 and 204B.16.",
	"repealed": false
}