{
	"id": "115B.444",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.444",
	"title": "115B.444 STATE ACTION AGAINST INSURERS.",
	"text": "The state, by the attorney general, may bring a state action against any insurer for recovery of all environmental response costs incurred and to be incurred by the state, which costs are related to qualified facilities for which the state has assumed response action obligations or responsibilities under sections 115B.39 to 115B.43, and for which costs policyholders of the insurer may be liable. No assignment of any rights of a policyholder to the state and no judgment against the policyholder is required as a condition for the state bringing an action under this subdivision. The state shall make reasonable efforts to notify affected policyholders of the state's commencement of an action under this section. An affected policyholder may intervene in an action under this section. For purposes of this section, an \"affected policyholder\" means a policyholder whose rights under an insurance policy relevant to an action under this section may be affected by the action. All defenses available to a policyholder to any claim of liability for environmental response costs asserted or which could be asserted against it shall be available to the insurer in an action brought by the state under this subdivision. In any action under this subdivision, the claim of the state shall be limited by the applicable terms, conditions, and provisions of the relevant insurance policy under which coverage may be provided, and the state shall have no greater rights than the rights of the policyholder under its insurance policy subject to the statutory and common law that applies to the determination of those rights. Nothing in sections 115B.441 to 115B.445 shall be construed to relieve any policyholder of liability for environmental response costs to the extent of any insurance coverage of the policyholder by reason of the assumption of obligations or responsibilities by the state for environmental response actions under sections 115B.39 to 115B.43. Before the attorney general may commence an action against an insurer under this subdivision, for any claims with respect to a qualified facility, the attorney general and the commissioner shall present to the insurer a written settlement offer, and shall provide the insurer with an opportunity to negotiate and enter a settlement with the state as provided in section 115B.443. In any action under this subdivision, the state shall have the same rights as individual policyholders to recover its reasonable expenses and costs of litigation, including attorney fees.\n(a) Except as provided in paragraph (b), nothing in sections 115B.441 to 115B.444 affects the right of a policyholder to bring or pursue any action against, or enter any settlement with, an insurer for any claims for which the state has a right of action against the insurer under this section and that have not been resolved by a settlement or judgment under this section. The state may intervene in an action in which a policyholder seeks to recover a claim for which the state has a right of action under this section.\n(b) A policyholder may not enter a settlement that releases an insurer from any claims for which the state has an action under subdivision 1, unless the attorney general has given prior written approval to the settlement and the policyholder agrees to assign to the state any amounts recovered under the settlement from the insurer that are attributable to the resolution of the claims.",
	"repealed": false
}