{
	"id": "325G.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.23",
	"title": "325G.23 DEFINITIONS.",
	"text": "As used in sections 325G.23 to 325G.28, the terms defined in this section have the meanings given them.\n\"Club\" means any health club, social referral club or buying club.\n\"Contract\" means any agreement by which one becomes a member of a club.\n\"Health club\" means any corporation, partnership, unincorporated association, or other business enterprise having the primary purpose of offering one or more facilities for instruction, training, encouragement, or assistance in physical fitness, in return for the payment of a fee entitling the member to the use of the facilities. The term does not include any nonprofit organizations, any private club owned and operated by its members, or any facility operated by the state or any of its political subdivisions.\n\"Social referral club\" means any corporation, partnership, unincorporated association or other business enterprise organized for profit with the primary purpose of matching members of the opposite sex, by the use of computer or any other means, to facilitate dating or general social contact.\n\"Buying club\" means any corporation, partnership, unincorporated association or other business enterprise organized for profit with the primary purpose of providing benefits to members from the cooperative purchase of services or merchandise.\n\"Member\" means a status by which any natural person is entitled to any of the benefits of a club.\n\"Prepayment\" means any payment over $50 for service or merchandise made before the service is rendered or the merchandise is received. The term \"prepayment\" includes, but is not limited to, the payment of any service fee, initiation fee, application fee, administrative fee, deposit fee, processing fee, enrollment fee, maintenance fee, or similar fee no matter how the fee is denominated. It is not a prepayment if a payment for service is made on the same day the service is rendered. Money received by a club from a financial institution upon assignment of a contract shall be considered prepayment when and to the extent the member is required to make prepayments to the financial institution pursuant to the contract.\n\"Business day\" means any day other than a Saturday, Sunday, or holiday as defined in section 645.44.\n\"Outstanding liabilities\" means the amount of prepayment actually received from club members less the amount of the prepayment as prorated over the duration of any contract for services rendered by the club.",
	"repealed": false
}