{
	"id": "278.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/278.03",
	"title": "278.03 PAYMENT OF TAX.",
	"text": "In the case of real property, if the proceedings instituted by the filing of the petition have not been completed before the 16th day of May next following the filing, the petitioner shall pay to the county treasurer 50 percent of the tax levied for such year against the property involved, unless permission to continue prosecution of the petition without such payment is obtained as herein provided. If the proceedings instituted by the filing of the petition have not been completed by the next October 16, or, in the case of class 1b agricultural homestead, class 2a agricultural homestead, and class 2b(2) agricultural nonhomestead property, November 16, the petitioner shall pay to the county treasurer 50 percent of the unpaid balance of the taxes levied for the year against the property involved if the unpaid balance is $2,000 or less and 80 percent of the unpaid balance if the unpaid balance is over $2,000, unless permission to continue prosecution of the petition without payment is obtained as herein provided. The petitioner, upon ten days' notice to the county attorney and to the county auditor, given at least ten days prior to the 16th day of May or the 16th day of October, or, in the case of class 1b agricultural homestead, class 2a agricultural homestead, and class 2b(2) agricultural nonhomestead property, the 16th day of November, may apply to the court for permission to continue prosecution of the petition without payment; and, if it is made to appear\n(1) that the proposed review is to be taken in good faith;\n(2) that there is probable cause to believe that the property may be held exempt from the tax levied or that the tax may be determined to be less than 50 percent of the amount levied; and\n(3) that it would work a hardship upon petitioner to pay the taxes due,\nthe court may permit the petitioner to continue prosecution of the petition without payment, or may fix a lesser amount to be paid as a condition of continuing the prosecution of the petition.\nFailure to make payment of the amount required when due shall operate automatically to dismiss the petition and all proceedings thereunder unless the payment is waived by an order of the court permitting the petitioner to continue prosecution of the petition without payment. The petition shall be automatically reinstated upon payment of the entire tax plus interest and penalty if the payment is made within one year of the dismissal. The county treasurer shall, upon request of the petitioner, issue duplicate receipts for the tax payment, one of which shall be filed by the petitioner in the proceeding.\nIn the case of personal property, if the proceedings instituted by the filing of the petition have not been completed before May 16 next following the filing of the petition, the petitioner shall pay to the county treasurer 50 percent of the tax levied for the year against the property involved, unless permission to file the petition without payment is obtained as provided in this subdivision. The petitioner, upon ten days' notice to the county attorney and to the county auditor, given at least ten days before May 16, may apply to the court for permission to file the petition without such payment; and, if it is made to appear:\n(1) that the proposed review is to be taken in good faith;\n(2) that there is probable cause to believe that the property may be held exempt from the tax levied or that the tax may be determined to be less than 50 percent of the amount levied; and\n(3) that it would work a hardship upon petitioner to pay 50 percent of the tax.\nThe court may permit the petitioner to continue to prosecute the petition without payment, or may fix a lesser amount to be paid as a condition to the right to continue to prosecute the same. Payment of the amount so fixed shall be endorsed on the order by the county treasurer.",
	"repealed": false
}