{
	"id": "471.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.371",
	"title": "471.371 CONTRACTS FOR CONSTRUCTION OF TREATMENT WORKS.",
	"text": "MS 1990 [Repealed, 1991 c 212 s 4]\nNotwithstanding the provisions of any law or charter to the contrary, any municipality authorized by law to enter into a contract for the design and/or construction of water or wastewater treatment facilities may advertise for sealed bids for the design and construction thereof under a single contract. Prior to such advertisement the municipality shall prepare or cause to be prepared documents which shall serve as a basis for the comparison of bids and any contract to be entered into. These documents shall be prepared by a professional engineer in sufficient detail, including hydraulic flow and organic loading calculations, design capacity, effluent limits, design life, and the treatment alternatives for the wastewater treatment facility, for the bidder to describe the probable cost, scope of work, equipment and materials of construction; and the documents shall include performance standards for the construction and performance standards for the operation of the facility which must be met for specified conditions and time periods, prior to final acceptance of the facility by the municipality. The documents shall require the bidder to furnish estimates of the annual operation and maintenance costs of the facility, conceptual plans and specifications and any other information deemed relevant for contract award.\nIn awarding the contract, the municipality shall take into consideration the performance guarantee, completion date, construction cost, capacity of the facility, design life estimated annual operation and maintenance cost, and other relevant factors.\nThe provisions of any law which require the Minnesota Pollution Control Agency to approve all plans and specifications on a municipal or regional water or wastewater treatment facility prior to calling for construction bids shall not be applicable to contracts authorized by this section. However, after bids have been received and evaluated by the governing body, the best bid determined, and the contract awarded, a municipality shall not, by the terms of the awarded contract, allow construction to commence until all legal requirements are met and the plans and specifications for construction of a wastewater treatment facility have been approved by the Minnesota Pollution Control Agency or, in the case of a water treatment facility, the plans and specifications for construction have been approved by the Minnesota Department of Health.\nUpon award of the contract the municipality shall require the successful bidder to furnish detailed plans and specifications and shall provide for termination of the contract and may provide for penalties if such plans and specifications are insufficient to permit the municipality to satisfy the requirements of any federal or state permit.\nThe provisions of subdivision 2 shall not in any way limit the application and effect of laws governing the practice of architecture, professional engineering, or land surveying in this state, including sections 326.02 to 326.15, and 541.051.\nAs used in this section, \"municipality\" has the meaning given to it in section 471.345; \"contract\" includes not only construction work but also all necessary design services, including process and mechanical equipment, provisions for the start-up of the new facility, performance guarantee, and the other necessary and related items to make an operable plant; and \"facility\" or \"facilities\" shall, in addition to the treatment facility, include collection and distribution systems.\nEach awarded contract:\n(1) shall require a payment and performance bond for the construction portion of the contract;\n(2) shall require the successful bidder to guarantee the performance of the facility to the level required by a permit for the operation of the facility, for 12 months after the date operation begins; and\n(3) may allow construction progress payments by the municipality to the successful bidder.\nMS 1990 [Repealed, 1991 c 212 s 4]",
	"repealed": false
}