{
	"id": "115.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.57",
	"title": "115.57 LOAN PROGRAM; SUBSURFACE SEWAGE TREATMENT SYSTEMS AND WELLS.",
	"text": "The legislature finds that a need exists to provide for the creation of a public loan program that assists property owners to finance the site evaluation, design, installation, repair, and replacement of subsurface sewage treatment systems and to finance the sealing and replacement of wells on privately owned property. Such a public loan program promotes the public health and welfare by furthering the policy of the state of Minnesota to prevent, reduce, and eliminate water pollution. The legislature declares that the actions required to establish and implement a public loan program for the purposes stated in this section are a public purpose and that the execution and financing of such a program is a public purpose.\n(a) The terms defined in this subdivision and section 115.55, subdivision 1, apply to this section.\n(b) \"Improvement\" means the site evaluation, design, installation, repair, or replacement of a subsurface sewage treatment system or sealing or replacement of a well.\n(c) \"Municipality\" means a township, city, county, or any other governmental subdivision of the state responsible by law for the prevention, control, and abatement of water pollution in any area of the state.\n(d) \"Property owner\" means the owner or owners as recorded on the tax roll of the county where the real property on which the subsurface sewage treatment system or well is installed, repaired, or replaced is located.\n(e) \"Well\" means a well as defined in section 103I.005, subdivision 21:\n(1) that is required to be sealed under section 103I.301, subdivision 1; or\n(2) the relocation of which is necessary for compliance with applicable requirements as defined in section 115.55, subdivision 1.\nA municipality may, individually or cooperatively with other municipalities, establish a subsurface sewage treatment system or well loan program, or both, for the purpose of providing loans to property owners for the site evaluation, design, installation, repair, or replacement of subsurface sewage treatment systems or for the sealing or replacement of wells on privately owned property. The governing body of a municipality shall provide for the operation and administration of the program by ordinance. A municipality may appoint an administrator to operate the program.\nLoans may not be used to facilitate new building construction. As used in this subdivision, \"facilitate new building construction\" includes increasing capacity of a subsurface sewage treatment system beyond what is reasonably required to serve existing buildings and lots in existing recorded plats.\nA municipality may issue bonds in accordance with chapter 475 to finance the program, except that an election is not required and the obligations are not subject to the general limit on net debt for the municipality. Financing may also be provided by issuing certificates of indebtedness, securing loans, or transferring available funds that the municipality is not obligated by law to use for some other purpose. Funds procured for the subsurface sewage treatment system or well loan program shall be dedicated to the program.\n(a) An amount loaned under the program, including accruing interest, shall be a lien against the real property for which the improvement was made and shall be assessed against the property or properties benefited unless the amount is prepaid. An amount loaned under the program and assessed against the property shall be a priority lien only against subsequent liens.\n(b) Upon issuing a loan, the municipality shall provide the property owner a notice that states the following information:\n(1) the amount to be specially assessed against the property;\n(2) the right of the property owner to prepay the entire assessment;\n(3) the public official to whom prepayment must be made;\n(4) the time within which prepayment must be made without the assessment of interest;\n(5) the rate of interest to be accrued if the assessment is not prepaid within the required time period; and\n(6) the period of the assessment.\n(c) The municipality shall, by ordinance, provide for a right of property owners to prepay the assessment and may establish such other assessment procedures as determined necessary and consistent with the provisions of this section.\nA municipality may not establish a subsurface sewage treatment system loan program unless ordinances in compliance with section 115.55 are in full force and effect. All repairs and improvements made to subsurface sewage treatment systems under this section shall be performed by a licensed subsurface sewage treatment system professional and shall comply with section 115.55 and other applicable requirements. All improvements to wells under this section must be made by a well contractor or a limited well contractor, as appropriate, licensed under chapter 103I.\nThe governing body of a municipality may dissolve the program by ordinance. The ordinance shall provide for the collection of all outstanding assessments, repayment of any remaining indebtedness incurred to finance the program, and the final distribution of any money remaining in the loan fund.",
	"repealed": false
}