{
	"id": "144.6521",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6521",
	"title": "144.6521 DISCLOSURE OF FINANCIAL INTEREST.",
	"text": "No health care provider with a financial or economic interest in, or an employment or contractual arrangement that limits referral options with, a hospital, outpatient surgical center or diagnostic imaging facility, or an affiliate of one of these entities, shall refer a patient to that hospital, center, or facility, or an affiliate of one of these entities, unless the health care provider discloses in writing to the patient, in advance of the referral, the existence of such an interest, employment, or arrangement.\nThe written disclosure form must be printed in letters of at least 12-point boldface type and must read as follows: \"Your health care provider is referring you to a facility or service in which your health care provider has a financial or economic interest.\"\nHospitals, outpatient surgical centers, and diagnostic imaging facilities shall promptly report to the commissioner of health any suspected violations of this section by a health care provider who has made a referral to such hospital, outpatient surgical center, or diagnostic imaging facility without providing the written notice.\nIn addition to the requirement in subdivision 1, each health care provider who makes referrals to a hospital, outpatient surgical center or diagnostic imaging facility, or an affiliate of one of these entities in which the health care provider has a financial or economic interest, or has an employment or contractual arrangement with one of these entities that limits referral options, shall post a notice of this interest, employment, or arrangement in a patient reception area or waiting room or other conspicuous public location within the provider's facility.\n(a) For purposes of this section, the following definitions apply.\n(b) \"Affiliate\" means an entity that controls, is controlled by, or is under common control with another entity.\n(c) \"Diagnostic imaging facility\" has the meaning provided in section 144.565, subdivision 4.\n(d) \"Employment or contractual arrangement that limits referral options\" means a requirement of, or a financial incentive, provided to a health care provider to refer a patient to a specific hospital, outpatient surgical center or diagnostic imaging facility, or an affiliate of one of these entities even if other options exist for the patient.\n(e) \"Freestanding\" has the meaning provided in section 144.565, subdivision 4.\n(f) \"Financial or economic interest\" means a direct or indirect:\n(1) equity or debt security issued by an entity, including, but not limited to, shares of stock in a corporation, membership in a limited liability company, beneficial interest in a trust, units or other interests in a partnership, bonds, debentures, notes or other equity interests or debt instruments, or any contractual arrangements;\n(2) membership, proprietary interest, or co-ownership with an individual, group, or organization to which patients, clients, or customers are referred to; or\n(3) employer-employee or independent contractor relationship, including, but not limited to, those that may occur in a limited partnership, profit-sharing arrangement, or other similar arrangement with any facility to which patients are referred, including any compensation between a facility and a health care provider, the group practice of which the provider is a member or employee or a related party with respect to any of them.\n(g) \"Health care provider\" means an individual licensed by a health licensing board as defined in section 214.01, subdivision 2, who has the authority, within the individual's scope of practice, to make referrals to a hospital, outpatient surgical center, or diagnostic imaging facility.\n(h) \"Mobile\" has the meaning provided in section 144.565, subdivision 4.",
	"repealed": false
}