{
	"id": "256R.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.05",
	"title": "256R.05 REQUIRED PRACTICES.",
	"text": "(a) Medical assistance reimbursement for nursing facilities shall be authorized for a medical assistance recipient only if a preadmission screening has been conducted prior to admission or the county has authorized an exemption. Medical assistance reimbursement for nursing facilities shall not be provided for any recipient who the local screener has determined does not meet the level of care criteria for nursing facility placement in section 144.0724, subdivision 11, or, if indicated, has not had a level II OBRA evaluation as required under the federal Omnibus Budget Reconciliation Act of 1987, unless an admission for a recipient with mental illness is approved by the local mental health authority or an admission for a recipient with developmental disability is approved by the state developmental disability authority.\n(b) The nursing facility must not bill a person who is not a medical assistance recipient for resident days that preceded the date of completion of screening activities as required under section 256.975, subdivisions 7a to 7c. The nursing facility must include unreimbursed resident days in the nursing facility resident day totals reported to the commissioner.\n(a) Notwithstanding sections 256R.04 and 256R.06, subdivisions 2 and 4, nursing facility providers that do not participate in or accept Medicare assignment must refer and document the referral of dual eligible recipients for whom placement is requested and for whom the resident would be qualified for a Medicare-covered stay to Medicare providers. The commissioner shall audit nursing facilities that do not accept Medicare and determine if dual eligible individuals with Medicare qualifying stays have been admitted. If such a determination is made, the commissioner shall deny Medicaid payment for the first 20 days of that resident's stay.\n(b) A nursing facility that violates this subdivision is subject to section 256R.04, subdivisions 7 and 8.",
	"repealed": false
}