{
	"id": "256B.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.35",
	"title": "256B.35 PERSONAL NEEDS ALLOWANCE; PERSONS IN CERTAIN FACILITIES.",
	"text": "(a) Notwithstanding any law to the contrary, welfare allowances for clothing and personal needs for individuals receiving medical assistance while residing in any skilled nursing home, intermediate care facility, or medical institution including recipients of Supplemental Security Income, in this state shall not be less than $45 per month from all sources. When benefit amounts for Social Security or Supplemental Security Income recipients are increased pursuant to United States Code, title 42, sections 415(i) and 1382f, the commissioner shall, effective in the month in which the increase takes effect, increase by the same percentage to the nearest whole dollar the clothing and personal needs allowance for individuals receiving medical assistance while residing in any skilled nursing home, medical institution, or intermediate care facility. The commissioner shall provide timely notice to local agencies, providers, and recipients of increases under this provision.\n(b) The personal needs allowance may be paid as part of the Minnesota supplemental aid program, and payments to recipients of Minnesota supplemental aid may be made once each three months covering liabilities that accrued during the preceding three months.\n(c) The personal needs allowance shall be increased to include income garnished for child support under a court order, up to a maximum of $250 per month but only to the extent that the amount garnished is not deducted as a monthly allowance for children under section 256B.0575, paragraph (a), clause (5).\n(d) Solely for the purpose of section 256B.0575, subdivision 1, paragraph (a), clause (1), the personal needs allowance shall be increased to include income garnished for spousal maintenance under a judgment and decree for dissolution of marriage, and any administrative fees garnished for collection efforts.\nNeither the skilled nursing home, the intermediate care facility, the medical institution, nor the Department of Human Services shall withhold or deduct any amount of this allowance for any purpose contrary to this section.\nThe nursing home may not commingle the patient's funds with nursing home funds or in any way use the funds for nursing home purposes.\nThe commissioner of human services shall conduct field audits at the same time as cost report audits required under section 256R.13, subdivision 1, and at any other time but at least once every four years, without notice, to determine whether this section was complied with and that the funds provided residents for their personal needs were actually expended for that purpose.\nThe nursing home may transfer the personal allowance to someone other than the recipient only when the recipient or the recipient's guardian or conservator designates that person in writing to receive or expend funds on behalf of the recipient and that person certifies in writing that the allowance is spent for the well-being of the recipient. Persons, other than the recipient, in possession of the personal allowance, may use the allowance only for the well-being of the recipient. Any person, other than the recipient, who, with intent to defraud, uses the personal needs allowance for purposes other than the well-being of the recipient shall be guilty of theft and shall be sentenced pursuant to section 609.52, subdivision 3, clauses (2), (3)(a) and (c), (4), and (5). To prosecute under this subdivision, the attorney general or the appropriate county attorney, acting independently or at the direction of the attorney general, may institute a criminal action. A nursing home that transfers personal needs allowance funds to a person other than the recipient in good faith and in compliance with this section shall not be held liable under this subdivision.\nIn addition to the remedies otherwise provided by law, any person injured by a violation of any of the provisions of this section, may bring a civil action and recover damages, together with costs and disbursements, including costs of investigation and reasonable attorney fees, and receive other equitable relief as determined by the court.",
	"repealed": false
}