{
	"id": "147C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/147C.10",
	"title": "147C.10 UNLICENSED PRACTICE PROHIBITED; PROTECTED TITLES AND RESTRICTIONS ON USE.",
	"text": "A person who does not hold a license or temporary permit under this chapter as a respiratory therapist or whose license or permit has lapsed, been suspended, or been revoked may not use the title \"Minnesota licensed respiratory therapist,\" \"licensed respiratory therapist,\" \"respiratory therapist,\" \"inhalation therapist,\" or \"inhalation therapy technician,\" or use, in connection with the individual's name, the letters \"RT\" or \"LRT\" or any other titles, words, letters, abbreviations, or insignia indicating or implying that the individual is eligible for licensure by the state as a respiratory therapist unless the individual has been licensed as a respiratory therapist according to this chapter.\nNo person shall practice respiratory care unless the person is licensed as a respiratory therapist under this chapter except as otherwise provided under this chapter.\n(a) Nothing in this chapter shall prohibit the practice of any profession or occupation licensed or registered by the state by any person duly licensed or registered to practice the profession or occupation or to perform any act that falls within the scope of practice of the profession or occupation.\n(b) Nothing in this chapter shall be construed to require a respiratory care license for:\n(1) a student enrolled in a respiratory therapy or polysomnography technology education program accredited by the Commission on Accreditation of Allied Health Education Programs, its successor organization, or another nationally recognized accrediting organization;\n(2) a respiratory therapist as a member of the United States armed forces while performing duties incident to that duty;\n(3) an individual employed by a durable medical equipment provider or a home medical equipment provider who delivers, sets up, instructs the patient on the use of, or maintains respiratory care equipment, but does not perform assessment, education, or evaluation of the patient;\n(4) self-care by a patient or gratuitous care by a friend or relative who does not purport to be a licensed respiratory therapist; or\n(5) an individual employed in a sleep lab or center as a polysomnographic technologist under the supervision of a licensed physician.\nA person who violates this section is guilty of a gross misdemeanor.\nRespiratory therapists licensed in Minnesota shall wear name tags that identify them as respiratory therapists while in a professional setting. If not written in full, this must be designated as \"RT\" or \"LRT.\" A student attending an accredited respiratory therapy education program must be identified as a student respiratory therapist. This abbreviated designation is Student RT. Unregulated individuals who work in an assisting respiratory role under the supervision of respiratory therapists must be identified as respiratory therapy assistants or aides.",
	"repealed": false
}