{
	"id": "326B.082",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.082",
	"title": "326B.082 ENFORCEMENT.",
	"text": "The commissioner may enforce all applicable law under this section. The commissioner may use any enforcement provision in this section, including the assessment of monetary penalties, against a person required to have a license, registration, certificate, or permit under the applicable law based on conduct that would provide grounds for action against a licensee, registrant, certificate holder, or permit holder under the applicable law. The use of an enforcement provision in this section shall not preclude the use of any other enforcement provision in this section or otherwise provided by law. The commissioner's investigation and enforcement authority under this section may be used by the commissioner in addition to or as an alternative to any other investigation and enforcement authority provided by law.\n(a) In order to carry out the purposes of the applicable law, the commissioner may:\n(1) administer oaths and affirmations, certify official acts, interview, question, take oral or written statements, demand data and information, and take depositions;\n(2) request, examine, take possession of, test, sample, measure, photograph, record, and copy any documents, apparatus, devices, equipment, or materials;\n(3) at a time and place indicated by the commissioner, request persons to appear before the commissioner to give testimony, provide data and information, and produce documents, apparatus, devices, equipment, or materials;\n(4) issue subpoenas to compel persons to give testimony, provide data and information, and to produce documents, apparatus, devices, equipment, or materials; and\n(5) with or without notice, enter without delay and access all areas of any property, public or private, for the purpose of taking any action authorized under this subdivision or the applicable law, including to request, examine, take possession of, test, sample, measure, photograph, record, and copy any data, information, documents, apparatus, devices, equipment, or materials; to interview, question, or take oral or written statements; to remedy violations; or to conduct surveys, inspections, or investigations.\n(b) Persons requested by the commissioner to give testimony, provide data and information, or produce documents, apparatus, devices, equipment, or materials shall respond within the time and in the manner specified by the commissioner. If no time to respond is specified in the request, then a response shall be submitted within 30 days of the commissioner's service of the request.\n(c) Upon the refusal or anticipated refusal of a property owner, lessee, property owner's representative, or lessee's representative to permit the commissioner's entry and access to all areas of any property as provided in paragraph (a), the commissioner may apply for an administrative inspection order in the Ramsey County District Court or, at the commissioner's discretion, in the district court in the county in which the property is located. The commissioner may anticipate that a property owner or lessee will refuse entry and access to all areas of a property if the property owner, lessee, property owner's representative, or lessee's representative has refused to permit entry or access to all areas of a property on a prior occasion or has informed the commissioner that entry or access to areas of a property will be refused. Upon showing of administrative probable cause by the commissioner, the district court shall issue an administrative inspection order that compels the property owner or lessee to permit the commissioner to enter and be allowed access to all areas of the property for the purposes specified in paragraph (a).\n(d) Upon the application of the commissioner, a district court shall treat the failure of any person to obey a subpoena lawfully issued by the commissioner under this subdivision as a contempt of court.\nUnless otherwise specified, service of a document on a person under this section or section 326B.083 may be by mail, by personal service, or in accordance with any consent to service filed with the commissioner. Service by mail shall be accomplished in the manner provided in Minnesota Rules, part 1400.5550, subpart 2. Personal service shall be accomplished in the manner provided in Minnesota Rules, part 1400.5550, subpart 3.\nWhen this section or section 326B.083 permits a request for reconsideration or request for hearing to be served by fax on the commissioner, or when the commissioner instructs that a request for reconsideration or request for hearing be served by email on the commissioner, the fax or email shall not exceed 15 printed pages in length. The request shall be considered timely served if the fax or email is received by the commissioner, at the fax number or email address identified by the commissioner in the order or notice of violation, no later than 4:30 p.m. central time on the last day permitted for faxing or emailing the request. Where the quality or authenticity of the faxed or emailed request is at issue, the commissioner may require the original request to be filed. Where the commissioner has not identified quality or authenticity of the faxed or emailed request as an issue and the request has been faxed or emailed in accordance with this subdivision, the person faxing or emailing the request does not need to file the original request with the commissioner.\nIn computing any period of time prescribed or allowed by this section, the day of the act, event, or default from which the designated period of time begins to run shall not be included. The last day of the period so computed shall be included, unless it is a Saturday, Sunday, or legal holiday, in which event the period runs until the next day which is not a Saturday, Sunday, or legal holiday.\n(a) The commissioner may issue a notice of violation to any person who the commissioner determines has committed a violation of the applicable law. The notice of violation must state a summary of the facts that constitute the violation and the applicable law violated. The notice of violation may require the person to correct the violation. If correction is required, the notice of violation must state the deadline by which the violation must be corrected.\n(b) In addition to any person, a notice of violation may be issued to any individual identified in section 181.723, subdivision 7, paragraph (d). A notice of violation is effective against any successor person as defined in section 181.723, subdivision 7, paragraph (e).\n(c) The commissioner shall issue the notice of violation by:\n(1) serving the notice of violation on the property owner or on the person who committed the violation; or\n(2) posting the notice of violation at the location where the violation occurred.\n(d) If the person to whom the commissioner has issued the notice of violation believes the notice was issued in error, then the person may request reconsideration of the parts of the notice that the person believes are in error. The request for reconsideration must be in writing and must be served on, faxed, or emailed to the commissioner at the address, fax number, or email address specified in the notice of violation by the tenth day after the commissioner issued the notice of violation. The date on which a request for reconsideration is served by mail shall be the postmark date on the envelope in which the request for reconsideration is mailed. If the person does not serve, fax, or email a written request for reconsideration or if the person's written request for reconsideration is not served on or faxed to the commissioner by the tenth day after the commissioner issued the notice of violation, the notice of violation shall become a final order of the commissioner and will not be subject to review by any court or agency. The request for reconsideration must:\n(1) specify which parts of the notice of violation the person believes are in error;\n(2) explain why the person believes the parts are in error; and\n(3) provide documentation to support the request for reconsideration.\nThe commissioner shall respond in writing to requests for reconsideration made under this paragraph within 15 days after receiving the request. A request for reconsideration does not stay a requirement to correct a violation as set forth in the notice of violation. After reviewing the request for reconsideration, the commissioner may affirm, modify, or rescind the notice of violation. The commissioner's response to a request for reconsideration is final and shall not be reviewed by any court or agency.\n(a) The commissioner may issue an administrative order to any person who the commissioner determines has committed a violation of the applicable law. The commissioner shall issue the administrative order by serving the administrative order on the person. The administrative order may require the person to correct the violation, may require the person to cease and desist from committing the violation, and may assess monetary damages and penalties. The commissioner shall follow the procedures in section 326B.083 when issuing administrative orders. Except as provided in paragraph (b), the commissioner may issue to each person a monetary penalty of up to $10,000 for each violation of applicable law committed by the person. The commissioner may order that part or all of the monetary penalty will be forgiven if the person to whom the order is issued demonstrates to the commissioner by the 31st day after the order is issued that the person has corrected the violation or has developed a correction plan acceptable to the commissioner.\n(b) The commissioner may issue an administrative order for failure to correct a violation by the deadline stated in a final notice of violation issued under subdivision 6 or a final administrative order issued under paragraph (a). Each day after the deadline during which the violation remains uncorrected is a separate violation for purposes of calculating the maximum monetary penalty amount.\n(c) Upon the application of the commissioner, a district court shall find the failure of any person to correct a violation as required by a final notice of violation issued under subdivision 6 or a final administrative order issued by the commissioner under this subdivision as a contempt of court.\n(d) In addition to any person, an administrative order may be issued to any individual identified in section 181.723, subdivision 7, paragraph (d). An administrative order shall be effective against any successor person as defined in section 181.723, subdivision 7, paragraph (e).\n(a) Within 30 days after the commissioner issues an administrative order or within 20 days after the commissioner issues the notice under section 326B.083, subdivision 3, paragraph (b), clause (3), the person to whom the administrative order or notice is issued may request an expedited hearing to review the commissioner's order or notice. The request for hearing must be in writing and must be served on, faxed, or emailed to the commissioner at the address, fax number, or email address specified in the order or notice. If the person does not request a hearing or if the person's written request for hearing is not served on, faxed, or emailed to the commissioner by the 30th day after the commissioner issues the administrative order or the 20th day after the commissioner issues the notice under section 326B.083, subdivision 3, paragraph (b), clause (3), the order will become a final order of the commissioner and will not be subject to review by any court or agency. The date on which a request for hearing is served by mail shall be the postmark date on the envelope in which the request for hearing is mailed. The hearing request must specifically state the reasons for seeking review of the order or notice. The person to whom the order or notice is issued and the commissioner are the parties to the expedited hearing. The commissioner must notify the person to whom the order or notice is issued of the time and place of the hearing at least 15 days before the hearing. The expedited hearing must be held within 45 days after a request for hearing has been received by the commissioner unless the parties agree to a later date.\n(b) Parties may submit written arguments if permitted by the administrative law judge. All written arguments must be submitted within ten days following the completion of the hearing or the receipt of any late-filed exhibits that the parties and the administrative law judge have agreed should be received into the record, whichever is later. The hearing shall be conducted under Minnesota Rules, parts 1400.8510 to 1400.8612, as modified by this subdivision. The Office of Administrative Hearings may, in consultation with the agency, adopt rules specifically applicable to cases under this section.\n(c) The administrative law judge shall issue a report making findings of fact, conclusions of law, and a recommended order to the commissioner within 30 days following the completion of the hearing, the receipt of late-filed exhibits, or the submission of written arguments, whichever is later.\n(d) If the administrative law judge makes a finding that the hearing was requested solely for purposes of delay or that the hearing request was frivolous, the commissioner may add to the amount of the penalty the costs charged to the department by the Office of Administrative Hearings for the hearing.\n(e) If a hearing has been held, the commissioner shall not issue a final order until at least five days after the date of the administrative law judge's report. Any person aggrieved by the administrative law judge's report may, within those five days, serve written comments to the commissioner on the report and the commissioner shall consider and enter the comments in the record. The commissioner's final order shall comply with sections 14.61, subdivision 2, and 14.62, subdivisions 1 and 2a, and may be appealed in the manner provided in sections 14.63 to 14.69.\nIn addition to any other remedy provided by law, the commissioner may bring an action for injunctive relief in the Ramsey County District Court or, at the commissioner's discretion, in the district court in the county in which the commissioner has determined a violation of the applicable law has occurred or is about to occur to enjoin the violation. A temporary restraining order and other injunctive relief shall be granted by the district court if the court determines that a person has engaged in or is about to engage in an act, conduct, or practice constituting a violation of the applicable law. The commissioner shall not be required to show irreparable harm.\n(a) The commissioner may issue a stop work order requiring cessation of all business operations of a person at one or more of the person's workplaces and places of business or across all of the person's workplaces and places of business. A stop work order may only be issued to any person who the commissioner has determined, based on an inspection or investigation, has violated the applicable law, has engaged in any of the activities under subdivision 11, paragraph (b), or section 326B.701, subdivision 5, or has failed to comply with a final notice, final administrative order, or final licensing order issued by the commissioner under this section or a final order to comply issued by the commissioner under section 177.27, or to any person identified in paragraph (c).\n(b) The stop work order is effective upon its issuance under paragraph (e). The order remains in effect until the commissioner issues an order lifting the stop work order. The commissioner shall issue an order lifting the stop work order upon finding that the person has come into compliance with the applicable law, has come into compliance with a final order or notice of violation issued by the commissioner, has ceased and desisted from engaging in any of the activities under subdivision 11, paragraph (b), or section 326B.701, subdivision 5, and has paid any remedies, damages, penalties, and other monetary sanctions, including wages owed to employees under paragraph (j), to the satisfaction of the commissioner, or if the commissioner or appellate court modifies or vacates the order.\n(c) In addition to any person, a stop work order may be issued to any individual identified in section 181.723, subdivision 7, paragraph (d). The stop work order is effective against any successor person as defined in section 181.723, subdivision 7, paragraph (e).\n(d) If the commissioner determines that a condition exists on real property that is the basis for issuing a stop work order, the commissioner may also issue a stop work order to the owner or lessee of the real property to cease and desist from committing the violation and to correct the condition that is in violation.\n(e) The commissioner shall issue the stop work order by:\n(1) serving the order on the person;\n(2) posting the order at the location where the violation was committed or at the location where the condition exists that is the basis for issuing the stop work order; or\n(3) serving the order on any owner or lessee of the real property where the violations or conditions exist.\n(f) A stop work order shall:\n(1) describe the act, conduct, or practice committed or the condition, and include a reference to the applicable law, the final order or final notice of violation, the provisions in subdivision 11, paragraph (b); the provisions in section 326B.701, subdivision 5; or liability under section 181.165, as applicable; and\n(2) provide notice that any person aggrieved by the stop work order may request a hearing as provided in paragraph (g).\n(g) Within 30 days after the commissioner issues a stop work order, any person aggrieved by the order may request an expedited hearing to review the commissioner's action. The request for hearing must be made in writing and must be served on, emailed, or faxed to the commissioner at the address, email address, or fax number specified in the order. If the person does not request a hearing or if the person's written request for hearing is not served on, emailed, or faxed to the commissioner on or before the 30th day after the commissioner issued the stop work order, the order will become a final order of the commissioner and will not be subject to review by any court or agency. The date on which a request for hearing is served by mail is the postmark date on the envelope in which the request for hearing is mailed. The hearing request must specifically state the reasons for seeking review of the order. The person who requested the hearing and the commissioner are the parties to the expedited hearing. The hearing shall be commenced within ten days after the commissioner receives the request for hearing. The hearing shall be conducted under Minnesota Rules, parts 1400.8510 to 1400.8612, as modified by this subdivision. The administrative law judge shall issue a report containing findings of fact, conclusions of law, and a recommended order within ten days after the completion of the hearing, the receipt of late-filed exhibits, or the submission of written arguments, whichever is later. Any party aggrieved by the administrative law judge's report shall have five days after the date of the administrative law judge's report to submit written exceptions and argument to the commissioner that the commissioner shall consider and enter in the record. Within 15 days after receiving the administrative law judge's report, the commissioner shall issue an order vacating, modifying, or making permanent the stop work order. The commissioner and the person requesting the hearing may by agreement lengthen any time periods described in this paragraph. The Office of Administrative Hearings may, in consultation with the agency, adopt rules specifically applicable to cases under this subdivision.\n(h) A stop work order issued under this subdivision is in effect until it is lifted by the commissioner under paragraph (b) or is modified or vacated by the commissioner or an appellate court under paragraph (b). The administrative hearing provided by this subdivision and any appellate judicial review as provided in chapter 14 shall constitute the exclusive remedy for any person aggrieved by a stop order.\n(i) The commissioner may assess a civil penalty of $5,000 per day against a person for each day the person conducts business operations that are in violation of a stop work order issued under this section.\n(j) Once a stop work order becomes final, any of the person's employees affected by a stop work order issued pursuant to this subdivision shall be entitled to average daily earnings from the person for up to the first ten days of work lost by the employee because of the issuance of a stop work order. Lifting of a stop work order may be conditioned on payment of wages to employees. The commissioner may issue an order to comply under section 177.27 to obtain payment from persons liable for the payment of wages owed to the employees under this section.\n(k) Upon the application of the commissioner, a district court shall find the failure of any person to comply with a final stop work order lawfully issued by the commissioner under this subdivision as a contempt of court.\n(l) Notwithstanding section 13.39, the data in a stop work order issued under this subdivision are classified as public data after the commissioner has issued the order.\n(m) When determining the appropriateness and extent of a stop work order the commissioner shall consider the factors set forth in section 14.045, subdivision 3.\n(a) The commissioner may deny an application for a permit, license, registration, or certificate if the applicant does not meet or fails to maintain the minimum qualifications for holding the permit, license, registration, or certificate, or has any unresolved violations, unpaid fees, or monetary damages or penalties related to the activity for which the permit, license, registration, or certificate has been applied for or was issued.\n(b) The commissioner may deny, suspend, limit, place conditions on, or revoke a person's permit, license, registration, or certificate, or censure the person holding or acting as qualifying person for the permit, license, registration, or certificate, if the commissioner finds that the person:\n(1) committed one or more violations of the applicable law;\n(2) committed one or more violations of chapter 176, 177, 181, 181A, 182, 268, 270C, or 363A;\n(3) submitted false or misleading information to any state agency in connection with activities for which the permit, license, registration, or certificate was issued, or in connection with the application for the permit, license, registration, or certificate;\n(4) allowed the alteration or use of the person's own permit, license, registration, or certificate by another person;\n(5) within the previous five years, was convicted of a crime in connection with activities for which the permit, license, registration, or certificate was issued;\n(6) violated: (i) a final administrative order issued under subdivision 7, (ii) a final stop work order issued under subdivision 10, (iii) injunctive relief issued under subdivision 9, or (iv) a consent order, order to comply, or other final order issued by the commissioner or the commissioner of human rights, employment and economic development, or revenue;\n(7) delayed, obstructed, or otherwise failed to cooperate with a commissioner's investigation, including a request to give testimony, to provide data and information, to produce documents, things, apparatus, devices, equipment, or materials, or to enter and access all areas of any property;\n(8) retaliated in any manner against any employee or person who makes a complaint, is questioned by, cooperates with, or provides information to the commissioner;\n(9) engaged in any fraudulent, deceptive, or dishonest act or practice; or\n(10) performed work in connection with the permit, license, registration, or certificate or conducted the person's affairs in a manner that demonstrates incompetence, untrustworthiness, or financial irresponsibility.\n(c) In addition to any person, a licensing order may be issued to any individual identified in section 181.723, subdivision 7, paragraph (d). A licensing order is effective against any successor person as defined in section 181.723, subdivision 7, paragraph (e).\n(d) If the commissioner revokes or denies a person's permit, license, registration, or certificate under paragraph (b), the person is prohibited from reapplying for the same type of permit, license, registration, or certificate for at least two years after the effective date of the revocation or denial. The commissioner may, as a condition of reapplication, require the person to obtain a bond or comply with additional reasonable conditions the commissioner considers necessary to protect the public, including but not limited to demonstration of current and ongoing compliance with the laws the violation of which were the basis for revoking or denying the person's permit, license, registration, or certificate under paragraph (b) or that the person has ceased and desisted in engaging in activities under paragraph (b) that were the basis for revoking or denying the person's permit, license, registration, or certificate under paragraph (b).\n(e) If a permit, license, registration, or certificate expires, or is surrendered, withdrawn, or terminated, or otherwise becomes ineffective, the commissioner may institute a proceeding under this subdivision within two years after the permit, license, registration, or certificate was last effective and enter a revocation or suspension order as of the last date on which the permit, license, registration, or certificate was in effect.\n(a) If the commissioner determines that a permit, license, registration, or certificate should be conditioned, limited, suspended, revoked, or denied under subdivision 11, or that the permit holder, licensee, registrant, or certificate holder should be censured under subdivision 11, then the commissioner shall issue to the person an order denying, conditioning, limiting, suspending, or revoking the person's permit, license, registration, or certificate, or censuring the permit holder, licensee, registrant, or certificate holder.\n(b) Any order issued under paragraph (a) may include an assessment of monetary penalties and may require the person to cease and desist from committing the violation or committing the act, conduct, or practice set out in subdivision 11, paragraph (b). The monetary penalty may be up to $10,000 for each violation or act, conduct, or practice committed by the person. The procedures in section 326B.083 must be followed when issuing orders under paragraph (a).\n(c) The permit holder, licensee, registrant, certificate holder, or applicant to whom the commissioner issues an order under paragraph (a) shall have 30 days after issuance of the order to request a hearing. The request for hearing must be in writing and must be served on, faxed, or emailed to the commissioner at the address, fax number, or email address specified in the order by the 30th day after issuance of the order. If the person does not request a hearing or if the person's written request for hearing is not served on, faxed, or emailed to the commissioner by the 30th day after issuance of the order, the order shall become a final order of the commissioner and will not be subject to review by any court or agency. The date on which a request for hearing is served by mail shall be the postmark date on the envelope in which the request for hearing is mailed. If the person submits to the commissioner a timely request for hearing, the order is stayed unless the commissioner summarily suspends the license, registration, certificate, or permit under subdivision 13, and a contested case hearing shall be held in accordance with chapter 14.\nIn any case where the commissioner has issued an order to revoke, suspend, or deny a license, registration, certificate, or permit under subdivisions 11, paragraph (b), and 12, the commissioner may summarily suspend the person's permit, license, registration, or certificate before the order becomes final. The commissioner shall issue a summary suspension order when the safety of life or property is threatened or to prevent the commission of fraudulent, deceptive, untrustworthy, or dishonest acts against the public, including but not limited to violations of section 181.723, subdivision 7. The summary suspension shall not affect the deadline for submitting a request for hearing under subdivision 12. If the commissioner summarily suspends a person's permit, license, registration, or certificate, a timely request for hearing submitted under subdivision 12 shall also be considered a timely request for hearing on continuation of the summary suspension. If the commissioner summarily suspends a person's permit, license, registration, or certificate under this subdivision and the person submits a timely request for a hearing, then a hearing on continuation of the summary suspension must be held within ten days after the commissioner receives the request for hearing unless the parties agree to a later date.\nThe commissioner may prepare a plan for assessing penalties in orders issued under subdivision 7 or 12. The commissioner shall provide a 30-day period for public comment on any such plan. Penalties assessed by the commissioner in accordance with the plan shall be presumed reasonable.\nNothing in this section shall be construed to limit the application of other state or federal laws, including specifically but not exclusively section 270C.72, that require suspension of, revocation of, denial of, or refusal to renew a permit, license, registration, or certificate issued by the commissioner.\nExcept as otherwise provided by law, a person who violates an applicable law is guilty of a misdemeanor.\nAny person who delays, obstructs, or otherwise fails to cooperate with the commissioner's investigation may be issued a penalty of $1,000. Each day of delay, obstruction, or failure to cooperate shall constitute a separate violation.\nIf a person fails to pay a penalty owed under this section or section 326B.083, the commissioner may revoke, suspend, or deny any or all licenses, permits, certificates, and registrations issued by the department.",
	"repealed": false
}