{
	"id": "115.1705",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.1705",
	"title": "115.1705 BALLAST WATER RECORD BOOK.",
	"text": "The owner or operator of a vessel required to have a ballast water management plan under section 115.1703 shall maintain, in English, on board the vessel, a ballast water record book in which each operation of the vessel involving ballast water or sediment discharge is recorded as required by the commissioner. The ballast water record book shall be kept readily available for examination by the commissioner. In cases where a vessel is without a crew and being towed, the ballast water record book may be kept on the towing vessel.\n(a) Except as provided in paragraph (b), a ballast water record book required in subdivision 1 shall be retained on board the vessel for three years after the date on which the last entry in the book is made and shall be retained under the control of the vessel's owner for an additional three years.\n(b) The commissioner may prescribe alternative time periods for record retention by foreign vessels that are consistent with international practices.\n(a) The commissioner shall require, at a minimum, that:\n(1) each entry in the ballast water record book be signed and dated by the officer in charge of the ballast water operation recorded;\n(2) each completed page in the ballast water record book be signed and dated by the owner or operator of the vessel; and\n(3) the owner or operator of the vessel transmit any information to the commissioner regarding the ballast operations of the vessel as the commissioner may require.\n(b) The commissioner may provide for alternative methods of record keeping, including electronic record keeping, to comply with the requirements of this section. Any electronic record keeping method authorized by the commissioner shall comply with applicable standards of the state and the National Institute of Standards and Technology governing reliability, integrity, identity authentication, and nonrepudiation of stored electronic data.",
	"repealed": false
}