{
	"id": "16A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.53",
	"title": "16A.53 BOOKKEEPING ACCOUNTS.",
	"text": "When a law creates a fund or account in the treasury into which are deposited certain revenues and out of which certain expenditures are appropriated, the commissioner may consider the creation of the fund or account as the creation of a bookkeeping account in the state's accounting system so as to reflect the revenues deposited in the treasury and credited to the bookkeeping account and the expenditures appropriated from the treasury and charged to the bookkeeping account. The commissioner must organize these bookkeeping accounts into funds in accordance with generally accepted accounting principles.\nSubdivision 1 does not apply to a fund created by the constitution or to a fund required to be created in the treasury by federal law.\n(a) As necessary, the commissioner may eliminate an account that is no longer needed for the purposes specified for it in law.\n(b) The commissioner must eliminate an account that meets the criteria in paragraph (c) unless the commissioner determines that the account is necessary for efficient fiscal operation.\n(c) Criteria for account elimination are:\n(1) receipts to the account and transfers into the account average less than $1,000 per year in the past four years;\n(2) year-end balances in the past four years average less than $1,000 per year; and\n(3) the account has been in existence for at least four years.\n(d) Any balances in an eliminated account must be transferred to the general fund unless some other disposition is specified in law. If the commissioner eliminates an account established in law, the commissioner must notify the legislature, in a report to the appropriate finance committees, of the elimination.\nEach agency that manages accounts within a fund must report at least annually to the appropriate finance committees of the legislature on the number, purpose, and recent financial activity in those accounts. The commissioner must establish uniform criteria and timing for the reports.",
	"repealed": false
}