{
	"id": "86B.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.415",
	"title": "86B.415 LICENSE FEES.",
	"text": "(a) Except as provided in paragraph (b) and subdivision 1a, the fee for a watercraft license for watercraft 19 feet or less in length is $59.\n(b) The watercraft license fee is:\n(1) for watercraft, other than personal watercraft, 19 feet in length or less that is offered for rent or lease, $14;\n(2) for a sailboat, 19 feet in length or less, $23;\n(3) for a watercraft 19 feet in length or less used by a nonprofit corporation for teaching boat and water safety, as provided in subdivision 4;\n(4) for a watercraft owned by a dealer under a dealer's license, as provided in subdivision 5;\n(5) for a personal watercraft, including one offered for rent or lease, $85; and\n(6) for a watercraft less than 17 feet in length, other than a watercraft listed in clauses (1) to (5), $36.\nThe fee for a watercraft license for a canoe, kayak, sailboard, paddleboard, paddleboat, or rowing shell over ten feet in length is $23.\nExcept as provided in subdivisions 1a, 3, 4, and 5, the watercraft license fee:\n(1) for a watercraft more than 19 feet but less than 26 feet in length is $113;\n(2) for a watercraft 26 feet but less than 40 feet in length is $164; and\n(3) for a watercraft 40 feet in length or longer is $209.\nThe license fee for watercraft used primarily for charter fishing, commercial fishing, commercial passenger carrying, or other commercial operation is $164 each.\nThe watercraft license fee for a watercraft used by a nonprofit organization for teaching boat and water safety is $8 each.\nThere is no separate fee for watercraft owned by a dealer under a dealer's license. The fee for a dealer's license is $142.\nThe fee to transfer a watercraft license or be issued a duplicate license is $4.50.\nA $10.60 surcharge is placed on each watercraft licensed under subdivisions 1 to 5 for control, public awareness, law enforcement, monitoring, and research of aquatic invasive species such as zebra mussel, purple loosestrife, and Eurasian watermilfoil in public waters and public wetlands.\n[Repealed, 1999 c 231 s 207]\nIn addition to other fees prescribed by law, a filing fee of $4.50 shall be charged for each watercraft license renewal, duplicate or replacement license, and replacement decal and a filing fee of $7 shall be charged for each watercraft license and license transfer issued by:\n(1) the registrar or a deputy registrar of motor vehicles and the additional fee shall be disposed of in the manner provided in section 168.33, subdivision 2; or\n(2) the commissioner and the additional fee shall be deposited in the state treasury and credited to the water recreation account.\nMoney received for watercraft licenses shall be deposited in the state treasury and credited to the water recreation account.\nThe commissioner of natural resources, in agreement with the commissioner of public safety, may prescribe the accounting and procedural requirements necessary to assure efficient handling of watercraft registrations and license fees by deputy registrars. Deputy registrars shall strictly comply with these accounting and procedural requirements.\nThe commissioner may issue a refund on a license or title, not including any issuing fees paid under subdivision 8 or section 84.027, subdivision 15, paragraph (a), clause (2), or 86B.870, subdivision 1, paragraph (b), if the refund request is received within 60 days of the original license or title, the license or title is not used or transferred, and:\n(1) the watercraft was licensed or titled incorrectly;\n(2) the customer was incorrectly charged a title fee; or\n(3) the watercraft was licensed or titled twice, once by the dealer and once by the customer.\n[See Note.]",
	"repealed": false
}