{
	"id": "121A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.11",
	"title": "121A.11 UNITED STATES FLAG.",
	"text": "Every public school in Minnesota must display an appropriate United States flag when in session. The flag shall be displayed upon the school grounds or outside the school building, on a proper staff, on every legal holiday occurring during the school term and at such other times as the board of the district may direct. The flag must be displayed within the principal rooms of the school building at all other times while school is in session.\nThe board must provide the flag for each of the school buildings in their districts, together with a suitable staff to display the flag outside of the school building and proper arrangement to display the flag in the building, and a suitable receptacle for the safekeeping of the flag when not in use.\n(a) All public and charter school students shall recite the Pledge of Allegiance to the flag of the United States of America one or more times each week. The recitation shall be conducted:\n(1) by each individual classroom teacher or the teacher's surrogate; or\n(2) over a school intercom system by a person designated by the school principal or other person having administrative control over the school.\nA local school board or a charter school board of directors may annually, by majority vote, waive this requirement.\n(b) Any student or teacher may decline to participate in recitation of the pledge.\n(c) A school district or charter school that has a student handbook or school policy guide must include a statement that anyone who does not wish to participate in reciting the Pledge of Allegiance for any personal reasons may elect not to do so and that students must respect another person's right to make that choice.\n(d) A local school board or a charter school board of directors that waives the requirement to recite the Pledge of Allegiance under paragraph (a) may adopt a district or school policy regarding the reciting of the Pledge of Allegiance.\nUnless the requirement in subdivision 3 is waived by a majority vote of the school board, a school district must instruct students in the proper etiquette toward, correct display of, and respect for the flag, and in patriotic exercises.",
	"repealed": false
}