{
	"id": "62M.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.07",
	"title": "62M.07 PRIOR AUTHORIZATION OF SERVICES.",
	"text": "Utilization review organizations conducting prior authorization of services must have written standards that meet at a minimum the following requirements:\n(1) written procedures and criteria used to determine whether care is appropriate, reasonable, or medically necessary;\n(2) a system for providing prompt notification of its determinations to enrollees and providers and for notifying the provider, enrollee, or enrollee's designee of appeal procedures under clause (4);\n(3) compliance with section 62M.05, subdivisions 3a and 3b, regarding time frames for authorizing and making adverse determinations regarding prior authorization requests;\n(4) written procedures to appeal adverse determinations of prior authorization requests which specify the responsibilities of the enrollee and provider, and which meet the requirements of sections 62M.06 and 72A.285, regarding release of summary review findings; and\n(5) procedures to ensure confidentiality of patient-specific information, consistent with applicable law.\nNo utilization review organization, health plan company, or claims administrator may conduct or require prior authorization of:\n(1) emergency confinement or an emergency service. The enrollee or the enrollee's authorized representative may be required to notify the health plan company, claims administrator, or utilization review organization as soon as reasonably possible after the beginning of the emergency confinement or emergency service;\n(2) outpatient mental health treatment or outpatient substance use disorder treatment, except for treatment which is a medication. Prior authorizations required for medications used for outpatient mental health treatment or outpatient substance use disorder treatment must be processed according to section 62M.05, subdivision 3b, for initial determinations, and according to section 62M.06, subdivision 2, for appeals;\n(3) antineoplastic cancer treatment that is consistent with guidelines of the National Comprehensive Cancer Network, except for treatment which is a medication. Prior authorizations required for medications used for antineoplastic cancer treatment must be processed according to section 62M.05, subdivision 3b, for initial determinations, and according to section 62M.06, subdivision 2, for appeals;\n(4) services that currently have a rating of A or B from the United States Preventive Services Task Force, immunizations recommended by the Advisory Committee on Immunization Practices of the Centers for Disease Control and Prevention, or preventive services and screenings provided to women as described in Code of Federal Regulations, title 45, section 147.130;\n(5) pediatric hospice services provided by a hospice provider licensed under sections 144A.75 to 144A.755; and\n(6) treatment delivered through a neonatal abstinence program operated by pediatric pain or palliative care subspecialists.\nClauses (2) to (6) are effective January 1, 2026, and apply to health benefit plans offered, sold, issued, or renewed on or after that date.\nNo utilization review organization, health plan company, or claims administrator may revoke, limit, condition, or restrict a prior authorization that has been authorized unless there is evidence that the prior authorization was authorized based on fraud or misinformation or a previously approved prior authorization conflicts with state or federal law. Application of a deductible, coinsurance, or other cost-sharing requirement does not constitute a limit, condition, or restriction under this subdivision.\n(a) If prior authorization for a health care service is required, the utilization review organization, health plan company, or claim administrator must allow providers to submit requests for prior authorization of the health care services without unreasonable delay by telephone, facsimile, or voice mail or through an electronic mechanism 24 hours a day, seven days a week. This subdivision does not apply to dental service covered under MinnesotaCare or medical assistance.\n(b) Effective January 1, 2027, for health benefit plans offered, sold, issued, or renewed on or after that date, utilization review organizations, health plan companies, and claims administrators must have and maintain a prior authorization application programming interface (API) that automates the prior authorization process for health care services, excluding prescription drugs and medications. The API must allow providers to determine whether a prior authorization is required for health care services, identify prior authorization information and documentation requirements, and facilitate the exchange of prior authorization requests and determinations from provider electronic health records or practice management systems. The API must use the Health Level Seven (HL7) Fast Healthcare Interoperability Resources (FHIR) standard in accordance with Code of Federal Regulations, title 45, section 170.215 (a)(1), and the most recent standards and guidance adopted by the United States Department of Health and Human Services to implement that section. Prior authorization submission requests for prescription drugs and medications must comply with the requirements of section 62J.497.\nThis subdivision is effective January 1, 2026, and applies to health benefit plans offered, sold, issued, or renewed on or after that date. An authorization for treatment of a chronic health condition does not expire unless the standard of treatment for that health condition changes. A chronic health condition is a condition that is expected to last one year or more and:\n(1) requires ongoing medical attention to effectively manage the condition or prevent an adverse health event; or\n(2) limits one or more activities of daily living.",
	"repealed": false
}