{
	"id": "216I.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.02",
	"title": "216I.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given, unless context clearly indicates or provides otherwise.\n\"Associated facility\" means a building, equipment, communication instrumentation, or other physical structure that is necessary to operate a large energy infrastructure facility. Associated facility includes transmission lines designed for and capable of operating at 100 kilovolts or less that interconnect the large energy infrastructure facility with the existing high-voltage transmission system.\n\"Commission\" means the Public Utilities Commission. Commission also means the executive secretary of the Public Utilities Commission for purposes of the following:\n(1) applicability determinations under section 216I.04;\n(2) completeness determinations under section 216I.05;\n(3) public meetings under section 216I.05, subdivision 9;\n(4) draft environmental impact statements under section 216I.06, subdivision 1, paragraph (c); and\n(5) public hearings under section 216I.06, subdivision 2, or 216I.07, subdivision 4.\n\"Construction\" means any clearing of land, excavation, or other action that adversely affects the site's or route's natural environment. Construction does not include changes needed to temporarily use sites or routes for nonutility purposes, or uses in securing survey or geological data, including necessary borings to ascertain foundation conditions.\n\"Cultivated agricultural land\" has the meaning given in section 216G.01, subdivision 4.\n\"Energy storage system\" means equipment and associated facilities designed with a nameplate capacity of 10,000 kilowatts or more that is capable of storing generated electricity for a period of time and delivering the electricity for use after storage.\n\"Executive secretary\" means the executive secretary of the Public Utilities Commission under section 216A.04 or Public Utilities Commission staff designated by the executive secretary.\n\"High-voltage transmission line\" means a conductor of electric energy and associated facilities that is (1) designed for and capable of operation at a nominal voltage of 100 kilovolts or more, and (2) is greater than 1,500 feet in length.\n\"Large electric power generating plant\" means electric power generating equipment and associated facilities designed for or capable of operation at a capacity of 50,000 kilowatts or more.\n\"Large energy infrastructure facility\" means a high-voltage transmission line, a large electric power generating plant, an energy storage system, a large wind energy conversion system, and any associated facility.\n\"Large wind energy conversion system\" means any combination of wind energy conversion systems with a combined nameplate capacity of 5,000 kilowatts or more, and may include transmission lines designed for and capable of operating at 100 kilovolts or less that interconnect a large wind energy conversion system with a high-voltage transmission line.\n\"Permittee\" means a person to whom a site or route permit is issued.\n\"Person\" means an individual, partnership, joint venture, private or public corporation, association, firm, public service company, cooperative, political subdivision, municipal corporation, government agency, public utility district, or any other entity, public or private, however organized.\n\"Power purchase agreement\" means a legally enforceable agreement between two or more persons where one or more of the signatories agrees to provide electrical power and one or more of the signatories agrees to purchase the power.\n\"Route\" means the location of a high-voltage transmission line between two end points. The route may have a variable width of up to 1.25 miles.\n\"Site\" means the location of a large electric power generating plant, solar energy generating system, energy storage system, or large wind energy conversion system.\n\"Small wind energy conversion system\" means any combination of wind energy conversion systems with a combined nameplate capacity of less than 5,000 kilowatts.\n\"Solar energy generating system\" means a set of devices whose primary purpose is to produce electricity by means of any combination of collecting, transferring, or converting solar-generated energy with a combined nameplate capacity of 50,000 kilowatts alternating current or more.\n\"Utility\" means any entity engaged or intending to engage in generating, transmitting, or distributing electric energy in Minnesota. Utility includes but is not limited to a private investor-owned utility, cooperatively owned utility, and public or municipally owned utility.\n\"Wind energy conversion system\" means a device, including but not limited to a wind charger, windmill, or wind turbine and associated facilities, that converts wind energy to electrical energy.",
	"repealed": false
}