{
	"id": "60A.1291",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.1291",
	"title": "60A.1291 ANNUAL AUDIT.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Accountant\" and \"independent public accountant\" mean an independent certified public accountant or accounting firm in good standing with the American Institute of Certified Public Accountants and in all states in which the accountant or firm is licensed or is required to be licensed to practice. For Canadian and British companies, the term means a Canadian-chartered or British-chartered accountant.\n(b) \"Affiliate\" or \"affiliated\" means a person that directly or indirectly through one or more intermediaries controls, is controlled by, or is under common control with a person.\n(c) \"Audit committee\" means a committee or equivalent body established by the board of directors of an entity for the purpose of overseeing the accounting and financial reporting processes of an insurer or group of insurers, the internal audit function of an insurer or group of insurers, if applicable, and external audits of financial statements of the insurer or group of insurers. The audit committee of any entity that controls a group of insurers may be deemed to be the audit committee for one or more of these controlled insurers solely for the purposes of this section at the election of the controlling person under subdivision 15, paragraph (e). If an audit committee is not designated by the insurer, the insurer's entire board of directors constitutes the audit committee.\n(d) \"Audited financial report\" means the report described in subdivision 4.\n(e) \"Indemnification\" means an agreement of indemnity or a release from liability where the intent or effect is to shift or limit in any manner the potential liability of the person or firm for failure to adhere to applicable auditing or professional standards, whether or not resulting in part from knowing of other misrepresentations made by the insurer or its representatives.\n(f) \"Independent board member\" has the same meaning as described in subdivision 15, paragraph (c).\n(g) \"Internal audit function\" means a person or persons that provide independent, objective and reasonable assurance designed to add value and improve an organization's operations and accomplish its objectives by bringing a systematic, disciplined approach to evaluate and improve the effectiveness of risk management, control, and governance processes.\n(h) \"Internal control over financial reporting\" means a process effected by an entity's board of directors, management, and other personnel designed to provide reasonable assurance regarding the reliability of the financial statements, for example, those items specified in subdivision 4, paragraphs (a), clauses (2) to (6), (b), and (c), and includes those policies and procedures that:\n(1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of assets;\n(2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of the financial statements, for example, those items specified in subdivision 4, paragraphs (a), clauses (2) to (6), (b), and (c), and that receipts and expenditures are being made only in accordance with authorizations of management and directors; and\n(3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on the financial statements, for example, those items specified in subdivision 4, paragraphs (a), clauses (2) to (6), (b), and (c).\n(i) \"SEC\" means the United States Securities and Exchange Commission.\n(j) \"Section 404\" means Section 404 of the Sarbanes-Oxley Act of 2002 and the SEC's rules and regulations promulgated under it.\n(k) \"Section 404 report\" means management's report on \"internal control over financial reporting\" as defined by the SEC and the related attestation report of the independent certified public accountant as described in paragraph (a).\n(l) \"SOX compliant entity\" means an entity that either is required to be compliant with, or voluntarily is compliant with, all of the following provisions of the Sarbanes-Oxley Act of 2002: (i) the preapproval requirements of Section 201 (section 10A(i) of the Securities Exchange Act of 1934); (ii) the audit committee independence requirements of Section 301 (section 10A(m)(3) of the Securities Exchange Act of 1934); and (iii) the internal control over financial reporting requirements of Section 404 (Item 308 of SEC Regulation S-K).\nEvery insurance company doing business in this state, including fraternal benefit societies, reciprocal exchanges, service plan corporations licensed pursuant to chapter 62C, and legal service plans licensed pursuant to chapter 62G, unless exempted by the commissioner pursuant to subdivision 9, paragraph (a), or by subdivision 18, shall have an annual audit of the financial activities of the most recently completed calendar year performed by an independent certified public accountant, and shall file the report of this audit with the commissioner on or before June 1 for the immediately preceding year ending December 31. The commissioner may require an insurer to file an audited financial report earlier than June 1 with 90 days' advance notice to the insurer.\nExtensions of the June 1 filing date may be granted by the commissioner for 30-day periods upon a showing by the insurer and its independent certified public accountant of the reasons for requesting the extension and a determination by the commissioner of good cause for the extension.\nThe request for extension must be submitted in writing not less than ten days before the due date in sufficient detail to permit the commissioner to make an informed decision with respect to the requested extension.\nIf an extension is granted in accordance with this subdivision, a similar extension of 30 days is granted to the filing of management's report of internal control over financial reporting.\nEvery insurer required to file an annual audited financial report pursuant to this subdivision shall designate a group of individuals as constituting its audit committee. The audit committee of an entity that controls an insurer may be deemed to be the insurer's audit committee for purposes of this subdivision at the election of the controlling person.\nForeign and alien insurers filing audited financial reports in another state under the other state's requirements of audited financial reports which have been found by the commissioner to be substantially similar to these requirements are exempt from this section if a copy of the audited financial report, communication of internal control related matters noted in an audit, accountant's letter of qualifications, and report on significant deficiencies in internal controls, which are filed with the other state, are filed with the commissioner in accordance with the filing dates specified in subdivision 2 (Canadian insurers may submit accountants' reports as filed with the Canadian Dominion Department of Insurance); and a copy of any notification of adverse financial condition report filed with the other state is filed with the commissioner within the time specified in subdivision 11. Foreign or alien insurers required to file management's report of internal control over financial reporting in another state are exempt from filing the report in this state provided the other state has substantially similar reporting requirements and the report is filed with the commissioner of the other state within the time specified. This subdivision does not prohibit or in any way limit the commissioner from ordering, conducting, and performing examinations of insurers under the authority of this chapter.\n(a) The annual audited financial report must report, in conformity with statutory accounting practices required or permitted by the commissioner of insurance of the state of domicile, the financial position of the insurer as of the end of the most recent calendar year and the results of its operations, cash flows, and changes in capital and surplus for the year ended. The annual audited financial report must include:\n(1) a report of an independent certified public accountant;\n(2) a balance sheet reporting admitted assets, liabilities, capital, and surplus;\n(3) a statement of operations;\n(4) a statement of cash flows;\n(5) a statement of changes in capital and surplus; and\n(6) notes to the financial statements.\n(b) The notes required under paragraph (a) are those required by the appropriate National Association of Insurance Commissioners (NAIC) annual statement instructions and National Association of Insurance Commissioners Accounting Practices and Procedures Manual and include reconciliation of differences, if any, between the audited statutory financial statements and the annual statement filed under section 60A.13, subdivision 1, with a written description of the nature of these differences.\n(c) The financial statements included in the audited financial report must be prepared in a form and using language and groupings substantially the same as the relevant sections of the annual statement of the insurer filed with the commissioner. The financial statement must be comparative, presenting the amounts as of December 31 of the current year and the amounts as of the immediately preceding December 31. In the first year in which an insurer is required to file an audited financial report, the comparative data may be omitted. The amounts may be rounded to the nearest $1,000, and all immaterial amounts may be combined.\nEach insurer required by this section to file an annual audited financial report must notify the commissioner in writing of the name and address of the independent certified public accountant or accounting firm retained to conduct the annual audit within 60 days after becoming subject to the annual audit requirement. The insurer shall obtain from the accountant a letter which states that the accountant is aware of the provisions that relate to accounting and financial matters in the insurance laws and the rules of the insurance regulatory authority of the state of domicile. The letter shall affirm that the accountant will express an opinion on the financial statements in terms of their conformity to the statutory accounting practices prescribed or otherwise permitted by that insurance regulatory authority, specifying the exceptions believed to be appropriate. A copy of the accountant's letter shall be filed with the commissioner.\nIf an accountant who was the accountant for the immediately preceding filed audited financial report is dismissed or resigns, the insurer shall notify the commissioner of this event within five business days. Within ten business days of this notification, the insurer shall also furnish the commissioner with a separate letter stating whether in the 24 months preceding this event there were any disagreements with the former accountant on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedure, which, if not resolved to the satisfaction of the former accountant, would have caused that person to make reference to the subject matter of the disagreement in connection with the opinion on the financial statements. The disagreements required to be reported in response to this subdivision include both those resolved to the former accountant's satisfaction and those not resolved to the former accountant's satisfaction. Disagreements contemplated by this subdivision are those disagreements between personnel of the insurer responsible for presentation of its financial statements and personnel of the accounting firm responsible for rendering its report. The insurer shall also in writing request the former accountant to furnish a letter addressed to the insurer stating whether the accountant agrees with the statements contained in the insurer's letter and, if not, stating the reasons for any disagreement. The insurer shall furnish this responsive letter from the former accountant to the commissioner together with its own.\n(a) The commissioner shall not recognize any person or firm as a qualified independent certified public accountant that is not in good standing with the American Institute of Certified Public Accountants and in all states in which the accountant is licensed or is required to be licensed to practice, or for a Canadian or British company, that is not a chartered accountant, or that has either directly or indirectly entered into an agreement of indemnity or release from liability (collectively referred to as an indemnification agreement) with respect to the audit of the insurer. Except as otherwise provided, an independent certified public accountant must be recognized as qualified as long as the person conforms to the standards of the person's profession, as contained in the Code of Professional Conduct of the American Institute of Certified Public Accountants and the Code of Professional Conduct of the Minnesota Board of Public Accountancy or similar code and the person is properly licensed in good standing with all required state boards of accountancy.\n(b) The lead or coordinating audit partner, having primary responsibility for the audit, may not act in that capacity for more than five consecutive years. The person shall be disqualified from acting in that or a similar capacity for the same company or its insurance subsidiaries or affiliates for a period of five consecutive years. An insurer may make application to the commissioner for relief from this rotation requirement on the basis of unusual circumstances. This application must be made at least 30 days before the end of the calendar year. The commissioner may consider the following factors in determining if the relief should be granted:\n(1) number of partners, expertise of the partners, or number of insurance clients in the currently registered firm;\n(2) premium volume of the insurer; or\n(3) number of jurisdictions in which the insurer transacts business.\nThe insurer shall file, with its annual statement filing, the approval for relief from this paragraph with the states that it is licensed in or doing business in and with the NAIC. If the nondomestic state accepts electronic filing with the NAIC, the insurer shall file the approval in an electronic format acceptable to the NAIC.\n(c) The commissioner shall not recognize as a qualified independent certified public accountant, nor accept an annual audited financial report, prepared in whole or in part by an accountant who provides to an insurer, contemporaneously with the audit, the following nonaudit services:\n(1) bookkeeping or other services related to the accounting records or financial statements of the insurer;\n(2) financial information systems design and implementation;\n(3) appraisal or valuation services, fairness opinions, or contribution in-kind reports;\n(4) actuarially oriented advisory services involving the determination of amounts recorded in the financial statements. The accountant may assist an insurer in understanding the methods, assumptions, and inputs used in the determination of amounts recorded in the financial statement only if it is reasonable to conclude that the services provided will not be subject to audit procedures during an audit of the insurer's financial statements. An accountant's actuary may also issue an actuarial opinion or certification on an insurer's reserves if the following conditions have been met:\n(i) neither the accountant nor the accountant's actuary has performed any management functions or made any management decisions;\n(ii) the insurer has competent personnel, or engages a third-party actuary, to estimate the loss reserves for which management takes responsibility; and\n(iii) the accountant's actuary tests the reasonableness of the reserves after the insurer's management has determined the amount of the loss reserves;\n(5) internal audit outsourcing services;\n(6) management functions or human resources;\n(7) broker or dealer, investment adviser, or investment banking services;\n(8) legal services or expert services unrelated to the audit; and\n(9) any other services that the commissioner determines, by rule, are impermissible.\n(d) The commissioner shall not recognize as a qualified independent certified public accountant, nor accept any audited financial report, prepared in whole or in part by any natural person who has been convicted of fraud, bribery, a violation of the Racketeer Influenced and Corrupt Organizations Act, United States Code, title 18, sections 1961 to 1968, or any dishonest conduct or practices under federal or state law, has been found to have violated the insurance laws of this state with respect to any previous reports submitted under this section, or has demonstrated a pattern or practice of failing to detect or disclose material information in previous reports filed under the provisions of this section.\n(e) The commissioner, after notice and hearing under chapter 14, may find that the accountant is not qualified for purposes of expressing an opinion on the financial statements in the annual audited financial report. The commissioner may require the insurer to replace the accountant with another whose relationship with the insurer is qualified within the meaning of this section.\n(a) Insurers having direct written and assumed premiums of less than $100,000,000 in any calendar year may request an exemption from subdivision 7, paragraph (c). The insurer shall file with the commissioner a written statement discussing the reasons why the insurer should be exempt from these provisions. If the commissioner finds, upon review of this statement, that compliance with this section would constitute a financial or organizational hardship upon the insurer, an exemption may be granted.\n(b) A qualified independent certified public accountant who performs the audit may engage in other nonaudit services, including tax services, that are not described in subdivision 7, paragraph (c), only if the activity is approved in advance by the audit committee, in accordance with paragraph (c).\n(c) All auditing services and nonaudit services provided to an insurer by the qualified independent certified public accountant of the insurer must be preapproved by the audit committee. The preapproval requirement is waived with respect to nonaudit services if the insurer is a SOX compliant entity or a direct or indirect wholly owned subsidiary of a SOX compliant entity or:\n(1) the aggregate amount of all such nonaudit services provided to the insurer constitutes not more than five percent of the total amount of fees paid by the insurer to its qualified independent certified public accountant during the fiscal year in which the nonaudit services are provided;\n(2) the services were not recognized by the insurer at the time of the engagement to be nonaudit services; and\n(3) the services are promptly brought to the attention of the audit committee and approved before the completion of the audit by the audit committee or by one or more members of the audit committee who are the members of the board of directors to whom authority to grant such approvals has been delegated by the audit committee.\n(d) The audit committee may delegate to one or more designated members of the audit committee the authority to grant the preapprovals required by paragraph (c). The decisions of any member to whom this authority is delegated must be presented to the full audit committee at each of its scheduled meetings.\n(e) The commissioner shall not recognize an independent certified public accountant as qualified for a particular insurer if a member of the board, president, chief executive officer, controller, chief financial officer, chief accounting officer, or any person serving in an equivalent position for that insurer was employed by the independent certified public accountant and participated in the audit of that insurer during the one-year period preceding the date that the most current statutory opinion is due. This paragraph applies only to partners and senior managers involved in the audit. An insurer may make application to the commissioner for relief from this paragraph on the basis of unusual circumstances.\n(f) The insurer shall file, with its annual statement filing, the approval for relief with the states that it is licensed in or doing business in and the NAIC. If the nondomestic state accepts electronic filing with the NAIC, the insurer shall file the approval in an electronic format acceptable to the NAIC.\n(a) The commissioner may allow an insurer to file consolidated or combined audited financial statements required by subdivision 2, in lieu of separate annual audited financial statements, where it can be demonstrated that an insurer is part of a group of insurance companies that has a pooling or 100 percent reinsurance agreement which substantially affects the solvency and integrity of the reserves of the insurer and the insurer cedes all of its direct and assumed business to the pool. An affiliated insurance company not meeting these requirements may be included in the consolidated or combined audited financial statements, if the company's total admitted assets are less than five percent of the consolidated group's total admitted assets. If these circumstances exist, then the company may file a written application to file consolidated or combined audited financial statements. This application must be for a specified period.\n(b) Upon written application by a domestic insurer, the commissioner may authorize the domestic insurer to include additional affiliated insurance companies in the consolidated or combined audited financial statements. A foreign insurer must obtain the prior written authorization of the commissioner of its state of domicile in order to submit an application for authority to file consolidated or combined audited financial statements. This application must be for a specified period.\n(c) A consolidated annual audit filing must include a columnar consolidated or combining worksheet. Amounts shown on the audited consolidated or combined financial statement must be shown on the worksheet. Amounts for each insurer must be stated separately. Noninsurance operations may be shown on the worksheet on a combined or individual basis. Explanations of consolidating or eliminating entries must be shown on the worksheet. A reconciliation of any differences between the amounts shown in the individual insurer columns of the worksheet and comparable amounts shown on the annual statement of the insurers must be included on the worksheet.\nFinancial statements furnished pursuant to subdivision 4 must be examined by an independent certified public accountant. The audit of the insurer's financial statements must be conducted in accordance with generally accepted auditing standards. In accordance with AICPA Statement on Auditing Standards (SAS) No. 109, Understanding the Entity and its Environment and Assessing the Risks of Material Misstatement, or its replacement, the independent certified public accountant should obtain an understanding of internal control sufficient to plan the audit. To the extent required by SAS No. 109, for those insurers required to file a management's report of internal control over financial reporting pursuant to subdivision 17, the independent certified public accountant should consider (as that term is defined in SAS No. 102, Defining Professional Requirements in Statements on Auditing Standards or its replacement) the most recently available report in planning and performing the audit of the statutory financial statements. Consideration should be given to other procedures illustrated in the Financial Condition Examiners Handbook promulgated by the National Association of Insurance Commissioners as the independent certified public accountant deems necessary.\nThe insurer required to furnish the annual audited financial report shall require the independent certified public accountant to provide written notice within five business days to the board of directors of the insurer or its audit committee of any determination by that independent certified public accountant that the insurer has materially misstated its financial condition as reported to the commissioner as of the balance sheet date currently under audit or that the insurer does not meet the minimum capital and surplus requirement of sections 60A.07, 66A.32, and 66A.33 as of that date. An insurer required to file an annual audited financial report who received a notification of adverse financial condition from the accountant shall file a copy of the notification with the commissioner within five business days of the receipt of the notification. The insurer shall provide the independent certified public accountant making the notification with evidence of the report being furnished to the commissioner. If the independent certified public accountant fails to receive the evidence within the required five-day period, the independent certified public accountant shall furnish to the commissioner a copy of the notification to the board of directors or its audit committee within the next five business days. No independent certified public accountant is liable in any manner to any person for any statement made in connection with this subdivision if the statement is made in good faith in compliance with this subdivision. If the accountant becomes aware of facts which might have affected the audited financial report after the date it was filed, the accountant shall take the action prescribed by AU section 561, Subsequent Discovery of Facts Existing at the Date of the Auditor's Report of the Professional Standards issued by the American Institute of Certified Public Accountants, or its replacement.\nIn addition to the annual audited financial report, each insurer shall furnish the commissioner with a written communication as to any unremediated material weaknesses in its internal control over financial reporting noted during the audit. The communication must be prepared by the accountant within 60 days after the filing of the annual audited financial report, and must contain a description of any unremediated material weakness, as the term material weakness is defined by SAS No. 115, Communicating Internal Control Related Matters Identified in an Audit, or its replacement, as of the December 31 immediately preceding so as to coincide with the audited financial report discussed in subdivision 2 in the insurer's internal control over financial reporting noted by the accountant during the course of their audit of the financial statements. If no unremediated material weaknesses were noted, the communication should so state.\nThe insurer is required to provide a description of remedial actions taken or proposed to correct unremediated material weaknesses, if the actions are not described in the accountant's communication.\nThe accountant shall furnish the insurer in connection with, and for inclusion in, the filing of the annual audited financial report a letter stating that the accountant is independent with respect to the insurer and conforms to the standards of the accountant's profession as contained in the Code of Professional Conduct of the American Institute of Certified Public Accountants and the Code of Professional Conduct of the Minnesota Board of Accountancy or similar code; the background and experience in general, and the experience in audits of insurers of the staff assigned to the engagement and whether each is an independent certified public accountant; that the accountant understands that the annual audited financial report and the opinion on it will be filed in compliance with this statute and that the commissioner will be relying on this information in the monitoring and regulation of the financial position of insurers; that the accountant consents to the requirements of subdivision 14 and that the accountant consents and agrees to make available for review by the commissioner, or the commissioner's designee or appointed agent, the work papers, as defined in subdivision 14; a representation that the accountant is properly licensed in good standing by the appropriate state licensing authorities and is a member in good standing in the American Institute of Certified Public Accountants; and a representation that the accountant complies with subdivision 7. Nothing in this section prohibits the accountant from utilizing staff the accountant deems appropriate where use is consistent with the standards prescribed by generally accepted auditing standards.\nWork papers are the records kept by the independent certified public accountant of the procedures followed, tests performed, information obtained, and conclusions reached pertinent to the independent certified public accountant's audit of the financial statements of an insurer. Work papers may include audit planning documents, work programs, analyses, memoranda, letters of confirmation and representation, management letters, abstracts of company documents, and schedules or commentaries prepared or obtained by the independent certified public accountant in the course of the audit of the financial statements of an insurer and that support the accountant's opinion. Every insurer required to file an audited financial report shall require the accountant, through the insurer, to make available for review by the examiners the work papers prepared in the conduct of the audit and any communications related to the audit between the accountant and the insurer. The work papers must be made available at the offices of the insurer, at the offices of the commissioner, or at any other reasonable place designated by the commissioner. The insurer shall require that the accountant retain the audit work papers and communications until the commissioner has filed a report on examination covering the period of the audit but no longer than seven years after the period reported upon, provided retention of the working papers beyond the seven years is not required by other professional or regulatory requirements. In the conduct of the periodic review by the examiners, it must be agreed that photocopies of pertinent audit work papers may be made and retained by the commissioner. These copies shall be part of the commissioner's work papers and must be given the same confidentiality as other examination work papers generated by the commissioner.\n(a) The audit committee must be directly responsible for the appointment, compensation, and oversight of the work of any accountant including resolution of disagreements between management and the accountant regarding financial reporting for the purpose of preparing or issuing the audited financial report or related work pursuant to this section. Each accountant shall report directly to the audit committee.\n(b) The audit committee of an insurer or group of insurers is responsible for overseeing the insurer's internal audit function and granting the person or persons performing the function suitable authority and resources to fulfill their responsibilities if required by subdivision 15a.\n(c) Each member of the audit committee must be a member of the board of directors of the insurer or a member of the board of directors of an entity elected pursuant to paragraph (f) and subdivision 1, paragraph (c).\n(d) In order to be considered independent for purposes of this section, a member of the audit committee may not, other than in his or her capacity as a member of the audit committee, the board of directors, or any other board committee, accept any consulting, advisory, or other compensatory fee from the entity or be an affiliated person of the entity or any subsidiary of the entity. However, if law requires board participation by otherwise nonindependent members, that law shall prevail and such members may participate in the audit committee and be designated as independent for audit committee purposes, unless they are an officer or employee of the insurer or one of its affiliates.\n(e) If a member of the audit committee ceases to be independent for reasons outside the member's reasonable control, that person, with notice by the responsible entity to the state, may remain an audit committee member of the responsible entity until the earlier of the next annual meeting of the responsible entity or one year from the occurrence of the event that caused the member to be no longer independent.\n(f) To exercise the election of the controlling person to designate the audit committee for purposes of this section, the ultimate controlling person shall provide written notice to the commissioners of the affected insurers. Notification must be made timely before the issuance of the statutory audit report and include a description of the basis for the election. The election can be changed through notice to the commissioner by the insurer, which shall include a description of the basis for the change. The election remains in effect for perpetuity, until rescinded.\n(g) The audit committee shall require the accountant that performs for an insurer any audit required by this section to timely report to the audit committee in accordance with the requirements of SAS No. 114, The Auditor's Communication with Those Charged with Governance, or its replacement, including:\n(1) all significant accounting policies and material permitted practices;\n(2) all material alternative treatments of financial information within statutory accounting principles that have been discussed with management officials of the insurer, ramifications of the use of the alternative disclosures and treatments, and the treatment preferred by the accountant; and\n(3) other material written communications between the accountant and the management of the insurer, such as any management letter or schedule of unadjusted differences.\n(h) If an insurer is a member of an insurance holding company system, the reports required by paragraph (g) may be provided to the audit committee on an aggregate basis for insurers in the holding company system, provided that any substantial differences among insurers in the system are identified to the audit committee.\n(i) The proportion of independent audit committee members shall meet or exceed the following criteria:\n(1) for companies with prior calendar year direct written and assumed premiums $0 to $300,000,000, no minimum requirements;\n(2) for companies with prior calendar year direct written and assumed premiums over $300,000,000 to $500,000,000, majority of members must be independent; and\n(3) for companies with prior calendar year direct written and assumed premiums over $500,000,000, 75 percent or more must be independent.\n(j) An insurer with direct written and assumed premium, excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, less than $500,000,000 may make application to the commissioner for a waiver from the requirements of this subdivision based upon hardship. The insurer shall file, with its annual statement filing, the approval for relief from this subdivision with the states that it is licensed in or doing business in and the NAIC. If the nondomestic state accepts electronic filing with the NAIC, the insurer shall file the approval in an electronic format acceptable to the NAIC.\nThis subdivision does not apply to foreign or alien insurers licensed in this state or an insurer that is a SOX compliant entity or a direct or indirect wholly owned subsidiary of a SOX compliant entity.\n(a) An insurer is exempt from the requirements of this subdivision if:\n(1) the insurer has annual direct written and unaffiliated assumed premium, including international direct and assumed premium but excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, less than $500,000,000; and\n(2) if the insurer is a member of a group of insurers, the group has annual direct written and unaffiliated assumed premium including international direct and assumed premium, but excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, less than $1,000,000,000.\n(b) The insurer or group of insurers shall establish an internal audit function providing independent, objective, and reasonable assurance to the audit committee and insurer management regarding the insurer's governance, risk management, and internal controls. This assurance shall be provided by performing general and specific audits, reviews, and tests and by employing other techniques deemed necessary to protect assets, evaluate control effectiveness and efficiency, and evaluate compliance with policies and regulations.\n(c) In order to ensure that internal auditors remain objective, the internal audit function must be organizationally independent. Specifically, the internal audit function will not defer ultimate judgment on audit matters to others, and shall appoint an individual to head the internal audit function who will have direct and unrestricted access to the board of directors. Organizational independence does not preclude dual-reporting relationships.\n(d) The head of the internal audit function shall report to the audit committee regularly, but no less than annually, on the periodic audit plan, factors that may adversely impact the internal audit function's independence or effectiveness, material findings from completed audits and the appropriateness of corrective actions implemented by management as a result of audit findings.\n(e) If an insurer is a member of an insurance holding company system or included in a group of insurers, the insurer may satisfy the internal audit function requirements set forth in this section at the ultimate controlling parent level, an intermediate holding company level or the individual legal entity level.\n(a) No director or officer of an insurer shall, directly or indirectly:\n(1) make or cause to be made a materially false or misleading statement to an accountant in connection with any audit, review, or communication required under this section; or\n(2) omit to state, or cause another person to omit to state, any material fact necessary in order to make statements made, in light of the circumstances under which the statements were made, not misleading to an accountant in connection with any audit, review, or communication required under this section.\n(b) No officer or director of an insurer, or any other person acting under the direction thereof, shall directly or indirectly take any action to coerce, manipulate, mislead, or fraudulently influence any accountant engaged in the performance of an audit pursuant to this section if that person knew or should have known that the action, if successful, could result in rendering the insurer's financial statements materially misleading.\n(c) For purposes of paragraph (b), actions that, \"if successful, could result in rendering the insurer's financial statements materially misleading\" include, but are not limited to, actions taken at any time with respect to the professional engagement period to coerce, manipulate, mislead, or fraudulently influence an accountant:\n(1) to issue or reissue a report on an insurer's financial statements that is not warranted in the circumstances due to material violations of statutory accounting principles prescribed by the commissioner, generally accepted auditing standards, or other professional or regulatory standards;\n(2) not to perform audit, review, or other procedures required by generally accepted auditing standards or other professional standards;\n(3) not to withdraw an issued report; or\n(4) not to communicate matters to an insurer's audit committee.\n(a) Every insurer required to file an audited financial report pursuant to this section that has annual direct written and assumed premiums, excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, of $500,000,000 or more shall prepare a report of the insurer's or group of insurers' internal control over financial reporting, as these terms are defined in subdivision 1. The report must be filed with the commissioner along with the communication of internal control related matters noted in an audit described under subdivision 12. Management's report of internal control over financial reporting shall be as of the December 31 immediately preceding.\n(b) Notwithstanding the premium threshold in paragraph (a), the commissioner may require an insurer to file management's report of internal control over financial reporting if the insurer is in any RBC level event, or meets any one or more of the standards of an insurer deemed to be in hazardous financial condition pursuant to sections 60G.20 to 60G.22.\n(c) An insurer or a group of insurers that is:\n(1) directly subject to Section 404;\n(2) part of a holding company system whose parent is directly subject to Section 404;\n(3) not directly subject to Section 404 but is a SOX compliant entity; or\n(4) a member of a holding company system whose parent is not directly subject to Section 404 but is a SOX compliant entity;\nmay file its or its parent's Section 404 report and an addendum in satisfaction of this requirement provided that those internal controls of the insurer or group of insurers having a material impact on the preparation of the insurer's or group of insurer's audited statutory financial statements, consisting of those items included in subdivision 4, paragraphs (a), clauses (2) to (6), (b), and (c), were included in the scope of the Section 404 report. The addendum shall be a positive statement by management that there are no material processes with respect to the preparation of the insurer's or group of insurer's audited statutory financial statements, consisting of those items included in subdivision 4, paragraphs (a), clauses (2) to (6), (b), and (c), excluded from the Section 404 report. If there are internal controls of the insurer or group of insurers that have a material impact on the preparation of the insurer's or group of insurer's audited statutory financial statements and those internal controls were not included in the scope of the Section 404 report, the insurer or group of insurers may either file (i) a report under this subdivision, or (ii) the Section 404 report and a report under this subdivision for those internal controls that have a material impact on the preparation of the insurer's or group of insurer's audited statutory financial statements not covered by the Section 404 report.\n(d) Management's report of internal control over financial reporting shall include:\n(1) a statement that management is responsible for establishing and maintaining adequate internal control over financial reporting;\n(2) a statement that management has established internal control over financial reporting and an assertion, to the best of management's knowledge and belief, after diligent inquiry, as to whether its internal control over financial reporting is effective to provide reasonable assurance regarding the reliability of financial statements in accordance with statutory accounting principles;\n(3) a statement that briefly describes the approach or processes by which management evaluated the effectiveness of its internal control over financial reporting;\n(4) a statement that briefly describes the scope of work that is included and whether any internal controls were excluded;\n(5) disclosure of any unremediated material weaknesses in the internal control over financial reporting identified by management as of the December 31 immediately preceding. Management is not permitted to conclude that the internal control over financial reporting is effective to provide reasonable assurance regarding the reliability of financial statements in accordance with statutory accounting principles if there is one or more unremediated material weaknesses in its internal control over financial reporting;\n(6) a statement regarding the inherent limitations of internal control systems; and\n(7) signatures of the chief executive officer and the chief financial officer or equivalent position or title.\n(e) Management shall document and make available upon financial condition examination the basis upon which its assertions, required in paragraph (d), are made. Management may base its assertions, in part, upon its review, monitoring, and testing of internal controls undertaken in the normal course of its activities.\n(f) Management has discretion as to the nature of the internal control framework used, and the nature and extent of documentation, in order to make its assertion in a cost-effective manner and, as such, may include assembly of or reference to existing documentation.\n(g) Management's report on internal control over financial reporting, required by paragraph (a), and any documentation provided in support of the report during the course of a financial condition examination must be kept confidential by the Department of Commerce.\n(a) Upon written application of any insurer, the commissioner may grant an exemption from compliance with the provisions of this section. In order to receive an exemption, an insurer must demonstrate to the satisfaction of the commissioner that compliance would constitute a financial or organizational hardship upon the insurer. An exemption may be granted at any time and from time to time for specified periods. Within ten days from the denial of an insurer's written request for an exemption, the insurer may request in writing a hearing on its application for an exemption. This hearing must be held in accordance with chapter 14. Upon written application of any insurer, the commissioner may permit an insurer to file annual audited financial reports on some basis other than a calendar year basis for a specified period. An exemption may not be granted until the insurer presents an alternative method satisfying the purposes of this section. Within ten days from a denial of a written request for an exemption, the insurer may request in writing a hearing on its application. The hearing must be held in accordance with chapter 14.\n(b) This section applies to all insurers, unless otherwise indicated, required to file an annual audit by subdivision 2, except insurers having less than $1,000,000 of direct written premiums in this state in any calendar year and fewer than 1,000 policyholders or certificate holders of directly written policies nationwide at the end of the calendar year, are exempt from this section for that year, unless the commissioner makes a specific finding that compliance is necessary for the commissioner to carry out statutory responsibilities, except that insurers having assumed premiums from reinsurance contracts or treaties of $1,000,000 or more are not exempt.\n(c) If an insurer or group of insurers that is exempt from the subdivision 15a requirements no longer qualifies for that exemption, it shall have one year after the year the threshold is exceeded to comply with the requirements.\n(a) In the case of Canadian and British insurers, the annual audited financial report means the annual statement of total business on the form filed by these companies with their domiciliary supervision authority and duly audited by an independent chartered accountant.\n(b) For these insurers the letter required in subdivision 5 shall state that the accountant is aware of the requirements relating to the annual audited statement filed with the commissioner under subdivision 2, and shall affirm that the opinion expressed is in conformity with those requirements.\nA report of the independent certified public accountant that performs the audit of an insurer's annual statement as required under subdivision 2 shall be filed and contain a statement as to whether anything in connection with the audit came to the accountant's attention that caused the accountant to believe that the insurer failed to adopt and consistently apply the valuation procedures as required by sections 60A.122 and 60A.123.\n(a) The commissioner or a designated representative shall determine the nature, scope, and frequency of examinations under this section conducted by examiners under section 60A.031. These examinations may cover all aspects of the insurer's assets, condition, affairs, and operations and may include and be supplemented by audit procedures performed by independent certified public accountants. Scheduling of examinations will take into account all relevant matters with respect to the insurer's condition, including results of the National Association of Insurance Commissioners, Insurance Regulatory Information Systems, changes in management, results of market conduct examinations, and audited financial reports. The type of examinations performed by examiners under this section must be compliance examinations, targeted examinations, and comprehensive examinations.\n(b) Compliance examinations will consist of a review of the accountant's work papers defined under this section and a general review of the insurer's corporate affairs and insurance operations to determine compliance with the Minnesota insurance laws and the rules of the Department of Commerce. The examiners may perform alternative or additional examination procedures to supplement those performed by the accountant when the examiners determine that the procedures are necessary to verify the financial condition of the insurer.\n(c) Targeted examinations may cover limited areas of the insurer's operations as the commissioner may deem appropriate.\n(d) Comprehensive examinations will be performed when the report of the accountant as provided for in subdivision 7, paragraph (b), the notification required by subdivision 7, paragraph (c), the results of compliance or targeted examinations, or other circumstances indicate in the judgment of the commissioner or a designated representative that a complete examination of the condition and affairs of the insurer is necessary.\n(e) Upon completion of each targeted, compliance, or comprehensive examination, the examiner appointed by the commissioner shall make a full and true report on the results of the examination. Each report shall include a general description of the audit procedures performed by the examiners and the procedures of the accountant that the examiners may have utilized to supplement their examination procedures and the procedures that were performed by the registered independent certified public accountant if included as a supplement to the examination.\nAn annual statement, report, or document related to the business of insurance must not be filed with the commissioner or issued to the public if it is signed by anyone who is represented in the instrument as an \"accountant,\" unless the person is qualified as defined by this section. A violation of this subdivision is a violation of section 72A.19 and punishable in accordance with section 72A.25.",
	"repealed": false
}