{
	"id": "609.342",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.342",
	"title": "609.342 CRIMINAL SEXUAL CONDUCT IN THE FIRST DEGREE.",
	"text": "A person who engages in sexual penetration with another person is guilty of criminal sexual conduct in the first degree if any of the following circumstances exists:\n(a) circumstances existing at the time of the act cause the complainant to have a reasonable fear of imminent great bodily harm to the complainant or another;\n(b) the actor is armed with a dangerous weapon or any article used or fashioned in a manner to lead the complainant to reasonably believe it to be a dangerous weapon and uses or threatens to use the weapon or article to cause the complainant to submit;\n(c) the actor causes personal injury to the complainant, and any of the following circumstances exist:\n(i) the actor uses coercion to accomplish the act;\n(ii) the actor uses force, as defined in section 609.341, subdivision 3, clause (2); or\n(iii) the actor knows or has reason to know that the complainant is mentally impaired, mentally incapacitated, or physically helpless;\n(d) the actor uses force as defined in section 609.341, subdivision 3, clause (1); or\n(e) the actor is aided or abetted by one or more accomplices within the meaning of section 609.05, and either of the following circumstances exists:\n(i) the actor or an accomplice uses force or coercion to cause the complainant to submit; or\n(ii) the actor or an accomplice is armed with a dangerous weapon or any article used or fashioned in a manner to lead the complainant reasonably to believe it to be a dangerous weapon and uses or threatens to use the weapon or article to cause the complainant to submit.\nA person who engages in penetration with anyone under 18 years of age or sexual contact with a person under 14 years of age as defined in section 609.341, subdivision 11, paragraph (c), is guilty of criminal sexual conduct in the first degree if any of the following circumstances exists:\n(a) circumstances existing at the time of the act cause the complainant to have a reasonable fear of imminent great bodily harm to the complainant or another;\n(b) the actor is armed with a dangerous weapon or any article used or fashioned in a manner to lead the complainant to reasonably believe it to be a dangerous weapon and uses or threatens to use the weapon or article to cause the complainant to submit;\n(c) the actor causes personal injury to the complainant, and any of the following circumstances exist:\n(i) the actor uses coercion to accomplish the act;\n(ii) the actor uses force, as defined in section 609.341, subdivision 3, clause (2); or\n(iii) the actor knows or has reason to know that the complainant is mentally impaired, mentally incapacitated, or physically helpless;\n(d) the actor is aided or abetted by one or more accomplices within the meaning of section 609.05, and either of the following circumstances exists:\n(i) the actor or an accomplice uses force or coercion to cause the complainant to submit; or\n(ii) the actor or an accomplice is armed with a dangerous weapon or any article used or fashioned in a manner to lead the complainant to reasonably believe it to be a dangerous weapon and uses or threatens to use the weapon or article to cause the complainant to submit;\n(e) the complainant is under 14 years of age and the actor is more than 36 months older than the complainant. Neither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(f) the complainant is at least 14 years of age but less than 16 years of age and:\n(i) the actor is more than 36 months older than the complainant; and\n(ii) the actor is in a current or recent position of authority over the complainant.\nNeither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(g) the complainant was under 16 years of age at the time of the act and the actor has a significant relationship to the complainant. Neither mistake as to the complainant's age nor consent to the act by the complainant is a defense;\n(h) the complainant was under 16 years of age at the time of the act, and the actor has a significant relationship to the complainant and any of the following circumstances exist:\n(i) the actor or an accomplice used force or coercion to accomplish the act;\n(ii) the complainant suffered personal injury; or\n(iii) the sexual abuse involved multiple acts committed over an extended period of time.\nNeither mistake as to the complainant's age nor consent to the act by the complainant is a defense; or\n(i) the actor uses force, as defined in section 609.341, subdivision 3, clause (1).\n(a) Except as otherwise provided in section 609.3455; or Minnesota Statutes 2004, section 609.109, a person convicted under subdivision 1 or subdivision 1a may be sentenced to imprisonment for not more than 30 years or to a payment of a fine of not more than $40,000, or both.\n(b) Unless a longer mandatory minimum sentence is otherwise required by law or the Sentencing Guidelines provide for a longer presumptive executed sentence, the court shall presume that an executed sentence of 144 months must be imposed on an offender convicted of violating this section. Sentencing a person in a manner other than that described in this paragraph is a departure from the Sentencing Guidelines.\n(c) A person convicted under this section is also subject to conditional release under section 609.3455.\nExcept when imprisonment is required under section 609.3455; or Minnesota Statutes 2004, section 609.109, if a person is convicted under subdivision 1a, clause (g), the court may stay imposition or execution of the sentence if it finds that:\n(a) a stay is in the best interest of the complainant or the family unit; and\n(b) a professional assessment indicates that the offender has been accepted by and can respond to a treatment program.\nIf the court stays imposition or execution of sentence, it shall include the following as conditions of probation:\n(1) incarceration in a local jail or workhouse;\n(2) a requirement that the offender complete a treatment program; and\n(3) a requirement that the offender have no unsupervised contact with the complainant until the offender has successfully completed the treatment program unless approved by the treatment program and the supervising correctional agent.",
	"repealed": false
}