{
	"id": "124D.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.81",
	"title": "124D.81 AMERICAN INDIAN EDUCATION AID.",
	"text": "A school district, charter school, cooperative unit as defined in section 123A.24, subdivision 2, or American Indian-controlled Tribal contract or grant school enrolling at least 20 American Indian students identified by the state count on October 1 of the previous school year is eligible for American Indian education aid if it meets the requirements of this section. Programs may provide for contracts for the provision of program components by nonsectarian nonpublic, community, Tribal, charter, or alternative schools. The commissioner shall prescribe the form and manner of application for aids, and no aid shall be made for a program not complying with the requirements of sections 124D.71 to 124D.82.\nTo receive aid, an eligible district, charter school, cooperative unit as defined in section 123A.24, subdivision 2, or Tribal contract school must develop and submit a plan for approval by the Indian education director that shall:\n(a) identify the measures to be used to meet the requirements of sections 124D.71 to 124D.82;\n(b) identify the activities, methods and programs to meet the identified educational needs of the children to be enrolled in the program;\n(c) describe how district goals and objectives as well as the objectives of sections 124D.71 to 124D.82 are to be achieved;\n(d) demonstrate that required and elective courses as structured do not have a discriminatory effect within the meaning of section 124D.74, subdivision 5;\n(e) describe how each school program will be organized, staffed, coordinated, and monitored; and\n(f) project expenditures for programs under sections 124D.71 to 124D.82.\n(a) The American Indian education aid for an eligible district, cooperative unit, or Tribal contract school equals the greater of: (1) the sum of $40,000 plus the product of $500 times the difference between the number of American Indian students enrolled on October 1 of the previous school year and 20; or (2) if the district or school received a grant under this section for fiscal year 2015, the amount of the grant for fiscal year 2015.\n(b) Notwithstanding paragraph (a), the American Indian education aid must not exceed the district, cooperative unit, or Tribal contract school's actual expenditure according to the approved plan under subdivision 2, except as provided in subdivision 2b.\nNotwithstanding section 16A.28, if a school district or Tribal contract school does not expend the full amount of the American Indian education aid in accordance with the plan in the designated fiscal year, the school district or Tribal contract school may carry forward and expend up to half of the remaining funds in the following fiscal year, and is not subject to an aid reduction if:\n(1) the district is otherwise following the plan submitted and approved under subdivision 2;\n(2) the American Indian Parent Advisory Committee for the school is aware of and has approved the carry forward and has concurred with the district's educational offerings extended to American Indian students under section 124D.78;\n(3) the funds carried over are used in accordance with section 124D.74, subdivision 1; and\n(4) by April 1, the district reports to the Department of Education American Indian education director the reason the aid was not expended in the designated fiscal year, and describes how the district intends to expend the funds in the following fiscal year. The district must report this information in the form and manner determined by the commissioner.\nEach district or cooperative unit receiving aid under this section must each year conduct a count of American Indian children in the schools of the district; test for achievement; identify the extent of other educational needs of the children to be enrolled in the American Indian education program; and classify the American Indian children by grade, level of educational attainment, age and achievement. Participating schools must maintain records concerning the needs and achievements of American Indian children served.\nIn accordance with recognized professional standards, all testing and evaluation materials and procedures utilized for the identification, testing, assessment, and classification of American Indian children must be selected and administered so as not to be racially or culturally discriminatory and must be valid for the purpose of identifying, testing, assessing, and classifying American Indian children.\nParticipating schools, districts, and cooperative units must keep records and afford access to them as the commissioner finds necessary to ensure that American Indian education programs are implemented in conformity with sections 124D.71 to 124D.82. Each school district, cooperative unit, or participating school must keep accurate, detailed, and separate revenue and expenditure accounts for American Indian education programs funded under this section.\nA district, cooperative unit, or participating school providing American Indian education programs shall be eligible to receive moneys for these programs from other government agencies and from private sources when the moneys are available.\nNothing in sections 124D.71 to 124D.82 shall be construed as prohibiting a district, cooperative unit, or school from implementing an American Indian education program which is not in compliance with sections 124D.71 to 124D.82 if the proposal and plan for that program is not funded pursuant to this section.",
	"repealed": false
}