{
	"id": "103G.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.615",
	"title": "103G.615 PERMITS TO HARVEST OR DESTROY AQUATIC PLANTS.",
	"text": "(a) The commissioner may issue a state general permit to a governmental subdivision or to the general public to conduct one or more projects described in this subdivision. The commissioner may issue permits, with or without a fee, to:\n(1) gather or harvest aquatic plants, or plant parts, other than wild rice from public waters;\n(2) transplant aquatic plants into public waters;\n(3) destroy harmful or undesirable aquatic vegetation or organisms in public waters under prescribed conditions to protect the waters, desirable species of fish, vegetation, other forms of aquatic life, and the public.\n(b) Application for a permit and a notification to request authorization to conduct a project under a general permit must be accompanied by a fee, if required.\n(c) An aquatic plant management permit is valid for one growing season and expires on December 31 of the year it is issued unless the commissioner stipulates a different expiration date in rule or in the permit.\n(d) A general permit may authorize a project for more than one growing season.\n(a) The commissioner shall establish a fee schedule for permits to control or harvest aquatic plants other than wild rice. The fees must be set by rule, and section 16A.1283 does not apply, but the rule must not take effect until 45 legislative days after it has been reported to the legislature. The fees shall not exceed $2,500 per permit and shall be based upon the cost of receiving, processing, analyzing, and issuing the permit, and additional costs incurred after the application to inspect and monitor the activities authorized by the permit, and enforce aquatic plant management rules and permit requirements.\n(b) A fee for a permit for the control of rooted aquatic vegetation for each contiguous parcel of shoreline owned by an owner may be charged. This fee may not be charged for permits issued in connection with purple loosestrife control or lakewide Eurasian watermilfoil control programs.\n(c) A fee may not be charged to the state or a federal governmental agency applying for a permit.\n(d) A fee for a permit for the control of rooted aquatic vegetation in a public water basin that is 20 acres or less in size shall be one-half of the fee established under paragraph (a).\n(e) The money received for the permits under this subdivision shall be deposited in the treasury and credited to the water recreation account.\n(f) The fee for processing a notification to request authorization for work under a general permit is $30, until the commissioner establishes a fee by rule as provided under this subdivision.\nThe commissioner shall, by rule, prescribe standards to issue and deny permits under this section. The standards must ensure that aquatic plant control is consistent with shoreland conservation ordinances, lake management plans and programs, and wild and scenic river plans.\n(a) \"Invasive aquatic plant management permit\" means an aquatic plant management permit as defined in rules of the Department of Natural Resources that authorizes the selective control of invasive aquatic plants to cause a significant reduction in the abundance of the invasive aquatic plant.\n(b) The commissioner may waive the dated signature of approval requirement in rules of the Department of Natural Resources for invasive aquatic plant management permits if obtaining signatures would create an undue burden on the permittee or if the commissioner determines that aquatic plant control is necessary to protect natural resources.\n(c) If the signature requirement is waived under paragraph (b) because obtaining signatures would create an undue burden on the permittee, the commissioner shall require an alternate form of landowner notification, including news releases or public notices in a local newspaper, a public meeting, or a mailing or electronic transmission to the most recent permanent physical or electronic mailing address of affected landowners. The notification must be given annually and must include: the proposed date of treatment, the target species, the method of control or product being used, and instructions on how the landowner may request that control not occur adjacent to the landowner's property.\n(d) The commissioner may allow dated signatures of approval obtained for an invasive aquatic plant management permit to satisfy rules of the Department of Natural Resources to remain valid for three years if property ownership remains unchanged.\n(a) The commissioner may make findings and issue an order to a person to stop the illegal gathering, harvesting, planting or transplanting, or destroying of aquatic vegetation or organisms in public waters.\n(b) In the same or a separate findings and order, the commissioner may require restoration or replacement of any emergent or floating leaf aquatic vegetation lost as a result of the illegal activities, to the condition existing before the illegal activities were undertaken. An order for restoration or replacement must state with specificity the work that is necessary to comply with the order and must specify a date by which the work must be completed.\n(c) The person or entity to whom the order is issued may request a review of the order by the commissioner within 30 days of receipt of written notice by filing a written request for review. If the written request is not submitted within 30 days, the restoration or replacement order becomes final. The commissioner shall review the request and supporting evidence and render a decision within 60 days of the request for review.\n(d) If the person or entity wishes to appeal the decision of the commissioner after review under paragraph (c), a written request must be filed with the commissioner within 30 days for a contested case hearing under chapter 14. A bond, as provided in subdivision 5, must accompany the demand for a hearing. The bond and demand for hearing must be filed 30 days after the person is served with a copy of the decision of the commissioner on review.\n(e) If the person or entity to whom the decision of the commissioner on review is addressed does not demand a contested case hearing under chapter 14 or demands a hearing but fails to file the required bond:\n(1) the commissioner's order becomes final at the end of 30 days after the person is served with the decision of the commissioner on review; and\n(2) the person may not appeal the order.\n(a) A person or entity filing a demand for a public hearing, under subdivision 4, must execute and file a corporate surety bond or equivalent security to the state of Minnesota, to be approved by the commissioner and in an amount and form determined by the commissioner. The bond or security must be conditioned to pay the costs of the hearing to the extent described in subdivision 6 if the commissioner's findings and order are affirmed without material modification.\n(b) A bond or security is not required of a public authority that demands a public hearing.\n(c) The commissioner may waive the requirement for a bond or other security.\n(a) Except as provided in paragraph (b), the costs of a hearing must be paid as prescribed by chapter 14 and the chief administrative law judge.\n(b) If the commissioner's order is affirmed without material modification, the appellant must pay the following costs, up to $750:\n(1) costs of the stenographic record and transcript; and\n(2) rental costs, if any, of the place where the hearing is held.\nA violation of an order issued under this section is a misdemeanor.",
	"repealed": false
}