{
	"id": "342.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.02",
	"title": "342.02 OFFICE OF CANNABIS MANAGEMENT.",
	"text": "The Office of Cannabis Management is created with the powers and duties established by law. In making rules, establishing policy, and exercising its regulatory authority over the cannabis industry and hemp consumer industry, the office must:\n(1) promote the public health and welfare;\n(2) protect public safety;\n(3) eliminate the illicit market for cannabis flower and cannabis products;\n(4) meet the market demand for cannabis flower and cannabis products;\n(5) promote a craft industry for cannabis flower and cannabis products; and\n(6) prioritize growth and recovery in communities that have experienced a disproportionate, negative impact from cannabis prohibition.\n(a) The office has the following powers and duties:\n(1) to develop, maintain, and enforce an organized system of regulation for the cannabis industry and hemp consumer industry;\n(2) to establish programming, services, and notification to protect, maintain, and improve the health of citizens;\n(3) to prevent unauthorized access to cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products by individuals under 21 years of age;\n(4) to establish and regularly update standards for product manufacturing, testing, packaging, and labeling, including requirements for an expiration, sell-by, or best-used-by date;\n(5) to promote economic growth with an emphasis on growth in areas that experienced a disproportionate, negative impact from cannabis prohibition;\n(6) to issue and renew licenses;\n(7) to require fingerprints from individuals determined to be subject to fingerprinting, including the submission of fingerprints to the Federal Bureau of Investigation where required by law and to obtain criminal conviction data for individuals seeking a license from the office on the individual's behalf or as a cooperative member or director, manager, or general partner of a business entity;\n(8) to receive reports required by this chapter and inspect the premises, records, books, and other documents of license holders to ensure compliance with all applicable laws and rules;\n(9) to authorize the use of unmarked motor vehicles to conduct seizures or investigations pursuant to the office's authority;\n(10) to impose and collect civil and administrative penalties as provided in this chapter;\n(11) to publish such information as may be deemed necessary for the welfare of cannabis businesses, cannabis workers, hemp businesses, and hemp workers and the health and safety of citizens;\n(12) to make loans and grants in aid to the extent that appropriations are made available for that purpose;\n(13) to authorize research and studies on cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, hemp-derived consumer products, the cannabis industry, and the hemp consumer industry;\n(14) to provide reports as required by law;\n(15) to develop a warning label regarding the effects of the use of cannabis flower and cannabis products by persons 25 years of age or younger;\n(16) to determine, based on a review of medical and scientific literature, whether it is appropriate to require additional health and safety warnings containing information that is both supported by credible science and helpful to consumers in considering potential health risks from the use of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products, including but not limited to warnings regarding any risks associated with use by pregnant or breastfeeding individuals, or by individuals planning to become pregnant, and the effects that use has on brain development for individuals under the age of 25;\n(17) to establish limits on the potency of cannabis flower and cannabis products that can be sold to customers by licensed cannabis retailers, licensed cannabis microbusinesses, and licensed cannabis mezzobusinesses with an endorsement to sell cannabis flower and cannabis products to customers;\n(18) to establish rules authorizing an increase in plant canopy limits and outdoor cultivation limits to meet market demand and limiting cannabis manufacturing consistent with the goals identified in subdivision 1;\n(19) to order a person or business that cultivates cannabis flower or manufactures or produces cannabis products, medical cannabinoid products, artificially derived cannabinoids, lower-potency hemp edibles, hemp-derived consumer products, or hemp-derived topical products to recall any cannabis flower, product, or ingredient containing cannabinoids that is used in a product if the office determines that the flower, product, or ingredient represents a risk of causing a serious adverse incident; and\n(20) to exercise other powers and authority and perform other duties required by law.\n(b) In addition to the powers and duties in paragraph (a), the office has the following powers and duties until January 1, 2027:\n(1) to establish limits on the potency of adult-use cannabis flower and adult-use cannabis products that can be sold to customers by licensed cannabis retailers, licensed cannabis microbusinesses, and licensed cannabis mezzobusinesses with an endorsement to sell adult-use cannabis flower and adult-use cannabis products to customers; and\n(2) to permit, upon application to the office in the form prescribed by the director of the office, a licensee under this chapter to perform any activity if such permission is substantially necessary for the licensee to perform any other activity permitted by the applicant's license and is not otherwise prohibited by law.\n(a) The powers and duties of the Department of Health with respect to the medical cannabis program under Minnesota Statutes 2022, sections 152.22 to 152.37, are transferred to the Office of Cannabis Management under section 15.039.\n(b) The following protections shall apply to employees who are transferred from the Department of Health to the Office of Cannabis Management:\n(1) the employment status and job classification of a transferred employee shall not be altered as a result of the transfer;\n(2) transferred employees who were represented by an exclusive representative prior to the transfer shall continue to be represented by the same exclusive representative after the transfer;\n(3) the applicable collective bargaining agreements with exclusive representatives shall continue in full force and effect for such transferred employees after the transfer;\n(4) the state must meet and negotiate with the exclusive representatives of the transferred employees about any proposed changes affecting or relating to the transferred employees' terms and conditions of employment to the extent such changes are not addressed in the applicable collective bargaining agreement; and\n(5) for an employee in a temporary unclassified position transferred to the Office of Cannabis Management, the total length of time that the employee has served in the appointment shall include all time served in the appointment and the transferring agency and the time served in the appointment at the Office of Cannabis Management. An employee in a temporary unclassified position who was hired by a transferring agency through an open competitive selection process in accordance with a policy enacted by Minnesota Management and Budget shall be considered to have been hired through such process after the transfer.\n(c) This subdivision is effective July 1, 2024.\n(a) The office and the commissioner of agriculture shall enter into interagency agreements to ensure that edible cannabis products and lower-potency hemp edibles are handled, manufactured, and inspected in a manner that is consistent with the relevant food safety requirements in chapters 28A, 31, and 34A and associated rules.\n(b) The office may cooperate and enter into other agreements with the commissioner of agriculture and may cooperate and enter into agreements with the commissioners and directors of other state agencies and departments to promote the beneficial interests of the state.\n(a) The office may adopt rules to implement any provisions in this chapter.\n(b) Rules for which notice is published in the State Register before July 1, 2025, may be adopted using the expedited rulemaking process in section 14.389. The 18-month time limit imposed by section 14.125 does not apply to rules adopted under this paragraph.\n(a) The governor shall appoint a director of the office with the advice and consent of the senate. The director must be in the unclassified service and must serve at the pleasure of the governor.\n(b) The salary of the director must be established by the Compensation Council under section 15A.082.\n(c) The director may appoint and employ no more than two deputy directors.\n(d) The director has administrative control of the office. The director has the powers described in section 15.06, subdivision 6.\n(e) The director may apply for and accept on behalf of the state any grants, bequests, gifts, or contributions for the purpose of carrying out the duties and responsibilities of the director.\n(f) Pursuant to state law, the director may apply for and receive money made available from federal sources for the purpose of carrying out the duties and responsibilities of the director.\n(g) The director may make contracts with and grants to Tribal Nations, public and private agencies, for-profit and nonprofit organizations, and individuals using appropriated money.\n(a) The office may employ other personnel in the classified service necessary to carry out the duties in this chapter.\n(b) Upon request by the office, a prospective employee of the office must submit a completed criminal history records check consent form, a full set of classifiable fingerprints, and the required fees to the office. Upon receipt of this information, the office must submit the completed criminal history records check consent form, full set of classifiable fingerprints, and required fees to the Bureau of Criminal Apprehension. After receiving this information, the bureau must conduct a Minnesota criminal history records check of the prospective employee. The bureau may exchange a prospective employee's fingerprints with the Federal Bureau of Investigation to obtain the prospective employee's national criminal history record information. The bureau must return the results of the Minnesota and federal criminal history records checks to the director to determine if the prospective employee is disqualified under rules adopted pursuant to section 342.15.\nThe office must establish a Division of Social Equity. At a minimum, the division must:\n(1) engage with the community and administer grants to communities that experienced a disproportionate, negative impact from cannabis prohibition and usage in order to promote economic development, improve social determinants of health, provide services to prevent violence, support early intervention programs for youth and families, and promote community stability and safety;\n(2) act as an ombudsperson for the office to provide information, investigate complaints under this chapter, and provide or facilitate dispute resolutions; and\n(3) report to the office on the status of complaints and social equity in the cannabis industry.",
	"repealed": false
}