{
	"id": "124D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.04",
	"title": "124D.04 OPTIONS FOR ENROLLING IN ADJOINING STATES.",
	"text": "Minnesota pupils and pupils residing in adjoining states may enroll in districts in the other state according to:\n(1) section 124D.05, subdivision 2; or\n(2) this section.\nA Minnesota resident pupil may enroll in a district in an adjoining state if the district to be attended borders Minnesota.\nExcept as provided under an agreement with an adjoining state under section 124D.041, a non-Minnesota pupil who resides in an adjoining state in a district that borders Minnesota may enroll in a Minnesota district if either the board of the district in which the pupil resides or state in which the pupil resides pays tuition to the district in which the pupil is enrolled.\nA pupil who resides in Canada may enroll in a Minnesota district if the province in which the pupil resides pays tuition to the district in which the pupil is enrolled. A pupil may enroll either full time or part time for all instructional programs and shall be considered eligible for all other purposes for all other programs offered by the district. The tuition must be an amount that is at least comparable to the tuition specified in section 124D.05, subdivision 1. A district may accept funds from any international agency for these programs.\nExcept as otherwise provided in this section, the rights and duties set forth in section 124D.03 apply to Minnesota pupils, parents, and districts if a pupil enrolls in a nonresident district according to this section.\n(a) In each odd-numbered year, before March 1, the commissioner must agree to rates of tuition for Minnesota elementary and secondary pupils attending in other states for the next two fiscal years when the other state agrees to negotiate tuition rates. The commissioner must negotiate equal, reciprocal rates with the designated authority in each state for pupils who reside in an adjoining state and enroll in a Minnesota district. The rates must be at least equal to the tuition specified in section 124D.05, subdivision 1. If the other state does not agree to negotiate a general tuition rate, a Minnesota school district may negotiate a tuition rate with the school district in the other state that sends a pupil to or receives a pupil from the Minnesota school district. The tuition rate for a pupil with a disability must be equal to the actual cost of instruction and services provided. The resident district of a Minnesota pupil attending in another state under this section must pay the amount of tuition agreed upon in this section to the district of attendance, prorated on the basis of the proportion of the school year attended.\n(b) Notwithstanding paragraph (a) and subdivision 9, if an agreement is reached between the state of Minnesota and an adjoining state pursuant to section 124D.041, the provisions of section 124D.041 and the agreement shall apply to all enrollment transfers between Minnesota and the adjoining state, and provisions of paragraph (a) and subdivision 9 shall not apply.\n(a) The agreement under subdivision 6 with each state must specify that the attending district in each state transport a pupil from the district boundary to the school of attendance.\n(b) Notwithstanding paragraph (a), the districts of residence and attendance may agree that either district may provide transportation from a pupil's home or agreed-upon location to school. Transportation aid for Minnesota students eligible for aid must be paid only for transportation within the resident district.\nThis section is effective with respect to any bordering state upon enactment of provisions by the bordering state that the commissioner determines are essentially similar to the provisions for Minnesota pupils in this section.\nIf a Minnesota school district cannot agree with an adjoining state on a tuition rate for a Minnesota student attending school in that state and that state has met the requirements in subdivision 8, then the student's parent or guardian may request that the commissioner set a tuition rate for the student. The Minnesota district must pay the amount of tuition the commissioner sets.",
	"repealed": false
}