{
	"id": "295.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.52",
	"title": "295.52 TAXES IMPOSED.",
	"text": "A tax is imposed on each hospital equal to 1.8 percent of its gross revenues.\nA tax is imposed on each surgical center equal to 1.8 percent of its gross revenues.\n[Repealed, 1997 c 225 art 3 s 23]\nA tax is imposed on each health care provider equal to 1.8 percent of its gross revenues.\nA tax is imposed on each wholesale drug distributor equal to 1.8 percent of its gross revenues.\n(a) A person that receives legend drugs for resale or use in Minnesota, other than from a wholesale drug distributor that is subject to tax under subdivision 3, is subject to a tax equal to the price paid for the legend drugs multiplied by 1.8 percent. Liability for the tax is incurred when legend drugs are received or delivered in Minnesota by the person.\n(b) A tax imposed under this subdivision does not apply to purchases by an individual for personal consumption.\nA wholesale drug distributor with nexus in Minnesota, who is not subject to tax under subdivision 3, on all or a particular transaction is required to collect the tax imposed under subdivision 4, from the purchaser of the drugs and give the purchaser a receipt for the tax paid. The tax collected shall be remitted to the commissioner in the manner prescribed by section 295.55, subdivision 3.\nVolunteer ambulance services are not subject to the tax under this section. For purposes of this requirement, \"volunteer ambulance service\" means an ambulance service in which all of the individuals whose primary responsibility is direct patient care meet the definition of volunteer under section 144E.001, subdivision 15. The ambulance service may employ administrative and support staff, and remain eligible for this exemption, if the primary responsibility of these staff is not direct patient care.\nThe tax liability of a person who meets the definition of a health care provider solely because the person sells or repairs hearing aids and related equipment or prescription eyewear is limited to the gross revenues received from the sale or repair of these items.\n[Repealed, 2014 c 308 art 9 s 94]\n(a) By December 1 of each year, beginning in 2011, the commissioner of management and budget shall determine the projected balance in the health care access fund for the biennium.\n(b) If the commissioner of management and budget determines that the projected balance in the health care access fund for the biennium reflects a ratio of revenues to expenditures and transfers greater than 125 percent, and if the actual cash balance in the fund is adequate, as determined by the commissioner of management and budget, the commissioner, in consultation with the commissioner of revenue, shall reduce the tax rates levied under subdivisions 1, 1a, 2, 3, and 4, for the subsequent calendar year sufficient to reduce the structural balance in the fund. The rate may be reduced to the extent that the projected revenues for the biennium do not exceed 125 percent of expenditures and transfers. The new rate shall be rounded to the nearest one-tenth of one percent. The rate reduction under this paragraph expires at the end of each calendar year and is subject to an annual redetermination by the commissioner of management and budget.\n(c) For purposes of the analysis defined in paragraph (b), the commissioner of management and budget shall include projected revenues.",
	"repealed": false
}