{
	"id": "53C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.10",
	"title": "53C.10 VEHICLE INSTALLMENT CONTRACT PREPAYMENT, REFUND CREDITS, ALLOWANCE.",
	"text": "(a) Notwithstanding the provisions of any retail installment contract to the contrary, any retail buyer may pay in full at any time before maturity the debt of any retail installment contract without penalty. In paying a precomputed retail installment contract in full, the retail buyer shall receive a refund credit thereon for such anticipation of payments. For contracts with substantially equal scheduled monthly payments remaining after the date of prepayment in full, the refund must be calculated for all fully unexpired monthly payment periods following the date of payment in full. For all other contracts, the refund must be calculated as of the date in the month following prepayment which corresponds to the original contract date. The refund shall be calculated according to the actuarial method, less an acquisition cost of $15 which may be deducted from the refund so calculated.\n(b) Where the amount of the credit for anticipation of payment is less than $1, no refund need be made.\n(c) The actuarial method means the method of allocating payments on a contract between the principal amount and finance charge at the contract rate charged under section 53C.09, whereby a payment is applied first to the accumulated finance charge and then to the unpaid principal balance based on the original terms of the contract and based on the assumption that all payments are made on the due date as originally scheduled or deferred.\nIf a payment results in the prepayment of three or more installment payments on a precomputed contract, the retail seller or assignee of the retail seller shall within 15 days of receipt of the prepayment, deliver or mail to the retail buyer a notice in at least eight-point type. The notice must contain the following statement:\n\"You have substantially prepaid the installment payments on your contract and may experience an interest savings over the remaining term only if you refinance the balance within the next 30 days.\"",
	"repealed": false
}