{
	"id": "16A.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.641",
	"title": "16A.641 STATE BONDS; APPROPRIATIONS.",
	"text": "When authorized by a law enacted in accordance with the constitution, article XI, sections 5 and 7, the commissioner shall sell and issue general obligation bonds of the state evidencing public debt incurred for any purpose stated in those sections. The full faith, credit, and taxing powers of the state are irrevocably pledged for the prompt and full payment of the bonds and interest. The decision of the commissioner on when to sell bonds must be based on the funding needs of the capital projects, the timing of the bond issue to achieve favorable interest rates, managing cash flow requirements for debt service, other state debt management considerations, and legal factors.\nBefore a sale of general obligation bonds, the commissioner shall report the amount of bonds to be issued and a detailed list of the projects or a statement of the program to be financed to the chairs of the house of representatives Ways and Means and Tax Committees and of the senate Finance and Tax Committees, and the minority leaders of the house and senate, for their advisory recommendation. The recommendation is positive if not received within ten days.\nBonds authorized by a law may be issued in more than one series, and bonds authorized by more than one law may be combined in a single series, as determined by order of the commissioner. The order must state the principal amount of the bonds to be issued under each law, and the aggregate principal amount and the maturity dates and amounts of the bonds included in the series that are to be issued for the purpose of each special fund.\nAt any time during the 18 months following the issuance of any series of bonds, the commissioner may, by amendment to the order authorizing their issuance, determine that any portion of the bonds were issued, or shall be deemed to have been issued, pursuant to a law other than the one specified in the original order and for a different purpose, and reallocate and transfer their proceeds to the appropriate account in the bond proceeds fund or the appropriate special fund, for expenditure pursuant to the law pursuant to which the amendment determines they were issued. No such amendment shall be adopted unless:\n(1) on the date of the original order, the bonds could have been issued and their proceeds expended as determined in the amended order;\n(2) all actions required for the issuance of the transferred bonds have been taken on or before the date of the amendment; and\n(3) the commissioner determines upon advice of counsel that the taxability of the interest on the bonds for federal income tax purposes will not be affected by the amendment.\nState bonds must be sold and issued upon competitive bids in the manner and on the terms and conditions determined by the commissioner in accordance with the laws authorizing them and subject to the approval of the attorney general, but not subject to chapter 14, including section 14.386. For each series, in addition to provisions required by subdivision 3, the commissioner may determine:\n(1) the time, place, and notice of sale and method of comparing bids;\n(2) the price, not less than par for highway bonds;\n(3) the principal amount and date of issue;\n(4) the interest rates and payment dates;\n(5) the maturity amounts and dates, not more than 20 years from the date of issue, subject to subdivision 5;\n(6) the terms, if any, on which the bonds may or must be redeemed before maturity, including notice, times, and redemption prices; and\n(7) the form of the bonds and the method of execution, delivery, payment, registration, conversion, and exchange, in accordance with section 16A.672.\nMS 2012 [Expired, 2009 c 93 art 1 s 22; 1Sp2011 c 12 s 38]\nNotwithstanding the public sale requirements of subdivision 4 and section 16A.66, subdivision 2, from June 1, 2009, until June 30, 2018, the commissioner may sell bonds, including refunding bonds, at negotiated sale.\nNotwithstanding the public sale requirements of subdivision 4 and section 16A.66, subdivision 2, the commissioner may sell bonds, including refunding bonds, at negotiated sale.\nIn issuing each series of state bonds the commissioner shall try to establish the maturities and other terms so that transfers to the state bond fund required in each year of the then current biennium under subdivision 10 may be made with the least practical effect on orderly spending plans for other appropriations from the general fund.\nThe commissioner shall ascertain from state records and certify to the holders of each series of state bonds, subject to the approval of the attorney general, that all conditions exist and all actions have been taken that are needed to make the bonds valid and binding general obligations of the state in accordance with their terms.\nThe bonds may be issued with or without regard to whether the interest to be paid on them is includable in gross income for federal tax purposes. If it is intended that the interest on the bonds be exempt from federal income taxes, the commissioner shall certify for the state on the date of issue the facts, estimates, and circumstances that lead the commissioner reasonably to expect that the proceeds of the bonds and the projects financed by them will not be used in a way that would cause the interest on the bonds to be subject to federal income taxes. The commissioner may covenant with the holders of the bonds that the state will comply with the provisions of the United States Internal Revenue Code then or later enacted that apply or may apply to the bonds and that establish conditions under which the interest to be paid on the bonds will not be subject to federal income taxes. The commissioner and all other state officers shall act or refrain from acting as necessary to comply with the covenants. A sum sufficient to meet the cost of compliance is annually appropriated to the commissioner from the general fund.\n(a) Proceeds of bonds issued under each law must be credited by the commissioner to a special fund, as provided in this subdivision. For the purpose of this subdivision, \"proceeds of bonds\" means and includes the principal amount of the bonds and any premium and accrued interest received on the sale of the bonds.\n(b) Accrued interest received on sale of the bonds must be credited to the state bond fund created by the constitution, article XI, section 7. Any premium received on the sale of the bonds on or prior to December 1, 2012, must be credited to the state bond fund. Any premium received on the sale of the bonds, except for refunding bonds, after December 1, 2012, must be credited to either the bond proceeds fund where it is used to reduce the par amount of the bonds issued or the state bond fund or used to reduce the par amount of the bond issue at the time of sale. Any premium received on the sale of the refunding bonds, after December 1, 2012, must be used or credited in accordance with paragraph (f).\n(c) Except as otherwise provided by law, proceeds of state bonds issued under the constitution, article XI, section 5, clause (a), must be credited to the bond proceeds fund established by section 16A.631.\n(d) Proceeds of state highway bonds must be credited to the trunk highway fund under the constitution, article XIV, section 6.\n(e) Proceeds of bonds issued for programs of grants or loans to political subdivisions must be credited to special accounts in the bond proceeds fund or to special funds established by laws stating the purposes of the grants or loans, and the standards and criteria under which an executive agency is authorized to make them.\n(f) Proceeds of refunding bonds must be either: (1) credited to the state bond fund as provided in section 16A.66, subdivision 1; or (2) in the case of premium received on the sale of the refunding bonds, used to reduce the par amount of the bond issue at the time of the bond sale.\n(g) Proceeds of other bonds must be credited as provided in the law authorizing their issuance.\n(a) The proceeds of bonds issued under each law are appropriated for the purposes described in the law and in this subdivision. This appropriation may never be canceled.\n(b) Before the proceeds are received in the proper special fund, the commissioner may transfer to that fund from the general fund amounts not exceeding the expected proceeds from the next bond sale. The commissioner shall return these amounts to the general fund by transferring proceeds when received. The amounts of these transfers are appropriated from the general fund and from the bond proceeds.\n(c) Actual and necessary travel and subsistence expenses of employees and all other nonsalary expenses incidental to the sale, printing, execution, and delivery of bonds must be paid from the proceeds. The proceeds are appropriated for this purpose. Bond proceeds must not be used to pay any part of the salary of a state employee involved in the sale, printing, execution, or delivery of the bonds.\n(d) Bond proceeds remaining in a special fund after the purposes for which the bonds were issued are accomplished or abandoned, as certified by the head of the agency administering the special fund, or as determined by the commissioner, unless devoted under the appropriation act to another purpose designated in the act, must be transferred to the state bond fund.\n(e) Before the proceeds of state highway bonds are received in the trunk highway fund, the commissioner may either:\n(1) transfer funds to the trunk highway fund from the general fund; or\n(2) authorize the use of funds in the trunk highway fund, in an amount not exceeding the expected proceeds from the next state highway bond sale.\nThese funds must be used in accordance with the legislative authorization to sell state highway bonds. The commissioner shall return these funds to the general fund or replace the funds used from the trunk highway fund by transferring proceeds when received. The amounts of these transfers are appropriated from the general fund and from the state highway bond proceeds.\n(a) The commissioner shall establish separate accounts in the state bond fund for:\n(1) state building bonds, and for other state bonds issued for each program of grants to political subdivisions for a particular class of capital expenditures, to record debt service payments and receipts of amounts appropriated from the general fund under subdivision 10;\n(2) state highway bonds, to record debt service payments, receipts of amounts appropriated for debt service from the trunk highway fund pursuant to the constitution, article XIV, section 6, and additional receipts, if any, of amounts appropriated from the general fund under subdivision 10;\n(3) state bonds issued for each capital loan and for each program of capital loans to agencies or political subdivisions, to record debt service payments, receipts of loan repayments appropriated for debt service or reimbursement of debt service by the law authorizing the loan or program, and any additional receipts of amounts appropriated from the general fund under subdivision 10; and\n(4) refunding bonds, as provided in section 16A.66, subdivision 1.\n(b) All money credited, transferred, or appropriated to the state bond fund and all income from the investment of that money is appropriated to the commissioner for the payment of principal and interest on state bonds or, in the case of premium received on the sale of refunding bonds, as provided by subdivision 7, paragraph (f).\nThere is annually appropriated to the state bond fund from the general fund the amount that, added to the amount in the state bond fund on November 1 each year for state bonds issued by January 1, 1985, and the amount that added to the amount in the state bond fund on December 1 each year for state bonds issued after January 1, 1985, is needed to pay the principal of and interest on all state bonds due and to become due through July 1 in the second ensuing year. The money appropriated must be available in the state bond fund each year before the tax otherwise required by the constitution, article XI, section 7, is levied.\nUnder the constitution, article XI, section 7, the state auditor must levy each year on all taxable property within the state a tax sufficient, with the amount then on hand in the state bond fund, to pay all principal and interest on state bonds due and to become due to and including July 1 in the second ensuing year. The tax is not subject to limitation of rate or amount. However, the amount of money appropriated from other sources as provided in subdivision 10, and actually received and on hand prior to the levy in any year, reduces the amount of the tax otherwise required to be levied. The proceeds of the tax must be credited to the state bond fund.\nIf the proceeds of the tax levied under subdivision 11 are ever insufficient to make the principal and interest payments on state bonds when due, the balance must be paid out of the general fund. The amount needed to pay the balance is appropriated from the general fund to the commissioner.\nThis section applies to all state bonds issued after January 1, 1985, notwithstanding other laws relating to specific bonding programs.",
	"repealed": false
}