{
	"id": "103D.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.305",
	"title": "103D.305 INCREASING NUMBER OF MANAGERS.",
	"text": "A proceeding to increase the number of managers of a watershed district must be initiated by filing a petition with the board.\nThe petition to increase the number of managers must request the increase and be signed by one or more of the following groups:\n(1) one-half or more of the counties within the watershed district;\n(2) counties with 50 percent or more of the area within the watershed district;\n(3) a majority or greater number of the cities within the watershed district;\n(4) 50 or more resident owners residing in the watershed district, excluding resident owners within the corporate limits of a city if the city has signed the petition; or\n(5) the managers of the watershed district, by resolution adopted by a majority of the managers of the watershed district.\nWhen the board receives a petition to increase the number of managers of a watershed district, the board must order a hearing on the petition.\n(a) The board must give notice of the hearing to increase the number of managers by publication in a legal newspaper published in counties affected by the watershed district. The last publication must occur at least ten days before the hearing.\n(b) The board must give notice of the hearing by mail to the auditors of counties and to the chief executive officials of municipalities affected by the watershed district.\n(c) The notice must include:\n(1) a statement that a petition to increase the number of managers of the watershed district has been filed with the board;\n(2) a general description of the purpose of the watershed district;\n(3) a general description of the property in the watershed district;\n(4) the date, time, and location of the hearing; and\n(5) a statement that all persons affected or interested in the watershed district may attend and give statements at the hearing.\n(a) If the board determines at the hearing that an increase in the number of managers would benefit the public welfare, public interest, and the purpose of this chapter, the board must increase the number of managers. The board must make findings and an order accordingly and file a certified copy of the findings and order with the secretary of state, the auditor of each county affected by the watershed district, the director, and the watershed district. The board's order must prescribe the terms for the new managers to be appointed by the designated county board or boards.\n(b) If the watershed district affects more than one county, the board, by order, must direct the distribution of the managers among the affected counties.",
	"repealed": false
}