{
	"id": "308A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.201",
	"title": "308A.201 POWERS.",
	"text": "In addition to other powers, a cooperative as an agent or otherwise:\n(1) may perform every act and thing necessary or proper to the conduct of the cooperative's business or the accomplishment of the purposes of the cooperative;\n(2) has other rights, powers, or privileges granted by the laws of this state to other corporations, except those that are inconsistent with the express provisions of this chapter; and\n(3) has the powers given in this section.\n(a) A cooperative may buy, sell, or deal in its own products, the products of the cooperative's individual members or patrons, the products of another cooperative or association or of its members or patrons.\n(b) A cooperative may negotiate the price at which the products the cooperative is selling may be sold.\nA cooperative may enter into or become a party to a contract or agreement for the cooperative or for the cooperative's individual members or patrons, or between the cooperative and its members.\nA cooperative may purchase and hold, lease, mortgage, encumber, sell, exchange, and convey as a corporation real estate, buildings, and personal property as the business of the cooperative may require.\nA cooperative may erect buildings or other structures or facilities or the cooperative's owned or leased property, or on a right-of-way legally acquired by the cooperative.\nA cooperative may issue bonds or other evidence of indebtedness and to borrow money to finance the business of the cooperative.\nA cooperative may make advances to the cooperative's members or patrons on produce delivered by the members or patrons to the cooperative.\nA cooperative may accept deposits of money from other cooperatives or associations from which it is constituted.\nA cooperative may loan or borrow money to or from individual members, cooperatives, or associations from which it is constituted with security that it considers sufficient in dealing with the members, cooperatives, or associations.\n(a) A cooperative may purchase, acquire, hold, or dispose of the stock of another association or corporation, whether incorporated under the laws of this state or another state, and assume all rights, interests, privileges, responsibilities, and obligations arising out of the ownership of the stock.\n(b) A cooperative may acquire and hold stock in another corporation organized under the law of this state or another state of the United States, including a corporation organized:\n(1) as a federation of associations;\n(2) for the purpose of forming a district, state, or national marketing, sales, or service agency; or\n(3) for the purpose of acquiring marketing facilities at terminal or other markets in this state or other states.\n(c) A cooperative may purchase, own, and hold shares of capital stock, memberships, interests in nonstock capital, evidences of indebtedness of any domestic or foreign corporation when reasonably necessary or incidental to accomplish the purposes stated in the articles.\n(a) A cooperative may exercise any and all fiduciary powers in relations with members, cooperatives, or associations from which it is constituted.\n(b) A cooperative may take, receive, and hold real and personal property, including the principal and interest of money or other funds and rights in a contract, in trust for any purpose not inconsistent with the purposes of the cooperative in its articles, and may exercise fiduciary powers in relation to taking, receiving, and holding the real and personal property.\n(a) An electric cooperative has the power and authority to:\n(1) make loans to its members;\n(2) prerefund debt;\n(3) obtain funds through negotiated financing or public sale;\n(4) borrow money and issue its bonds, debentures, notes, or other evidence of indebtedness;\n(5) mortgage, pledge, or otherwise hypothecate its assets as may be necessary;\n(6) invest its resources;\n(7) deposit money in state and national banks and trust companies authorized to receive deposits; and\n(8) exercise all other powers and authorities granted to cooperatives.\n(b) A cooperative organized to provide rural electric power may enter agreements and contracts with other electric power cooperatives or with a cooperative constituted of electric power cooperatives to share losses and risk of losses to their transmission and distribution lines, transformers, substations, and related appurtenances from storm, sleet, hail, tornado, cyclone, hurricane, or windstorm. An agreement or contract or a cooperative formed to share losses under this paragraph is not subject to the laws of this state relating to insurance and insurance companies.\n(c) An electric cooperative, an affiliate of the cooperative formed to provide broadband, or another entity pursuant to an agreement with the cooperative or the cooperative's affiliate may use the cooperative, affiliate, or entity's existing or subsequently acquired electric transmission or distribution easements for broadband infrastructure and to provide broadband service, which may include an agreement to lease fiber capacity. To exercise rights granted under this paragraph, the cooperative must provide to the property owner on which the easement is located two written notices, at least two months apart, that the cooperative intends to use the easement for broadband purposes. The use of the easement for broadband services vests and runs with the land beginning six months after the first notice is provided under paragraph (d) unless a court action challenging the use of the easement for broadband purposes has been filed before that time by the property owner, as provided under paragraph (e). The cooperative must also file evidence of the notices for recording with the county recorder.\n(d) The cooperative's notices under paragraph (c) must be sent by first class mail to the last known address of the owner of the property on which the easement is located or by printed insertion in the property owner's utility bill. The notice must include the following:\n(1) the name and mailing address of the cooperative;\n(2) a narrative describing the nature and purpose of the intended easement use;\n(3) a description of any trenching or other underground work expected to result from the intended use, including the anticipated time frame for the work;\n(4) a telephone number of a cooperative employee to contact regarding the easement; and\n(5) the following statement, in bold red lettering: \"It is important to make any challenge by the deadline to preserve any legal rights you may have.\"\n(e) Within six months after receiving notice under paragraph (d), a property owner may commence an action seeking to recover damages for an electric cooperative's use of an electric transmission or distribution easement for broadband service purposes. If the claim for damages is under $15,000, the claim may be brought in conciliation court. Notwithstanding any other law to the contrary, the procedures and substantive matters set forth in this subdivision govern an action under this paragraph and are the exclusive means to bring a claim for compensation with respect to a notice of intent to use a cooperative transmission or distribution easement for broadband purposes. To commence an action under this paragraph, the property owner must serve a complaint upon the electric cooperative as in a civil action and file the complaint with the district court for the county in which the easement is located. The complaint must state whether the property owner (1) is challenging the electric cooperative's right to use the easement for broadband services or infrastructure as authorized under paragraph (c), (2) is seeking damages as provided under paragraph (f), or (3) both.\n(f) If the property owner is seeking damages, the electric cooperative may, at any time after answering the complaint: (1) deposit with the court administrator an amount equal to the cooperative's estimate of damages, which must be no less than $1; and (2) after making the deposit, use the electric transmission or service line easements for broadband purposes, conditioned on an obligation to pay the amount of damages determined by the court. If the property owner is challenging the electric cooperative's right to use the easement for broadband services or infrastructure as authorized under paragraph (c), after the electric cooperative answers the complaint the district court must promptly hold a hearing on the property owner's challenge. If the district court denies the property owner's challenge, the electric cooperative may proceed to make a deposit and make use of the easement for broadband service purposes, as provided under clause (2).\n(g) In an action involving a property owner's claim for damages, the landowner has the burden to prove the existence and amount of any net reduction in the fair market value of the property, considering the existence, installation, construction, maintenance, modification, operation, repair, replacement, or removal of broadband infrastructure in the easement, as well as any benefit to the property from access to broadband service. Consequential or special damages must not be awarded. Evidence of revenue, profits, fees, income, or similar benefits to the electric cooperative, the cooperative's affiliate, or a third party is inadmissible. Any fees or costs incurred as a result of an action under this subdivision must be paid by the party that incurred the fees or costs, except that the cooperative is responsible for the landowner attorney fees if the final judgment or award of damages is more than 140 percent of the cooperative's damage deposit.\n(h) Nothing in this section limits in any way an electric cooperative's existing easement rights, including but not limited to rights an electric cooperative has or may acquire to transmit communications for electric system operations or otherwise.\n(i) The placement of broadband infrastructure for use to provide broadband service under paragraphs (c) to (h) in any portion of an electric transmission or distribution easement located in the public right-of-way is subject to local government permitting and right-of-way management authority under section 237.163, and the placement must be coordinated with the relevant local government unit to minimize potential future relocations. The cooperative must notify a local government unit prior to placing infrastructure for broadband service in an easement that is in or adjacent to the local government unit's public right-of-way.\n(j) For purposes of this subdivision:\n(1) \"broadband infrastructure\" has the meaning given in section 116J.394; and\n(2) \"broadband service\" means broadband infrastructure and any services provided over the infrastructure that offer advanced telecommunications capability and Internet access.\nA cooperative that is engaged in the electrical, heat, light, power, or telephone business may exercise the power of eminent domain in the manner provided by state law for the exercise of the power by other corporations engaged in the same business.\n(a) A creamery cooperative organized in this state has the right, power, and authority to condemn lands by eminent domain for easements for sewers and sites for filtration plants to take care of all sewage and refuse made in the operation of its business. The power and authority shall be exercised as provided in chapter 117.\n(b) The establishment, maintenance, and operation of sewers or filtration plants shall be under the supervision of the chair of the community health board as defined in section 145A.02, subdivision 5, of the town or city where the cooperative has its operating plant.\nA water quality cooperative organized in this state may exercise the power of eminent domain in the manner provided by state law for the exercise of the power by corporations engaged in the provision of electric, light, heat, power, or telephone service.",
	"repealed": false
}