{
	"id": "341.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.331",
	"title": "341.331 PROHIBITED PERFORMANCE ENHANCING SUBSTANCES AND TESTING.",
	"text": "All combatants are prohibited from using the substances listed in the following classes contained in the World Anti-Doping Code published by the World Anti-Doping Agency, unless a combatant meets an applicable exception set forth therein:\n(1) S0, nonapproved substances;\n(2) S1, anabolic agents;\n(3) S2, peptide hormones, growth factors, and related substances and mimetics;\n(4) S3, beta-2 agonists;\n(5) S4, hormone and metabolic modulators; and\n(6) S5, diuretics and masking agents.\nThe commissioner may administer drug testing to discover violations of subdivision 1 as follows:\n(a) The commissioner may require a combatant to submit to a drug test to determine if substances are present in the combatant's system in violation of subdivision 1. This testing may occur at any time after the official weigh-in, on the day of the contest in which the combatant is participating, or within 24 hours of competing in a combative sports contest in a manner prescribed by the commissioner. The commissioner may require testing based on reasonable cause or random selection. Grounds for reasonable cause includes observing or receiving credible information that a combatant has used prohibited performance enhancing drugs. If testing is based on random selection, both combatants competing in a selected bout shall submit to a drug test.\n(b) Specimens may include urine, hair samples, or blood. Specimens shall be tested at a facility acceptable to the commissioner. Results of all drug tests shall be submitted directly to the commissioner.\n(c) The promoter shall pay the costs relating to drug testing combatants. Any requests for follow-up or additional testing must be paid by the combatant.\n(a) If a combatant fails to provide a sample for drug testing when required, and the request is made before a bout, the combatant shall not be allowed to compete in the bout. If the request is made after a bout, and the combatant fails to provide a sample for drug testing, the combatant shall be subject to disciplinary action under section 341.29.\n(b) If a combatant's specimen tests positive for any prohibited substances, the combatant shall be subject to disciplinary action under section 341.29.\n(c) A combatant who is disciplined and was the winner of a bout shall be disqualified and the decision shall be changed to no contest. The results of a bout shall remain unchanged if a combatant who is disciplined was the loser of the bout.",
	"repealed": false
}