{
	"id": "46.044",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.044",
	"title": "46.044 BANK CHARTERS.",
	"text": "An application for a bank charter must be granted if (1) the applicants are of good moral character and financial integrity, (2) there is a reasonable public demand for this bank in this location, (3) the probable volume of business in this location is sufficient to insure and maintain the solvency of the new bank and the solvency of the then existing bank or banks in the locality without endangering the safety of any bank in the locality as a place of deposit of public and private money, (4) the commissioner of commerce is satisfied that the proposed bank will be properly and safely managed, and (5) the commissioner is satisfied that the capital funds required pursuant to section 48.02 are available and the commissioner may accept any reasonable demonstration including subscription agreements supported by current financial statements. If the application does not satisfy the requirements of this subdivision, it must be denied. In case of the denial of the application, the commissioner of commerce shall specify the grounds for the denial. A person aggrieved may obtain judicial review of the determination in accordance with chapter 14.\nIf a bank charter is not activated within 18 months from the date of the order, the approval order automatically expires. Upon request of the applicant prior to the automatic expiration date of the order, the commissioner may grant reasonable extensions of time to the applicant to activate the facility as the commissioner deems necessary. The extensions of time shall not exceed a total of an additional 12 months. If the commissioner's order is the subject of an appeal in accordance with chapter 14, the time period referred to in this section for activation of the bank charter and any extensions shall begin when all appeals or rights of appeal from the commissioner's order have concluded or expired.\nFor purposes of applications to organize and operate special purpose banks as defined in section 46.046, subdivision 5, the conditions in subdivision 1, clauses (2) and (4), do not apply.",
	"repealed": false
}