{
	"id": "256B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.08",
	"title": "256B.08 APPLICATION.",
	"text": "An applicant for medical assistance, or a person acting in the applicant's behalf, shall file an application with a local agency in the manner and form prescribed by the state agency. When a married applicant resides in a nursing home or applies for medical assistance for nursing home services, the local agency shall consider an application on behalf of the applicant's spouse only upon specific request of the applicant or upon specific request of the spouse and separate filing of an application.\nA pregnant woman who may be eligible for assistance under section 256B.055, subdivision 1, must receive an appointment for eligibility determination no later than five working days from the date of her request for assistance from the local agency. The local agency shall expedite processing her application for assistance and shall make a determination of eligibility on a completed application no later than ten working days following the applicant's initial appointment. The local agency shall assist the applicant to provide all necessary information and documentation in order to process the application within the time period required under this subdivision. The state agency shall provide for the placement of applications for medical assistance in eligible provider offices, community health offices, and Women, Infants and Children (WIC) program sites.\nThe local agency must establish locations, other than those used to process applications for cash assistance, to receive and perform initial processing of applications for pregnant women and children who want medical assistance only. At a minimum, these locations must be in federally qualified health centers and in hospitals that receive disproportionate share adjustments under section 256.969, subdivision 8, except that hospitals located outside of this state that receive the disproportionate share adjustment are not included. Initial processing of the application need not include a final determination of eligibility. Local agencies shall designate a person or persons within the agency who will receive the applications taken at an outreach location and the local agency will be responsible for timely determination of eligibility.\nThe commissioner shall accept data from the Social Security Administration in accordance with United States Code, title 42, section 1396U-5(a).",
	"repealed": false
}