{
	"id": "322C.0407",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0407",
	"title": "322C.0407 MANAGEMENT OF LIMITED LIABILITY COMPANY.",
	"text": "Except as provided in section 322C.1101, subdivision 5, with respect to nonprofit limited liability companies, a limited liability company is a member-managed limited liability company unless the operating agreement:\n(1) expressly provides that:\n(i) the company is or will be \"manager-managed\" or \"board-managed\";\n(ii) the company is or will be \"managed by managers\" or \"managed by a board\"; or\n(iii) management of the company is or will be \"vested in managers\" or \"vested in a board\"; or\n(2) includes words of similar import.\nIn a member-managed limited liability company, the following rules apply:\n(1) The management and conduct of the company are vested in the members.\n(2) Each member has equal rights in the management and conduct of the company's activities.\n(3) A difference arising among members as to a matter in the ordinary course of the activities of the company may be decided by a majority of the members.\n(4) An act outside the ordinary course of the activities of the company may be undertaken only with the consent of all members.\n(5) The operating agreement may be amended only with the consent of all members.\nIn a manager-managed limited liability company, the following rules apply:\n(1) Except as otherwise expressly provided in this chapter, any matter relating to the activities of the company is decided exclusively by the managers.\n(2) Each manager has equal rights in the management and conduct of the activities of the company.\n(3) A difference arising among managers as to a matter in the ordinary course of the activities of the company may be decided by a majority of the managers.\n(4) The consent of all members is required to:\n(i) sell, lease, exchange, or otherwise dispose of all, or substantially all, of the company's property, with or without the good will, outside the ordinary course of the company's activities;\n(ii) approve a merger, conversion, or domestication under sections 322C.1001 to 322C.1015;\n(iii) undertake any other act outside the ordinary course of the company's activities; and\n(iv) amend the operating agreement.\n(5) A manager may be chosen at any time by the consent of a majority of the members and remains a manager until a successor has been chosen, unless the manager at an earlier time resigns, is removed, or dies, or, in the case of a manager that is not an individual, terminates. A manager may be removed at any time by the consent of a majority of the members without notice or cause.\n(6) A person need not be a member to be a manager, but the dissociation of a member that is also a manager removes the person as a manager. If a person that is both a manager and a member ceases to be a manager, that cessation does not by itself dissociate the person as a member.\n(7) A person's ceasing to be a manager does not discharge any debt, obligation, or other liability to the limited liability company or members which the person incurred while a manager.\nIn a board-managed limited liability company, the following rules apply:\n(1) The activities and affairs of a limited liability company are to be managed by and under the direction of a board of governors, which shall consist of one or more governors as determined by members holding a majority of the voting power of the members. Except as specifically stated in this subdivision and section 322C.0202, subdivision 5, subject to section 322C.0302:\n(i) the board acts only through an act of the board;\n(ii) no individual governor has any right or power to act for the limited liability company; and\n(iii) only officers, managers, or other agents designated by the board or through a process approved by the board have the right to act for the limited liability company, and that right extends only to the extent consistent with the terms of the designation.\n(2) A governor must be a natural person. A person need not be a member to be a governor, but the dissociation of a member who is also a governor disqualifies the person as a governor. If a person who is both a governor and a member ceases to be a governor, that cessation does not by itself dissociate the person as a member. A person's ceasing to be a governor does not discharge any debt, obligation, or other liability to the limited liability company or members which the person incurred while a governor.\n(3) The method of election and any additional qualifications for governors will be as determined by members holding a majority of the voting power of the members. Governors are elected by a plurality of the voting power present and entitled to vote on the election of governors at a duly called or held meeting at which a quorum is present.\n(4) A member may waive notice of a meeting for the election of governors. A member's waiver of notice under this clause is effective whether given before, at, or after the meeting, and whether given in a record, orally, or by attendance. Attendance by a member at a meeting for election of governors is a waiver of notice of that meeting, except where the member objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened and does not participate in the meeting after the objection.\n(5) Once elected, a governor holds office for the term for which the governor was elected and until a successor is elected, or until the earlier death, resignation, disqualification, or removal of the governor. A governor may resign at any time. A governor may be removed at any time, without cause and without advance notice, by a majority of the voting power of all of the members. The existence of vacancies does not affect the power of the board to function if at least one governor remains in office.\n(6) When a vacancy occurs, the limited liability company shall immediately notify all members in a record of the vacancy, stating the cause of the vacancy and the date the notice is sent. Within 30 days of that date, the members may fill the vacancy in the same method the members may elect governors under clause (3). If the vacancy is not filled by the members under this clause, the vacancy may be filled by the affirmative vote of a majority of the remaining governors, even though less than a quorum.\n(7) The board shall meet from time to time as determined by members holding a majority of the voting power of the members, at a place decided by the board. If the day or date, time, and place of a board of governors meeting have been provided in a board resolution, or announced at a previous meeting of the board of governors, no notice is required. Notice of an adjourned meeting need not be given other than by announcement at the meeting at which adjournment is taken. If notice is required for a meeting, notice shall be made in the manner stated in clause (8).\n(8) A governor may call a board meeting by giving at least ten days' notice in a record to all governors of the date, time, and place of the meeting. The notice need not state the purpose of the meeting. As to each governor, the notice is effective when given.\n(i) Notice may be:\n(A) mailed to the governor at an address designated by the person or at the last known address of the person;\n(B) deposited with a nationally recognized overnight delivery service for overnight delivery or, if overnight delivery to the governor is not available, for delivery as promptly as practicable to the governor at an address designated by the governor or at the last known address of the governor;\n(C) communicated to the governor orally;\n(D) handed to the governor;\n(E) given by facsimile communication, electronic mail, or any other form of electronic communication, if the governor has consented in a record to receive notice by such means; or\n(F) by any other means determined by members holding a majority of the voting power of the members.\n(ii) The notice is deemed given if by:\n(A) mail, when deposited in the United States mail with sufficient postage affixed;\n(B) deposit for delivery, when deposited for delivery as provided in item (i), subitem (B), with delivery charges prepaid or otherwise provided for by the sender;\n(C) facsimile communication, when directed to a telephone number at which the governor has consented in a record to receive notice;\n(D) electronic mail, when directed to an electronic mail address at which the governor has consented in a record to receive notice; and\n(E) any other form of electronic communication by which the governor has consented in a record to receive notice, when directed to the governor.\n(9) A governor may waive notice of a meeting of the board of governors. A waiver of notice by a governor entitled to notice is effective whether given before, at, or after the meeting, and whether given in a record, orally, or by attendance. Attendance by a governor at a meeting is a waiver of notice of that meeting, except where the governor objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened and does not participate in the meeting after the objection.\n(10) A majority of the governors currently holding office is a quorum for the transaction of business. When a quorum is present at a duly called or held meeting of the board, the vote of a majority of the directors present constitutes an act of the board. If a quorum is present when a duly called or held meeting is convened, the governors present may continue to transact business until adjournment, even though the withdrawal of a number of governors originally present leaves less than the proportion or number otherwise required for a quorum.\n(11) Any meeting among governors may be conducted solely by one or more means of remote communication through which all of the governors may participate with each other during the meeting, if the number of governors participating in the meeting would be sufficient to constitute a quorum. Participation in a meeting by that means constitutes presence in person at the meeting.\n(12) A governor may participate in a board of governors meeting by means of remote communication, through which the governor, other governors so participating, and all governors physically present at the meeting may participate with each other during the meeting. Participation in a meeting by that means constitutes presence in person at the meeting.\n(13) An action required or permitted to be taken at a board meeting may be taken by written action signed by the number of governors that would be required to take the same action at a meeting of the board of governors at which all governors were present. The written action is effective when signed by the required number of governors, unless a different effective time is provided in the written action. When written action is permitted to be taken by less than all governors, all governors must be notified immediately of its text and effective date. Failure to provide the notice does not invalidate the written action. A governor who does not sign or consent to the written action has no liability for the action or actions taken by the written action.\n(14) If the board designates a person as \"chief manager,\" \"president,\" \"chief executive officer,\" \"CEO,\" or another title of similar import, that person shall:\n(i) serve as an agent of the limited liability company at the will of the board, without prejudice to any rights the person may have under a contract with the limited liability company;\n(ii) have general active management of the business of the limited liability company, subject to the supervision and control of the board;\n(iii) see that all orders and resolutions of the board of governors are carried into effect;\n(iv) sign and deliver in the name of the limited liability company any deeds, mortgages, bonds, contracts, or other instruments pertaining to the business of the limited liability company, except in cases in which the authority to sign and deliver is required by law to be exercised by another person or is expressly delegated by the board of governors to some other officer or agent of the limited liability company;\n(v) maintain records of and, whenever necessary, certify all proceedings of the board of governors and the members; and\n(vi) perform other duties prescribed by the board of governors.\n(15) If the board designates a person as \"treasurer,\" \"chief financial officer,\" \"CFO,\" or another title of similar import, that person shall:\n(i) serve as an agent of the limited liability company at the will of the board, without prejudice to any rights the person may have under a contract with the limited liability company;\n(ii) keep accurate financial records for the limited liability company;\n(iii) deposit all money, drafts, and checks in the name of and to the credit of the limited liability company in the banks and depositories designated by the board of governors;\n(iv) endorse for deposit all notes, checks, and drafts received by the limited liability company as ordered by the board of governors, making proper vouchers for them;\n(v) disburse limited liability company funds and issue checks and drafts in the name of the limited liability company, as ordered by the board of governors;\n(vi) give to the chief executive officer and the board of governors, whenever requested, an account of all transactions by the chief financial officer and of the financial condition of the limited liability company; and\n(vii) perform other duties prescribed by the board of governors or by the chief executive officer.\n(16) The consent of all members is required to:\n(i) sell, lease, exchange, or otherwise dispose of all, or substantially all, of the company's property, with or without the good will, outside the ordinary course of the company's activities, provided that member consent is not required for:\n(A) the grant of a security interest in all or substantially all of the company's property and assets, whether or not in the usual and regular course of its business; or\n(B) transfer of any or all of the company's property to an organization all the ownership interests of which are owned directly or indirectly through wholly owned organizations, by the company;\n(ii) approve a merger, conversion, or domestication under sections 322C.1001 to 322C.1015; and\n(iii) amend the operating agreement.\n(17) Subject to section 322C.1204, subdivision 3, for purposes of this subdivision, each member possesses voting power in proportion to the member's interest in distributions of the limited liability company prior to dissolution and a majority of the voting power of the members is a quorum at a meeting of the members.\nAny member may demand a meeting of the members to take action requiring consent of members under this chapter upon not less than 20 days' notice to each member in a record of the date and time of the meeting. Any meeting held upon member notice shall be held at the limited liability company's principal place of business if located within this state, and at the registered office if the principal place of business is not located within the state. Any action requiring the consent of members under this chapter may be taken or approved without a meeting by the written consent of the members holding the voting power required to take such action at a duly called meeting at which all members were present. A member may appoint a proxy or other agent to consent or otherwise act for the member by signing an appointing record, personally or by the member's agent.\nThe dissolution of a limited liability company does not affect the applicability of this section. However, a person that wrongfully causes dissolution of the company loses the right to participate in management in any capacity.\nThis chapter does not entitle a member to remuneration for services performed for a member-managed limited liability company, except for reasonable compensation for services rendered in winding up the activities of the company.",
	"repealed": false
}