{
	"id": "302A.431",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.431",
	"title": "302A.431 REGULAR MEETINGS OF SHAREHOLDERS.",
	"text": "Regular meetings of shareholders may be held on an annual or other less frequent periodic basis, but need not be held unless required by the articles or bylaws or by subdivision 2.\nIf a regular meeting of shareholders has not been held during the immediately preceding 15 months, a shareholder or shareholders holding three percent or more of the voting power of all shares entitled to vote may demand a regular meeting of shareholders by written notice of demand given to the chief executive officer or the chief financial officer of the corporation. Within 30 days after receipt of the demand by one of those officers, the board shall cause a regular meeting of shareholders to be called and held on notice no later than 90 days after receipt of the demand, all at the expense of the corporation. If the board fails to cause a regular meeting to be called and held as required by this subdivision, the shareholder or shareholders making the demand may call the regular meeting by giving notice as required by section 302A.435, all at the expense of the corporation.\nA regular meeting, if any, shall be held on the day or date and at the time and place fixed by, or in a manner authorized by, the articles or bylaws, except that a meeting called by or at the demand of a shareholder pursuant to subdivision 2 shall be held in the county where the principal executive office of the corporation is located. To the extent authorized in the articles or bylaws, the board of directors may determine that a regular meeting of the shareholders shall be held solely by means of remote communication in accordance with section 302A.436, subdivision 2.\nAt each regular meeting of shareholders there shall be an election of qualified successors for directors who serve for an indefinite term or whose terms have expired or are due to expire within six months after the date of the meeting. No other particular business is required to be transacted at a regular meeting. Any business appropriate for action by the shareholders may be transacted at a regular meeting.",
	"repealed": false
}