{
	"id": "296A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.17",
	"title": "296A.17 AVIATION REFUND.",
	"text": "Any person claiming to be entitled to any refund or credit provided for in subdivision 3 shall receive the refund or credit upon filing with the commissioner a claim in such form and manner prescribed by the commissioner. The claim shall set forth, among other things, the total number of gallons of aviation gasoline or special fuel for aircraft use upon which the claimant has directly or indirectly paid the excise tax provided for in this chapter, during the calendar year, which has been received, stored, or withdrawn from storage by the claimant in this state and not sold or otherwise disposed of to others. All claims for refunds under this subdivision shall be made on or before April 30 following the end of the calendar year for which the refund is claimed.\n(a) Any person who buys aviation gasoline or special fuel for aircraft use and who has paid the excise taxes directly or indirectly through the amount of the tax being included in the price, or otherwise, who does not use it in motor vehicles or receive, sell, store, or withdraw it from storage for the purpose of producing or generating power for propelling aircraft, shall be reimbursed and repaid the amount of the tax paid upon filing with the commissioner a claim in the form and manner prescribed by the commissioner. The claim shall state the total amount of the aviation gasoline or special fuel for aircraft use purchased and used by the applicant, and shall state when and for what purpose it was used. On being satisfied that the claimant is entitled to payment, the commissioner shall approve the claim and transmit it to the commissioner of management and budget. The postmark on the envelope in which a written claim is mailed determines the date of filing.\n(b) If a claim contains an error in preparation in computation or preparation, the commissioner is authorized to adjust the claim in accordance with the evidence shown on the claim or other information available to the commissioner.\n(c) An applicant who files a claim that is false or fraudulent, is subject to the penalties provided in section 296A.23 for knowingly and willfully making a false claim.\nAny person who has directly or indirectly paid the excise tax on aviation gasoline or special fuel for aircraft use provided for by this chapter and has either paid the airflight property tax under section 270.072 or is an aerial applicator with a category B, general aerial license, under section 18B.33, shall, as to all such aviation gasoline and special fuel received, stored, or withdrawn from storage by the person in this state in any calendar year and not sold or otherwise disposed of to others, or intended for sale or other disposition to others, on which such tax has been so paid, be entitled to the following graduated reductions in such tax for that calendar year, to be obtained by means of the following refunds:\n(1) on each gallon of aviation gasoline or special fuel up to 50,000 gallons, all but five cents per gallon;\n(2) on each gallon of aviation gasoline or special fuel above 50,000 gallons and not more than 150,000 gallons, all but two cents per gallon;\n(3) on each gallon of aviation gasoline or special fuel above 150,000 gallons and not more than 200,000 gallons, all but one cent per gallon;\n(4) on each gallon of aviation gasoline or special fuel above 200,000, all but one-half cent per gallon.\nIf any distributor or other person, with intent to unlawfully secure any refund provided for in subdivision 3, shall knowingly file a false or fraudulent claim, there is imposed upon the person a penalty in an amount equal to 50 percent of the amount of the refund unlawfully secured, in addition to that amount. The penalty imposed by this subdivision shall be collected as part of the tax.\nThere is appropriated to the persons entitled to refund under this section, from the fund or account in the state treasury to which the money was credited, an amount sufficient to make the credit or refund. All money in excess of the amount the commissioner certifies is reasonably required for the refunds must be transferred by the commissioner of management and budget to the state airports fund.",
	"repealed": false
}