{
	"id": "383C.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.072",
	"title": "383C.072 LAND INVESTMENT BOARD.",
	"text": "The St. Louis County Board of Land Investment consisting of the members of the St. Louis County Board of Commissioners is established. The Board of Land Investment shall have responsibility to accelerate the county's forestry land management program and to provide operational support and supervision to a broad range of forest projects.\nThe Board of Land Investment may establish a land investment department to carry out the objectives established by the Land Investment Board.\nThe department shall be administered by the land commissioner appointed under section 282.13 but shall be separate from the land department which is also under the direction of the land commissioner.\nThe purposes of the Land Investment Board are:\n(a) to intensify land management activities on county administered tax-forfeited peat and forest lands;\n(b) to achieve an intensified land management program by using the talents of the excess skilled labor available in the region;\n(c) to invest in the economic future of the region by using the full potential of the land resource;\n(d) to conduct, but not be limited to, projects including peat development, reforestation, timber stand improvement, timber management, development of recreation and wildlife facilities, forest road construction, and boundary line and corner establishment;\n(e) to ensure that the projects use the latest state of the art technology; and\n(f) to conduct, contract for, or use joint powers to accomplish the surveys, studies, or research, as needed to encourage or test the feasibility of new programs or markets to use the land resources to their optimum.\nThe Board of Land Investment may:\n(a) enter into contracts with or employ technical experts, agents, and employees, permanent and temporary, as it may require, and determine their qualifications, duties, and compensation;\n(b) delegate to one or more of its agents or employees the powers or duties it deems proper;\n(c) accept grants, loans, gifts, services, or other assistance from the federal or state government or any private individual or organization to accomplish its purposes; and\n(d) enter into contracts with individuals or organizations to perform land management activities, including tract site preparation, road construction, or maintenance.\nThe land commissioner may hire employees with the approval of the Land Investment Board to carry out the duties of the land investment department. Notwithstanding sections 383C.03 to 383C.056, all positions created in the land investment department shall be in the unclassified service and the employees shall serve at the pleasure of the Land Investment Board. The positions will be assigned to the collective bargaining unit to which the position would be assigned if the position were in the classified service. On January 1, 1988, all the positions shall become part of the classified service and all persons holding the positions shall become subject to sections 383C.03 to 383C.056, as though they had been originally appointed to the classified service. Seniority shall be computed from the date of employment whether before or after January 1, 1988. Positions within the land investment department shall continue to be separate from positions in the St. Louis County land department for all purposes, including seniority rights.\nNotwithstanding subdivision 6, the position of assistant commissioner of land investment shall remain in the unclassified service.\nIf the Board of Land Investment determines that a tract is stocked with nonindustrial, low quality timber that has little or no value, section 282.04, as it relates to timber sales, shall not apply to land management activities including site preparation, conducted under the authority of the board.\nReceipts from salvage materials generated by site preparation activities conducted under the authority of this chapter shall be paid into the forfeited tax sale fund.",
	"repealed": false
}