{
	"id": "299C.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.61",
	"title": "299C.61 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 299C.60 to 299C.64.\n\"Authorized agency\" means the licensing agency or, if one does not exist, the Bureau of Criminal Apprehension. Licensing agencies include but are not limited to the:\n(1) Department of Human Services;\n(2) Department of Health; and\n(3) Professional Educator Licensing and Standards Board.\n\"Background check crime\" includes child abuse crimes, murder, manslaughter, felony level assault or any assault crime committed against a minor or vulnerable adult, kidnapping, arson, criminal sexual conduct, and prostitution-related crimes.\n\"Care\" means the provision of care, treatment, education, training, instruction, supervision, or recreation to children, the elderly, or individuals with disabilities.\n\"Child\" means an individual under the age of 18.\n\"Child abuse crime\" means:\n(1) an act committed against a minor victim that constitutes a violation of section 609.185, paragraph (a), clause (5); 609.221; 609.222; 609.223; 609.224; 609.2242; 609.322; 609.324; 609.342; 609.343; 609.344; 609.345; 609.352; 609.377; 609.378; 617.246; or 617.247; or\n(2) a violation of section 152.021, subdivision 1, clause (4); 152.022, subdivision 1, clause (5) or (6); 152.023, subdivision 1, clause (3) or (4); 152.023, subdivision 2, clause (4) or (6); or 152.024, subdivision 1, clause (2), (3), or (4).\n\"Children's service provider\" means a business or organization, whether public, private, for profit, nonprofit, or voluntary, that provides children's services, including a business or organization that licenses or certifies others to provide children's services. \"Children's service provider\" includes an international student exchange visitor placement organization under chapter 5A.\n\"Children's service worker\" means a person who has, may have, or seeks to have access to a child to whom the children's service provider provides children's services, and who:\n(1) is employed by, volunteers with, or seeks to be employed by or volunteer with a children's service provider;\n(2) is an independent contractor who provides children's services to a children's service provider; or\n(3) owns, operates, or seeks to own or operate a children's service provider.\n\"Children's services\" means the provision of care, treatment, education, training, instruction, or recreation to children.\n[Repealed, 2009 c 59 art 6 s 25]\n\"Conviction\" means a criminal conviction or an adjudication of delinquency for an offense that would be a crime if committed by an adult.\n\"Covered individual\" means an individual:\n(1) who has, seeks to have, or may have access to children, the elderly, or individuals with disabilities, served by a qualified entity; and\n(2) who:\n(i) is employed by or volunteers with, or seeks to be employed by or volunteer with, a qualified entity; or\n(ii) owns or operates, or seeks to own or operate, a qualified entity.\n\"Individuals with disabilities\" means persons with a mental or physical impairment who require assistance to perform one or more daily living tasks.\n\"National criminal history background check system\" means the criminal history record system maintained by the Federal Bureau of Investigation based on fingerprint identification or any other method of positive identification.\n\"Qualified entity\" means a business or organization, whether public, private, for-profit, not-for-profit, or voluntary, that provides care or care placement services, including a business or organization that licenses or certifies others to provide care or care placement services.\n\"Superintendent\" means the superintendent of the Bureau of Criminal Apprehension.",
	"repealed": false
}