{
	"id": "93.003",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.003",
	"title": "93.003 IRON MINING; CONDITIONS.",
	"text": "Legal authority to mine and process iron ore, a basic irreplaceable natural resource of the people of the state of Minnesota, is subject to the conditions of this section. When the owner or operator of an iron mine or related production or beneficiation facilities determines to discontinue the operation of the mine or facilities for any reason it shall maintain the mine or facilities in salable operating condition for at least two years after it discontinues operation in order to allow the state of Minnesota and other interested public and private bodies to seek a new owner and operator. The requirement imposed by this section is a preliminary and permanent requirement on the right of an owner to commence or continue the operation of an iron mine or related facilities. This requirement is enforceable on all owners and operators and successors of owners and operators and shall be enforced by the state in any action in bankruptcy or other litigation that may affect it.\nAt least 60 days before the owner or operator of an iron mine or related production or beneficiation facilities determines to discontinue the operation of the mine or facilities, it shall submit a temporary maintenance plan to the state for approval. The plan must provide for:\n(1) the orderly shutdown of the mine and facilities, including:\n(i) movement of all mobile equipment to an area above the high-water mark;\n(ii) drainage of water from all bins, mills, thickeners, storage tanks, water lines, and slurry lines; and\n(iii) the emptying and cleaning of all tailings handling equipment, including thickeners, pipes, belts, and bins;\n(2) health, safety, and security, including:\n(i) security of any blasting materials and hazardous materials;\n(ii) provisions for fire prevention; and\n(iii) staffing for security;\n(3) maintenance of mine, plant facilities, and tailing basins, including:\n(i) supplying heat or cooling where needed;\n(ii) maintenance of utility lines needed to support the property;\n(iii) maintenance of mills, grates, kilns, coolers, and other machinery in running condition;\n(iv) taking dust prevention measures; and\n(v) maintenance of tailings dikes, water level controls, water runoff control structures, and erosion controls;\n(4) compliance with all permit requirements; and\n(5) a schedule for reporting periodically to the state on all maintenance activities and any plans to liquidate assets.",
	"repealed": false
}