{
	"id": "187.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/187.06",
	"title": "187.06 ESTABLISHMENT OF SECURE CHOICE TRUST AND ADMINISTRATIVE FUND; EMPLOYEE ACCOUNTS; INVESTMENTS.",
	"text": "The Secure Choice trust is established as an instrumentality of the state to hold employee payroll deduction contributions and earnings on the contributions. The board must appoint a financial institution to act as trustee or custodian. The trustee or custodian must manage and administer trust assets for the exclusive purposes of providing benefits and defraying reasonable expenses of administering the program.\n(a) The Secure Choice administrative fund is established in the state treasury as a fund separate and apart from the Secure Choice trust.\n(b) The board of directors may assess administrative fees on each covered employee's account to be applied toward the expenses of administering the program. Money in the administrative fund is appropriated to the board to pay administrative expenses of administering the program if fees from the trust are not sufficient to cover expenses. The board must determine which administrative expenses will be paid using money in the administrative fund and which administrative expenses will be paid using money in the trust in the exercise of its fiduciary duty.\n(c) The board may receive and deposit into the administrative fund any gifts, grants, donations, loans, appropriations, or other moneys designated for the administrative fund from the state, any unit of federal or local government, any other entity, or any person.\n(d) Any interest or investment earnings that are attributable to money in the administrative fund must be deposited into the administrative fund.\nThe trustee or custodian, as applicable, must maintain an account for employee payroll deduction contributions with respect to each covered employee. Interest and earnings on the amount in the account are credited to the account and losses are deducted.\nThe board must make available for investment a diversified array of investment funds selected by the State Board of Investment. Members of the board, the executive director and members of the State Board of Investment, and all other fiduciaries are relieved of fiduciary responsibility for investment losses resulting from a covered employee's investment directions. Each covered employee is entitled to direct the investment of the contributions credited to the covered employee's account in the trust and earnings on the contributions into the array of investment funds selected by the State Board of Investment.\nThe board must designate a default investment fund that is diversified to minimize the risk of large losses and consists of target date funds, a balanced fund, a capital preservation fund, or any combination of the foregoing funds. Accounts for which no investment direction has been given by the covered employee must be invested in the default investment fund. Members of the board, the executive director of the State Board of Investment, and all other fiduciaries are relieved of fiduciary duty with regard to investment of assets in the default investment fund.\nNo account under the program is subject to assignment or alienation, either voluntarily or involuntarily, or to the claims of creditors, except as provided in section 518.58.\nThe assets of the Secure Choice trust shall be preserved, invested, and expended solely for the purposes of the trust and no property rights in the trust assets shall exist in favor of the state or any covered employer. The assets of the Secure Choice trust shall not be transferred or used by the state for any purpose other than the purposes of the trust, including reasonable administrative expenses of the program. Amounts deposited in the trust shall not constitute property of the state and shall not be commingled with state funds, and the state shall have no claim to or against, or interest in, the assets of the Secure Choice trust.",
	"repealed": false
}