{
	"id": "363A.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.331",
	"title": "363A.331 ACTIONS INVOLVING ARCHITECTURAL BARRIERS THAT LIMIT ACCESSIBILITY.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Accessibility requirements under law\" means requirements governing removal of architectural barriers that limit access to business establishments or public accommodations by persons with disabilities under the following laws or rules:\n(1) section 363A.11, subdivision 3, clause (4) or (5);\n(2) United States Code, title 42, section 12182, paragraph (b), clause (2), subparagraph (A), subclause (iv) or (v); or\n(3) Code of Federal Regulations, title 28, section 36.304 or 36.305.\n(c) \"Certified professional\" means a licensed, registered, or otherwise certified professional with demonstrated knowledge of accessibility requirements under law.\n(a) Before bringing a civil action under section 363A.33, a person who is an attorney or is represented by an attorney and who alleges that a business establishment or place of public accommodation has violated accessibility requirements under law must provide a notice of architectural barrier consistent with subdivision 3. The notice of architectural barrier must be dated and must:\n(1) cite the law alleged to be violated;\n(2) identify each architectural barrier that is the subject of an alleged violation and specify its location on the premises;\n(3) provide a reasonable time for a response, which may not be less than 60 days; and\n(4) comply with subdivision 3.\n(b) A notice described in paragraph (a) must not include a request or demand for money or an offer or agreement to accept money, but may offer to engage in settlement negotiations before litigation.\n(c) A civil action may not be brought before expiration of the period to respond provided in the notice under paragraph (a), clause (3). Subject to paragraph (d), a civil action may be brought after the response time provided in the notice.\n(d) If, within the response time provided under paragraph (a), clause (3), the business establishment or place of public accommodation indicates in writing an intent to remove the barrier but can demonstrate that weather prevents a timely removal, a civil action may not be brought before 30 days after the date of the response time in the notice, provided the business establishment or place of public accommodation specifies in writing the steps that will be taken to remove the barrier and the date by which the barrier will be removed.\nIf a person who is not represented by an attorney retains an attorney within 60 days after a civil action under section 363A.33 is brought, the attorney must provide a dated notice to the defendant that includes the items required under subdivision 2, paragraph (a), clauses (1) and (2), and the accessibility audit portion of the form under subdivision 3. The notice must include additional time for the defendant to serve an answer to the complaint or amend a previous answer to the complaint, which must be at least 60 days after the date of the notice or service of the complaint, whichever is later. If the civil action has not been filed with the court, the action must not be filed until expiration of the time provided for in the notice. The time period for serving an answer to the complaint under rule 12 of the Rules of Civil Procedure and proceedings under the complaint are stayed for the period of time specified in the notice.\nA notice of an architectural barrier must be in the following, or a substantially similar, form:\n\"This notice is to advise you of a claim that [insert name of business establishment or place of public accommodation] is in violation of the Americans with Disabilities Act and/or the Minnesota Human Rights Act for failure to remove one or more architectural barriers limiting access to the premises by persons with disabilities.\nAllegation of Violation\nThe undersigned attorney represents [insert client's name or organization], who alleges that [insert name of business establishment or place of public accommodation] is in violation of [insert citation of all statute(s) and rule(s) alleged to be violated] because [insert client's name] attempted on [insert date(s)] to access [insert name of business establishment or place of public accommodation] but was unable to or was deterred from doing so due to the following architectural barrier or barriers limiting access by persons with disabilities: [insert description of each architectural barrier that is the subject of the alleged violation and its location on the premises].\nAccessibility Audit\nLicensed, registered, or otherwise certified professionals with knowledge of the Americans with Disabilities Act and Minnesota Human Rights Act requirements regarding physical barriers to access may be available to conduct an audit of your business establishment or place of public accommodation to advise you regarding compliance with the law. For more information, contact the Minnesota State Council on Disability at 1-800-945-8913 or visit MSCOD's website at http://www.disability.state.mn.us.\nResponse\nPlease contact, or have your attorney contact, the undersigned attorney no later than [insert date by which response is required] to provide a response or if you would like to engage in prelitigation settlement negotiations. Failure to respond to this notice may result in a lawsuit being filed against you.\"\n(a) In a civil action brought against a business establishment or place of public accommodation for violation of accessibility requirements under law, the defendant has an affirmative defense to the action if the defendant demonstrates that:\n(1) the architectural barrier has been removed in a manner that complies with accessibility requirements under law;\n(2) compliance with the accessibility requirements under law is not readily achievable or cannot be accomplished by alternative means; or\n(3) the alleged architectural barrier does not violate accessibility requirements under law.\n(b) In a civil action brought against a business establishment or place of public accommodation for violation of accessibility requirements under law, a plaintiff challenging a finding in an audit, performed by a certified professional, that an alleged architectural barrier complies with accessibility requirements under law, or that compliance is not readily achievable or alternative means cannot be employed, has the burden to show that the architectural barrier does not comply with those accessibility requirements or that compliance is readily achievable or can be accomplished by alternative means.\n(a) Subdivisions 2 and 3 do not apply to:\n(1) a person who is not an attorney and is not represented by an attorney;\n(2) attorneys representing the state or a political subdivision of the state; or\n(3) a person who is challenging a finding contained in an audit prepared by a certified professional.\n(b) This section does not affect the right of a person to file a charge with the commissioner or the right of a person who has filed a charge to bring a civil action authorized under section 363A.33, subdivision 1.",
	"repealed": false
}