{
	"id": "86B.820",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.820",
	"title": "86B.820 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 86B.820 to 86B.920.\n\"Commissioner\" means the commissioner of natural resources.\n\"Dealer\" means a person who: (1) is in the business of manufacturing, distributing, selling, or purchasing new or used watercraft; (2) has an established place of business for the sale, trade, and display of watercraft; and (3) possesses watercraft for the purpose of sale or trade.\n\"Department\" means the Department of Natural Resources.\n\"Deputy registrar\" means a person appointed or hired by the commissioner of public safety under section 168.33.\n\"Manufacturer\" means a person engaged in the business of constructing or assembling watercraft required to have a certificate of title.\n\"Manufacturer's or importer's certificate of origin\" means a certificate with the authorized signature of the manufacturer or importer of a watercraft, describing and identifying the watercraft, giving the name and address of the person to whom the watercraft is first sold by the manufacturer or importer, and containing executed assignments of the watercraft to an applicant for a certificate of title on the watercraft in this state.\n\"Owner\" means a person, other than a secured party, having the title to a watercraft. \"Owner\" includes a person entitled to use or possess the watercraft, subject to a security interest in another person, reserved or created by agreement and securing payment of performance of an obligation, but \"owner\" does not include a lessee under a lease not intended as security.\n\"Person\" means an individual, firm, partnership, association, corporation, or governmental organization.\n\"Secured party\" means a secured party as defined in section 336.9-102(a)(73), having a security interest in a watercraft and includes a lienholder.\n\"Security agreement\" has the meaning given it in section 336.9-102(a)(74).\n\"Security interest\" has the meaning given it in section 336.1-201(b)(35), and includes statutory liens for which lien statements are filed.\n\"Titled watercraft\" means a watercraft required to have a certificate of title under section 86B.825, subdivision 1; a watercraft for which a certificate of title has been issued under section 86B.825, subdivision 3; or a watercraft previously issued a certificate of title or similar document from another jurisdiction.\n\"Watercraft\" means a device used or designed for navigation on water that is greater than 16 feet in length, as defined in section 86B.005, subdivision 6, but does not include:\n(1) a row-type fishing boat of single hull construction, with oar locks and an outboard motor capacity rating of less than 40 horsepower;\n(2) a canoe;\n(3) a kayak;\n(4) a rowing shell or scull;\n(5) a ship's lifeboat;\n(6) a vessel of at least five net tons measured in Code of Federal Regulations, title 46, part 69, that is documented under Code of Federal Regulations, title 46, subpart 67.01; or\n(7) a seaplane.\n\"Waters of this state\" means waters capable of substantial public use and waters to which the public has access, that are within the territorial limits of this state, including boundary waters.",
	"repealed": false
}