{
	"id": "18H.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.05",
	"title": "18H.05 NURSERY CERTIFICATE REQUIREMENTS.",
	"text": "(a) No person may offer for sale or distribute certified nursery stock as a live plant dealer without first obtaining the appropriate certificate from the commissioner. The commissioner may not issue a certificate to an entity who does not sell certified nursery stock. Certificates are issued solely for these purposes and may not be used for other purposes.\n(b) A certificate issued by the commissioner expires on December 31 of the year it is issued.\n(c) An entity required to be certified by this section must apply for a certificate or for renewal on a form established by the commissioner that must contain:\n(1) the name, address, and contact information of the applicant;\n(2) the assumed business name of the applicant;\n(3) the address of the sales location;\n(4) the address or geographical description of any additional location where nursery stock will be handled, if applicable; and\n(5) the source or sources of purchased nursery stock.\n(d) No entity may:\n(1) falsely claim to be a certified live plant dealer;\n(2) make willful false statements when applying for a certificate; or\n(3) sell or distribute certified nursery stock to an uncertified live plant dealer who is required to be certified.\n(e) Each application for a certificate must be accompanied by the appropriate certificate fee under section 18H.07.\n(f) Certificates issued by the commissioner should be prominently displayed to the public in the place of business where certified nursery stock is sold or distributed.\n(g) The commissioner may refuse to issue a certificate for cause.\n(h) Each live plant dealer is entitled to one sales location under the certificate. Each additional sales location maintained by the entity requires the payment of the full certificate fee.\n(i) A certificate is personal to the applicant and may not be transferred. A new certificate is necessary if the business entity is changed or if the membership of a partnership is changed, whether or not the business name is changed.\n(j) The certificate issued to a live plant dealer applies to the particular premises named in the certificate. However, if prior approval is obtained from the commissioner, the place of business may be moved to the other premises or location without an additional certificate fee.\n(k) A collector of nursery stock from the wild is required to obtain a live plant dealer certificate from the commissioner and is subject to all the requirements that apply to the inspection of nursery stock. All collected nursery stock must be labeled as \"collected from the wild.\"",
	"repealed": false
}