{
	"id": "645.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/645.44",
	"title": "645.44 WORDS AND PHRASES DEFINED.",
	"text": "The following words, terms, and phrases used in Minnesota Statutes or any legislative act shall have the meanings given them in this section, unless another intention clearly appears.\n\"Appellate courts\" means the supreme court and the court of appeals.\n\"Chair\" includes chairman, chairwoman, and chairperson.\nWhen used in reference to court procedure, \"court administrator\" means the court administrator of the court in which the action or proceeding is pending, and \"court administrator's office\" means that court administrator's office.\nWhen a county, town or city is mentioned, without any particular description, it imports the particular county, town or city appropriate to the matter.\n[Repealed, 1976 c 44 s 70]\n\"Folio\" means 100 words, counting as a word each number necessarily used; if there be fewer than 100 words in all, the paper shall be computed as one folio; likewise any excess over the last full folio.\n(a) \"Holiday\" includes New Year's Day, January 1; Martin Luther King's Birthday, the third Monday in January; Washington's and Lincoln's Birthday, the third Monday in February; Memorial Day, the last Monday in May; Juneteenth, June 19; Independence Day, July 4; Labor Day, the first Monday in September; Indigenous Peoples Day, the second Monday in October; Veterans Day, November 11; Thanksgiving Day, the fourth Thursday in November; and Christmas Day, December 25; provided, when New Year's Day, January 1; or Juneteenth, June 19; or Independence Day, July 4; or Veterans Day, November 11; or Christmas Day, December 25; falls on Sunday, the following day shall be a holiday and, provided, when New Year's Day, January 1; or Juneteenth, June 19; or Independence Day, July 4; or Veterans Day, November 11; or Christmas Day, December 25; falls on Saturday, the preceding day shall be a holiday. No public business shall be transacted on any holiday, except in cases of necessity and except in cases of public business transacted by the legislature, nor shall any civil process be served thereon. However, for the executive branch of the state of Minnesota, \"holiday\" also includes the Friday after Thanksgiving but does not include Indigenous Peoples Day. Other branches of state government and political subdivisions shall have the option of determining whether Indigenous Peoples Day and the Friday after Thanksgiving shall be holidays. Where it is determined that Indigenous Peoples Day or the Friday after Thanksgiving is not a holiday, public business may be conducted thereon.\n(b) Any agreement between a public employer and an employee organization citing Veterans Day as the fourth Monday in October shall be amended to cite Veterans Day as November 11.\n(c) Any agreement between a public employer and an employee organization citing \"Christopher Columbus Day\" or \"Columbus Day\" shall be amended to cite \"Indigenous Peoples Day.\"\n\"Public member\" means a person who is not, or never was, a member of the profession or occupation being licensed or regulated or the spouse of any such person, or a person who does not have or has never had, a material financial interest in either the providing of the professional service being licensed or regulated, or an activity directly related to the profession or occupation being licensed or regulated.\n\"Oath\" includes \"affirmation\" in all cases where by law an affirmation may be substituted for an oath; and in like cases \"swear\" includes \"affirm\" and \"sworn\" \"affirmed.\"\n\"Person\" may extend and be applied to bodies politic and corporate, and to partnerships and other unincorporated associations.\nWhen used in reference to population, \"population\" and \"inhabitants\" mean that shown by the last preceding federal decennial census unless otherwise expressly provided.\n\"Public waters\" means public waters as defined in section 103G.005, subdivision 15, and includes \"public waters wetlands\" as defined in section 103G.005, subdivision 15a.\nWhen an instrument in writing is required or permitted to be filed for record with or recorded by any officer, the same imports that it must be recorded by such officer in a suitable book kept for that purpose, unless otherwise expressly directed.\nWhen the seal of a court, public office, or corporation is required by law to be affixed to any paper, the word \"seal\" includes an impression thereof upon the paper alone, as well as an impression on a wafer, wax, or other substance thereto attached. When the seal of a court is required by law to be affixed to any paper or document, the word \"seal\" also includes an image of the court seal affixed by the court to an electronic image of the paper or document.\nWhen applied to a part of the United States, \"state\" extends to and includes the District of Columbia and the several territories. \"United States\" embraces the District of Columbia and territories.\n\"Sheriff\" may be extended to any person officially performing the duties of a sheriff, either generally or in special cases.\n\"Month\" means a calendar month and \"year\" means a calendar year, unless otherwise expressed; and \"year\" is equivalent to the expression \"year of our Lord.\"\n\"Wetlands\" means lands transitional between terrestrial and aquatic systems where the water table is usually at or near the surface or the land is covered by shallow water. For purposes of this definition, wetlands must have the following three attributes:\n(1) have a predominance of hydric soils;\n(2) are inundated or saturated by surface water or groundwater at a frequency and duration sufficient to support a prevalence of hydrophytic vegetation typically adapted for life in saturated soil conditions; and\n(3) under normal circumstances, support a prevalence of such vegetation.\n\"Written\" and \"in writing\" may include any mode of representing words and letters. The signature of a person, when required by law, (1) must be in the handwriting of the person, or (2) if the person is unable to write (i) the person's mark or name written by another at the request and in the presence of the person, or (ii) by a rubber stamp facsimile of the person's actual signature, mark, or a signature of the person's name or a mark made by another and adopted for all purposes of signature by the person with a motor disability and affixed in the person's presence. The signature of a person on a document that will be filed with a court, when required by law, may also be made electronically if otherwise authorized by statute or court rule.\n\"May\" is permissive.\n\"Must\" is mandatory.\n\"Shall\" is mandatory.\n\"Violate\" includes failure to comply with.\n\"Pledge,\" \"mortgage,\" \"conditional sale,\" \"lien,\" \"assignment,\" and similar terms used in referring to a security interest in goods include corresponding types of security interests under article 9 of the Uniform Commercial Code.\n(a) \"Tax\" means any fee, charge, exaction, or assessment imposed by a governmental entity on an individual, person, entity, transaction, good, service, or other thing. It excludes a price that an individual or entity chooses voluntarily to pay in return for receipt of goods or services provided by the governmental entity. A government good or service does not include access to or the authority to engage in private market transactions with a nongovernmental party, such as licenses to engage in a trade, profession, or business or to improve private property.\n(b) For purposes of applying the laws of this state, a \"fee,\" \"charge,\" or other similar term that satisfies the functional requirements of paragraph (a) must be treated as a tax for all purposes, regardless of whether the statute or law names or describes it as a tax. The provisions of this subdivision do not exempt a person, corporation, organization, or entity from payment of a validly imposed fee, charge, exaction, or assessment, nor preempt or supersede limitations under law that apply to fees, charges, or assessments.\n(c) This subdivision is not intended to extend or limit article 4, section 18, of the Minnesota Constitution.\nWhen used in determining or calculating a limit on taxation, spending, state aid amounts, or debt, bond, certificate of indebtedness, or capital note issuance by or for a local government unit, \"estimated market value\" has the meaning given in section 273.032.",
	"repealed": false
}