{
	"id": "353.657",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.657",
	"title": "353.657 SURVIVOR BENEFITS.",
	"text": "(a) In the event that a member of the police and fire fund, other than a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, dies from any cause before retirement or before receiving disability benefits, the association shall grant survivor benefits to a surviving spouse, as defined in section 353.01, subdivision 20, and to a dependent child or children, as defined in section 353.01, subdivision 15, except that if the death is not a line of duty death, the member must be partially or 100 percent vested under section 353.01, subdivision 47.\n(b) Notwithstanding the definition of surviving spouse, a former spouse of the member, if any, is entitled to a portion of the monthly surviving spouse benefit if stipulated under the terms of a marriage dissolution decree filed with the association. If there is no surviving spouse or child or children, a former spouse may be entitled to a lump-sum refund payment under section 353.32, subdivision 1, if provided for in a marriage dissolution decree but not a monthly surviving spouse benefit despite the terms of a marriage dissolution decree filed with the association.\n(c) The spouse and dependent child or children are entitled to monthly benefits as provided in subdivisions 2 to 4.\n(a) The spouse of a deceased member is entitled to receive a monthly benefit for life equal to the following percentage of the member's average salary, as defined in section 353.01, subdivision 17a, paragraph (c), as a member of the police and fire plan:\n(1) if the death was a line of duty death, 60 percent of the average salary is payable; and\n(2) if the death was not a line of duty death or if death occurred while receiving disability benefits that accrued before July 1, 2007, 50 percent of the average salary is payable.\n(b) If the member's status changed from full time to part time due to health reasons during the last 12 months of employment, notwithstanding the definition of average salary in section 353.01, subdivision 17a, paragraph (c), the average salary used to compute the monthly survivor benefit must be based on the full-time salary rate of the position held as a member of the police and fire plan in effect over the last six months of allowable service preceding the month in which the death occurred.\n(a) If a member or former member who has attained the age of at least 50 years and either who is vested under section 353.01, subdivision 47, or who has credit for at least 30 years of allowable service, regardless of age attained, dies before the annuity or disability benefit becomes payable, notwithstanding any designation of beneficiary to the contrary, the surviving spouse may elect to receive a death while eligible survivor benefit.\n(b) Notwithstanding the definition of surviving spouse in section 353.01, subdivision 20, a former spouse of the member, if any, is entitled to a portion of the death while eligible survivor benefit if stipulated under the terms of a marriage dissolution decree filed with the association. If there is no surviving spouse or child or children, a former spouse may be entitled to a lump-sum refund payment under section 353.32, subdivision 1, if provided for in a marriage dissolution decree but not a death while eligible survivor benefit despite the terms of a marriage dissolution decree filed with the association.\n(c) The benefit may be elected instead of a refund with interest under section 353.32, subdivision 1, or surviving spouse benefits otherwise payable under subdivisions 1 and 2. The benefit must be an annuity equal to the 100 percent joint and survivor annuity which the member could have qualified for on the date of death, computed as provided in sections 353.651, subdivision 3, and 353.30, subdivision 3.\n(d) The surviving spouse may apply for the annuity at any time after the date on which the deceased employee would have attained the required age for retirement based on the employee's allowable service. Section 353.34, subdivision 3, applies to a deferred annuity payable under this subdivision.\n(e) No payment accrues beyond the end of the month in which entitlement to such annuity has terminated. An amount equal to the excess, if any, of the accumulated contributions which were credited to the account of the deceased employee over and above the total of the annuities paid and payable to the surviving spouse must be paid to the deceased member's last designated beneficiary or, if none, to the legal representative of the estate of such deceased member.\n(f) Any member may request in writing, with the signed consent of the spouse, that this subdivision not apply and that payment be made only to the designated beneficiary, as otherwise provided by this chapter.\n(g) For a member who is employed as a full-time firefighter by the Department of Military Affairs of the state of Minnesota, allowable service as a full-time state Military Affairs Department firefighter credited by the Minnesota State Retirement System may be used in meeting the minimum allowable service requirement of this subdivision.\n(a) A dependent child, as defined in section 353.01, subdivision 15, is entitled to receive a monthly benefit equal to ten percent of the member's average salary, as defined in section 353.01, subdivision 17a, paragraph (c), as a member of the police and fire plan.\n(b) If the member's status changed from full time to part time due to health reasons during the last 12 months of employment, notwithstanding the definition of average salary in section 353.01, subdivision 17a, paragraph (c), the average salary used to compute the monthly dependent child benefit must be based on the full-time salary rate of the position held as a member of the police and fire plan in effect over the last six months of allowable service preceding the month in which the death occurred.\n(c) Payments for the benefit of a dependent child must be made to the surviving parent, or to the legal guardian of the child or to any adult person with whom the child may at the time be living, provided only that the parent or other person to whom any amount is to be paid advises the board in writing that the amount will be held or used in trust for the benefit of the child.\n(a) The maximum monthly benefit per family must not exceed the following percentages of the member's average monthly salary as specified in subdivision 3:\n(1) 80 percent, if the member's death was a line of duty death; or\n(2) 70 percent, if the member's death was not a line of duty death or occurred while the member was receiving a disability benefit that accrued before July 1, 2007.\n(b) The minimum monthly benefit per family, including the joint and survivor optional annuity under subdivision 2a, and section 353.656, subdivision 1a, must not be less than the following percentage of the member's average monthly salary as specified in subdivision 3:\n(1) 60 percent, if the death was a line of duty death; or\n(2) 50 percent, if the death was not a line of duty death or occurred while the member was receiving a disability benefit that accrued before July 1, 2007.\n(c) If the maximum under paragraph (a) is exceeded, the monthly benefit of the joint annuitant, surviving spouse, and dependent children, as applicable, must each be reduced proportionately so that the total family benefit does not exceed the applicable maximum. The joint and survivor optional annuity, surviving spouse, or dependent children benefit, as applicable, must be restored, plus applicable postretirement adjustments under Minnesota Statutes 2008, section 356.41 or section 356.415, as the dependent child or children become no longer dependent under section 353.01, subdivision 15, or in the event of the death of the joint and survivor annuity recipient or the surviving spouse.\nIf the member shall die under circumstances which entitle a surviving spouse and dependent children to receive benefits under the workers' compensation law, the amounts so received by them shall not be deducted from the benefits payable under this section.\nA survivor benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}