{
	"id": "161.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.28",
	"title": "161.28 ALTERING PUBLIC DRAINAGE DITCH BY TRUNK HIGHWAY.",
	"text": "Upon the filing of a petition by the commissioner with the appropriate county auditor setting forth that it would be advantageous or desirable in the construction or maintenance of a trunk highway to make a minor alteration or change in a public drainage system directly affecting a trunk highway and that the alteration or change will not affect the functioning or efficiency of the public drainage system, the auditor shall fix a time and place for hearing and give notice of the hearing by publication, as defined in section 103E.325. Upon the filing of the petition, the commissioner shall also file a plan showing in detail the alteration or change petitioned for. If upon the hearing it appears to the county board or joint county ditch authority that the alteration or change in the public drainage system will not affect or impair the efficiency of the drainage system, the board or authority shall make its order allowing the commissioner to make the alteration or change petitioned for. Upon the making of the order by the county board or the joint county ditch authority, the commissioner may proceed at the sole cost and expense of the state to make the alterations or changes as may be in the order allowed, damages, if any, for any additional lands necessary for the change or alteration being first duly paid or secured. Upon completion of the alteration or change, the commissioner shall file with the appropriate auditor a map drawn to scale showing the change or alteration made and shall also file a profile of all lines of the alteration or change in the ditch showing graphically the elevation of the ground and gradient, whether open or tiled, the size of tile, and the bottom width and side slope of open ditch sections, and such other information as may appear necessary for understanding. Upon the completion of the alteration or change herein provided for, the ditch shall thereafter include such alteration or change as a part of it with the same force and effect as though it had been originally so constructed and established.\nWithin six years after completion of any alteration or change as provided in this section, any owner or owners of lands in the drainage system claiming damages by reason of the alteration or change may bring an action in the district court of the county in which the lands are located to compel the commissioner to pay damages, if any, caused by the alteration or change.",
	"repealed": false
}