{
	"id": "136F.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.64",
	"title": "136F.64 CONSTRUCTION, IMPROVEMENT, AND REPAIR OF FACILITIES.",
	"text": "(a) Specific legislative authority is not required for repairs or minor capital projects financed with operating appropriation or institutional receipts that:\n(1) are undertaken for asset preservation or code compliance purposes; or\n(2) do not materially increase the net square footage of the institution; and\n(3) do not materially increase the costs of instructional programs.\nFor any project under this section with a cost in excess of $1,500,000, unless the board determines that an emergency exists, the board must notify the chair of the Finance Committee of the senate, and the chairs of the Ways and Means Committee and the Capital Investment Committee of the house of representatives in writing before incurring any contractual obligations.\n(b) The board shall supervise and control the preparation of plans and specifications for the construction, alteration, repair, or enlargement of state college and university buildings, structures, and improvements for which appropriations are made to the board. The board shall advertise for bids and award contracts in connection with the improvements, supervise and inspect the work, approve necessary changes in the plans and specifications, approve estimates for payment, and accept the improvements when completed according to the plans and specifications.\nPlans and specifications must be accompanied by a detailed statement of the cost, quality, and description of all material and labor required for the completion of the work. No plan may be adopted, and no improvement made or building constructed, that contemplates the expenditure for its completion of more money than the appropriation for it, unless otherwise provided by law.\nIn contracting for projects, the board must not restrict its access to litigation or limit its methods of redress to arbitration or other nonjudicial procedures.",
	"repealed": false
}