{
	"id": "84.0274",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0274",
	"title": "84.0274 LANDOWNERS' BILL OF RIGHTS.",
	"text": "This section may be cited as \"the landowners' bill of rights.\"\nIt is the intent of this section to clarify the responsibilities of the state in the natural resources land acquisition process and to provide additional protections to landowners in their dealings with the state.\nNo lands shall be acquired by the commissioner of natural resources by means of condemnation unless the owner requests that the owner's lands be condemned or the condemnation is specifically authorized by law. Notwithstanding subdivision 5, paragraph (g), and sections 117.52 and 117.521, the owner shall not be paid relocation costs when the owner requests that the owner's lands be condemned.\nThe protections for landowners and responsibilities of the state set forth in this section shall not limit, but shall be in addition to all rights and responsibilities contained in state or federal law.\nWhen the state proposes to purchase in fee or any lesser interest in land which will be administered by the commissioner of natural resources, the landowner shall have the following rights:\n(a) the right to be informed of the specific intended use of the property and of any change in the intended use of the property which occurs during the acquisition process. The owner shall also be informed that the documents regarding the purchase will be public records if the land is purchased by the state;\n(b) the right to be paid a fair price for the property. The price shall include the fair market value of the land plus:\n(1) all necessary incidental costs such as abstracting and recording fees related to the sale. The costs of clearing title defects, paying taxes, and attorney's fees are not reimbursable; and\n(2) any penalties incurred by the owner where the property is security for a loan or advance of credit that contains a provision requiring or permitting the imposition of a penalty if the loan or advance of credit is prepaid;\n(c) the right to payment, at the owner's election, in a lump sum or in up to four annual installments;\n(d) the right to have the property fairly appraised by the state. The state's appraiser shall physically inspect the property and the owner shall be allowed to accompany the appraiser when the appraisal is made. The state's appraiser shall certify in the appraisal report to having physically inspected the property and having given the landowner an opportunity to accompany the appraiser on inspections. Notwithstanding section 13.44, subdivision 3, before an offer is made, the landowner shall be informed of the value determined pursuant to section 84.0272;\n(e) the right to retain a qualified independent appraiser to conduct an appraisal at any time prior to certification of the state's appraisal of the property and to have that appraisal considered along with the state's in certifying the selling price and the right to be reimbursed for appraisal fees up to $1,500 if the land is sold to the state;\n(f) the right to have the state acquire the property by means of condemnation upon the owner's request with the agreement of the commissioner;\n(g) when the property is being acquired by condemnation or the condemnation is specifically authorized by law, the right to receive or waive relocation assistance, services, payments and benefits as provided in sections 117.52 and 117.521 and to contest the state's offer for relocation and moving expenses;\n(h) the right to accept the state's offer for the property;\n(i) the right to continue occupancy of the property until full payment is received, provided that when the owner elects to receive payment in annual installments pursuant to clause (c), the owner may retain occupancy until the first payment is made; and\n(j) the right to seek the advice of counsel regarding any aspect of the land transaction.\nWhen the state proposes to purchase land for natural resources purposes, the commissioner of natural resources and, where applicable, the commissioner of administration shall have the following responsibilities:\n(1) the responsibility to deal fairly and openly with the landowner in the purchase of property;\n(2) the responsibility to refrain from discussing price with the landowner before an appraisal has been made. In addition, the same person shall not both appraise and negotiate for purchase of a tract of land. This paragraph does not apply to the state when discussing with a landowner the trout stream easement payment determined under section 84.0272, subdivision 2, the native prairie bank easement payment determined under section 84.96, subdivision 5, or the Camp Ripley's Army compatible use buffer easement payment determined under section 84.0277, subdivision 2;\n(3) the responsibility to use private fee appraisers to lower the state's acquisition costs to the greatest extent practicable; and\n(4) the responsibility to acquire land in as expeditious a manner as possible. No option shall be made for a period of greater than two months if no survey is required or for nine months if a survey is required, unless the landowner, in writing, expressly requests a longer period of time. Provided that, if county board approval of the transaction is required pursuant to section 97A.145, no time limits shall apply. If the state elects not to purchase property upon which it has an option, it shall pay the landowner $500 after the expiration of the option period. If the state elects to purchase the property, unless the landowner elects otherwise, payment to the landowner shall be made no later than 90 days following the state's election to purchase the property provided that the title is marketable and the owner acts expeditiously to complete the transaction.\nWhen the state proposes to purchase lands for natural resources purposes, the landowner shall be given a written statement in lay terms of the rights and responsibilities provided for in subdivisions 5 and 6. Before a purchase can be made, the landowner must sign a statement acknowledging in writing that the statement has been provided and explained to the landowner. Within 60 days following the date of final approval of Laws 1980, chapter 45B, the commissioner of natural resources shall submit a proposed form for the statement to the Legislative-Citizen Commission on Minnesota Resources. The commission shall review the proposed form for compliance with the intent of this section and shall make any changes which it deems proper.\nWhen the commissioner of natural resources acquires abandoned railroad right-of-way from a railroad, railroad holding company, or similar entity, any or all of the provisions of this section may be waived by mutual agreement of the commissioner and the landowner.\nWhen the commissioner acquires land or interests in land from a nonprofit organization or governmental entity, any or all of the provisions of this section may be waived by mutual agreement of the commissioner and the nonprofit organization or governmental entity.\nThe commissioner may enter into a right of first refusal agreement with a landowner prior to determining the value of the land. No right of first refusal agreement shall be made for a period of greater than two years and payment to the landowner for entry into the agreement shall not exceed $5,000.",
	"repealed": false
}