{
	"id": "176.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.225",
	"title": "176.225 ADDITIONAL AWARD AS PENALTY.",
	"text": "Upon reasonable notice and hearing or opportunity to be heard, the commissioner, a compensation judge, or upon appeal, the court of appeals or the supreme court shall award compensation, in addition to the total amount of compensation award, of up to 30 percent of that total amount where an employer or insurer has:\n(1) instituted a proceeding or interposed a defense which does not present a real controversy but which is frivolous or for the purpose of delay; or\n(2) unreasonably or vexatiously delayed payment; or\n(3) neglected or refused to pay compensation; or\n(4) intentionally underpaid compensation; or\n(5) frivolously denied a claim; or\n(6) unreasonably or vexatiously discontinued compensation in violation of sections 176.238 and 176.239.\nFor the purpose of this section, \"frivolously\" means without a good faith investigation of the facts or on a basis that is clearly contrary to fact or law.\nTo determine whether an employer or insurer is liable for the payment provided by subdivision 1, the division, a compensation judge, or the Workers' Compensation Court of Appeals upon appeal may examine the books and records of the employer or insurer relating to the payment of compensation, and may require the employer or insurer to furnish any other information relating to the payment of compensation.\nThe right of the division to review the records of an employer or insurer includes the right of the special compensation fund to examine records for the proper administration of section 176.129, Minnesota Statutes 1990, section 176.131, Minnesota Statutes 1994, section 176.132, and sections 176.181 and 176.183. The special compensation fund may not review the records of the employer or insurer relating to a claim under Minnesota Statutes 1990, section 176.131, until the special compensation fund has accepted liability under that section or a final determination of liability under that section has been made. The special compensation fund may withhold reimbursement to the employer or insurer under Minnesota Statutes 1990, section 176.131, or Minnesota Statutes 1994, section 176.132, if the employer or insurer denies access to records requested for the proper administration of section 176.129, Minnesota Statutes 1990, section 176.131, Minnesota Statutes 1994, section 176.132, section 176.181 or 176.183.\nIf an insurer persists in an action or omission listed in subdivision 1, or does not permit the examination of books and records, or fails to furnish information as required, the commissioner or the chief administrative law judge shall file a written complaint with the commissioner of commerce. The complaint shall specify the facts and recommend the revocation of the license of the insurer to do business in this state. The Workers' Compensation Court of Appeals may also file a written complaint.\nUpon receipt of a complaint filed under subdivision 3, the commissioner of commerce shall hear and determine the matter in the manner provided by chapter 14. On finding that a charge made by the complaint is true, the commissioner of commerce may suspend or revoke the license of the insurer to do business in this state. The insurer may appeal from the action of the commissioner revoking the license in the manner provided in chapter 14.\nWhere the employer is guilty of inexcusable delay in making payments, the payments which are found to be delayed shall be increased by 25 percent. Withholding amounts unquestionably due because the injured employee refuses to execute a release of the employee's right to claim further benefits will be regarded as inexcusable delay in the making of compensation payments. If any sum ordered by the department to be paid is not paid when due, and no appeal of the order is made, the sum shall bear interest at the rate of 12 percent per annum. Any penalties paid pursuant to this section shall not be considered as a loss or expense item for purposes of a petition for a rate increase made pursuant to chapter 79.",
	"repealed": false
}