{
	"id": "240.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.08",
	"title": "240.08 OCCUPATION LICENSES.",
	"text": "The commission may issue class C occupational licenses to persons who wish to be employed in horse racing where pari-mutuel betting is conducted as:\n(1) horse owners or lessees;\n(2) jockeys or drivers;\n(3) exercise riders;\n(4) grooms;\n(5) trainers and their assistants;\n(6) pari-mutuel personnel;\n(7) security officers;\n(8) vendors; and\n(9) other occupations the commission by rule determines require licensing to ensure the integrity of horse racing in Minnesota.\n(a) An application for a class C license must be on a form the commission prescribes and must be accompanied by an affidavit of qualification that the applicant:\n(1) is not in default in the payment of an obligation or debt to the state under Laws 1983, chapter 214;\n(2) does not have a felony conviction of record in a state or federal court and does not have a state or federal felony charge pending;\n(3) is not and never has been connected with or engaged in an illegal business;\n(4) has never been found guilty of fraud or misrepresentation in connection with racing or breeding;\n(5) has never been found guilty of a violation of law or rule relating to horse racing, pari-mutuel betting or any other form of gambling which is a serious violation as defined by the commission's rules;\n(6) has never been found to have knowingly violated an order of the commission or a law or rule of Minnesota or another jurisdiction relating to horse racing, pari-mutuel betting, or any other form of gambling; and\n(7) has never been convicted of or entered a guilty plea, Alford plea, or plea of no contest to an offense under chapter 343 or 346 or a similar law in another jurisdiction pertaining to mistreatment of animals.\n(b) The application must also contain an irrevocable consent statement, to be signed by the applicant, which states that suits and actions relating to the subject matter of the application or acts or omissions arising from it may be commenced against the applicant in any court of competent jurisdiction in this state by the service on the secretary of state of any summons, process, or pleading authorized by the laws of this state. If any summons, process, or pleading is served upon the secretary of state, it must be by duplicate copies. One copy must be retained in the Office of the Secretary of State and the other copy must be forwarded immediately by certified mail to the address of the applicant, as shown by the records of the commission.\nThe commission may issue a license to an applicant otherwise disqualified pursuant to subdivision 2, paragraph (a), clause (2), for an occupation that does not involve gaming operations, security, surveillance, or the handling of pari-mutuel or card club revenues provided that the applicant has not been convicted of a felony or a crime involving fraud or misrepresentation within ten years of application, has never been convicted of a gambling-related offense, does not have a felony charge pending, has been discharged from any supervision related to the disqualifying offense for a period of at least five years, and is not required to register pursuant to section 243.166.\nThe commission shall investigate each applicant for a class C license to the extent it deems necessary, and may request the assistance of and may reimburse the Division of Alcohol and Gambling Enforcement in investigating applicants. The commission may by rule require that an applicant be fingerprinted or furnish the applicant's fingerprints. Investigations must be conducted and their costs paid in the manner prescribed by section 240.06, subdivision 3. The commission may cooperate with national and international organizations and agencies in conducting investigations. The commission may by rule provide for examining the qualifications of an applicant for the license being applied for. The commission has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on class C applicants and licensees.\nIf the commission determines that the applicant is qualified for the occupation for which licensing is sought and will not adversely affect the public health, welfare, and safety or the integrity of racing in Minnesota, it may issue a class C license to the applicant. If it makes a similar finding for a renewal of a class C license it may renew the license. Class C licenses are effective until December 31 of the calendar year for which they are issued. Certain types of class C licenses, to be determined by the commission, are effective until December 31 of the third calendar year for which they have been issued.\n(a) After providing a licensee with notice and an opportunity to be heard, the commission may:\n(1) revoke a class C license for a violation of law or rule which in the commission's opinion adversely affects the integrity of horse racing in Minnesota, the public health, welfare, or safety, or for an intentional false statement made in a license application; or\n(2) suspend a class C license for up to five years for a violation of law, order or rule. If the license expires during the term of suspension, the licensee shall be ineligible to apply for another license from the commission until the expiration of the term of suspension.\n(b) The commission may delegate to its designated agents the authority to impose suspensions of class C licenses.\n(c) Except as provided in paragraph (d), the suspension of a class C license may be appealed to the commission according to its rules.\n(d) If the commission revokes or suspends a class C license for more than one year, the licensee has the right to appeal by requesting a contested case hearing under chapter 14. The request must be made in writing and sent to the commission by certified mail or personal service. A request sent by certified mail must be postmarked within ten days after the licensee receives the order of revocation or suspension from the commission. A request sent by personal service must be received by the commission within ten days after the licensee receives the order of revocation or suspension from the commission.\n(e) The commission may summarily suspend a license for up to 90 days where it is necessary to ensure the integrity of racing or to protect the public health, welfare, or safety. The licensee has the right to appeal a summary suspension to the commission according to its rules.",
	"repealed": false
}