{
	"id": "60A.097",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.097",
	"title": "60A.097 QUALIFYING TRUST AGREEMENTS.",
	"text": "An admitted asset or a reduction in liability for reinsurance ceded to an unauthorized assuming insurer providing a trust fund pursuant to section 60A.093 shall only be allowed if the requirements of this section are met.\nAs used in this section, the following terms have the meanings given:\n(a) \"Beneficiary\" means the entity for whose sole benefit the trust has been established and any successor of the beneficiary by operation of law. If a court of law appoints a successor in interest to the named beneficiary, the named beneficiary includes and is limited to the court appointed domiciliary receiver, including a conservator, rehabilitator, or liquidator.\n(b) \"Grantor\" means the entity that has established a trust for the sole benefit of the beneficiary. When established in conjunction with a reinsurance agreement, the grantor is the unlicensed, unaccredited assuming insurer.\n(c) \"Obligations\" as used in subdivision 3, paragraph (k), means:\n(1) reinsured losses and allocated loss expenses paid by the ceding company, but not recovered from the assuming insurer;\n(2) reserves for reinsured losses reported and outstanding;\n(3) reserves for reinsured losses incurred but not reported; and\n(4) reserves for allocated reinsured loss expenses and unearned premiums.\n\"Obligations\" excludes liabilities that are otherwise secured by acceptable means.\n(a) The trust agreement must be entered into between the beneficiary, the grantor, and a trustee which must be a qualified United States financial institution as defined in section 60A.091.\n(b) The trust agreement must create a trust account into which assets must be deposited.\n(c) All assets in the trust account must be held by the trustee at the trustee's office in the United States.\n(d) The trust agreement must provide that:\n(1) the beneficiary shall have the right to withdraw assets from the trust account at any time, without notice to the grantor, subject only to written notice from the beneficiary to the trustee;\n(2) no other statement or document is required to be presented in order to withdraw assets, except that the beneficiary may be required to acknowledge receipt of withdrawn assets;\n(3) it is not subject to any conditions or qualifications outside of the trust agreement; and\n(4) it shall not contain references to any other agreements or documents except as provided for under paragraph (k).\n(e) The trust agreement must be established for the sole benefit of the beneficiary.\n(f) The trust agreement must require the trustee to:\n(1) receive assets and hold all assets in a safe place;\n(2) determine that all assets are in such form that the beneficiary, or the trustee upon direction by the beneficiary, may whenever necessary negotiate the assets, without consent or signature from the grantor or any other person or entity;\n(3) furnish to the grantor and the beneficiary a statement of all assets in the trust account upon its inception and at intervals no less frequent than the end of each calendar quarter;\n(4) notify the grantor and the beneficiary within ten days of any deposits to or withdrawals from the trust account;\n(5) upon written demand of the beneficiary, immediately take any and all steps necessary to transfer absolutely and unequivocally all right, title, and interest in the assets held in the trust account to the beneficiary and deliver physical custody of the assets to the beneficiary; and\n(6) allow no substitutions or withdrawals of assets from the trust account, except on written instructions from the beneficiary, except that the trustee may, without the consent of but with notice to the beneficiary, upon call or maturity of any trust asset, withdraw the asset upon condition that the proceeds are paid into the trust account.\n(g) The trust agreement must provide that at least 30 days, but not more than 45 days, before termination of the trust account, written notification of termination must be delivered by the trustee to the beneficiary.\n(h) The trust agreement must be made subject to and governed by the laws of the state in which the trust is established.\n(i) The trust agreement must prohibit invasion of the trust corpus for the purpose of paying compensation to, or reimbursing the expenses of, the trustee.\n(j) The trust agreement must provide that the trustee is liable for its own negligence, willful misconduct, or lack of good faith.\n(k) Notwithstanding other provisions of this section, when a trust agreement is established in conjunction with a reinsurance agreement covering risks other than life, annuities, and accident and health, where it is customary practice to provide a trust agreement for a specific purpose, the trust agreement may, notwithstanding any other conditions in this section, provide that the ceding insurer must undertake to use and apply amounts drawn upon the trust account, without diminution because of the insolvency of the ceding insurer or the assuming insurer for the following purposes:\n(1) to pay or reimburse the ceding insurer for the assuming insurer's share under the specific reinsurance agreement regarding any losses and allocated loss expenses paid by the ceding insurer, but not recovered from the assuming insurer, or for unearned premiums due to the ceding insurer if not otherwise paid by the assuming insurer;\n(2) to make payment to the assuming insurer of any amounts held in the trust account that exceed 102 percent of the actual amount required to fund the assuming insurer's obligations under the specific reinsurance agreement; or\n(3) where the ceding insurer has received notification of termination of the trust account and where the assuming insurer's entire obligations under the specific reinsurance agreement remain unliquidated and undischarged ten days before the termination date, to withdraw amounts equal to the obligations and deposit those amounts in a separate account, in the name of the ceding insurer in any qualified United States financial institution as defined in section 60A.091 apart from its general assets, in trust for the uses and purposes specified in clauses (1) and (2) that remain executory after the withdrawal and for any period after the termination date.\n(l) Assets in the trust account must meet the requirements of section 60A.093, subdivision 1. The trust agreement must stipulate that assets deposited in the trust account shall be valued according to their current fair market value. The agreement may further specify the types of investments to be deposited. If the reinsurance agreement covers life, annuities, or accident and health risks, then the provisions required by this paragraph must be included in the reinsurance agreement.\n(m) A letter of credit may be a trust asset if the trust agreement, deed of trust, or other binding agreement, as approved by the commissioner, provides that if the letter of trust expires without being renewed or replaced, the trustee must immediately draw down the full amount of the letter of credit and hold the proceeds in trust for the beneficiary.\n(a) The trust agreement may provide that the trustee may resign upon delivery of a written notice of resignation, effective not less than 90 days after receipt by the beneficiary and grantor of the notice and that the trustee may be removed by the grantor by delivery to the trustee and the beneficiary of a written notice of removal, effective not less than 90 days after receipt by the trustee and the beneficiary of the notice. No resignation or removal is effective until a successor trustee has been appointed and approved by the beneficiary and the grantor and all assets in the trust have been duly transferred to the new trustee.\n(b) The grantor may have the full and unqualified right to vote any shares or stock in the trust account and to receive from time to time payment of any dividends or interest upon any shares of stock or obligations included in the trust account. Interest or dividends must be either forwarded promptly upon receipt to the grantor or deposited in a separate account established in the grantor's name.\n(c) The trustee may be given authority to invest, and accept substitutions of, any funds in the account. No investment or substitution must be made without prior approval of the beneficiary, unless the trust specifies categories of investments acceptable to the beneficiary and authorizes the trustee to invest funds and to accept substitutions which the trustee determines are at least equal in market value to the assets withdrawn and that are consistent with the restrictions in subdivision 5, paragraph (a), clause (2).\n(d) The trust agreement may provide that the beneficiary may at any time designate a party to which all or part of the trust assets are to be transferred. The transfer may be conditioned upon the trustee receiving, prior to or simultaneously, other specified assets.\n(e) The trust agreement may provide that, upon termination of the trust account, all assets not previously withdrawn by the beneficiary shall, with written approval by the beneficiary, be delivered to the grantor.\n(a) A reinsurance agreement, which is entered into in conjunction with a trust agreement and the establishment of a trust account, may contain provisions that:\n(1) require the assuming insurer to enter into a trust agreement and to establish a trust account for the benefit of the ceding insurer, and specifying what the agreement is to cover;\n(2) require the assuming insurer, before depositing assets with the trustee, to execute assignments or endorsements in blank, or to transfer legal title to the trustee of all shares, obligations or any other assets requiring assignments, in order that the ceding insurer, or the trustee upon the direction of the ceding insurer, may whenever necessary negotiate these assets without consent or signature from the assuming insurer or any other entity;\n(3) require that all settlements of account between the ceding insurer and the assuming insurer be made in cash or its equivalent; and\n(4) stipulate that the assuming insurer and the ceding insurer agree that the assets in the trust account, established pursuant to the provisions of the reinsurance agreement, may be withdrawn by the ceding insurer at any time, notwithstanding any other provisions in the reinsurance agreement, and must be utilized and applied by the ceding insurer or its successors in interest by operation of law, including without limitation any liquidator, rehabilitator, receiver or conservator of the company, without diminution because of insolvency on the part of the ceding insurer or the assuming insurer, only for the following purposes:\n(i) to reimburse the ceding insurer for the assuming insurer's share of premiums returned to the owners of policies reinsured under the reinsurance agreement because of cancellations of the policies;\n(ii) to reimburse the ceding insurer for the assuming insurer's share of surrenders and benefits or losses paid by the ceding insurer pursuant to the provisions of the policies reinsured under the reinsurance agreement;\n(iii) to fund an account with the ceding insurer in an amount at least equal to the deduction, for reinsurance ceded, from the ceding insurer liabilities for policies ceded under the agreement. The account must include, but not be limited to, amounts for policy reserves, claims and losses incurred, including losses incurred but not reported, loss adjustment expenses, and unearned premium reserves; and\n(iv) to pay any other amounts the ceding insurer claims are due under the reinsurance agreement.\n(b) The reinsurance agreement may also contain provisions that:\n(1) give the assuming insurer the right to seek approval from the ceding insurer to withdraw from the trust account all or any part of the trust assets and transfer those assets to the assuming insurer, and provide that the ceding insurer shall not unreasonably or arbitrarily withhold its approval, provided:\n(i) the assuming insurer shall, at the time of withdrawal, replace the withdrawn assets with other qualified assets having a current fair market value equal to the market value of the assets withdrawn so as to maintain at all times the deposit in the required amount; or\n(ii) after withdrawal and transfer, the current fair market value of the trust account is no less than 102 percent of the required amount;\n(2) provide for:\n(i) the return of any amount withdrawn in excess of the actual amounts required for paragraph (a), clause (4), items (i), (ii), and (iii), or in the case of paragraph (a), clause (4), item (iv), any amounts that are subsequently determined not to be due; and\n(ii) interest payments, at a rate not in excess of the prime rate of interest, on the amounts; and\n(3) permit the award by any arbitration panel or court of competent jurisdiction of:\n(i) interest at a rate different from that provided in clause (2), item (ii);\n(ii) court or arbitration costs;\n(iii) attorney's fees; and\n(iv) any other reasonable expenses.\nA trust agreement may be used to reduce any liability for reinsurance ceded to an unauthorized assuming insurer in financial statements required to be filed with the commissioner when established on or before the date of filing of the financial statement of the ceding insurer. Further, the reduction for the existence of an acceptable trust account may be up to the current fair market value of acceptable assets available to be withdrawn from the trust account at that time, but the reduction must be no greater than the specific obligations under the reinsurance agreement that the trust account was established to secure.\nMS 2016 [Repealed by amendment, 2018 c 125 s 6]\nThe failure of any trust agreement to specifically identify the beneficiary, as defined in subdivision 2, paragraph (a), must not be construed to affect any actions or rights which the commissioner may take or possess pursuant to the laws of this state.",
	"repealed": false
}