{
	"id": "273.1233",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1233",
	"title": "273.1233 TAX RELIEF FOR DESTROYED PROPERTY; LOCAL OPTION DISASTER ABATEMENT.",
	"text": "(a) Notwithstanding section 375.192, a county board may grant an abatement of net tax for homestead and nonhomestead property under the provisions of this paragraph for taxes payable in the year in which the destruction occurs if:\n(1) the owner submits a written application to the county assessor as soon as practical after the damage has occurred;\n(2) the owner submits a written application to the county board as soon as practical after the damage has occurred; and\n(3) the county assessor determines that 50 percent or more of a homestead dwelling or other building has been (i) unintentionally or accidentally destroyed, or (ii) destroyed by arson or vandalism by someone other than the owner.\nAbatements granted under this paragraph are not subject to approval by the commissioner of revenue.\n(b) Notwithstanding sections 270C.86 and 375.192, the commissioner of revenue may grant an abatement of net tax for utility property for taxes payable in the year in which the destruction occurs if:\n(1) the owner submits a written application to the commissioner as soon as practical after the damage has occurred;\n(2) the owner forwards a copy of the written application to the county board as soon as practical after the damage has occurred; and\n(3) the commissioner determines that 50 percent or more of the property has been (i) unintentionally or accidentally destroyed, or (ii) destroyed by arson or vandalism by someone other than the owner.\nAbatements granted under this paragraph are not subject to approval by the county board of the county where the property is located.\n(a) In the case of a property located within a disaster or emergency area, the abatement under this section is limited to the difference between (i) the net tax on the property computed using the market value of the property established for the January 2 assessment in the year in which the damage occurred, and (ii) the net tax computed using the reassessed value.\n(b) In the case of property not located in a disaster or emergency area, the abatement under this section is limited to the result obtained by multiplying the difference in the net tax on the property computed using the market value of the property established for the January 2 assessment in the year in which the damage occurred, and the net tax computed using the reassessed value, times a fraction, the numerator of which is the number of months in the assessment year that the structure was not usable and the denominator of which is 12. If a structure was usable for a fraction of a month, that month is not included in the numerator.\n(c) If application is made after payment of all or a portion of the taxes being abated, the portion already paid shall be refunded to the taxpayer by the county treasurer as soon as practical.\n(a) If the destruction occurs as a result of a disaster or emergency and the property is located in a disaster or emergency area, the county auditor shall certify the abatements granted under this section to the commissioner of revenue for reimbursement to each taxing jurisdiction in which the damaged property is located. The commissioner shall make the payments to the taxing jurisdictions containing the property, other than school districts and the state, at the time distributions are made under section 473H.10, subdivision 3. Reimbursements to school districts shall be made as provided in section 273.1392. No reimbursement is to be paid to the state treasury.\n(b) Local taxing authorities may levy in the following year the amount of unreimbursed tax dollars lost as a result of the reductions granted pursuant to this section and sections 273.1234 and 273.1235 outside of any statutory restriction as to levy amount or tax rate.\n(c) There is annually appropriated from the general fund to the commissioner of revenue an amount necessary to make the payments required by this section.",
	"repealed": false
}