{
	"id": "246.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.56",
	"title": "246.56 WORK ACTIVITY FOR CERTAIN PATIENTS OR RESIDENTS.",
	"text": "The executive board is hereby authorized to establish work activity programs for the purpose of providing therapeutic work activities for regional treatment center patients with mental illness and regional treatment center residents with developmental disabilities. The executive board may establish work activity programs for the provision of services and for the manufacture, processing and repairing of goods, wares, and merchandise. The executive board may locate work activity programs on the grounds of the regional treatment center or at work sites in the community. In establishing therapeutic work activities, the executive board shall cooperate with existing agencies to avoid duplication of available activities to the extent feasible.\n(a) The executive board must plan and design the therapeutic work activities exclusively to provide therapeutic activities for workers with a disability whose physical or mental impairment is so severe as to make productive capacity inconsequential. Notwithstanding section 177.24, the activities within this program must conform to the rules and regulations relating to work activity centers promulgated by the United States Department of Labor.\n(b) To accomplish the purpose in paragraph (a), the executive board has the power and authority to:\n(1) use the diversified labor fund established by Laws 1945, chapter 575, section 19, to purchase equipment and remodel facilities of the state hospitals referred to in subdivision 1 to initiate the work activity program;\n(2) formulate a system of records and accounts which must at all times indicate the extent of purchases, sales, wages, and bidding practices and which must be open to public inspection;\n(3) contract with public or private entities for the provision of custodial, domestic, maintenance, and other services carried out by patients or residents. To the extent that a qualified direct care employee of a regional treatment center is available, staff services required by the contract must be provided by that direct care employee.\n(c) The executive board, subject to the approval of the commissioner of education, has the power and authority to:\n(1) create a work activity center revolving fund for the purpose of receiving and expending money in the operation of the programs;\n(2) contract with public and private industries for the manufacture, repair, or assembling of work according to standard bidding practices;\n(3) use the revenue from the operation of said programs to pay wages to patients or residents according to their productivity, purchase equipment and supplies and pay other expenses necessary to the operation of the said programs;\n(4) utilize all available vocational rehabilitation services and encourage the integration of the therapeutic work activities into existing vocational rehabilitation and community-based programs, so that the therapeutic work activities do not duplicate nor unfairly compete with existing public or private community programs.\nThe executive board is not required to include indirect costs as defined in section 16A.127 in therapeutic work activity contracts for patients of the regional treatment centers and is not required to reimburse the general fund for indirect costs related to therapeutic work activities.",
	"repealed": false
}