{
	"id": "45.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.25",
	"title": "45.25 DEFINITIONS.",
	"text": "As used in sections 45.25 to 45.43, the terms defined in this section have the meanings given them.\n\"Appropriate and related knowledge\" means facts, information, or principles that are clearly relevant to the licensee in performing responsibilities under a license. These facts, information, or principles must convey substantive and procedural knowledge as it relates to postlicensing issues and must be relevant to the technical aspects of a particular area of continuing education.\nMS 2020 [Repealed, 2022 c 74 s 9]\n\"Classroom hour\" means a 50-minute hour. Breaks must not be accumulated in order to dismiss the class early. Classes must not be offered to any one student for longer than eight hours in one day, excluding meal breaks.\n\"Commissioner\" means the commissioner of commerce.\n\"Coordinator\" means an individual who is responsible for monitoring approved educational offerings.\n\"Distance learning course\" means an education process, other than the courses specified in subdivision 2a, clauses (2) and (3), that is based on the geographical separation of instructor and learner. This includes, but is not limited to:\n(1) an interactive Internet course that does not meet the requirements of subdivision 2a, clauses (2) or (3); and\n(2) a noninteractive course taught via the Internet, video, or other electronic means.\n\"Education provider\" means a person offering or providing approved education.\n\"Encrypted online examination\" means an examination offered over the Internet that is (1) inaccessible to anyone but the student taking the examination, who must have a unique login and password to see it, and (2) protected with security measures that make it unreadable if it is electronically stolen. In addition, the student must not have the ability to download and save the examination in any readable form.\n\"Instructor\" means an individual who (1) lectures in an approved educational offering, or (2) creates an interactive Internet or on-demand course.\n\"Licensee\" means a person licensed by the Department of Commerce for whom an examination is required before licensure.\n\"Live course\" means any learning experience that is actively led by an instructor, either online or in a classroom setting, that offers person-to-person, real-time feedback. A live course offered online must:\n(1) specify the minimum system requirements;\n(2) provide encryption that ensures that all personal information, including the student's name, address, and credit card number, cannot be read as it passes across the Internet;\n(3) include technology to guarantee seat time;\n(4) include the ability for the student to get technical support within a reasonable amount of time;\n(5) include a statement that the student's information will not be sold or distributed to any third party without the prior written consent of the student. Taking the course does not constitute consent; and\n(6) include a process to authenticate the student's identity.\n\"On-demand course\" means a learning experience that enables a student to review learning material at a time and location that is convenient for the student. On-demand course includes, but is not limited to, asynchronous online courses, text-based courses, and other courses not offered live that include prerecorded videos, class recordings, documents, or other learning activities.\n\"Overpayment\" means any payment of money in excess of a statutory fee.\n\"Person\" means a natural person, firm, institution, partnership, corporation, limited liability company, limited liability partnership, or association.\n(a) \"Proctor\" means a person who (1) verifies a student's identity, and (2) processes an affidavit testifying that the student received no outside assistance with the course or examination.\n(b) A proctor must be 18 years of age or older. A proctor must not have a financial or other conflict of interest with respect to a student's successful completion of the course or the examination. A proctor must not be:\n(1) a relative of the student;\n(2) the student's supervisor at work;\n(3) a person the student supervises at work; or\n(4) a student who is completing the same course.\n\"Professional designation\" means an industry-recognized professional designation used by a licensee after completing a series of courses and passing a graded, proctored examination.\nMS 2020 [Repealed, 2022 c 74 s 9]",
	"repealed": false
}