{
	"id": "176.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.161",
	"title": "176.161 ALIEN DEPENDENTS.",
	"text": "In case a deceased employee for whose injury or death compensation is payable leaves surviving an alien dependent residing outside the United States the commissioner shall direct the payment of all compensation due the dependent to be made to the duly accredited consular officer of the country of which the beneficiary is a citizen residing within the state, or to a designated representative residing within the state; or, if the commissioner believes that the interests of the dependent will be better served and at any time prior to the final settlement the dependent files with the commissioner a power of attorney designating any other suitable person residing in this state to act as attorney in fact in such proceedings, the commissioner may appoint such person. If it appears necessary to institute proceedings to enforce payment of compensation due the dependent, the commissioner may permit the consular officer to institute these proceedings. If during the pendency of these proceedings, such power of attorney is filed by the alien dependent, the commissioner shall then determine whether such attorney in fact be substituted to represent such dependent or if the consular officer or a representative continue therein. The person so appointed may carry on proceedings to settle all claims for compensation and receive for distribution to such dependent all compensation arising under this chapter. The settlement and distribution of the funds shall be made only on the written order of the commissioner. The person so appointed shall furnish a bond satisfactory to the commissioner, conditioned upon the proper application of the money received. Before the bond is discharged, the person so appointed shall file with the commissioner a verified account of receipts and disbursements of such compensation.\nBefore receiving the first payment of such compensation and thereafter when ordered so to do by the commissioner of the Department of Labor and Industry, the person so appointed shall furnish to the commissioner of the Department of Labor and Industry a sworn statement containing a list of the dependents showing the name, age, residence, extent of dependency, and relationship to the deceased of each dependent.\nIn any proceedings heretofore taken to recover compensation for any alien dependent carried on for at least five years in the name of a person as petitioner, designated by power of attorney from the alien dependent, the right of this designated petitioner to conclude the proceedings or final settlement and to fully bind all parties thereby is hereby legalized in all respects.",
	"repealed": false
}