{
	"id": "353.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.31",
	"title": "353.31 SURVIVOR BENEFITS.",
	"text": "Upon the death of a basic member before retirement or upon the death of a basic member who was disabled and receiving disability benefits under section 353.33 at the time of death who has had at least 18 months of credited allowable service, the surviving spouse and dependent child or children of the member, as defined in section 353.01, subdivisions 15 and 20, are entitled to receive the monthly benefit provided below:\nNotwithstanding the definition of surviving spouse under section 353.01, subdivision 20, a former spouse of the member, if any, is entitled to a portion of the monthly surviving spouse benefit if stipulated under the terms of a marriage dissolution decree that is filed with the association. If there is no surviving spouse or child or children, a former spouse may be entitled to a lump-sum refund payment under section 353.32, subdivision 1, if provided for in a marriage dissolution decree but not a monthly surviving spouse benefit even if required by the decree.\nPayments for the benefit of a dependent child or children, as defined in section 353.01, subdivision 15, must be made to the surviving parent, or to the legal guardian of the child. The maximum monthly benefit for a family must not exceed an amount equal to 70 percent of the member's specified average monthly salary, and the minimum benefit for a family including a 100 percent joint and survivor annuity under subdivision 1b, must not be less than 50 percent of the basic member's specified average monthly salary.\n(a) Prior to payment of a surviving spouse benefit under subdivision 1, the surviving spouse may elect to receive the 100 percent joint and survivor optional annuity under section 353.32, subdivision 1a, rather than a surviving spouse benefit.\n(b) If there is a dependent child or children, and the 100 percent joint and survivor optional annuity for the surviving spouse, when added to the dependent children's benefit under subdivisions 1 and 1a, exceeds an amount equal to 70 percent of the member's specified average monthly salary, the 100 percent joint and survivor annuity under section 353.32, subdivision 1a, must be reduced by the amount necessary so that the total family benefit does not exceed the 70 percent maximum family benefit amount under subdivision 1a.\n(c) The 100 percent joint and survivor optional annuity must be restored to the surviving spouse, plus applicable postretirement adjustments under Minnesota Statutes 2008, section 356.41, through January 1, 2009, and thereafter under section 356.415, as the dependent child or children become no longer dependent under section 353.01, subdivision 15.\nExcept for benefits provided under section 353.32, no survivor benefits are payable to the surviving spouse or dependent children of a deceased coordinated member.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\nAll benefits under this section and survivor benefits otherwise provided in this chapter when payable to persons qualifying therefor shall accrue on the date of death of a basic member or the first day of the month following the death of an annuitant or disabilitant. No payment may be made retroactively more than five months before the first of the month in which a complete application is received by the executive director, and no benefit shall accrue beyond the end of the month in which entitlement to such benefits has terminated.\nEvery claim or demand for a survivor benefit or spouse's annuity shall be initiated by written application in the manner and form prescribed by the executive director, filed in the office of the retirement association, showing compliance with the statutory conditions qualifying the applicant for such survivor benefit or spouse's annuity.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1977 c 429 s 65]\nA survivor benefit under subdivision 1 or 1b or section 353.32, subdivision 1a, 1b, or 1c, is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}