{
	"id": "144.1251",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1251",
	"title": "144.1251 NEWBORN SCREENING FOR CRITICAL CONGENITAL HEART DISEASE (CCHD).",
	"text": "(a) Each licensed hospital or state-licensed birthing center or facility that provides maternity and newborn care services shall provide screening for congenital heart disease to all newborns prior to discharge using pulse oximetry screening. The screening must occur after the infant is 24 hours old, before discharge from the nursery. If discharge occurs before the infant is 24 hours old, the screening must occur as close as possible to the time of discharge.\n(b) For premature infants (less than 36 weeks of gestation) and infants admitted to a higher-level nursery (special care or intensive care), pulse oximetry must be performed when medically appropriate prior to discharge.\n(c) Results of the screening must be reported to the Department of Health.\nThe Department of Health shall:\n(1) communicate the screening protocol requirements;\n(2) make information and forms available to the hospitals, birthing centers, and other facilities that are required to provide the screening; health care providers who provide prenatal care and care to newborns; and expectant parents and parents of newborns. The information and forms must include screening protocol and reporting requirements and parental options;\n(3) provide training to ensure compliance with and appropriate implementation of the screening;\n(4) establish the mechanism for the required data collection and reporting of screening and follow-up diagnostic results to the Department of Health according to the Department of Health's recommendations;\n(5) coordinate the implementation of universal standardized screening;\n(6) act as a resource for providers as the screening program is implemented, and in consultation with the Advisory Committee on Heritable and Congenital Disorders, develop and implement policies for early medical and developmental intervention services and long-term follow-up services for children and their families identified with a CCHD; and\n(7) comply with sections 144.125 to 144.128.",
	"repealed": false
}