{
	"id": "84.0272",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0272",
	"title": "84.0272 PROCEDURE IN ACQUIRING LANDS.",
	"text": "When the commissioner of natural resources is authorized to acquire lands or interests in lands the procedure set forth in this section shall apply. The commissioner of natural resources shall first prepare a fact sheet showing the lands to be acquired, the legal authority for their acquisition, and the qualities of the land that make it a desirable acquisition. The commissioner of natural resources shall cause the lands to be appraised. An appraiser shall before entering upon the duties of office take and subscribe an oath to faithfully and impartially discharge the duties as appraiser according to the best of the appraiser's ability and that the appraiser is not interested directly or indirectly in any of the lands to be appraised or the timber or improvements thereon or in the sale thereof and has entered into no agreement or combination to purchase the same or any part thereof, which oath shall be attached to the report of the appraisal. The commissioner of natural resources may pay less than the appraised value, but shall not agree to pay more than ten percent above the appraised value, except that if the commissioner pays less than the appraised value for a parcel of land, the difference between the purchase price and the appraised value may be used to apply to purchases at more than the appraised value. The sum of accumulated differences between appraised amounts and purchases for more than the appraised amount may not exceed the sum of accumulated differences between appraised amounts and purchases for less than the appraised amount. New appraisals may be made at the discretion of the commissioner of natural resources.\n(a) Notwithstanding subdivision 1, the commissioner may acquire permanent stream easements for angler access, fish management, and habitat work for a onetime payment based on a value attributed to both the stream and the easement corridor. The payment shall equal:\n(1) the per linear foot of stream within the easement corridor times $5; plus\n(2) the easement corridor acres times the estimated market value.\n(b) The estimated market value is equal to:\n(1) the agricultural market value plus the rural vacant market value plus the managed forest market value; divided by\n(2) the acres of agricultural land plus the rural vacant land plus the managed forest land.\n(c) The agricultural market value, rural vacant market value, and managed forest market value or equivalent are determined from data collected by the Department of Revenue during its annual spring mini abstract survey. If the Department of Revenue changes its property type groups for its annual spring mini abstract survey, the agricultural market value, the rural vacant market value, and the managed forest market value shall be determined by the commissioner from data collected by the Department of Revenue in a manner that provides the most reasonable substitute for the market values as presently reported. The commissioner must use the most recent available data for the city or township within which the easement corridor is located.\n(d) The commissioner shall periodically review the easement payment rates under this subdivision to determine whether the stream easement payments reflect current shoreland market values. If the commissioner determines that the easements do not reflect current shoreland market values, the commissioner shall report to the senate and house of representatives natural resources policy committees with recommendations for changes to this subdivision that are necessary for the stream easement payment rates to reflect current shoreland market values. The recommendations may include an adjustment to the dollar amount in paragraph (a), clause (1).\n(a) Notwithstanding subdivision 1, if the commissioner determines that lands or interests in land have a value less than $100,000, the commissioner may acquire the lands for the value determined by the commissioner without an appraisal. The commissioner shall make the determination based upon:\n(1) up to the most recent assessed market value of the land or interests in land as determined by the county assessor of the county in which the land or interests in land is located, plus ten percent;\n(2) a sale price of the land or interests in land, provided the sale occurred within the past year;\n(3) the sale prices of comparable Department of Natural Resources land sales or acquisitions of interests in land located in the vicinity and sold within the past year; or\n(4) an appraisal of the land or interests in land conducted within the past year.\n(b) In the event the value is less than $1,000, the commissioner may add a transaction incentive, provided that the sum of the incentive plus the value of the land does not exceed $1,000.\nThe commissioner shall utilize the valuation methods prescribed in subdivisions 2 and 3 only with prior consent of the landowner from whom the state proposes to purchase land or interests in land.\nParties to an easement purchased under the authority of the commissioner must:\n(1) specify in the easement all provisions that are perpetual in nature;\n(2) file the easement with the county recorder or registrar of titles in the county in which the land is located; and\n(3) submit an electronic copy of the easement to the commissioner.",
	"repealed": false
}