{
	"id": "103C.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.615",
	"title": "103C.615 ACTION ON PROJECT WITH ASSESSMENTS.",
	"text": "If part of the cost of the project is to be paid from the proceeds of assessments on benefited property, viewers must be appointed as provided in section 103E.305, and report as required by sections 103E.311, 103E.315, and 103E.321.\nThe board or joint board of county commissioners shall direct the petitioners or, with its consent, the district board or joint district board, to provide engineering services as necessary to produce final plans adequate for construction of the proposed improvement.\nThe county board or joint county board shall then give notice of and conduct a final hearing substantially in accordance with sections 103E.325 to 103E.341, as for a drainage proceeding, so far as the procedure is consistent with sections 103C.601 to 103C.635.\nIf the county board or joint county board determines that the total benefits to property are not as much as the amount payable from the proceeds of assessments as specified in the recommendation report of the district board, the petition shall be dismissed and further action on the project discontinued unless the county board or joint county board determines that the deficiency may be met by increasing the amount payable from other funds.\n(a) If it determines that the total benefits to property are as much as or more than the amount payable from the proceeds of assessments as specified in the report and that the other requirements of law have been complied with, the county board or joint county board shall by an order containing the findings establish the project as reported or amended and adopt and confirm the viewers' report as made or amended.\n(b) If the total amount of benefits to be assessed upon property pursuant to the viewers' report as confirmed is greater than the amount specified as payable from assessments in the report of the district board, the county board or joint county board may reduce the amounts payable from other sources in proportions it may determine.\n(c) Further action shall be taken as provided in chapter 103E, so far as is appropriate, except that each tract of land affected shall be assessed for the full amount of benefits, less damages, if any, as shown by the viewers' report as confirmed, unless the total amount of benefits, less damages, exceeds the total actual cost of the project to be paid from the assessments, in which case the cost shall be prorated as provided in section 103E.601.\n(a) Upon filing of the viewers' report as provided in this section, the county board of each county affected shall provide funds to meet its proportionate share of the total cost of the improvement, as shown by the report and order of the county board or joint county board. The county may issue bonds for the purpose in the amount necessary in the manner provided in section 103E.635.\n(b) The provision of section 103E.635, requiring the county board to let a contract for construction before issuing bonds does not apply to bonds issued to provide funds required to be furnished by this section.\n(a) The county board or joint county board, pursuant to agreement with the district board, may by resolution direct the district to undertake, construct, install, maintain, and operate the improvement upon mutually agreed terms. If it is necessary to acquire property by eminent domain, the county, or the counties acting jointly, shall do so and convey the property to the district pursuant to the agreement.\n(b) If, pursuant to an agreement, the responsibility for an improvement is vested in a district, the county treasurers shall transmit the proceeds of assessments or bond issues, when collected, to the treasurer of the district. The district treasurer shall credit the proceeds to the proper funds under the direction of the district board.",
	"repealed": false
}