{
	"id": "403.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.08",
	"title": "403.08 WIRELESS TELECOMMUNICATIONS SERVICE PROVIDER.",
	"text": "MS 2000 [Repealed by amendment, 2002 c 372 s 10]\nMS 2000 [Repealed by amendment, 2002 c 372 s 10]\nMS 2000 [Repealed by amendment, 2002 c 372 s 10]\nMS 2000 [Repealed by amendment, 2002 c 372 s 10]\nMS 2000 [Repealed by amendment, 2002 c 372 s 10]\nMS 2000 [Repealed by amendment, 2002 c 372 s 10]\nEach wireless telecommunications service provider shall cooperate in planning and implementing integration with enhanced 911 systems operating in their service territories to meet Federal Communications Commission-enhanced 911 standards. Each wireless telecommunications service provider shall annually develop and provide to the commissioner good-faith estimates of installation and recurring expenses to integrate wireless 911 service into the enhanced 911 networks to meet Federal Communications Commission phase one wireless enhanced 911 standards. The commissioner shall coordinate with counties and affected public safety agency representatives in developing a statewide design and plan for implementation.\nMS 2004 [Repealed, 2006 c 260 art 6 s 21]\nPlanning considerations must include cost, degree of integration into existing 911 systems, the retention of existing 911 infrastructure, and the potential implications of phase 2 of the Federal Communications Commission wireless enhanced 911 standards.\nCounties shall incorporate the statewide design when modifying county 911 plans to provide for integrating wireless 911 service into existing county 911 systems.\n(a) No wireless enhanced 911 emergency telecommunications service provider, its employees, or its agents are liable to any person for civil damages resulting from or caused by any act or omission in the development, design, installation, operation, maintenance, performance, or provision of enhanced 911 wireless service, except for willful or wanton misconduct.\n(b) No wireless carrier, its employees, or its agents are liable to any person who uses enhanced 911 wireless service for release of subscriber information required under this chapter to any public safety answering point.\nA provider of wireless telecommunications services shall notify its subscribers at the time of initial subscription and four times per year thereafter that a 911 emergency call made from a wireless telephone is not always answered by a local public safety answering point but may be routed to a State Patrol dispatcher and that, accordingly, the caller must provide specific information regarding the caller's location.",
	"repealed": false
}