{
	"id": "144G.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.56",
	"title": "144G.56 TRANSFER OF RESIDENTS WITHIN FACILITY.",
	"text": "For the purposes of this section, \"transfer\" means a move of a resident within the facility to a different room or other private living unit.\nA facility must provide for the safe, orderly, coordinated, and appropriate transfer of residents within the facility.\n(a) A facility must provide at least 30 calendar days' advance written notice to the resident and the resident's legal and designated representative of a facility-initiated transfer. The notice must include:\n(1) the effective date of the proposed transfer;\n(2) the proposed transfer location;\n(3) a statement that the resident may refuse the proposed transfer, and may discuss any consequences of a refusal with staff of the facility;\n(4) the name and contact information of a person employed by the facility with whom the resident may discuss the notice of transfer; and\n(5) contact information for the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities.\n(b) Notwithstanding paragraph (a), a facility may conduct a facility-initiated transfer of a resident with less than 30 days' written notice if the transfer is necessary due to:\n(1) conditions that render the resident's room or private living unit uninhabitable;\n(2) the resident's urgent medical needs; or\n(3) a risk to the health or safety of another resident of the facility.\nThe facility may not transfer a resident without first obtaining the resident's consent to the transfer unless:\n(1) there are conditions that render the resident's room or private living unit uninhabitable; or\n(2) there is a change in facility operations as described in subdivision 5.\nIn situations where there is a curtailment, reduction, or capital improvement within a facility necessitating transfers, the facility must:\n(1) minimize the number of transfers it initiates to complete the project or change in operations;\n(2) consider individual resident needs and preferences;\n(3) provide reasonable accommodations for individual resident requests regarding the transfers; and\n(4) in advance of any notice to any residents, legal representatives, or designated representatives, provide notice to the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities of the curtailment, reduction, or capital improvement and the corresponding needed transfers.\nIf a resident consents to a transfer, reasonable modifications must be made to the new room or private living unit that are necessary to accommodate the resident's disabilities. The facility must evaluate the resident's individual needs before deciding whether the room or unit to which the resident will be moved is appropriate to the resident's psychological, cognitive, and health care needs, including the accessibility of the bathroom.\nWhen entering into the assisted living contract, the facility must provide a conspicuous notice of the circumstance under which the facility may require a transfer, including any transfer that may be required if the resident will be receiving housing support under section 256I.06.",
	"repealed": false
}