{
	"id": "281.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/281.23",
	"title": "281.23 NOTICE.",
	"text": "In case any parcel of land bid in for the state at any tax judgment sale has not been redeemed by 120 days before the expiration of the period of redemption of such parcel, it shall be the duty of the county auditor thereupon forthwith to give notice of expiration of the time for redemption of such parcel, as herein provided; provided, that delay in giving such notice shall not affect the validity thereof.\nThe notice of expiration of redemption must contain the tax parcel identification numbers and legal descriptions of parcels subject to notice of expiration of redemption provisions prescribed under subdivision 1. The notice must also indicate the names of taxpayers and fee owners of record in the office of the county auditor at the time the notice is prepared and names of those parties who have filed their addresses according to section 276.041 and the amount of payment necessary to redeem as of the date of the notice. At the option of the county auditor, the current filed addresses of affected persons may be included on the notice. The notice is sufficient if substantially in the following form:\n\"NOTICE OF EXPIRATION OF REDEMPTION\nOffice of the County Auditor\nCounty of ......................., State of Minnesota.\nTo all persons having an interest in lands described in this notice:\nYou are notified that the parcels of land described in this notice and located in the county of ................................, state of Minnesota, are subject to forfeiture to the state of Minnesota because of nonpayment of delinquent property taxes, special assessments, penalties, interest, and costs levied on those parcels. The time for redemption from forfeiture expires if a redemption is not made by the later of (1) 60 days after service of this notice on all persons having an interest in the lands of record at the office of the county recorder or registrar of titles, or (2) by the second Monday in May. The redemption must be made in my office.\nIMPORTANT: If the parcels forfeit, they will be sold. If the proceeds from the sale exceed the total amount of the delinquent taxes, special assessments, penalties, interest, and costs assigned to those parcels, you may be entitled to the excess proceeds from the sale. If there are excess proceeds, you will be notified and must submit the claim form included with the notification in order to receive the proceeds.\nFAILURE TO REDEEM THE LANDS PRIOR TO THE EXPIRATION\nOF REDEMPTION WILL RESULT IN THE LOSS OF THE LAND AND\nFORFEITURE TO THE STATE OF MINNESOTA.\nInquiries as to these proceedings can be made to the County Auditor for ............... County, whose address is set forth below.\nWitness my hand and official seal this ............................ day of ................, .......\nThe notice must be posted by the auditor in the auditor's office, subject to public inspection, and must remain so posted until at least one week after the date of the last publication of notice, as provided in this section. Proof of posting must be made by the certificate of the auditor, filed in the auditor's office.\nAs soon as practicable after the posting of the notice prescribed in subdivision 2, the county auditor shall cause to be published for two successive weeks in the official newspaper of the county, the notice prescribed by subdivision 2.\nAn affidavit establishing proof of publication of the notice affidavit, as provided by law, must be filed in the office of the county auditor. A single published notice may include parcels of land bid in at different tax judgment sales, but included parcels must have a common year for expiration of redemption.\nForthwith after the commencement of such publication, the county auditor shall cause the notice of expiration of redemption to be mailed by certified mail, return receipt requested, to all real property taxpayers and fee owners and in addition to those parties who have filed their addresses pursuant to section 276.041. Proof of such mailing shall be made by the certificate of the auditor filed in the auditor's office. Failure to receive the notice shall not operate to postpone or excuse any default.\nIn this section, \"occupied parcel\" means a parcel containing a structure subject to property taxation.\nImmediately after the commencement of publication or mailing the county auditor shall deliver to the sheriff of the county or any other person not less than 18 years of age a sufficient number of copies of the notice of expiration of redemption for service on the persons in possession of all parcels of such land actually occupied, and documentation if the certified mail notice was returned as undeliverable or the notice was not mailed to the address associated with the property. Within 30 days after receipt of the notice, the sheriff or other person serving the notice shall investigate as necessary to ascertain whether or not the parcels covered by the notice are actually occupied parcels, and shall serve a copy of the notice of expiration of redemption upon the person in possession of each parcel found to be an occupied parcel, in the manner prescribed for serving summons in a civil action. If the sheriff or another person serving the notice has made at least two attempts to serve the notice of expiration of redemption, one between the weekday hours of 8:00 a.m. and 5:00 p.m. and the other on a different day and different time period, the sheriff or another person serving the notice may accomplish this service by posting a copy of the notice of expiration of redemption on a conspicuous location on the parcel. The sheriff or other person serving the notice shall make prompt return to the auditor as to all notices so served and as to all parcels found vacant and unoccupied and parcels served by posting. The return must be made on a copy of the notice and is prima facie evidence of the facts stated in it.\nIf the notice is served by the sheriff, the sheriff shall receive from the county, in addition to other compensation prescribed by law, fees and mileage for service on persons in possession as prescribed by law for such service in other cases, and shall also receive compensation for making investigation and return as to vacant and unoccupied lands as the county board may fix, subject to appeal to the district court as in case of other claims against the county. As to either service upon persons in possession or return as to vacant lands, the sheriff shall charge mileage only for one trip if the occupants of more than two tracts are served simultaneously, and in such case mileage must be prorated and charged equitably against all such owners.\nThe time for redemption of any parcel of land as to which notice of expiration has been given, as provided in subdivisions 2, 3, 5, and 6, shall expire 60 days after the giving of such notice and the filing of proof thereof in the office of the county auditor.\nThe cost of giving notice, as provided by subdivisions 2, 3, 5, and 6, shall be paid by the county. The county may recover costs incurred for posting, publishing, mailing, and serving the notice from the owner of the parcel that is the subject of the notice.\nAfter the time for redemption of any lands shall have expired after notice given, as provided in subdivisions 2, 3, 5, and 6, the county auditor shall execute a certificate describing the lands, specifying the tax judgment sale at which the same were bid in for the state, and stating that the time for redemption thereof has expired after notice given as provided by law and that absolute title thereto has vested in the state of Minnesota. Such certificate shall be recorded in the office of the county recorder, except that in case of registered land such certificate shall be recorded in the office of the registrar of titles. Such certificate and the record thereof shall be prima facie evidence of the facts therein stated, but failure to execute or record or file such certificate shall not affect the validity of any proceedings hereunder respecting such lands or the title of the state thereto.",
	"repealed": false
}