{
	"id": "144.192",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.192",
	"title": "144.192 TREATMENT OF BIOLOGICAL SPECIMENS AND HEALTH DATA HELD BY THE DEPARTMENT OF HEALTH AND HEALTH BOARDS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Biological specimen\" means tissue, fluids, excretions, or secretions that contain human DNA originating from an identifiable individual, either living or deceased. Biological specimen does not include infectious agents or chemicals that are isolated from a specimen. Nothing in this section or section 13.386 is intended to limit the commissioner's ability to collect, use, store, or disseminate such isolated infectious agents or chemicals.\n(c) \"Health data\" has the meaning given in section 13.3805, subdivision 1, paragraph (a), clause (2).\n(d) \"Health oversight\" means oversight of the health care system for activities authorized by law, limited to the following:\n(1) audits;\n(2) civil, administrative, or criminal investigations;\n(3) inspections;\n(4) licensure or disciplinary actions;\n(5) civil, administrative, or criminal proceedings or actions; and\n(6) other activities necessary for appropriate oversight of the health care system and persons subject to such governmental regulatory programs for which biological specimens or health data are necessary for determining compliance with program standards.\n(e) \"Individual\" has the meaning given in section 13.02, subdivision 8. In addition, for a deceased individual, individual also means the representative of the decedent.\n(f) \"Person\" has the meaning given in section 13.02, subdivision 10.\n(g) \"Program operations\" means actions, testing, and procedures directly related to the operation of department programs, limited to the following:\n(1) diagnostic and confirmatory testing;\n(2) laboratory quality control assurance and improvement;\n(3) calibration of equipment;\n(4) evaluation and improvement of test accuracy;\n(5) method development and validation;\n(6) compliance with regulatory requirements; and\n(7) continuity of operations to ensure that testing continues in the event of an emergency.\n(h) \"Public health practice\" means actions related to disease, conditions, injuries, risk factors, or exposures taken to protect public health, limited to the following:\n(1) monitoring the health status of a population;\n(2) investigating occurrences and outbreaks;\n(3) comparing patterns and trends;\n(4) implementing prevention and control measures;\n(5) conducting program evaluations and making program improvements;\n(6) making recommendations concerning health for a population;\n(7) preventing or controlling known or suspected diseases and injuries; and\n(8) conducting other activities necessary to protect or improve the health of individuals and populations for which biological specimens or health data are necessary.\n(i) \"Representative of the decedent\" has the meaning given in section 13.10, subdivision 1, paragraph (c).\n(j) \"Research\" means activities that are not program operations, public health practice, or health oversight and is otherwise defined in Code of Federal Regulations, title 45, part 46, subpart A, section 46.102 (d).\n(a) The commissioner may collect, use, store, and disseminate biological specimens and health data, genetic or other, as provided in this section and as authorized under any other provision of applicable law, including any rules adopted on or before June 30, 2013. Any rules adopted after June 30, 2013, must be consistent with the requirements of this section.\n(b) The provisions in this section supplement other provisions of law and do not supersede or repeal other provisions of law applying to the collection, use, storage, or dissemination of biological specimens or health data.\n(c) For purposes of this section, genetic information is limited to biological specimens and health data.\n(a) The commissioner may collect, use, store, and disseminate biological specimens and health data to conduct program operations activities, public health practice activities, and health oversight activities. Unless required under other applicable law, consent of an individual is not required under this subdivision.\n(b) With the approval of the commissioner, biological specimens may be disseminated to establish a diagnosis, to provide treatment, to identify persons at risk of illness, or to conduct an epidemiologic investigation to control or prevent the spread of serious disease, or to diminish an imminent threat to the public health.\n(c) For purposes of Clinical Laboratory Improvement Amendments proficiency testing, the commissioner may disseminate de-identified biological specimens to state public health laboratories that agree, pursuant to contract, not to attempt to re-identify the biological specimens.\n(d) Health data may be disseminated as provided in section 13.3805, subdivision 1, paragraph (b).\nThe commissioner may collect, use, store, and disseminate biological specimens and health data to conduct research in a manner that is consistent with the federal common rule for the protection of human subjects in Code of Federal Regulations, title 45, part 46.\n(a) The commissioner shall store health data according to section 138.17.\n(b) The commissioner shall store biological specimens according to a specimen storage schedule. The commissioner shall develop the storage schedule by July 1, 2013, and post it on the department's website.\nThe commissioner shall establish appropriate security safeguards for the storage of biological specimens, with regard for the privacy of the individuals from whom the biological specimens originated, and store the biological specimens accordingly. When a biological specimen is disposed of, it must be destroyed in a way that prevents determining the identity of the individual from whom it originated.\nThe provisions of subdivisions 2; 3, paragraphs (a), (c), and (d); and 4 to 6 pertaining to the commissioner also apply to community health boards organized under chapter 145A. These boards may also disseminate health data pursuant to section 13.3805, subdivision 1, paragraph (b), clause (2).",
	"repealed": false
}