{
	"id": "299A.299",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.299",
	"title": "299A.299 MULTIDISCIPLINARY CHEMICAL ABUSE PREVENTION TEAM.",
	"text": "A county, a multicounty organization of counties formed by an agreement under section 471.59, or a city with a population of no more than 50,000, may establish a multidisciplinary chemical abuse prevention team. The chemical abuse prevention team may include, but not be limited to, representatives of health, mental health, public health, law enforcement, educational, social service, court service, community education, religious, and other appropriate agencies, and parent and youth groups. For purposes of this section, \"chemical abuse\" has the meaning given in section 254A.02, subdivision 6a. When possible the team must coordinate its activities with existing local groups, organizations, and teams dealing with the same issues the team is addressing.\n(a) A multidisciplinary chemical abuse prevention team shall:\n(1) assist in coordinating chemical abuse prevention and treatment services provided by various groups, organizations, and agencies in the community;\n(2) disseminate information on the chemical abuse prevention and treatment services that are available within the community in which the team is established;\n(3) develop and conduct educational programs on chemical abuse prevention for adults and youth within the community in which the team is established;\n(4) conduct activities to address other high-risk behaviors related to chemical abuse, including, but not limited to, suicide, delinquency, and family violence; and\n(5) conduct other appropriate chemical abuse prevention activities.\n(b) The team, in carrying out its duties under this subdivision, must focus on chemical abuse issues and needs unique to the community in which the team is established. In defining the needs and goals of the team, the team shall consult with the governmental body of the city or county in which the team is established. When a team is established in a multicounty area, the team shall consult with representatives of the county boards of each county.\n(c) The team, in carrying out its duties, shall comply with the Government Data Practices Act in chapter 13, and requirements for confidentiality of records under Code of Federal Regulations, title 42, sections 2.1 to 2.67, as amended through December 31, 1988, and section 254A.09.\nThe commissioner of public safety may award a grant to a county, multicounty organization, or city, as described in subdivision 1, for establishing and operating a multidisciplinary chemical abuse prevention team. The commissioner may approve up to five applications for grants under this subdivision. The grant funds must be used to establish a multidisciplinary chemical abuse prevention team to carry out the duties in subdivision 2.\nThe commissioner shall develop a process for administering grants under subdivision 3. The process must be compatible with the community grant program under the Drug Free Schools and Communities Act, Public Law 100-690. The process for administering the grants must include establishing criteria the commissioner shall apply in awarding grants. The commissioner shall issue requests for proposals for grants under subdivision 3. The request must be designed to obtain detailed information about the applicant and other information the commissioner considers necessary to evaluate and select a grant recipient. The applicant shall submit a proposal for a grant on a form and in a manner prescribed by the commissioner. The commissioner shall award grants under this section so that 50 percent of the funds appropriated for the grants go to the metropolitan area comprised of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington Counties, and 50 percent of the funds go to the area outside the metropolitan area. The process for administering the grants must also include procedures for monitoring the recipients' use of grant funds and reporting requirements for grant recipients.",
	"repealed": false
}