{
	"id": "336.9-503",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-503",
	"title": "336.9-503 NAME OF DEBTOR AND SECURED PARTY.",
	"text": "(a) Sufficiency of debtor's name. A financing statement sufficiently provides the name of the debtor:\n(1) except as otherwise provided in paragraph (3), if the debtor is a registered organization or the collateral is held in a trust that is a registered organization, only if the financing statement provides the name that is stated to be the registered organization's name on the public organic record most recently filed with or issued or enacted by the registered organization's jurisdiction of organization which purports to state, amend, or restate the registered organization's name;\n(2) subject to subsection (f), if the collateral is being administered by the personal representative of a decedent, only if the financing statement provides, as the name of the debtor, the name of the decedent and, in a separate part of the financing statement, indicates that the collateral is being administered by a personal representative;\n(3) if the collateral is held in a trust that is not a registered organization, only if the financing statement:\n(A) provides, as the name of the debtor:\n(i) if the organic record of the trust specifies a name for the trust, the name specified; or\n(ii) if the organic record of the trust does not specify a name for the trust, the name of the settlor or testator; and\n(B) in a separate part of the financing statement:\n(i) if the name is provided in accordance with subparagraph (A)(i), indicates that the collateral is held in a trust; or\n(ii) if the name is provided in accordance with subparagraph (A)(ii), provides additional information sufficient to distinguish the trust from other trusts having one or more of the same settlors or the same testator and indicates that the collateral is held in a trust, unless the additional information so indicates;\n(4) subject to subsection (g), if the debtor is an individual to whom this state has issued a driver's license or state identification card that has not expired, only if the financing statement provides the name of the individual which is indicated on the driver's license or state identification card;\n(5) if the debtor is an individual to whom paragraph (4) does not apply, only if the financing statement provides the individual name of the debtor or the surname and first personal name of the debtor; and\n(6) in other cases:\n(A) if the debtor has a name, only if the financing statement provides the organizational name of the debtor; and\n(B) if the debtor does not have a name, only if it provides the names of the partners, members, associates, or other persons comprising the debtor, in a manner that each name provided would be sufficient if the person named were the debtor.\n(b) Additional debtor-related information. A financing statement that provides the name of the debtor in accordance with subsection (a) is not rendered ineffective by the absence of:\n(1) a trade name or other name of the debtor; or\n(2) unless required under subsection (a)(6)(B), names of partners, members, associates, or other persons comprising the debtor.\n(c) Debtor's trade name insufficient. A financing statement that provides only the debtor's trade name does not sufficiently provide the name of the debtor.\n(d) Representative capacity. Failure to indicate the representative capacity of a secured party or representative of a secured party does not affect the sufficiency of a financing statement.\n(e) Multiple debtors and secured parties. A financing statement may provide the name of more than one debtor and the name of more than one secured party.\n(f) Name of decedent. The name of the decedent indicated on the order appointing the personal representative of the decedent issued by the court having jurisdiction over the collateral is sufficient as the \"name of the decedent\" under subsection (a)(2).\n(g) Multiple driver's licenses or state identification cards. If this state has issued to an individual more than one driver's license or state identification card of a kind described in subsection (a)(4), the one that was issued most recently is the one to which subsection (a)(4) refers.\n(h) Definition. In this section, the \"name of the settlor or testator\" means:\n(1) if the settlor is a registered organization, the name that is stated to be the settlor's name on the public organic record most recently filed with or issued or enacted by the settlor's jurisdiction of organization which purports to state, amend, or restate the settlor's name; or\n(2) in other cases, the name of the settlor or testator indicated in the trust's organic record.",
	"repealed": false
}