{
	"id": "383B.913",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.913",
	"title": "383B.913 LEASE OR TRANSFER OF ASSETS.",
	"text": "The corporation shall be considered a \"public corporation\" for purposes of section 465.035.\nNotwithstanding any other laws to the contrary, as of the effective date, the county shall have the authority to enter into a lease, mutually agreeable to both parties, with the corporation for substantially all of the real property acquired by or turned over to the county for the establishment, operation, or maintenance of HCMC prior to and as of the effective date and necessary for the operation of the corporation. Subject to restrictions specified in the written lease and other transaction documents by and between the county and the corporation, the county shall lease the real property exclusively to the corporation. For the purposes of this subdivision, real property shall mean the real property used by the county for the operations of HCMC that the county shall lease to Hennepin Healthcare System, Inc., as specified in the lease documents and Laws 2005, chapter 125, as of the effective date.\nIn order for the county to enter into the lease described in subdivision 2, the lease must also address the following:\n(1) continued primary use of the property for health and hospital services;\n(2) indigent care;\n(3) capital improvements;\n(4) joint ventures and partnerships;\n(5) assignments and subleases; and\n(6) changes to hospital capacity.\nThe county shall transfer to the corporation assets as designated by the county in transactional documents accompanying the lease for use in the operations of HCMC. For purposes of this subdivision, assets means the equipment and other personal property used by the county for the operations of HCMC that the county shall transfer to Hennepin Healthcare System, Inc., as specified in the transaction documents and Laws 2005, chapter 125, as of the effective date.\nThe county may transfer and lease the assets and real property to the corporation as specified in subdivisions 2 and 3 without first advertising for or soliciting any bids.",
	"repealed": false
}