{
	"id": "124E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.05",
	"title": "124E.05 AUTHORIZERS.",
	"text": "(a) The organizations in this subdivision may authorize one or more charter schools.\n(b) A school board, intermediate school district school board, or education district organized under sections 123A.15 to 123A.19 may authorize a charter school.\n(c) A charitable organization under section 501(c)(3) of the Internal Revenue Code of 1986 may authorize a charter school, if the organization:\n(1) is registered with the attorney general's office;\n(2) is incorporated in the state of Minnesota and has been operating continuously for at least five years but does not operate a charter school; and\n(3) is not:\n(i) a nonpublic sectarian or religious institution;\n(ii) any person other than a natural person that directly or indirectly, through one or more intermediaries, controls, is controlled by, or is under common control with the nonpublic sectarian or religious institution; or\n(iii) any other charitable organization under this paragraph that in the federal IRS Form 1023, Part IV, describes activities indicating a religious purpose.\n(d) A Minnesota private college that grants two- or four-year degrees and is registered with the Minnesota Office of Higher Education under chapter 136A may authorize a charter school, notwithstanding paragraph (c).\n(e) A state college or university governed by the Board of Trustees of the Minnesota State Colleges and Universities may authorize a charter school.\n(f) The University of Minnesota may authorize a charter school.\n(g) A nonprofit corporation subject to chapter 317A, described in section 317A.905 and exempt from federal income tax under section 501(c)(6) of the Internal Revenue Code of 1986, may authorize one or more charter schools if the charter school has operated for at least three years under a different authorizer and if the nonprofit corporation has existed for at least 25 years.\n(h) A single-purpose authorizer formed as a charitable, nonsectarian organization under section 501(c)(3) of the Internal Revenue Code of 1986 and incorporated in the state of Minnesota under chapter 317A as a corporation with no members or under section 322C.1101 as a nonprofit limited liability company for the sole purpose of chartering schools may authorize a charter school. An eligible organization interested in being approved as an authorizer under this paragraph must submit a proposal to the commissioner that includes the provisions of subdivision 3 and a five-year financial plan. A single-purpose authorizer under this paragraph shall consider and approve charter school applications using the criteria under section 124E.06 and shall not limit the applications it solicits, considers, or approves to any single curriculum, learning program, or method.\n(a) The role of an authorizer is to ensure that a school it authorizes has the autonomy granted by statute, fulfills the purposes of a charter school, and is accountable to the agreed upon terms of the charter school contract in order to safeguard quality educational opportunities for students and maintain public trust and confidence.\n(b) An authorizer has the following responsibilities:\n(1) to review applications for new schools, determine whether a new school is ready to open, review applications for grade and site expansions, review applications for change in authorizers, and determine whether to approve or deny an application based on the authorizer's approved criteria;\n(2) to negotiate and execute the performance charter contracts with the schools it authorizes;\n(3) to conduct ongoing monitoring, oversight, and evaluation of the school's academic, operational, and financial performance during the term of the charter contract;\n(4) to evaluate the academic, operational, and financial performance of the school as defined in the charter contract prior to the end of the contract to determine the renewal, nonrenewal, or termination of the contract; and\n(5) to comply with authorizer requirements in chapter 124E.\n(c) An authorizer must document in the authorizer annual report under section 124E.16, subdivision 2, paragraph (b), the annual successful completion of training of its staff members during the previous year relative to chartering and an authorizer's role and responsibilities.\n(d) An authorizer must participate in department-approved training.\n(a) An eligible organization under this section must apply to the commissioner for approval as an authorizer before submitting any affidavit to the commissioner to charter a school. The application for approval as a charter school authorizer must show the applicant's ability to implement the procedures and satisfy the criteria for chartering a school under this chapter. The commissioner must approve or disapprove the application within 45 business days of the deadline for that application period. If the commissioner disapproves the application, the commissioner must notify the applicant of the specific deficiencies in writing and the applicant then has 20 business days to address the deficiencies to the commissioner's satisfaction. After the 20 business days expire, the commissioner has 15 business days to make a final decision to approve or disapprove the application. Failing to address the deficiencies to the commissioner's satisfaction makes an applicant ineligible to be an authorizer. The commissioner, in establishing criteria to approve an authorizer, consistent with subdivision 4, must consider the applicant's:\n(1) infrastructure and capacity to serve as an authorizer;\n(2) application criteria and process;\n(3) contracting process;\n(4) ongoing oversight and evaluation processes; and\n(5) renewal criteria and processes.\n(b) A disapproved applicant under this section may resubmit an application during a future application period.\n(a) To be approved as an authorizer, an applicant must include in its application to the commissioner at least the following:\n(1) how the organization carries out its mission by chartering schools;\n(2) a description of the capacity of the organization to serve as an authorizer, including the positions allocated to authorizing duties, the qualifications for those positions, the full-time equivalencies of those positions, and the financial resources available to fund the positions;\n(3) the application and review process the authorizer uses to decide whether to grant charters;\n(4) the type of contract it arranges with the schools it charters to meet the provisions of section 124E.10;\n(5) the process for overseeing the school, consistent with clause (4), to ensure that the schools chartered comply with applicable law and rules and the contract;\n(6) the criteria and process the authorizer uses to approve applications adding grades or sites under section 124E.06, subdivision 5;\n(7) the process for renewing or terminating the school's charter based on evidence showing the academic, organizational, and financial competency of the school, including its success in increasing student achievement and meeting the goals of the charter school agreement; and\n(8) an assurance specifying that the organization is committed to serving as an authorizer until the commissioner terminates the organization's ability to authorize charter schools under subdivision 6 or the organization formally withdraws as an approved authorizer under subdivision 7.\n(b) Notwithstanding paragraph (a), an authorizer that is a school district may satisfy the requirements of paragraph (a), clauses (1) and (2), and any requirement governing a conflict of interest between an authorizer and its charter schools or ongoing evaluation or continuing education of an administrator or other professional support staff by submitting to the commissioner a written promise to comply with the requirements.\n(a) The commissioner shall review an authorizer's performance every five years in a manner and form determined by the commissioner, subject to paragraphs (b) and (c), and may review an authorizer's performance more frequently at the commissioner's own initiative or at the request of a charter school chief administrator, charter school board of directors, or other interested party. The commissioner, after completing the review, shall transmit a report with findings to the authorizer and the schools authorized by the authorizer.\n(b) Consistent with this subdivision, the commissioner must:\n(1) develop the criteria and process of the performance review system in consultation with authorizers, school administrators, charter school boards of directors, and other charter school stakeholders;\n(2) publish the authorizer performance review criteria and process at least 12 months before any change or process takes effect, except for changes required to take effect earlier in accordance with state or federal law or to make technical changes;\n(3) evaluate the authorizer's performance on adherence and implementation of the authorizer's policies, procedures, and processes that are subject to section 124E.05, subdivision 2, paragraph (b);\n(4) solicit feedback from the authorizer, charter school administrators, and charter school boards of directors; and\n(5) use existing department data on the authorizer to minimize duplicate reporting to the extent practicable.\n(c) Consistent with this subdivision the commissioner must not penalize in any way an authorizer for not chartering additional schools or for the absence of complaints against an authorizer or an authorizer's portfolio of schools.\n(a) If, consistent with this chapter, the commissioner finds that an authorizer has not met the requirements of this chapter, the commissioner may subject the authorizer to a corrective action plan, which may last no longer than 130 business days. The commissioner may prohibit an authorizer on a corrective plan from accepting a transfer application from a charter school and an application to establish a charter school.\n(b) The commissioner must notify the authorizer in writing that the authorizer has been placed on a corrective plan. The notice must include any findings that may subject the authorizer to corrective action at the conclusion of the corrective plan and the authorizer then has 15 business days to request an informal hearing before the commissioner takes corrective action. The commissioner must hold an informal hearing within 15 business days of the request. If the issues identified as the basis for the corrective action are not resolved at the informal hearing, the authorizer must make the requested improvements and notify the commissioner of the improvements within 45 business days. Within 20 business days, the commissioner must review the changes and notify the authorizer of any remaining issues to be resolved. An authorizer must address the remaining issues as directed by the commissioner within 20 business days. Within 15 business days, the commissioner must review the changes and notify the authorizer whether all issues in the corrective plan have been resolved.\n(c) If the commissioner terminates the authorizer's ability to charter a school, the commissioner must assist the affected charter school in acquiring a new authorizer. A charter school board of directors may submit to the commissioner a request to transfer to a new authorizer without the approval or consent of the current authorizer if that authorizer has been under a corrective action plan for more than 130 business days.\n(d) The commissioner may at any time take corrective action against an authorizer, including terminating an authorizer's ability to charter a school, terminating a contract with a charter school, and other appropriate sanctions for:\n(1) failing to demonstrate the criteria under subdivision 3 under which the commissioner approved the authorizer;\n(2) violating a term of the chartering contract between the authorizer and the charter school board of directors;\n(3) unsatisfactory performance as an approved authorizer;\n(4) any good cause shown that gives the commissioner a legally sufficient reason to take corrective action against an authorizer; or\n(5) failing to meet the terms of a corrective action plan by the specified deadline.\nIf the governing board of an approved authorizer votes to withdraw as an approved authorizer for a reason unrelated to any cause under subdivision 6, the authorizer must notify all its chartered schools and the commissioner in writing by March 1 of its intent to withdraw as an authorizer on June 30 in the next calendar year. Upon notification of the schools and commissioner, the authorizer must provide a letter to the school for distribution to families of students enrolled in the school that explains the decision to withdraw as an authorizer. The commissioner may approve the transfer of a charter school to a new authorizer under section 124E.10, subdivision 5.\nBy September 30 of each year, an authorizer shall submit to the commissioner a statement of income and expenditures related to chartering activities during the previous school year ending June 30. The authorizer must transmit a copy of the statement to all schools it charters.",
	"repealed": false
}