{
	"id": "15.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.06",
	"title": "15.06 APPOINTMENT OF DEPARTMENT HEADS; TERMS; DEPUTIES.",
	"text": "This section applies to the following departments or agencies: the Departments of Administration; Agriculture; Children, Youth, and Families; Commerce; Corrections; Education; Employment and Economic Development; Health; Human Rights; Human Services; Iron Range Resources and Rehabilitation; Labor and Industry; Management and Budget; Natural Resources; Public Safety; Revenue; Transportation; and Veterans Affairs; the Housing Finance and Pollution Control Agencies; the Department of Information Technology Services; the Bureau of Mediation Services; and their successor departments and agencies. The heads of the foregoing departments or agencies are \"commissioners.\"\n[Repealed, 2013 c 134 s 31]\nThe term of a commissioner shall end with the term of the office of governor. In addition, the term shall end if the governor vacates office. The appointing authority shall submit to the president of the senate the name of an appointee as permanent commissioner as provided by section 15.066, subdivision 2, within 45 legislative days after the end of the term of a commissioner and within 45 legislative days after the occurrence of a vacancy. The appointee shall take office as permanent commissioner when the senate notifies the appointing authority that it has consented to the appointment. A commissioner shall serve at the pleasure of the appointing authority.\nThe purpose of this subdivision is to provide a procedure to insure the immediate accession to office of a temporary commissioner in the event of a vacancy in the office of commissioner. If at the end of a term of a commissioner the incumbent commissioner is not designated as acting commissioner pursuant to subdivision 4, or if a vacancy occurs in the office of a commissioner, the deputy commissioner as defined in subdivision 7 shall immediately become temporary commissioner without further official action. If there is more than one deputy commissioner, the appointing authority of the commissioner shall designate which of the deputies shall be temporary commissioner. If there is no deputy commissioner, the appointing authority of the commissioner shall designate a temporary commissioner.\nThe purpose of this subdivision is to provide alternative means whereby an appointing authority may designate a person other than a temporary commissioner to serve as acting commissioner until advice and consent of the senate is received in respect to a permanent appointee. These alternative means include the following:\n(1) At the end of the term of a commissioner, the incumbent commissioner may at the discretion of the appointing authority serve as acting commissioner until a successor is appointed and qualifies.\n(2) An appointing authority may appoint a person other than a deputy to serve as acting commissioner and to replace any other acting or temporary commissioner designated pursuant to subdivision 3 or 4.\n(3) Prior to the advice and consent of the senate, the appointing authority may designate the permanent appointee as commissioner.\nA person who is designated acting commissioner or temporary commissioner pursuant to subdivisions 3 or 4 shall immediately have all the powers and emoluments and perform all the duties of the office. A person who is designated permanent commissioner shall have all the powers and may perform all the duties of the office upon receipt of the letter of appointment by the president of the senate pursuant to section 15.066. Upon the appointment of a permanent commissioner or acting commissioner to succeed any other acting or temporary commissioner, the subsequent appointee shall immediately take the place of any other acting or temporary commissioner. No person shall serve as a permanent commissioner or acting commissioner after the senate has voted to refuse to consent to the person's appointment as permanent commissioner. Notice of the designation of a commissioner or acting commissioner, or the assumption of office by a temporary commissioner, shall be filed with the president of the senate and the speaker of the house with a copy delivered to the secretary of state and published in the next available edition of the State Register.\nExcept as otherwise expressly provided by law, a commissioner shall have the following powers:\n(1) to delegate to any subordinate employee the exercise of specified statutory powers or duties as the commissioner may deem advisable, subject to the commissioner's control; provided, that every delegation shall be made by written order, filed with the secretary of state; and further provided that only a deputy commissioner may have all the powers or duties of the commissioner;\n(2) to appoint all subordinate employees and to prescribe their duties; provided, that all departments and agencies shall be subject to the provisions of chapter 43A;\n(3) with the approval of the commissioner of administration, to organize the department or agency as deemed advisable in the interest of economy and efficiency; and\n(4) to prescribe procedures for the internal management of the department or agency to the extent that the procedures do not directly affect the rights of or procedure available to the public.\nFor purposes of this section, a \"deputy commissioner\" shall also include a \"deputy director\" when the department head bears the title \"director\". A deputy commissioner of a department or agency specified in subdivision 1 shall be in the unclassified civil service and shall be immediately subordinate to the commissioner. The deputy commissioner shall have all the powers and authority of the commissioner unless the commissioner directs otherwise, and shall speak for the commissioner within and without the department or agency. The primary duty of a deputy shall be to assist the commissioner in the general management of the entire department or agency or of major parts thereof, and shall not consist of operating single functional areas. A deputy commissioner serves at the pleasure of the commissioner.\nUnless specifically authorized by statute, no department or agency specified in subdivision 1 shall have more than one deputy commissioner.\nNo former commissioner or deputy commissioner may, within one year after leaving the position of commissioner or deputy commissioner in a department or agency, appear or participate in proceedings of that department or agency representing the interests of private persons.",
	"repealed": false
}