{
	"id": "148.916",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.916",
	"title": "148.916 GUEST LICENSURE.",
	"text": "(a) A nonresident of the state of Minnesota who is not seeking licensure in this state and who has been issued a license, certificate, or registration by another jurisdiction to practice psychology and who intends to practice in Minnesota for more than 30 days shall apply to the board for guest licensure. The psychologist's practice in Minnesota is limited to no more than nine consecutive months per calendar year. Application under this section shall be made no less than 30 days prior to the expected date of practice in Minnesota and shall be subject to approval by the board or its designee.\n(b) To be eligible for licensure under this section, the applicant must:\n(1) have a license, certification, or registration to practice psychology from another jurisdiction;\n(2) have a doctoral degree in psychology from a regionally accredited institution;\n(3) be of good moral character;\n(4) have no pending complaints or active disciplinary or corrective actions in any jurisdiction;\n(5) pass a professional responsibility examination designated by the board; and\n(6) pay a fee to the board.\n(a) An applicant who is seeking licensure in this state, and who, at the time of application, is licensed, certified, or registered to practice psychology in another jurisdiction at the doctoral level may apply to the board for guest licensure in order to begin practicing psychology in this state while their application is being processed if the applicant is of good moral character and has no complaints, corrective, or disciplinary action pending in any jurisdiction.\n(b) Application under this subdivision shall be made no less than 30 days prior to the expected date of practice in this state, and must be made concurrently or after submission of an application for licensure as a licensed psychologist if applicable. Applications under this subdivision are subject to approval by the board or its designee. The board shall charge a fee for guest licensure under this subdivision.\n(c) A guest license issued under this subdivision shall be valid for one year from the date of issuance, or until the board has either issued a license or has denied the applicant's application for licensure, whichever is earlier. Guest licenses issued under this subdivision may be renewed annually until the board has denied the applicant's application for licensure.\nNotwithstanding subdivision 1, a nonresident of the state of Minnesota, who is not seeking licensure in this state, may serve as an expert witness, organizational consultant, presenter, or educator without obtaining guest licensure, provided the person is appropriately trained, educated, or has been issued a license, certificate, or registration by another jurisdiction.\nThe requirements of subdivision 1 do not apply to psychologists sent to this state for the sole purpose of responding to a disaster or emergency relief effort of this state government, the federal government, the American Red Cross, or other disaster or emergency relief organization as long as the psychologist is not practicing in Minnesota for longer than 30 days and the American Red Cross, disaster or emergency relief organization, or government can certify the psychologist's assignment in this state. The board or its designee, at its discretion, may grant an extension to the 30-day time limitation of this subdivision.\nA person's privilege to practice under this section is subject to the prohibitions and sanctions for unprofessional or unethical conduct contained in Minnesota laws and rules.",
	"repealed": false
}