{
	"id": "142D.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.25",
	"title": "142D.25 EARLY LEARNING SCHOLARSHIPS.",
	"text": "An early learning scholarships program is established to close the opportunity gap by increasing access to high-quality early childhood programs.\n(a) For a family to receive an early learning scholarship, parents or guardians must have an eligible child and meet at least one of the following requirements:\n(1) have income equal to or less than:\n(i) the at-application rate specified in section 142E.10, subdivision 1, paragraph (a), clause (2), in the current calendar year; or\n(ii) beginning July 1, 2025, the rate specified in United States Code, title 42, section 9858n(4)(B), as adjusted for family size;\n(2) be able to document their child's current participation in the free and reduced-price meals program or Child and Adult Care Food Program, National School Lunch Act, United States Code, title 42, sections 1751 and 1766; the Food Distribution Program on Indian Reservations, Food and Nutrition Act, United States Code, title 7, sections 2011-2036; Head Start under the federal Improving Head Start for School Readiness Act of 2007; Minnesota family investment program under chapter 142G; child care assistance programs under chapter 142E; the supplemental nutrition assistance program; or\n(3) have or be a child referred as in need of child protection services or placed in foster care under section 260C.212.\n(b) An \"eligible child\" means a child who has not yet enrolled in kindergarten and is not yet five years of age on September 1 of the current school year.\n(c) A child who has received a scholarship under this section must continue to receive a scholarship each year until that child is eligible for kindergarten under section 120A.20 and as long as funds are available.\n(d) Early learning scholarships may not be counted as earned income for the purposes of medical assistance under chapter 256B, MinnesotaCare under chapter 256L, Minnesota family investment program under chapter 142G, child care assistance programs under chapter 142E, or Head Start under the federal Improving Head Start for School Readiness Act of 2007.\n(e) A child from an adjoining state whose family resides at a Minnesota address as assigned by the United States Postal Service, who has received developmental screening under sections 142D.09 to 142D.093, who intends to enroll in a Minnesota school district, and whose family meets the criteria of paragraph (a) is eligible for an early learning scholarship under this section.\n(a) The commissioner shall establish application timelines and determine the schedule for awarding scholarships that meet the operational needs of eligible families and programs.\n(b) The commissioner must give highest priority to applications from children who:\n(1) are not yet four years of age;\n(2) have a parent under age 21 who is pursuing a high school diploma or a course of study for a high school equivalency test;\n(3) are in foster care;\n(4) have been referred as in need of child protection services;\n(5) have an incarcerated parent;\n(6) are in or have a parent in a substance use treatment program;\n(7) are in or have a parent in a mental health treatment program;\n(8) have experienced domestic violence;\n(9) have an individualized education program or individualized family service plan; or\n(10) have experienced homelessness in the last 24 months, as defined under the federal McKinney-Vento Homeless Assistance Act, United States Code, title 42, section 1143a.\n(c) Notwithstanding paragraph (b), beginning July 1, 2025, the commissioner must give highest priority to applications from children in families with income equal to or less than the rate specified under subdivision 2, paragraph (a), clause (1), item (i), and within this group must prioritize children who meet one or more of the criteria listed in paragraph (b).\n(d) The commissioner may prioritize applications on additional factors, including but not limited to availability of funding, family income, geographic location, and whether the child's family is on a waiting list for a publicly funded program providing early education or child care services.\n(a) The commissioner shall establish a schedule of tiered per-child scholarship amounts based on the results of the rate survey conducted under section 142E.02, subdivision 7, the cost of providing high-quality early care and learning to children in varying circumstances, a family's income, and geographic location.\n(b) Notwithstanding paragraph (a), a program that has a four-star rating under section 142D.13 must receive, for each scholarship recipient who meets the criteria in subdivision 3, paragraph (b) or (c), an amount not less than the cost to provide full-time care at the 75th percentile of the most recent market rate survey under section 142E.02, subdivision 7.\n(c) A four-star rated program that has children eligible for a scholarship enrolled in or on a waiting list for a program beginning in July, August, or September may notify the commissioner, in the form and manner prescribed by the commissioner, each year of the program's desire to enhance program services or to serve more children than current funding provides. The commissioner may designate a predetermined number of scholarship slots for that program and notify the program of that number. For fiscal year 2018 and later, the statewide amount of funding directly designated by the commissioner must not exceed the funding directly designated for fiscal year 2017. Beginning July 1, 2016, a school district or Head Start program qualifying under this paragraph may use its established registration process to enroll scholarship recipients and may verify a scholarship recipient's family income in the same manner as for other program participants.\n(d) A scholarship is awarded for a 12-month period. If the scholarship recipient has not been accepted and subsequently enrolled in a rated program within three months of the awarding of the scholarship, the scholarship cancels and the recipient must reapply in order to be eligible for another scholarship. An extension may be requested if a program is unavailable for the child within the three-month timeline. A child may not be awarded more than one scholarship in a 12-month period.\n(e) A child who receives a scholarship who has not completed development screening under sections 142D.09 to 142D.093 must complete that screening within 90 days of first attending an eligible program or within 90 days after the child's third birthday if awarded a scholarship under the age of three.\n(f) A school district or Head Start program enrolling scholarship recipients under paragraph (c) may apply to the commissioner, in the form and manner prescribed by the commissioner, for direct payment of state aid. Upon receipt of the application, the commissioner must pay each program directly for each approved scholarship recipient enrolled under paragraph (c) according to the metered payment system or another schedule established by the commissioner. This paragraph expires upon implementation of the processes required under paragraph (g).\n(g) Beginning January 1, 2026, to the extent funding is available under subdivision 7, paragraph (f), the commissioner must:\n(1) make scholarship payments to eligible programs in advance of or at the beginning of the delivery of services based on an approved scholarship recipient's enrollment; and\n(2) implement a process for transferring scholarship awards between eligible programs, when initiated by a scholarship recipient. Under the process, the commissioner:\n(i) may adjust scholarship payment schedules for eligible programs to account for changes in a scholarship recipient's enrollment; and\n(ii) must specify a period of time for which scholarship payments must continue to an eligible program for a scholarship recipient who transfers to a different eligible program.\n(h) By January 1, 2026, to the extent funding is available under subdivision 6, paragraph (f), the commissioner must have information technology systems in place that prioritize efficiency and usability for families and early childhood programs and that support the following:\n(1) the ability for a family to apply for a scholarship through an online system that allows the family to upload documents that demonstrate scholarship eligibility;\n(2) the administration of scholarships, including but not limited to verification of family and child eligibility, identification of programs eligible to accept scholarships, management of scholarship awards and payments, and communication with families and eligible programs; and\n(3) making scholarship payments to eligible programs in advance of or at the beginning of the delivery of services for an approved scholarship recipient.\n(i) In creating the information technology systems and functions under paragraph (h), the commissioner must consider the requirements for and the potential transition to the great start scholarships program under section 142D.44.\n(a) In order to be eligible to accept an early learning scholarship, a program must participate in the quality rating and improvement system under section 142D.13.\n(b) Any program accepting scholarships must use the revenue to supplement and not supplant federal funding.\nThe commissioner shall contract with an independent contractor to evaluate the early learning scholarship program. The evaluation must include recommendations regarding the appropriate scholarship amount, efficiency, and effectiveness of the administration, and impact on kindergarten readiness. By January 15, 2016, the commissioner shall submit a written copy of the evaluation to the chairs and ranking minority members of the legislative committees and divisions with primary jurisdiction over kindergarten through grade 12 education.\n(a) An account is established in the special revenue fund known as the \"early learning scholarship account.\"\n(b) Funds appropriated for early learning scholarships under this section must be transferred to the early learning scholarship account in the special revenue fund.\n(c) Money in the account is annually appropriated to the commissioner for early learning scholarships under this section. Any returned funds are available to be regranted.\n(d) Up to $2,133,000 annually is appropriated to the commissioner for costs associated with administering and monitoring early learning scholarships.\n(e) The commissioner may use funds under paragraph (c) for the purpose of family outreach and distribution of scholarships.\n(f) The commissioner may use up to $12,000,000 in funds under paragraph (c) to create information technology systems under subdivision 4, paragraph (h). Beginning July 1, 2025, the commissioner may use up to $2,400,000 annually in funds under paragraph (c) to maintain the information technology systems that support the early learning scholarships program.\n(g) By December 31 of each year, the commissioner must provide a written report to the legislative committees with jurisdiction over early care and learning programs on the use of funds under paragraph (c) for purposes other than providing scholarships to eligible children.",
	"repealed": false
}