{
	"id": "290B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/290B.03",
	"title": "290B.03 DEFERRAL OF PROPERTY TAXES.",
	"text": "The qualifications for the senior citizens' property tax deferral program are as follows:\n(1) the property must be owned and occupied as a homestead by a person 65 years of age or older. In the case of a married couple, at least one of the spouses must be at least 65 years old at the time the first property tax deferral is granted, regardless of whether the property is titled in the name of one spouse or both spouses, or titled in another way that permits the property to have homestead status, and the other spouse must be at least 62 years of age;\n(2) the total household income of the qualifying homeowners, as defined in section 290A.03, subdivision 5, for the calendar year preceding the year of the initial application may not exceed $96,000;\n(3) the homestead must have been owned and occupied as the homestead of at least one of the qualifying homeowners for at least five years prior to the year the initial application is filed;\n(4) there are no state or federal tax liens or judgment liens on the homesteaded property;\n(5) there are no mortgages or other liens on the property that secure future advances, except for those subject to credit limits that result in compliance with clause (6); and\n(6) the total unpaid balances of debts secured by mortgages and other liens on the property, including unpaid and delinquent special assessments and interest and any delinquent property taxes, penalties, and interest, but not including property taxes payable during the year or debts secured by a residential PACE lien, as defined in section 216C.435, subdivision 10d, does not exceed 75 percent of the assessor's estimated market value for the year.\nQualifying homestead property is defined as the dwelling located in this state that is taxed as real property and that is occupied as the homeowner's principal residence and so much of the land surrounding it as is reasonably necessary for use of the dwelling as a home and any other property used for purposes of a homestead as defined in section 273.13, subdivisions 22 and 23, but not to exceed one acre. The homestead may be part of a multidwelling building and the land on which it is built. Property is not qualifying homestead property if a person or entity other than the applicant or the applicant's spouse holds an interest in the property as the vendor under a contract for deed or as a remainderperson.",
	"repealed": false
}