{
	"id": "163.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.06",
	"title": "163.06 TAXATION IN UNORGANIZED TOWNSHIPS.",
	"text": "The county board of any county in which there are unorganized townships may levy a tax for road and bridge purposes upon all the real and personal property in such unorganized townships.\nThe tax, if levied, is additional to the tax which the counties may levy for the county road and bridge funds and is additional to the amount permitted by law to be levied for other county purposes. The tax may be levied on any or all unorganized townships within a county, provided that no such tax shall be levied on only a part of an unorganized township within a county.\nIf any county deems it desirable to levy such a tax, it may at the time it levies the county taxes, by resolution reciting such fact, determine the amount so to be levied in each unorganized township for the current year. It shall be the duty of the county auditor to extend the tax so levied upon the tax books of the county, at the same time and in the same manner as other taxes for county purposes are extended as to property in such unorganized townships, and the tax shall be collected and payment thereof enforced at the same time and in the same manner as other county taxes on such property and with like penalties for nonpayment at the time prescribed by law.\nThe tax collected from each unorganized township shall be set apart in a separate fund in the county treasury, and each shall be designated as the road and bridge fund of the unorganized township from which the tax was collected.\nExcept as hereinafter provided, each fund shall be expended under the direction of the county board for the construction, improvement, and maintenance of roads and bridges in the unorganized township for which the fund was designated. If so requested by petition signed by a majority of the resident taxpayers of any unorganized township, the county board may expend all or part of the road and bridge fund of the unorganized township upon roads or bridges in an adjoining organized or unorganized township.\nIn any county having not less than 95 nor more than 105 full and fractional townships, and having an estimated market value of not less than $12,000,000 nor more than $21,000,000, the county board, by resolution, may expend the funds provided in subdivision 4 in any organized town or unorganized territory or portion thereof in such county.",
	"repealed": false
}