{
	"id": "349A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/349A.07",
	"title": "349A.07 VENDOR CONTRACTS.",
	"text": "The director may enter into lottery procurement contracts for the purchase, lease, or lease-purchase of the goods or services. In entering into a lottery procurement contract, the director shall utilize an open bid process and shall take into account the particularly sensitive nature of the state lottery and shall consider the competence, quality of product, experience, and timely performance of each potential vendor in order to promote and ensure security, honesty, fairness, and integrity in the operation and administration of the lottery. The director shall also consider the extent to which a bidder for a contract for printing preprinted lottery tickets would utilize employees and facilities within Minnesota in fulfilling the contract.\nThe director shall request the director of the Division of Alcohol and Gambling Enforcement to investigate the background, financial responsibility, security, and integrity of any person who submits a bid, proposal, or offer as part of a lottery procurement contract issuance by the director. The director may require the person making the bid, proposal, or offer to pay for the cost of the investigation. Any fee collected under this subdivision must be deposited into the lottery fund. At the time of submitting any bid, proposal, or offer, the bidder shall disclose to the director the information the director considers necessary to carry out the purposes of this section. The director has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on all vendors and potential vendors who have submitted a bid to the lottery.\n(a) The director may not enter into a lottery procurement contract with an applicant that has been convicted of a felony within the last ten years, has been convicted of a gross misdemeanor or gambling-related misdemeanor within the last five years, or has been found guilty of any crime involving fraud or misrepresentation within the last five years.\n(b) The director may not enter into a lottery procurement contract with an applicant that has (1) a person who owns more than five percent of the stock in the applicant that does not meet the requirements of this subdivision, or (2) a partner, officer, or director that does not meet the requirements of this subdivision.\n(c) The restrictions under this subdivision do not apply to an applicant for a lottery procurement contract if the director determines that the applicant has terminated its relationship with the individuals whose actions directly contributed to the disqualification of the applicant under this subdivision.\nThe director may not enter into a lottery procurement contract with a person to supply goods or services if that person has an ownership interest in an entity that had supplied consultation services under a contract to the lottery regarding the request for proposal pertaining to those particular goods or services.\n(a) The director shall require securities to be deposited, or a performance bond or a letter of credit to be executed by the person or corporation that is awarded a lottery procurement contract in an amount as determined by the director.\n(b) Any securities deposited with the director under this subdivision must be interest-bearing and limited to:\n(1) certificates of deposit issued by a solvent bank or savings association organized and existing under the laws of this state or under the laws of the United States and having its principal place of business in this state;\n(2) United States bonds, notes, and bills, for which the full faith and credit of the government of the United States is pledged for the payment of principal and interest; and\n(3) general obligation bonds of any political subdivision of this state, or corporate bonds of a corporation that is not an affiliate or subsidiary of the vendor, if the general obligation bonds or corporate bonds are rated in one of the four highest classifications by an established nationally recognized investment rating service.\n(c) Any letter of credit executed under this subdivision must provide that:\n(1) nothing more than a demand for payment is necessary for payment and is not conditional on the delivery of any other documents or materials;\n(2) the letter of credit is irrevocable and cannot be modified or revoked without the consent of the director;\n(3) the letter of credit cannot expire without notice from the issuer and the notice must occur at least 60 days before the expiration date of the letter of credit;\n(4) the letter of credit is issued by a bank which is a member of the Federal Reserve System which has a long-term debt rating by a recognized national rating agency of investment grade or better, if no long-term debt rating is available, the financial institution must have investment grade financial characteristics;\n(5) the letter of credit is unconditional, is not conditional upon reimbursement to the bank or the bank's ability to perfect any lien or security interest, and does not contain references to any other agreement, document, or entity; and\n(6) the letter of credit designates the director as beneficiary.\nLottery procurement contracts entered into by the director are not subject to the provisions of section 16C.03, 16C.05, 16C.06, 16C.08, 16C.09, or 16C.10, provided that the director must utilize an open and competitive bid process, and as nearly as practicable follow the procedures of chapters 16B and 16C governing contracts, consistent with the provisions of this section.\nA lottery procurement contract entered into under this section may not be assigned without the specific written approval of the director.",
	"repealed": false
}