{
	"id": "67A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/67A.01",
	"title": "67A.01 NUMBER OF MEMBERS REQUIRED, PROPERTY AND TERRITORY.",
	"text": "It shall be lawful for any number of persons, not less than 25, residing in adjoining counties in this state, who shall collectively own property worth at least $50,000, to form themselves into a corporation for mutual insurance against loss or damage by the perils listed in section 67A.13.\n(a) A township mutual fire insurance company may be authorized to write business in up to nine adjoining counties in the aggregate at the same time. If policyholder surplus is at least $500,000 as reported in the company's last annual financial statement filed with the commissioner, the company may, if approval has been granted by the commissioner, be authorized to write business in ten or more counties in the aggregate at the same time, subject to a maximum of 30 adjoining counties, in accordance with the following schedule:\n(b) In the case of a merger of two or more companies having contiguous territories, the surviving company in the merger may transact business in the entire territory of the merged companies; however, the territory of the surviving company in the merger must be approved by the commissioner and may not be in excess of 30 counties, provided the company complies with the additional reporting requirements stipulated in paragraph (g).\n(c) Notwithstanding paragraph (b), a policy issued by a constituent company to the merger may remain effective, without respect to the policy being issued in a county outside the territory of the surviving company, until the policy:\n(1) expires or is terminated by the policy's terms; or\n(2) is terminated or annulled and canceled in accordance with section 67A.18.\nThe surviving company must not amend or renew a policy issued in a county outside the surviving company's territory.\n(d) A township mutual fire insurance company may write new and renewal insurance on property in cities within the company's authorized territory having a population less than 25,000. A township mutual fire insurance company may continue to write new and renewal insurance once the population increases to 25,000 or greater provided that amended and restated articles are filed with the commissioner along with a certification that such city's population has increased to 25,000 or greater.\n(e) A township mutual fire insurance company may write new and renewal insurance on property in cities within the company's authorized territory with a population of 25,000 or greater, but less than 150,000, if approval has been granted by the commissioner. No township mutual fire insurance company shall insure any property in cities with a population of 150,000 or greater.\n(f) If a township mutual fire insurance company provides evidence to the commissioner that the company had insurance in force on December 31, 2007, in a city within the company's authorized territory with a population of 25,000 or greater, but less than 150,000, the company may write new and renewal insurance on property in that city provided that the company files amended and restated articles by July 31, 2010, naming that city.\n(g) If a surviving company of a merger writes in more than 20 counties, that company must report to the commissioner the following items on a quarterly basis:\n(1) income statement;\n(2) balance sheet;\n(3) insurance in force; and\n(4) number of policies.",
	"repealed": false
}