{
	"id": "245.492",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.492",
	"title": "245.492 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 245.491 to 245.495.\n\"Base level funding\" means funding received from state, federal, or local sources and expended across the local system of care in fiscal year 1995 for children's mental health services, for special education services, and for other services for children with emotional or behavioral disturbances and their families.\nIn subsequent years, base level funding may be adjusted to reflect decreases in the numbers of children in the target population.\n\"Children with emotional or behavioral disturbances\" includes children with emotional disturbances as defined in section 245.4871, subdivision 15, and children with emotional or behavioral disorders as defined in Minnesota Rules, part 3525.1329, subpart 1.\n\"Family\" has the definition provided in section 245.4871, subdivision 16.\n\"Family community support services\" has the definition provided in section 245.4871, subdivision 17.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Integrated fund\" is a pool of both public and private local, state, and federal resources, consolidated at the local level, to accomplish locally agreed-upon service goals for the target population. The fund is used to help the local children's mental health collaborative to serve the mental health needs of children in the target population by allowing the local children's mental health collaboratives to develop and implement an integrated service system.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Integrated service system\" means a coordinated set of procedures established by the local children's mental health collaborative for coordinating services and actions across categorical systems and agencies that results in:\n(1) integrated funding;\n(2) improved outreach, early identification, and intervention across systems;\n(3) strong collaboration between parents and professionals in identifying children in the target population facilitating access to the integrated system, and coordinating care and services for these children;\n(4) a coordinated assessment process across systems that determines which children need multiagency care coordination and wraparound services;\n(5) multiagency plan of care; and\n(6) individualized rehabilitation services.\nServices provided by the integrated service system must meet the requirements set out in sections 245.487 to 245.4889. Children served by the integrated service system must be economically and culturally representative of children in the service delivery area.\n\"Interagency early intervention committee\" refers to the committee established under section 125A.30.\n\"Local children's advisory council\" refers to the council established under section 245.4875, subdivision 5.\n\"Local children's mental health collaborative\" or \"collaborative\" means an entity formed by the agreement of representatives of the local system of care including mental health services, social services, correctional services, education services, health services, and vocational services for the purpose of developing and governing an integrated service system. A local coordinating council, a community transition interagency committee as defined in section 125A.22, or an interagency early intervention committee may serve as a local children's mental health collaborative if its representatives are capable of carrying out the duties of the local children's mental health collaborative set out in sections 245.491 to 245.495. Where a local coordinating council is not the local children's mental health collaborative, the local children's mental health collaborative must work closely with the local coordinating council in designing the integrated service system.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Local system of care\" has the definition provided in section 245.4871, subdivision 24.\n\"Mental health services\" has the definition provided in section 245.4871, subdivision 28.\n\"Multiagency plan of care\" means a written plan of intervention and integrated services developed by a multiagency team in conjunction with the child and family based on their unique strengths and needs as determined by a multiagency assessment. The plan must outline measurable client outcomes and specific services needed to attain these outcomes, the agencies responsible for providing the specified services, funding responsibilities, timelines, the judicial or administrative procedures needed to implement the plan of care, the agencies responsible for initiating these procedures and designate one person with lead responsibility for overseeing implementation of the plan.\n\"Respite care\" is planned routine care to support the continued residence of a child with emotional or behavioral disturbance with the child's family or long-term primary caretaker.\n\"Service delivery area\" means the geographic area to be served by the local children's mental health collaborative and must include at a minimum a part of a county and school district or a special education cooperative.\n[Repealed, 2014 c 262 art 3 s 18]\n[Repealed, 1995 c 207 art 11 s 12]\n\"Target population\" means children up to age 18 with an emotional or behavioral disturbance or who are at risk of suffering an emotional or behavioral disturbance as evidenced by a behavior or condition that affects the child's ability to function in a primary aspect of daily living including personal relations, living arrangements, work, school, and recreation, and a child who can benefit from:\n(1) multiagency service coordination and wraparound services; or\n(2) informal coordination of traditional mental health services provided on a temporary basis.\nChildren between the ages of 18 and 21 who meet these criteria may be included in the target population at the option of the local children's mental health collaborative.\n\"Therapeutic support of foster care\" has the definition provided in section 245.4871, subdivision 34.\n\"Individualized rehabilitation services\" are alternative, flexible, coordinated, and highly individualized services that are based on a multiagency plan of care. These services are designed to build on the strengths and respond to the needs identified in the child's multiagency assessment and to improve the child's ability to function in the home, school, and community. Individualized rehabilitation services may include, but are not limited to, residential services, respite services, services that assist the child or family in enrolling in or participating in recreational activities, assistance in purchasing otherwise unavailable items or services important to maintain a specific child in the family, and services that assist the child to participate in more traditional services and programs.",
	"repealed": false
}