{
	"id": "41B.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.18",
	"title": "41B.18 REVENUE BOND FUND; REPORTS.",
	"text": "The authority may create and establish a special fund or funds for the security of one or more or all series of its bonds, which funds are known as debt service reserve funds. The authority may pay into each debt service reserve fund:\n(1) any money appropriated by the state only for the purposes of that fund;\n(2) any money transferred from the security fund for the purposes of that fund;\n(3) any proceeds of sale of bonds to the extent provided in the resolution or indenture authorizing their issuance;\n(4) any funds directed to be transferred by the authority to that debt service reserve fund; and\n(5) any other money made available to the authority only for the purpose of that fund from any other source.\nThe money held in or credited to each debt service reserve fund, except as provided in this section, must be used solely for the payment of the principal of bonds of the authority as the bonds mature, the purchase of the bonds, the payment of interest on the bonds, or the payment of any premium required when the bonds or notes are redeemed before maturity; provided, that money in a debt service reserve fund may not be withdrawn at any time in an amount which would reduce the amount of the fund to less than the amount which the authority determines to be reasonably necessary for the purposes of the fund, except for the purpose of paying principal or interest due on bonds secured by the fund, for the payment of which other money of the authority is not available.\nIf the authority creates a debt service reserve fund for the security of any series of bonds, it shall not issue any additional bonds which are similarly secured if the amount of any of the debt service reserve funds at the time of issuance does not equal or exceed the minimum amount, if any, required by the resolution creating that fund, unless the authority deposits in each fund at the time of issuance, from the proceeds of the bonds or otherwise, an amount which, together with the amount then in the fund, will not be less than the minimum amount required.\nTo the extent consistent with the resolutions and indentures securing outstanding bonds, the authority may, at the close of any fiscal year, transfer to any other fund or account from any debt service reserve fund, any excess in that fund over the amount deemed by the authority to be reasonably necessary for the purpose of the fund. Any excess must be transferred first to the security fund to the extent of any prior withdrawals from the security fund which have not previously been restored to the security fund.\nNothing in this section may be construed to limit the right of the authority to create and establish by resolution or indenture other funds or security in addition to debt service reserve funds which are necessary or desirable in connection with any bonds or programs.\nThe authority shall submit a biennial report of its activities, projected activities, receipts, and expenditures for the next biennium, to the governor and the legislature on or before January 15 in each odd-numbered year. The report must include the distribution of money under each authority program by county. In addition, the report must include the cost to the authority of the issuance of its bonds for each issue in the biennium.\nThe books and records of the authority are subject to audit by the legislative auditor in the manner prescribed for other state agencies. The authority may also employ and contract in its resolutions and indentures for the employment of public accountants for the audit of books and records pertaining to any fund.",
	"repealed": false
}