{
	"id": "10A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.04",
	"title": "10A.04 LOBBYIST REPORTS.",
	"text": "A lobbyist must file reports of the lobbyist's activities with the board as long as the lobbyist continues to lobby. The report may be filed electronically. A lobbyist may file a termination statement at any time after ceasing to lobby.\nEach report must cover the time from the last day of the period covered by the last report to 15 days before the current filing date. The reports must be filed with the board by the following dates:\n(1) January 15; and\n(2) June 15.\nMS 2003 Supp [Expired, 1Sp2003 c 1 art 2 s 24]\nAn entity or lobbyist whose activities are reported to the board by another lobbyist is required to provide the information required by subdivision 4 to the lobbyist no later than five days before the prescribed filing date.\n(a) A report under this section must include information the board requires from the registration form and the information required by this subdivision for the reporting period.\n(b) A lobbyist must report the specific subjects of interest for an entity represented by the lobbyist on each report submitted under this section. A lobbyist must describe a specific subject of interest in the report with enough information to show the particular issue of importance to the entity represented.\n(c) A lobbyist must report every state agency that had administrative action that the represented entity sought to influence during the reporting period. The lobbyist must report the specific subjects of interest for each administrative action and the revisor of statutes rule draft number assigned to the administrative rulemaking.\n(d) A lobbyist must report every political subdivision that considered official action that the represented entity sought to influence during the reporting period. The lobbyist must report the specific subjects of interest for each action.\n(e) A lobbyist must report general lobbying categories and up to four specific subjects of interest related to each general lobbying category on which the lobbyist attempted to influence legislative action during the reporting period. If the lobbyist attempted to influence legislative action on more than four specific subjects of interest for a general lobbying category, the lobbyist, in consultation with the represented entity, must determine which four specific subjects of interest were the entity's highest priorities during the reporting period and report only those four subjects.\n(f) A lobbyist must report the Public Utilities Commission project name for each rate setting, power plant and powerline siting, or granting of certification of need before the Public Utilities Commission that the represented entity sought to influence during the reporting period.\n(g) A lobbyist must report the amount and nature of each gift, item, or benefit, excluding contributions to a candidate, equal in value to $5 or more, given or paid to any official, as defined in section 10A.071, subdivision 1, by the lobbyist or an employer or employee of the lobbyist. The list must include the name and address of each official to whom the gift, item, or benefit was given or paid and the date it was given or paid.\n(h) A lobbyist must report each original source of money in excess of $500 in any year used for the purpose of lobbying to influence legislative action, administrative action, or the official action of a political subdivision. The list must include the name, address, and employer, or, if self-employed, the occupation and principal place of business, of each payer of money in excess of $500.\n(i) On each report, a lobbyist must disclose the general lobbying categories that were lobbied on in the reporting period.\n[Repealed by amendment, 1999 c 220 s 5]\nIf a lobbyist or principal fails to file a report required by this section by the date the report was due, the board may impose a late filing fee of $25 per day, not to exceed $1,000, commencing the day after the report was due. The board must send notice by certified mail to any lobbyist or principal who fails to file a report within ten business days after the report was due that the lobbyist or principal may be subject to a civil penalty for failure to file the report or pay the fee. A lobbyist or principal who fails to file a report or statement or pay a fee within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board of up to $1,000.\n(a) A principal must report to the board as required in this subdivision by March 15 for the preceding calendar year.\n(b) The principal must report the total amount, rounded to the nearest $5,000, spent by the principal during the preceding calendar year on each type of lobbying listed below:\n(1) lobbying to influence legislative action;\n(2) lobbying to influence administrative action, other than lobbying described in clause (3);\n(3) lobbying to influence administrative action in cases of rate setting, power plant and powerline siting, and granting of certificates of need under section 216B.243; and\n(4) lobbying to influence official action of a political subdivision.\n(c) For each type of lobbying listed in paragraph (b), the principal must report a total amount that includes:\n(1) the portion of all direct payments for compensation and benefits paid by the principal to lobbyists in this state for that type of lobbying;\n(2) the portion of all expenditures for advertising, mailing, research, consulting, surveys, expert testimony, studies, reports, analysis, compilation and dissemination of information, communications and staff costs used for the purpose of urging members of the public to contact public or local officials to influence official actions, social media and public relations campaigns, and legal counsel used to support that type of lobbying in this state; and\n(3) a reasonable good faith estimate of the portion of all salaries and administrative overhead expenses attributable to activities of the principal for that type of lobbying in this state.\n(d) The principal must report disbursements made and obligations incurred that exceed $2,000 for paid advertising used for the purpose of urging members of the public to contact public or local officials to influence official actions during the reporting period. Paid advertising includes the cost to boost the distribution of an advertisement on social media. The report must provide the date that the advertising was purchased, the name and address of the vendor, a description of the advertising purchased, and any specific subjects of interest addressed by the advertisement.\nThe board may randomly audit the financial records of lobbyists and principals required to report under this section.\n[Repealed by amendment, 1999 c 220 s 5]\nClauses (1) to (6) apply when a single individual, association, political subdivision, or public higher education system is represented by more than one lobbyist.\n(1) The entity must appoint one designated lobbyist to report lobbyist disbursements made by the entity. An entity represented by more than one lobbyist may only have one designated lobbyist at any given time. The designated lobbyist must indicate that status on the periodic reports of lobbyist disbursements.\n(2) A reporting lobbyist may consent to report on behalf of one or more other lobbyists for the same entity, in which case, the other lobbyists are persons whose activities the reporting lobbyist must disclose and are subject to the disclosure requirements of subdivision 3. Lobbyist disbursement reports filed by a reporting lobbyist must include the names and registration numbers of the other lobbyists whose activities are included in the report.\n(3) Lobbyists whose activities are accounted for by a reporting lobbyist are not required to file lobbyist disbursement reports.\n(4) A lobbyist whose lobbying disbursements are provided to the board through a reporting lobbyist must supply all relevant information on disbursements to the reporting lobbyist no later than five days before the prescribed filing date.\n(5) The reporting periods and due dates for a reporting lobbyist are those provided in subdivision 2. The late filing provisions in subdivision 5 apply to reports required by this subdivision.\n(6) The reporting lobbyist must indicate the names and registration numbers of any lobbyists who did not provide their lobbying disbursements for inclusion in a report. The late filing provisions in subdivision 5 apply to lobbyists who fail to report information to the reporting lobbyist.",
	"repealed": false
}