{
	"id": "62R.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62R.03",
	"title": "62R.03 APPLICABILITY OF OTHER LAWS.",
	"text": "A health care cooperative is subject to chapter 308A unless otherwise provided in this chapter. After incorporation, a health care cooperative shall enjoy the powers and privileges and shall be subject to the duties and liabilities of other cooperatives organized under chapter 308A, to the extent applicable and except as limited or enlarged by this chapter. If any provision of this chapter conflicts with a provision of chapter 308A, the provision of this chapter takes precedence.\nA health care network cooperative must be licensed as a health maintenance organization licensed under chapter 62D, a nonprofit health service plan corporation licensed under chapter 62C, or a community integrated service network licensed under chapter 62N, at the election of the health care network cooperative. The health care network cooperative shall be subject to the duties and liabilities of health plans licensed pursuant to the chapter under which the cooperative elects to be licensed, to the extent applicable and except as limited or enlarged by this chapter. If any provision of any chapter under which the cooperative elects to be licensed conflicts with the provisions of this chapter, the provisions of this chapter take precedence. A health care network cooperative, upon licensure as provided in this subdivision, is a contributing member of the Minnesota Comprehensive Health Association, on the same basis as other entities having the same licensure.\nA health provider cooperative shall not be considered a mutual insurance company under chapter 60A, a health maintenance organization under chapter 62D, a nonprofit health services corporation under chapter 62C, or a community integrated service network under chapter 62N. A health provider network shall not be considered to violate any limitations on the corporate practice of medicine. Health care service contracts under section 62R.06 shall not be considered to violate section 62J.23.",
	"repealed": false
}