{
	"id": "17.944",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.944",
	"title": "17.944 REVIEW BY COMMISSIONER.",
	"text": "For purposes of this section and section 17.943, \"agricultural contract\" includes, where applicable, the cover sheet as defined in section 17.942, and material risk disclosure statement required by section 17.91, subdivision 2.\nA contractor may submit an agricultural contract to the commissioner for review as to whether it complies with section 17.943. After reviewing the contract, the commissioner shall:\n(1) certify that the contract complies with section 17.943;\n(2) decline to certify that the contract complies with section 17.943 and note objections;\n(3) decline to review the contract because the contract's compliance with section 17.943 is subject to pending litigation; or\n(4) decline to review the contract because the contract is not subject to section 17.943.\nIn determining whether a contract or cover sheet is readable within the meaning of section 17.943, the commissioner shall consider at least the following factors:\n(1) the simplicity of the sentence structure;\n(2) the extent to which commonly used and understood words are employed;\n(3) the extent to which esoteric legal terms are avoided;\n(4) the extent to which references to other sections or provisions of the contract are minimized;\n(5) the Flesch scale analysis readability score as outlined in section 72C.09;\n(6) the extent to which clear definitions are used in the text of the contract; and\n(7) additional factors relevant to the contract being easy to read and understand.\nActions of the commissioner under subdivision 1 are not subject to chapter 14 and are not appealable.\nA contract certified under subdivision 1 is deemed to comply with section 17.943. Certification of a contract under subdivision 1 does not constitute an approval of the contract's legality or legal effect.\nIf the commissioner certifies a contract or fails to respond within 30 days of receipt of the contract, the contractor will have complied with sections 17.91 and 17.943, and the remedies stated in subdivisions 7 and 8 are not available.\nFailure to submit a contract to the commissioner for review under subdivision 1 does not show a lack of good faith or raise a presumption that the contract violates section 17.943.\nA violation of section 17.943 is a violation subject to section 8.31, subdivision 1. The remedies in section 8.31, subdivisions 3 and 3a, are limited by section 17.9441.\n(a) In addition to the remedies provided in section 8.31, a court reviewing an agricultural contract may change the terms of the contract or limit a provision to avoid an unfair result if it finds that:\n(1) a material provision of the contract violates section 17.943;\n(2) the violation caused the producer to be substantially confused about any of the rights, obligations, or remedies of the contract; and\n(3) the violation has caused or is likely to cause financial detriment to the producer.\n(b) If the court reforms or limits a provision of a contract, the court shall also make orders necessary to avoid unjust enrichment. Bringing a claim for relief under this subdivision does not entitle a producer to withhold performance of an otherwise valid contractual obligation. No relief may be granted under this subdivision unless the claim is brought before the obligations of the contract have been fully performed.",
	"repealed": false
}