{
	"id": "5.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/5.16",
	"title": "5.16 CORRECTION OF DOCUMENTS.",
	"text": "Whenever an instrument authorized to be filed with the secretary of state has been filed and is an inaccurate record of the action referred to in the instrument, contains an inaccurate or erroneous statement, or was defectively or erroneously executed, sealed, acknowledged, or verified, the instrument may be corrected by articles of correction. Whenever a filing party has erroneously filed an instrument on the record of a business entity, the filing party may file articles of correction that redirect the filing to be recorded on the appropriate business entity within 60 days of the erroneous filing. Articles of correction must be signed by the person who executed the original instrument or by a person authorized to sign on behalf of that person. In the case of an entity other than a natural person, the articles of correction must be signed by an authorized person.\nThe articles of correction must:\n(1) set forth the name of the person or entity who filed the instrument;\n(2) identify the instrument to be corrected by description and by the date of its filing with the secretary of state;\n(3) identify the inaccuracy, error, or defect to be corrected; and\n(4) set forth a statement in corrected form of the portion of the instrument to be corrected.\nThe articles of correction shall be delivered to the secretary of state. If the secretary of state finds that the articles of correction conform to law, the secretary of state shall, when all fees have been paid as required by law:\n(1) endorse on the articles of correction the word \"filed\" and the month, day, and year that the articles are filed; and\n(2) file and record the document in the Office of the Secretary of State.\nAfter articles of correction have been filed and recorded in the Office of the Secretary of State, the instrument as corrected is considered to have been filed on the date the original instrument was filed; except that as to persons adversely affected by the correction, the instrument as corrected is considered to have been filed on the date the articles of correction were filed. A certificate issued by the secretary of state before an instrument is corrected, with respect to the effect of filing the original instrument, is considered to be applicable to the instrument as corrected as of the date the instrument as corrected is considered to have been filed under this section.\nThe secretary of state shall collect a fee of $35 for filing articles of correction.",
	"repealed": false
}