{
	"id": "477A.014",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.014",
	"title": "477A.014 COMMISSIONER'S RESPONSIBILITIES.",
	"text": "(a) The commissioner of revenue shall make all necessary calculations and make payments under this chapter directly to the affected political subdivisions annually. The commissioner shall notify the political subdivisions of their aid amounts, the computational factors used in making the calculations, and those statewide total figures that are pertinent, before August 1 of the year preceding the aid distribution year, unless a different date is specified.\n(b) For the purposes of this subdivision, aid is determined for a city or town based on its city or town status as of June 30 of the year preceding the aid distribution year. If the effective date for a municipal incorporation, consolidation, annexation, detachment, dissolution, or township organization is on or before June 30 of the year preceding the aid distribution year, such change in boundaries or form of government shall be recognized for aid determinations for the aid distribution year. If the effective date for a municipal incorporation, consolidation, annexation, detachment, dissolution, or township organization is after June 30 of the year preceding the aid distribution year, such change in boundaries or form of government shall not be recognized for aid determinations until the following year.\nMS 1994 [Repealed, 1996 c 310 s 1]\n(a) Changes in boundaries or form of government may only be recognized for the purposes of this subdivision, to the extent that, on or before July 15 of the aid calculation year: (1) changes in computational factors have been recertified or otherwise reported in reliable form to the commissioner, or (2) an annexation information report as provided in paragraph (b) is received by the commissioner. Revisions to estimates or data for use in recognizing changes in boundaries or form of government are not effective for purposes of this subdivision unless received by the commissioner on or before July 15 of the aid calculation year. Clerical errors in the certification or use of estimates and data established as of July 15 in the aid calculation year are subject to correction within the time periods allowed under subdivision 3.\n(b) In the case of an annexation, an annexation information report may be completed by the annexing jurisdiction and submitted to the commissioner for purposes of this subdivision if the net tax capacity of annexed area for the assessment year preceding the effective date of the annexation exceeds five percent of the city's net tax capacity for the same year. The form and contents of the annexation information report shall be prescribed by the commissioner. The commissioner shall adjust the computational factors used to calculate aid under section 477A.013, subdivision 9, for the annexing jurisdiction only if the annexation information report provides data the commissioner determines to be reliable for the entire annexed area.\nA taxing authority may object to the commissioner of revenue with respect to the amount of the distribution it has been certified to receive pursuant to subdivision 1. No objection shall be raised later than 60 days after the taxing authority has received notice from the commissioner of the amount which it has been certified to receive.\nIf, due to an error in the factors used to calculate a taxing authority's aid pursuant to section 477A.013 the amount indicated in the certification of the commissioner to the taxing authority for a year is less than the amount to which it is entitled pursuant to this section, the commissioner of revenue shall additionally distribute the amount necessary to make the full correct distribution to the taxing authority. The additional distribution shall be paid from the general fund and shall not diminish the distributions made to other taxing authorities under this section.\nMS 2007 Supp [Repealed, 2008 c 366 art 2 s 14]\nMS 2006 [Repealed, 2008 c 366 art 2 s 14]",
	"repealed": false
}