{
	"id": "148.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.10",
	"title": "148.10 LICENSES REVOKED; NEW LICENSES.",
	"text": "(a) The state Board of Chiropractic Examiners may refuse to grant, or may revoke, suspend, condition, limit, restrict or qualify a license to practice chiropractic, or may cause the name of a person licensed to be removed from the records in the office of the court administrator of the district court for:\n(1) advertising that is false or misleading; that violates a rule of the board; or that claims the cure of any condition or disease;\n(2) the employment of fraud or deception in applying for a license or in passing the examination provided for in section 148.06 or conduct which subverts or attempts to subvert the licensing examination process;\n(3) the practice of chiropractic under a false or assumed name or the impersonation of another practitioner of like or different name;\n(4) the conviction of a crime involving moral turpitude;\n(5) the conviction, during the previous five years, of a felony reasonably related to the practice of chiropractic;\n(6) habitual intemperance in the use of alcohol or drugs;\n(7) practicing under a license which has not been renewed;\n(8) advanced physical or mental disability;\n(9) the revocation or suspension of a license to practice chiropractic; or other disciplinary action against the licensee; or the denial of an application for a license by the proper licensing authority of another state, territory or country; or failure to report to the board that charges regarding the person's license have been brought in another state or jurisdiction;\n(10) the violation of, or failure to comply with, the provisions of sections 148.01 to 148.105, the rules of the state Board of Chiropractic Examiners, or a lawful order of the board;\n(11) unprofessional conduct;\n(12) being unable to practice chiropractic with reasonable skill and safety to patients by reason of illness, professional incompetence, senility, drunkenness, use of drugs, narcotics, chemicals or any other type of material, or as a result of any mental or physical condition, including deterioration through the aging process or loss of motor skills. If the board has probable cause to believe that a person comes within this clause, it shall direct the person to submit to a mental or physical examination. For the purpose of this clause, every person licensed under this chapter shall be deemed to have given consent to submit to a mental or physical examination when directed in writing by the board and further to have waived all objections to the admissibility of the examining physicians' testimony or examination reports on the ground that the same constitute a privileged communication. Failure of a person to submit to such examination when directed shall constitute an admission of the allegations, unless the failure was due to circumstances beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A person affected under this clause shall at reasonable intervals be afforded an opportunity to demonstrate that the person can resume the competent practice of chiropractic with reasonable skill and safety to patients.\nIn addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384, 144.651, or any other law limiting access to health data, obtain health data and health records relating to a licensee or applicant without the licensee's or applicant's consent if the board has probable cause to believe that a doctor of chiropractic comes under this clause. The health data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider or entity giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision is classified as private under sections 13.01 to 13.87.\nIn any proceeding under this clause, neither the record of proceedings nor the orders entered by the board shall be used against a person in any other proceeding;\n(13) aiding or abetting an unlicensed person in the practice of chiropractic, except that it is not a violation of this clause for a doctor of chiropractic to employ, supervise, or delegate functions to a qualified person who may or may not be required to obtain a license or registration to provide health services if that person is practicing within the scope of the license or registration or delegated authority;\n(14) improper management of health records, including failure to maintain adequate health records as described in clause (18), to comply with a patient's request made under sections 144.291 to 144.298 or to furnish a health record or report required by law;\n(15) failure to make reports required by section 148.102, subdivisions 2 and 5, or to cooperate with an investigation of the board as required by section 148.104, or the submission of a knowingly false report against another doctor of chiropractic under section 148.10, subdivision 3;\n(16) splitting fees, or promising to pay a portion of a fee or a commission, or accepting a rebate;\n(17) revealing a privileged communication from or relating to a patient, except when otherwise required or permitted by law;\n(18) failing to keep written chiropractic records justifying the course of treatment of the patient, including, but not limited to, patient histories, examination results, test results, and x-rays. Unless otherwise required by law, written records need not be retained for more than seven years and x-rays need not be retained for more than four years;\n(19) exercising influence on the patient or client in such a manner as to exploit the patient or client for financial gain of the licensee or of a third party which shall include, but not be limited to, the promotion or sale of services, goods, or appliances;\n(20) gross or repeated malpractice or the failure to practice chiropractic at a level of care, skill, and treatment which is recognized by a reasonably prudent chiropractor as being acceptable under similar conditions and circumstances; or\n(21) delegating professional responsibilities to a person when the licensee delegating such responsibilities knows or has reason to know that the person is not qualified by training, experience, or licensure to perform them.\n(b) For the purposes of paragraph (a), clause (2), conduct that subverts or attempts to subvert the licensing examination process includes, but is not limited to: (1) conduct that violates the security of the examination materials, such as removing examination materials from the examination room or having unauthorized possession of any portion of a future, current, or previously administered licensing examination; (2) conduct that violates the standard of test administration, such as communicating with another examinee during administration of the examination, copying another examinee's answers, permitting another examinee to copy one's answers, or possessing unauthorized materials; or (3) impersonating an examinee or permitting an impersonator to take the examination on one's own behalf.\n(c) For the purposes of paragraph (a), clauses (4) and (5), conviction as used in these subdivisions includes a conviction of an offense that if committed in this state would be deemed a felony without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilt is made or returned but the adjudication of guilt is either withheld or not entered.\n(d) For the purposes of paragraph (a), clauses (4), (5), and (6), a copy of the judgment or proceeding under seal of the administrator of the court or of the administrative agency which entered the same shall be admissible into evidence without further authentication and shall constitute prima facie evidence of its contents.\n(e) For the purposes of paragraph (a), clause (11), unprofessional conduct means any unethical, deceptive or deleterious conduct or practice harmful to the public, any departure from or the failure to conform to the minimal standards of acceptable chiropractic practice, or a willful or careless disregard for the health, welfare or safety of patients, in any of which cases proof of actual injury need not be established. Unprofessional conduct shall include, but not be limited to, the following acts of a chiropractor:\n(1) gross ignorance of, or incompetence in, the practice of chiropractic;\n(2) engaging in conduct with a patient that is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior that is seductive or sexually demeaning to a patient;\n(3) performing unnecessary services;\n(4) charging a patient an unconscionable fee or charging for services not rendered;\n(5) directly or indirectly engaging in threatening, dishonest, or misleading fee collection techniques;\n(6) perpetrating fraud upon patients, third-party payors, or others, relating to the practice of chiropractic, including violations of the Medicare or Medicaid laws or state medical assistance laws;\n(7) advertising that the licensee will accept for services rendered assigned payments from any third-party payer as payment in full, if the effect is to give the impression of eliminating the need of payment by the patient of any required deductible or co-payment applicable in the patient's health benefit plan. As used in this clause, \"advertise\" means solicitation by the licensee by means of handbills, posters, circulars, motion pictures, radio, newspapers, television, or in any other manner. In addition to the board's power to punish for violations of this clause, violation of this clause is also a misdemeanor;\n(8) accepting for services rendered assigned payments from any third-party payer as payment in full, if the effect is to eliminate the need of payment by the patient of any required deductible or co-payment applicable in the patient's health benefit plan, except as hereinafter provided; and\n(9) any other act that the board by rule may define.\n(a) Free or discounted examinations must provide sufficient information to allow for a diagnosis and initiation of treatment, with the exception of examinations clearly identified as for the purpose of screening. Free or discounted chiropractic treatments shall be comparable to similar nondiscounted chiropractic treatments.\n(b) When using the word \"free,\" or any other term with essentially the same meaning in reference to delivering any service, examination, or treatment, the following statement must be presented to the patient or guardian for signature and kept on file: \"I understand that one or more services provided have been or will be free of charge. Any subsequent services provided will be provided at the fees that have been or will be explained to me.\"\nThe State Board of Chiropractic Examiners may, at any time within two years of the refusal or revocation or cancellation of a license under this section, by a majority vote, issue a new license or grant a license to the person affected, restoring to, or conferring upon the person, all the rights and privileges of, and pertaining to, the practice of chiropractic, as defined and regulated by sections 148.01 to 148.10. Any person to whom such have been restored shall pay a fee set by the board upon issuance of a new license.\nIn addition to the other powers granted to the board under this chapter, the board may, in connection with any person whom the board, after a hearing, adjudges unqualified or whom the board, after a hearing, finds to have performed one or more of the acts described in subdivision 1:\n(1) publicly reprimand or censure the person;\n(2) place the person on probation for the period and upon the terms and conditions that the board may prescribe; and\n(3) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive the doctor of chiropractic of any economic advantage gained by reason of the violation charged, to reimburse the board for the cost of the investigation and proceeding, or to discourage similar violations. For purposes of this section, the cost of the investigation and proceeding may include, but is not limited to, fees paid for services provided by the Office of Administrative Hearings, legal and investigative services provided by the Office of the Attorney General, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and travel costs and expenses incurred by board staff and board members.\nIn addition to any other remedy provided by law, the board may, without a hearing, temporarily suspend a license for not more than 60 days if the board finds that a person has violated a statute or rule which the board is empowered to enforce and continued practice by the person would create an imminent risk of harm to others. The suspension shall take effect upon written notice to the person, specifying the statute or rule violated. At the time it issues the suspension notice, the board shall schedule a disciplinary hearing to be held pursuant to the Administrative Procedure Act. The person shall be provided with at least 20 days' notice of any hearing held pursuant to this subdivision.\n(a) In addition to the grounds provided in subdivision 1, the board may not issue or renew a license to practice chiropractic if the commissioner of revenue notifies the board and the licensee or applicant for a license that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The board may issue or renew the license only if (1) the commissioner of revenue issues a tax clearance certificate and (2) the commissioner of revenue or the licensee or applicant forwards a copy of the clearance to the board. The commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes.\n(2) \"Delinquent taxes\" do not include a tax liability if (i) an administrative or court action that contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\n(c) In lieu of the notice and hearing requirements of subdivisions 3 and 4, when a licensee or applicant is required to obtain a clearance certificate under this subdivision, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in paragraph (a). The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the licensee or applicant. The notice may be served personally or by mail.\n(d) The board shall require all licensees or applicants of a license to practice chiropractic to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the board must provide to the commissioner of revenue a list of all licensees and applicants for a license to practice chiropractic, including the name and address, Social Security number, and business identification number. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.\nA suspension, revocation, condition, limitation, qualification, or restriction of a license shall be in effect pending determination of an appeal unless the court, upon petition and for good cause shown, shall otherwise order.\nA license to practice chiropractic is automatically suspended if (1) a guardian of a licensee is appointed by order of a court under sections 524.5-101 to 524.5-502, for reasons other than the minority of the licensee; or (2) the licensee is committed by order of a court under chapter 253B. The license remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing.\n(a) Except as provided in paragraph (e), the board shall not grant or renew a license to practice chiropractic to any person who has been convicted on or after August 1, 2010, of any of the provisions of section 609.342, subdivision 1 or subdivision 1a; 609.343, subdivision 1 or subdivision 1a; 609.344, subdivision 1, or subdivision 1a, clauses (c) to (i); or 609.345, subdivision 1, or subdivision 1a, clauses (b) to (i).\n(b) A license to practice chiropractic is automatically revoked if the licensee is convicted of an offense listed in paragraph (a) of this section.\n(c) A license to practice chiropractic that has been denied or revoked under this subdivision is not subject to chapter 364.\n(d) For purposes of this subdivision, \"conviction\" means a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by the court, unless the court stays imposition or execution of the sentence and final disposition of the case is accomplished at a nonfelony level.\n(e) The board may establish criteria whereby an individual convicted of an offense listed in paragraph (a) of this subdivision may become licensed provided that the criteria:\n(1) utilize a rebuttable presumption that the applicant is not suitable for licensing or credentialing;\n(2) provide a standard for overcoming the presumption; and\n(3) require that a minimum of ten years has elapsed since the applicant was released from any incarceration or supervisory jurisdiction related to the offense.\nThe board shall not consider an application under this paragraph if the board determines that the victim involved in the offense was a patient or a client of the applicant at the time of the offense.",
	"repealed": false
}