{
	"id": "116J.8766",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8766",
	"title": "116J.8766 CLAIMS BY LENDER TO RESERVE FUND.",
	"text": "(a) If the lender charges off all or part of an enrolled loan, the lender may file a claim with the commissioner. The claim must be filed contemporaneously with the charge-off.\n(b) The lender's claim may include, in addition to the amount of principal charged off plus accrued interest, one-half of the documented out-of-pocket expenses incurred in pursuing its collection efforts, including preservation of collateral. The amount of principal and accrued interest included in the claim may not exceed the principal amount covered under the program upon enrollment, plus accrued interest attributable to the covered principal amount.\n(c) The lender shall determine when and how much to charge off on an enrolled loan in a manner consistent with its normal method for making these determinations on similar loans which are not enrolled loans.\n(d) If the lender files two or more claims contemporaneously and there are insufficient funds in its reserve fund at that time to cover the entire amount of the claims, the lender may designate the order of priority in which the commissioner shall pay the claims.\n(a) Upon receipt by the commissioner of a claim filed by the lender, the commissioner shall, within ten business days, pay or authorize the lender to withdraw from the reserve fund the amount of the claim as submitted, unless the information provided by the lender was known by the lender to be false at the time the loan was filed for enrollment. No other violation of sections 116J.876 to 116J.8769 or the agreement is grounds for denial of a claim. All money transferred or credited to the reserve fund from any source is appropriated to the commissioner to pay claims under this section.\n(b) If there is insufficient money in the reserve fund to cover the entire amount of the lender's claim, the commissioner shall pay to the lender or authorize the lender to withdraw an amount equal to the current balance in the reserve fund and the following shall apply:\n(1) If the enrolled loan for which the claim has been filed is not an early loan, the payment fully satisfies the claim, and the lender has no right to receive any further amount from the reserve fund with respect to that claim.\n(2) If the loan is an early loan, the partial payment does not satisfy the lender's claim, and at any time that the remaining balance of the claim is not greater than 75 percent of the balance in the reserve fund at the time of the loss, the commissioner, upon request of the lender, shall pay the remaining balance of the claim.\n(a) If, subsequent to payment of a claim by the commissioner, the lender recovers from a borrower any amount for which payment of the claim was made, the lender shall promptly pay to the commissioner for deposit in the reserve fund the amount recovered, less one-half of any documented out-of-pocket expenses incurred. The lender need pay to the commissioner for deposit in the reserve fund only amounts in excess of the amount of recovery needed to fully cover the lender's loss on an enrolled loan.\n(b) For the purposes of this subdivision and section 116J.8767, the lender's loss on an enrolled loan includes any losses on the loan including principal, accrued interest, and one-half of the documented out-of-pocket expenses attributable to principal amounts in excess of the amount covered under the program or the principal amount included in the claim.\nWhen a borrower becomes 60 days delinquent in the payments of an enrolled loan or before a lender files a claim with the commissioner, the lender must notify the commissioner of the delinquency. The commissioner, after notification, shall inform the borrower of the technical assistance providers in the borrower's area that may assist in solving any business or management problems experienced by the borrower.",
	"repealed": false
}