{
	"id": "383B.128",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.128",
	"title": "383B.128 PLACE OF CRIME MUST PAY WORKHOUSE INMATE DAILY EXPENSE.",
	"text": "Each municipality in which conduct alleged in a misdemeanor complaint occurs shall pay to Hennepin County for the maintenance cost of the inmate convicted thereon and sentenced to confinement in the corrections facility the sum per diem as it may cost the county for the average maintenance per inmate. The administrator and superintendent shall at the first meeting of the county board in August of each year submit for the board's approval a determination of the maintenance cost per diem per inmate of the corrections facility which shall be based upon the actual costs, records of receipts, disbursements, and other data for the preceding year, adjusted by applying to the preceding years' rate any cost of living increase or decrease for the year ending June 30 of the current year. The costs shall include the cost, not to exceed $1 per day per inmate, of the premises or structures of the corrections facility or of any permanent improvements or repairs. The superintendent shall render monthly bills to the municipalities for the maintenance costs provided for by this section.\nThe obligation to pay the maintenance cost per inmate for inmates serving concurrent sentences for misdemeanors committed shall be borne equally by the municipalities in which the misdemeanor conduct occurred. The obligation to pay the maintenance cost provided in this section for any inmate serving a misdemeanor sentence imposed by a court of Hennepin County concurrently with any sentence imposed by courts of another county or counties shall be borne equally by the different county or counties and the municipality within Hennepin County in which the misdemeanor conduct occurred.\nThe city of Plymouth shall not be liable for the maintenance cost of any inmate confined at the corrections facility for the service of a sentence imposed for conviction of any offense committed on or arising out of the inmate's confinement at or escape from the premises of the corrections facility in the city of Plymouth.\nThe superintendent shall collect from each inmate employed under the provisions of sections 383B.125 and 383B.126 and each inmate in the work release program provided for in section 631.425, a per diem amount as a contribution to the inmate's maintenance cost provided for in this section. The superintendent shall determine with the approval of the county board the per diem amount provided for herein. The per diem amount collected from each inmate shall be subtracted from any amount charged to a municipality or another county for the maintenance cost of the inmate.",
	"repealed": false
}