{
	"id": "5B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/5B.05",
	"title": "5B.05 USE OF DESIGNATED ADDRESS.",
	"text": "(a) When a program participant presents the address designated by the secretary of state to any person or entity, that address must be accepted as the address of the program participant. The person or entity must not require the program participant to submit any address that could be used to physically locate the participant either as a substitute or in addition to the designated address, or as a condition of receiving a service or benefit, unless the service or benefit would be impossible to provide without knowledge of the program participant's physical location. Notwithstanding a person's or entity's knowledge of a program participant's physical location, the person or entity must use the program participant's designated address for all mail correspondence with the program participant, unless the participant owns real property through a limited liability company or trust. A person or entity may only mail to an alternative address if the participant owns real property through a trust or a limited liability company and the participant has requested that the person or entity mail correspondence regarding that ownership to an alternate address.\n(b) A program participant may use the address designated by the secretary of state as the program participant's work address.\n(c) The Office of the Secretary of State shall forward all mail sent to the designated address to the proper program participants.\n(d) If a program participant has notified a person or entity in writing, on a form prescribed by the program, that the individual is a program participant and of the requirements of this section, the person or entity must not knowingly disclose the participant's name or address identified by the participant on the notice. If identified on the notice, the person or entity receiving the notice must not knowingly disclose the program participant's name, home address, work address, or school address, unless the person to whom the address is disclosed also lives, works, or goes to school at the address disclosed, or the participant has provided written consent to disclosure of the participant's name, home address, work address, or school address for the purpose for which the disclosure will be made. This paragraph applies to the actions and reports of guardians ad litem, except that guardians ad litem may disclose the program participant's name. This paragraph does not apply to records of the judicial branch governed by rules adopted by the supreme court or government entities governed by section 13.045.",
	"repealed": false
}