{
	"id": "246C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.12",
	"title": "246C.12 REQUIRED INPATIENT SERVICES.",
	"text": "The executive board shall make sufficient regional treatment center inpatient services available to adults with mental illness throughout the state who need this level of care. Inpatient services may be provided either on the regional treatment center campus or at any state facility or program as defined in section 246.50, subdivision 3. Services must be as close to the patient's county of residence as possible. Regional treatment centers are responsible to:\n(1) provide acute care inpatient hospitalization;\n(2) stabilize the medical and mental health condition of the adult requiring the admission;\n(3) improve functioning to the point where discharge to community-based mental health services is possible;\n(4) strengthen family and community support; and\n(5) facilitate appropriate discharge and referrals for follow-up mental health care in the community.\nThe executive board shall biennially determine the needs of all adults with mental illness who are served by regional treatment centers or at any state facility or program as defined in section 246.50, subdivision 3, by administering a client-based evaluation system. The client-based evaluation system must include at least the following independent measurements: behavioral development assessment; habilitation program assessment; medical needs assessment; maladaptive behavioral assessment; and vocational behavior assessment. The executive board shall propose staff ratios to the legislature for the mental health and support units in regional treatment centers as indicated by the results of the client-based evaluation system and the types of state-operated services needed. The proposed staffing ratios shall include professional, nursing, direct care, medical, clerical, and support staff based on the client-based evaluation system. The executive board shall recompute staffing ratios and recommendations on a biennial basis.\nRegional treatment centers must plan for and assist clients in making a transition from regional treatment centers and other inpatient state facilities as defined in section 246.50, subdivision 3, to other community-based services. In coordination with the client's case manager, if any, regional treatment centers must also arrange for appropriate follow-up care in the community during the transition period. Before a client is discharged, the regional treatment center must notify the client's case manager, so that the case manager can monitor and coordinate the transition and arrangements for the client's appropriate follow-up care in the community.\nThe executive board shall require all staff in mental health and support units at regional treatment centers who have contact with persons with mental illness or severe emotional disturbance to be appropriately trained in violence reduction and violence prevention and shall establish criteria for such training. Training programs shall be developed with input from consumer advocacy organizations and shall employ violence prevention techniques as preferable to physical interaction.\n(a) The executive board shall determine the need for the psychiatric services provided by the agency based upon individual needs assessments of persons in the state-operated services as required by subdivision 2 and an evaluation of: (1) state-operated services programs, (2) programs needed in the region for persons who require hospitalization, and (3) available epidemiologic data.\n(b) Throughout its planning and implementation, the executive board must discuss the determination of need for psychiatric services provided by the agency with the State Advisory Council on Mental Health in accordance with the council's duties under section 245.697.\n(c) The executive board must consider continuing evaluation of the information described in paragraph (a) when planning for and implementing changes in state-operated programs and facilities for persons with mental illness. The executive board may consider expansion of state-operated programs and facilities only after a thorough analysis of the need for additional psychiatric services provided by the agency and in conjunction with a comprehensive mental health plan.\nThe executive board shall periodically disseminate criteria for admission and continued stay in a state-operated services facility. The executive board shall disseminate the criteria to the courts of the state and counties.",
	"repealed": false
}