{
	"id": "624.713",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.713",
	"title": "624.713 CERTAIN PERSONS NOT TO POSSESS FIREARMS.",
	"text": "The following persons shall not be entitled to possess ammunition or a pistol or semiautomatic military-style assault weapon or, except for clause (1), any other firearm:\n(1) a person under the age of 18 years except that a person under 18 may possess ammunition designed for use in a firearm that the person may lawfully possess and may carry or possess a pistol or semiautomatic military-style assault weapon (i) in the actual presence or under the direct supervision of the person's parent or guardian, (ii) for the purpose of military drill under the auspices of a legally recognized military organization and under competent supervision, (iii) for the purpose of instruction, competition, or target practice on a firing range approved by the chief of police or county sheriff in whose jurisdiction the range is located and under direct supervision; or (iv) if the person has successfully completed a course designed to teach marksmanship and safety with a pistol or semiautomatic military-style assault weapon and approved by the commissioner of natural resources;\n(2) except as otherwise provided in clause (9), a person who has been convicted of, or adjudicated delinquent or convicted as an extended jurisdiction juvenile for committing, in this state or elsewhere, a crime of violence. For purposes of this section, crime of violence includes crimes in other states or jurisdictions which would have been crimes of violence as herein defined if they had been committed in this state;\n(3) a person who is or has ever been committed in Minnesota or elsewhere by a judicial determination that the person is mentally ill, developmentally disabled, or mentally ill and dangerous to the public, as defined in section 253B.02, to a treatment facility, or who has ever been found incompetent to stand trial or not guilty by reason of mental illness, unless the person's ability to possess a firearm and ammunition has been restored under subdivision 4;\n(4) a person who has been convicted in Minnesota or elsewhere of a misdemeanor or gross misdemeanor violation of chapter 152, unless three years have elapsed since the date of conviction and, during that time, the person has not been convicted of any other such violation of chapter 152 or a similar law of another state; or a person who is or has ever been committed by a judicial determination for treatment for the habitual use of a controlled substance or marijuana, as defined in sections 152.01 and 152.02, unless the person's ability to possess a firearm and ammunition has been restored under subdivision 4;\n(5) a person who has been committed to a treatment facility in Minnesota or elsewhere by a judicial determination that the person is chemically dependent as defined in section 253B.02, unless the person has completed treatment or the person's ability to possess a firearm and ammunition has been restored under subdivision 4. Property rights may not be abated but access may be restricted by the courts;\n(6) a peace officer who is informally admitted to a treatment facility pursuant to section 253B.04 for chemical dependency, unless the officer possesses a certificate from the head of the treatment facility discharging or provisionally discharging the officer from the treatment facility. Property rights may not be abated but access may be restricted by the courts;\n(7) a person, including a person under the jurisdiction of the juvenile court, who has been charged with committing a crime of violence and has been placed in a pretrial diversion program by the court before disposition, until the person has completed the diversion program and the charge of committing the crime of violence has been dismissed;\n(8) except as otherwise provided in clause (9), a person who has been convicted in another state of committing an offense similar to the offense described in section 609.224, subdivision 3, against a family or household member or section 609.2242, subdivision 3, unless three years have elapsed since the date of conviction and, during that time, the person has not been convicted of any other violation of section 609.224, subdivision 3, or 609.2242, subdivision 3, or a similar law of another state;\n(9) a person who has been convicted in this state or elsewhere of assaulting a family or household member and who was found by the court to have used a firearm in any way during commission of the assault is prohibited from possessing any type of firearm or ammunition for the period determined by the sentencing court;\n(10) a person who:\n(i) has been convicted in any court of a crime punishable by imprisonment for a term exceeding one year;\n(ii) is a fugitive from justice as a result of having fled from any state to avoid prosecution for a crime or to avoid giving testimony in any criminal proceeding;\n(iii) is an unlawful user of any controlled substance as defined in chapter 152. The use of medical cannabis flower or medical cannabinoid products by a patient enrolled in the registry program or the use of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products by a person 21 years of age or older does not constitute the unlawful use of a controlled substance under this item;\n(iv) has been judicially committed to a treatment facility in Minnesota or elsewhere as a person who is mentally ill, developmentally disabled, or mentally ill and dangerous to the public, as defined in section 253B.02;\n(v) is an alien who is illegally or unlawfully in the United States;\n(vi) has been discharged from the armed forces of the United States under dishonorable conditions;\n(vii) has renounced the person's citizenship having been a citizen of the United States; or\n(viii) is disqualified from possessing a firearm under United States Code, title 18, section 922(g)(8) or (9), as amended through March 1, 2014;\n(11) a person who has been convicted of the following offenses at the gross misdemeanor level, unless three years have elapsed since the date of conviction and, during that time, the person has not been convicted of any other violation of these sections: section 609.229 (crimes committed for the benefit of a gang); 609.2231, subdivision 4 (assaults motivated by bias); 609.255 (false imprisonment); 609.378 (neglect or endangerment of a child); 609.582, subdivision 4 (burglary in the fourth degree); 609.665 (setting a spring gun); 609.71 (riot); or 609.749 (harassment or stalking). For purposes of this paragraph, the specified gross misdemeanor convictions include crimes committed in other states or jurisdictions which would have been gross misdemeanors if conviction occurred in this state;\n(12) a person who has been convicted of a violation of section 609.224 if the court determined that the assault was against a family or household member in accordance with section 609.2242, subdivision 3 (domestic assault), unless three years have elapsed since the date of conviction and, during that time, the person has not been convicted of another violation of section 609.224 or a violation of a section listed in clause (11);\n(13) a person who is subject to an order for protection as described in section 260C.201, subdivision 3, paragraph (d), or 518B.01, subdivision 6, paragraph (g); or\n(14) a person who is subject to an extreme risk protection order as described in section 624.7172 or 624.7174.\nA person who issues a certificate pursuant to this section in good faith is not liable for damages resulting or arising from the actions or misconduct with a firearm or ammunition committed by the individual who is the subject of the certificate.\nThe prohibition in this subdivision relating to the possession of firearms other than pistols and semiautomatic military-style assault weapons does not apply retroactively to persons who are prohibited from possessing a pistol or semiautomatic military-style assault weapon under this subdivision before August 1, 1994.\nThe lifetime prohibition on possessing, receiving, shipping, or transporting firearms and ammunition for persons convicted or adjudicated delinquent of a crime of violence in clause (2), applies only to offenders who are discharged from sentence or court supervision for a crime of violence on or after August 1, 1993.\nParticipation as a patient in the registry program or use of adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products by a person 21 years of age or older does not disqualify the person from possessing firearms and ammunition under this section.\nFor purposes of this section, \"judicial determination\" means a court proceeding pursuant to sections 253B.07 to 253B.09 or a comparable law from another state.\nA person presently charged with a crime punishable by imprisonment for a term exceeding one year shall not be entitled to receive, ship, or transport any pistol or semiautomatic military-style assault weapon or ammunition designed for use in a pistol or semiautomatic military-style assault weapon. A violation of this subdivision is a gross misdemeanor.\n(a) A person named in subdivision 1, clause (1), who possesses ammunition or a pistol or semiautomatic military-style assault weapon in violation of that clause is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) A person named in subdivision 1, clause (2), who possesses any type of firearm or ammunition is guilty of a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $30,000, or both. This paragraph does not apply to any person who has received a relief of disability under United States Code, title 18, section 925, or whose ability to possess firearms and ammunition has been restored under section 609.165, subdivision 1d.\n(c) A person named in any other clause of subdivision 1 who possesses any type of firearm or ammunition is guilty of a gross misdemeanor.\n(a) When a person is convicted of, or adjudicated delinquent or convicted as an extended jurisdiction juvenile for committing, a crime of violence as defined in section 624.712, subdivision 5, the court shall inform the defendant that the defendant is prohibited from possessing ammunition or a pistol or semiautomatic military-style assault weapon for the remainder of the person's lifetime, and that it is a felony offense to violate this prohibition. The failure of the court to provide this information to a defendant does not affect the applicability of the ammunition or pistol or semiautomatic military-style assault weapon possession prohibition or the felony penalty to that defendant.\n(b) When a person, including a person under the jurisdiction of the juvenile court, is charged with committing a crime of violence and is placed in a pretrial diversion program by the court before disposition, the court shall inform the defendant that: (1) the defendant is prohibited from possessing a pistol or semiautomatic military-style assault weapon or ammunition designed for use in a pistol or semiautomatic military-style assault weapon until the person has completed the diversion program and the charge of committing a crime of violence has been dismissed; (2) it is a gross misdemeanor offense to violate this prohibition; and (3) if the defendant violates this condition of participation in the diversion program, the charge of committing a crime of violence may be prosecuted. The failure of the court to provide this information to a defendant does not affect the applicability of the ammunition or pistol or semiautomatic military-style assault weapon possession prohibition or the gross misdemeanor penalty to that defendant.\n(c) A court shall notify a person subject to subdivision 1, clause (3), of the prohibitions described in that clause and those described in United States Code, title 18, sections 922(d)(4) and 922(g)(4).\n(a) A person who is prohibited from possessing a firearm or ammunition under subdivision 1, due to commitment resulting from a judicial determination that the person is mentally ill, developmentally disabled, mentally ill and dangerous, or chemically dependent, may petition a court to restore the person's ability to possess a firearm or ammunition.\n(b) The court may grant the relief sought in paragraph (a) in accordance with the principles of due process if the circumstances regarding the person's disqualifying condition and the person's record and reputation are determined to be such that:\n(1) the person is not likely to act in a manner that is dangerous to public safety; and\n(2) the granting of relief would not be contrary to the public interest.\n(c) When determining whether a person has met the requirement of paragraph (b), clause (1), the court may consider evidence from a licensed medical doctor or clinical psychologist that the person is no longer suffering from the disease or condition that caused the disability or that the disease or condition has been successfully treated for a period of three consecutive years.\n(d) Review on appeal shall be de novo.\n(a) When a court places a person, including a person under the jurisdiction of the juvenile court, who is charged with committing a crime of violence into a pretrial diversion program before disposition, the court must ensure that information regarding the person's placement in that program and the ordered expiration date of that placement is transmitted as soon as practicable to the National Instant Criminal Background Check System. When a person successfully completes or discontinues the program, the prosecuting attorney must also report that fact within 24 hours of receipt to the National Instant Criminal Background Check System.\n(b) The court must report the conviction and duration of the firearms disqualification imposed as soon as practicable to the National Instant Criminal Background Check System when a person is convicted of a gross misdemeanor that disqualifies the person from possessing firearms under the following sections:\n(1) 518B.01, subdivision 14;\n(2) 609.224, subdivision 3;\n(3) 609.2242, subdivision 3;\n(4) 609.749, subdivision 8;\n(5) 624.713, subdivision 1, clause (11); or\n(6) 629.715, subdivision 2.\n(c) If the court reports a firearms disqualification based on a charge of violating an offense listed in paragraph (b), the court must provide notice of the disposition of the charge to the National Instant Criminal Background Check System within three business days.",
	"repealed": false
}