{
	"id": "173.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.02",
	"title": "173.02 DEFINITIONS.",
	"text": "For the purposes of Laws 1971, chapter 883, the terms defined in this section shall have the meanings herein given them.\n[Renumbered subd 16]\n[Repealed, 1971 c 883 s 2]\n[Renumbered subd 23]\n[Repealed, 1971 c 883 s 2]\nDirectional and other official signs and notices shall mean:\n(a) \"Official signs and notices\" means signs and notices erected and maintained by public officers or public agencies within their territorial jurisdiction and pursuant to and in accordance with direction or authorization contained in federal or state law for the purposes of carrying out an official duty or responsibility. Historical markers authorized by state law and erected by state or local governmental agencies or nonprofit historical societies, and municipal identification entrance signs erected in accordance with section 173.025, may be considered official signs.\n(b) \"Public utility signs\" means warning signs, notices, or markers which are customarily erected and maintained by publicly or privately owned public utilities, as essential to their operations.\n(c) \"Service club and religious notices\" means signs and notices, not exceeding eight square feet in advertising area, whose erection is authorized by law, relating to meetings and location of nonprofit service clubs or charitable associations, or religious services.\n(d) \"Directional signs\" means signs containing directional information about public places owned or operated by public authorities as defined in Code of Federal Regulations, title 23, section 460.2, paragraph (b), or their agencies, publicly or privately owned natural phenomena, historic, cultural, scientific, educational, and religious sites, and areas of natural scenic beauty or naturally suited for outdoor recreation, deemed to be in the interest of the traveling public. To qualify for directional signs, privately owned attractions must be nationally or regionally known, and of outstanding interest to the traveling public.\n(e) All definitions in this subdivision are intended to be in conformity with the national standards for directional and other official signs.\n[Renumbered subd 20]\n\"Abandoned and discontinued\" means an outdoor advertising device that ceases to display advertising copy for a minimum of one year and is not otherwise being actively marketed to display advertising copy.\n\"Adjacent area\" means any area adjacent to the right-of-way of an interstate or trunk highway.\n[Renumbered subd 17]\n[Renumbered subd 22]\n[Renumbered subd 19]\n\"Advertising area\" means that portion of the advertising face of an advertising device which includes the border and trim thereof, but excludes the base and apron supports and other structural members.\n[Renumbered subd 21]\n[Renumbered subd 24]\n[Renumbered subd 18]\n\"Advertising device\" means any billboard, sign, notice, poster, display, or other device visible to and primarily intended to advertise and inform or to attract or which does attract the attention of operators and occupants of motor vehicles and shall include any structure erected primarily for use in connection with the display of any such device and all lighting or other attachments used in connection therewith.\n\"Business area\" means any part of an adjacent area which is (a) zoned for business, industrial or commercial activities under the authority of any law of this state or any political subdivision thereof; or (b) not so zoned, but which constitutes an unzoned commercial or industrial area as herein defined.\n\"Conforming\" means an outdoor advertising device that complies with the requirements of this chapter.\n(a) \"Commercial or industrial activity\" for the purposes of unzoned commercial or industrial areas means an activity generally recognized as commercial or industrial by zoning authorities in this state.\n(b) None of the following activities shall be considered commercial or industrial:\n(1) outdoor advertising devices;\n(2) agricultural, forestry, ranching, grazing, farming and related activities, including, but not limited to, temporary wayside fresh produce stands;\n(3) transient or temporary activities;\n(4) activities not visible from the main-traveled way;\n(5) activities more than 660 feet from the nearest edge of the right-of-way;\n(6) activities conducted in a building principally used as a residence;\n(7) railroad tracks and minor sidings;\n(8) advertising located on vehicles or tractor trailers;\n(9) commercial establishments or businesses that have ceased to exist or operate; or\n(10) a business created to install new outdoor advertising devices.\n(a) \"Electronic advertising device\" means an advertising device capable of displaying digital content that can be changed through messaging or electronic communications technology.\n(b) Digital content consists of static text and images only, and does not include animation, flashing or moving lights, video, or other content having the appearance of movement.\n\"Erect\" means to construct, build, raise, assemble, place, affix, attach, create, paint, draw or in any other way to bring into being or establish but it shall not include any of the foregoing activities when performed as an incident to the change of advertising message or customary maintenance of an outdoor advertising structure or device.\n\"Expressway\" has the meaning given it in section 160.02, subdivision 18b.\n\"Freeway\" has the meaning given it in section 160.02, subdivision 19.\n\"Interstate highway\" means any highway at any time officially designated as a part of the national system of interstate and defense highways by the commissioner of transportation and approved by the appropriate authority of the federal government.\n\"Maintain\" means to allow to exist.\n\"Nonconforming\" means an outdoor advertising device that was lawfully erected and has been maintained lawfully but does not comply with the requirements of this chapter. A nonconforming sign is one that remains in substantially the same condition it was on July 1, 2017.\n\"Off-premise\" means an outdoor advertising device that advertises or pertains to any business, product, person, activity, event, or service that is not primarily conducted, sold, manufactured, offered, or located on the property where the sign is located.\n\"Primary highway\" means any highway, other than an interstate highway, at any time officially designated as a part of the federal aid primary system by the commissioner of transportation and approved by the appropriate authority of the federal government, and which shall include state trunk highways designated as such by Minnesota Statutes.\n\"Scenic area\" means an area within which control and regulation of the erection and maintenance of advertising devices may be exercised to the extent herein provided and such areas shall include only those established as such by the commissioner of transportation. Scenic area includes a scenic byway under United States Code, title 23, section 162.\n\"Scenic byways\" means roads that recognize outstanding scenic, cultural, historic, natural, recreational, and archaeological qualities and landscapes pursuant to United States Code, title 23, section 162.\n\"Unzoned commercial or industrial areas\" means those areas which are not zoned by state or local law, regulation, or ordinance, and on which there is located one or more permanent structures devoted to a commercial or industrial activity or on which a commercial or industrial activity is actually conducted whether or not a permanent structure is located thereon, and the area along the highway extending outward 800 feet from and beyond the edge of such activity. Each side of the highway will be considered separately in applying this definition. All measurements shall be from the outer edges of the regularly used buildings, parking lots, storage or processing, and landscaped areas of the commercial or industrial activity, not from the property lines of the activity, and shall be along or parallel to the edge of the pavement of the highway.",
	"repealed": false
}