{
	"id": "116L.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.86",
	"title": "116L.86 EMPLOYMENT AND TRAINING PROGRAMS.",
	"text": "By January 1, 2025, the commissioner, the commissioner of human services, and the commissioner of children, youth, and families shall enter into a written contract for the design, delivery, and administration of employment and training services for applicants for or recipients of Supplemental Nutrition Assistance Program (SNAP) benefits, the Minnesota family investment program, and general assistance. The contract must address:\n(1) specific roles and responsibilities of each department;\n(2) assignment and supervision of staff for interagency activities including any necessary interagency employee mobility agreements under the administrative procedures of the Department of Management and Budget;\n(3) mechanisms for determining the conditions under which individuals participate in services, their rights and responsibilities while participating, and the standards by which the services must be administered;\n(4) procedures for providing technical assistance to local service units, Indian Tribes, and employment and training service providers;\n(5) access to appropriate staff for ongoing development and interpretation of policy, rules, and program standards;\n(6) procedures for reimbursing appropriate agencies for administrative expenses; and\n(7) procedures for accessing available federal funds.\nIn developing employment and training services, the commissioner shall identify and incorporate, to the extent possible, money from both federal and state income maintenance, employment and training, and educational programs.\nThe commissioner of employment and economic development, in cooperation with the commissioners of human services and children, youth, and families, shall develop an inventory, referral, and intake system. The system must provide for coordinated delivery of employment and training and income maintenance support services, efficient client referral among programs and services, reduction of duplicate data collection, coordinated program intake by local agencies, and effective evaluation of employment and training services. The system must, at a minimum, include the following:\n(1) a listing of all available public and private employment and training services, income maintenance and support services, and vocationally directed education and training programs;\n(2) the capability to assess client needs and match those needs with employment opportunities, education and training programs, and employment and training and income maintenance and support services, and to refer the client to the appropriate employer, educational institution, or service provider;\n(3) a coordinated intake procedure for employment and training services, and income maintenance and support services;\n(4) access to a statewide database for client tracking and program evaluation; and\n(5) internal security measures to protect private data from unauthorized access.\nIn developing the system, the commissioner shall consult with the public postsecondary educational systems, local agencies, employment and training service providers, and client and employer representatives. The system must be available in each local agency or service provider delivering programs administered by the commissioner of employment and economic development or the commissioners of human services and children, youth, and families. Access by intake workers, state agency personnel, clients, and any other system users to information contained in the system must conform with all applicable federal and state data privacy requirements.",
	"repealed": false
}