{
	"id": "60A.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.315",
	"title": "60A.315 EXPEDITED FORM AND RATE FILING.",
	"text": "An insurer or rate service organization otherwise required to file rates and forms may use the expedited filing procedure under this section for homeowner's insurance as defined in section 65A.27, subdivision 4, and automobile insurance as governed by chapter 65B.\nAn insurer or rate service organization shall file with the Department of Commerce on a prescribed form a description of the policy, amendment, or endorsement and a written certification signed by an officer of the insurer or the rate service organization that the forms, policies, amendments, and endorsements comply with all applicable Minnesota statutes, rules, and case law, and a copy of the policy, amendment, or endorsement. If the filing will impact rates, the filing must comply with section 70A.06, subdivisions 1 and 1a. Forms and rates filed under this procedure are effective upon receipt by the department. Anyone using the expedited filing procedures authorized by this section must provide copies of the form filings within 24 hours of receiving a request from the commissioner. Insurers may comply with this requirement by providing the form filings in paper or electronic format.\nIf an insurer uses the services of a rate service organization for purposes of filing a certificate of compliance under this section, the certification by the rate service organization under subdivision 2 does not excuse the insurer from its obligation to ensure that its filing complies with all applicable Minnesota statutes, rules, and case law.\nIn order to be effective, the filing must be accompanied by payment of the filing fee applicable to the policy, amendment, endorsement, or rate unless the fee is remitted in accordance with an alternative procedure allowed under section 60A.14.\nThe insurer or rate service organization shall retain the policy, amendment, or endorsement for at least five years after that policy, amendment, or endorsement ceased providing coverage to any Minnesota policyholder, and shall provide to the Department of Commerce upon request a copy of any form in use pursuant to these filing procedures.\nThe commissioner is authorized to conduct audits and investigations under section 45.027 and this chapter to determine if the insurers are complying with Minnesota law in the issuance of policies described under this section. If the policy filings contain provisions that are inconsistent with or violate Minnesota law, the commissioner may take action against the insurer under section 45.027. The commissioner shall assess the insurer for the costs of the investigation performed by the department and shall deposit all such assessments into the revolving fund established under section 60A.03.",
	"repealed": false
}