{
	"id": "85.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.46",
	"title": "85.46 HORSE PASS.",
	"text": "(a) Except as provided in paragraph (b), while riding, leading, or driving a horse on lands administered by the commissioner, except forest roads and forest roads rights-of-way, a person 16 years of age or over shall carry in immediate possession a valid horse pass. The pass must be available for inspection by a peace officer, a conservation officer, or an employee designated under section 84.0835. A person who violates any provision of this subdivision is guilty of a petty misdemeanor.\n(b) A valid horse pass is not required under this section for a person riding, leading, or driving a horse on property that is owned by the person or the person's spouse, child, parent, or guardian.\n(a) The commissioner of natural resources may appoint agents to issue and sell horse passes. The commissioner may revoke the appointment of an agent at any time.\n(b) The commissioner may adopt additional rules as provided in section 97A.485, subdivision 11. An agent shall observe all rules adopted by the commissioner for the accounting and handling of passes according to section 97A.485, subdivision 11.\n(c) An agent must promptly deposit and remit all money received from the sale of passes, except issuing fees, to the commissioner.\nThe commissioner of natural resources and agents shall issue and sell horse passes. The pass shall include the applicant's information deemed necessary by the commissioner. To be valid, a daily or annual pass must be issued to the person riding, leading, or driving the horse, and a commercial annual pass must be issued to the owner of the commercial riding facility.\n[See Note.]\n(a) The fee for an annual horse pass is $20 for an individual 16 years of age and over. The fee shall be collected at the time the pass is purchased. Annual passes are valid for one year beginning January 1 and ending December 31.\n(b) The fee for a daily horse pass is $4 for an individual 16 years of age and over. The fee shall be collected at the time the pass is purchased. The daily pass is valid only for the date designated on the pass form.\n(c) The fee for a commercial annual horse pass is $200 and includes issuance of 15 passes. Additional or individual commercial annual horse passes may be purchased by the commercial riding facility owner at a fee of $20 each. Commercial annual horse passes are valid for one year beginning January 1 and ending December 31 and may be affixed to the horse tack, saddle, or person. Commercial annual horse passes are not transferable to another commercial riding facility. For the purposes of this section, a \"commercial riding facility\" is an operation where horses are used for riding instruction or other equestrian activities for hire or use by others.\nIn addition to the fee for a horse pass, an issuing fee of $1 per pass shall be charged. The issuing fee shall be retained by the seller of the pass. Issuing fees for passes sold by the commissioner of natural resources shall be deposited in the state treasury and credited to the horse pass account in the natural resources fund and are appropriated to the commissioner for the operation of the electronic licensing system. A pass shall indicate the amount of the fee that is retained by the seller.\nFees collected under this section, except for the issuing fee, shall be deposited in the state treasury and credited to the horse pass account in the natural resources fund. Except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, the fees are appropriated to the commissioner of natural resources for trail acquisition, trail and facility development, and maintenance, enforcement, and rehabilitation of horse trails or trails authorized for horse use, whether for riding, leading, or driving, on land administered by the commissioner.\nThe commissioner of natural resources and agents shall issue a duplicate pass to a person or commercial riding facility owner whose pass is lost or destroyed using the process established under section 97A.405, subdivision 3, and rules adopted thereunder. The fee for a duplicate horse pass is $2, with an issuing fee of 50 cents.",
	"repealed": false
}