{
	"id": "125A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.15",
	"title": "125A.15 PLACEMENT IN ANOTHER DISTRICT; RESPONSIBILITY.",
	"text": "The responsibility for special instruction and services for a child with a disability temporarily placed in another district for care and treatment shall be determined in the following manner:\n(a) The district of residence of a child shall be the district in which the child's parent resides, if living, or the child's guardian. If there is a dispute between school districts regarding residency, the district of residence is the district designated by the commissioner.\n(b) If a district other than the resident district places a pupil for care and treatment, the district placing the pupil must notify and give the resident district an opportunity to participate in the placement decision. When an immediate emergency placement of a pupil is necessary and time constraints foreclose a resident district from participating in the emergency placement decision, the district in which the pupil is temporarily placed must notify the resident district of the emergency placement within 15 days. The resident district has up to five business days after receiving notice of the emergency placement to request an opportunity to participate in the placement decision, which the placing district must then provide.\n(c) When a child is temporarily placed for care and treatment in a day program located in another district and the child continues to live within the district of residence during the care and treatment, the district of residence is responsible for providing transportation to and from the care and treatment program and an appropriate educational program for the child. The resident district may establish reasonable restrictions on transportation, except if a Minnesota court or agency orders the child placed at a day care and treatment program and the resident district receives a copy of the order, then the resident district must provide transportation to and from the program unless the court or agency orders otherwise. Transportation shall only be provided by the resident district during regular operating hours of the resident district. The resident district may provide the educational program at a school within the district of residence, at the child's residence, or in the district in which the day treatment center is located by paying tuition to that district. If a child's district of residence, district of open enrollment under section 124D.03, or charter school of enrollment under section 124E.11 is authorized to provide online learning instruction under state statutes, the child's district of residence may utilize that online learning program in fulfilling its educational program responsibility under this section if the child, or the child's parent or guardian for a pupil under the age of 18, agrees to that form of instruction.\n(d) When a child is temporarily placed in a residential program for care and treatment, the nonresident district in which the child is placed is responsible for providing an appropriate educational program for the child and necessary transportation while the child is attending the educational program; and must bill the district of the child's residence for the actual cost of providing the program, as outlined in section 125A.11, except as provided in paragraph (e). However, the board, lodging, and treatment costs incurred in behalf of a child with a disability placed outside of the school district of residence by the commissioner of human services or the commissioner of corrections or their agents, for reasons other than providing for the child's special educational needs must not become the responsibility of either the district providing the instruction or the district of the child's residence. For the purposes of this section, the state correctional facilities operated on a fee-for-service basis are considered to be residential programs for care and treatment. If a child's district of residence, district of open enrollment under section 124D.03, or charter school of enrollment under section 124E.11 is authorized to provide online learning instruction under state statutes, the nonresident district may utilize that online learning program in fulfilling its educational program responsibility under this section if the child, or the child's parent or guardian for a pupil under the age of 18, agrees to that form of instruction.\n(e) A privately owned and operated residential facility may enter into a contract to obtain appropriate educational programs for special education children and services with a joint powers entity. The entity with which the private facility contracts for special education services shall be the district responsible for providing students placed in that facility an appropriate educational program in place of the district in which the facility is located. If a privately owned and operated residential facility does not enter into a contract under this paragraph, then paragraph (d) applies.\n(f) The district of residence shall pay tuition and other program costs, not including transportation costs, to the district providing the instruction and services. The district of residence may claim general education aid for the child as provided by law. Transportation costs must be paid by the district responsible for providing the transportation and the state must pay transportation aid to that district.",
	"repealed": false
}