{
	"id": "10A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.08",
	"title": "10A.08 REPRESENTATION DISCLOSURE.",
	"text": "(a) A public official who represents a client for a fee before an individual, board, commission, or agency that has rulemaking authority in a hearing conducted under chapter 14, must disclose the official's participation in the action to the board within 14 days after the public official's initial appearance at a hearing. If the public official fails to disclose the participation by the date that the disclosure was due, the board may impose a late filing fee of $25 per day, not to exceed $1,000, starting on the day after the disclosure was due. The board must send notice by certified mail to a public official who fails to disclose the participation within ten business days after the disclosure was due that the public official may be subject to a civil penalty for failure to disclose the participation. A public official who fails to disclose the participation within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board of up to $1,000.\n(b) A public official required to disclose representation under this section shall provide the following information: name, address, and office held; name and address of each client represented at the hearing; the name of the individual, board, commission, or agency conducting the hearing and the date and location of the initial appearance at the hearing; and a general description of the subject or subjects on which the public official represented the client in the hearing.\nNotwithstanding subdivision 1, a public official who is a district court judge, an appeals court judge, or a supreme court justice is not required to comply with the provisions of this section.\n(a) For purposes of this section, the following definitions have the meanings given.\n(b) \"Fee\" means any compensation or other consideration for services performed or for future services.\n(c) \"Initial appearance at a hearing\" means the first appearance by a public official representing a client for a fee at a hearing on a single subject. Subsequent appearances at continuations of the same hearing are not initial appearances.",
	"repealed": false
}