{
	"id": "256.0451",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.0451",
	"title": "256.0451 HEARING PROCEDURES.",
	"text": "(a) The requirements in this section apply to all fair hearings and appeals under sections 142A.20, subdivision 2, and 256.045, subdivision 3, paragraph (a), clauses (1), (2), (3), (5), (6), (7), (10), and (12). Except as provided in subdivisions 3 and 19, the requirements under this section apply to fair hearings and appeals under section 256.045, subdivision 3, paragraph (a), clauses (4), (8), (9), and (11).\n(b) For purposes of this section, \"person\" means an individual who, on behalf of themselves or their household, is appealing or disputing or challenging an action, a decision, or a failure to act, by an agency in the human services system. When a person involved in a proceeding under this section is represented by an attorney or by an authorized representative, the term \"person\" also means the person's attorney or authorized representative. Any notice sent to the person involved in the hearing must also be sent to the person's attorney or authorized representative.\n(c) For purposes of this section, \"agency\" means the county human services agency, the state human services agency, and, where applicable, any entity involved under a contract, subcontract, grant, or subgrant with the state agency or with a county agency, that provides or operates programs or services in which appeals are governed by section 256.045.\nA person involved in a fair hearing appeal has the right of access to the person's complete case files and to examine all private welfare data on the person which has been generated, collected, stored, or disseminated by the agency. A person involved in a fair hearing appeal has the right to a free copy of all documents in the case file involved in a fair hearing appeal. For purposes of this section, \"case file\" means the information, documents, and data, in whatever form, which have been generated, collected, stored, or disseminated by the agency in connection with the person and the program or service involved.\n(a) Except in fair hearings and appeals under section 256.045, subdivision 3, paragraph (a), clauses (4), (9), and (10), the agency involved in an appeal must prepare a state agency appeal summary for each fair hearing appeal. The state agency appeal summary shall be mailed or otherwise delivered to the person who is involved in the appeal at least three working days before the date of the hearing. The state agency appeal summary must also be mailed or otherwise delivered to the department's Appeals Office at least three working days before the date of the fair hearing appeal.\n(b) In addition, the human services judge shall confirm that the state agency appeal summary is mailed or otherwise delivered to the person involved in the appeal as required under paragraph (a). The person involved in the fair hearing should be provided, through the state agency appeal summary or other reasonable methods, appropriate information about the procedures for the fair hearing and an adequate opportunity to prepare. These requirements apply equally to the state agency or an entity under contract when involved in the appeal.\n(c) The contents of the state agency appeal summary must be adequate to inform the person involved in the appeal of the evidence on which the agency relies and the legal basis for the agency's action or determination.\nA person involved in a fair hearing appeal may enforce the right of access to data and copies of the case file by making a request to the human services judge. The human services judge will make an appropriate order enforcing the person's rights under the Minnesota Government Data Practices Act, including but not limited to, ordering access to files, data, and documents; continuing a hearing to allow adequate time for access to data; or prohibiting use by the agency of files, data, or documents which have been generated, collected, stored, or disseminated without compliance with the Minnesota Government Data Practices Act and which have not been provided to the person involved in the appeal.\n(a) The human services judge prior to a fair hearing appeal may hold a prehearing conference to further the interests of justice or efficiency and must include the person involved in the appeal. A person involved in a fair hearing appeal or the agency may request a prehearing conference. The prehearing conference may be conducted by telephone, in person, or in writing. The prehearing conference may address the following:\n(1) disputes regarding access to files, evidence, subpoenas, or testimony;\n(2) the time required for the hearing or any need for expedited procedures or decision;\n(3) identification or clarification of legal or other issues that may arise at the hearing;\n(4) identification of and possible agreement to factual issues; and\n(5) scheduling and any other matter which will aid in the proper and fair functioning of the hearing.\n(b) The human services judge shall make a record or otherwise contemporaneously summarize the prehearing conference in writing, which shall be sent to both the person involved in the hearing, the person's attorney or authorized representative, and the agency. A human services judge may make and issue rulings and orders while the appeal is pending. During the pendency of the appeal, these rulings and orders are not subject to a request for reconsideration or appeal. These rulings and orders are subject to review under subdivision 24 and section 256.045, subdivision 7.\n(a) When an appeal involves an application for emergency assistance, the agency involved shall mail or otherwise deliver the state agency appeal summary to the department's Appeals Office within two working days of receiving the request for an appeal. A person may also request that a fair hearing be held on an emergency basis when the issue requires an immediate resolution. The human services judge shall schedule the fair hearing on the earliest available date according to the urgency of the issue involved. Issuance of the recommended decision after an emergency hearing shall be expedited.\n(b) The commissioner shall issue a written decision within five working days of receiving the recommended decision, shall immediately inform the parties of the outcome by telephone, and shall mail the decision no later than two working days following the date of the decision.\n(a) A person involved in a fair hearing, or the agency, may request a continuance, a rescheduling, or an adjournment of a hearing for a reasonable period of time. The grounds for granting a request for a continuance, a rescheduling, or adjournment of a hearing include, but are not limited to, the following:\n(1) to reasonably accommodate the appearance of a witness;\n(2) to ensure that the person has adequate opportunity for preparation and for presentation of evidence and argument;\n(3) to ensure that the person or the agency has adequate opportunity to review, evaluate, and respond to new evidence, or where appropriate, to require that the person or agency review, evaluate, and respond to new evidence;\n(4) to permit the person involved and the agency to negotiate toward resolution of some or all of the issues where both agree that additional time is needed;\n(5) to permit the agency to reconsider a previous action or determination;\n(6) to permit or to require the performance of actions not previously taken; and\n(7) to provide additional time or to permit or require additional activity by the person or agency as the interests of fairness may require.\n(b) Requests for continuances or for rescheduling may be made orally or in writing. The person or agency requesting the continuance or rescheduling must first make reasonable efforts to contact the other participants in the hearing or their representatives and seek to obtain an agreement on the request. Requests for continuance or rescheduling should be made no later than three working days before the scheduled date of the hearing, unless there is a good cause as specified in subdivision 13. Granting a continuance or rescheduling may be conditioned upon a waiver by the requester of applicable time limits but should not cause unreasonable delay.\nA person involved in a fair hearing or the agency may request a subpoena for a witness, for evidence, or for both. A reasonable number of subpoenas shall be issued to require the attendance and the testimony of witnesses, and the production of evidence relating to any issue of fact in the appeal hearing. The request for a subpoena must show a need for the subpoena and the general relevance to the issues involved. The subpoena shall be issued in the name of the department and shall be served and enforced as provided in section 357.22 and the Minnesota Rules of Civil Procedure.\nAn individual or entity served with a subpoena may petition the human services judge in writing to vacate or modify a subpoena. The human services judge shall resolve such a petition in a prehearing conference involving all parties and shall make a written decision. A subpoena may be vacated or modified if the human services judge determines that the testimony or evidence sought does not relate with reasonable directness to the issues of the fair hearing appeal; that the subpoena is unreasonable, over broad, or oppressive; that the evidence sought is repetitious or cumulative; or that the subpoena has not been served reasonably in advance of the time when the appeal hearing will be held.\nThe human services judge shall not have ex parte contact on substantive issues with the agency or with any person or witness in a fair hearing appeal. No employee of the department or agency shall review, interfere with, change, or attempt to influence the recommended decision of the human services judge in any fair hearing appeal, except through the procedure allowed in subdivision 18. The limitations in this subdivision do not affect the commissioner's authority to review or reconsider decisions or make final decisions.\nA fair hearing appeal may be conducted by telephone, by other electronic media, or by an in-person, face-to-face hearing. At the request of the person involved in a fair hearing appeal or their representative, a face-to-face hearing shall be conducted with all participants personally present before the human services judge.\nThe human services judge shall conduct the hearing in the county where the person involved resides, unless an alternate location is mutually agreed upon before the hearing, or unless the person has agreed to a hearing by telephone. Hearings under section 256.045, subdivision 3, paragraph (a), clauses (4), (9), and (10), must be conducted in the county where the determination was made, unless an alternate location is mutually agreed upon before the hearing. The hearing room shall be of sufficient size and layout to adequately accommodate both the number of individuals participating in the hearing and any identified special needs of any individual participating in the hearing. The human services judge shall ensure that all communication and recording equipment that is necessary to conduct the hearing and to create an adequate record is present and functioning properly. If any necessary communication or recording equipment fails or ceases to operate effectively, the human services judge shall take any steps necessary, including stopping or adjourning the hearing, until the necessary equipment is present and functioning properly. All reasonable efforts shall be undertaken to prevent and avoid any delay in the hearing process caused by defective communication or recording equipment.\nThe human services judge has a duty to inquire and to determine whether any participant in the hearing needs the services of an interpreter or translator in order to participate in or to understand the hearing process. Necessary interpreter or translation services must be provided at no charge to the person involved in the hearing. If it appears that interpreter or translation services are needed but are not available for the scheduled hearing, the human services judge shall continue or postpone the hearing until appropriate services can be provided.\nIf a person involved in a fair hearing appeal fails to appear at the hearing, the human services judge may dismiss the appeal. The human services judge may reopen the appeal if within ten working days after the date of the dismissal the person files information in writing with the human services judge to show good cause for not appearing. Good cause can be shown when there is:\n(1) a death or serious illness in the person's family;\n(2) a personal injury or illness which reasonably prevents the person from attending the hearing;\n(3) an emergency, crisis, or unforeseen event which reasonably prevents the person from attending the hearing;\n(4) an obligation or responsibility of the person which a reasonable person, in the conduct of one's affairs, could reasonably determine takes precedence over attending the hearing;\n(5) lack of or failure to receive timely notice of the hearing in the preferred language of the person involved in the hearing; and\n(6) excusable neglect, excusable inadvertence, excusable mistake, or other good cause as determined by the human services judge.\nThe human services judge shall begin each hearing by describing the process to be followed in the hearing, including the swearing in of witnesses, how testimony and evidence are presented, the order of examining and cross-examining witnesses, and the opportunity for an opening statement and a closing statement. The human services judge shall identify for the participants the issues to be addressed at the hearing and shall explain to the participants the burden of proof which applies to the person involved and the agency. The human services judge shall confirm, prior to proceeding with the hearing, that the state agency appeal summary, if required under subdivision 3, has been properly completed and provided to the person involved in the hearing, and that the person has been provided documents and an opportunity to review the case file, as provided in this section.\nThe human services judge shall act in a fair and impartial manner at all times. At the beginning of the hearing the agency must designate one person as their representative who shall be responsible for presenting the agency's evidence and questioning any witnesses. The human services judge shall make sure that the person and the agency are provided sufficient time to present testimony and evidence, to confront and cross-examine all adverse witnesses, and to make any relevant statement at the hearing. The human services judge shall make reasonable efforts to explain the hearing process to persons who are not represented and shall ensure that the hearing is conducted fairly and efficiently. Upon the reasonable request of the person or the agency involved, the human services judge may direct witnesses to remain outside the hearing room, except during their individual testimony. The human services judge shall not terminate the hearing before affording the person and the agency a complete opportunity to submit all admissible evidence and reasonable opportunity for oral or written statement. When a hearing extends beyond the time which was anticipated, the hearing shall be rescheduled or continued from day-to-day until completion. Hearings that have been continued shall be timely scheduled to minimize delay in the disposition of the appeal.\nThe hearing shall address the correctness and legality of the agency's action and shall not be limited simply to a review of the propriety of the agency's action. The person involved may raise and present evidence on all legal claims or defenses arising under state or federal law as a basis for appealing or disputing an agency action but not constitutional claims beyond the jurisdiction of the fair hearing. The human services judge may take official notice of adjudicative facts.\nThe burden of persuasion is governed by specific state or federal law and regulations that apply to the subject of the hearing. If there is no specific law, then the participant in the hearing who asserts the truth of a claim is under the burden to persuade the human services judge that the claim is true.\nThe human services judge or the commissioner may determine that a written comment by the department about the policy implications of a specific legal issue could help resolve a pending appeal. Such a written policy comment from the department shall be obtained only by a written request that is also sent to the person involved and to the agency or its representative. When such a written comment is received, both the person involved in the hearing and the agency shall have adequate opportunity to review, evaluate, and respond to the written comment, including submission of additional testimony or evidence, and cross-examination concerning the written comment.\nThe human services judge shall accept all evidence, except evidence privileged by law, that is commonly accepted by reasonable people in the conduct of their affairs as having probative value on the issues to be addressed at the hearing. Except in fair hearings and appeals under section 256.045, subdivision 3, paragraph (a), clauses (4), (9), (10), and (12), in cases involving medical issues such as a diagnosis, a physician's report, or a review team's decision, the human services judge shall consider whether it is necessary to have a medical assessment other than that of the individual making the original decision. When necessary, the human services judge shall require an additional assessment be obtained at agency expense and made part of the hearing record. The human services judge shall ensure for all cases that the record is sufficiently complete to make a fair and accurate decision.\nIn cases involving unrepresented persons, the human services judge shall take appropriate steps to identify and develop in the hearing relevant facts necessary for making an informed and fair decision. These steps may include, but are not limited to, asking questions of witnesses and referring the person to a legal services office. An unrepresented person shall be provided an adequate opportunity to respond to testimony or other evidence presented by the agency at the hearing. The human services judge shall ensure that an unrepresented person has a full and reasonable opportunity at the hearing to establish a record for appeal.\nThe agency must present its evidence prior to or at the hearing. The agency shall not be permitted to submit evidence after the hearing except by agreement at the hearing between the person involved, the agency, and the human services judge. If evidence is submitted after the hearing, based on such an agreement, the person involved and the agency must be allowed sufficient opportunity to respond to the evidence. When necessary, the record shall remain open to permit a person to submit additional evidence on the issues presented at the hearing.\nA timely, written decision must be issued in every appeal. Each decision must contain a clear ruling on the issues presented in the appeal hearing and should contain a ruling only on questions directly presented by the appeal and the arguments raised in the appeal.\n(a) A written decision must be issued within 90 days of the date the person involved requested the appeal unless a shorter time is required by law. An additional 30 days is provided in those cases where the commissioner refuses to accept the recommended decision. In appeals of maltreatment determinations or disqualifications filed pursuant to section 256.045, subdivision 3, paragraph (a), clause (4), (8), or (9), that also give rise to possible licensing actions, the 90-day period for issuing final decisions does not begin until the later of the date that the licensing authority provides notice to the appeals division that the authority has made the final determination in the matter or the date the appellant files the last appeal in the consolidated matters.\n(b) The decision must contain both findings of fact and conclusions of law, clearly separated and identified. The findings of fact must be based on the entire record. Each finding of fact made by the human services judge shall be supported by a preponderance of the evidence unless a different standard is required under the regulations of a particular program. The \"preponderance of the evidence\" means, in light of the record as a whole, the evidence leads the human services judge to believe that the finding of fact is more likely to be true than not true. The legal claims or arguments of a participant do not constitute either a finding of fact or a conclusion of law, except to the extent the human services judge adopts an argument as a finding of fact or conclusion of law.\nThe decision shall contain at least the following:\n(1) a listing of the date and place of the hearing and the participants at the hearing;\n(2) a clear and precise statement of the issues, including the dispute under consideration and the specific points which must be resolved in order to decide the case;\n(3) a listing of the material, including exhibits, records, reports, placed into evidence at the hearing, and upon which the hearing decision is based;\n(4) the findings of fact based upon the entire hearing record. The findings of fact must be adequate to inform the participants and any interested person in the public of the basis of the decision. If the evidence is in conflict on an issue which must be resolved, the findings of fact must state the reasoning used in resolving the conflict;\n(5) conclusions of law that address the legal authority for the hearing and the ruling, and which give appropriate attention to the claims of the participants to the hearing;\n(6) a clear and precise statement of the decision made resolving the dispute under consideration in the hearing; and\n(7) written notice of the right to appeal to district court or to request reconsideration, and of the actions required and the time limits for taking appropriate action to appeal to district court or to request a reconsideration.\n(c) The human services judge shall not independently investigate facts or otherwise rely on information not presented at the hearing. The human services judge may not contact other agency personnel, except as provided in subdivision 18. The human services judge's recommended decision must be based exclusively on the testimony and evidence presented at the hearing, and legal arguments presented, and the human services judge's research and knowledge of the law.\n(d) The commissioner will review the recommended decision and accept or refuse to accept the decision according to section 142A.20, subdivision 3, or 256.045, subdivision 5.\n(a) If the commissioner refuses to accept the recommended order from the human services judge, the person involved, the person's attorney or authorized representative, and the agency shall be sent a copy of the recommended order, a detailed explanation of the basis for refusing to accept the recommended order, and the proposed modified order.\n(b) The person involved and the agency shall have at least ten business days to respond to the proposed modification of the recommended order. The person involved and the agency may submit a legal argument concerning the proposed modification, and may propose to submit additional evidence that relates to the proposed modified order.\n(a) Reconsideration may be requested within 30 days of the date of the commissioner's final order. If reconsideration is requested under section 142A.20, subdivision 3, or 256.045, subdivision 5, the other participants in the appeal shall be informed of the request. The person seeking reconsideration has the burden to demonstrate why the matter should be reconsidered. The request for reconsideration may include legal argument and may include proposed additional evidence supporting the request. The other participants shall be sent a copy of all material submitted in support of the request for reconsideration and must be given ten days to respond.\n(b) When the requesting party raises a question as to the appropriateness of the findings of fact, the commissioner shall review the entire record.\n(c) When the requesting party questions the appropriateness of a conclusion of law, the commissioner shall consider the recommended decision, the decision under reconsideration, and the material submitted in connection with the reconsideration. The commissioner shall review the remaining record as necessary to issue a reconsidered decision.\n(d) The commissioner shall issue a written decision on reconsideration in a timely fashion. The decision must clearly inform the parties that this constitutes the final administrative decision, advise the participants of the right to seek judicial review, and the deadline for doing so.\nAppeal decisions must be maintained in a manner so that the public has ready access to previous decisions on particular topics, subject to appropriate procedures for safeguarding names, personal identifying information, and other private data on the individual persons involved in the appeal.",
	"repealed": false
}