{
	"id": "62J.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.81",
	"title": "62J.81 DISCLOSURE OF PAYMENTS FOR HEALTH CARE SERVICES.",
	"text": "(a) A health care provider, as defined in section 62J.03, subdivision 8, or the provider's designee as agreed to by that designee, shall, at the request of a consumer, and at no cost to the consumer or the consumer's employer, provide that consumer with a good faith estimate of the allowable payment the provider has agreed to accept from the consumer's health plan company for the services specified by the consumer, specifying the amount of the allowable payment due from the health plan company. If a consumer has no applicable public or private coverage, the health care provider must give the consumer, and at no cost to the consumer, a good faith estimate of the average allowable reimbursement the provider accepts as payment from private third-party payers for the services specified by the consumer and the estimated amount the noncovered consumer will be required to pay.\n(b) In addition to the information required to be disclosed under paragraph (a), a provider must also provide the consumer with information regarding other types of fees or charges that the consumer may be required to pay in conjunction with a visit to the provider, including but not limited to any applicable facility fees.\n(c) The information required under this subdivision must be provided to a consumer within ten business days from the day a complete request was received by the health care provider. For purposes of this section, \"complete request\" includes all the patient and service information the health care provider requires to provide a good faith estimate, including a completed good faith estimate form if required by the health care provider.\n(d) Payment information provided by a provider, or by the provider's designee as agreed to by that designee, to a patient pursuant to this subdivision does not constitute a legally binding estimate of the allowable charge for or cost to the consumer of services.\n(e) No contract between a health plan company and a provider shall prohibit a provider from disclosing the pricing information required under this subdivision.\n(a) A health plan company, as defined in section 62J.03, subdivision 10, shall, at the request of an enrollee intending to receive specific health care services or the enrollee's designee, provide that enrollee with a good faith estimate of the allowable amount the health plan company has contracted for with a specified provider within the network as total payment for a health care service specified by the enrollee and the portion of the allowable amount due from the enrollee and the enrollee's out-of-pocket costs. An estimate provided to an enrollee under this paragraph is not a legally binding estimate of the allowable amount or enrollee's out-of-pocket cost.\n(b) The information required under this subdivision must be provided by the health plan company to an enrollee within ten business days from the day a complete request was received by the health plan company. For purposes of this section, \"complete request\" includes all the patient and service information the health plan company requires to provide a good faith estimate, including a completed good faith estimate form if required by the health plan company.\n(a) For purposes of this section, \"consumer\" does not include a medical assistance or MinnesotaCare enrollee, for services covered under those programs.\n(b) For purposes of this section, a good faith estimate is not:\n(1) a guarantee of final costs for services received from a health care provider; or\n(2) a final determination of eligibility for coverage of benefits or provider network participation under a health plan.",
	"repealed": false
}