{
	"id": "336.9-322",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-322",
	"title": "336.9-322 PRIORITIES AMONG CONFLICTING SECURITY INTERESTS IN AND AGRICULTURAL LIENS ON SAME COLLATERAL.",
	"text": "(a) General priority rules. Except as otherwise provided in this section, priority among conflicting security interests and agricultural liens in the same collateral is determined according to the following rules:\n(1) Conflicting perfected security interests and agricultural liens rank according to priority in time of filing or perfection. Priority dates from the earlier of the time a filing covering the collateral is first made or the security interest or agricultural lien is first perfected, if there is no period thereafter when there is neither filing nor perfection.\n(2) A perfected security interest or agricultural lien has priority over a conflicting unperfected security interest or agricultural lien.\n(3) The first security interest or agricultural lien to attach or become effective has priority if conflicting security interests and agricultural liens are unperfected.\n(b) Time of perfection: proceeds and supporting obligations. For the purposes of subsection (a)(1):\n(1) the time of filing or perfection as to a security interest in collateral is also the time of filing or perfection as to a security interest in proceeds; and\n(2) the time of filing or perfection as to a security interest in collateral supported by a supporting obligation is also the time of filing or perfection as to a security interest in the supporting obligation.\n(c) Special priority rules: proceeds and supporting obligations. Except as otherwise provided in subsection (f), a security interest in collateral which qualifies for priority over a conflicting security interest under section 336.9-327, 336.9-328, 336.9-329, 336.9-330, or 336.9-331 also has priority over a conflicting security interest in:\n(1) any supporting obligation for the collateral; and\n(2) proceeds of the collateral if:\n(A) the security interest in proceeds is perfected;\n(B) the proceeds are cash proceeds or of the same type as the collateral; and\n(C) in the case of proceeds that are proceeds of proceeds, all intervening proceeds are cash proceeds, proceeds of the same type as the collateral, or an account relating to the collateral.\n(d) First-to-file priority rule for certain collateral. Subject to subsection (e) and except as otherwise provided in subsection (f), if a security interest in chattel paper, deposit accounts, negotiable documents, instruments, investment property, or letter of credit rights is perfected by a method other than filing, conflicting perfected security interests in proceeds of the collateral rank according to priority in time of filing.\n(e) Applicability of subsection (d). Subsection (d) applies only if the proceeds of the collateral are not cash proceeds, chattel paper, negotiable documents, instruments, investment property, or letter of credit rights.\n(f) Limitations on subsections (a) through (e). Subsections (a) through (e) are subject to:\n(1) subsection (g) and the other provisions of this part;\n(2) section 336.4-210 with respect to a security interest of a collecting bank;\n(3) section 336.5-118 with respect to a security interest of an issuer or nominated person; and\n(4) section 336.9-110 with respect to a security interest arising under article 2 or 2A.\n(g) Priority under agricultural lien statute. A perfected agricultural lien on collateral has priority over a conflicting security interest in or agricultural lien on the same collateral if the statute creating the agricultural lien so provides.",
	"repealed": false
}