{
	"id": "66A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.21",
	"title": "66A.21 DOMESTIC MUTUAL INSURANCE COMPANIES, SEPARATION OF ASSESSABLE AND NONASSESSABLE BUSINESSES.",
	"text": "Any domestic mutual insurance corporation which transacts its business partly on an assessable basis and partly on a nonassessable basis, may separate one plan from the other by either of the following methods:\n(1) By transferring its nonassessable policies, and all assets and liabilities attributable thereto to another existing domestic mutual insurance corporation or to a new domestic mutual insurance corporation formed for that specific purpose, provided that in either case, the corporation assuming the risks shall have all its policies on a nonassessable basis; or\n(2) By transferring its assessable policies, and all assets and liabilities attributable thereto, to another existing domestic mutual insurance corporation or to a new domestic mutual insurance corporation formed for that specific purpose, provided that in either case, the corporation assuming the risks shall have all its policies on the assessable basis.\nThe separation can be effected only as a result of a joint agreement entered into, approved and filed as follows:\n(1) The board of directors of the ceding and assuming corporations shall, by majority vote, enter into a joint agreement, prescribing the terms and conditions of the separation and the mode of carrying the same into effect, with such other details and provisions as they deem necessary. The agreement shall provide for an adjustment of final figures as may be necessary after a verifying examination of the corporation by the commissioner of commerce as hereinafter provided.\n(2) The agreement shall be submitted to the members of the ceding corporation, at a special meeting duly called for the purpose of considering and acting upon the agreement. Notice for such special meeting shall be deemed sufficient if mailed to the policyholders' last known address as shown on the policy records of the corporation. If the holders of two-thirds of the voting power of the members present or represented at the meeting shall vote for the adoption of the agreement, then that fact shall be certified on the agreement by the secretary of the corporation and the agreement so adopted and certified shall be signed and acknowledged by the president and secretary of both the ceding and assuming corporations.\n(3) The agreement so adopted, certified and acknowledged shall be delivered to the commissioner of commerce. It shall be the duty of the commissioner to determine, after a verifying examination, if the provisions thereof are fair and equitable to all concerned and to verify the reasonableness and accuracy of the apportionment of assets, liabilities, and surplus provided for in the agreement.\nIf the commissioner is satisfied that the agreement is fair and reasonable and that its provisions relating to transfers of assets and assumption of liabilities are equitable to claimants and policyholders, the commissioner shall place a certificate of approval on the agreement and shall file it in the commissioner's office. A copy of the agreement, certified by the commissioner of commerce shall be filed for record in the Office of the Secretary of State and recorded in the office of the county recorder of the counties in this state in which any of the corporate parties to the agreement have their home offices and of any counties in which any of the corporate parties have land, title to which will be transferred under the terms of the agreement.\n(1) If the joint agreement provides for a new domestic mutual insurance corporation to be formed to assume the business ceded, the articles of incorporation for such new corporation shall be prepared and delivered to the commissioner of commerce for approval, together with the agreement as provided in subdivision 2.\n(2) Such articles shall be prepared, executed, approved, filed and recorded in the form and manner prescribed in, or applicable to, the particular law or laws under which the new insurance corporation is to be formed.\n(3) The Department of Commerce shall grant and the commissioner of commerce shall issue to such new corporation a certificate of authority immediately upon its assumption of the business ceded and upon its making the deposit of securities with the commissioner of commerce, as required by law.\nThe separation shall be effective on the agreed date stated in the joint agreement, upon filing of the same as herein provided.",
	"repealed": false
}