{
	"id": "216B.027",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.027",
	"title": "216B.027 COOPERATIVE ELECTRIC ASSOCIATION STOCKHOLDER RIGHTS.",
	"text": "It is the intent of this section to specify those rights which shall be extended to stockholders of cooperative electric associations. The guarantee of these rights, as specified herein, is intended to further the active participation of stockholders in any and all matters pertaining to the prudent operation of their organization.\nCooperative associations organized under chapter 308A for the purpose of providing rural electrification at retail to ultimate consumers shall comply with the provisions of this section in addition to other applicable provisions of chapter 308A and other applicable state and federal laws.\nThe provisions of section 302A.461 and any amendments or successor requirements to it shall apply to every wholesale or retail cooperative electric association. The rights granted to wholesale and retail electric cooperative stockholders in this section shall apply also to the spouse of the stockholder. In addition to the requirements of section 302A.461, a wholesale or retail electric cooperative shall maintain records of all proceedings of meetings of stockholders and directors during the previous three-year period including the vote of each director on roll call votes. Roll call votes are required on actions which directly establish service charge and rate schedules. Roll call voting is also required on any matter upon the request of one or more directors. Every duly elected director of a retail cooperative electric association shall have the right to inspect under section 302A.461, in person and at any reasonable time, the business records required by this subdivision and maintained by the wholesale cooperative electric association from which it purchases the majority of its electric requirements.\nMeetings of the board of directors of any retail cooperative electric association must be open to the stockholders of the cooperative and the stockholders' spouses. Stockholders must be given notice of all regularly scheduled meetings except those of an emergency nature. Duly elected directors of retail cooperative associations must be given notice, through their retail cooperative associations, of all meetings of the board of directors of the wholesale cooperative association, except those of an emergency nature, from which the retail cooperative purchases the majority of its electric requirements. Portions of meetings relating to labor negotiations, current litigation, personnel matters, and nonpayment of customer accounts are excluded from the provisions of this subdivision.\nNotwithstanding the provisions of sections 308A.611 and 308A.615, upon receipt of a written petition concerning governance matters signed by at least 500 stockholders or five percent of the stockholders, whichever is less, of a retail cooperative electric association, the matter in the petition must be presented to the stockholders of the cooperative for a vote at the next annual meeting. Petitions must be received by the cooperative electric association 60 days prior to the scheduled annual meeting. For purposes of this section, \"governance matters\" means matters properly contained in the articles of incorporation or bylaws by adopting, amending, or repealing bylaws or the articles of incorporation.\nWhenever the directors of a retail cooperative electric association provide information to stockholders to influence their vote on a matter to be decided by a vote of the stockholders pursuant to a successful petition submitted under the provisions of subdivision 5 or section 216B.026, subdivision 4, the directors shall provide the organizers of the petition or person presenting the petition the opportunity to include their position on the matter to the stockholders in a substantially similar mode and range of distribution. The organizers of the petition shall pay the costs of such inclusion.\nNo cooperative shall be bound by the provisions of this section unless adoption has been approved at referendum using the petition and election procedures in section 216B.026. Within 60 days of May 19, 1983, the board of directors of each cooperative electric association shall notify the stockholders of the provisions of this section and shall explain the process for ratification by petition and election as provided in this subdivision.",
	"repealed": false
}