{
	"id": "3.7371",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.7371",
	"title": "3.7371 COMPENSATION FOR CROP OR FENCE DAMAGE CAUSED BY ELK.",
	"text": "Notwithstanding section 3.736, subdivision 3, paragraph (e), or any other law, a person who owns an agricultural crop or pasture shall be compensated by the commissioner of agriculture for an agricultural crop, or fence surrounding the crop or pasture, that is damaged or destroyed by elk as provided in this section.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Approved agent\" means a person authorized by the Department of Agriculture to determine if crop or fence damage was caused by elk and to assign a monetary value to the crop or fence damage.\n(c) \"Commissioner\" means the commissioner of agriculture or the commissioner's authorized representative.\n(d) \"Estimated value\" means the current value of crops or fencing as determined by an approved agent.\n(e) \"Owner\" means an individual, firm, corporation, copartnership, or association with an interest in crops or fencing damaged by elk.\n(a) The owner must prepare a claim on forms provided by the commissioner and available on the Department of Agriculture website or by request from the commissioner.\n(b) After discovering crop or fence damage suspected to be caused by elk, an owner must promptly notify an approved agent of the damage. To submit a claim for crop or fence damage caused by elk, an owner must complete the required portions of the claim form provided by the commissioner. An owner who has submitted a claim must provide an approved agent with all information required to investigate the crop or fence damage.\n(a) Upon receiving notification of crop or fence damage suspected to be caused by elk, an approved agent must promptly investigate the damage in a timely manner. An approved agent must make written findings on the claim form regarding whether the crop or fence was destroyed or damaged by elk. The approved agent's findings must be based on physical and circumstantial evidence, including:\n(1) the condition of the crop or fence;\n(2) the presence of elk tracks;\n(3) the geographic area of the state where the crop or fence damage occurred;\n(4) any sightings of elk in the area; and\n(5) any other circumstances that the approved agent considers to be relevant.\n(b) The absence of affirmative evidence may be grounds for denial of a claim.\n(c) On a claim form, an approved agent must make written findings of the extent of crop or fence damage and, if applicable, the amount of crop destroyed.\n(d) For damage to standing crops, an owner may choose to have the approved agent use the method in clause (1) or (2) to complete the claim form and determine the amount of crop loss:\n(1) to submit a claim form to the commissioner at the time that the suspected elk damage is discovered, the approved agent must record on the claim form: (i) the field's potential yield per acre; (ii) the field's average yield per acre that is expected on the damaged acres; (iii) the estimated value of the crop; and (iv) the total amount of loss. Upon completing the claim form, the approved agent must submit the form to the commissioner; or\n(2) to submit a claim form to the commissioner at the time that the crop is harvested, the approved agent must record on the claim form at the time of the investigation: (i) the percent of crop loss from damage; (ii) the actual yield of the damaged field when the crop is harvested; (iii) the estimated value of the crop; and (iv) the total amount of loss. Upon completing the claim form, the approved agent must submit the form to the commissioner.\n(e) For damage to stored crops, an approved agent must record on the claim form: (1) the type and volume of destroyed stored crops; (2) the estimated value of the crop; and (3) the total amount of loss.\n(f) For damage to fencing, an approved agent must record on the claim form: (1) the type of materials damaged; (2) the linear feet of the damage; (3) the value of the materials per unit according to National Resource Conservation Service specifications; and (4) the calculated total damage to the fence.\nA completed claim form must be signed by the owner and an approved agent. An approved agent must submit the claim form to the commissioner for the commissioner's review and payment. The commissioner must return an incomplete claim form to the approved agent. When returning an incomplete claim form to an approved agent, the commissioner must indicate which information is missing from the claim form.\n(a) An owner is entitled to the estimated value of the damaged or destroyed crop or fence. Verification of crop or fence damage by elk may be provided by submitting photographs or other evidence and documentation using forms prescribed by the commissioner. The commissioner, upon recommendation of the commissioner's approved agent, shall determine whether the crop damage or destruction or damage to or destruction of a fence surrounding a crop or pasture is caused by elk and, if so, the amount of the crop or fence that is damaged or destroyed. In any fiscal year, an owner may not be compensated for a damaged or destroyed crop or fence surrounding a crop or pasture that is less than $100 in value and may be compensated up to $20,000, as determined under this section. An owner may not be compensated more than $1,800 per fiscal year for damage to fencing surrounding a crop or pasture.\n(b) In any fiscal year, the commissioner may provide compensation for claims filed under this section up to the amount expressly appropriated for this purpose.\nPayments authorized by this section must be reduced by amounts received by the owner as proceeds from an insurance policy covering crop losses or damage to or destruction of a fence surrounding a crop or pasture, or from any other source for the same purpose including, but not limited to, a federal program.\nIf the commissioner finds that the owner has shown that the damage or destruction of the owner's crop or damage to or destruction of a fence surrounding a crop or pasture was caused more probably than not by elk, the commissioner shall pay compensation as provided in this section and the rules of the commissioner. An owner who receives compensation under this section may, by written permission, permit hunting on the land at the landowner's discretion.\n(a) If the commissioner denies compensation claimed by an owner under this section, the commissioner shall issue a written decision based upon the available evidence including a statement of the facts upon which the decision is based and the conclusions on the material issues of the claim. A copy of the decision must be mailed to the owner.\n(b) A decision denying compensation claimed under this section is not subject to the contested case review procedures of chapter 14, but an owner may have the claim reviewed in a trial de novo in a court in the county where the loss occurred. The decision of the court may be appealed as in other civil cases. Review in court may be obtained by filing a petition for review with the administrator of the court within 60 days following receipt of a decision under this section. Upon the filing of a petition, the administrator shall mail a copy to the commissioner and set a time for hearing within 90 days after the filing.\nMS 2022 [Repealed, 2024 c 126 art 2 s 73; 2024 c 127 art 38 s 73]\nThe commissioner must submit a report to the chairs of the house of representatives and senate committees and divisions with jurisdiction over agriculture and environment and natural resources by December 15 each year that details the total amount of damages paid, by elk herd, in the previous two fiscal years.",
	"repealed": false
}