{
	"id": "198.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/198.03",
	"title": "198.03 MAINTENANCE CHARGES.",
	"text": "Any person otherwise eligible for admission to the Minnesota veterans homes, except that the person has means of support, may, at the discretion of the commissioner, be admitted to one of the Minnesota veterans homes upon entering into and complying with the terms of a contract made by the person with the commissioner, providing for reasonable compensation to be paid by such person to the state of Minnesota for care, support, and maintenance in the home. Any earnings derived by the person from participating in a work therapy program while the person is a resident of the home may not be considered a means of support. Rebates of federal taxes and state taxes may not be considered a means of support.\n(a) The commissioner shall set out in rules the method of calculating the average cost of care for the domiciliary and nursing care residents. The cost must be determined yearly based upon the average cost per resident taking into account, but not limited to, administrative cost of the homes, the cost of service available to the resident, and food and lodging costs. These average costs must be calculated separately for domiciliary and nursing care residents. The amount charged each resident for maintenance, if anything, must be based on the appropriate average cost of care calculation and the assets and income of the resident but must not exceed the appropriate average cost of care.\n(b) Beginning July 1, 2021, the Personal Needs Allowance (PNA) for domiciliary residents must be based on the Minnesota Department of Human Services' (DHS) most recent General Assistance program PNA and is in effect the same date as the DHS PNA is in effect. Thereafter, the PNA for domiciliary residents must be adjusted and put into effect each year or each time DHS adjusts the General Assistance program PNA.\nResidents are liable for paying all of their overdue maintenance charges. Overdue maintenance charges incurred after May 1, 1990, may be charged interest according to section 334.01. A resident owing overdue maintenance to the state of Minnesota for charges incurred prior to May 1, 1990, may continue to stay in the home if the resident enters into an agreement, including a payment schedule, with the administrator for the payment of the arrearage and abides by the agreement. Residents who do not promptly pay maintenance or who do not abide by their agreements to pay overdue maintenance to the state of Minnesota may be discharged from the home. The payment schedule agreed to between the administrator and the resident must provide for the prompt payment of the overdue maintenance owed by the resident, but it must not reduce the resident's personal needs allowance below that which is provided for in the administrative rules of the facility.",
	"repealed": false
}