{
	"id": "15A.082",
	"url": "https://www.revisor.mn.gov/statutes/cite/15A.082",
	"title": "15A.082 COMPENSATION COUNCIL.",
	"text": "A Compensation Council is created each odd-numbered year to establish the compensation of constitutional officers and the heads of state and metropolitan agencies identified in section 15A.0815, to assist the legislature in establishing the compensation of justices of the supreme court and judges of the court of appeals and district court, and to determine the daily compensation for voting members of the Direct Care and Treatment executive board.\n(a) The Compensation Council consists of the following members: eight nonjudges appointed by the chief justice of the supreme court, of whom no more than four may belong to the same political party; and one member from each congressional district appointed by the governor, of whom no more than four may belong to the same political party. The speaker and minority leader of the house of representatives must each appoint two members. The majority leader and minority leader of the senate must each appoint two members. Appointments must be made after the first Monday in January and before January 15. The compensation and removal of members shall be as provided in section 15.059, subdivisions 3 and 4. Members continue to serve until new members are appointed. Members appointed by the governor may not vote on the salary of the governor. The Legislative Coordinating Commission shall provide the council with administrative and support services. The commissioner of management and budget must provide analytical and policy support to the council related to the compensation of agency heads. The provision of analytical and policy support under this subdivision shall not be considered ex parte communication under subdivision 7.\n(b) Members appointed under paragraph (a) may not be a:\n(1) current or former judge;\n(2) current lobbyist registered under Minnesota law;\n(3) current employee in the judicial, legislative, or executive branch of state government;\n(4) current or former governor, lieutenant governor, attorney general, secretary of state, or state auditor; or\n(5) current or former legislator, or the spouse of a current legislator.\n(a) By April 1 in each odd-numbered year, the Compensation Council shall submit to the speaker of the house and the president of the senate salary recommendations for justices of the supreme court, and judges of the court of appeals and district court. The recommended salaries take effect on July 1 of that year and July 1 of the subsequent even-numbered year and at whatever interval the council recommends thereafter, unless the legislature by law provides otherwise. The salary recommendations take effect if an appropriation of money to pay the recommended salaries is enacted after the recommendations are submitted and before their effective date. Recommendations may be expressly modified or rejected.\n(b) By April 1 in each odd-numbered year, the Compensation Council must prescribe salaries for constitutional officers, and for the agency and metropolitan agency heads identified in section 15A.0815. The prescribed salary for each office must take effect July 1 of that year and July 1 of the subsequent even-numbered year and at whatever interval the council determines thereafter, unless the legislature by law provides otherwise. An appropriation by the legislature to fund the relevant office, branch, or agency of an amount sufficient to pay the salaries prescribed by the council constitutes a prescription by law as provided in the Minnesota Constitution, article V, sections 4 and 5.\n(c) By April 1 in each odd-numbered year, the Compensation Council must prescribe daily compensation for voting members of the Direct Care and Treatment executive board. The recommended daily compensation takes effect on July 1 of that year and July 1 of the subsequent even-numbered year and at whatever interval the council recommends thereafter, unless the legislature by law provides otherwise.\nIn making compensation recommendations and determinations, the council shall consider the amount of compensation paid in government service and the private sector to persons with similar qualifications, the amount of compensation needed to attract and retain experienced and competent persons, and the ability of the state to pay the recommended compensation.\nNo constitutional officer whose compensation is set under this section may receive monetary compensation for unused vacation or sick leave accruals.\n[Repealed, 1987 c 404 s 191]\nEach Compensation Council shall expire upon submission of the recommendations required by subdivision 3.\nMembers may not have any communication with a constitutional officer, a head of a state agency, a member of the judiciary, or a member of the Direct Care and Treatment executive board during the period after the first meeting is convened under this section and the date the prescribed and recommended salaries and daily compensation are submitted under subdivision 3.",
	"repealed": false
}