{
	"id": "273.1384",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1384",
	"title": "273.1384 AGRICULTURAL HOMESTEAD MARKET VALUE CREDIT.",
	"text": "MS 2010 [Repealed, 1Sp2011 c 7 art 6 s 27]\nProperty classified as agricultural homestead under section 273.13, subdivision 23, paragraph (a), is eligible for an agricultural credit. The credit is computed using the property's agricultural credit market value, defined for this purpose as the property's market value excluding the market value of the house, garage, and immediately surrounding one acre of land. The credit is equal to 0.3 percent of the first $115,000 of the property's agricultural credit market value plus 0.1 percent of the property's agricultural credit market value in excess of $115,000, subject to a maximum credit of $490 for a full agricultural homestead. In the case of property that is classified as part homestead and part nonhomestead solely because not all the owners occupy or farm the property, not all the owners have qualifying relatives occupying or farming the property, or solely because not all the spouses of owners occupy the property, the credit is computed on the amount of agricultural credit market value corresponding to the percentage of homestead, and the maximum credit equals $490 multiplied by the percentage of homestead.\nThe county auditor shall determine the tax reductions allowed under subdivision 2 within the county for each taxes payable year and shall certify that amount to the commissioner of revenue under section 270C.85, subdivision 2, clause (4). Any prior year adjustments shall also be certified. The commissioner shall review the certifications for accuracy, and may make such changes as are deemed necessary, or return the certification to the county auditor for correction. The credit under this section must be used to proportionately reduce the net tax capacity-based property tax payable to each local taxing jurisdiction as provided in section 273.1393.\n(a) The commissioner of revenue shall reimburse each local taxing jurisdiction, other than school districts, for the tax reductions granted under subdivision 2 in two equal installments on October 31 and December 26 of the taxes payable year for which the reductions are granted, including in each payment the prior year adjustments certified on the abstracts for that taxes payable year. The reimbursements related to tax increments shall be issued in one installment each year on December 26.\n(b) The commissioner of revenue shall certify the total of the tax reductions granted under subdivision 2 for each taxes payable year within each school district to the commissioner of the Department of Education and the commissioner of education shall pay the reimbursement amounts to each school district as provided in section 273.1392.\nAn amount sufficient to make the payments required by this section to taxing jurisdictions other than school districts is annually appropriated from the general fund to the commissioner of revenue. An amount sufficient to make the payments required by this section for school districts is annually appropriated from the general fund to the commissioner of education.\nMS 2010 [Repealed, 1Sp2011 c 7 art 6 s 27]",
	"repealed": false
}