{
	"id": "571.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.79",
	"title": "571.79 DISCHARGE OF A GARNISHEE.",
	"text": "Except as provided in paragraph (h), the garnishee, after disclosure, shall be discharged of any further retention obligation to the creditor with respect to a specific garnishment summons when one of the following conditions are met:\n(a) The garnishee discloses that the garnishee is not indebted to the debtor or does not possess any money or other property belonging to the debtor that is attachable as defined in section 571.73, subdivision 3. The disclosure is conclusive against the creditor and discharges the garnishee from any further obligation to the creditor other than to retain all nonexempt disposable earnings, indebtedness, money, and property of the debtor which was disclosed.\n(b) The garnishee discloses that the garnishee is indebted to the debtor as indicated on the garnishment disclosure form. The disclosure is conclusive against the creditor and discharges the garnishee from any further obligation to the creditor other than to retain all nonexempt disposable earnings, indebtedness, money, and property of the debtor that was disclosed.\n(c) If the garnishee was served with a garnishment summons before entry of judgment against the debtor by the creditor in the civil action and the garnishee has retained any disposable earnings, indebtedness, money, or property of the debtor, 270 days after the garnishment summons is served the garnishee is discharged and the garnishee shall return any disposable earnings, indebtedness, money, and property to the debtor.\n(d) If the garnishee was served with a garnishment summons after entry of judgment against the debtor by the creditor in the civil action and the garnishee has retained any disposable earnings, indebtedness, money, or property of the debtor, 180 days after the garnishment summons is served the garnishee is discharged and the garnishee shall return any disposable earnings, other indebtedness, money, and property to the debtor.\n(e) If the garnished indebtedness, money, or other property is destroyed without any negligence of the garnishee, the garnishee is discharged of any liability to the creditor for nondelivery of the garnished indebtedness, money, and other property.\n(f) The court may, upon motion of an interested person, discharge the garnishee as to any disposable earnings, other indebtedness, money, and property in excess of the amount that may be required to satisfy the creditor's claim.\n(g) The discharge of the garnishee pursuant to paragraph (a), (b), (c), or (d) is not determinative of the rights of the creditor, debtor, or garnishee with respect to any other garnishment summons, even another garnishment summons involving the same parties, unless and to the extent adjudicated pursuant to the procedures described in paragraph (h).\n(h) The garnishee is not discharged if within 20 days of the service of the garnishee's disclosure or the return to the debtor of any disposable earnings, indebtedness money, or other property of the debtor, whichever is later, an interested person (1) serves a motion scheduled to be heard within 30 days of the service of the motion relating to the garnishment, or (2) serves a motion scheduled to be heard within 30 days of the service of the motion for leave to file a supplemental complaint against the garnishee, as provided under section 571.75, subdivision 4, and the court upon proper showing vacates the discharge of the garnishee.",
	"repealed": false
}