{
	"id": "524.5-104",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-104",
	"title": "524.5-104 FACILITY OF TRANSFER.",
	"text": "(a) A person who may transfer money or personal property to a minor may do so, as to an amount or value not exceeding the amount allowable as a tax exclusion gift under section 2503(b) of the Internal Revenue Code or a different amount that is approved by the court, by transferring it to:\n(1) a person who has the care and custody of the minor and with whom the minor resides;\n(2) a guardian of the minor;\n(3) a custodian under the Uniform Transfers To Minors Act or custodial trustee under the Uniform Custodial Trust Act;\n(4) a financial institution as a deposit in an interest-bearing account or certificate in the sole name of the minor and giving notice of the deposit to the minor; or\n(5) an ABLE account. A guardian only has the authority to establish an ABLE account. The guardian may not administer the ABLE account in the guardian's capacity as guardian. The guardian may appoint or name a person to exercise signature authority over an ABLE account, including the individual selected by the eligible individual or the eligible individual's agent under a power of attorney, conservator, spouse, parent, sibling, grandparent, or representative payee, whether an individual or organization, appointed by the Social Security Administration, in that order.\n(b) This section does not apply if the person making payment or delivery knows that a conservator has been appointed or that a proceeding for appointment of a conservator of the minor is pending.\n(c) A person who transfers money or property in compliance with this section is not responsible for its proper application.\n(d) A guardian or other person who receives money or property for a minor under paragraph (a), clause (1) or (2), may only apply it to the support, care, education, health, and welfare of the minor, and may not derive a personal financial benefit except for reimbursement for necessary expenses. Any excess must be preserved for the future support, care, education, health, and welfare of the minor and any balance must be transferred to the minor upon emancipation or attaining majority.",
	"repealed": false
}