{
	"id": "168A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.01",
	"title": "168A.01 DEFINITIONS.",
	"text": "For the purposes of sections 168A.01 to 168A.31, the terms defined in this section have the meanings given them, except when the context otherwise requires.\n\"Commissioner\" means the commissioner of public safety.\n\"Dealer\" has the meaning given it in section 168.27.\n\"Deliver\" means to transmit electronically or by other means approved by the registrar.\n\"Department\" means the registrar of motor vehicles of this state.\n\"Essential parts\" means all integral and body parts of a vehicle of a type for which a certificate of title is required hereunder, the removal, alteration, or substitution of which would tend to conceal the identity of the vehicle or substantially alter its appearance, model, type or mode of operation.\n\"Established place of business\" means the place actually occupied either continuously or at regular periods by a dealer or manufacturer where books and records of business are kept and a large share of business is transacted.\nMS 2020 [Renumbered subd 12b]\n\"High-value vehicle\" means a vehicle that had an actual cash value in excess of $9,000 before being damaged, or a vehicle with a manufacturer's rating of over 26,000 pounds gross vehicle weight that is not a late-model vehicle.\n\"Identifying number\" means the numbers, and letters, if any, on a vehicle designated by the department for the purpose of identifying the vehicle.\n(a) \"Implement of husbandry\" means every vehicle, including a farm tractor and farm wagon, designed or adapted exclusively for agricultural, horticultural, or livestock raising operations or for lifting or carrying an implement of husbandry and in either case not subject to registration if used upon the highways.\n(b) A towed vehicle meeting the description in paragraph (a) is an implement of husbandry without regard to whether the vehicle is towed by an implement of husbandry or by a registered motor vehicle.\n(c) A self-propelled motor vehicle used in livestock raising operations is an implement of husbandry only if it is:\n(1) owned by or under the control of a farmer;\n(2) operated at speeds not exceeding 30 miles per hour; and\n(3) displaying the slow-moving vehicle emblem described in section 169.522.\n\"Late-model vehicle\" means a vehicle with a manufacturer's designated model year equal to or greater than the fifth calendar year immediately preceding the current calendar year.\n\"Junking certificate\" means a receipt issued by the department's Driver and Vehicle Services Division when a vehicle is declared unrepairable under section 168A.151.\n\"Mail\" means to deposit in the United States mail, properly addressed and with postage prepaid.\n\"Manufactured home\" has the meaning given in section 327.31, subdivision 6.\n\"Manufacturer\" means every person engaged in the business of constructing or assembling vehicles of a type for which a certificate of title is required hereunder.\n\"Manufacturer's or importer's certificate of origin\" means a certificate over the authorized signature of the manufacturer or importer of a vehicle, describing and identifying the vehicle, giving the name and address of the person to whom the vehicle is first sold by the manufacturer or importer, and containing assignments, duly executed, assigning the same to an applicant for a certificate of title on the vehicle in this state.\n\"Nonresident\" means every person who is not a resident of this state.\n\"Older model vehicle\" means a vehicle that is not a late-model vehicle.\n\"Out-of-state vehicle\" means every vehicle of a type for which a certificate of title is required hereunder brought into this state from another state, territory, or country other than in the ordinary course of business by or through a manufacturer or dealer and not registered in this state.\n\"Owner\" means a person, other than a secured party, having the property in or title to a vehicle. The term includes a person entitled to the use and possession of a vehicle subject to a security interest in another person, but excludes a lessee under a lease not intended as security.\n\"Person\" means an individual, firm, copartnership, association, corporation, or governmental organization.\n\"Previously registered vehicle\" means a vehicle registered in this state on October 1, 1972 or a vehicle whose last registration before October 1, 1972 was in this state.\n(a) \"Reconstructed vehicle\" means a vehicle of a type for which a certificate of title is required hereunder materially altered from its original construction by the removal, addition, or substitution of essential parts, new or used.\n(b) Reconstructed vehicle does not include a restored pioneer vehicle.\nMS 2020 [Renumbered subd 16d]\n\"Recovered intact vehicle\" means a vehicle that was:\n(1) verified by the vehicle insurer to be stolen and declared a total loss; and\n(2) subsequently recovered with damage that is not in excess of 80 percent of its value immediately before it was stolen.\n\"Registration\" means the registration certificate or certificates and registration plates issued under the laws of this state pertaining to the registration of vehicles.\n(a) \"Restored pioneer vehicle\" means a vehicle:\n(1) for which a certificate of title is required under this chapter;\n(2) originally manufactured prior to 1919;\n(3) for which one or more essential parts, whether new or used, are replaced; and\n(4) for which each essential part under clause (3) is replaced:\n(i) only as necessary in order to restore or retain the character and appearance of the vehicle as originally manufactured;\n(ii) in a manner which reasonably restores or retains the character and appearance of the vehicle as originally manufactured; and\n(iii) in a manner which substantially conforms to the fit, form, and function of the original essential part.\n(b) A vehicle meeting both the requirements under paragraph (a) and subdivision 16 for a reconstructed vehicle is a restored pioneer vehicle.\n(c) For purposes of this subdivision, replacement of an essential part includes, but is not limited to, removal, addition, modification, or substitution of the essential part.\nMS 2020 [Renumbered subd 16c]\nMS 2020 [Repealed, 2022 c 57 s 13]\n(a) \"Salvage vehicle\" means a vehicle (1) for which an insurance company has declared a total loss or paid a total loss claim, or (2) that has been involved in a collision or other event in which the cost of repairs exceeds 80 percent of the value of the vehicle immediately before the damage occurred.\n(b) Salvage vehicle does not include a recovered intact vehicle.\n\"Secure reassignment\" means a separate form that (1) may be used by a dealer to assign and warrant title to a vehicle; (2) is prescribed by the department; and (3) contains security features complying with the Motor Vehicle Information and Cost Savings Act, as amended, codified at United States Code, title 49, chapter 327, and regulations of the United States Department of Transportation adopted under that act.\n\"Secured party\" means a secured party as defined in section 336.9-102(a)(73) having a security interest in a vehicle.\n\"Security agreement\" means a security agreement as defined in section 336.9-102(a)(74).\n\"Security interest\" means a security interest as defined in section 336.1-201(b)(35). A security interest is \"perfected\" when it is valid against third parties generally, subject only to specific statutory exception.\n\"Special mobile equipment\" has the meaning given it in section 168.002.\n\"Specially constructed vehicle\" means every vehicle of a type for which a certificate of title is required hereunder not originally constructed under a distinctive name, make, model, or type by a generally recognized manufacturer of vehicles and not materially altered from its original construction.\n\"State\" means a state, territory or possession of the United States, the District of Columbia, the Commonwealth of Puerto Rico, or a province of the Dominion of Canada.\n(a) \"Vehicle\" means every device in, upon, or by which any person or property is or may be transported or drawn upon a highway.\n(b) The term does not include:\n(1) devices moved by human power or used exclusively upon stationary rails or tracks; or\n(2) vehicles not originally constructed primarily for use on public roads and highways.\n(c) The term does include motorized bicycles as defined in section 168.002, subdivision 20.",
	"repealed": false
}