{
	"id": "124D.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.111",
	"title": "124D.111 SCHOOL MEALS POLICIES; LUNCH AID; FOOD SERVICE ACCOUNTING.",
	"text": "(a) Each Minnesota participant in the national school lunch program must adopt and post to its website, or the website of the organization where the meal is served, a school meals policy.\n(b) The policy must be in writing and clearly communicate student meal charges when payment cannot be collected at the point of service. The policy must be reasonable and well-defined and maintain the dignity of students by prohibiting lunch shaming or otherwise ostracizing the student.\n(c) The policy must address whether the participant uses a collections agency to collect unpaid school meals debt.\n(d) The policy must ensure that once a participant has placed a meal on a tray or otherwise served the meal to a student, the meal may not be subsequently withdrawn from the student by the cashier or other school official, whether or not the student has an outstanding meals balance.\n(e) The policy must ensure that a student who has been determined eligible for free and reduced-price meals must always be served a reimbursable meal even if the student has an outstanding debt.\n(f) If a school contracts with a third party for its meal services, it must provide the vendor with its school meals policy. Any contract between the school and a third-party provider entered into or modified after July 1, 2021, must ensure that the third-party provider adheres to the participant's school meals policy.\nEach school year, the state must pay participants in the national school lunch program either:\n(1) the amount of 12.5 cents for each full paid and free student lunch and 52.5 cents for each reduced-price lunch served to students; or\n(2) if the school participates in the free school meals program under subdivision 1c, the sum of: (i) 12.5 cents for each full paid, reduced-price, and free student lunch; and (ii) the amount specified in subdivision 1d.\nA school district, charter school, nonpublic school, or other participant in the national school lunch program must apply to the department for school meals payments in the manner provided by the department.\n(a) The free school meals program is created within the Department of Education.\n(b) Each school that participates in the United States Department of Agriculture National School Lunch program and has an Identified Student Percentage below the federal percentage determined for all meals to be reimbursed at the free rate via the Community Eligibility Provision must participate in the free school meals program.\n(c) Each school that participates in the United States Department of Agriculture National School Lunch program and has an Identified Student Percentage at or above the federal percentage determined for all meals to be reimbursed at the free rate must participate in the federal Community Eligibility Provision in order to participate in the free school meals program.\n(d) Each school that participates in the free school meals program must:\n(1) participate in the United States Department of Agriculture School Breakfast Program and the United States Department of Agriculture National School Lunch Program; and\n(2) provide to all students at no cost up to two federally reimbursable meals per school day, with a maximum of one free breakfast and one free lunch.\nThe department must provide to every Minnesota school participating in the free school meals program state funding for each school lunch and breakfast served to a student, with a maximum of one breakfast and one lunch per student per school day. The state aid equals the difference between the applicable federal reimbursement rate at that school site for a free meal, as determined annually by the United States Department of Agriculture, and the actual federal reimbursement received by the participating school for the breakfast or lunch served to the student.\nMS 2022 [Repealed by amendment, 2023 c 18 s 1]\n(a) The commissioner must post on the department's website eligibility criteria and application information for nonprofit organizations interested in applying to the commissioner for approval as a multisite sponsoring organization under the federal child and adult care food program and federal summer food service program. The posted criteria and information must inform interested nonprofit organizations about:\n(1) the criteria the commissioner uses to approve or disapprove an application, including how an applicant demonstrates financial viability for the Minnesota program, among other criteria;\n(2) the commissioner's process and time line for notifying an applicant when its application is approved or disapproved and, if the application is disapproved, the explanation the commissioner provides to the applicant; and\n(3) any appeal or other recourse available to a disapproved applicant.\n(b) The commissioner must evaluate financial eligibility as part of the application process. An organization applying to be a prospective nonprofit multisite sponsoring organization for the federal child and adult care food program or the federal summer food service program must provide documentation of financial viability as an organization. Documentation must include:\n(1) evidence that the organization has operated for at least one year and has filed at least one tax return;\n(2) the most recent tax return submitted by the organization and corresponding forms and financial statements;\n(3) a profit and loss statement and balance sheet or similar financial information; and\n(4) evidence that at least ten percent of the organization's operating revenue comes from sources other than the United States Department of Agriculture child nutrition program and that the organization has additional funds or a performance bond available to cover at least one month of reimbursement claims.\n(a) The expenses described in this subdivision must be recorded as provided in this subdivision.\n(b) In each district, the expenses for a school food service program for pupils must be attributed to a school food service fund. Under a food service program, the school food service may prepare or serve milk, meals, or snacks in connection with school or community service activities.\n(c) Revenues and expenditures for food service activities must be recorded in the food service fund. The costs of processing applications, accounting for meals, preparing and serving food, providing kitchen custodial services, and other expenses involving the preparing of meals or the kitchen section of the lunchroom may be charged to the food service fund or to the general fund of the district. The costs of lunchroom supervision, lunchroom custodial services, lunchroom utilities, lunchroom furniture, and other administrative costs of the food service program must be charged to the general fund.\nThat portion of superintendent and fiscal manager costs that can be documented as attributable to the food service program may be charged to the food service fund provided that the school district does not employ or contract with a food service director or other individual who manages the food service program, or food service management company. If the cost of the superintendent or fiscal manager is charged to the food service fund, the charge must be at a wage rate not to exceed the statewide average for food service directors as determined by the department.\n(d) Capital expenditures for the purchase of food service equipment must be made from the general fund and not the food service fund, unless the restricted balance in the food service fund at the end of the last fiscal year is greater than the cost of the equipment to be purchased.\n(e) If the condition set out in paragraph (d) applies, the equipment may be purchased from the food service fund.\n(f) If a deficit in the food service fund exists at the end of a fiscal year, and the deficit is not eliminated by revenues from food service operations in the next fiscal year, then the deficit must be eliminated by a permanent fund transfer from the general fund at the end of that second fiscal year. However, if a district contracts with a food service management company during the period in which the deficit has accrued, the deficit must be eliminated by a payment from the food service management company.\n(g) Notwithstanding paragraph (f), a district may incur a deficit in the food service fund for up to three years without making the permanent transfer if the district submits to the commissioner by January 1 of the second fiscal year a plan for eliminating that deficit at the end of the third fiscal year.\n(h) If a surplus in the food service fund exists at the end of a fiscal year for three successive years, a district may recode for that fiscal year the costs of lunchroom supervision, lunchroom custodial services, lunchroom utilities, lunchroom furniture, and other administrative costs of the food service program charged to the general fund according to paragraph (c) and charge those costs to the food service fund in a total amount not to exceed the amount of surplus in the food service fund.\n(i) For purposes of this subdivision, \"lunchroom furniture\" means tables and chairs regularly used by pupils in a lunchroom from which they may consume milk, meals, or snacks in connection with school or community service activities.\nA participant that receives school lunch aid under this section must make lunch available without charge and must not deny a school lunch to all participating students who qualify for free or reduced-price meals, whether or not that student has an outstanding balance in the student's meals account.\n(a) The participant must also provide meals to students in a respectful manner according to the policy adopted under subdivision 1. The participant must ensure that any reminders for payment of outstanding student meal balances do not demean or stigmatize any child participating in the school lunch program, including but not limited to dumping meals; withdrawing a meal that has been served; announcing or listing students' names publicly; providing alternative meals not specifically related to dietary needs; providing nonreimbursable meals; or affixing stickers, stamps, or pins. The participant must not impose any other restriction prohibited under section 123B.37 due to unpaid student meal balances. The participant must not limit a student's participation in any school activities, graduation ceremonies, field trips, athletics, activity clubs, or other extracurricular activities or access to materials, technology, or other items provided to students due to an unpaid student meal balance.\n(b) If the commissioner or the commissioner's designee determines a participant has violated the requirement to provide meals to participating students in a respectful manner, the commissioner or the commissioner's designee must send a letter of noncompliance to the participant. The participant is required to respond and, if applicable, remedy the practice within 60 days.",
	"repealed": false
}