{
	"id": "169.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.85",
	"title": "169.85 WEIGHING; PENALTY.",
	"text": "(a) The driver of a vehicle that has been lawfully stopped may be required by an officer to submit the vehicle and load to a weighing by means of portable or stationary scales.\n(b) In addition, the officer may require that the vehicle be driven to the nearest available scales, but only if:\n(1) the distance to the scales is no further than five miles, or if the distance from the point where the vehicle is stopped to the vehicle's destination is not increased by more than ten miles as a result of proceeding to the nearest available scales; and\n(2) if the vehicle is a commercial motor vehicle, no more than two other commercial motor vehicles are waiting to be inspected at the scale.\n(c) Official traffic-control devices as authorized by section 169.06 may be used to direct the driver to the nearest scale.\n(d) When a truck weight enforcement operation is conducted by means of portable or stationary scales, signs giving notice of the operation must be posted within the highway right-of-way and adjacent to the roadway within two miles of the operation. The driver of a truck or combination of vehicles registered for or with a gross vehicle weight exceeding 10,000 pounds shall proceed to the scale site and submit the vehicle to weighing and inspection.\n(a) Upon weighing a vehicle and load, as provided in this section, an officer may require the driver to stop the vehicle in a suitable place and remain standing until a portion of the load is removed that is sufficient to reduce the gross weight of the vehicle to the limit permitted under either section 168.013, subdivision 3, paragraph (b), or sections 169.823 to 169.829, whichever is the lesser violation, if any. A suitable place is a location where loading or tampering with the load is not prohibited by federal, state, or local law, rule, or ordinance.\n(b) Except as provided in paragraph (c), a driver may be required to unload a vehicle only if the weighing officer determines that (1) on routes subject to the provisions of sections 169.823 to 169.829, the weight on an axle exceeds the lawful gross weight prescribed by sections 169.823 to 169.829, by 2,000 pounds or more, or the weight on a group of two or more consecutive axles in cases where the distance between the centers of the first and last axles of the group under consideration is ten feet or less exceeds the lawful gross weight prescribed by sections 169.823 to 169.829, by 4,000 pounds or more; or (2) the weight is unlawful on an axle or group of consecutive axles on a road restricted in accordance with section 169.87. Material unloaded must be cared for by the owner or driver of the vehicle at the risk of the owner or driver.\n(c) The driver is not required to unload under paragraph (b) when the gross weight of the vehicle does not exceed:\n(1) the sum of the vehicle's registered gross weight, the weight allowance set forth in section 168.013, subdivision 3, paragraph (b), and, if applicable, the weight allowance permitted under section 169.826; or\n(2) the weight allowed by special permit issued under section 169.86 for a vehicle that is operated in conformity with the limitations and conditions of the permit.\nA driver of a vehicle who (1) fails or refuses to stop and submit the vehicle and load to a weighing as required in this section, (2) fails or refuses, when directed by an officer upon a weighing of the vehicle, to stop the vehicle and otherwise comply with the provisions of this section, or (3) fails to comply with an official traffic-control device as authorized by section 169.06 that directs the driver to the nearest scale is guilty of a misdemeanor.\nA peace officer may arrest the driver of a motor vehicle if the peace officer has probable cause to believe that the driver has operated the vehicle in violation of subdivision 3 within the past four hours.\nA person who owns or leases a motor vehicle that a peace officer has probable cause to believe has been operated in violation of subdivision 3 must identify the driver of the motor vehicle upon request of the peace officer. Violation of this subdivision is a petty misdemeanor.\nWhen used in this section, the word \"officer\" means a member of the State Patrol, an employee of the Department of Public Safety described in section 299D.06, or a peace officer or person under the officer's direction and control employed by a local unit of government who is trained in weight enforcement by the Department of Public Safety.",
	"repealed": false
}