{
	"id": "412.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.271",
	"title": "412.271 DISBURSEMENTS.",
	"text": "No disbursement of city funds, including funds of any municipal liquor dispensary operated by the city, shall be made except by an order drawn by the mayor and clerk upon the treasurer. Except when issued for the payment of judgments, salaries and wages previously fixed by the council or by statute, principal and interest on obligations, rent and other fixed charges, the exact amount of which has been previously determined by contract authorized by the council, and except as otherwise provided in subdivisions 4, 5, and 8, no order shall be issued until the claim to which it relates has been audited and allowed by the council.\n(a) Except for wages paid on an hourly or daily basis, where a claim for money due on goods or services furnished can be itemized in the ordinary course of business the person claiming payment, or the claimant's agent, shall prepare the claim in written items and sign a declaration that the claim is just and correct and that no part of it has been paid; but the council may in its discretion allow a claim prepared by the clerk prior to such declaration by the claimant, if the declaration is made by an endorsement on the order-check by which the claim is paid as provided below.\n(b) Whenever work for which wages are to be paid on an hourly or daily basis is done by employees of the city, the clerk shall keep a payroll giving the name of each employee and the number of hours or days worked by each and the timekeeper, supervisor, or other officers or employee having knowledge of the facts shall sign a declaration that the facts recited on the payroll are correct to the best of the declarant's information and belief; and when any claim for wages listed on a payroll is paid, the employee shall sign a declaration, which may be a part of the payroll, to the effect that the employee has received the wages and done the work for which wages have been paid. The declarations relating to claims or payrolls shall be in substantially the following form: \"I declare under the penalties of perjury (here insert, if claimant: that this claim is just and correct and no part of it has been paid; if timekeeper, supervisor, officer or employee having knowledge of the facts; that to the best of my information and belief the items of this payroll are correct; if employee who has been paid: that I have received the wages stated on this payroll opposite my name and have done the work for which the wages were paid.)\nThe effect of this declaration shall be the same as if subscribed and sworn to under oath.\n(c) Notwithstanding the procedural requirements of paragraph (b), a city may use electronic time recording systems if the governing body of the city adopts policies to ensure that the timekeeping and payroll methods used are accurate and reliable.\nThe clerk shall endorse on each claim required to be audited by the council the word \"disallowed\" if such be the fact, or, \"allowed in the sum of $..........,\" if approved in whole or in part, specifying in the latter case the items rejected. Each order shall be so drawn that when signed by the treasurer in an appropriate space, it becomes a check on the city depository. Such order-check may have printed on its reverse side, above the space for endorsement thereof by the payee, the following statement: \"The undersigned payee, in endorsing this order-check, declares that the same is received in payment of a just and correct claim against the city of .........., and that no part of such claim has heretofore been paid.\" When endorsed by the payee named in the order-check, such statement shall operate and shall be deemed sufficient as the required declaration of the claim. Any order presented to the treasurer and not paid for want of funds shall be so marked and paid in the order of its presentation with interest from the date of presentation at the rate of five percent or such lower rate as is fixed by the council prior to its issuance.\nWhen payment of a claim based on contract cannot be deferred until the next council meeting without loss to the city through forfeiture of discount privileges or otherwise, it may be made immediately if the itemized claim is endorsed for payment by at least a majority of all the members of the council. The claim shall be acted upon formally at the next council meeting in the same manner as if it had not been paid, and the earlier payment shall not affect the right of the city or any taxpayer to challenge the validity of the claim.\nThe council may establish one or more imprest funds for the payment in cash of any proper claim against the city which it is impractical to pay in any other manner, except that no claim for salary or personal expenses of an officer or employee shall be paid from such funds. The council shall appoint a custodian of each such fund who shall be responsible for its safekeeping and disbursement according to law. Money for the operation of such fund shall be secured by a transfer from the general fund. A claim itemizing all the various demands for which disbursements have been made from the fund shall be presented to the council at the next council meeting after the disbursements have been made. The council shall act upon it as in the case of other claims and an order shall be issued to the custodian for the amount allowed. The custodian shall use the proceeds of the order to replenish the fund; and if the council fails to approve the claim in full for any sufficient reason, the custodian shall be personally responsible for the difference.\nSubdivisions 4 and 5 shall apply to any independent board or commission of the city having authority to disburse funds without approval of the council. In such case references in these subdivisions to the council shall be considered to be to the board or commission and the money for the fund may be secured from any undedicated fund under its jurisdiction.\nFor purposes of this section, a \"city administrative official\" means a city manager, administrator, treasurer, senior fiscal officer, clerk, or clerk-treasurer.\nA city council, at its discretion, may delegate its authority to pay certain claims made against the city to a city administrative official. City councils opting to delegate their authority to review claims before payment pursuant to this subdivision shall have internal accounting and administrative control procedures to ensure the proper disbursement of public funds. The procedures shall include regular and frequent review of the city administrative officials' actions by the council. A list of all claims paid under the procedures established by the city council shall be presented to the council for informational purposes only at the next regularly scheduled meeting after payment of the claim. A city council that delegates its authority to pay certain claims made against the city must adopt a resolution authorizing a specified city administrative official to pay the claims that meet the standards and procedures established by the council. A city council of a city that does not prepare annual audited financial statements which have been attested to by an independent certified public accountant, public accountant, or the state auditor, may not delegate its authority for paying certain claims against the city pursuant to this subdivision.",
	"repealed": false
}