{
	"id": "298.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.27",
	"title": "298.27 COLLECTION AND PAYMENT OF TAX.",
	"text": "The taxes provided by section 298.24 shall be paid directly to each eligible county and the commissioner of Iron Range resources and rehabilitation. The commissioner of revenue shall notify each producer of the amount to be paid each recipient prior to February 15. Every person subject to taxes imposed by section 298.24 shall file a correct report covering the preceding year. The report must contain the information required by the commissioner of revenue. The report shall be filed by each producer on or before February 1. A remittance equal to 50 percent of the total tax required to be paid hereunder shall be paid on or before February 24. A remittance equal to the remaining total tax required to be paid hereunder shall be paid on or before August 24. On or before February 25 and August 25, the county auditor shall make distribution of the payments previously received by the county in the manner provided by section 298.28. Reports shall be made and hearings held upon the determination of the tax in accordance with procedures established by the commissioner of revenue. The commissioner of revenue shall have authority to make reasonable rules as to the form and manner of filing reports necessary for the determination of the tax hereunder, and by such rules may require the production of such information as may be reasonably necessary or convenient for the determination and apportionment of the tax. All the provisions of the occupation tax law with reference to the assessment and determination of the occupation tax, including all provisions for appeals from or review of the orders of the commissioner of revenue relative thereto, but not including provisions for refunds, are applicable to the taxes imposed by section 298.24 except in so far as inconsistent herewith. If any person subject to section 298.24 shall fail to make the report provided for in this section at the time and in the manner herein provided, the commissioner of revenue shall in such case, upon information possessed or obtained, ascertain the kind and amount of ore mined or produced and thereon find and determine the amount of the tax due from such person. There shall be added to the amount of tax due a penalty for failure to report on or before February 1, which penalty shall equal ten percent of the tax imposed and be treated as a part thereof.\nIf any person responsible for making a tax payment at the time and in the manner herein provided fails to do so, there shall be imposed a penalty equal to ten percent of the amount so due, which penalty shall be treated as part of the tax due.\nIn the case of any underpayment of the tax payment required herein, there may be added and be treated as part of the tax due a penalty equal to ten percent of the amount so underpaid.\nA person having a liability of $120,000 or more during a calendar year must remit all liabilities by means of a funds transfer as defined in section 336.4A-104, paragraph (a). The funds transfer payment date, as defined in section 336.4A-401, must be on or before the date the tax is due. If the date the tax is due is not a funds transfer business day, as defined in section 336.4A-105, paragraph (a), clause (4), the payment date must be on or before the funds transfer business day next following the date the tax is due.",
	"repealed": false
}