{
	"id": "136F.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.48",
	"title": "136F.48 EMPLOYER-PAID HEALTH INSURANCE.",
	"text": "(a) This section applies to a person who:\n(1) retires from the Minnesota State Colleges and Universities system with at least ten years of combined service credit in a system under the jurisdiction of the board;\n(2) was employed on a full-time basis immediately preceding retirement as a faculty member or as an unclassified administrator in the Minnesota State Colleges and Universities system;\n(3) begins drawing a retirement benefit from the Individual Retirement Account Plan or an annuity from the Teachers Retirement Association, from the General State Employees Retirement Plan or the Unclassified State Employees Retirement Program of the Minnesota State Retirement System, or from a first class city teacher retirement plan; and\n(4) returns to work on not less than a one-third time basis and not more than a two-thirds time basis in the system from which the person retired under an agreement.\n(b) Initial participation, the amount of time worked, and the duration of participation under this section must be mutually agreed upon by the president of the institution where the person returns to work and the employee. The president may require up to one-year notice of intent to participate in the program as a condition of participation under this section. The president shall determine the time of year the employee shall work. The employer or the president may not require a person to waive any rights under a collective bargaining agreement as a condition of participation under this section.\n(c) For a person eligible under paragraphs (a) and (b), the employing board shall make the same employer contribution for hospital, medical, and dental benefits as would be made if the person were employed full time.\n(d) For work under paragraph (a), a person must receive a percentage of the person's salary at the time of retirement that is equal to the percentage of time the person works compared to full-time work.\n(e) If a collective bargaining agreement covering a person provides for an early retirement incentive that is based on age, the incentive provided to the person must be based on the person's age at the time employment under this section ends. However, the salary used to determine the amount of the incentive must be the salary that would have been paid if the person had been employed full time for the year immediately preceding the time employment under this section ends.\n(f) A person who returns to work under this section is a member of the appropriate bargaining unit and is covered by the appropriate collective bargaining contract. Except as provided in this section, the person's coverage is subject to any part of the contract limiting rights of part-time employees.",
	"repealed": false
}