{
	"id": "60L.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.02",
	"title": "60L.02 REQUIREMENTS.",
	"text": "In order to be eligible to be governed by sections 60L.01 to 60L.15, a life insurer must meet the following requirements:\n(a) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the insurer shall have had, as of the end of the immediately preceding calendar year:\n(1) total admitted assets of at least $2,000,000,000;\n(2) a total amount of capital plus surplus of at least $200,000,000; and\n(3) a total amount of capital plus surplus plus asset valuation reserve of at least $250,000,000.\n(b) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the insurer shall have had, as of the end of the immediately preceding calendar year, total adjusted capital equal to or greater than 200 percent of company action level risk-based capital, as defined in section 60A.60, subdivision 11. For purposes of this subdivision, \"total adjusted capital\" means total adjusted capital as defined in section 60A.60, subdivision 14, adjusted to deduct the value of capital notes and surplus notes as provided in the risk-based instructions as defined in section 60A.60, subdivision 10.\n(c) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the mean of the ratio, calculated as of the end of each of the five immediately preceding calendar years, of total adjusted capital to company action level risk-based capital, as defined in section 60A.60, subdivision 11, must equal at least 2.0.\nIn order to be eligible to be governed by sections 60L.01 to 60L.15, an insurer other than a life insurer must meet the following requirements:\n(a) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the insurer shall have had, as of the end of the immediately preceding calendar year:\n(1) total admitted assets of at least $2,000,000,000; and\n(2) a total amount of capital plus surplus of at least $200,000,000.\n(b) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the insurer shall have had, as of the end of the immediately preceding calendar year, total adjusted capital equal to or greater than company action level risk-based capital, as defined in section 60A.60, subdivision 11. For purposes of this subdivision, \"total adjusted capital\" means total adjusted capital as defined in section 60A.60, subdivision 14, adjusted to deduct the value of capital notes and surplus notes as provided in the risk-based instructions as defined in section 60A.60, subdivision 10.\n(c) For each calendar year during which sections 60L.01 to 60L.15 apply to the insurer, the mean of the ratio, calculated as of the end of each of the five immediately preceding calendar years, of total adjusted capital to company action level risk-based capital, as defined in section 60A.60, subdivision 11, must equal at least 1.0.\n(d) An insurer is considered to have met the requirements of this subdivision and subdivision 3 if the insurer participates in a 100 percent reinsurance pooling agreement which substantially affects the solvency and integrity of its reserves and cedes all of its direct and assumed business to the pool, and where the insurer with the largest share of pooled business subject to the agreement meets the requirements of this subdivision and subdivision 3.\n(a) In order to be eligible to be governed by sections 60L.01 to 60L.15, the insurer must meet the requirements specified under this subdivision.\n(b) The insurer shall:\n(1) have been in continuous operation for a minimum of five years; and\n(2) maintain a minimum claims-paying, financial strength, or equivalent rating from at least one nationally recognized statistical rating organization in one of the organization's three highest rating categories for the time period during which sections 60L.01 to 60L.15 apply to the insurer. For purposes of this subdivision, the rating must be based on a review of the insurer by the nationally recognized statistical rating organization with the cooperation of the insurer; must not depend on a guarantee or other credit enhancement from another entity; and must not be modified or otherwise qualified to show dependence of the rating on the performance or a contractual obligation of, or the insurer's affiliation with, another insurer.\n(c) The insurer or an affiliate, as defined in section 60D.15, subdivision 2, of the insurer shall employ at least one individual as a professional investment manager for the insurer's investments whom the board of directors or trustees of the insurer finds is qualified on the basis of experience, education or training, competence, personal integrity, and who conducts professional investment management activities in accordance with the Code of Ethics and Standards of Professional Conduct of the Association for Investment Management and Research. For purposes of complying with this paragraph, an employee of an affiliate may only be used if they are responsible for managing the insurer's investments.\n(d) The board of directors of the insurer must annually adopt a resolution finding that the insurer or an affiliate, as defined in section 60D.15, subdivision 2, of the insurer has employed a professional investment manager for the insurer's investments with sufficient expertise and has sufficient other resources to implement and monitor the insurer's investment policies and strategies.\n(e) In the report required under section 60A.1291, subdivision 12, the insurer's independent auditor shall not have identified any significant deficiencies in the insurer's internal control structure related to investments during any of the five years immediately preceding the date on which sections 60L.01 to 60L.15 begin to apply to the insurer, and as long as sections 60L.01 to 60L.15 apply to the insurer.\nBefore sections 60L.01 to 60L.15 apply to an insurer, the board of directors of the insurer must adopt the following resolutions:\n(1) a resolution finding that the insurer or an affiliate, as defined in section 60D.15, subdivision 2, of the insurer has employed a professional investment manager for the insurer's investments with sufficient expertise and has sufficient other resources to implement and monitor the insurer's investment policies and strategies; and\n(2) a resolution electing that sections 60L.01 to 60L.15 apply to the insurer.\nSections 60L.01 to 60L.15 do not govern an insurer unless the insurer has notified the commissioner in writing of its intention that sections 60L.01 to 60L.15 will govern the insurer at least 30 days before applying sections 60L.01 to 60L.15 to its investment policies, or a shorter period of time as the commissioner permits, and the commissioner has not disapproved the governing of the insurer by sections 60L.01 to 60L.15 within this period.\nWhen sections 60L.01 to 60L.15 begin to govern an insurer, then, in the case of a life insurer, sections 61A.28; 61A.282, subdivision 2; 61A.283; 61A.29; 61A.31; and 61A.315; and, in the case of an insurer other than a life insurer, section 60A.11, do not apply to an insurer.\n(a) After sections 60L.01 to 60L.15 begin to govern an insurer, sections 60L.01 to 60L.15 apply to the insurer unless:\n(1) the insurer has ceased to comply with the requirements of:\n(i) subdivision 1, if the insurer is a life insurer;\n(ii) subdivision 2, if the insurer is other than a life insurer; or\n(iii) subdivision 3\nand the insurer has failed to bring itself back into compliance with the requirements of the applicable subdivisions within 30 days of ceasing to comply; or\n(2) the commissioner has issued an order under section 60L.14, subdivision 2, that sections 60L.01 to 60L.15 no longer govern the insurer, regardless of whether the insurer is contesting the order; or\n(3) all of the following conditions have been met:\n(i) the insurer's board of directors has adopted a resolution electing that sections 60L.01 to 60L.15 no longer apply to its investments and investment practices;\n(ii) the insurer has notified the commissioner in writing of its intention that sections 60L.01 to 60L.15 no longer apply to the insurer's investments and investment practices; and\n(iii) during the period ending 30 days after the receipt by the commissioner of the written notice, the commissioner has not issued an order under section 60L.14 prohibiting the insurer from ceasing to comply with sections 60L.01 to 60L.15.\n(b) An insurer may not elect more than once in a 12-month period that sections 60L.01 to 60L.15 do not apply to the insurer's investments and investment practices.\n(c) An investment which is held as an admitted asset by an insurer on the date on which sections 60L.01 to 60L.15 cease to govern the insurer and which qualified as an admitted asset immediately before the date remains qualified as an admitted asset of the insurer.\n(d) If sufficient voting securities of the insurer or an affiliate are acquired to require a filing under section 60D.17, sections 60L.01 to 60L.15 cease to apply to the insurer 30 days following the completion of the acquisition of voting securities. If the board of directors of the insurer desires the insurer to continue to be governed by sections 60L.01 to 60L.15, it shall comply with the requirements of subdivision 4 and shall notify the commissioner as required under and subject to subdivision 5. If the notification is received within 30 days of the completion of the acquisition, the insurer is governed by sections 60L.01 to 60L.15 during the time period allowed for the commissioner's disapproval.\n(e) When sections 60L.01 to 60L.15 cease to govern an insurer, then, in the case of a life insurer, sections 61A.28; 61A.282, subdivision 2; 61A.283; 61A.29; 61A.31; and 61A.315, and, in the case of an insurer other than a life insurer, section 60A.11, apply to the insurer.\nSections 60L.01 to 60L.15 prevail over any other law, except section 60D.16, that authorizes an insurer to make a particular investment if the other law was enacted before August 1, 1998.",
	"repealed": false
}