{
	"id": "148.7803",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.7803",
	"title": "148.7803 PROHIBITED PRACTICE OR USE OF TITLES; PENALTY.",
	"text": "No person shall engage in athletic training without first being licensed under sections 148.7801 to 148.7815. A person engages in athletic training if the person performs or offers to perform athletic training as defined in section 148.7806.\n(a) A person shall not use in connection with the person's name or in any form of advertising, professional literature, or billing that relates to the person's occupation or profession as an athletic trainer, the words or letters registered athletic trainer; licensed athletic trainer; Minnesota registered athletic trainer; athletic trainer; AT; LAT; ATR; or any words, letters, abbreviations, or insignia indicating or implying that the person is an athletic trainer, without being licensed as an athletic trainer under sections 148.7801 to 148.7815.\n(b) Any person who is exempt from licensure under subdivision 3 must not use any of the titles identified in paragraph (a), or any description stating or implying that they are engaged in the practice of athletic training or that they are licensed to engage in the practice of athletic training.\n(a) Nothing in sections 148.7801 to 148.7815 shall be construed to prohibit the practice of any profession or occupation licensed or registered by the state or to perform any act that falls within the scope of practice of the licensed or registered profession or occupation.\n(b) Nothing in sections 148.7801 to 148.7815 shall be construed to require an athletic trainer license for:\n(1) a student engaged in athletic training as part of an accredited athletic training program if the student is under the direct supervision of a licensed athletic trainer and is identified as an \"athletic training student\"; or\n(2) an athletic trainer as a member of the United States armed forces while performing duties incident to duty.\nA person who violates this section is guilty of a misdemeanor and subject to section 214.11.",
	"repealed": false
}