{
	"id": "276.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/276.19",
	"title": "276.19 UNCLAIMED OVERPAYMENTS.",
	"text": "If an overpayment of property tax arises on a parcel due to receipt of a payment that exceeds the total amount of the tax required to be paid on the property tax statement, the responsible county official shall promptly notify the payer by regular mail that the overpayment has occurred. The notice must state the amount of overpayment and identify the parcel on which the overpayment occurred. The notice must also instruct the payer how to claim the overpayment and advise that the overpayment is subject to forfeiture under this section. If the name or address of the payer is not known, the notice of unclaimed overpayment must be mailed to the taxpayer of record in the office of the county auditor.\nIf the person entitled to the refund fails to claim the overpayment within three years after the date of overpayment, the county auditor shall cause notice to be published at least once in an English language newspaper of general circulation in the county. The county board shall designate the newspaper of publication that in the judgment of the board is most likely to be read by the claimants, notwithstanding any law to the contrary. The published notice must be called \"Notice of unclaimed property tax refunds.\" The notice must contain:\n(1) the names in alphabetical order and last known addresses, if any, of persons listed in the notice that may be entitled to unclaimed property tax refund;\n(2) a statement that information concerning the amount of overpayment and affected property may be obtained from the county auditor at the address given in the notice; and\n(3) a statement that if proof of claim is not presented to the county auditor within 90 days from the date of publication of notice, the overpayment will be considered abandoned and all claims to property tax overpayment will be forfeited.\nThe county auditor is not required to include and publish in the notice any item of less than $25 overpaid on a parcel.\nIf the person entitled to the refund fails to claim the overpayment within the time provided in this section, the county auditor shall distribute the refund to the affected taxing districts in proportion to the amount of their respective taxes included in the levy for the tax year overpaid. At the option of the county auditor, the overpayment may be distributed to the affected taxing districts in proportion to the current tax year levy.\nSections 345.31 to 345.60 do not apply to unclaimed property tax refunds, overpayments, and warrants.",
	"repealed": false
}