{
	"id": "541.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/541.051",
	"title": "541.051 LIMITATION OF ACTION FOR DAMAGES BASED ON SERVICES OR CONSTRUCTION TO IMPROVE REAL PROPERTY.",
	"text": "(a) Except where fraud is involved, no action by any person in contract, tort, or otherwise to recover damages for any injury to property, real or personal, or for bodily injury or wrongful death, arising out of the defective and unsafe condition of an improvement to real property, shall be brought against any person performing or furnishing the design, planning, supervision, materials, or observation of construction or construction of the improvement to real property or against the owner of the real property more than two years after the cause of action accrues, as specified in paragraph (c), nor in any event shall such a cause of action accrue more than ten years after substantial completion of the construction. Date of substantial completion shall be determined by the date when construction is sufficiently completed so that the owner or the owner's representative can occupy or use the improvement for the intended purpose.\n(b) Notwithstanding paragraph (a), an action for contribution or indemnity arising out of the defective and unsafe condition of an improvement to real property may be brought no later than two years after the cause of action for contribution or indemnity has accrued, regardless of whether it accrued before or after the ten-year period referenced in paragraph (a), provided that in no event may an action for contribution or indemnity be brought more than 14 years after substantial completion of the construction.\n(c) For purposes of determining only when the statute of limitations begins to run pursuant to paragraph (a), a cause of action accrues: (1) for a bodily injury or wrongful death action, upon discovery of the injury; and (2) for an action for injury to real or personal property, upon discovery of the injury, but in no event does a cause of action accrue earlier than substantial completion, termination, or abandonment of the construction or the improvement to real property. For purposes of paragraph (b), a cause of action for contribution or indemnity accrues upon the earlier of commencement of the action against the party seeking contribution or indemnity, or payment of a final judgment, arbitration award, or settlement arising out of the defective and unsafe condition.\n(d) Nothing in this section shall apply to actions for damages resulting from negligence in the maintenance, operation or inspection of the real property improvement against the owner or other person in possession.\n(e) The limitations prescribed in this section do not apply to the manufacturer or supplier of any equipment or machinery installed upon real property.\nNotwithstanding the provisions of subdivision 1, paragraph (a), in the case of a cause of action described in subdivision 1, paragraph (a), which accrues during the ninth or tenth year after substantial completion of the construction, an action to recover damages may be brought within two years after the date on which the cause of action accrued, but in no event may such an action be brought more than 12 years after substantial completion of the construction. Nothing in this subdivision shall limit the time for bringing an action for contribution or indemnity.\nNothing in this section shall be construed as extending the period prescribed by the laws of this state for the bringing of any action.\nFor the purposes of actions based on breach of the statutory warranties set forth in section 327A.02, or to actions based on breach of an express written warranty, such actions shall be brought within two years of the discovery of the breach. In the case of an action under section 327A.05, which accrues during the ninth or tenth year after the warranty date, as defined in section 327A.01, subdivision 8, an action may be brought within two years of the discovery of the breach, but in no event may an action under section 327A.05 be brought more than 12 years after the effective warranty date. An action for contribution or indemnity arising out of actions described in this subdivision may be brought no later than two years after the earlier of commencement of the action against the party seeking contribution or indemnity, or payment of a final judgment, arbitration award, or settlement arising out of the breach, provided that in no event may an action for contribution or indemnity arising out of an action described in section 327A.05 be brought more than 14 years after the effective warranty date.",
	"repealed": false
}