{
	"id": "325F.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.791",
	"title": "325F.791 SALES OF DOGS AND CATS.",
	"text": "Every pet dealer shall deliver to each retail purchaser of an animal written disclosure as follows:\n(a) The name, address, and USDA license number of the breeder and any broker who has had possession of the animal; the date of the animal's birth; the date the pet dealer received the animal; the breed, sex, color, and identifying marks of the animal; the individual identifying tag, tattoo, or collar number; the name and registration number of the sire and dam and the litter number; and a record of inoculations, worming treatments, and medication received by the animal while in the possession of the pet dealer.\n(b) A statement signed by the pet dealer that the animal has no known health problem, or a statement signed by the pet dealer disclosing any known health problem and a statement signed by a veterinarian that recommends necessary treatment.\nThe disclosure shall be made part of the statement of consumer rights set forth in subdivision 10. The disclosure required in paragraph (a) need not be made for mixed breed animals if the information is not available and cannot be determined by the pet dealer.\nThe pet dealer shall maintain, for one year, a copy of the statement of consumer rights delivered to the purchaser.\nA pet dealer who represents an animal as eligible for registration with an animal pedigree organization shall provide the retail purchaser, within 90 days of final payment, the documents necessary for registration. If these documents are not received from the pet dealer, the purchaser may retain the animal and receive a refund of 50 percent of the purchase price, or return the animal, along with all documentation previously provided, and receive a full refund. The pet dealer shall not be responsible for delays in registration which are the result of persons other than the pet dealer.\nNo animal may be offered for sale by a broker or pet dealer to a retail purchaser until the animal has been examined by a veterinarian. The veterinarian used by the broker shall not be the same veterinarian used by the pet dealer. If the pet dealer is not the breeder of the animal, each animal shall be examined within two days after receipt of the animal by a pet dealer and within four days of delivery of the animal to the purchaser by the pet dealer. The cost of the examination shall be paid by the pet dealer.\nTo obtain the remedies provided in subdivision 6, the purchaser shall with respect to an animal with a health problem:\n(a) Notify the pet dealer, within two business days, of the diagnosis by a veterinarian of a health problem and provide the pet dealer with the name and telephone number of the veterinarian and a copy of the veterinarian's report on the animal.\n(b) If the purchaser wishes to receive a full refund for the animal, return the animal no later than two business days after receipt of a written statement from a veterinarian indicating the animal is unfit due to a health problem.\nWith respect to a dead animal the purchaser must provide the pet dealer a written statement from a veterinarian, indicating the animal died from a health problem which existed on or before the receipt of the animal by the purchaser.\nIf, within ten days after receipt of the animal by the purchaser, a veterinarian states, in writing, that the animal has a health problem which existed in the animal at the time of delivery, or if within one year after receipt of the animal by the purchaser, a veterinarian states, in writing, that the animal has died or is ill due to a hereditary or congenital defect, or is not of the breed type represented, the animal shall be considered to have been unfit for sale at the time of sale.\nIn the event an animal dies due to a health problem which existed in the animal at the time of delivery to the purchaser, the pet dealer shall provide the purchaser with one of the following remedies selected by the purchaser: receive an animal, of equal value, if available, and reimbursement for reasonable veterinary fees, such reimbursements not to exceed the original purchase price of the animal; or receive a refund of the full purchase price.\nIn the event of a health problem, which existed at the time of delivery to the purchaser, the pet dealer shall provide the purchaser with one of the following remedies selected by the purchaser: return the animal to the pet dealer for a refund of the full purchase price; exchange the animal for an animal of the purchaser's choice of equivalent value, providing a replacement is available; or retain the animal, and receive reimbursement for reasonable veterinary fees, such reimbursements not to exceed the original purchase price of the animal.\nThe price of veterinary service shall be deemed reasonable if the service is appropriate for the diagnosis and treatment of the health problem and the price of the service is comparable to that of similar service rendered by other veterinarians in proximity to the treating veterinarian.\nNo refund, replacement, or reimbursement of veterinary fees shall be required if any one or more of the following conditions exist:\n(a) The health problem or death resulted from maltreatment, neglect, or a disease contracted while in the possession of the purchaser, or from an injury sustained subsequent to receipt of the animal by the purchaser.\n(b) A veterinarian's statement was provided to the purchaser pursuant to subdivision 1, paragraph (b), which disclosed the health problem for which the purchaser seeks to return the animal.\n(c) The purchaser fails to carry out recommended treatment prescribed by the examining veterinarian, pursuant to subdivision 1, paragraph (b).\n(a) In the event that a pet dealer wishes to contest a demand for the relief specified in subdivision 3 or 6, the pet dealer may require the purchaser to produce the animal for examination or autopsy by a veterinarian designated by the pet dealer. The pet dealer shall pay the cost of this examination or autopsy. The pet dealer shall have a right of recovery against the purchaser if the pet dealer is not obligated to provide a remedy under subdivision 6.\n(b) If the pet dealer does not provide the relief selected by the purchaser set forth in subdivision 3 or 6, the purchaser may initiate a court action.\n(c) The prevailing party in the court action shall have the right to recover costs and reasonable attorney fees not to exceed $500.\nEvery pet dealer shall post in a prominent location of the facility, a notice, in 48-point boldface type, containing the following language:\n\"Information on all dogs and cats is available. You are entitled to a statement of consumer rights. Make sure you receive this statement at the time of purchase.\"\nEvery pet dealer shall provide the retail purchaser a written notice of rights, which shall be signed by the purchaser, acknowledging that the purchaser has reviewed the notice, and signed by the pet dealer certifying the accuracy of the information contained in it. A signed copy shall be retained by the pet dealer and one given to the purchaser. The notice shall be in 16-point boldface type and shall state as follows:\n\"A STATEMENT OF MINNESOTA LAW GOVERNING\nTHE SALE OF DOGS AND CATS\nThe sale of dogs and cats is subject to consumer protection regulations. Minnesota law also provides safeguards to protect pet dealers and animal purchasers. Attached is a copy of Minnesota Statutes, section 325F.79. Contained within this law is a statement of your consumer rights.\"\nThe statement of consumer rights shall also contain or have attached the disclosures required under subdivision 1.\nNothing in this subdivision shall limit the rights or remedies which are otherwise available to a purchaser under any other law. Any agreement or contract by a purchaser to waive any rights under this chapter shall be null and void and shall be unenforceable.",
	"repealed": false
}