{
	"id": "16A.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.124",
	"title": "16A.124 PROMPT PAYMENT OF STATE AGENCY BILLS REQUIRED.",
	"text": "(a) For the purposes of this section, the following terms have the meanings here given them.\n(b) \"Commissioner\" means the commissioner of management and budget.\n(c) \"State agency\" has the meaning assigned to it in section 16B.01.\nFor purposes of this section, a state agency that bills another state agency for a service or commodity is considered a vendor like any nonstate vendor.\nThe commissioner shall monitor state agencies to insure the prompt payment of vendor obligations.\nState agencies must pay each valid vendor obligation so that the vendor receives payment within the vendor's early payment discount period. If there is no early payment discount period, the state agency must pay the vendor within 30 days following the receipt of the invoice for the completed delivery of the product or service.\nIf an invoice is incorrect, defective, or otherwise improper, the agency must notify the vendor within ten days of discovering the error. Upon receiving a corrected invoice, the agency must pay the bill within the time limitation contained in subdivision 3.\nFor purposes of Department of Human Services payments to hospitals receiving reimbursement under the medical assistance program, if an invoice is incorrect, defective, or otherwise improper, the Department of Human Services must notify the hospital of all errors, within 30 days of discovery of the errors.\n(a) The commissioner of human services must pay or deny a valid vendor obligation for health services under the medical assistance or MinnesotaCare program within 30 days after receipt. A \"valid vendor obligation\" means a clean claim submitted directly to the commissioner by an eligible health care provider for health services provided to an eligible recipient. A \"clean claim\" means an original paper or electronic claim with correct data elements, prepared in accordance with the commissioner's published specifications for claim preparation, that does not require an attachment or text information to pay or deny the claim. Adjustment claims, claims with attachments and text information, and claims submitted to the commissioner as the secondary or tertiary payer, that have been prepared in accordance with the commissioner's published specifications, must be adjudicated within 90 days after receipt.\nFor purposes of this subdivision, paragraphs (b) and (c) apply.\n(b) The agency is not required to make an interest penalty payment on claims for which payment has been delayed for purposes of reviewing potentially fraudulent or abusive billing practices, if there is an eventual finding by the agency of fraud or abuse.\n(c) The agency is not required to make an interest penalty payment of less than $2.\n(a) A state agency shall pay interest to a vendor for undisputed billings when the agency has not paid the billing within 30 days following receipt of the invoice, merchandise, or service whichever is later. A negotiated contract or agreement between a vendor and a state agency which requires an audit by the state agency prior to acceptance and payment of the vendor's invoice shall not be considered past due until 30 days after the completion of the audit by the state agency. Before any interest payment is made, the vendor must invoice the state agency for such interest. For a construction contract utilizing partial payments based on an engineer's estimate or a payment application approved by an architect, an invoice includes an engineer's estimate or a payment application, as applicable, if made in regular intervals that are: (1) as specified in the contract, and (2) no less frequent than once per month.\n(b) The rate of interest paid by the agency on undisputed bills not paid within 30 days shall be 1-1/2 percent per month or any part thereof.\n(c) All interest penalties and collection costs must be paid from the agency's current operating budget. No agency may seek to increase its appropriation for the purpose of obtaining funds to pay interest penalties or collection costs.\n(d) Any vendor who prevails in a civil action to collect interest penalties from a state agency shall be awarded its costs and disbursements, including attorney's fees, incurred in bringing the actions.\n(e) No interest penalties may accrue against an agency that delays payment of a bill due to a disagreement with the vendor; provided, that the dispute must be settled within 30 days after the bill became overdue. Upon the resolution of the dispute, the agency must pay the vendor accrued interest on all proper invoices for which payment was not received within the applicable time limit contained in subdivision 3. No interest penalties accrue under this section against an agency for claims made by a contractor under a construction contract.\n(f) The minimum monthly interest penalty payment that a state agency shall pay a vendor for the unpaid balance for any one overdue bill equal to or in excess of $100 is $10. For unpaid balances of less than $100, the state agency shall pay the actual penalty due to the vendor.\nThe University of Minnesota may comply with the requirements of subdivision 5.\n[Repealed, 1994 c 632 art 3 s 65]\nThe commissioner shall report to the legislature by December 31 of each year summarizing the state's payment record for the preceding fiscal year. The report shall include the amount of interest penalties and the specific steps being taken to reduce the incidence of late payments in the future.\nSubdivisions 1 to 7 apply to all agency purchases, leases, rentals, and contracts for services, including construction and remodeling contracts, except for:\n(1) purchases from or contracts for service with a public utility as defined in section 216B.02 or a telephone company as defined in section 237.01 that has on file with the Public Utilities Commission an approved practice regarding late fees; and\n(2) provider billings to and contracts with the commissioner of human services for health care services, which are subject only to subdivisions 4a and 4b.",
	"repealed": false
}