{
	"id": "246.715",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.715",
	"title": "246.715 TESTING OF AVAILABLE BLOOD.",
	"text": "If a sample of the patient's blood is available, the state-operated treatment program shall ensure that blood is tested for blood-borne pathogens with the consent of the patient, provided the conditions in sections 246.711 and 246.712 are met.\nIf the patient has provided a blood sample, but does not consent to blood-borne pathogens testing, the state-operated treatment program shall ensure that the blood is tested for blood-borne pathogens if the employee requests the test, provided all of the following criteria are met:\n(1) the employee and state-operated treatment program have documented exposure to blood or body fluids during performance of the employee's work duties;\n(2) a licensed physician, advanced practice registered nurse, or physician assistant has determined that a significant exposure has occurred under section 246.711 and has documented that blood-borne pathogen test results are needed for beginning, modifying, continuing, or discontinuing medical treatment for the employee as recommended by the most current guidelines of the United States Public Health Service;\n(3) the employee provides a blood sample for testing for blood-borne pathogens as soon as feasible;\n(4) the state-operated treatment program asks the patient to consent to a test for blood-borne pathogens and the patient does not consent;\n(5) the state-operated treatment program has provided the patient and the employee with all of the information required by section 246.712; and\n(6) the state-operated treatment program has informed the employee of the confidentiality requirements of section 246.719 and the penalties for unauthorized release of patient information under section 246.72.\nThe state-operated treatment program shall inform the patient whose blood was tested of the results. The state-operated treatment program shall inform the employee's health care provider of the patient's test results without the patient's name or other uniquely identifying information.",
	"repealed": false
}