{
	"id": "123A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.32",
	"title": "123A.32 INTERDISTRICT COOPERATION.",
	"text": "The boards of two or more districts may, after consultation with the department, enter into an agreement providing for:\n(1) discontinuance by all districts except one of at least the 10th, 11th, and 12th grades; and\n(2) instruction of the pupils in the discontinued grades in one of the cooperating districts. Each district must continue to operate a school with at least three grades. Before entering into a final agreement, the boards must provide a copy of this agreement to the commissioner.\n(a) Each district must continue to count its resident pupils who are educated in a cooperating district as resident pupils in the calculation of pupil units for all purposes. The agreement must provide for tuition payments between or among the districts.\n(b) Each district must continue to provide transportation and collect transportation aid for its resident pupils pursuant to sections 123B.88 and 123B.92. A district may provide some or all transportation to its resident pupils by contracting with a cooperating district. For purposes of section 123B.92, the commissioner may adjust the base cost per eligible pupil transported to reflect changes in costs resulting from the agreement.\nThe board and exclusive bargaining representative of the teachers in each district discontinuing grades may negotiate a plan to assign or employ in a cooperating district or to place on unrequested leave of absence all teachers whose positions are discontinued as a result of the agreement. The board and exclusive bargaining representative of the teachers in each district providing instruction to nonresident pupils may negotiate a plan to employ teachers from a cooperating district whose positions are discontinued as a result of the agreement. If plans are negotiated and if the boards determine the plans are compatible, the boards shall include the plans in their agreement.\nIf compatible plans are not negotiated before the March 1 preceding any year of the agreement, the cooperating districts shall be governed by this subdivision. Insofar as possible, teachers who have acquired continuing contract rights and whose positions are discontinued as a result of the agreement shall be employed by a cooperating district or assigned to teach in a cooperating district as exchange teachers pursuant to section 122A.54. If necessary, teachers whose positions are discontinued as a result of the agreement and who have acquired continuing contract rights shall be placed on unrequested leave of absence in fields in which they are licensed in the inverse order in which they were employed by a cooperating district, according to a combined seniority list of teachers in the cooperating districts. For the purpose of establishing a combined seniority list, each district must be considered to have started school each year on the same date.\nPrior to entering into an agreement, the board shall consult with the community at an informational meeting. The board must publish notice of the meeting in the official newspaper of the district and may send written notice of the meeting to parents of pupils who would be affected.\nNotwithstanding any law to the contrary, boards that have an agreement may hold a valid joint meeting at any location that would be permissible for one of the boards participating in the meeting. A board that has an agreement may hold a meeting in any district that is a party to the agreement. The board shall comply with chapter 13D and any other law applicable to a meeting of a board.",
	"repealed": false
}