{
	"id": "342.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.54",
	"title": "342.54 DUTIES OF OFFICE OF CANNABIS MANAGEMENT; REGISTRY PROGRAM.",
	"text": "The office must:\n(1) provide notice of the registry program to health care practitioners in the state;\n(2) allow health care practitioners to participate in the registry program if they request to participate and meet the program's requirements;\n(3) provide explanatory information and assistance to health care practitioners to understand the nature of the therapeutic use of medical cannabis flower and medical cannabinoid products within program requirements;\n(4) make available to participating health care practitioners a certification form in which a health care practitioner certifies that a patient has a qualifying medical condition; and\n(5) supervise the participation of health care practitioners in the registry reporting system in which health care practitioners report patient treatment and health records information to the office in a manner that ensures stringent security and record keeping requirements and that prevents the unauthorized release of private data on individuals as defined in section 13.02.\nThe office must:\n(1) administer the registry program according to section 342.52;\n(2) provide information to patients enrolled in the registry program on the existence of federally approved clinical trials for the treatment of the patient's qualifying medical condition with medical cannabis flower or medical cannabinoid products as an alternative to enrollment in the registry program;\n(3) maintain safety criteria with which patients must comply as a condition of participation in the registry program to prevent patients from undertaking any task under the influence of medical cannabis flower or medical cannabinoid products that would constitute negligence or professional malpractice;\n(4) review and publicly report on existing medical and scientific literature regarding the range of recommended dosages for each qualifying medical condition, the range of chemical compositions of medical cannabis flower and medical cannabinoid products that will likely be medically beneficial for each qualifying medical condition, and any risks of noncannabis drug interactions. This information must be updated by December 1 every three years. The office may consult with an independent laboratory under contract with the office or other experts in reporting and updating this information; and\n(5) annually consult with cannabis businesses about medical cannabis that the businesses cultivate, manufacture, and offer for sale and post on the office website a list of the medical cannabis flower and medical cannabinoid products offered for sale by each cannabis business with a medical cannabis retailer endorsement.\n(a) The office must conduct or contract with a third party to conduct research and studies using data from health records submitted to the registry program under section 342.55, subdivision 2, and data submitted to the registry program under section 342.52, subdivisions 2 and 3. If the office contracts with a third party for research and studies, the third party must provide the office with access to all research and study results. The office must submit reports on intermediate or final research results to the legislature and major scientific journals. All data used by the office or a third party under this subdivision must be used or reported in an aggregated nonidentifiable form as part of a scientific peer-reviewed publication of research or in the creation of summary data, as defined in section 13.02, subdivision 19.\n(b) The office may submit medical research based on the data collected under sections 342.55, subdivision 2, and data collected through the statewide monitoring system to any federal agency with regulatory or enforcement authority over medical cannabis flower and medical cannabinoid products to demonstrate the effectiveness of medical cannabis flower or medical cannabinoid products for treating or alleviating the symptoms of a qualifying medical condition.",
	"repealed": false
}