{
	"id": "277.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/277.21",
	"title": "277.21 LEVY AND DISTRAINT.",
	"text": "If a tax assessed on personal property or manufactured homes and collectible under this chapter is not paid when due, the county treasurer shall, as soon as practicable, take action the county treasurer considers necessary and reasonable to collect the delinquent tax. By mutual agreement, the county treasurer may use the services of the district court or the central collection unit of the county to effect collection. In addition, by inclusion and not limitation, the county treasurer may request a writ of execution to enforce any tax judgment or may levy and seize property under authority granted by this section. Taxes may be collected by the county treasurer within five years after the date of assessment of the tax, or if a lien has been filed, within the period the lien is enforceable, or if the tax judgment has been filed, within the statutory period of enforcement of a valid tax judgment, by a levy upon all property and rights to property of the person liable for the payment of the tax. However, the right to levy does not extend to property that is exempt from execution under sections 550.37, 550.38, and 550.39, but manufactured homes otherwise exempt per section 550.37, subdivision 12, are subject to levy and sale under this section. The term \"levy\" includes the power of distraint and seizure by any means. For this purpose, the term \"tax\" includes penalty, interest, and costs properly payable.\nAt least 30 days before a levy is made, notice and demand for payment of the amount due must be given to the person liable for the payment or collection of the tax. If the county treasurer has reason to believe that collection of the tax is in jeopardy, notice and demand for immediate payment of the tax may be made by the county treasurer. If the tax is not paid, the county treasurer may proceed to collect by levy without regard to the 30-day period or the due date.\nIf collection of tax on personal property or manufactured homes is in jeopardy because of removal from the county or other reasons before the time that the taxes are calculated for the property for the current tax year, the county auditor shall immediately determine the amount of tax by applying the latest available levy rate and market value and shall notify the county treasurer of the amount of tax in jeopardy. The county treasurer may levy and seize the property without regard to prior notice or due date.\nThe notice required under this subdivision must be sent to the taxpayer's last known address and must include a brief statement that states in simple and nontechnical terms:\n(1) the administrative appeals available to the taxpayer with respect to the levy and sale; and\n(2) the alternatives available to the taxpayer that can prevent a levy, including an installment payment agreement under section 277.23.\nIn making the execution of the levy and in collecting the taxes due in a manner consistent with the provisions of this chapter, the county treasurer has all of the powers in chapter 550, and the powers given to the commissioner of revenue in sections 270C.68, 270C.69, and 270C.70, for purposes of effecting an execution against property in this state. The sale of property levied upon, and the time and manner of redemption therefrom, must be consistent with authority granted to the commissioner of revenue to collect state taxes under sections 270C.67 to 270C.72. The seal of the court, subscribed by the court administrator, as provided in section 550.04, is not required. The levy for collection of taxes may be made, whether or not a legal action for collection of the taxes has been commenced.\n(a) Except for a jeopardy collection under subdivision 2, property shall not be seized for collection of tax until the time has expired for filing an appeal of the assessment with the Tax Court under this chapter, or section 273.125 in the case of a manufactured home. If a jeopardy assessment has been made, the owner may file an appeal with the Tax Court within 30 days after the notice of assessment is issued by the county. The notice shall advise the owner of the right of appeal. If a timely appeal has been filed, no sale may be made unless the taxes remain unpaid for a period of more than 30 days after final determination of the appeal by the Tax Court or by the appropriate judicial forum.\n(b) Notwithstanding paragraph (a), seized property may be sold if:\n(1) the taxpayer consents in writing to the sale; or\n(2) the county treasurer determines that the property is perishable or may become greatly reduced in price or value by keeping, or that the property cannot be kept without great expense.\nIf a levy has been made to collect taxes under this section and the property seized is properly included in a formal proceeding commenced under sections 524.3-401 to 524.3-505 and maintained under full supervision of the court, the property may not be sold until the probate proceedings are completed or until the court so orders.\nThe property seized must be returned to the owner if the owner gives a surety bond equal to the appraised value of the owner's interest in the property, or deposits with the county treasurer security in a form and amount that is necessary to ensure payment of the liability, but not more than twice the liability.\nNotwithstanding any other provision to the contrary, if a levy or sale under this section would irreparably injure rights in property that the court determines to be superior to rights of the taxing districts in the property, the district court may grant an injunction to prohibit the enforcement of the levy or to prohibit a sale.\nA person who fails or refuses to surrender without reasonable cause any property or rights to property subject to levy, upon demand by the county treasurer, is personally liable to the treasurer in an amount equal to the value of the property or rights not so surrendered, but not exceeding the amount of taxes for the collection of which the levy has been made. Any amount recovered under this subdivision must be credited against the tax liability for the collection of which the levy was made.\nIn addition to the personal liability imposed by subdivision 8, if a person required to surrender property or rights to property fails or refuses to surrender the property or rights to property without reasonable cause, the person is liable for a penalty equal to 25 percent of the amount recoverable under subdivision 8. No part of the penalty may be credited against the tax liability for the collection of which the levy was made.\nThe term \"person\" as used in subdivision 8 includes an officer or employee of a corporation or a member or employee of a partnership who, as an officer, employee, or member is under a duty to surrender the property or rights to property or to discharge the obligation. The county attorney shall take appropriate action against any person who has failed to comply with subdivision 8 or 9.\nAn action taken by the county treasurer under this section does not constitute an election to pursue a remedy to the exclusion of any other remedy.\nUpon the seizure of property of a person, that person may, upon giving 48-hours notice to the county treasurer and to the court, bring a claim for equitable relief before the district court for the release of the property to the taxpayer upon terms and conditions the court considers equitable.\nIf a tax collectible under this chapter is not paid as provided in subdivision 1 or 2, the county treasurer may, within the time prescribed for collection in subdivision 1, delegate authority by issuing a warrant to the sheriff of a county in the state of Minnesota directing the sheriff as the county treasurer's agent to levy on and sell the real and personal property of the person liable for the payment of the tax and to return the warrant and pay to the county treasurer the money collected within 120 days from the date of the warrant.\nThe sheriff shall proceed under authority of the warrant to levy on and seize any property and rights to property in the county belonging to the person liable for the payment of the tax, except that the right to levy and seizure does not extend to property that is exempt from execution under sections 550.37, 550.38, and 550.39, but manufactured homes otherwise exempt under section 550.37, subdivision 12, are subject to levy under this section. The sheriff shall sell so much of the property levied on as is necessary to satisfy the amount of the warrant and the sheriff's costs.\nSales procedures, and the time and manner of redemption from them, must be consistent with the procedures in sections 270C.7101 to 270C.7109 for warrants issued by the commissioner of revenue. The sale proceeds, less the sheriff's costs, must be turned over to the county treasurer who issued the warrant. The proceeds must be applied as provided in section 270C.7108.\nNotwithstanding section 52.12, a levy by the county treasurer made under this section on a taxpayer's funds on deposit in a financial institution located in this state, has priority over an unexercised right of setoff of the financial institution to apply the levied funds toward the balance of an outstanding loan or loans owed by the taxpayer to the financial institution. A claim by the financial institution that it exercised its right to setoff before the levy must be substantiated by evidence of the date of the setoff, and must be verified by the sworn statement of a responsible corporate officer of the financial institution. Furthermore, for purposes of determining the priority of a levy made under this section, the levy must be treated as if it were an execution made under chapter 550.\nA person in possession of, or obligated with respect to, property or rights to property subject to levy on which a levy has been made who, upon demand by the county treasurer or agent, surrenders the property or rights to property, or pays a liability under subdivision 8, must be discharged from any obligation or liability to the person liable for the payment or collection of the delinquent tax with respect to the property or rights to property so surrendered or paid.\nNotwithstanding any other law to the contrary, the notice of a levy authorized by this section may be served by mail or by delivery by an employee or agent of the county treasurer.",
	"repealed": false
}