{
	"id": "176.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.011",
	"title": "176.011 DEFINITIONS.",
	"text": "For the purposes of this chapter the terms described in this section have the meanings ascribed to them.\nAn \"administrative conference\" is a meeting conducted by a commissioner's designee or a compensation judge where parties can discuss on an expedited basis and in an informal setting their viewpoints concerning disputed issues arising under section 176.102, 176.103, 176.135, 176.136, or 176.239. If the parties are unable to resolve the dispute, the commissioner's designee or a compensation judge shall issue an administrative decision under section 176.106 or 176.239.\nThe statewide average weekly wage for any year means that wage determined by the commissioner in the following manner: On or before July 1 preceding the year in which the wage is to be applicable, the total wages reported on wage detail reports to the Department of Employment and Economic Development for the preceding 12 months ending on December 31 of that year shall be divided by the average monthly number of covered workers (determined by dividing the total covered workers reported for the year ending December 31 by 12). The average annual wage thus obtained shall be divided by 52 and the average weekly wage thus determined rounded to the next highest dollar.\n\"Agency\" means, unless the context indicates otherwise, the commissioner of the Department of Labor and Industry, the Department of Labor and Industry, the Department's workers' compensation division, the Office of Administrative Hearings, the chief administrative law judge, and the Workers' Compensation Court of Appeals.\n\"CAMPUS\" means the workers' compensation Claims Access and Management Platform User System, developed pursuant to the appropriations in Laws 2015, First Special Session chapter 1, article 1, section 5, as amended by Laws 2017, chapter 94, article 2, section 17, and Laws 2017, chapter 94, article 1, section 4, and referenced as the workers' compensation modernization program in section 176.2611 and as described in section 176.2612.\n\"Child\" includes a posthumous child, a child entitled by law to inherit as a child of a deceased person, a child of a person adjudged by a court of competent jurisdiction to be the parent of the child, and a stepchild, grandchild, or foster child who was a member of the family of a deceased employee at the time of injury and dependent upon the employee for support. A stepchild is a \"child\" within the meaning of section 176.041.\n\"Closely held corporation\" means a corporation whose stock is held by no more than ten persons. The determination of ownership shall be made annually on the effective date of the policy issued under this chapter. In case of self-insureds the determination shall be made annually on the date of approval of self-insurance or renewal of self-insurance.\nMS 2006 [Renumbered subd 8a]\n\"Commercial baler\" means a person going from place to place baling hay or straw as a business, but does not include a farmer owning a baling machine not engaged in such business generally and doing the farmer's own baling and casually doing such work for other farmers in the same community or exchanging work with another farmer.\n\"Commercial thresher\" means a person going from place to place threshing grain or shredding or shelling corn as a business, but does not include a farmer owning a threshing, shredding, or shelling machine not engaged in such business generally and doing the farmer's own threshing, shredding, or shelling and casually doing such work for other farmers in the same community or exchanging work with another farmer.\n\"Commissioner,\" unless the context clearly indicates otherwise, means the commissioner of labor and industry.\n(1) [Renumbered subd 7b]\n(2) [Renumbered subd 8c]\n(3) [Renumbered subd 8b]\n(4) [Renumbered subd 5a]\n(5) [Renumbered subd 15a]\n\"Compensation\" includes all benefits provided by this chapter on account of injury or death.\nMS 2006 [Renumbered subd 12c]\n\"Compensation judge\" means a workers' compensation judge at the Office of Administrative Hearings.\nCompensation judges may conduct settlement conferences, issue summary decisions, approve settlements and issue awards thereon, determine petitions for attorney fees and costs, and make other determinations, decisions, orders, and awards as may be delegated to them by law or the commissioner. Compensation judges must be learned in the law.\n\"Court of appeals\" means the Workers' Compensation Court of Appeals of Minnesota.\n[Renumbered subd 6a]\n\"Daily wage\" means the daily wage of the employee in the employment engaged in at the time of injury but does not include tips and gratuities paid directly to an employee by a customer of the employer and not accounted for by the employee to the employer. If the amount of the daily wage received or to be received by the employee in the employment engaged in at the time of injury was irregular or difficult to determine, or if the employment was part time, the daily wage shall be computed by dividing the total amount of wages, vacation pay, and holiday pay the employee actually earned in such employment in the last 26 weeks, by the total number of days in which such wages, vacation pay, and holiday pay was earned, provided further, that in the case of the construction industry, mining industry, or other industry where the hours of work are affected by seasonal conditions, the weekly wage shall not be less than five times the daily wage. If the employee worked or earned less than a full day's worth of wages, vacation pay, or holiday pay, the total amount earned shall be divided by the corresponding proportion of that day. Where board or allowances other than tips and gratuities are made to an employee in addition to wages as a part of the wage contract they are deemed a part of earnings and computed at their value to the employee. In the case of persons performing services for municipal corporations in the case of emergency, then the normal working day shall be considered and computed as eight hours, and in cases where such services are performed gratis or without fixed compensation the daily wage of the person injured shall, for the purpose of calculating compensation payable under this chapter, be taken to be the usual going wage paid for similar services in municipalities where such services are performed by paid employees. If, at the time of injury, the employee was regularly employed by two or more employers, the employee's earnings in all such employments shall be included in the computation of daily wage.\n\"Department\" means the Department of Labor and Industry.\n\"Division\" means the Workers' Compensation Division of the Department of Labor and Industry.\n\"Division file\" means the official file created and maintained by the department within CAMPUS to retain imaged or electronic documents and data related to an employee's workers' compensation claim or injury under chapter 176, including documents transmitted to the commissioner under sections 176.281 and 176.2611. The division file does not include:\n(1) paper, images, or electronic data created, used, or maintained for internal operational purposes by an agency, the special compensation fund, or the vocational rehabilitation unit;\n(2) a confidential mediation statement, including any documents submitted with the statement for the mediator's review and any additional documents submitted to or sent by the mediator in furtherance of mediation efforts; and\n(3) work product of a compensation judge, mediator, or commissioner that is not issued or sent to a party to a claim. Examples of work product include personal notes of hearings or conferences and draft decisions or orders.\n\"Document\" includes a form, record, report, notice, order, and paper. Document also includes information and data, regardless of format, that are required or authorized by this chapter to be filed with or served on or by an agency. Document excludes physical objects such as clothing, flash drives, compact discs, or physical objects used as demonstrative evidence.\n(a) \"Employee\" means any person who performs services for another for hire including the following:\n(1) an alien;\n(2) a minor;\n(3) a sheriff, deputy sheriff, police officer, firefighter, county highway engineer, and peace officer while engaged in the enforcement of peace or in the pursuit or capture of a person charged with or suspected of crime;\n(4) a person requested or commanded to aid an officer in arresting or retaking a person who has escaped from lawful custody, or in executing legal process, in which cases, for purposes of calculating compensation under this chapter, the daily wage of the person shall be the prevailing wage for similar services performed by paid employees;\n(5) a county assessor;\n(6) an elected or appointed official of the state, or of a county, city, town, school district, or governmental subdivision in the state. An officer of a political subdivision elected or appointed for a regular term of office, or to complete the unexpired portion of a regular term, shall be included only after the governing body of the political subdivision has adopted an ordinance or resolution to that effect;\n(7) an executive officer of a corporation, except those executive officers excluded by section 176.041;\n(8) a voluntary uncompensated worker, other than an inmate, rendering services in state institutions under the Direct Care and Treatment executive board and commissioner of corrections similar to those of officers and employees of the institutions, and whose services have been accepted or contracted for by the Direct Care and Treatment executive board and commissioner of corrections as authorized by law. In the event of injury or death of the worker, the daily wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of the injury or death for similar services in institutions where the services are performed by paid employees;\n(9) a voluntary uncompensated worker engaged in emergency management as defined in section 12.03, subdivision 4, who is:\n(i) registered with the state or any political subdivision of it, according to the procedures set forth in the state or political subdivision emergency operations plan; and\n(ii) acting under the direction and control of, and within the scope of duties approved by, the state or political subdivision.\nThe daily wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of the injury or death for similar services performed by paid employees;\n(10) a voluntary uncompensated worker participating in a program established by a local social services agency. For purposes of this clause, \"local social services agency\" means any agency established under section 393.01. In the event of injury or death of the worker, the wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid in the county at the time of the injury or death for similar services performed by paid employees working a normal day and week;\n(11) a voluntary uncompensated worker accepted by the commissioner of natural resources who is rendering services as a volunteer pursuant to section 84.089. The daily wage of the worker for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of injury or death for similar services performed by paid employees;\n(12) a voluntary uncompensated worker in the building and construction industry who renders services for joint labor-management nonprofit community service projects. The daily wage of the worker for the purpose of calculating compensation under this chapter shall be the usual wage paid at the time of injury or death for similar services performed by paid employees;\n(13) a member of the military forces, as defined in section 190.05, while in state active service, as defined in section 190.05, subdivision 5a. The daily wage of the member for the purpose of calculating compensation under this chapter shall be based on the member's usual earnings in civil life. If there is no evidence of previous occupation or earning, the trier of fact shall consider the member's earnings as a member of the military forces;\n(14) a voluntary uncompensated worker, accepted by the director of the Minnesota Historical Society, rendering services as a volunteer, pursuant to chapter 138. The daily wage of the worker, for the purposes of calculating compensation under this chapter, shall be the usual wage paid at the time of injury or death for similar services performed by paid employees;\n(15) a voluntary uncompensated worker, other than a student, who renders services at the Minnesota State Academy for the Deaf or the Minnesota State Academy for the Blind, and whose services have been accepted or contracted for by the commissioner of education, as authorized by law. In the event of injury or death of the worker, the daily wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of the injury or death for similar services performed in institutions by paid employees;\n(16) a voluntary uncompensated worker, other than a resident of the veterans home, who renders services at a Minnesota veterans home, and whose services have been accepted or contracted for by the commissioner of veterans affairs, as authorized by law. In the event of injury or death of the worker, the daily wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of the injury or death for similar services performed in institutions by paid employees;\n(17) a worker performing services under section 256B.0659 for a recipient in the home of the recipient or in the community under section 256B.0625, subdivision 19a, who is paid from government funds through a fiscal intermediary under section 256B.0659, subdivision 33. For purposes of maintaining workers' compensation insurance, the employer of the worker is as designated in law by the commissioner of the Department of Human Services, notwithstanding any other law to the contrary;\n(18) students enrolled in and regularly attending the Medical School of the University of Minnesota in the graduate school program or the postgraduate program. The students shall not be considered employees for any other purpose. In the event of the student's injury or death, the weekly wage of the student for the purpose of calculating compensation under this chapter, shall be the annualized educational stipend awarded to the student, divided by 52 weeks. The institution in which the student is enrolled shall be considered the \"employer\" for the limited purpose of determining responsibility for paying benefits under this chapter;\n(19) a faculty member of the University of Minnesota employed for an academic year is also an employee for the period between that academic year and the succeeding academic year if:\n(i) the member has a contract or reasonable assurance of a contract from the University of Minnesota for the succeeding academic year; and\n(ii) the personal injury for which compensation is sought arises out of and in the course of activities related to the faculty member's employment by the University of Minnesota;\n(20) a worker who performs volunteer ambulance driver or attendant services is an employee of the political subdivision, nonprofit hospital, nonprofit corporation, or other entity for which the worker performs the services. The daily wage of the worker for the purpose of calculating compensation under this chapter shall be the usual wage paid at the time of injury or death for similar services performed by paid employees;\n(21) a voluntary uncompensated worker, accepted by the commissioner of administration, rendering services as a volunteer at the Department of Administration. In the event of injury or death of the worker, the daily wage of the worker, for the purpose of calculating compensation under this chapter, shall be the usual wage paid at the time of the injury or death for similar services performed in institutions by paid employees;\n(22) a voluntary uncompensated worker rendering service directly to the Pollution Control Agency. The daily wage of the worker for the purpose of calculating compensation payable under this chapter is the usual going wage paid at the time of injury or death for similar services if the services are performed by paid employees;\n(23) a voluntary uncompensated worker while volunteering services as a first responder or as a member of a law enforcement assistance organization while acting under the supervision and authority of a political subdivision. The daily wage of the worker for the purpose of calculating compensation payable under this chapter is the usual going wage paid at the time of injury or death for similar services if the services are performed by paid employees;\n(24) a voluntary uncompensated member of the civil air patrol rendering service on the request and under the authority of the state or any of its political subdivisions. The daily wage of the member for the purposes of calculating compensation payable under this chapter is the usual going wage paid at the time of injury or death for similar services if the services are performed by paid employees; and\n(25) a Minnesota Responds Medical Reserve Corps volunteer, as provided in sections 145A.04 and 145A.06, responding at the request of or engaged in training conducted by the commissioner of health. The daily wage of the volunteer for the purposes of calculating compensation payable under this chapter is established in section 145A.06. A person who qualifies under this clause and who may also qualify under another clause of this subdivision shall receive benefits in accordance with this clause.\nIf it is difficult to determine the daily wage as provided in this subdivision, the trier of fact may determine the wage upon which the compensation is payable.\n(b) For purposes of this chapter \"employee\" does not include farmers or members of their family who exchange work with other farmers in the same community.\n[Renumbered subd 9, para (b)]\n\"Employer\" means any person who employs another to perform a service for hire; and includes corporation, partnership, limited liability company, association, group of persons, state, county, town, city, school district, or governmental subdivision.\n\"Executive officer of a corporation\" means any officer of a corporation elected or appointed in accordance with its charter or bylaws.\n(a) \"Family farm\" means any farm operation which pays or is obligated to pay cash wages, exclusive of machine hire, to farm laborers for services rendered during the preceding calendar year in an amount:\n(1) less than $8,000; or\n(2) less than the statewide average annual wage as described in subdivision 1b when the farm operation has total liability and medical payment coverage equal to $300,000 and $5,000, respectively, under a farm liability insurance policy, and the policy covers injuries to farm laborers.\n(b) For purposes of this subdivision, farm laborer does not include any spouse, parent or child, regardless of age, of a farmer employed by the farmer, or any executive officer of a family farm corporation as defined in section 500.24, subdivision 2, or any spouse, parent or child, regardless of age, of such an officer employed by that family farm corporation, or other farmers in the same community or members of their families exchanging work with the employer. Notwithstanding any law to the contrary, a farm laborer shall not be considered as an independent contractor for the purposes of this chapter; provided that a commercial baler or commercial thresher shall be considered an independent contractor.\n\"Farm laborer\" does not include an employee of a commercial thresher or commercial baler.\n\"Health care provider\" means a physician, podiatrist, chiropractor, dentist, optometrist, osteopathic physician, psychologist, psychiatric social worker, physician assistant, or any other person who furnishes a medical or health service to an employee under this chapter but does not include a qualified rehabilitation consultant or approved vendor.\n\"Household worker\" means one who is a domestic, repairer, groundskeeper, or maintenance worker in, for, or about a private home or household, but the term shall not include independent contractors nor shall it include persons performing labor for which they may elect workers' compensation coverage under section 176.041, subdivision 1a.\n\"Judge\" means a member of the Workers' Compensation Court of Appeals.\n[Repealed, 1987 c 49 s 20]\n\"Maximum medical improvement\" means the date after which no further significant recovery from or significant lasting improvement to a personal injury can reasonably be anticipated, based upon reasonable medical probability, irrespective and regardless of subjective complaints of pain. Except where an employee is medically unable to continue working under section 176.101, subdivision 1, paragraph (e), clause (2), once the date of maximum medical improvement has been determined, no further determinations of other dates of maximum medical improvement for that personal injury is permitted. The determination that an employee has reached maximum medical improvement shall not be rendered ineffective by the worsening of the employee's medical condition and recovery therefrom.\n\"Member\" includes leg, foot, toe, hand, finger, thumb, arm, back, eye, and ear when used with reference to the anatomy.\n(a) \"Occupational disease\" means a mental impairment as defined in paragraph (d) or physical disease arising out of and in the course of employment peculiar to the occupation in which the employee is engaged and due to causes in excess of the hazards ordinary of employment and shall include undulant fever. Physical stimulus resulting in mental injury and mental stimulus resulting in physical injury shall remain compensable. Mental impairment is not considered a disease if it results from a disciplinary action, work evaluation, job transfer, layoff, demotion, promotion, termination, retirement, or similar action taken in good faith by the employer. Ordinary diseases of life to which the general public is equally exposed outside of employment are not compensable, except where the diseases follow as an incident of an occupational disease, or where the exposure peculiar to the occupation makes the disease an occupational disease hazard. A disease arises out of the employment only if there be a direct causal connection between the conditions under which the work is performed and if the occupational disease follows as a natural incident of the work as a result of the exposure occasioned by the nature of the employment. An employer is not liable for compensation for any occupational disease which cannot be traced to the employment as a direct and proximate cause and is not recognized as a hazard characteristic of and peculiar to the trade, occupation, process, or employment or which results from a hazard to which the worker would have been equally exposed outside of the employment.\n(b) If immediately preceding the date of disablement or death, an employee was employed on active duty with an organized fire or police department of any municipality, as a member of the Minnesota State Patrol, conservation officer service, state crime bureau, as a forest officer by the Department of Natural Resources, correctional officer or security counselor employed by the state or a political subdivision at a corrections, detention, or secure treatment facility, or sheriff or full-time deputy sheriff of any county, and the disease is that of myocarditis, coronary sclerosis, pneumonia or its sequel, and at the time of employment such employee was given a thorough physical examination by a licensed doctor of medicine, and a written report thereof has been made and filed with such organized fire or police department, with the Minnesota State Patrol, conservation officer service, state crime bureau, Department of Natural Resources, Department of Corrections, or sheriff's department of any county, which examination and report negatived any evidence of myocarditis, coronary sclerosis, pneumonia or its sequel, the disease is presumptively an occupational disease and shall be presumed to have been due to the nature of employment. If immediately preceding the date of disablement or death, any individual who by nature of their position provides emergency medical care, or an employee who was employed as a licensed police officer under section 626.84, subdivision 1; firefighter; paramedic; correctional officer or security counselor employed by the state or a political subdivision at a corrections, detention, or secure treatment facility; emergency medical technician; or licensed nurse providing emergency medical care; and who contracts an infectious or communicable disease to which the employee was exposed in the course of employment outside of a hospital, then the disease is presumptively an occupational disease and shall be presumed to have been due to the nature of employment and the presumption may be rebutted by substantial factors brought by the employer or insurer. Any substantial factors which shall be used to rebut this presumption and which are known to the employer or insurer at the time of the denial of liability shall be communicated to the employee on the denial of liability.\n(c) A firefighter on active duty with an organized fire department who is unable to perform duties in the department by reason of a disabling cancer of a type caused by exposure to heat, radiation, or a known or suspected carcinogen, as defined by the International Agency for Research on Cancer, and the carcinogen is reasonably linked to the disabling cancer, is presumed to have an occupational disease under paragraph (a). If a firefighter who enters the service after August 1, 1988, is examined by a physician prior to being hired and the examination discloses the existence of a cancer of a type described in this paragraph, the firefighter is not entitled to the presumption unless a subsequent medical determination is made that the firefighter no longer has the cancer.\n(d) For the purposes of this chapter, \"mental impairment\" means a diagnosis of post-traumatic stress disorder by a licensed psychiatrist or psychologist. For the purposes of this chapter, \"post-traumatic stress disorder\" means the condition as described in the most recently published edition of the Diagnostic and Statistical Manual of Mental Disorders by the American Psychiatric Association. For purposes of section 79.34, subdivision 2, one or more compensable mental impairment claims arising out of a single event or occurrence shall constitute a single loss occurrence.\n(e) If, preceding the date of disablement or death, an employee who was employed on active duty as: a licensed police officer; a firefighter; a paramedic; an emergency medical technician; a licensed nurse employed to provide emergency medical services outside of a medical facility; a public safety dispatcher; a correctional officer or security counselor employed by the state or a political subdivision at a corrections, detention, or secure treatment facility; a sheriff or full-time deputy sheriff of any county; or a member of the Minnesota State Patrol is diagnosed with a mental impairment as defined in paragraph (d), and had not been diagnosed with the mental impairment previously, then the mental impairment is presumptively an occupational disease and shall be presumed to have been due to the nature of employment. This presumption may be rebutted by substantial factors brought by the employer or insurer. Any substantial factors that are used to rebut this presumption and that are known to the employer or insurer at the time of the denial of liability shall be communicated to the employee on the denial of liability. The mental impairment is not considered an occupational disease if it results from a disciplinary action, work evaluation, job transfer, layoff, demotion, promotion, termination, retirement, or similar action taken in good faith by the employer.\n\"Office\" means the Office of Administrative Hearings.\n\"Personal injury\" means any mental impairment as defined in subdivision 15, paragraph (d), or physical injury arising out of and in the course of employment and includes personal injury caused by occupational disease; but does not cover an employee except while engaged in, on, or about the premises where the employee's services require the employee's presence as a part of that service at the time of the injury and during the hours of that service. Where the employer regularly furnished transportation to employees to and from the place of employment, those employees are subject to this chapter while being so transported. Physical stimulus resulting in mental injury and mental stimulus resulting in physical injury shall remain compensable. Mental impairment is not considered a personal injury if it results from a disciplinary action, work evaluation, job transfer, layoff, demotion, promotion, termination, retirement, or similar action taken in good faith by the employer. Personal injury does not include an injury caused by the act of a third person or fellow employee intended to injure the employee because of personal reasons, and not directed against the employee as an employee, or because of the employment. An injury or disease resulting from a vaccine in response to a declaration by the Secretary of the United States Department of Health and Human Services under the Public Health Service Act to address an actual or potential health risk related to the employee's employment is an injury or disease arising out of and in the course of employment.\n\"Physician\" means one authorized by law to practice the medical profession within one of the United States and in good standing in the profession, and includes surgeon.\n\"Retraining\" means a formal course of study in a school setting which is designed to train an employee to return to suitable gainful employment.\n\"Relative value fee schedule\" means the medical fee schedule adopted by rule under section 176.136, subdivision 1a, using the Physician Fee Schedule tables adopted for the federal Medicare program.\n\"Weekly wage\" is arrived at by multiplying the daily wage by the number of days and fractional days normally worked in the business of the employer for the employment involved. If the employee normally works less than five days per week or works an irregular number of days per week, the number of days normally worked shall be computed by dividing the total number of days in which the employee actually performed any of the duties of employment in the last 26 weeks by the number of weeks in which the employee actually performed such duties, provided that the weekly wage for part time employment during a period of seasonal or temporary layoff shall be computed on the number of days and fractional days normally worked in the business of the employer for the employment involved. If, at the time of the injury, the employee was regularly employed by two or more employers, the employee's days of work for all such employments shall be included in the computation of weekly wage. An employee injured while engaged in agricultural employment fewer than 30 days in a calendar year, and who is regularly employed by two or more employers, shall have their average weekly wage calculated based on the agricultural wages at five times the employee's daily wage, or based only on the employee's other employment, whichever is higher. Occasional overtime is not to be considered in computing the weekly wage, but if overtime is regular or frequent throughout the year it shall be taken into consideration. The maximum weekly compensation payable to an employee, or to the employee's dependents in the event of death, shall not exceed 66-2/3 percent of the product of the daily wage times the number of days normally worked, provided that the compensation payable for permanent partial disability under section 176.101, subdivision 2a, and for permanent total disability under section 176.101, subdivision 4, or death under section 176.111, shall not be computed on less than the number of hours normally worked in the employment or industry in which the injury was sustained, subject also to such maximums as are specifically otherwise provided.\n\"Worker\" means employee.\nMS 2006 [Renumbered subd 1b]\nMS 2006 [Renumbered subd 12b]\nMS 2006 [Renumbered subd 2a]\nMS 2006 [Renumbered subd 17a]\nMS 2006 [Renumbered subd 12a]\nMS 2006 [Renumbered subd 13a]\n[Repealed, 1995 c 231 art 1 s 36; art 2 s 110]\nMS 2006 [Renumbered subd 1a]",
	"repealed": false
}