{
	"id": "296A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.08",
	"title": "296A.08 SPECIAL FUEL TAX.",
	"text": "(a) There is imposed an excise tax on all special fuel at the rates specified in subdivision 2. For purposes of this section, \"owner or operator\" means the operation of licensed motor vehicles, whether loaded or empty, whether for compensation or not for compensation, and whether owned by or leased to the motor carrier who operates them or causes them to be operated.\n(b) For undyed diesel fuel and undyed kerosene, the tax is imposed on the first licensed distributor who received the product in Minnesota.\n(c) For dyed fuel being used illegally in a licensed motor vehicle, the tax is imposed on the owner or operator of the motor vehicle.\n(d) For dyed fuel used in a motor vehicle but subject to a federal exemption, although no federal tax may be imposed, the owner or operator of the vehicle is liable for the state tax.\n(e) For other fuels, including jet fuel, propane, and compressed natural gas, the tax is imposed on the distributor, special fuel dealer, or bulk purchaser.\n(f) Any person delivering special fuel on which the excise tax has not previously been paid, into the supply tank of an aircraft or a licensed motor vehicle shall report such delivery and shall pay, or collect and pay the excise tax on the special fuel so delivered to the commissioner.\n(a) Subject to paragraph (b), the special fuel excise tax is imposed at the following rates:\n(1) liquefied petroleum gas or propane is taxed at the rate of 18.75 cents per gallon;\n(2) liquefied natural gas is taxed at the rate of 15 cents per gallon;\n(3) compressed natural gas is taxed at the rate of $1.974 per thousand cubic feet or 25 cents per gasoline equivalent; and\n(4) all other special fuel is taxed at the same rate as the gasoline excise tax as specified in section 296A.07, subdivision 2.\n(b) Annually on August 1, the commissioner must determine the tax rate applicable to the sale of E85, M85, and all other gasoline subject to tax under this section for the upcoming 12-month period beginning on January 1. The rate must be adjusted as provided in section 296A.07, subdivision 3, paragraph (b). The tax rate must be rounded to the nearest tenth of a cent. Each of the tax rates for liquefied natural gas or propane, liquefied natural gas, compressed natural gas, and all other special fuel must not be lower than the respective rates specified in paragraph (a).\n(c) The tax is payable in the form and manner prescribed by the commissioner.\n(d) For purposes of this subdivision, \"gasoline equivalent,\" as defined by the National Conference on Weights and Measures, is 5.66 pounds of natural gas or 126.67 cubic feet.\nThe provisions of subdivisions 1 and 2 do not apply to special fuel or alternative fuels purchased by:\n(1) a transit system or transit provider receiving financial assistance or reimbursement under section 174.24, 256B.0625, subdivision 17, or 473.384;\n(2) providers of transportation to recipients of medical assistance home and community-based services waivers enrolled in day programs, including adult day care, family adult day care, day treatment and habilitation, prevocational services, and structured day services;\n(3) an ambulance service licensed under chapter 144E;\n(4) providers of medical or dental services by a federally qualified health center, as defined under title 19 of the Social Security Act, as amended by Section 4161 of the Omnibus Budget Reconciliation Act of 1990, with a motor vehicle used exclusively as a mobile medical unit; or\n(5) a licensed distributor to be delivered to a terminal for use in blending.\nIf it is determined by the commissioner from an examination of any records pertaining to the operation of any licensed motor vehicle which uses special fuel, that the special fuel tax on the special fuel used in this state has not been paid to this state, or to any other state if purchased in such other state, there is hereby imposed an excise tax at the same rate per gallon as the gasoline tax, on all such special fuel. All assessments of tax made under this subdivision shall be paid by the user to the commissioner upon demand. For purposes of this subdivision, \"special fuel\" means any fuel other than gasoline used in a licensed motor vehicle in this state.\nAll special fuel except that used for aviation fuel shall be deemed to be intended for use in a licensed motor vehicle in this state at the time of sale or delivery.\nIf adequate records are not kept, or if the sales are not adequately accounted for, then all sales of combustible gases and liquid petroleum products, except gasoline, are deemed to be sales of special fuel. In such cases, there is imposed an excise tax of the same rate per gallon as the gasoline excise tax on all such products, and the vendor is liable for the tax.",
	"repealed": false
}