{
	"id": "62D.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.12",
	"title": "62D.12 PROHIBITED PRACTICES.",
	"text": "No health maintenance organization or representative thereof may cause or knowingly permit the use of advertising or solicitation which is untrue or misleading, or any form of evidence of coverage which is deceptive. Each health maintenance organization shall be subject to sections 72A.17 to 72A.32, relating to the regulation of trade practices, except (a) to the extent that the nature of a health maintenance organization renders such sections clearly inappropriate and (b) that enforcement shall be by the commissioner of health and not by the commissioner of commerce. Every health maintenance organization shall be subject to sections 8.31 and 325F.69.\nNotwithstanding subdivision 1, nothing in sections 62A.049, 62A.60, and 72A.201, subdivision 4a, applies to a commercial health policy issued under this chapter as a companion to a health maintenance contract.\nNo health maintenance organization may cancel or fail to renew the coverage of an enrollee except for (1) failure to pay the charge for health care coverage; (2) termination of the health care plan; (3) termination of the group plan; (4) enrollee moving out of the area served, subject to section 62A.17, subdivisions 1 and 6, and section 62D.104; (5) enrollee moving out of an eligible group, subject to section 62A.17, subdivisions 1 and 6, and section 62D.104; (6) failure to make co-payments required by the health care plan; (7) fraud or misrepresentation by the enrollee with respect to eligibility for coverage or any other material fact; or (8) other reasons established in rules promulgated by the commissioner of health.\nEnrollees shall be given 30 days' notice of any cancellation or nonrenewal, except that enrollees who are eligible to receive replacement coverage under section 62D.121, subdivision 1, shall receive 90 days' notice as provided under section 62D.121, subdivision 5.\nNo health maintenance organization may use in its name, contracts, or literature any of the words \"insurance,\" \"casualty,\" \"surety,\" \"mutual,\" or any other words which are descriptive of the insurance, casualty or surety business or deceptively similar to the name or description of any insurance or surety corporation doing business in this state; provided, however, that when a health maintenance organization has contracted with an insurance company for any coverage permitted by sections 62D.01 to 62D.30, it may so state.\nNo health maintenance contract or evidence of coverage shall provide for the reimbursement of an enrollee other than through a policy of insurance, except as stated in this subdivision:\n(1) the health maintenance organization may refund payments made by or on behalf of an enrollee;\n(2) the health maintenance organization may make direct payments to enrollees or providers for obligations incurred for nonelective emergency or out-of-area services received.\nThe providers under agreement with a health maintenance organization to provide health care services shall not have recourse against enrollees or persons acting on their behalf for amounts above those specified in the evidence of coverage as co-payments for health care services. The health maintenance organization shall not have recourse against enrollees or persons acting on their behalf for amounts above those specified in the evidence of coverage as the periodic prepayment, or co-payment, for health care services. This subdivision applies but is not limited to the following events:\n(1) nonpayment by the health maintenance organization;\n(2) insolvency of the health maintenance organization; and\n(3) breach of the agreement between the health maintenance organization and the provider.\nThis subdivision does not limit a provider's ability to seek payment from any person other than the enrollee, the enrollee's guardian or conservator, the enrollee's immediate family members, or the enrollee's legal representative in the event of nonpayment by the health maintenance organization.\nThe rates charged by health maintenance organizations and their representatives shall not discriminate except in accordance with accepted actuarial principles.\n[Repealed, 1984 c 464 s 46]\nNo health maintenance organization shall discriminate in enrollment policy against any person solely by virtue of status as a recipient of medical assistance or Medicare.\nAll net earnings of a nonprofit health maintenance organization must be devoted to the nonprofit purposes of the health maintenance organization in providing comprehensive health care. A nonprofit health maintenance organization must not provide for the payment, whether directly or indirectly, of any part of its net earnings to any person for a purpose other than providing comprehensive health care, except that the health maintenance organization may make payments to providers or other persons based on the efficient provision of services or as incentives to provide quality care. The commissioner of health shall, pursuant to this chapter, revoke the certificate of authority of any nonprofit health maintenance organization in violation of this subdivision.\n[Repealed, 2017 c 2 art 2 s 19]\nAuthorized expenses of a health maintenance organization shall include:\n(1) cash rebates to enrollees, or to persons who have made payments on behalf of enrollees;\n(2) direct payments to enrollees or providers as provided in subdivision 4, clause (2);\n(3) free or reduced cost health service to enrollees;\n(4) payments to any organization or organizations selected by the health maintenance organization which are operated for charitable, educational, or religious or scientific purposes.\nA health maintenance organization shall not enter into an agreement with a hospital in which the hospital agrees to assume the financial risk for services provided by other facilities or providers not owned, operated, or otherwise subject to the control of the hospital assuming the financial risk.\nNo health maintenance contract or evidence of coverage entered into, issued, amended, renewed or delivered on or after January 1, 1976 shall contain any provision offsetting, or in any other manner reducing, any benefit to an enrollee or other beneficiary by the amount of, or in any proportion to, any increase in disability benefits received or receivable under the federal Social Security Act, as amended subsequent to the date of commencement of such benefit, the Railroad Retirement Act, any Veteran's Disability Compensation and Survivor Benefits Act, workers' compensation, or any similar federal or state law, as amended subsequent to the date of commencement of that benefit.\nAny health maintenance organization which includes coverage of comprehensive dental services in its comprehensive health maintenance services shall not include the charge for the dental services in the same rate as the charge for other comprehensive health maintenance services. The rates for dental services shall be computed, stated and bid separately. No employer shall be required to purchase dental services in combination with other comprehensive health services. An employer may purchase dental services separately.\n[Repealed, 1996 c 310 s 1]\nNo health maintenance organization offering an individual or group health maintenance contract shall refuse to provide or renew the coverage because the applicant or enrollee has an option to elect workers' compensation coverage pursuant to section 176.041.\nEach health maintenance organization shall establish a telephone number, which need not be toll free, that providers may call with questions about coverage, prior authorization, and approval of medical services. The telephone number must be staffed by an employee of the health maintenance organization during normal working hours during the normal work week. After normal working hours, the telephone number must be equipped with an answering machine and recorded message to allow the caller an opportunity to leave a message. The health maintenance organization must respond to questions within 24 hours after they are received, excluding weekends and holidays. At the request of a provider, the health maintenance organization shall provide a copy of the health maintenance contract for enrollees in the provider's service area.\nNo health maintenance organization may take retaliatory action against a provider solely on the grounds that the provider disseminated accurate information regarding coverage of benefits or accurate benefit limitations of an enrollee's contract or accurate interpreted provisions of the provider agreement that limit the prescribing, providing, or ordering of care.\n[Repealed, 1990 c 538 s 32]\nAny person receiving commissions for the sale of coverage or enrollment in a health plan, as defined in section 62A.011, offered by a health maintenance organization shall, before selling coverage or enrollment, disclose in writing to the prospective purchaser the amount of any commission or other compensation the person will receive as a direct result of the sale. The disclosure may be expressed in dollars or as a percentage of the premium. The amount disclosed need not include any anticipated renewal commissions.\nNo health maintenance organization shall fail to comply with the special reinstatement privilege provided under section 62A.04, subdivision 2, clause (4), for the Medicare-related coverage referred to in that clause.\nA health maintenance organization may not deny or limit coverage of a service which the enrollee has already received solely on the basis of lack of prior authorization or second opinion, to the extent that the service would otherwise have been covered under the member's contract by the health maintenance organization had prior authorization or second opinion been obtained. This subdivision expires December 31, 2025, for health plans offered, sold, issued, or renewed on or after that date.",
	"repealed": false
}