{
	"id": "17.4982",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4982",
	"title": "17.4982 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 17.4981 to 17.4998.\n\"Approved laboratory methods\" means methods described in the latest edition of the \"Procedures for the Detection and Identification of Certain Fish Pathogens\" published by the American Fisheries Society Fish Health Section known as the Fish Health Blue Book.\n\"Aquaculture therapeutics\" means drugs, medications, and disease control chemicals that are approved for aquaculture use by the United States Food and Drug Administration or the United States Environmental Protection Agency.\n\"Aquarium facilities\" means facilities that rear or hold private aquatic life for sale for aquarium or display purposes.\n\"Aquatic farm\" means a licensed facility used for hatching, raising, rearing, and culturing private aquatic life in waters and preparing aquatic life for sale, including, but not limited to, ponds, vats, tanks, raceways, and other indoor or outdoor facilities that an aquatic farmer owns or waters of which an aquatic farmer has the use.\n\"Aquatic life\" has the meaning given to \"private aquatic life\" in section 17.47, subdivision 7, and for purposes of commercial transactions, aquatic life is livestock.\n\"Certifiable diseases\" includes any of the following expressed as clinical symptoms or based on the presence of the pathogen: channel catfish virus, Renibacterium salmoninarum (bacterial kidney disease), Aeromonas salmonicida (bacterial furunculosis), Yersinia ruckeri (enteric redmouth disease), Edwardsiella ictaluri (enteric septicemia of catfish), infectious hematopoietic necrosis virus, infectious pancreatic necrosis virus, Myxobolus cerebralis (whirling disease), Tetracapsuloides bryosalmonae (proliferative kidney disease), viral hemorrhagic septicemia virus, epizootic epitheliotropic virus, Ceratomyxa shasta (ceratomyxosis), and any emergency fish disease.\n\"Commissioner\" means the commissioner of natural resources.\n\"Containment facility\" means a licensed facility for salmonids, catfish, or species on the VHS-susceptible-species list that complies with clauses (1), (3), and (4), or clauses (2), (3), and (4):\n(1) disinfects its effluent to the standards in section 17.4991 before the effluent is discharged to public waters;\n(2) does not discharge to public waters or to waters of the state directly connected to public waters;\n(3) raises aquatic life that is prohibited from being released into the wild and must be kept in a facility approved by the commissioner unless processed for food consumption;\n(4) contains aquatic life requiring a fish health inspection prior to transportation.\n\"Emergency enzootic disease area\" means an enzootic disease area that harbors an emergency fish disease. Trout, salmon, or catfish species are from an emergency enzootic disease area only if the individual species in question can carry one or more of the emergency fish disease pathogens present.\n\"Emergency fish disease\" means designated fish diseases or pathogens not already present in this state that could impact populations of aquatic life if inadvertently released by infected aquatic life, including channel catfish virus, viral hemorrhagic septicemia virus, infectious hematopoietic necrosis virus, infectious pancreatic necrosis virus, whirling disease, ceratomyxosis, proliferative kidney disease, and epizootic epitheliotropic virus disease.\n\"Enzootic disease area\" means an area with well-defined geographic boundaries which harbors one or more certifiable diseases pathogens.\n\"Fish collector\" means an individual who has been certified under section 17.4989 to oversee the collection of fish samples from a facility or a water body for disease testing by a certified laboratory.\n\"Fish Health Blue Book\" means the standardized set of procedures and guidelines established and published by the American Fisheries Society Fish Health Section for the detection and isolation of fish pathogens.\n(a) \"Fish health inspection\" means an on-site, statistically based sampling, collection, and testing of fish in accordance with processes in the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases, published by the International Office of Epizootics (OIE) to test for causative pathogens. The samples for inspection must be collected by a fish health inspector or a fish collector in cooperation with the producer. Testing of samples must be done by an approved laboratory.\n(b) The inspection for viral hemorrhagic septicemia (VHS), infectious pancreatic necrosis (IPN), and infectious hematopoietic necrosis (IHN) in salmonids and for VHS in nonsalmonids must include at a minimum viral testing of ovarian fluids at the 95 percent confidence level of detecting two percent incidence of disease.\n(c) The inspection for certifiable diseases and pathogens for wild fish must follow the guidelines of the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases.\n\"Fish health inspector\" means an individual certified as a fish health inspector or an aquatic animal health inspector by the American Fisheries Society or state, federal, or provincial resource management agency, except that a certification may not be made by an inspector who has a conflict of interest in connection with the outcome of the certification.\n\"Game fish\" has the meaning given in section 97A.015, subdivision 25, except that green or orange spotted sunfish are not game fish for purposes of determining fish of significant public value.\n\"Intensive culture\" means the rearing of fish at densities greater than can be supported in the natural environment.\n\"Licensed facility\" means a licensed aquatic farm, including all licensed waters.\n\"Lot\" means a group of fish of the same species and age that originated from the same discrete spawning population and that always have shared a common water supply, or various age groups of adult brood stock of the same species that have shared the same containers for one brood cycle.\n\"Minnows\" has the meaning given in section 97A.015, subdivision 29, except the 12-inch restriction on sucker minnows does not apply.\n\"Nonindigenous species\" means a species of fish or other aquatic life that is:\n(1) not known to have been historically present in the state;\n(2) not known to be naturally occurring in a particular part of the state; or\n(3) designated by rule as a prohibited or regulated invasive species.\n\"Nonindigenous strain\" means a species of fish or other aquatic life that:\n(1) has an original source outside of this state and contiguous states;\n(2) is an unnaturally occurring hybrid or genetically engineered species; or\n(3) in areas north of marked State Highway 210, is a walleye, the original source of which is from south of marked State Highway 210 or from outside the state.\n\"Processing\" means rendering a species of aquatic life for food, bait, or other purposes so that it is no longer alive.\n\"Public waters\" has the meaning given in section 103G.005, subdivision 15.\n\"Quarantine facility\" means a culture system that is enclosed in a building and is separated from other fish culture facilities where fish can be isolated and maintained while preventing their introduction and pathogen introduction into the environment.\n\"Saltwater aquaculture\" means the commercial propagation and rearing of saltwater aquatic life primarily for consumption as human food.\n\"Saltwater aquatic farm\" means a facility used for saltwater aquaculture including but not limited to artificial ponds, vats, tanks, raceways, and other facilities that an aquatic farmer owns or has exclusive control of for the sole purpose of producing saltwater aquatic life.\n\"Saltwater aquatic life\" means aquatic species that are saltwater obligates or perform optimally when raised in salinities closer to that of natural seawater and need saltwater to survive. Saltwater aquatic life includes but is not limited to crustaceans.\n\"Standard facility\" means a licensed facility that is not a quarantine or containment facility.\n\"VHS-susceptible species\" are aquatic species that are natural hosts for viral hemorrhagic septicemia according to the Fish Health Blue Book or the book's successor.\n\"VHS-susceptible-species list\" is the VHS-susceptible species listed in the Fish Health Blue Book that are found in or that can survive in the Great Lakes region.\n\"Waters of the state\" has the meaning given in section 103G.005, subdivision 17.",
	"repealed": false
}