{
	"id": "504B.365",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.365",
	"title": "504B.365 EXECUTION OF THE WRIT OF RECOVERY OF PREMISES AND ORDER TO VACATE.",
	"text": "(a) The officer who holds the order to vacate shall execute it by demanding that the defendant, if found in the county, any adult member of the defendant's family who is occupying the premises, or any other person in charge, relinquish possession and leave, taking family and all personal property from the premises within 24 hours.\n(b) If the defendant fails to comply with the demand, then the officer shall bring, if necessary, the force of the county and any necessary assistance, at the cost of the plaintiff. The officer shall remove the defendant, family, and all personal property from the premises and place the plaintiff in possession.\n(c) If the defendant cannot be found in the county, and there is no person in charge of the premises, then the officer shall enter the premises, breaking in if necessary, and remove and store the personal property of the defendant at a place designated by the plaintiff as provided in subdivision 3.\n(d) The order may also be executed by a licensed police officer or community crime prevention licensed police officer.\nAn officer shall give priority to the execution, under this section, of any order to vacate that is based on an eviction action under section 504B.171, or on the basis that the defendant is causing a nuisance or seriously endangers the safety of other residents, their property, or the plaintiff's property.\n(a) If the defendant's personal property is to be stored in a place other than the premises, the officer shall remove all personal property of the defendant at the expense of the plaintiff.\n(b) The defendant must make immediate payment for all expenses of removing personal property from the premises. If the defendant fails or refuses to do so, the plaintiff has a lien on all the personal property for the reasonable costs and expenses incurred in removing, caring for, storing, and transporting it to a suitable storage place.\n(c) The plaintiff may enforce the lien by detaining the personal property until paid. If no payment has been made for 60 days after the execution of the order to vacate, the plaintiff may hold a public sale as provided in sections 514.18 to 514.22.\n(d) If the defendant's personal property is to be stored on the premises, the officer shall enter the premises, breaking in if necessary, and the plaintiff may remove the defendant's personal property. Section 504B.271 applies to personal property removed under this paragraph. The plaintiff must prepare an inventory and mail a copy of the inventory to the defendant's last known address or, if the defendant has provided a different address, to the address provided. The inventory must be prepared, signed, and dated in the presence of the officer and must include the following:\n(1) a list of the items of personal property and a description of their condition;\n(2) the date, the signature of the plaintiff or the plaintiff's agent, and the name and telephone number of a person authorized to release the personal property; and\n(3) the name and badge number of the officer.\n(e) The officer must retain a copy of the inventory.\n(f) The plaintiff is responsible for the proper removal, storage, and care of the defendant's personal property and is liable for damages for loss of or injury to it caused by the plaintiff's failure to exercise the same care that a reasonably careful person would exercise under similar circumstances.\n(g) The plaintiff shall notify the defendant of the date and approximate time the officer is scheduled to remove the defendant, family, and personal property from the premises. The notice must be sent by first class mail. In addition, the plaintiff must make a good faith effort to notify the defendant by telephone. The notice must be mailed as soon as the information regarding the date and approximate time the officer is scheduled to enforce the order is known to the plaintiff, except that the scheduling of the officer to enforce the order need not be delayed because of the notice requirement. The notice must inform the defendant that the defendant and the defendant's personal property will be removed from the premises if the defendant has not vacated the premises by the time specified in the notice.\nThe court hearing the eviction action shall retain jurisdiction in matters relating to removal of personal property under this section. If the plaintiff refuses to return the property after proper demand is made as provided in section 504B.271, the court shall enter an order requiring the plaintiff to return the property to the defendant and awarding reasonable expenses including attorney fees to the defendant.\nUnless the premises has been abandoned, a plaintiff, an agent, or other person acting under the plaintiff's direction or control who enters the premises and removes the defendant's personal property in violation of this section is guilty of an unlawful ouster under section 504B.231 and is subject to penalty under section 504B.225. This section may not be waived or modified by lease or other agreement.",
	"repealed": false
}