{
	"id": "617.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.245",
	"title": "617.245 CIVIL ACTION; USE OF MINOR IN SEXUAL PERFORMANCE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Minor\" means any person who, at the time of use in a sexual performance, is under the age of 16.\n(c) \"Promote\" means to produce, direct, publish, manufacture, issue, or advertise.\n(d) \"Sexual performance\" means any play, dance, or other exhibition presented before an audience or for purposes of visual or mechanical reproduction which depicts sexual conduct as defined by paragraph (e).\n(e) \"Sexual conduct\" means any of the following if the depiction involves a minor:\n(1) an act of sexual intercourse, actual or simulated, including genital-genital, anal-genital, or oral-genital intercourse, whether between human beings or between a human being and an animal;\n(2) sadomasochistic abuse, meaning flagellation, torture, or similar demeaning acts inflicted by or upon a minor who is nude, or the condition of being fettered, bound, or otherwise physically restrained on the part of one so unclothed;\n(3) masturbation or lewd exhibitions of the genitals; and\n(4) physical contact or simulated physical contact with the unclothed pubic areas or buttocks of a human male or female, or the breasts of the female, whether alone or between members of the same or opposite sex or between humans and animals in an act of apparent sexual stimulation or gratification.\nA cause of action exists for injury caused by the use of a minor in a sexual performance. The cause of action exists against a person who promotes, employs, uses, or permits a minor to engage or assist others to engage in posing or modeling alone or with others in a sexual performance, if the person knows or has reason to know that the conduct intended is a sexual performance.\nA person found liable for injuries under this section is liable to the minor for damages.\nNeither consent to sexual performance by the minor or by the minor's parent, guardian, or custodian, or mistake as to the minor's age is a defense to the action.\nAn action for damages under this section must be commenced within six years of the time the plaintiff knew or had reason to know injury was caused by plaintiff's use as a minor in a sexual performance. The knowledge of a parent, guardian, or custodian may not be imputed to the minor. This section does not affect the suspension of the statute of limitations during a period of disability under section 541.15.",
	"repealed": false
}