{
	"id": "253D.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.32",
	"title": "253D.32 SCOPE OF COMMUNITY NOTIFICATION.",
	"text": "Notification of the public and disclosure of information under section 244.052, subdivision 4, regarding an individual who was committed under this chapter or Minnesota Statutes 1992, section 526.10, is as provided under section 244.052, subdivision 4, paragraphs (b), clause (3), and (g), and subdivision 4b, regardless of the individual's assigned risk level. The restrictions under section 244.052, subdivision 4, paragraph (b), clause (3), placed on disclosing information on individuals living in residential facilities do not apply to persons committed under this section or Minnesota Statutes 1992, section 526.10. The local law enforcement agency may proceed with the broadest disclosure authorized under section 244.052, subdivision 4.\n(a) After four years from the date of an order for provisional discharge or discharge of civil commitment, the individual may petition the executive director to have the scope of notification and disclosure based solely upon the individual's assigned risk level under section 244.052.\n(b) If an individual's provisional discharge is revoked for any reason, the four-year time period under paragraph (a) starts over from the date of a subsequent order for provisional discharge or discharge except that the executive director may, in that person's sole discretion, determine that the individual may petition before four years have elapsed from the date of the order of the subsequent provisional discharge or discharge and notify the individual of that determination.\n(c) The executive director shall appoint a multidisciplinary committee to review and make a recommendation on a petition made under paragraph (a). The executive director may grant or deny the petition. There is no review or appeal of the decision. If a petition is denied, the individual may petition again after two years from the date of denial.\n(d) Nothing in this chapter shall be construed to give an individual an affirmative right to petition the executive director earlier than four years after the date of an order for provisional discharge or discharge.\nThe executive director shall act in place of the individual's corrections agent for the purpose of section 244.052, subdivision 3, paragraph (h), when the individual is not assigned to a corrections agent.",
	"repealed": false
}