{
	"id": "173.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.265",
	"title": "173.265 OUTDOOR ADVERTISING DEVICES; REMOVAL; MAINTENANCE.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Destroyed\" means that more than 50 percent of a nonconforming outdoor advertising device's upright supports are physically damaged to a degree that normal repair practices would require replacement of broken wooden supports or replacement of broken, bent, or twisted supports for metal sign structures.\n(c) \"Reasonable repair and maintenance\" means customary maintenance and change of a sign's copy or message, and includes replacement of existing light fixtures with energy efficient fixtures or installation of other energy efficiency improvements. Reasonable repair and maintenance does not include:\n(1) the addition of illumination;\n(2) repair, reinstallation, erection, or maintenance for outdoor advertising devices that are destroyed, as defined under paragraph (b);\n(3) enlarging the nonconforming device;\n(4) changing the device from a wood structure to a steel or concrete structure; or\n(5) any change that would terminate nonconforming status.\n(d) \"Substantial change\" means any action that does not constitute reasonable repair and maintenance.\nThis section applies only to outdoor advertising devices subject to state and federal regulation under United States Code, title 23, section 131, and any regulations adopted under that law.\nThe department may remove a destroyed, abandoned, or discontinued outdoor advertising device, subject to the limitations provided under this chapter.\n(a) The owner of an outdoor advertising device may perform reasonable repair and maintenance on any device, provided the device is not destroyed.\n(b) Any action not constituting reasonable repair and maintenance will subject the outdoor advertising device to immediate removal under subdivision 3.\nSubstantial changes to outdoor advertising devices are prohibited. A substantial change to a nonconforming outdoor advertising device will subject the sign to immediate removal under subdivision 3.",
	"repealed": false
}