{
	"id": "363A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.12",
	"title": "363A.12 PUBLIC SERVICES.",
	"text": "It is an unfair discriminatory practice to discriminate against any person in the access to, admission to, full utilization of or benefit from any public service because of race, color, creed, religion, national origin, disability, sex, gender identity, sexual orientation, or status with regard to public assistance or to fail to ensure physical and program access for disabled persons unless the public service can demonstrate that providing the access would impose an undue hardship on its operation. In determining whether providing physical and program access would impose an undue hardship, factors to be considered include:\n(1) the type and purpose of the public service's operation;\n(2) the nature and cost of the needed accommodation;\n(3) documented good faith efforts to explore less restrictive or less expensive alternatives; and\n(4) the extent of consultation with knowledgeable disabled persons and organizations.\nPhysical and program access must be accomplished within six months of June 7, 1983, except for needed architectural modifications, which must be made within two years of June 7, 1983.\nIt is an unfair discriminatory practice for public transit services to discriminate in the access to, full utilization of, or benefit from service because of a person's disability. Public transit services may use any of a variety of methods to provide transportation for disabled people, provided that persons who are disabled are offered transportation that, in relation to the transportation offered nondisabled persons, is:\n(1) in a similar geographic area of operation. To the extent that the transportation provided disabled people is not provided in the same geographic area of operation as that provided nondisabled people, priority must be given to those areas which contain the largest percent of disabled riders. A public transit service may not fail to provide transportation to disabled persons in a geographic area for which it provides service to nondisabled persons if doing so will exclude a sizable portion of the disabled ridership;\n(2) during similar hours of operation;\n(3) for comparable fares;\n(4) with similar or no restrictions as to trip purpose; and\n(5) with reasonable response time.\nPublic transit services must meet these five criteria for the provision of transit services within three years of June 7, 1983.\nIt is an unfair discriminatory practice for a public service that operates a fixed route system to:\n(1) purchase or lease a new bus or vehicle for use on the system if the bus or vehicle is not readily accessible to and usable by individuals with disabilities, including individuals who use wheelchairs;\n(2) purchase or lease a used bus or vehicle for use on its system unless the public service makes a demonstrated good faith effort to purchase or lease a used bus or vehicle for use on the system that is accessible to and usable by individuals with disabilities, including individuals who use wheelchairs; or\n(3) purchase or lease remanufactured buses or vehicles, or to remanufacture buses or vehicles for use on its system, if the bus or vehicle has been remanufactured to extend its usable life by five years or more, unless after the remanufacture, the bus or vehicle is, to the maximum extent feasible, readily accessible to and usable by persons with disabilities, including individuals who use wheelchairs. If a public service operates a fixed route system, any segment of which is included on the National or State Register of Historic Places, and if making a vehicle of historic character to be used solely on that segment readily accessible to and usable by individuals with disabilities would significantly alter the historic character of the vehicle, the public service shall make whatever modifications are possible while retaining the historic character of the vehicle.\nIt is an unfair discriminatory practice for a public service operating a demand responsive system to purchase or lease new, used, or remanufactured vehicles that are not readily accessible to and usable by individuals with disabilities, including individuals who use wheelchairs, unless the system, when viewed in its entirety, provides a level of service to such individuals equivalent to the level of service provided to individuals without disabilities who use the fixed route system or demand responsive system, or for a light or rapid rail public transportation system offering intercity or commuter rail services to purchase or lease new, used, or remanufactured railroad cars, including single- and bi-level dining cars, sleeping cars, coach cars, lounge cars, restroom cars, and food service cars, unless all the cars, to the maximum extent feasible, are readily accessible to and usable by individuals with disabilities, including individuals who use wheelchairs.\nWith respect to the remanufacture of a vehicle or railroad car which is to be used on a segment of a light or rapid rail system which is included on the State or National Register of Historic Places, if making the vehicle readily accessible to and usable by individuals with disabilities would significantly alter the historic character of the vehicle, the public service that operates the system only has to make, or purchase or lease a remanufactured vehicle with, those modifications that do not significantly alter the historic character of the vehicle.\nIt is an unfair discriminatory practice to construct a new facility or station to be used in the provision of public transportation services, including intercity and commuter light and rapid rail transportation, unless the facility or station is readily accessible to and usable by individuals with disabilities, including individuals who use wheelchairs, or for a facility or station currently used for the provision of public transportation services covered by this subdivision, to fail to make alterations necessary in order, to the maximum extent feasible, to make the altered portions of the facilities or stations, including restrooms, passenger platforms and waiting or ticketing areas, publicly owned concessions areas, and drinking fountains and public telephones, accessible to and usable by individuals with disabilities, including individuals who use wheelchairs.\nIf a public service can demonstrate that the provision of paratransit and other transportation services otherwise required under this section would impose an undue financial burden on the public service, the public service is only required to provide services to the extent that providing those services would not impose such a burden.\nNothing in this section may be construed to prevent a public service from providing paratransit services or other special transportation services at a level greater than that required by this section, providing additional paratransit services to those required under this section or extending those services to additional individuals not covered under this section.",
	"repealed": false
}