{
	"id": "354.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.091",
	"title": "354.091 SERVICE CREDIT.",
	"text": "For purposes of this section, \"monthly base salary\" means the annual base salary, as defined in section 354.05, subdivision 41, divided by 12.\nNo teacher may receive credit for more than one year of teaching service for any fiscal year.\n(a) Except as specified in subdivisions 4 and 5, service credit must be calculated monthly by dividing the teacher's monthly salary by the monthly base salary for the teacher's employing unit and multiplying the result by 11.1 percent.\n(b) For purposes of computing service credit, salary must be allocated to each calendar month based on the pay period begin and end dates. If the pay period covers more than one calendar month, the salary must be allocated based on the number of days in each calendar month.\n(c) A teacher may not receive more than 11.1 percent of a year's service credit in a calendar month.\n(d) Annual service credit must be calculated by adding the allowable monthly service credit for all 12 months of the fiscal year, with the result rounded to two decimal places, subject to the annual limit specified in subdivision 2.\nFor all services rendered on or after July 1, 2003, service credit for all members employed by the Minnesota State Colleges and Universities system must be determined:\n(1) for full-time employees, by the definition of full-time employment contained in the collective bargaining agreement for those units listed in section 179A.10, subdivision 2, or contained in the applicable personnel or salary plan for those positions designated in section 179A.10, subdivision 1; and\n(2) for part-time employees, by the appropriate proration of full-time equivalency based on the provisions contained in the collective bargaining agreement for those units listed in section 179A.10, subdivision 2, or contained in the applicable personnel or salary plan for those positions designated in section 179A.10, subdivision 1, and the applicable procedures of the Minnesota State Colleges and Universities system.\nFor employer units that have nontraditional work schedules or pay schedules, the procedure for determining service credit must be specified by the executive director with the approval of the board of trustees.",
	"repealed": false
}