{
	"id": "127A.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.48",
	"title": "127A.48 ADJUSTMENT OF NET TAX CAPACITY.",
	"text": "MS 2012 [Renumbered 273.1325, subdivision 1]\nMS 2012 [Renumbered 273.1325, subd 2]\nMS 2012 [Renumbered 273.1325, subd 3]\nMS 2012 [Renumbered 273.1325, subd 4]\nMS 2012 [Renumbered 273.1325, subd 5]\nMS 2012 [Renumbered 273.1325, subd 6]\nIn the calculation of adjusted net tax capacities for 1987 and each year thereafter, the commissioner of revenue shall not increase the adjusted net tax capacity of taxable property for any district over the adjusted net tax capacity established and filed with the commissioner for the immediately preceding year by more than the greater of (1) 19 percent of the certified adjusted net tax capacity established and filed with the commissioner of education for the year immediately preceding, or (2) 40 percent of the difference between the district's total adjusted net tax capacity for the current year calculated without the application of this subdivision and the district's certified adjusted net tax capacity established and filed with the commissioner for the immediately preceding year.\nIf in any year the net tax capacity of iron ore property, as defined in section 273.13, subdivision 31, in any district is less than the net tax capacity of such property in the preceding year, the commissioner of revenue shall redetermine for all purposes the adjusted net tax capacity of the preceding year taking into account only the decrease in net tax capacity of iron ore property as defined in section 273.13, subdivision 31. If subdivision 7, clause (1), is applicable to the district, the decrease in iron ore property shall be applied to the adjusted net tax capacity as limited therein. In all other respects, the provisions of clause (1) shall apply.\n[Repealed, 2016 c 158 art 1 s 215]\nIf a district, within 30 days after receipt of a copy of a report filed with the commissioner made pursuant to subdivisions 1 to 6 or 8, is of the opinion that the commissioner of revenue has made an error in the determination of the district's market value, it may appeal from the report or portion thereof relating to the district to the commissioner of revenue for a review and determination of the matters contained in the appeal. The commissioner of revenue shall advise the district of the determination within 30 days. If the district wishes to appeal the determination of the commissioner of revenue, it must file a notice of appeal with the Tax Court, as provided in subdivisions 11 to 16 within ten days of the notice of determination from the commissioner of revenue.\nThe district must file with the court administrator of the Tax Court a notice of appeal from the determination of the commissioner of revenue fixing the market value of the district, and such notice must show the basis of the alleged error. A copy of the notice of appeal must be served upon the commissioner of revenue, and proof of service must be filed with the court administrator.\nUpon receipt of the notice of appeal the Tax Court must review the notice of appeal and determine whether it appears from the allegations and proofs therein contained that an error has been made in the determination by the commissioner of revenue of the market value of the property in the school district. If the court finds it probable that such an error has been made, it must notice the matter for hearing; otherwise, it must dismiss the appeal and notify the parties thereof. Hearings must be set and held in the same manner as other hearings of the Tax Court are set and heard, except that an appeal filed under subdivision 10 must take precedence over other appeals pending before the court. The attorney general shall represent the commissioner of revenue. The Administrative Procedure Act, sections 14.09 to 14.28, 14.38, 14.44 to 14.45, and 14.57 to 14.69, shall apply to hearings insofar as it is applicable.\nThe Tax Court shall hear, consider, and determine such appeal, de novo upon the issues made by the notice of appeal, if a hearing has been granted thereon. At the conclusion of the hearing, the court must: (1) file findings of fact, or (2) refer the issues to the commissioner of revenue with instructions and recommendations for a determination and correction of the market value of the appealing district. The decision of the Tax Court, if it decides the matter de novo, shall have the same force and effect as a determination by the commissioner of revenue in the first instance under this section, and the commissioner of revenue must be notified thereof. If the matter is rereferred to the commissioner of revenue, a redetermination by the commissioner of revenue in accordance with the recommendations of the Tax Court must likewise have the same force and effect as a determination by it in the first instance under this section.\nIn addition to the powers and duties of the Tax Court as prescribed by chapter 271, any hearing ordered pursuant to this section may be heard by a hearing examiner in lieu of one or more judges of the Tax Court. If a hearing is conducted by a hearing examiner, such hearing examiner shall exercise the same powers conferred by law upon one or more judges of the Tax Court. The hearing examiner shall report to the court. The court is authorized to make findings of fact based on the report of the hearing examiner in the same manner as is required by these provisions when the hearing is conducted by the court. The Tax Court may employ hearing examiners upon such terms and conditions as it shall prescribe. A hearing examiner so appointed shall be in the unclassified service of the state.\nA decision of the Tax Court pursuant to the terms hereof shall be final and shall not be subject to review by any court, except upon certiorari to the supreme court.\nDuring the pendency of any appeal from the commissioner of revenue evaluation, state aids to the appealing district must be paid on the basis of the evaluation subject to adjustment upon final determination of the appeal.",
	"repealed": false
}