{
	"id": "469.318",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.318",
	"title": "469.318 JOBS CREDIT.",
	"text": "A qualified business is allowed a credit against the taxes imposed under chapter 290. The credit equals seven percent of the:\n(1) lesser of:\n(i) zone payroll for the taxable year, less the zone payroll for the base year; or\n(ii) total Minnesota payroll for the taxable year, less total Minnesota payroll for the base year; minus\n(2) $30,000 multiplied by (the number of full-time equivalent employees that the qualified business employs in the job opportunity building zone for the taxable year, minus the number of full-time equivalent employees the business employed in the zone in the base year, but not less than zero).\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Base year\" means the taxable year beginning during the calendar year prior to the calendar year in which the zone designation took effect.\n(c) \"Full-time equivalent employees\" means the equivalent of annualized expected hours of work equal to 2,080 hours.\n(d) \"Minnesota payroll\" means the wages or salaries attributed to Minnesota under section 290.191, subdivision 12, for the qualified business or the unitary business of which the qualified business is a part, whichever is greater.\n(e) \"Zone payroll\" means wages or salaries used to determine the zone payroll factor for the qualified business, less the amount of compensation attributable to any employee that exceeds $100,000.\nFor taxable years beginning after December 31, 2004, the dollar amounts in subdivision 1, clause (2), and subdivision 2, paragraph (e), are annually adjusted for inflation. The commissioner of revenue shall adjust the amounts by the percentage determined under section 290.06, subdivision 2d, for the taxable year.\nIf the amount of the credit exceeds the liability for tax under chapter 290, the commissioner of revenue shall refund the excess to the qualified business.\nAn amount sufficient to pay the refunds authorized by this section is appropriated to the commissioner of revenue from the general fund.",
	"repealed": false
}