{
	"id": "204D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.11",
	"title": "204D.11 STATE GENERAL ELECTION BALLOTS; CANDIDATES; OFFICIAL IN CHARGE; RULES.",
	"text": "The names of the candidates for all state and federal offices, all proposed constitutional amendments, all county offices and questions, and all judicial offices voted on at the state general election shall be placed on a single ballot that shall be known as the \"state general election ballot.\" This ballot shall be prepared by the county auditor subject to the rules of the secretary of state. The secretary of state shall adopt rules for preparation and time of delivery of the state general election ballot.\n[Repealed, 2013 c 131 art 2 s 85]\n[Repealed, 2013 c 131 art 2 s 85]\n(a) The names of all candidates for the offices of president and vice-president of the United States and senator and representative in Congress shall be placed on a ballot that shall be known as the \"special federal ballot.\"\n(b) This ballot shall be prepared by the county auditor in the same manner as the state general election ballot and shall be subject to the rules adopted by the secretary of state pursuant to subdivision 1. This ballot must be prepared and furnished in accordance with the federal Uniformed and Overseas Citizens Absentee Voting Act, United States Code, title 52, sections 20301 to 20310.\n(c) The special federal ballot shall be the only ballot sent to citizens of the United States who are eligible to vote by absentee ballot for federal candidates in Minnesota.\nThe ballot containing the offices and questions in subdivisions 1 and 4 shall be headed with the words \"State General Election Ballot.\"\nWhen it would not be possible to place all offices on a single ballot card for the state general election, the judicial offices may be placed instead on a separate judicial ballot. The judicial ballot shall be prepared by the county auditor in the manner provided in the rules of the secretary of state.\nThe judicial ballot must be headed with the words: \"Judicial Nonpartisan General Election Ballot.\" Separate ballot boxes must be provided for these judicial ballots.",
	"repealed": false
}