{
	"id": "169.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.26",
	"title": "169.26 SPECIAL STOPS AT RAILROAD CROSSING.",
	"text": "(a) Except as provided in section 169.28, subdivision 1, when any person driving a vehicle approaches a railroad grade crossing under any of the circumstances stated in this paragraph, the driver shall stop the vehicle not less than ten feet from the nearest railroad track and shall not proceed until safe to do so and until the roadway is clear of traffic so that the vehicle can proceed without stopping until the rear of the vehicle is at least ten feet past the farthest railroad track. These requirements apply when:\n(1) a clearly visible electric or mechanical signal device warns of the immediate approach of a railroad train or other on-track equipment; or\n(2) an approaching railroad train or other on-track equipment is plainly visible and is in hazardous proximity.\n(b) The fact that a moving railroad train or other on-track equipment approaching a railroad grade crossing is visible from the crossing is prima facie evidence that it is not safe to proceed.\n(c) The driver of a vehicle shall stop and remain stopped and not traverse the grade crossing when (1) a human flagger signals the approach or passage of a railroad train or other on-track equipment, or (2) a crossing gate is lowered warning of the immediate approach or passage of a railroad train or other on-track equipment. No person may drive a vehicle past a flagger at a railroad crossing until the flagger signals that the way is clear to proceed or drive a vehicle past a lowered crossing gate.\nA police officer may arrest the driver of a motor vehicle if the police officer has probable cause to believe that the driver has operated the vehicle in violation of subdivision 1 within the past four hours.\n(a) A driver who violates subdivision 1 is guilty of a misdemeanor.\n(b) The owner or, in the case of a leased vehicle, the lessee of a motor vehicle is guilty of a petty misdemeanor if a motor vehicle owned or leased by that person is operated in violation of subdivision 1. This paragraph does not apply to a lessor of a motor vehicle if the lessor keeps a record of the name and address of the lessee. This paragraph does not apply if the motor vehicle operator is prosecuted for violating subdivision 1. A violation of this paragraph does not constitute grounds for revocation or suspension of the owner's or lessee's driver's license.\nAll driver education courses approved by the commissioner of public safety must include instruction on railroad-highway grade crossing safety. The commissioner of public safety shall by rule establish minimum standards of course content relating to operation of vehicles at railroad-highway grade crossings.\n(a) A pedestrian shall not pass through, around, over, or under any crossing gate or barrier at a railroad grade crossing while the gate or barrier is closed or is being opened or closed.\n(b) A pedestrian shall not enter, remain upon, or traverse over a railroad track, grade crossing, or pedestrian walkway crossing a railroad track when an audible bell or clearly visible electric or mechanical signal device is operational and warning of the presence, approach, passage, or departure of a railroad train or other on-track equipment.\n(c) A person who violates this subdivision is subject to a fine of up to $100.",
	"repealed": false
}