{
	"id": "245G.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.14",
	"title": "245G.14 SERVICE INITIATION AND TERMINATION POLICIES.",
	"text": "A license holder must have a written service initiation policy containing service initiation preferences that comply with this section and Code of Federal Regulations, title 45, part 96.131, and specific service initiation criteria. The license holder must not initiate services for an individual who does not meet the service initiation criteria. The service initiation criteria must be either posted in the area of the facility where services for a client are initiated, or given to each interested person upon request. Titles of each staff member authorized to initiate services for a client must be listed in the services initiation and termination policies.\n(a) The license holder must have and comply with a written protocol for (1) assisting a client in need of care not provided by the license holder, and (2) a client who poses a substantial likelihood of harm to the client or others, if the behavior is beyond the behavior management capabilities of the staff members.\n(b) A service termination and denial of service initiation that poses an immediate threat to the health of any individual or requires immediate medical intervention must be referred to a medical facility capable of admitting the client.\n(c) A service termination policy and a denial of service initiation that involves the commission of a crime against a license holder's staff member or on a license holder's premises, as provided under Code of Federal Regulations, title 42, section 2.12 (c)(5), and title 45, parts 160 to 164, must be reported to a law enforcement agency with jurisdiction.\nA license holder must have a written policy specifying the conditions when a client must be terminated from service. The service termination policy must include:\n(1) procedures for a client whose services were terminated under subdivision 2;\n(2) a description of client behavior that constitutes reason for a staff-requested service termination and a process for providing this information to a client;\n(3) a requirement that before discharging a client from a residential setting, for not reaching treatment plan goals, the license holder must confer with other interested persons to review the issues involved in the decision. The documentation requirements for a staff-requested service termination must describe why the decision to discharge is warranted, the reasons for the discharge, and the alternatives considered or attempted before discharging the client;\n(4) procedures consistent with section 253B.16, subdivision 2, that staff members must follow when a client admitted under chapter 253B is to have services terminated;\n(5) procedures a staff member must follow when a client leaves against staff or medical advice and when the client may be dangerous to the client or others, including a policy that requires a staff member to assist the client with assessing needs of care or other resources;\n(6) procedures for communicating staff-approved service termination criteria to a client, including the expectations in the client's individual treatment plan according to section 245G.06; and\n(7) titles of each staff member authorized to terminate a client's service must be listed in the service initiation and service termination policies.",
	"repealed": false
}