{
	"id": "256.482",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.482",
	"title": "256.482 COUNCIL ON DISABILITY.",
	"text": "There is hereby established the Council on Disability which shall consist of 17 members appointed by the governor. Members shall be appointed from the general public and from organizations which provide services for persons who have a disability. A majority of council members shall be persons with a disability or parents or guardians of persons with a disability. There shall be at least one member of the council appointed from each of the state development regions. The commissioners of the Departments of Education, Human Services, Health, and Human Rights and the directors of the Rehabilitation Services and State Services for the Blind in the Department of Employment and Economic Development or their designees shall serve as ex officio members of the council without vote. In addition, the council may appoint ex officio members from other bureaus, divisions, or sections of state departments which are directly concerned with the provision of services to persons with a disability.\nNotwithstanding the provisions of section 15.059, each member of the council appointed by the governor shall serve a three-year term and until a successor is appointed and qualified. The compensation and removal of all members shall be as provided in section 15.059. The council performs functions that are not purely advisory, therefore the expiration dates provided in section 15.059 do not apply. The governor shall appoint a chair of the council from among the members appointed from the general public or who are persons with a disability or their parents or guardians. Vacancies shall be filled by the authority for the remainder of the unexpired term.\nThe council may select an executive director of the council by a vote of a majority of all council members. The executive director shall be in the unclassified service of the state and shall provide administrative support for the council and provide administrative leadership to implement council mandates, policies, and objectives. The executive director shall employ and direct staff authorized according to state law and necessary to carry out council mandates, policies, activities, and objectives. The salary of the executive director and staff shall be established pursuant to chapter 43A. The executive director and staff shall be reimbursed for the actual and necessary expenses incurred as a result of their council responsibilities.\nWhenever any person, firm, corporation, or the federal government offers to the council funds by the way of gift, grant, or loan, for purposes of assisting the council to carry out its powers and duties, the council may accept the offer by majority vote and upon acceptance the chair shall receive the funds subject to the terms of the offer. However, no money shall be accepted or received as a loan nor shall any indebtedness be incurred except in the manner and under the limitations otherwise provided by law.\nThe council shall organize itself in conformity with its responsibilities under sections 256.481 to 256.482 and shall establish committees which shall give detailed attention to the special needs of each category of persons who have a disability. The members of the committees shall be designated by the chair with the approval of a majority of the council. The council shall serve as liaison in Minnesota for the president's committee on employment of the disabled and for any other organization for which it is so designated by the governor or state legislature.\nThe council shall have the following duties and powers:\n(1) to advise and otherwise aid the governor; appropriate state agencies, including but not limited to the Departments of Education, Human Services, Employment and Economic Development, and Human Rights and the Divisions of Rehabilitation Services and Services for the Blind; the state legislature; and the public on matters pertaining to public policy and the administration of programs, services, and facilities for persons who have a disability in Minnesota;\n(2) to encourage and assist in the development of coordinated, interdepartmental goals and objectives and the coordination of programs, services and facilities among all state departments and private providers of service as they relate to persons with a disability;\n(3) to serve as a source of information to the public regarding all services, programs and legislation pertaining to persons with a disability;\n(4) to review and make comment to the governor, state agencies, the legislature, and the public concerning adequacy of state programs, plans and budgets for services to persons with a disability and for funding under the various federal grant programs;\n(5) to research, formulate and advocate plans, programs and policies which will serve the needs of persons who are disabled;\n(6) to advise the Departments of Labor and Industry and Employment and Economic Development on the administration and improvement of the workers' compensation law as it relates to programs, facilities and personnel providing assistance to workers who are injured and disabled;\n(7) to advise the Workers' Compensation Division of the Department of Labor and Industry and the Workers' Compensation Court of Appeals as to the necessity and extent of any alteration or remodeling of an existing residence or the building or purchase of a new or different residence which is proposed by a licensed architect under section 176.137;\n(8) to initiate or seek to intervene as a party in any administrative proceeding and judicial review thereof to protect and advance the right of all persons who are disabled to an accessible physical environment as provided in section 326B.139; and\n(9) to initiate or seek to intervene as a party in any administrative or judicial proceeding which concerns programs or services provided by public or private agencies or organizations and which directly affects the legal rights of persons with a disability.\n[Renumbered 16B.055, subd 2]\n(a) Notwithstanding section 13D.01, the Minnesota State Council on Disability may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the council participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the council can hear all discussion and all votes of members of the council and participate in testimony;\n(3) at least one member of the council is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(b) Each member of the council participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If telephone or another electronic means is used to conduct a meeting, the council, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The council may require the person making such a connection to pay for documented marginal costs that the council incurs as a result of the additional connection.\n(d) If telephone or another electronic means is used to conduct a regular, special, or emergency meeting, the council shall provide notice of the regular meeting location, of the fact that some members may participate by electronic means, and of the provisions of paragraph (c). The timing and method of providing notice is governed by section 13D.04.\n[Repealed, 1975 c 315 s 26]\nThe council is empowered to establish and collect fees for documents or technical services provided to the public. The fees shall be set at a level to reimburse the council for the actual cost incurred in providing the document or service. All fees collected shall be deposited into the state treasury and credited to the general fund.\n[Repealed by amendment, 2007 c 33 s 2]",
	"repealed": false
}