{
	"id": "245D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.09",
	"title": "245D.09 STAFFING STANDARDS.",
	"text": "The license holder must provide the level of direct service support staff supervision, assistance, and training necessary:\n(1) to ensure the health, safety, and protection of rights of each person; and\n(2) to be able to implement the responsibilities assigned to the license holder in each person's support plan or identified in the support plan addendum, according to the requirements of this chapter.\nExcept for a license holder who is the sole direct support staff, the license holder must provide adequate supervision of staff providing direct support to ensure the health, safety, and protection of rights of each person and implementation of the responsibilities assigned to the license holder in each person's support plan or support plan addendum.\n(a) The license holder must ensure that staff providing direct support, or staff who have responsibilities related to supervising or managing the provision of direct support service, are competent as demonstrated through skills and knowledge training, experience, and education relevant to the primary disability of the person and to meet the person's needs and additional requirements as written in the support plan or support plan addendum, or when otherwise required by the case manager or the federal waiver plan. The license holder must verify and maintain evidence of staff competency, including documentation of:\n(1) education and experience qualifications relevant to the job responsibilities assigned to the staff and to the primary disability of persons served by the program, including a valid degree and transcript, or a current license, registration, or certification, when a degree or licensure, registration, or certification is required by this chapter or in the support plan or support plan addendum;\n(2) demonstrated competency in the orientation and training areas required under this chapter, and when applicable, completion of continuing education required to maintain professional licensure, registration, or certification requirements. Competency in these areas is determined by the license holder through knowledge testing or observed skill assessment conducted by the trainer or instructor or by an individual who has been previously deemed competent by the trainer or instructor in the area being assessed; and\n(3) except for a license holder who is the sole direct support staff, periodic performance evaluations completed by the license holder of the direct support staff person's ability to perform the job functions based on direct observation.\n(b) Staff under 18 years of age may not perform overnight duties.\nExcept for a license holder who does not supervise any direct support staff, within 60 calendar days of hire, unless stated otherwise, the license holder must provide and ensure completion of orientation sufficient to create staff competency for direct support staff that combines supervised on-the-job training with review of and instruction in the following areas:\n(1) the job description and how to complete specific job functions, including:\n(i) responding to and reporting incidents as required under section 245D.06, subdivision 1; and\n(ii) following safety practices established by the license holder and as required in section 245D.06, subdivision 2;\n(2) the license holder's current policies and procedures required under this chapter, including their location and access, and staff responsibilities related to implementation of those policies and procedures;\n(3) data privacy requirements according to sections 13.01 to 13.10 and 13.46, the federal Health Insurance Portability and Accountability Act of 1996 (HIPAA), and staff responsibilities related to complying with data privacy practices;\n(4) the service recipient rights and staff responsibilities related to ensuring the exercise and protection of those rights according to the requirements in section 245D.04;\n(5) sections 245A.65, 245A.66, and 626.557 and chapter 260E governing maltreatment reporting and service planning for children and vulnerable adults, and staff responsibilities related to protecting persons from maltreatment and reporting maltreatment. This orientation must be provided within 72 hours of first providing direct contact services and annually thereafter according to section 245A.65, subdivision 3;\n(6) the principles of person-centered service planning and delivery as identified in section 245D.07, subdivision 1a, and how they apply to direct support service provided by the staff person;\n(7) the safe and correct use of manual restraint on an emergency basis according to the requirements in section 245D.061 or successor provisions, and what constitutes the use of restraints, time out, and seclusion, including chemical restraint;\n(8) staff responsibilities related to prohibited procedures under section 245D.06, subdivision 5, or successor provisions, why such procedures are not effective for reducing or eliminating symptoms or undesired behavior, and why such procedures are not safe;\n(9) basic first aid;\n(10) strategies to minimize the risk of sexual violence, including concepts of healthy relationships, consent, and bodily autonomy of people with disabilities; and\n(11) other topics as determined necessary in the person's support plan by the case manager or other areas identified by the license holder.\n(a) Before having unsupervised direct contact with a person served by the program, or for whom the staff person has not previously provided direct support, or any time the plans or procedures identified in paragraphs (b) to (f) are revised, the staff person must review and receive instruction on the requirements in paragraphs (b) to (f) as they relate to the staff person's job functions for that person.\n(b) For community residential services, training and competency evaluations must include the following, if identified in the support plan:\n(1) appropriate and safe techniques in personal hygiene and grooming, including hair care; bathing; care of teeth, gums, and oral prosthetic devices; and other activities of daily living (ADLs) as defined under section 256B.0659, subdivision 1;\n(2) an understanding of what constitutes a healthy diet according to data from the Centers for Disease Control and Prevention and the skills necessary to prepare that diet; and\n(3) skills necessary to provide appropriate support in instrumental activities of daily living (IADLs) as defined under section 256B.0659, subdivision 1.\n(c) The staff person must review and receive instruction on the person's support plan or support plan addendum as it relates to the responsibilities assigned to the license holder, and when applicable, the person's individual abuse prevention plan, to achieve and demonstrate an understanding of the person as a unique individual, and how to implement those plans.\n(d) The staff person must review and receive instruction on medication setup, assistance, or administration procedures established for the person when assigned to the license holder according to section 245D.05, subdivision 1, paragraph (b). Unlicensed staff may perform medication setup or medication administration only after successful completion of a medication setup or medication administration training, from a training curriculum developed by a registered nurse or appropriate licensed health professional. The training curriculum must incorporate an observed skill assessment conducted by the trainer to ensure unlicensed staff demonstrate the ability to safely and correctly follow medication procedures.\nMedication administration must be taught by a registered nurse, clinical nurse specialist, certified nurse practitioner, physician assistant, or physician if, at the time of service initiation or any time thereafter, the person has or develops a health care condition that affects the service options available to the person because the condition requires:\n(1) specialized or intensive medical or nursing supervision; and\n(2) nonmedical service providers to adapt their services to accommodate the health and safety needs of the person.\n(e) The staff person must review and receive instruction on the safe and correct operation of medical equipment used by the person to sustain life or to monitor a medical condition that could become life-threatening without proper use of the medical equipment, including but not limited to ventilators, feeding tubes, or endotracheal tubes. The training must be provided by a licensed health care professional or a manufacturer's representative and incorporate an observed skill assessment to ensure staff demonstrate the ability to safely and correctly operate the equipment according to the treatment orders and the manufacturer's instructions.\n(f) The staff person must review and receive instruction on mental health crisis response, de-escalation techniques, and suicide intervention when providing direct support to a person with a serious mental illness.\n(g) In the event of an emergency service initiation, the license holder must ensure the training required in this subdivision occurs within 72 hours of the direct support staff person first having unsupervised contact with the person receiving services. The license holder must document the reason for the unplanned or emergency service initiation and maintain the documentation in the person's service recipient record.\n(h) License holders who provide direct support services themselves must complete the orientation required in subdivision 4, clauses (3) to (11).\nA license holder must provide annual training to direct support staff on the topics identified in subdivision 4, clauses (3) to (11). If the direct support staff has a first aid certification, annual training under subdivision 4, clause (9), is not required as long as the certification remains current.\nOrientation or training received by the staff person from sources other than the license holder in the same subjects as identified in subdivision 4 may count toward the orientation and annual training requirements if received in the 12-month period before the staff person's date of hire. The license holder must maintain documentation of the training received from other sources and of each staff person's competency in the required area according to the requirements in subdivision 3.\nIf the license holder uses a subcontractor or temporary staff to perform services licensed under this chapter on the license holder's behalf, the license holder must ensure that the subcontractor or temporary staff meets and maintains compliance with all requirements under this chapter that apply to the services to be provided, including training, orientation, and supervision necessary to fulfill their responsibilities. The license holder must ensure that a background study has been completed according to the requirements in sections 245C.03, subdivision 1, and 245C.04. Subcontractors and temporary staff hired by the license holder must meet the Minnesota licensing requirements applicable to the disciplines in which they are providing services. The license holder must maintain documentation that the applicable requirements have been met.\nThe license holder must ensure that volunteers who provide direct support services to persons served by the program receive the training, orientation, and supervision necessary to fulfill their responsibilities. The license holder must ensure that a background study has been completed according to the requirements in sections 245C.03, subdivision 1, and 245C.04. The license holder must maintain documentation that the applicable requirements have been met.\nThe license holder must develop a staff orientation and training plan documenting when and how compliance with subdivisions 4, 4a, and 5 will be met.",
	"repealed": false
}