{
	"id": "256B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.14",
	"title": "256B.14 RELATIVE'S RESPONSIBILITY.",
	"text": "Subject to the provisions of sections 256B.055, 256B.056, and 256B.06, responsible relative means the parent of a minor recipient of medical assistance or the spouse of a medical assistance recipient.\nThe state agency shall promulgate rules to determine the ability of responsible relatives to contribute partial or complete payment or repayment of medical assistance furnished to recipients for whom they are responsible. All medical assistance exclusions shall be allowed, and a resource limit of $10,000 for nonexcluded resources shall be implemented. Above these limits, a contribution of one-third of the excess resources shall be required. These rules shall not require payment or repayment when payment would cause undue hardship to the responsible relative or that relative's immediate family. These rules do not apply to parents of children whose eligibility for medical assistance was determined without deeming of the parents' resources and income under the Tax Equity and Fiscal Responsibility Act (TEFRA) option or to parents of children accessing home and community-based waiver services. The county agency shall give the responsible relative notice of the amount of the payment or repayment. If the state agency or county agency finds that notice of the payment obligation was given to the responsible relative, but that the relative failed or refused to pay, a cause of action exists against the responsible relative for that portion of medical assistance granted after notice was given to the responsible relative, which the relative was determined to be able to pay.\nThe action may be brought by the state agency or the county agency in the county where assistance was granted, for the assistance, together with the costs of disbursements incurred due to the action.\nIn addition to granting the county or state agency a money judgment, the court may, upon a motion or order to show cause, order continuing contributions by a responsible relative found able to repay the county or state agency. The order shall be effective only for the period of time during which the recipient receives medical assistance from the county or state agency.\nThe community spouse of an institutionalized person who receives medical assistance under section 256B.059, subdivision 5, paragraph (b), has an obligation to pay for the cost of care equal to the dollar value of assets considered available under section 256B.059, subdivision 5.\n[Repealed, 2013 c 108 art 7 s 64]\nA responsible relative may appeal the determination of an obligation to make a contribution under this section according to section 256.045.",
	"repealed": false
}