{
	"id": "609.535",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.535",
	"title": "609.535 ISSUANCE OF DISHONORED CHECKS.",
	"text": "For the purpose of this section, the following terms have the meanings given them.\n(a) \"Check\" means a check, draft, order of withdrawal, or similar negotiable or nonnegotiable instrument.\n(b) \"Credit\" means an arrangement or understanding with the drawee for the payment of a check.\nWhoever issues a check which, at the time of issuance, the issuer intends shall not be paid, is guilty of issuing a dishonored check and may be sentenced as provided in subdivision 2a. In addition, restitution may be ordered by the court.\n(a) A person who is convicted of issuing a dishonored check under subdivision 2 may be sentenced as follows:\n(1) to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the value of the dishonored check, or checks aggregated under paragraph (b), is more than $500;\n(2) to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both, if the value of the dishonored check, or checks aggregated under paragraph (b), is more than $250 but not more than $500; or\n(3) to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both, if the value of the dishonored check, or checks aggregated under paragraph (b), is not more than $250.\n(b) In a prosecution under this subdivision, the value of dishonored checks issued by the defendant in violation of this subdivision within any six-month period may be aggregated and the defendant charged accordingly in applying this section. When two or more offenses are committed by the same person in two or more counties, the accused may be prosecuted in any county in which one of the dishonored checks was issued for all of the offenses aggregated under this paragraph.\nAny of the following is evidence sufficient to sustain a finding that the person at the time the person issued the check intended it should not be paid:\n(1) proof that, at the time of issuance, the issuer did not have an account with the drawee;\n(2) proof that, at the time of issuance, the issuer did not have sufficient funds or credit with the drawee and that the issuer failed to pay the check within five business days after mailing of notice of nonpayment or dishonor as provided in this subdivision; or\n(3) proof that, when presentment was made within a reasonable time, the issuer did not have sufficient funds or credit with the drawee and that the issuer failed to pay the check within five business days after mailing of notice of nonpayment or dishonor as provided in this subdivision.\nNotice of nonpayment or dishonor that includes a citation to and a description of the penalties in this section shall be sent by the payee or holder of the check to the maker or drawer by certified mail, return receipt requested, or by regular mail, supported by an affidavit of service by mailing, to the address printed on the check. Refusal by the maker or drawer of the check to accept certified mail notice or failure to claim certified or regular mail notice is not a defense that notice was not received.\nThe notice may state that unless the check is paid in full within five business days after mailing of the notice of nonpayment or dishonor, the payee or holder of the check will or may refer the matter to proper authorities for prosecution under this section.\nAn affidavit of service by mailing shall be retained by the payee or holder of the check.\nIf the check has been protested, the notice of protest is admissible as proof of presentation, nonpayment, and protest, and is evidence sufficient to sustain a finding that there was a lack of funds or credit with the drawee.\nThis section does not apply to a postdated check or to a check given for a past consideration, except a payroll check or a check issued to a fund for employee benefits.\nA drawee shall release the information specified below to any state, county, or local law enforcement or prosecuting authority which certifies in writing that it is investigating or prosecuting a complaint against the drawer under this section or section 609.52, subdivision 2, paragraph (a), clause (3), item (i), and that 15 days have elapsed since the mailing of the notice of dishonor required by subdivisions 3 and 8. This subdivision applies to the following information relating to the drawer's account:\n(1) documents relating to the opening of the account by the drawer and to the closing of the account;\n(2) notices regarding nonsufficient funds, overdrafts, and the dishonor of any check drawn on the account within a period of six months of the date of request;\n(3) periodic statements mailed to the drawer by the drawee for the periods immediately prior to, during, and subsequent to the issuance of any check which is the subject of the investigation or prosecution; or\n(4) the last known home and business addresses and telephone numbers of the drawer.\nThe drawee shall release all of the information described in clauses (1) to (4) that it possesses within ten days after receipt of a request conforming to all of the provisions of this subdivision. The drawee may not impose a fee for furnishing this information to law enforcement or prosecuting authorities.\nA drawee is not liable in a criminal or civil proceeding for releasing information in accordance with this subdivision.\n(a) A drawee shall release the information specified in paragraph (b), clauses (1) to (3) to the payee or holder of a check that has been dishonored who makes a written request for this information and states in writing that the check has been dishonored and that 30 days have elapsed since the mailing of the notice described in subdivision 8 and who accompanies this request with a copy of the dishonored check and a copy of the notice of dishonor.\nThe requesting payee or holder shall notify the drawee immediately to cancel this request if payment is made before the drawee has released this information.\n(b) This subdivision applies to the following information relating to the drawer's account:\n(1) whether at the time the check was issued or presented for payment the drawer had sufficient funds or credit with the drawee, and whether at that time the account was open, closed, or restricted for any reason and the date it was closed or restricted;\n(2) the last known home address and telephone number of the drawer. The drawee may not release the address or telephone number of the place of employment of the drawer unless the drawer is a business entity or the place of employment is the home; and\n(3) a statement as to whether the aggregated value of dishonored checks attributable to the drawer within six months before or after the date of the dishonored check exceeds $250; for purposes of this clause, a check is not dishonored if payment was not made pursuant to a stop payment order.\nThe drawee shall release all of the information described in clauses (1) to (3) that it possesses within ten days after receipt of a request conforming to all of the provisions of this subdivision. The drawee may require the person requesting the information to pay the reasonable costs, not to exceed 15 cents per page, of reproducing and mailing the requested information.\n(c) A drawee is not liable in a criminal or civil proceeding for releasing information in accordance with this subdivision.\nThe provisions of subdivisions 6 and 7 are not applicable unless the notice to the maker or drawer required by subdivision 3 states that if the check is not paid in full within five business days after mailing of the notice, the drawee will be authorized to release information relating to the account to the payee or holder of the check and may also release this information to law enforcement or prosecuting authorities.",
	"repealed": false
}