{
	"id": "611A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.53",
	"title": "611A.53 REIMBURSEMENT AWARDS; ELIGIBILITY.",
	"text": "Except as provided in subdivisions 1a and 2, the following persons shall be entitled to reimbursement upon a showing by a preponderance of the evidence that the requirements for reimbursement have been met:\n(1) a victim who has incurred economic loss;\n(2) a dependent who has incurred economic loss;\n(3) the estate of a deceased victim if the estate has incurred economic loss;\n(4) any other person who has incurred economic loss by purchasing any of the products, services, and accommodations described in section 611A.52, subdivision 8, for a victim;\n(5) the guardian, guardian ad litem, conservator or authorized agent of any of these persons.\nNo hospital, medical organization, health care provider, or other entity that is not an individual may qualify for reimbursement under subdivision 1, clause (4). If a hospital, medical organization, health care provider, or other entity that is not an individual qualifies for reimbursement under subdivision 1, clause (5), because it is a guardian, guardian ad litem, conservator, or authorized agent, any reimbursement to which it is entitled must be made payable solely or jointly to the victim, if alive, or to the victim's estate or successors, if the victim is deceased.\n(a) A Minnesota resident who is the victim of a crime committed outside the geographical boundaries of this state but who otherwise meets the requirements of this section shall have the same rights under this chapter as if the crime had occurred within this state upon a showing that the state, territory, United States possession, country, or political subdivision of a country in which the crime occurred does not have a crime victims reimbursement law covering the resident's injury or death.\n(b) Notwithstanding paragraph (a), a Minnesota resident who is the victim of a crime involving international terrorism who otherwise meets the requirements of this section has the same rights under this chapter as if the crime had occurred within this state regardless of where the crime occurred or whether the jurisdiction has a crime victims reimbursement law.\nNo reimbursement shall be awarded to a claimant otherwise eligible if:\n(1) the crime was not reported to the police within 30 days of its occurrence or, if it could not reasonably have been reported within that period, within 30 days of the time when a report could reasonably have been made. A victim of criminal sexual conduct in the first, second, third, or fourth degree who does not report the crime within 30 days of its occurrence is deemed to have been unable to have reported it within that period;\n(2) the victim or claimant failed or refused to cooperate fully with the police and other law enforcement officials. Cooperation is determined through law enforcement reports, prosecutor records, or corroboration memorialized in a signed document submitted by a victim service, counseling, or medical professional involved in the case;\n(3) the victim or claimant was the offender or an accomplice of the offender or an award to the claimant would unjustly benefit the offender or an accomplice;\n(4) the victim or claimant was in the act of committing a crime at the time the injury occurred;\n(5) no claim was filed with the board within three years of victim's injury or death; except that (i) if the claimant was unable to file a claim within that period, then the claim can be made within three years of the time when a claim could have been filed; and (ii) if the victim's injury or death was not reasonably discoverable within three years of the injury or death, then the claim can be made within three years of the time when the injury or death is reasonably discoverable. The following circumstances do not render a claimant unable to file a claim for the purposes of this clause: (A) lack of knowledge of the existence of the Minnesota Crime Victims Reimbursement Act, (B) the failure of a law enforcement agency to provide information or assistance to a potential claimant under section 611A.66, (C) the incompetency of the claimant if the claimant's affairs were being managed during that period by a guardian, guardian ad litem, conservator, authorized agent, or parent, or (D) the fact that the claimant is not of the age of majority; or\n(6) the claim is less than $50.\nThe limitations contained in clauses (1) and (6) do not apply to victims of child abuse. In those cases the three-year limitation period commences running with the report of the crime to the police.",
	"repealed": false
}