{
	"id": "148.6432",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6432",
	"title": "148.6432 SUPERVISION OF OCCUPATIONAL THERAPY ASSISTANTS.",
	"text": "If the professional standards identified in section 148.6430 permit an occupational therapist to delegate an evaluation, reevaluation, or treatment procedure, the occupational therapist must provide supervision consistent with this section.\nThe occupational therapist shall determine the frequency of evaluations and reevaluations for each client. The occupational therapy assistant shall inform the occupational therapist of the need for more frequent reevaluation if indicated by the client's condition or response to treatment. Before delegating a portion of a client's evaluation pursuant to section 148.6430, the occupational therapist shall ensure the service competency of the occupational therapy assistant in performing the evaluation procedure and shall provide supervision consistent with the condition of the patient or client and the complexity of the evaluation procedure.\n(a) The occupational therapist must determine the frequency and manner of supervision of an occupational therapy assistant performing intervention procedures delegated pursuant to section 148.6430 based on the condition of the patient or client, the complexity of the intervention procedure, and the service competency of the occupational therapy assistant.\n(b) Face-to-face collaboration between the occupational therapist and the occupational therapy assistant must occur every ten intervention days or every 30 days, whichever comes first, during which time the occupational therapist is responsible for:\n(1) planning and documenting an initial intervention plan and discharge from interventions;\n(2) reviewing intervention goals, therapy programs, and client progress;\n(3) supervising changes in the intervention plan;\n(4) conducting or observing intervention procedures for selected clients and documenting appropriateness of intervention procedures. Clients must be selected based on the occupational therapy services provided to the client and the role of the occupational therapist and the occupational therapy assistant in those services; and\n(5) ensuring the service competency of the occupational therapy assistant in performing delegated intervention procedures.\n(c) Face-to-face collaboration must occur more frequently if necessary to meet the requirements of paragraph (a) or (b).\n(d) The occupational therapist must document compliance with this subdivision in the client's file or chart.\nThe supervision requirements of this section do not apply to an occupational therapy assistant who:\n(1) works in an activities program; and\n(2) does not perform occupational therapy services.\nThe occupational therapy assistant must meet all other applicable requirements of sections 148.6401 to 148.6449.",
	"repealed": false
}