{
	"id": "317A.433",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.433",
	"title": "317A.433 SPECIAL MEETINGS OF MEMBERS WITH VOTING RIGHTS.",
	"text": "A corporation with members with voting rights shall hold a special meeting of members:\n(1) on call of its board or persons authorized to do so by the articles or bylaws; or\n(2) if at least 50 members with voting rights or ten percent of the members with voting rights, whichever is less, sign, date, and deliver to the president or the treasurer one or more written demands for the meeting describing the purpose for which it is to be held.\nWithin 30 days after receipt of a demand for a special meeting from members with voting rights, the board shall cause a special meeting to be called and held on notice no later than 90 days after receipt of the demand at the expense of the corporation. If the board fails to cause a special meeting to be called and held as required by this subdivision, a member with voting rights making the demand may call the meeting by giving notice under section 317A.435 at the expense of the corporation.\nSpecial meetings of members may be held in or out of this state at the place stated in or fixed in accordance with the articles, bylaws, or by the president or the board. If a special meeting is demanded by the members, the meeting must be held in the county where the corporation's registered office is located. To the extent authorized in the articles or bylaws, the board of directors may determine that a special meeting of the members shall be held solely by means of remote communication in accordance with section 317A.450, subdivision 2.\nThe notice of a special meeting must contain a statement of the purposes of the meeting. The notice may also contain other information required by the articles or bylaws or considered necessary or desirable by the board or by another person calling the meeting. The business transacted at a special meeting is limited to the purposes stated within the notice of the meeting. Business transacted at a special meeting that is not included in those stated purposes is voidable by or on behalf of the corporation, unless all of the members with voting rights have waived notice of the meeting under section 317A.435.",
	"repealed": false
}