{
	"id": "41B.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.046",
	"title": "41B.046 VALUE-ADDED AGRICULTURAL PRODUCT LOAN PROGRAM.",
	"text": "For purposes of this section:\n(1) \"Agricultural commodity\" has the meaning given in section 17.90.\n(2) \"Agricultural product processing facility\" means land, buildings, structures, fixtures, and improvements located or to be located in Minnesota and used or operated primarily for the processing or production of marketable products from agricultural commodities or agricultural energy resources, including waste and residues from agricultural commodities, but, except as provided in subdivision 4a, not including livestock or livestock products, poultry or poultry products, or wood or wood products.\n(3) \"Value-added agricultural product\" means a product derived from agricultural commodities or agricultural energy resources, including waste and residues from agricultural commodities, but, except as provided in subdivision 4a, not including livestock or livestock products, poultry or poultry products, or wood or wood products, which are processed by an agricultural product processing facility.\n(4) \"Agricultural energy resources\" means energy products and resources available on and around agricultural land including wind, solar, and biomass energy.\n(5) \"Farm-generated wind energy production facility\" means a wind energy conversion facility for the generation of electricity and its support structure, base, switch gear, and associated equipment installed on agricultural land.\nThe authority shall establish and implement a value-added agricultural product loan program to help farmers finance the purchase of stock in a cooperative, limited liability company, or limited liability partnership that is proposing to build or purchase and operate an agricultural product processing facility or already owns and operates an agricultural product processing facility.\n[Repealed, 1Sp2005 c 1 art 1 s 98]\nTo be eligible for this program a borrower must:\n(1) be a resident of Minnesota or a domestic family farm corporation as defined in section 500.24, subdivision 2;\n(2) be a grower of the agricultural product which is to be processed by an agricultural product processing facility;\n(3) demonstrate an ability to repay the loan; and\n(4) meet any other requirements which the authority may impose by rule.\nAn applicant may be eligible for a loan under this section if:\n(1) the facility is owned and operated by a cooperative organized under chapter 308A. For purposes of this subdivision, \"owned and operated\" includes a contractual arrangement with another entity to provide management and operations services for a facility owned by the cooperative; and\n(2) its agricultural product processing facility is located in Minnesota and operated primarily for the processing of livestock.\nAn applicant is eligible for a loan for a farm-generated wind energy production facility under this section if:\n(1) the facility is owned and operated by a cooperative organized under chapter 308A. For purposes of this subdivision, \"owned and operated\" includes a contractual arrangement with another entity to provide management and operations services for a facility owned by the cooperative;\n(2) all shares and membership in the cooperative are held by natural persons or estates, at least 51 percent of whom reside in a county or contiguous to a county where farm-generated wind energy production facilities of the cooperative are located; and\n(3) its farm-generated wind energy production facilities are located entirely on agricultural property in Minnesota principally used for farming as defined in section 500.24, subdivision 2, paragraph (a), owned by the shareholders of the cooperative, with no more than two megawatts of nameplate capacity located on any one shareholder's agricultural property.\n(a) The authority may participate in a stock loan with an eligible lender to a farmer who is eligible under subdivision 4. Participation is limited to 45 percent of the principal amount of the loan or $40,000, whichever is less. The interest rates and repayment terms of the authority's participation interest may differ from the interest rates and repayment terms of the lender's retained portion of the loan, but the authority's interest rate must not exceed 50 percent of the lender's interest rate.\n(b) No more than 95 percent of the purchase price of the stock may be financed under this program.\n(c) Security for stock loans must be the stock purchased, a personal note executed by the borrower, and whatever other security is required by the eligible lender or the authority.\n(d) The authority may impose a reasonable nonrefundable application fee for each application for a stock loan. The authority may review the fee annually and make adjustments as necessary. The application fee is initially $50. Application fees received by the authority must be deposited in the Rural Finance Authority administrative account established in section 41B.03.\n(e) Stock loans under this program will be made using money in the revolving loan account established in section 41B.06.\n(f) The authority may not grant stock loans in a cumulative amount exceeding $2,000,000 for the financing of stock purchases in any one cooperative.\n(g) Repayments of financial assistance under this section, including principal and interest, must be deposited into the revolving loan account established in section 41B.06.\nThe authority may adopt rules necessary for the administration of the program including rules which establish a minimum cost of any agricultural product processing facility for which financial assistance may be given to any farmer to help finance the purchase of stock in a cooperative.",
	"repealed": false
}