{
	"id": "297A.993",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.993",
	"title": "297A.993 COUNTY TRANSPORTATION SALES AND USE TAX.",
	"text": "Notwithstanding section 297A.99, subdivisions 1, 2, 3, 5, and 13, or 477A.016, or any other law, the board of a county, or more than one county acting under a joint powers agreement, may by resolution of the county board, or each of the county boards, following a public hearing impose (1) a transportation sales tax at a rate of up to one-half of one percent on retail sales and uses taxable under this chapter, and (2) an excise tax of $20 per motor vehicle, as defined in section 297B.01, subdivision 11, purchased or acquired from any person engaged in the business of selling motor vehicles at retail, occurring within the jurisdiction of the taxing authority.\nThe proceeds of the taxes must be dedicated exclusively to: (1) payment of the capital cost of a specific transportation project or improvement; (2) payment of the costs, which may include both capital and operating costs, of a specific transit project or improvement; (3) payment of the capital costs of a safe routes to school program under section 174.40; (4) payment of transit operating costs; or (5) payment of the capital cost of constructing buildings and other facilities for maintaining transportation or transit projects or improvements. The transportation or transit project or improvement must be designated by the board of the county, or more than one county acting under a joint powers agreement. Except for taxes for operating costs of a transit project or improvement, or for transit operations, the taxes must terminate when revenues raised are sufficient to finance the project. Nothing in this subdivision prohibits the exclusive dedication of the proceeds of the taxes to payments for more than one project or improvement. After a public hearing a county may, by resolution, dedicate the proceeds of the tax for a new enumerated project.\nBy February 15 of each even-numbered year, a metropolitan county, as defined in section 473.121, subdivision 4, that imposes the taxes under this section must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. At a minimum, the report must include:\n(1) actual transportation sales tax collections by the county over the previous five calendar years;\n(2) an estimation of the total sales tax revenue that is estimated to be collected by the county in the current year and for the next ten calendar years; and\n(3) for each of the previous five calendar years, the current calendar year, and for the next ten calendar years:\n(i) the amount of sales tax revenue expended or proposed to be expended for each of the following:\n(A) planning, construction, operation, or maintenance of guideways, as defined in section 473.4485, subdivision 1, paragraph (d);\n(B) nonguideway transit and active transportation uses;\n(C) highway uses; and\n(D) uses not otherwise specified in subitems (A) to (C);\n(ii) completed, current, planned, and eligible projects for each category under item (i); and\n(iii) an estimated balance of unspent or undesignated county sales tax revenue.\nThe administration, collection, and enforcement provisions in section 297A.99, subdivisions 4 and 6 to 12, apply to all taxes imposed under this section.\n(a) A county may, by resolution, authorize, issue, and sell its bonds, notes, or other obligations for the purposes specified in subdivision 2. The county may also, by resolution, issue bonds to refund the bonds issued pursuant to this subdivision.\n(b) The bonds may be limited obligations, payable solely from or secured by taxes levied under this section, and the county may also pledge its full faith, credit, and taxing power as additional security for the bonds. A regional railroad authority within the county may also pledge its taxing powers as additional security for the bonds.\n(c) A county may issue and sell bonds in one or more series and without an election. The county may determine how the bonds shall be secured; how the bonds will bear interest, and the rate or rates, or variable rate; the rank or priority; how the bonds will be executed and be payable, and how they will mature; and how the bonds will be subject to any defaults, redemptions, repurchases, tender options, or other terms. The county may also determine how the bonds shall be sold.\n(d) The county may enter into and perform all contracts deemed necessary or desirable by it to issue and secure the bonds, including an indenture of trust with a trustee located within or outside of the state.\n(e) Before issuing bonds qualifying under this section, the county must publish a notice of its intention to issue the bonds and the date and time of a hearing to obtain public comment on the matter. The notice must be published in the official newspaper of the county or in a newspaper of general circulation in the county. The notice must be published at least 14, but not more than 28, days before the date of the hearing.\n(f) Any project financed with bonds issued under this section must be included in a capital improvement plan as defined in section 373.40, subdivision 3. For purposes of this paragraph, \"project\" means any project described in subdivision 2, notwithstanding section 373.40, subdivision 1, paragraph (b).\n(g) Except as otherwise provided in this subdivision, the bonds must be issued and sold in the manner provided under chapter 475.",
	"repealed": false
}