{
	"id": "609.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.501",
	"title": "609.501 FUNERAL OR BURIAL SERVICE; PROHIBITED ACTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Family or household\" has the meaning given to family or household member in section 518B.01, subdivision 2.\n(c) \"Funeral ceremony\" has the meaning given in section 149A.02, subdivision 18.\n(d) \"Funeral procession\" means two or more motor vehicles that identify themselves by using regular lights and by keeping themselves in close formation, one of which contains the body of a deceased person, enroute to or from a funeral ceremony or a graveside service.\n(e) \"Graveside service\" has the meaning given in section 149A.02, subdivision 24.\n(f) \"Memorial service\" has the meaning given in section 149A.02, subdivision 28.\n(g) \"Targeted residential picketing\" has the meaning given in section 609.748, subdivision 1, paragraph (c), but does not require more than one act or that acts be committed on more than one occasion.\n(a) Whoever does any of the following is guilty of a misdemeanor:\n(1) with intent to disrupt a funeral ceremony, graveside service, or memorial service, protests or pickets within 500 feet of the burial site or the entrance to a facility or location being used for the service or ceremony, within one hour prior to, during, or one hour following the service or ceremony;\n(2) with intent to disrupt a funeral procession, impedes or attempts to impede a vehicle that is part of the procession;\n(3) intentionally blocks or attempts to block access to a funeral ceremony, graveside service, or memorial service; or\n(4) knowingly engages in targeted residential picketing at the home or domicile of any surviving member of the deceased person's family or household on the date of the funeral ceremony, graveside service, or memorial service.\n(b) Whoever is convicted of a violation of paragraph (a) following a previous conviction for a violation of paragraph (a) or a similar statute from another state or the United States is guilty of a gross misdemeanor.\nA person who violates subdivision 2 is liable to a surviving member of the deceased person's family or household for damages caused by the violation. A surviving member of the deceased person's family or household may also bring an action for injunctive relief and other appropriate relief or remedial compensation. In an action brought under this subdivision, a prevailing plaintiff may recover attorney fees.",
	"repealed": false
}