{
	"id": "60A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.10",
	"title": "60A.10 DEPOSITS FOR PROTECTION OF POLICYHOLDERS.",
	"text": "(1) Deposit as security for all policyholders required. No company in this state, other than farmers' mutual, or real estate title insurers, shall do business in this state unless it has on deposit with the commissioner, for the protection of both its resident and nonresident policyholders, securities to an amount, the actual market value of which, exclusive of interest, shall never be less than $500,000 or one-half the applicable financial requirement set forth in sections 60A.07, 66A.32, and 66A.33, whichever is less. The securities shall be retained under the control of the commissioner as long as any policies of the depositing company remain in force.\n(2) Securities defined. For the purpose of this subdivision, the word \"securities\" means bonds or other obligations of, or bonds or other obligations insured or guaranteed by, the United States, any state of the United States, any municipality of this state, or any agency or instrumentality of the foregoing.\n(3) Protection of deposit from levy. No judgment creditor or other claimant may levy upon any securities held on deposit with, or for the account of, the commissioner. Upon the entry of an order by a court of competent jurisdiction for the rehabilitation, liquidation or conservation of any depositing company as provided in chapter 60B, that company's deposit together with any accrued income thereon shall be transferred to the commissioner as rehabilitator, liquidator, or conservator.\nAny insurance company of any other state of the United States may file with the commissioner a certificate of the insurance commissioner of the other state that, as such officer, there is held in trust by the certifying commissioner and on deposit for the benefit of all the policyholders of the company a deposit of an amount not less than that required by subdivision 1 in par value of such securities as are required or permitted to be deposited by the laws of that state, these securities to be of the character in which insurance companies are authorized to invest under the laws of that state, stating the items of the securities so held, and that the commissioner is satisfied that these securities are worth the value so certified. No deposit shall be required in this state while the deposit, so certified, remains.\nThe commissioner may require a special deposit of an individual foreign insurer for the protection of its Minnesota policyholders or claimants. In the event of the filing of a delinquency petition against the insurer in Minnesota, the deposit is subject to chapters 60B, 60C, 61A, and 61B.\nThe commissioner shall receive and hold in official trust deposits made by any domestic company in compliance with the laws of any other state, to enable it to do business in that state, and in like manner hold deposits made by a foreign company under any law of this state. The company making the deposit shall be entitled to the income thereof and, from time to time, with the commissioner's consent, when not inconsistent with the law under which it was made, may exchange, in whole or in part, the securities composing the deposit for other approved securities of equal value. Upon application by a domestic company, the commissioner may return the whole or any portion of the securities so deposited by it, if satisfied that they are subject to no liability. Upon like application, the commissioner may return to a foreign company any deposit made by it when it appears that the company has ceased to do business in this state or the United States, and the commissioner is satisfied that it is not subject to any liability in this state, or upon the order of any court of competent jurisdiction. A foreign company which has made a deposit, its trustees, receiver, resident manager, or any creditor or policyholder thereof, may, at any time, institute in the District Court of Ramsey County an action against the state and other proper parties to enforce and terminate the trust created by the deposit. The commissioner shall immediately notify the governor of the action, and furnish the necessary information to answer in behalf of the state, and shall carry out such order and decree as the court shall make therein.\nNo later than July 1, 1975, all securities held on deposit with the commissioner pursuant to the laws of this state, or in accordance with an order of the commissioner, shall be deposited for the account of the commissioner in such state or national bank in this state as the depositing insurer may designate and the commissioner may approve. Said deposits shall be made and maintained in accordance with a custodial agreement between the bank and the depositing insurer in a form approved by the commissioner which shall provide as a minimum that (1) the fees of the custodian are to be the obligation of the depositing insurer, and (2) there shall be no exchange, release or transfer of any deposited security unless the commissioner has assented thereto in writing. Securities evidenced by the Federal Reserve book entry system or held in a clearing corporation, as that term is defined in section 60A.11, subdivision 10, must be deposited through an approved custodian or the commissioner of commerce for the account of the commissioner of commerce for the benefit of all policyholders of the depositor.\n[Repealed, 1969 c 494 s 4]\nThe commissioner of commerce shall have the power to make such rules as may be necessary for the execution of the functions vested in the commissioner by this section.",
	"repealed": false
}