{
	"id": "93.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.201",
	"title": "93.201 ROYALTIES FOR TACONITE CONCENTRATES.",
	"text": "All ores or concentrates shipped from the lands covered by any lease under section 93.20 shall be classified and paid for under and in accordance with the particular schedule of said law properly applicable thereto. The royalty provided for taconite concentrates in section 93.20, schedule 7, shall be applicable to concentrates produced from taconite ores which, in accordance with good engineering and metallurgical practice, require treatment by fine grinding, magnetic separation, flotation, or some other method or methods other than or in addition to one or more of the methods specified in schedules 1 to 6, inclusive, of said section to make them suitable for blast furnace use.\n(a) In lieu of payment of such royalty on the taconite concentrates, royalty payments may be made on the taconite ore as defined herein. The method of computing the weight and the royalty rate per ton on such taconite ore shall be determined by agreement between the holder of the lease and the commissioner of natural resources. In case they are unable to agree, each shall choose an arbitrator, and the two thus selected shall choose a third. The decision of the arbitrators or any two of them shall be final and binding on the parties in interest. The agreement or the decision of the arbitrators shall be attached as a supplement to the lease. The holder of the lease shall reimburse the state for all costs and expenses incurred in connection with the determination of weight of taconite ore.\n(b) Taconite ore shall be understood to mean a ferruginous chert or ferruginous slate in the form of compact siliceous rock, in which the iron oxide is so finely disseminated that substantially all of the iron-bearing particles of merchantable grade are smaller than 20 mesh.\nThe provisions of subdivisions 1 and 2 for payment of royalty on taconite ore shall apply to existing leases as well as subsequent leases, subject to vested rights, if any, of the holders of existing leases.",
	"repealed": false
}