{
	"id": "142A.608",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.608",
	"title": "142A.608 AGREEMENTS.",
	"text": "(a) In order to receive Northstar kinship assistance or adoption assistance benefits on behalf of an eligible child, a written, binding agreement between the caregiver or caregivers, the financially responsible agency, or, if there is no financially responsible agency, the agency designated by the commissioner, and the commissioner must be established prior to finalization of the adoption or a transfer of permanent legal and physical custody. The agreement must be negotiated with the caregiver or caregivers under subdivision 3 and renegotiated under subdivision 4, if applicable.\n(b) The agreement must be on a form approved by the commissioner and must specify the following:\n(1) duration of the agreement;\n(2) the nature and amount of any payment, services, and assistance to be provided under such agreement;\n(3) the child's eligibility for Medicaid services;\n(4) the terms of the payment, including any child care portion as specified in section 142A.607, subdivision 4;\n(5) eligibility for reimbursement of nonrecurring expenses associated with adopting or obtaining permanent legal and physical custody of the child, to the extent that the total cost does not exceed $2,000 per child pursuant to subdivision 2;\n(6) that the agreement must remain in effect regardless of the state of which the adoptive parents or relative custodians are residents at any given time;\n(7) provisions for modification of the terms of the agreement, including renegotiation of the agreement;\n(8) the effective date of the agreement; and\n(9) the successor relative custodian or custodians for Northstar kinship assistance, when applicable. The successor relative custodian or custodians may be added or changed by mutual agreement under subdivision 4.\n(c) The caregivers, the commissioner, and the financially responsible agency, or, if there is no financially responsible agency, the agency designated by the commissioner, must sign the agreement. A copy of the signed agreement must be given to each party. Once signed by all parties, the commissioner shall maintain the official record of the agreement.\n(d) The effective date of the Northstar kinship assistance agreement must be the date of the court order that transfers permanent legal and physical custody to the relative. The effective date of the adoption assistance agreement is the date of the finalized adoption decree.\n(e) Termination or disruption of the preadoptive placement or the foster care placement prior to assignment of custody makes the agreement with that caregiver void.\n(a) The commissioner of children, youth, and families must reimburse a relative custodian with a fully executed Northstar kinship assistance benefit agreement for costs that the relative custodian incurs while seeking permanent legal and physical custody of a child who is the subject of a Northstar kinship assistance benefit agreement. The commissioner must reimburse a relative custodian for expenses that are reasonable and necessary that the relative incurs during the transfer of permanent legal and physical custody of a child to the relative custodian, subject to a maximum of $2,000. To be eligible for reimbursement, the expenses must directly relate to the legal transfer of permanent legal and physical custody of the child to the relative custodian, must not have been incurred by the relative custodian in violation of state or federal law, and must not have been reimbursed from other sources or funds. The relative custodian must submit reimbursement requests to the commissioner within 21 months of the date of the child's finalized transfer of permanent legal and physical custody, and the relative custodian must follow all requirements and procedures that the commissioner prescribes.\n(b) The commissioner of children, youth, and families must reimburse an adoptive parent for costs that the adoptive parent incurs in an adoption of a child with special needs according to section 142A.606, subdivision 2. The commissioner must reimburse an adoptive parent for expenses that are reasonable and necessary for the adoption of the child to occur, subject to a maximum of $2,000. To be eligible for reimbursement, the expenses must directly relate to the legal adoption of the child, must not have been incurred by the adoptive parent in violation of state or federal law, and must not have been reimbursed from other sources or funds.\n(1) Children who have special needs but who are not citizens or residents of the United States and were either adopted in another country or brought to this country for the purposes of adoption are categorically ineligible for the reimbursement program in this section, except when the child meets the eligibility criteria in this section after the dissolution of the child's international adoption.\n(2) An adoptive parent, in consultation with the responsible child-placing agency, may request reimbursement of nonrecurring adoption expenses by submitting a complete application to the commissioner that follows the commissioner's requirements and procedures on forms that the commissioner prescribes.\n(3) The commissioner must determine a child's eligibility for adoption expense reimbursement under title IV-E of the Social Security Act, United States Code, title 42, sections 670 to 679c. If the commissioner determines that a child is eligible, the commissioner of children, youth, and families must fully execute the agreement for nonrecurring adoption expense reimbursement by signing the agreement. For a child to be eligible, the commissioner must have fully executed the agreement for nonrecurring adoption expense reimbursement prior to finalizing a child's adoption.\n(4) An adoptive parent who has a fully executed Northstar adoption assistance agreement is not required to submit a separate application for reimbursement of nonrecurring adoption expenses for the child who is the subject of the Northstar adoption assistance agreement.\n(5) If the commissioner has determined the child to be eligible, the adoptive parent must submit reimbursement requests to the commissioner within 21 months of the date of the child's adoption decree, and the adoptive parent must follow requirements and procedures that the commissioner prescribes.\n(a) When a child is determined to be eligible for Northstar kinship assistance or adoption assistance, the financially responsible agency, or, if there is no financially responsible agency, the agency designated by the commissioner, must negotiate with the caregiver to develop an agreement under subdivision 1. If and when the caregiver and agency reach concurrence as to the terms of the agreement, both parties shall sign the agreement. The agency must submit the agreement, along with the eligibility determination outlined in sections 142A.605, subdivision 7, and 142A.606, subdivision 7, to the commissioner for final review, approval, and signature according to subdivision 1.\n(b) A monthly payment is provided as part of the adoption assistance or Northstar kinship assistance agreement to support the care of children unless the child is eligible for adoption assistance and determined to be an at-risk child, in which case no payment will be made unless and until the caregiver obtains written documentation from a qualified expert that the potential disability upon which eligibility for the agreement was based has manifested itself.\n(1) The amount of the payment made on behalf of a child eligible for Northstar kinship assistance or adoption assistance is determined through agreement between the prospective relative custodian or the adoptive parent and the financially responsible agency, or, if there is no financially responsible agency, the agency designated by the commissioner, using the assessment tool established by the commissioner in section 142A.607, subdivision 2, and the associated benefit and payments outlined in section 142A.609. Except as provided under section 142A.607, subdivision 1, paragraph (c), the assessment tool establishes the monthly benefit level for a child under foster care. The monthly payment under a Northstar kinship assistance agreement or adoption assistance agreement may be negotiated up to the monthly benefit level under foster care. In no case may the amount of the payment under a Northstar kinship assistance agreement or adoption assistance agreement exceed the foster care maintenance payment which would have been paid during the month if the child with respect to whom the Northstar kinship assistance or adoption assistance payment is made had been in a foster family home in the state.\n(2) The rate schedule for the agreement is determined based on the age of the child on the date that the prospective adoptive parent or parents or relative custodian or custodians sign the agreement.\n(3) The income of the relative custodian or custodians or adoptive parent or parents must not be taken into consideration when determining eligibility for Northstar kinship assistance or adoption assistance or the amount of the payments under section 142A.609.\n(4) With the concurrence of the relative custodian or adoptive parent, the amount of the payment may be adjusted periodically using the assessment tool established by the commissioner in section 142A.607, subdivision 2, and the agreement renegotiated under subdivision 4 when there is a change in the child's needs or the family's circumstances.\n(5) An adoptive parent of an at-risk child with an adoption assistance agreement may request a reassessment of the child under section 142A.607, subdivision 11, and renegotiation of the adoption assistance agreement under subdivision 4 to include a monthly payment, if the caregiver has written documentation from a qualified expert that the potential disability upon which eligibility for the agreement was based has manifested itself. Documentation of the disability must be limited to evidence deemed appropriate by the commissioner.\n(c) For Northstar kinship assistance agreements:\n(1) the initial amount of the monthly Northstar kinship assistance payment must be equivalent to the foster care rate in effect at the time that the agreement is signed, or a lesser negotiated amount if agreed to by the prospective relative custodian and specified in that agreement, unless the Northstar kinship assistance agreement is entered into when a child is under the age of six; and\n(2) the amount of the monthly payment for a Northstar kinship assistance agreement for a child who is under the age of six must be as specified in section 142A.609, subdivision 5.\n(d) For adoption assistance agreements:\n(1) for a child in foster care with the prospective adoptive parent immediately prior to adoptive placement, the initial amount of the monthly adoption assistance payment must be equivalent to the foster care rate in effect at the time that the agreement is signed, or a lesser negotiated amount if agreed to by the prospective adoptive parents and specified in that agreement, unless the child is identified as at-risk or the adoption assistance agreement is entered into when a child is under the age of six;\n(2) for an at-risk child who must be assigned level A as outlined in section 142A.609, no payment will be made unless and until the potential disability manifests itself, as documented by an appropriate professional, and the commissioner authorizes commencement of payment by modifying the agreement accordingly;\n(3) the amount of the monthly payment for an adoption assistance agreement for a child under the age of six, other than an at-risk child, must be as specified in section 142A.609, subdivision 5;\n(4) for a child who is in the Northstar kinship assistance program immediately prior to adoptive placement, the initial amount of the adoption assistance payment must be equivalent to the Northstar kinship assistance payment in effect at the time that the adoption assistance agreement is signed or a lesser amount if agreed to by the prospective adoptive parent and specified in that agreement, unless the child is identified as an at-risk child; and\n(5) for a child who is not in foster care placement or the Northstar kinship assistance program immediately prior to adoptive placement or negotiation of the adoption assistance agreement, the initial amount of the adoption assistance agreement must be determined using the assessment tool and process in this section and the corresponding payment amount outlined in section 142A.609.\n(a) A relative custodian or adoptive parent of a child with a Northstar kinship assistance or adoption assistance agreement may request renegotiation of the agreement when there is a change in the needs of the child or in the family's circumstances. When a relative custodian or adoptive parent requests renegotiation of the agreement, a reassessment of the child must be completed consistent with section 142A.607, subdivisions 11 and 12. If the reassessment indicates that the child's level has changed, the financially responsible agency or, if there is no financially responsible agency, the agency designated by the commissioner or the commissioner's designee, and the caregiver must renegotiate the agreement to include a payment with the level determined through the reassessment process. The agreement must not be renegotiated unless the commissioner, the financially responsible agency, and the caregiver mutually agree to the changes. The effective date of any renegotiated agreement must be determined by the commissioner.\n(b) An adoptive parent of an at-risk child with an adoption assistance agreement may request renegotiation of the agreement to include a monthly payment under section 142A.609 if the caregiver has written documentation from a qualified expert that the potential disability upon which eligibility for the agreement was based has manifested itself. Documentation of the disability must be limited to evidence deemed appropriate by the commissioner. Prior to renegotiating the agreement, a reassessment of the child must be conducted as outlined in section 142A.607, subdivision 11. The reassessment must be used to renegotiate the agreement to include an appropriate monthly payment. The agreement must not be renegotiated unless the commissioner, the financially responsible agency, and the caregiver mutually agree to the changes. The effective date of any renegotiated agreement must be determined by the commissioner.",
	"repealed": false
}