{
	"id": "64B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/64B.19",
	"title": "64B.19 BENEFIT CONTRACT.",
	"text": "Every society authorized to do business in this state shall issue to each owner of a benefit contract a certificate specifying the amount of benefits provided thereby. The certificate, together with any riders or endorsements attached to it, the laws of the society, the application for membership, the application for insurance and declaration of insurability, if any, signed by the applicant, and all amendments to each thereof, shall constitute the benefit contract, as of the date of issuance, between the society and the owner, and the certificate shall so state. A copy of the application for insurance and declaration of insurability, if any, shall be endorsed upon or attached to the certificate. All statements on the application shall be representations and not warranties. Any waiver of this provision shall be void.\nAny changes, additions, or amendments to the laws of the society duly made or enacted subsequent to the issuance of the certificate, shall bind the owner and the beneficiaries, and shall govern and control the benefit contract in all respects the same as though the changes, additions, or amendments had been made prior to and were in force at the time of the application for insurance, except that no change, addition, or amendment shall destroy or diminish benefits that the society contracted to give the owner as of the date of issuance.\nA person upon whose life a benefit contract is issued prior to attaining the age of majority shall be bound by the terms of the application and certificate and by all the laws and rules of the society to the same extent as though the age of majority had been attained at the time of the application.\nA society shall provide in its laws that if its reserves as to all or any class of certificates become impaired, its board of directors or corresponding body may require that there shall be paid by the owner to the society the amount of the owner's equitable proportion of such deficiency as ascertained by its board, and that if the payment is not made either (1) it shall stand as an indebtedness against the certificate and draw interest not to exceed the rate specified for certificate loans under the certificates; or (2) in lieu of or in combination with (1), the owner may accept a proportionate reduction in benefits under the certificate. The society may specify the manner of the election and which alternative is to be presumed if no election is made.\nIn the event that a society intends to make extra assessments, as provided in subdivision 4, it shall provide notice of the assessments it plans to make to the commissioner, and to the insurance regulator of its state of domicile if it is a foreign society, at least 90 days before the effective date of the assessments.\nWithin 60 days of filing, the commissioner may disapprove the extra assessment of a domestic society that has had a fraternal action level event under section 64B.42, or a fraternal authorized control level event under section 64B.43, if the commissioner determines that the assessment was not duly adopted, is not in the best interests of the benefit members, or does not materially improve the long-term viability of the society. The commissioner may approve an earlier effective date for the extra assessment.\nCopies of any of the documents mentioned in this section, certified by the secretary or corresponding officer of the society, shall be received in evidence of the terms and conditions thereof.\nNo certificate shall be delivered or issued for delivery in this state unless a copy of the form has been filed with the commissioner in the manner provided for like policies issued by life insurers in this state. Every life, accident, health, or disability insurance certificate and every annuity certificate issued on or after one year from August 1, 1985 shall meet the standard contract provision requirements not inconsistent with this chapter for like policies issued by life insurers in this state, except that a society may provide for a grace period for payment of premiums of one full month in its certificates. The certificate shall also contain a provision stating the amount of premiums which are payable under the certificate and a provision reciting or setting forth the substance of any sections of the society's laws or rules in force at the time of issuance of the certificate which, if violated, will result in the termination or reduction of benefits payable under the certificate. If the laws of the society provide for expulsion or suspension of a member, the certificate shall also contain a provision that any member so expelled or suspended, except for nonpayment of a premium or within the contestable period for material misrepresentation in the application for membership or insurance, shall have the privilege of maintaining the certificate in force by continuing payment of the required premium.\nBenefit contracts issued on the lives of persons below the society's minimum age for adult membership may provide for transfer of control or ownership to the insured at an age specified in the certificate. A society may require approval of an application for membership in order to effect this transfer, and may provide in all other respects for the regulation, government, and control of such certificates and all rights, obligations, and liabilities incident thereto and connected therewith. Ownership rights prior to the transfer shall be specified in the certificate.\nA society may specify the terms and conditions on which benefit contracts may be assigned.\nNo society authorized to do business in this state which provides or pays for any health care benefits shall issue any certificate which contains any provision denying or reducing benefits because services are rendered to a certificate holder or beneficiary who is eligible for or receiving medical assistance pursuant to chapter 256B or services pursuant to section 252.27; 260B.331, subdivision 2; 260C.331, subdivision 2; or 393.07, subdivision 1 or 2.\nNo certificate, contract, or other evidence of coverage entered into, issued, amended, renewed, or delivered on or after January 1, 1976, shall contain any provision offsetting, or in any other manner reducing, any benefit to a member or other beneficiary by the amount of, or in any proportion to any increase in disability benefits received or receivable under the Social Security Act, United States Code, title 42, section 301 et seq., as amended subsequent to the date of commencement of the benefit.",
	"repealed": false
}