{
	"id": "514.975",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.975",
	"title": "514.975 RENTAL AGREEMENTS.",
	"text": "The rental agreement between the owner and the occupant must include a disclosure of the lien rights of the owner upon failure of the occupant to pay rent including the right to deny access to certain personal property contained in the self-service storage facility, and the extent and the limits of insurance carried by the owner covering the occupant's personal property stored in the leased premises. A rental agreement may not exempt an owner from liability for damages to an occupant's personal property caused by the owner's negligence. A rental agreement must contain a provision that allows the occupant to provide an optional alternate contact person. The rental agreement must contain a space that the occupant must initial if the occupant declines to provide an optional alternate contact person. The alternate contact person is used solely for purposes of providing notice of default under section 514.973. Adding an alternate contact does not give that contact an interest in the contents of the storage space.\nIf the rental agreement entered into between the owner and the occupant contains a provision placing a limit on the value of property that may be stored in the occupant's space, this limit is the maximum value of the stored property, provided that the provision is printed in bold type or underlined in the rental agreement. The limit on the value of property may not be less than $1,000. The rental agreement may provide that the occupant may increase the limit on the value of property with the written permission of the owner.\nA rental agreement or an application for a rental agreement must contain a provision disclosing whether the applicant is a member of the uniformed services as the term is defined in United States Code, title 10, section 101(a)(5), or a member of the National Guard or a reserve component under United States Code, title 32, section 101.",
	"repealed": false
}