{
	"id": "184.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/184.21",
	"title": "184.21 DEFINITIONS.",
	"text": "For the purposes of sections 184.21 to 184.41 and unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases shall have the meanings given them in this section.\nThe term \"employment agency\" means any person, firm, corporation, partnership, association, or job listing service in this state engaged for hire or compensation in the business of furnishing persons seeking employment or changing employment with information or other service enabling or tending to enable such persons to procure employment, by or with employers, other than such employment agency; or furnishing any other person, firm, corporation, partnership, or association who may be seeking to employ or may be in the market for help of any kind, with information enabling or tending to enable such other person, firm, corporation, partnership, or association to procure such help. Any party performing the services of an employment agency as herein defined, is not an employment agency if the performance of these services is peripheral to the primary business of that party, and if no part of any fees or compensation is paid by the person seeking employment unless that party has an employee, officer, department or division whose primary responsibility is providing employment services to clients. The term \"employment agency\" does not include any exclusively teacher or exclusively nurse or exclusively medical doctor placement service, theatrical, booking, modeling, babysitting agency, educational or labor organization, resume service, newspaper, magazine, trade or professional journal or like publication of general circulation, the main purpose of which is dissemination of news, reports, trade, or professional information. The term \"employment agent\" shall be synonymous with the term \"employment agency.\"\nThe term \"employer\" means any person, firm, corporation, partnership, or association employing or seeking to enter into an arrangement to employ any person through the medium or service of an employment agent.\nThe term \"applicant\" means any person, whether employed or unemployed, seeking or entering into any arrangement for employment or change of employment through the medium or service of an employment agency.\nThe term \"counselor\" within the meaning of sections 184.21 to 184.41 means one who is employed by an employment agency to perform any act authorized by sections 184.21 to 184.41 to be performed by an employment agent.\n\"Person\" includes an individual, a firm, corporation, partnership, or association.\nThe term \"department\" means the Department of Labor and Industry of the state of Minnesota.\nThe term \"board\" means the Employment Agency Advisory Board.\nThe term \"job order\" means a statement either written or oral by any employer to an agency, the purpose of which is to notify the agency of a job opening with that employer and to request that the agency provide the employer with applicants for interview or employment. All information concerning the availability, features, or requirements of a job shall be considered part of the job order.\n\"Character\" includes components of an applicant's ability to be an agent; such as, moral character, education, business integrity, fiscal integrity, training and knowledge of the employment business, capability of staff, and the extent of participation in operating the agency.\n\"Premises\" means the location and size of the place of business, the neighborhood, public access, lease, purchase of premises, or other physical arrangements.\n\"Job listing service\" means any employment agency in the business of matching applicants with employment opportunities through providing a list of employers or list of job openings or like publications or lists of applicants for distribution to potential employers, where a fee or valuable consideration is exacted from the applicant. An employment agency operating exclusively as a \"job listing service\" is not engaged in the placement of applicants.\n\"Concurrent fee\" means a fee charged to an applicant for providing a list of employers or list of job openings or like publications and the fee is not contingent upon actual hiring, but for the information provided by the agency.",
	"repealed": false
}