{
	"id": "144E.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.275",
	"title": "144E.275 MEDICAL RESPONSE UNIT REGISTRATION.",
	"text": "For purposes of this section, the following definitions apply:\n(a) \"Medical response unit\" means an organized service recognized by a local political subdivision whose primary responsibility is to respond to medical emergencies to provide initial medical care before the arrival of a licensed ambulance service. Medical response units may also provide CEMT services as permitted under subdivision 7.\n(b) \"Specialized medical response unit\" means an organized service recognized by a director-approved authority other than a local political subdivision that responds to medical emergencies as needed or as required by local procedure or protocol.\nThe director may establish registration for medical response units and specialized medical response units.\nTo be registered with the director, a medical response unit must:\n(1) submit an application form prescribed by the director;\n(2) have a medical director according to section 144E.265;\n(3) be staffed by at least one emergency medical responder or one emergency medical technician, as appropriate to the level of care given;\n(4) submit a letter from the appropriate municipality, township, or county governing body recognizing the medical response unit as the unit in its geographical area designated to respond to a medical emergency; and\n(5) be dispatched to the scene of a medical emergency on a routine basis by a public safety answering point, as defined under section 403.02, subdivision 19, or an ambulance service.\nTo be registered with the director, a specialized medical response unit must:\n(1) meet the qualifications described in subdivision 3, clauses (1) to (3); and\n(2) submit documentation from a director-approved authority other than a local political subdivision recognizing the specialized medical response unit as a unit designated to respond to medical emergencies as needed or required by local procedure or protocol.\nThe medical response unit registration expires two years from the date it is issued. The director may stagger expiration dates in order to be consistent with the provisions of Minnesota Rules, part 4690.7900.\nThe director may renew the registration of a medical response unit or specialized medical response unit upon:\n(1) submission, before the registration expiration date, of a completed renewal application form as prescribed by the director;\n(2) compliance with subdivision 3, clauses (2) to (5), for a medical response unit or compliance with subdivision 3, clauses (2) and (3), and subdivision 4, clause (2), for a specialized medical response unit; and\n(3) the provision of any other information as requested by the director.\n(a) To be eligible for certification by the director as a CEMT, an individual shall:\n(1) be currently certified as an EMT or AEMT;\n(2) have two years of service as an EMT or AEMT;\n(3) be a member of:\n(i) a registered medical response unit as defined under this section; or\n(ii) a basic life support ambulance service that meets the requirements of section 144E.101, subdivision 6;\n(4) successfully complete a CEMT education program from a college or university that has been approved by the director or accredited by a director-approved national accrediting organization. The education must include clinical experience under the supervision of the medical response unit or ambulance service medical director, an advanced practice registered nurse, a physician assistant, or a public health nurse operating under the direct authority of a local unit of government;\n(5) successfully complete an education program that includes education in providing culturally appropriate care; and\n(6) complete a director-approved application form.\n(b) A CEMT must practice in accordance with protocols and supervisory standards established by the medical response unit or ambulance service medical director in accordance with section 144E.265.\n(c) A CEMT may provide services within the CEMT skill set as approved by the medical response unit or ambulance service medical director.\n(d) A CEMT may provide episodic individual patient education and prevention education but only as directed by a patient care plan developed by the patient's primary physician, an advanced practice registered nurse, or a physician assistant, in conjunction with the medical response unit or ambulance service medical director and relevant local health care providers. The patient care plan must ensure that the services provided by the CEMT are consistent with services offered by the patient's health care home, if one exists, that the patient receives the necessary services, and that there is no duplication of services to the patient.\n(e) A CEMT is subject to all certification, disciplinary, complaint, and other regulatory requirements that apply to EMTs under this chapter.\n(f) A CEMT may not provide services as defined in section 144A.471, subdivisions 6 and 7, except a CEMT may provide verbal or visual reminders to the patient to:\n(1) take a regularly scheduled medication, but not to provide or bring the patient medication; and\n(2) follow regularly scheduled treatment or exercise plans.",
	"repealed": false
}