{
	"id": "299A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.38",
	"title": "299A.38 SOFT BODY ARMOR REIMBURSEMENT.",
	"text": "As used in this section:\n(1) \"commissioner\" means the commissioner of public safety;\n(2) \"firefighter\" means a volunteer, paid on-call, part-time, or career firefighter serving a general population within the boundaries of the state;\n(3) \"peace officer\" means a person who is licensed under section 626.84, subdivision 1, paragraph (c);\n(4) \"public safety officer\" means a peace officer, firefighter, or qualified emergency medical service provider;\n(5) \"qualified emergency medical service provider\" means a person certified under section 144E.28 who is actively employed by a Minnesota licensed ambulance service; and\n(6) \"vest\" means bullet-resistant soft body armor that is flexible, concealable, and custom fitted to the public safety officer to provide ballistic and trauma protection.\nPublic safety officers and heads of agencies and entities who buy vests for the use of public safety officer employees may apply to the commissioner for reimbursement of funds spent to buy vests. On approving an application for reimbursement, the commissioner shall pay the applicant an amount equal to the lesser of one-half of the vest's purchase price or $600, as adjusted according to subdivision 2a. The agency or entity that employs the public safety officer shall pay at least the lesser of one-half of the vest's purchase price or $600, as adjusted according to subdivision 2a. The employer may not deduct or pay its share of the vest's cost from any clothing, maintenance, or similar allowance otherwise provided to the public safety officer by the employer.\nOn October 1, 2006, the commissioner of public safety shall adjust the $600 reimbursement amounts specified in subdivision 2, and in each subsequent year, on October 1, the commissioner shall adjust the reimbursement amount applicable immediately preceding that October 1 date. The adjusted rate must reflect the annual percentage change in the Consumer Price Index for all urban consumers, published by the federal Bureau of Labor Statistics, occurring in the one-year period ending on the preceding June 1.\n(a) Only vests that either meet or exceed the requirements of standard 0101.03 of the National Institute of Justice or that meet or exceed the requirements of that standard, except wet armor conditioning, are eligible for reimbursement.\n(b) Eligibility for reimbursement is limited to vests bought after December 31, 1986, by or for public safety officers (1) who did not own a vest meeting the requirements of paragraph (a) before the purchase, or (2) who owned a vest that was at least five years old.\n(c) The requirement set forth in paragraph (b), clauses (1) and (2), shall not apply to any public safety officer who purchases a vest constructed from a zylon-based material, provided that the public safety officer provides proof of purchase or possession of the vest prior to July 1, 2005.\nThe commissioner may adopt rules under chapter 14 to administer this section.\nA state agency, political subdivision of the state, state or local government employee, or other entity that provides reimbursement for purchase of a vest under this section is not liable to a public safety officer or the public safety officer's heirs for negligence in the death of or injury to the public safety officer because the vest was defective or deficient.\nA public safety officer who is reimbursed for the purchase of a vest under this section and who suffers injury or death because the officer failed to wear the vest, or because the officer wore a vest that was defective or deficient, may not lose or be denied a benefit or right, including a benefit under section 299A.44, to which the officer, or the officer's heirs, is otherwise entitled.",
	"repealed": false
}