{
	"id": "118A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/118A.03",
	"title": "118A.03 WHEN AND WHAT COLLATERAL REQUIRED.",
	"text": "To the extent that funds on deposit at the close of the financial institution's banking day exceed available federal deposit insurance, the government entity shall require the financial institution to furnish collateral security or a corporate surety bond executed by a company authorized to do business in the state. For the purposes of this section, \"banking day\" has the meaning given in Federal Reserve Board Regulation CC, Code of Federal Regulations, title 12, section 229.2(f), and incorporates a financial institution's cutoff hour established under section 336.4-108.\nThe following are the allowable forms of collateral in lieu of a corporate surety bond:\n(1) United States government Treasury bills, Treasury notes, Treasury bonds;\n(2) issues of United States government agencies and instrumentalities as quoted by a recognized industry quotation service available to the government entity;\n(3) general obligation securities of any state or local government with taxing powers which is rated \"A\" or better by a national bond rating service, or revenue obligation securities of any state or local government with taxing powers which is rated \"AA\" or better by a national bond rating service;\n(4) general obligation securities of a local government with taxing powers may be pledged as collateral against funds deposited by that same local government entity;\n(5) irrevocable standby letters of credit issued by Federal Home Loan Banks to a municipality accompanied by written evidence that the bank's public debt is rated \"AA\" or better by Moody's Investors Service, Inc., or Standard & Poor's Corporation; and\n(6) time deposits that are fully insured by any federal agency.\nThe total amount of the collateral computed at its market value shall be at least ten percent more than the amount on deposit at the close of the financial institution's banking day, except that where the collateral is irrevocable standby letters of credit issued by Federal Home Loan Banks, the amount of collateral shall be at least equal to the amount on deposit at the close of the financial institution's banking day. The financial institution may furnish both a surety bond and collateral aggregating the required amount.\nAny collateral pledged shall be accompanied by a written assignment to the government entity from the financial institution. The written assignment shall recite that, upon default, the financial institution shall release to the government entity on demand, free of exchange or any other charges, the collateral pledged. Interest earned on assigned collateral will be remitted to the financial institution so long as it is not in default. The government entity may sell the collateral to recover the amount due. Any surplus from the sale of the collateral shall be payable to the financial institution, its assigns, or both.\nA financial institution may withdraw excess collateral or substitute other collateral after giving written notice to the government entity and receiving confirmation. The authority to return any delivered and assigned collateral rests with the government entity.\nFor purposes of this section, default on the part of the financial institution includes, but is not limited to, failure to make interest payments when due, failure to promptly deliver upon demand all money on deposit, less any early withdrawal penalty that may be required in connection with the withdrawal of a time deposit, or closure of the depository. If a financial institution closes, all deposits shall be immediately due and payable. It shall not be a default under this subdivision to require prior notice of withdrawal if such notice is required as a condition of withdrawal by applicable federal law or regulation.\nAll collateral shall be placed in safekeeping in a restricted account at a Federal Reserve bank, or in an account at a trust department of a commercial bank or other financial institution that is not owned or controlled by the financial institution furnishing the collateral. The selection shall be approved by the government entity.",
	"repealed": false
}