{
	"id": "353.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.32",
	"title": "353.32 REFUNDS AFTER DEATH OF MEMBER OR FORMER MEMBER.",
	"text": "If a member or former member dies before receiving any retirement annuity and no other payment of any kind is or may become payable to any person, a refund is payable to the designated beneficiary or, if there be none, to the surviving spouse, or, if none, to the legal representative of the decedent's estate. The refund must be in an amount equal to accumulated deductions, less the sum of any disability or survivor benefits that have been paid by the fund, plus annual compound interest thereon at the rate specified in section 353.34, subdivision 2, provided that a survivor who has a right to benefits under section 353.31 may waive such benefits in writing, except such benefits for a dependent child under the age of 18 years may only be waived under an order of the district court.\n(a) If a member or former member who is vested under section 353.01, subdivision 47, and who dies before the annuity or disability benefit begins to accrue under section 353.29, subdivision 7, or 353.33, subdivision 2, notwithstanding any designation of beneficiary to the contrary, the surviving spouse may elect to receive, instead of a refund with interest under subdivision 1, or surviving spouse benefits otherwise payable under section 353.31, an annuity equal to a 100 percent joint and survivor annuity computed consistent with section 353.30, subdivision 1a, 1c, or 5, whichever is applicable.\n(b) If a member first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and has credit for at least 30 years of allowable service on the date of death, the surviving spouse may elect to receive a 100 percent joint and survivor annuity computed using section 353.30, subdivision 1b, except that the early retirement reduction under that provision will be applied from age 62 back to age 55 and one-half of the early retirement reduction from age 55 back to the age payment begins.\n(c) If a member who was under age 55 and who is vested under section 353.01, subdivision 47, dies, but did not qualify for retirement on the date of death, the surviving spouse may elect to receive a 100 percent joint and survivor annuity computed using section 353.30, subdivision 1c or 5, as applicable, except that the early retirement reduction specified in the applicable subdivision will be applied to age 55 and one-half of the early retirement reduction from age 55 back to the age payment begins.\n(d) Notwithstanding the definition of surviving spouse in section 353.01, subdivision 20, a former spouse of the member, if any, is entitled to a portion of the monthly surviving spouse optional annuity if stipulated under the terms of a marriage dissolution decree filed with the association. If there is no surviving spouse or child or children, a former spouse may be entitled to a lump-sum refund payment under subdivision 1, if provided for in a marriage dissolution decree, but not a monthly surviving spouse optional annuity, despite the terms of a marriage dissolution decree filed with the association.\n(e) The surviving spouse eligible for surviving spouse benefits under paragraph (a) may apply for the annuity at any time after the date on which the deceased employee would have attained the required age for retirement based on the employee's allowable service. The surviving spouse eligible for surviving spouse benefits under paragraph (b) or (c) may apply for an annuity any time after the member's death.\n(f) Section 353.34, subdivision 3, applies to a deferred annuity or surviving spouse benefit payable under this subdivision.\n(g) An amount equal to any excess of the accumulated contributions that were credited to the account of the deceased employee over and above the total of the annuities paid and payable to the surviving spouse must be paid to the surviving spouse's estate.\n(h) A member may specify in writing, with the signed consent of the spouse, that this subdivision does not apply and that payment may be made only to the designated beneficiary as otherwise provided by this chapter. The waiver of a surviving spouse annuity under this section does not make a dependent child eligible for benefits under subdivision 1c.\n(i) If the deceased member or former member first became a public employee or a member of a public pension plan listed in section 356.30, subdivision 3, on or after July 1, 1989, a survivor annuity computed under paragraph (a) or (c) must be computed as specified in section 353.30, subdivision 5, except for the revised early retirement reduction specified in paragraph (c), if paragraph (c) is the applicable provision.\n(j) For any survivor annuity determined under this subdivision, the payment is to be based on the total allowable service that the member had accrued as of the date of death and the age of the member and surviving spouse on that date.\n(a) In lieu of the 100 percent optional annuity under subdivision 1a, or a refund under subdivision 1, the surviving spouse of a deceased member may elect to receive survivor coverage for a term certain period of ten, 15, or 20 years, but monthly payments must not exceed 75 percent of the average high-five monthly salary of the deceased member. The benefit terminates at the end of the specified term certain period. Except as otherwise specified in this subdivision, the monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 1a.\n(b) If a surviving spouse elects a term certain annuity and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the survivor's estate.\nIf a deceased member has no surviving spouse eligible for benefits under subdivision 1a, the member's dependent child as defined in section 353.01, subdivision 15, is eligible for monthly payments. Payments to a dependent child must be paid from the date of the member's death to the date the dependent child attains age 23. The payment to a dependent child is an amount actuarially equivalent to the value of a 100 percent optional annuity under subdivision 1a using the age of the member and the age of the dependent child at the date of the member's death in lieu of the age of the surviving spouse. If there is more than one dependent child, each dependent child must receive a proportionate share of the actuarial value of the 100 percent optional annuity.\nIf a former member dies after retirement and no payment of any kind is or may become payable to any person, including any deferred benefit or annuity, there shall be paid to the same succession of payees set forth in subdivision 1, a refund of accumulated deductions, less the total payments of all kinds made by the fund to the former member during the former member's lifetime or to any authorized person after death, without interest.\nIf a former member selected an optional annuity by the terms of which an optional survivor's annuity was paid to a survivor after the former member's death, upon the death of the survivor there shall be paid to the former member's designated beneficiary a refund of accumulated deductions less the total payments of all kinds made by the fund to the former member during the former member's lifetime or to any authorized person after death. If said beneficiary should die before making application for such refund, the same shall be paid to the legal representative of the estate of the former member.\nIf a member or former member dies without having designated a beneficiary or if the beneficiary should die before making application for refund, and if there is no surviving spouse, and if the legal representative of such member or former member does not apply for refund within five years from the date of death of the member or former member, the accumulated deductions to the member or former member's credit at the time of death shall be disposed of in the manner provided in section 356.65, unless subdivision 5 applies.\nIf a member or former member dies without having designated a beneficiary, or if the beneficiary should die before making application for refund of the sum to the credit of such decedent, and the amount of the refund is $1,500 or less, the board of trustees may 90 days after the date of death, in the absence of probate proceedings, make payment to the surviving spouse of the decedent or, if none, to the decedent's personal representative or, if none, to the estate. A payment under this subdivision is a bar to recovery by any other person or persons. A retirement annuity or disability or survivor benefit that has accrued at the time of death of an annuitant, disabilitant, or survivor may be paid in the same manner.\n[Repealed, 1963 c 641 s 38]\n[Repealed, 1978 c 796 s 46]\n[Repealed, 1971 c 106 s 40]\nIf a member or former member dies having named as beneficiary a person who is a minor at the time of the application for refund, the board may make the payment (1) directly to the minor, (2) to a person who has legally qualified and is acting as guardian of the minor's person or property in any jurisdiction, or (3) to either parent of the minor or to an adult person with whom the minor may at the time be living. The parent or other person to whom any amount is to be paid must advise the board in writing that the amount will be held or used in trust for the benefit of such minor. Any annuity or disability benefit payable at the time of death of an annuitant or recipient of a disability benefit, which is payable to a beneficiary who is a minor, may be paid in the same manner. The payment is a bar to recovery by any other person or persons.",
	"repealed": false
}