{
	"id": "60A.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.52",
	"title": "60A.52 COMPANY ACTION LEVEL EVENT.",
	"text": "\"Company action level event\" means the following events:\n(1) the filing of an RBC report by a health organization that indicates that the health organization's total adjusted capital is greater than or equal to its regulatory action level RBC but less than its company action level RBC. If a health organization has total adjusted capital greater than or equal to its company action level RBC but less than the product of its authorized control level RBC multiplied by three, and triggers the trend test determined in accordance with the trend test calculation included in the health RBC instructions;\n(2) notification by the commissioner to the health organization of an adjusted RBC report that indicates an event in clause (1), provided the health organization does not challenge the adjusted RBC report under section 60A.56; or\n(3) if, pursuant to section 60A.56, a health organization challenges an adjusted RBC report that indicates the event in clause (1), the notification by the commissioner to the health organization that the commissioner has, after a hearing, rejected the health organization's challenge.\nIn the event of a company action level event, the health organization shall prepare and submit to the commissioner an RBC plan that:\n(1) identifies the conditions that contribute to the company action level event;\n(2) contains proposals of corrective actions that the health organization intends to take and that would be expected to result in the elimination of the company action level event;\n(3) provides projections of the health organization's financial results in the current year and at least the two succeeding years, both in the absence of proposed corrective actions and giving effect to the proposed corrective actions, including projections of statutory balance sheets, operating income, net income, capital and surplus, and RBC levels. The projections for both new and renewal business might include separate projections for each major line of business and separately identify each significant income, expense, and benefit component;\n(4) identifies the key assumptions impacting the health organization's projections and the sensitivity of the projections to the assumptions; and\n(5) identifies the quality of, and problems associated with, the health organization's business, including, but not limited to, its assets, anticipated business growth and associated surplus strain, extraordinary exposure to risk, mix of business, and use of reinsurance, if any, in each case.\nThe RBC plan must be submitted:\n(1) within 45 days of the company action level event; or\n(2) if the health organization challenges an adjusted RBC report pursuant to section 60A.56, within 45 days after notification to the health organization that the commissioner has, after a hearing, rejected the health organization's challenge.\nWithin 60 days after the submission by a health organization of an RBC plan to the commissioner, the commissioner shall notify the health organization whether the RBC plan must be implemented or is, in the judgment of the commissioner, unsatisfactory. If the commissioner determines the RBC plan is unsatisfactory, the notification to the health organization must set forth the reasons for the determination, and may set forth proposed revisions which will render the RBC plan satisfactory, in the judgment of the commissioner. Upon notification from the commissioner, the health organization shall prepare a revised RBC plan, which may incorporate by reference any revisions proposed by the commissioner, and shall submit the revised RBC plan to the commissioner:\n(1) within 45 days after the notification from the commissioner; or\n(2) if the health organization challenges the notification from the commissioner under section 60A.56, within 45 days after a notification to the health organization that the commissioner has, after a hearing, rejected the health organization's challenge.\nIn the event of a notification by the commissioner to a health organization that the health organization's RBC plan or revised RBC plan is unsatisfactory, the commissioner may, at the commissioner's discretion, subject to the health organization's right to a hearing under section 60A.56, specify in the notification that the notification constitutes a regulatory action level event.\nEvery domestic health organization that files an RBC plan or revised RBC plan with the commissioner shall file a copy of the RBC plan or revised RBC plan with the insurance commissioner in any state in which the health organization is authorized to do business if:\n(1) the state has an RBC provision substantially similar in section 60A.57, subdivision 1; and\n(2) the insurance commissioner of that state has notified the health organization of its request for the filing in writing, in which case the health organization shall file a copy of the RBC plan or revised RBC plan in that state no later than the later of:\n(i) 15 days after the receipt of notice to file a copy of its RBC plan or revised RBC plan with the state; or\n(ii) the date on which the RBC plan or revised RBC plan is filed under subdivisions 3 and 4.",
	"repealed": false
}