{
	"id": "144E.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.305",
	"title": "144E.305 REPORTING MISCONDUCT.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under section 144E.27, subdivision 5, or 144E.28, subdivision 5, may report the alleged violation to the director.\n(a) A licensee shall report to the director conduct by an emergency medical responder, EMT, AEMT, or paramedic that they reasonably believe constitutes grounds for disciplinary action under section 144E.27, subdivision 5, or 144E.28, subdivision 5. The licensee shall report to the director within 60 days of obtaining verifiable knowledge of the conduct constituting grounds for disciplinary action.\n(b) A licensee shall report to the director any dismissal from employment of an emergency medical responder, EMT, AEMT, or paramedic. A licensee shall report the resignation of an emergency medical responder, EMT, AEMT, or paramedic before the conclusion of any disciplinary proceeding or before commencement of formal charges but after the emergency medical responder, EMT, AEMT, or paramedic has knowledge that formal charges are contemplated or in preparation. The licensee shall report to the director within 60 days of the resignation or initial determination to dismiss. An individual's exercise of rights under a collective bargaining agreement does not extend the licensee's time period for reporting under this subdivision.\n(a) An individual, licensee, health care facility, business, or organization is immune from civil liability or criminal prosecution for submitting in good faith a report to the director under subdivision 1 or 2 or for otherwise reporting in good faith to the director violations or alleged violations of sections 144E.001 to 144E.33. Reports are classified as confidential data on individuals or protected nonpublic data under section 13.02 while an investigation is active. Except for the director's final determination, all communications or information received by or disclosed to the director relating to disciplinary matters of any person or entity subject to the director's regulatory jurisdiction are confidential and privileged and any disciplinary hearing shall be closed to the public.\n(b) The director, persons employed by the director, persons engaged in the investigation of violations and in the preparation and management of charges of violations of sections 144E.001 to 144E.33 on behalf of the director, and persons participating in the investigation regarding charges of violations are immune from civil liability and criminal prosecution for any actions, transactions, or publications, made in good faith, in the execution of, or relating to, their duties under sections 144E.001 to 144E.33.",
	"repealed": false
}