{
	"id": "116.0711",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.0711",
	"title": "116.0711 FEEDLOT PERMITS; CONDITIONS; COUNTY GRANTS.",
	"text": "(a) The agency shall not require feedlot permittees to maintain records as to rainfall or snowfall as a condition of a general feedlot permit if the owner directs the commissioner or agent of the commissioner to appropriate data on precipitation maintained by a government agency or educational institution.\n(b) A feedlot permittee shall give notice to the agency when the permittee proposes to transfer ownership or control of the feedlot to a new party. The commissioner shall not unreasonably withhold or unreasonably delay approval of any transfer request. This request shall be handled in accordance with sections 116.07 and 15.992.\n(c) An animal feedlot in shoreland that has been unused may resume operation after obtaining a permit from the agency or county, regardless of the number of years that the feedlot was unused.\n(d) Notwithstanding Minnesota Rules, chapter 7020, a person who applies manure in a level 2 or higher drinking water supply management area as designated under Minnesota Rules, part 1573.0040, must follow a manure management plan approved by the commissioner. A manure management plan for a level 2 or higher drinking water supply management area must include the Department of Agriculture's recommended best management practices that are published on the department website for that drinking water supply management area.\n(a) Money appropriated to the commissioner to make grants to delegated counties to administer the county feedlot program must be distributed according to the three-part formula in paragraphs (b) to (d).\n(b) Number of feedlots in the county: 60 percent of the total appropriation must be distributed according to the number of feedlots that are required to be registered in the county. Grants awarded under this paragraph must be matched with a combination of local cash and in-kind contributions.\n(c) Minimum program requirements: 25 percent of the total appropriation must be distributed based on the county (1) conducting an annual number of inspections at feedlots that is equal to or greater than seven percent of the total number of registered feedlots that are required to be registered in the county; and (2) meeting noninspection minimum program requirements as identified in the county feedlot workplan form. Counties that do not meet the inspection requirement must not receive 50 percent of the eligible funding under this paragraph. Counties must receive funding for noninspection requirements under this paragraph according to a scoring system checklist administered by the commissioner. The commissioner, in consultation with the Minnesota Association of County Feedlot Officers executive team, shall make a final decision regarding any appeal by a county regarding the terms and conditions of this paragraph.\n(d) Performance credits: 15 percent of the total appropriation must be distributed according to work that has been done by the counties during the fiscal year. The amount must be determined by the number of performance credits a county accumulates during the year based on a performance credit matrix jointly agreed upon by the commissioner in consultation with the Minnesota Association of County Feedlot Officers executive team. To receive an award under this paragraph, the county must meet the requirements of paragraph (c), clause (1), and achieve 90 percent of the requirements according to paragraph (c), clause (2), of the formula. The rate of reimbursement per performance credit item must not exceed $200.\nDelegated counties are eligible for a minimum grant of $7,500. To receive the full $7,500 amount, a county must meet the requirements under subdivision 2, paragraph (c). Nondelegated counties that apply for delegation shall receive a grant prorated according to the number of full quarters remaining in the program year from the date of commissioner approval of the delegation. Awards to any newly delegated counties must be made out of the appropriation reserved under subdivision 2, paragraph (d). The commissioner, in consultation with the Minnesota Association of County Feedlot Officers executive team, may decide to use money reserved under subdivision 2, paragraph (d), in an amount not to exceed five percent of the total annual appropriation for initiatives to enhance existing delegated county feedlot programs, information and education, or technical assistance efforts to reduce feedlot-related pollution hazards. Any amount remaining after distribution under subdivision 2, paragraphs (b) and (c), must be transferred for purposes of subdivision 2, paragraph (d).",
	"repealed": false
}