{
	"id": "201.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.145",
	"title": "201.145 REPORTS ON GUARDIANSHIPS, LEGAL INCOMPETENCE, FELONY INCARCERATIONS, AND CITIZENSHIP; STATUS CHANGES.",
	"text": "Reports required by this section must be submitted to the secretary of state as provided in this section. Reports from the state court administrator that are required under this section must be made on a daily basis, excluding weekends and holidays. Reports from the commissioner of corrections and the commissioner of public safety that are required under this section must be made to the secretary of state at least monthly. Reports must be submitted by electronic means. Reports from the commissioner of corrections and the commissioner of public safety must include a complete list of each individual under the reporting entity's jurisdiction and must not provide only the changes since the last report.\n(a) The state court administrator must report on individuals 17 years of age or older who are under a guardianship in which a court order revokes the ward's right to vote or where the court has found the individual to be legally incompetent to vote.\n(b) The state court administrator must report on individuals transferred to the jurisdiction of the court who meet a condition specified in paragraph (a).\n(c) Each report required under this subdivision must include the following information for each individual in the report: name, address, date of birth, and, if available, last four digits of the Social Security number and driver's license or state identification card number.\n(d) No later than seven calendar days after receiving a report under this subdivision, the secretary of state must determine if a person identified under paragraphs (a) and (b) is registered to vote and must prepare a list of those registrants for the county auditor. No later than seven calendar days after receiving the list from the secretary of state, the county auditor must challenge the status on the record in the statewide voter registration system of each individual named in the list.\n(a) The commissioner of corrections must report on individuals 16 years of age or older who are currently incarcerated for felony sentences under the commissioner's jurisdiction.\n(b) Each report under this subdivision must include the following information for each individual: name, address or last known residential address that is not a correctional facility, and date of birth. If available, each report must also include the individual's: corrections' state identification number, last four digits of the Social Security number, driver's license or state identification card number, and most recent date of incarceration.\n(c) No later than seven calendar days after receiving a report under this subdivision, the secretary of state must determine if any data newly indicates that a person identified under paragraph (a) is registered to vote and must prepare a list of those registrants for the county auditor. No later than seven calendar days after receiving the list from the secretary of state, the county auditor must challenge the status on the record in the statewide voter registration system of each individual named in the list.\n(d) The county auditor must identify an individual who voted while incarcerated for a felony sentence. The county auditor must immediately send notice to the county attorney. The notice must include the name of the individual and any other identifying information as well as the evidence that shows the individual voted during the period of incarceration.\n(a) The state court administrator must report on each individual whose guardianship was modified to restore the ward's right to vote or whose guardianship was terminated by order of the court under section 524.5-317 after being ineligible to vote for any of the reasons specified in subdivision 2, paragraph (a).\n(b) The commissioner of corrections must report on individuals who were incarcerated for a felony sentence under the commissioner's jurisdiction and have been released from incarceration.\n(c) Each report under this subdivision must include the following information for each individual: name, address, date of birth, and, if available, the last four digits of the Social Security number. For the report required by paragraph (b), the report must also include the individual's, if available: corrections' state identification number, driver's license or state identification card number, date of incarceration, county in which the conviction occurred, and date of discharge.\n(d) No later than seven calendar days after receiving a report under this subdivision, the secretary of state must determine if a person identified under paragraph (a) is registered to vote and must prepare a list of those registrants for the county auditor. No later than seven calendar days after receiving a report under this subdivision, the secretary of state must determine if any data newly indicates that a person identified under paragraph (b) is registered to vote and must prepare a list of those registrants for the county auditor. No later than seven calendar days after receiving the list from the secretary of state, the county auditor must remove the challenge status on the record in the statewide voter registration system of each individual named in the list.\n(a) The commissioner of public safety must report on individuals identified by department data as having temporary lawful status in the United States.\n(b) The report under this section must include the following information for each individual: name, address, date of birth, driver's license or state identification card number, and, if available, last four digits of the Social Security number.\n(c) No later than seven calendar days after receiving a report under this subdivision, the secretary of state must determine if any data newly indicates that a person identified under paragraph (a) is registered to vote and prepare a list of those voters for the county auditor. Within seven calendar days of receiving the list from the secretary of state, the county auditor must challenge the status on the record in the statewide voter registration system of each individual named in the list.\n(d) The county auditor must also immediately send notice to the county attorney of each individual identified in paragraph (c). The notice must include the name of the individual and any other identifying information as well as the evidence that shows the individual registered to vote or voted and is not a citizen.",
	"repealed": false
}