{
	"id": "290.0679",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0679",
	"title": "290.0679 ASSIGNMENT OF REFUND.",
	"text": "(a) \"Qualifying taxpayer\" means a resident who has a child in kindergarten through grade 12 in the current tax year and who met the income requirements under section 290.0674, subdivision 2, for receiving the education credit in the tax year preceding the assignment of the taxpayer's refund.\n(b) \"Education credit\" means the credit allowed under section 290.0674.\n(c) \"Refund\" means an individual income tax refund.\n(d) \"Financial institution\" means a state or federally chartered bank, savings bank, savings association, or credit union.\n(e) \"Qualifying organization\" means a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code.\n(f) \"Assignee\" means a financial institution or qualifying organization that is entitled to receive payment of a refund assigned under this section.\nA qualifying taxpayer may assign all or part of an anticipated refund for the current and future taxable years to a financial institution or a qualifying organization. A financial institution or qualifying organization accepting assignment must pay the amount secured by the assignment to a third-party vendor. The commissioner of education shall, upon request from a third-party vendor, certify that the vendor's products and services qualify for the education credit. A denial of a certification may be appealed to the commissioner pursuant to this subdivision and notwithstanding chapter 14. A financial institution or qualifying organization that accepts assignments under this section must verify as part of the assignment documentation that the product or service to be provided by the third-party vendor has been certified by the commissioner of education as qualifying for the education credit. The amount assigned for the current and future taxable years may not exceed the maximum allowable education credit for the current taxable year. Both the taxpayer and spouse must consent to the assignment of a refund from a joint return.\nWhen the taxpayer applies to the financial institution or the qualifying organization for a loan to be secured by the assignment under subdivision 2, the taxpayer must sign a written consent on a form prescribed by the commissioner. The consent must authorize the commissioner to disclose to the financial institution or qualifying organization the total amount of state taxes owed or revenue recapture claims filed under chapter 270A against the taxpayer, and the total amount of outstanding assignments made by the taxpayer under this section. For a refund from a joint return, the consent must also authorize the disclosure of taxes, revenue recapture claims, and assignments relating to the taxpayer's spouse, and must be signed by the spouse. The financial institution or qualifying organization may request that the taxpayer provide a copy of the taxpayer's previous year's income tax return, if any, and may assist the taxpayer in requesting a copy of the previous year's return from the commissioner.\n(a) A third-party vendor that receives payment of the amount secured by an assignment must comply with the requirements of this subdivision.\n(b) The third-party vendor must disclose to the taxpayer, in plain language:\n(1) the cost of each product or service for which the third-party vendor separately charges the taxpayer;\n(2) any fees charged to the taxpayer for tax preparation services; and\n(3) for qualifying low-income taxpayers, information on the availability of free tax preparation services.\n(c) The third-party vendor must provide to the taxpayer executed copies of any documents signed by the taxpayer.\nThe commissioner shall prescribe the form of and manner for filing an assignment of a refund under this section.\nThe taxpayer may not revoke an assignment after it has been filed. The assignee must notify the commissioner if the loan secured by the assignment has been paid in full, in which case the assignment is canceled. An assignment is in effect until the amount assigned is refunded in full to the assignee, or until the assignee cancels the assignment.\nWhen a refund assigned under this section is issued by the commissioner, the proceeds of the refund, as defined in subdivision 1, paragraph (c), must be distributed in the following order:\n(1) to satisfy any delinquent tax obligations of the taxpayer which are owed to the commissioner;\n(2) to claimant agencies to satisfy any revenue recapture claims filed against the taxpayer, in the order of priority of the claims set forth in section 270A.10;\n(3) to assignees to satisfy assignments under this section, based on the order in time in which the commissioner received the assignments; and\n(4) to the taxpayer.\nIf there is a dispute between the taxpayer and the assignee after the commissioner has remitted the taxpayer's refund to the assignee, the taxpayer's only remedy is to bring an action against the assignee in court to recover the refund. The action must be brought within two years after the commissioner remits the refund to the assignee. The commissioner may not be a party to the proceeding.\nInformation regarding assignments under this section is classified as private data on individuals.",
	"repealed": false
}