{
	"id": "144F.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/144F.01",
	"title": "144F.01 FIRE PROTECTION AND EMERGENCY MEDICAL SERVICES SPECIAL TAXING DISTRICTS.",
	"text": "For purposes of this section, the following terms have the meanings given.\n(a) \"Political subdivision\" means a county, a statutory or home rule charter city, or a township organized to provide town government.\n(b) \"Governing body\" means a city council for a city, a county board for a county, and a board of supervisors for a town.\n(c) \"Emergency medical services\" means supporting the providing of out-of-hospital emergency medical services including but not limited to first responder or rescue squads recognized by the district, ambulance services licensed under chapter 144E and recognized by the district, medical control functions set out in chapter 144E, communications equipment and systems, and programs of regional emergency medical services authorized by regional boards described in section 144E.52.\n(a) Two or more political subdivisions may establish, by resolution of their governing bodies, a special taxing district to provide fire protection or emergency medical services, or both, in the area of the district, comprising the jurisdiction of each of the political subdivisions forming the district. For a county that participates in establishing a district, the county's jurisdiction comprises the unorganized territory of the county that it designated in its resolution for inclusion in the district. The area of the special taxing district need not be contiguous or its boundaries continuous.\n(b) Before establishing a district under this section, the participating political subdivisions must enter into an agreement that specifies how any liabilities, other than debt issued under subdivision 6, and assets of the district will be distributed if the district is dissolved. The agreement may also include other terms, including a method for apportioning the levy of the district among participating political subdivisions under subdivision 4, paragraph (b), as the political subdivisions determine appropriate. The agreement must be adopted no later than upon passage of the resolution establishing the district under paragraph (a), but may be later amended by agreement of each of the political subdivisions participating in the district.\n(c) If two or more political subdivisions that currently operate separate fire departments seek to merge fire departments into one fire department, or if a political subdivision with an existing fire department requests to join a special taxing district with an established fire department, the resolution under paragraph (a) or agreement under paragraph (b) must specify which, if any, volunteer firefighter pension plan is associated with the district. A special taxing district that operates a fire department under this section may be associated with only one firefighters relief association or one account in the statewide volunteer firefighter plan at one time.\n(d) If the special taxing district includes the operation of a fire department, it must file its resolution establishing the fire protection special taxing district, and any agreements required for the establishment of the special taxing district, with the commissioner of revenue, including any subsequent amendments. If the resolution or agreement does not include sufficient information defining the fire department service area of the fire protection special taxing district, the secretary of the district board must file a written statement with the commissioner defining the fire department service area.\nThe special taxing district established under this section is governed by a board made up initially of representatives of each participating political subdivision in the proportions set out in the establishing resolution, subject to change as provided in the district's charter, if any, or in the district's bylaws. Each participating political subdivision's representative must be an elected member of the governing body of the political subdivision and shall serve at the pleasure of that participant's governing body.\n(a) The district's board may levy a tax on the taxable real and personal property in the district. The proceeds of the levy must be used as provided in subdivision 5. The board shall certify the levy at the times as provided under section 275.07. The board shall provide the county with whatever information is necessary to identify the property that is located within the district. If the boundaries include a part of a parcel, the entire parcel shall be included in the district. The county auditors must spread, collect, and distribute the proceeds of the tax at the same time and in the same manner as provided by law for all other property taxes.\n(b) As an alternative to paragraph (a), the board may apportion its levy among the political subdivisions that are members of the district under a formula or method, with factors such as population, number of service calls, costs of providing service, the market value of improvements, or other measures approved by the governing body of each of the participating political subdivisions. The amount of the levy allocated to each political subdivision must be added to that political subdivision's levy and spread at the same time and in the same manner as provided by law for all other property taxes. The proceeds of the levy must be collected and remitted to the district and used as provided in subdivision 5.\nThe proceeds of property taxes levied under this section must be used to provide fire protection, emergency medical services, or both, to residents of the district and property located in the district, as well as to pay debt issued under subdivision 6. Services may be provided by employees of the district or by contracting for services provided by other governmental or private entities.\n(a) The district may incur debt under chapter 475 when the board determines doing so is necessary to accomplish its duties.\n(b) In addition, the district board may issue certificates of indebtedness or capital notes under section 412.301 to purchase capital equipment. In applying section 412.301, paragraph (e), the following rules apply:\n(1) the taxable property of the entire district must be used to calculate the percent of estimated market value; and\n(2) \"the number of voters at the last municipal election\" means the sum of the number of voters at the last municipal election for each of the cities that is a member of the district plus the number of registered voters in each town that is a participating member of the district.\n(a) In addition to authority expressly granted in this section, a special taxing district established under this section may exercise any power that may be exercised by any of its participating political subdivisions that is necessary or reasonable to support the services set out in subdivision 5. These powers include the authority to participate in state programs and to enforce or carry out state laws related to fire protection or emergency medical services, including programs providing state aid, reimbursement or funding of employee benefits, and authorizing local enforcement of state standards including fire protection related programs and political subdivision powers or responsibilities under chapters 299A, 424A, and 477B; sections 6.495, 353.64, and 423A.022; and any other administrative rules related to the fire code, to the extent the special taxing district meets the qualification criteria and requirements of a program.\n(b) To the extent the district's authority under this subdivision overlaps with or may conflict with the authority of the participating political subdivision, the agreement under subdivision 2, paragraph (b), must provide for allocation of those powers or responsibilities between the participating political subdivisions and the district, and may provide for resolution of conflicts in the exercise of those powers.\n(c) The district may only levy the tax authorized in subdivision 4.\n(a) Additional political subdivisions may be added to a special taxing district established under this section as provided by the board of the district and agreed to in a resolution of the governing body of the political subdivision proposed to be added. The addition of a political subdivision to the district may not cause the district to be out of compliance with subdivision 2, paragraph (c).\n(b) A political subdivision may withdraw from a special taxing district under this section by resolution of its governing body. The political subdivision must notify the board of the special taxing district of the withdrawal by providing a copy of the resolution at least two years in advance of the proposed withdrawal. The taxable property of the withdrawing member is subject to the property tax levy under subdivision 4 for the two taxes payable years following the notice of the withdrawal, unless the board and the withdrawing member agree otherwise by action of their governing bodies. If a political subdivision withdraws from a district for which debt was issued under subdivision 6 when the political subdivision was a participating member, and which is outstanding when the political subdivision withdraws from the district, the taxable property of the withdrawing political subdivision remains subject to the special taxing district levy until the outstanding debt has been paid or defeased. If the district's property tax levy to repay debt was apportioned among the political subdivisions under an alternative formula or method under subdivision 4, paragraph (b), the withdrawing political subdivision is subject to the same percentage of the debt levy as applied in the taxes payable year immediately preceding its withdrawal from the district.\n(c) Notwithstanding subdivision 2, if the district is comprised of two political subdivisions and one of the political subdivisions withdraws, the district can continue to exist.\nThe special taxing district may be dissolved by resolution approved by a majority vote of the board. If the special taxing district is dissolved, the assets and liabilities may be assigned to a successor entity, if any, or otherwise disposed of for public purposes as provided in the agreement adopted under subdivision 2, paragraph (b), or otherwise agreed to by each participating political subdivision. A district may not be dissolved until all debt issued under subdivision 6 has been paid or defeased.\n(a) On or before March 15, 2024, and March 15, 2026, the special taxing district shall submit a levy and expenditure report to the commissioner of revenue and to the house of representatives and senate committees with jurisdiction over taxes and property taxes. Each report must include the amount of the district's levies for taxes payable for each of the two previous years and its actual expenditures of those revenues. Expenditures must be reported by general service category and include a separate category for administrative expenses.\n(b) On or before March 15, 2024, and March 15, 2026, a political subdivision that has established or joined a special taxing district authorized under this section after June 30, 2021, shall submit a levy and expenditure report to the commissioner of revenue and to the house of representatives and senate committees with jurisdiction over taxes and property taxes. The report must include:\n(1) the amount of the political subdivision's levy, and its actual expenditure of the subdivision's levy revenues, including the amount attributable to fire protection and emergency medical services, for taxes payable in each of the two taxes payable years prior to establishing or joining a special taxing district authorized under this section;\n(2) the political subdivision's levy, and its actual expenditure of the subdivision's levy revenues, for taxes payable in each of the taxes payable years after establishing or joining a special taxing district authorized under this section, up to and including taxes payable in 2024 and taxes payable in 2026; and\n(3) a certification from the political subdivision that the subdivision's levy for each of the taxes payable years after establishing or joining a special taxing district authorized under this section, up to, and including, taxes payable in 2024, and taxes payable in 2026, does not include expenditures for fire protection, emergency medical services, or both, except as provided in subdivision 4, paragraph (b), or those necessary to establish or join a district as provided in this section.",
	"repealed": false
}