{
	"id": "79A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.23",
	"title": "79A.23 COMMERCIAL SELF-INSURANCE GROUP REPORTING REQUIREMENTS.",
	"text": "Each commercial self-insurance group shall submit the following documents to the commissioner.\n(a) An annual report shall be submitted by April 1 showing the incurred losses, paid and unpaid, specifying indemnity and medical losses by classification, payroll by classification, and current estimated outstanding liability for workers' compensation on a calendar year basis, in a manner and on forms available from the commissioner. In addition each group will submit a quarterly interim loss report showing incurred losses for all its membership.\n(b) Each commercial self-insurance group shall submit within 45 days of the end of each quarter:\n(1) a schedule showing all the members who participate in the group, their date of inception, and date of withdrawal, if applicable;\n(2) a separate section identifying which members were added or withdrawn during that quarter; and\n(3) an internal financial statement and copies of the fiscal agent's statements supporting the balances in the common claims fund.\n(c) The commercial self-insurance group shall submit an annual certified financial audit report of the commercial self-insurance group fund by April 1 of the following year. The report must be accompanied by an expense schedule showing the commercial self-insurance group's operational costs for the same year including service company charges, accounting and actuarial fees, fund administration charges, reinsurance premiums, commissions, and any other costs associated with the administration of the group program.\n(d) An officer of the commercial self-insurance group shall, under oath, attest to the accuracy of each report submitted under paragraphs (a), (b), and (c). Upon sufficient cause, the commissioner shall require the commercial self-insurance group to submit a certified audit of payroll and claim records conducted by an independent auditor approved by the commissioner, based on generally accepted accounting principles and generally accepted auditing standards, and supported by an actuarial review and opinion of the future contingent liabilities. The basis for sufficient cause shall include the following factors:\n(1) where the losses reported appear significantly different from similar types of groups;\n(2) where major changes in the reports exist from year to year, which are not solely attributable to economic factors; or\n(3) where the commissioner has reason to believe that the losses and payroll in the report do not accurately reflect the losses and payroll of the commercial self-insurance group.\nIf any discrepancy is found, the commissioner shall require changes in the commercial self-insurance group's business plan or service company record-keeping practices.\n(e) Each commercial self-insurance group shall submit by September 15 a copy of the group's annual federal and state income tax returns or provide proof that it has received an exemption from these filings.\n(f) With the annual loss report each commercial self-insurance group shall report to the commissioner any worker's compensation claim where the full, undiscounted value is estimated to exceed $50,000, in a manner and on forms prescribed by the commissioner.\n(g) Each commercial self-insurance group shall submit by May 1 a list of all members and the percentage of premium each represents to the total group's premium for the previous calendar year.\n(h) Each commercial self-insurance group shall submit by October 15 the following documents prepared by the group's certified public accountant:\n(1) a compiled combined financial statement of group members and a list of members included in this statement. An \"Agreed-Upon Procedures\" report, as determined by the commissioner, indicating combined net worth, total assets, and net income of the group members may be filed in lieu of the compiled combined financial statement; and\n(2) a report that the statements which were combined have met the requirements of subdivision 2.\n(i) If any group member comprises over 25 percent of total group premium, that member's financial statement must be reviewed or audited, and, at the commissioner's option, must be filed with the commissioner by October 15 of the following year.\n(j) Each commercial self-insurance group shall submit a copy of each member's accountant's report letter from the reports used in compiling the combined financial statements. This requirement does not apply to any group that has been in existence for at least three years.\n(a) Each member of the commercial self-insurance group shall, by September 15, submit to the group its most recent annual financial statement, together with other financial information the group may require. These financial statements submitted must not have a fiscal year end date older than January 15 of the group's calendar year end. Individual group members constituting at least 25 percent of the group's annual premium shall submit to the group reviewed or audited financial statements. The remaining members must submit compilation level statements.\n(b) For groups that have been in existence for at least three years, individual group members may satisfy the requirements of paragraph (a) by submitting compiled, reviewed, or audited statements or the most recent federal income tax return filed by the member.\n(c) Groups that have been in existence for at least five years may satisfy the requirement of paragraph (a) through submissions from members representing at least 50 percent of the group's total earned premium. Of those submissions, those from members representing at least 25 percent of the entire group's total earned premium must be audited or reviewed financial statements. The remainder of the submissions may be compiled, reviewed, or audited financial statements or the most recent tax return filed by the members.\n(a) The commissioner may conduct an operational audit of the commercial self-insurance group's claim handling and reserve practices as well as its underwriting procedures to determine if they adhere to the group's business plan and sound business practices. The commissioner may select outside consultants to assist in conducting the audit. After completion of the audit, the commissioner shall either renew or revoke the commercial self-insurance group's authority to self-insure. The commissioner may also order any changes deemed necessary in the claims handling, reserving practices, or underwriting procedures of the group.\n(b) The cost of the operational audit shall be borne by the commercial self-insurance group.\nEach commercial self-insurance group will annually file a unit statistical report to the Minnesota Workers' Compensation Insurers Association.",
	"repealed": false
}