{
	"id": "273.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.124",
	"title": "273.124 HOMESTEAD DETERMINATION; SPECIAL RULES.",
	"text": "(a) Residential real estate that is occupied and used for the purposes of a homestead by its owner, who must be a Minnesota resident, is a residential homestead.\nAgricultural land, as defined in section 273.13, subdivision 23, that is occupied and used as a homestead by its owner, who must be a Minnesota resident, is an agricultural homestead.\nDates for establishment of a homestead and homestead treatment provided to particular types of property are as provided in this section.\nProperty held by a trustee under a trust is eligible for homestead classification if the requirements under this chapter are satisfied.\nThe assessor shall require proof, as provided in subdivision 13, of the facts upon which classification as a homestead may be determined. Notwithstanding any other law, the assessor may at any time require a homestead application to be filed in order to verify that any property classified as a homestead continues to be eligible for homestead status. Notwithstanding any other law to the contrary, the Department of Revenue may, upon request from an assessor, verify whether an individual who is requesting or receiving homestead classification has filed a Minnesota income tax return as a resident for the most recent taxable year for which the information is available.\nWhen there is a name change or a transfer of homestead property, the assessor may reclassify the property in the next assessment unless a homestead application is filed to verify that the property continues to qualify for homestead classification.\n(b) For purposes of this section, homestead property shall include property which is used for purposes of the homestead but is separated from the homestead by a road, street, lot, waterway, or other similar intervening property. The term \"used for purposes of the homestead\" shall include but not be limited to uses for gardens, garages, or other outbuildings commonly associated with a homestead, but shall not include vacant land held primarily for future development. In order to receive homestead treatment for the noncontiguous property, the owner must use the property for the purposes of the homestead, and must apply to the assessor, both by the deadlines given in subdivision 9. After initial qualification for the homestead treatment, additional applications for subsequent years are not required.\n(c) Residential real estate that is occupied and used for purposes of a homestead by a relative of the owner is a homestead but only to the extent of the homestead treatment that would be provided if the related owner occupied the property. For purposes of this paragraph and paragraph (g), \"relative\" means a parent, stepparent, child, stepchild, grandparent, grandchild, brother, sister, uncle, aunt, nephew, or niece. This relationship may be by blood or marriage. Property that has been classified as seasonal residential recreational property at any time during which it has been owned by the current owner or spouse of the current owner will not be reclassified as a homestead unless it is occupied as a homestead by the owner; this prohibition also applies to property that, in the absence of this paragraph, would have been classified as seasonal residential recreational property at the time when the residence was constructed. Neither the related occupant nor the owner of the property may claim a property tax refund under chapter 290A for a homestead occupied by a relative. In the case of a residence located on agricultural land, only the house, garage, and immediately surrounding one acre of land shall be classified as a homestead under this paragraph, except as provided in paragraph (d).\n(d) Agricultural property that is occupied and used for purposes of a homestead by a relative of the owner, is a homestead, only to the extent of the homestead treatment that would be provided if the related owner occupied the property, and only if all of the following criteria are met:\n(1) the relative who is occupying the agricultural property is a grandchild, child, sibling, parent, grandparent, stepparent, stepchild, uncle, aunt, nephew, or niece of the owner of the agricultural property or of the spouse of the owner;\n(2) the owner of the agricultural property must be a Minnesota resident;\n(3) the owner of the agricultural property must not receive homestead treatment on any other agricultural property in Minnesota; and\n(4) the owner of the agricultural property is limited to only one agricultural homestead per family under this paragraph.\nNeither the related occupant nor the owner of the property may claim a property tax refund under chapter 290A for a homestead occupied by a relative qualifying under this paragraph. For purposes of this paragraph, \"agricultural property\" means the house, garage, other farm buildings and structures, and agricultural land.\nApplication must be made to the assessor by the owner of the agricultural property to receive homestead benefits under this paragraph. The assessor may require the necessary proof that the requirements under this paragraph have been met.\n(e) In the case of property owned by a property owner who is married, the assessor must not deny homestead treatment in whole or in part if only one of the spouses occupies the property and the other spouse is absent due to: (1) marriage dissolution proceedings, (2) legal separation, (3) employment or self-employment in another location, or (4) other personal circumstances causing the spouses to live separately, not including an intent to obtain two homestead classifications for property tax purposes. To qualify under clause (3), the spouse's place of employment or self-employment must be at least 50 miles distant from the other spouse's place of employment, and the homesteads must be at least 50 miles distant from each other.\n(f) The assessor must not deny homestead treatment in whole or in part if:\n(1) in the case of a property owner who is not married, the owner is absent due to residence in a nursing home, boarding care facility, or an elderly assisted living facility property as defined in section 273.13, subdivision 25a, and the property is not otherwise occupied; or\n(2) in the case of a property owner who is married, the owner or the owner's spouse or both are absent due to residence in a nursing home, boarding care facility, or an elderly assisted living facility property as defined in section 273.13, subdivision 25a, and the property is not occupied or is occupied only by the owner's spouse.\n(g) If an individual is purchasing property with the intent of claiming it as a homestead and is required by the terms of the financing agreement to have a relative shown on the deed as a co-owner, the assessor shall allow a full homestead classification. This provision only applies to first-time purchasers, whether married or single, or to a person who had previously been married and is purchasing as a single individual for the first time. The application for homestead benefits must be on a form prescribed by the commissioner and must contain the data necessary for the assessor to determine if full homestead benefits are warranted.\n(h) If residential or agricultural real estate is occupied and used for purposes of a homestead by a child of a deceased owner and the property is subject to jurisdiction of probate court, the child shall receive relative homestead classification under paragraph (c) or (d) to the same extent they would be entitled to it if the owner was still living, until the probate is completed. For purposes of this paragraph, \"child\" includes a relationship by blood or by marriage.\n(i) If a single-family home, duplex, or triplex classified as either residential homestead or agricultural homestead is also used to provide licensed child care, the portion of the property used for licensed child care must be classified as a part of the homestead property.\n(a) The total value of planned community common elements, as defined in chapter 515B, including the value added as provided in this paragraph, must have the benefit of homestead treatment or other special classification if the unit in the planned community otherwise qualifies. The value of a planned community unit, as defined in chapter 515B, must be increased by the value added by the right to use any common elements in connection with the planned community. The common elements of the development must not be separately taxed.\n(b) Condominium property qualifying as a homestead under section 515A.1-105 and property owned by a cooperative association that qualifies as a homestead must have the benefit of homestead treatment or other special classification if the condominium or cooperative association property otherwise qualifies.\n(c) If a unit in a common interest community is owned by the occupant and used for the purposes of a homestead but is located upon land which is leased, that leased land must be valued and assessed as if it were homestead property within class 1 if all of the following criteria are met:\n(1) the occupant is using the unit as a permanent residence;\n(2) the occupant or the cooperative association is paying the ad valorem property taxes and any special assessments levied against the land and structure;\n(3) the occupant or the cooperative association has signed a land lease; and\n(4) the term of the land lease is at least 50 years, notwithstanding the fact that the amount of the rental payment may be renegotiated at shorter intervals.\n(a) When property is owned by a corporation or association organized under chapter 308A, 308B, or 308C, and each person who owns a share or shares in the corporation or association is entitled to occupy a building on the property, or a unit within a building on the property, the corporation or association may claim homestead treatment for each dwelling, or for each unit in the case of a building containing several dwelling units, or for the part of the value of the building occupied by a shareholder. Each building or unit must be designated by legal description or number. The net tax capacity of each building or unit that qualifies for assessment as a homestead under this subdivision must include not more than one-half acre of land, if platted, nor more than 80 acres if unplatted. The net tax capacity of the property is the sum of the net tax capacities of each of the respective buildings or units comprising the property, including the net tax capacity of each unit's or building's proportionate share of the land and any common buildings. To qualify for the treatment provided by this subdivision, the corporation or association must be wholly owned by persons having a right to occupy a building or unit owned by the corporation or association. A charitable corporation organized under the laws of Minnesota and not otherwise exempt thereunder with no outstanding stock qualifies for homestead treatment with respect to member residents of the dwelling units who have purchased and hold residential participation warrants entitling them to occupy the units.\n(b) To the extent provided in paragraph (a), a cooperative or corporation organized under chapter 308A, 308B, or 308C may obtain separate assessment and valuation, and separate property tax statements for each residential homestead, residential nonhomestead, or for each seasonal residential recreational building or unit not used for commercial purposes. The appropriate classification rates under section 273.13 shall be applicable as if each building or unit were a separate tax parcel; provided, however, that the tax parcel which exists at the time the cooperative or corporation makes application under this subdivision shall be a single parcel for purposes of property taxes or the enforcement and collection thereof, other than as provided in paragraph (a) or this paragraph.\n(c) A member of a corporation or association may initially obtain the separate assessment and valuation and separate property tax statements, as provided in paragraph (b), by applying to the assessor by June 30 of the assessment year.\n(d) When a building, or dwelling units within a building, no longer qualify under paragraph (a) or (b), the current owner must notify the assessor within 30 days. Failure to notify the assessor within 30 days shall result in the loss of benefits under paragraph (a) or (b) for taxes payable in the year that the failure is discovered. For these purposes, \"benefits under paragraph (a) or (b)\" means the difference in the net tax capacity of the building or units which no longer qualify as computed under paragraph (a) or (b) and as computed under the otherwise applicable law, times the local tax rate applicable to the building for that taxes payable year. Upon discovery of a failure to notify, the assessor shall inform the auditor of the difference in net tax capacity for the building or buildings in which units no longer qualify, and the auditor shall calculate the benefits under paragraph (a) or (b). Such amount, plus a penalty equal to 100 percent of that amount, shall then be demanded of the building's owner. The property owner may appeal the county's determination by serving copies of a petition for review with county officials as provided in section 278.01 and filing a proof of service as provided in section 278.01 with the Minnesota Tax Court within 60 days of the date of the notice from the county. The appeal shall be governed by the Tax Court procedures provided in chapter 271, for cases relating to the tax laws as defined in section 271.01, subdivision 5; disregarding sections 273.125, subdivision 5, and 278.03, but including section 278.05, subdivision 2. If the amount of the benefits under paragraph (a) or (b) and penalty are not paid within 60 days, and if no appeal has been filed, the county auditor shall certify the amount of the benefit and penalty to the succeeding year's tax list to be collected as part of the property taxes on the affected property.\n[See Note.]\n(a) When a manufactured home park is owned by a corporation or association organized under chapter 308A, 308B, or 308C, and each person who owns a share or shares in the corporation or association is entitled to occupy a lot within the park, the corporation or association may claim homestead treatment for the park. Each lot must be designated by legal description or number, and each lot is limited to not more than one-half acre of land.\n(b) The manufactured home park shall be entitled to homestead treatment if all of the following criteria are met:\n(1) the occupant or the cooperative corporation or association is paying the ad valorem property taxes and any special assessments levied against the land and structure either directly, or indirectly through dues to the corporation or association; and\n(2) the corporation or association organized under chapter 308A, 308B, or 308C is wholly owned by persons having a right to occupy a lot owned by the corporation or association.\n(c) A charitable corporation, organized under the laws of Minnesota with no outstanding stock, and granted a ruling by the Internal Revenue Service for 501(c)(3) tax-exempt status, qualifies for homestead treatment with respect to a manufactured home park if its members hold residential participation warrants entitling them to occupy a lot in the manufactured home park.\n(d) \"Homestead treatment\" under this subdivision means the classification rate provided for class 4c property classified under section 273.13, subdivision 25, paragraph (d), clause (5), item (ii), and the homestead market value exclusion under section 273.13, subdivision 35, does not apply.\n[See Note.]\nWhen a building containing several dwelling units is owned by an entity organized under chapter 317A and operating as a nonprofit corporation which enters into membership agreements with persons under which they are entitled to life occupancy in a unit in the building, homestead classification must be given to each unit so occupied and the entire building must be assessed in the manner provided in subdivision 3 for cooperatives and charitable corporations.\nWhen a building containing several dwelling units is owned by an entity which is regulated under the provisions of chapter 80D and operating as a continuing care facility enters into residency agreements with persons who occupy a unit in the building and the residency agreement entitles the resident to occupancy in the building after personal assets are exhausted and regardless of ability to pay the monthly maintenance fee, homestead classification shall be given to each unit so occupied and the entire building shall be assessed in the manner provided in subdivision 3 for cooperatives and charitable corporations.\nWhen one or more dwellings or one or more buildings which each contain several dwelling units is owned by a nonprofit corporation subject to the provisions of chapter 317A and qualifying under section 501(c)(3) or 501(c)(4) of the Internal Revenue Code, or a limited partnership which corporation or partnership operates the property in conjunction with a cooperative association, and has received public financing, homestead treatment may be claimed by the cooperative association on behalf of the members of the cooperative for each dwelling unit occupied by a member of the cooperative. The cooperative association must provide the assessor with the Social Security numbers or individual taxpayer identification numbers of those members. To qualify for the treatment provided by this subdivision, the following conditions must be met:\n(a) the cooperative association must be organized under chapter 308A, 308B, or 308C and all voting members of the board of directors must be resident tenants of the cooperative and must be elected by the resident tenants of the cooperative;\n(b) the cooperative association must have a lease for occupancy of the property for a term of at least 20 years, which permits the cooperative association, while not in default on the lease, to participate materially in the management of the property, including material participation in establishing budgets, setting rent levels, and hiring and supervising a management agent;\n(c) to the extent permitted under state or federal law, the cooperative association must have a right under a written agreement with the owner to purchase the property if the owner proposes to sell it; if the cooperative association does not purchase the property it is offered for sale, the owner may not subsequently sell the property to another purchaser at a price lower than the price at which it was offered for sale to the cooperative association unless the cooperative association approves the sale;\n(d) a minimum of 40 percent of the cooperative association's members must have incomes at or less than 60 percent of area median gross income as determined by the United States Secretary of Housing and Urban Development under section 142(d)(2)(B) of the Internal Revenue Code. For purposes of this clause, \"member income\" means the income of a member existing at the time the member acquires cooperative membership;\n(e) if a limited partnership owns the property, it must include as the managing general partner a nonprofit organization operating under the provisions of chapter 317A and qualifying under section 501(c)(3) or 501(c)(4) of the Internal Revenue Code and the limited partnership agreement must provide that the managing general partner have sufficient powers so that it materially participates in the management and control of the limited partnership;\n(f) prior to becoming a member of a leasehold cooperative described in this subdivision, a person must have received notice that (1) describes leasehold cooperative property in plain language, including but not limited to the effects of classification under this subdivision on rents, property taxes and tax credits or refunds, and operating expenses, and (2) states that copies of the articles of incorporation and bylaws of the cooperative association, the lease between the owner and the cooperative association, a sample sublease between the cooperative association and a tenant, and, if the owner is a partnership, a copy of the limited partnership agreement, can be obtained upon written request at no charge from the owner, and the owner must send or deliver the materials within seven days after receiving any request;\n(g) if a dwelling unit of a building was occupied on the 60th day prior to the date on which the unit became leasehold cooperative property described in this subdivision, the notice described in paragraph (f) must have been sent by first class mail to the occupant of the unit at least 60 days prior to the date on which the unit became leasehold cooperative property. For purposes of the notice under this paragraph, the copies of the documents referred to in paragraph (f) may be in proposed version, provided that any subsequent material alteration of those documents made after the occupant has requested a copy shall be disclosed to any occupant who has requested a copy of the document. Copies of the articles of incorporation and certificate of limited partnership shall be filed with the secretary of state after the expiration of the 60-day period unless the change to leasehold cooperative status does not proceed;\n(h) the county attorney of the county in which the property is located must certify to the assessor that the property meets the requirements of this subdivision;\n(i) the public financing received must be from at least one of the following sources:\n(1) tax increment financing proceeds used for the acquisition or rehabilitation of the building or interest rate write-downs relating to the acquisition of the building;\n(2) government issued bonds exempt from taxes under section 103 of the Internal Revenue Code, the proceeds of which are used for the acquisition or rehabilitation of the building;\n(3) programs under section 221(d)(3), 202, or 236, of Title II of the National Housing Act;\n(4) rental housing program funds under Section 8 of the United States Housing Act of 1937, as amended, or the market rate family graduated payment mortgage program funds administered by the Minnesota Housing Finance Agency that are used for the acquisition or rehabilitation of the building;\n(5) low-income housing credit under section 42 of the Internal Revenue Code;\n(6) public financing provided by a local government used for the acquisition or rehabilitation of the building, including grants or loans from (i) federal community development block grants; (ii) HOME block grants; or (iii) residential rental bonds issued under chapter 474A; or\n(7) other rental housing program funds provided by the Minnesota Housing Finance Agency for the acquisition or rehabilitation of the building;\n(j) at the time of the initial request for homestead classification or of any transfer of ownership of the property, the governing body of the municipality in which the property is located must hold a public hearing and make the following findings:\n(1) that the granting of the homestead treatment of the apartment's units will facilitate safe, clean, affordable housing for the cooperative members that would otherwise not be available absent the homestead designation;\n(2) that the owner has presented information satisfactory to the governing body showing that the savings garnered from the homestead designation of the units will be used to reduce tenant's rents or provide a level of furnishing or maintenance not possible absent the designation; and\n(3) that the requirements of paragraphs (b), (d), and (i) have been met.\nHomestead treatment must be afforded to units occupied by members of the cooperative association and the units must be assessed as provided in subdivision 3, provided that any unit not so occupied shall be classified and assessed pursuant to the appropriate class. No more than three acres of land may, for assessment purposes, be included with each dwelling unit that qualifies for homestead treatment under this subdivision.\nWhen dwelling units no longer qualify under this subdivision, the current owner must notify the assessor within 60 days. Failure to notify the assessor within 60 days shall result in the loss of benefits under this subdivision for taxes payable in the year that the failure is discovered. For these purposes, \"benefits under this subdivision\" means the difference in the net tax capacity of the units which no longer qualify as computed under this subdivision and as computed under the otherwise applicable law, times the local tax rate applicable to the building for that taxes payable year. Upon discovery of a failure to notify, the assessor shall inform the auditor of the difference in net tax capacity for the building or buildings in which units no longer qualify, and the auditor shall calculate the benefits under this subdivision. Such amount, plus a penalty equal to 100 percent of that amount, shall then be demanded of the building's owner. The property owner may appeal the county's determination by serving copies of a petition for review with county officials as provided in section 278.01 and filing a proof of service as provided in section 278.01 with the Minnesota Tax Court within 60 days of the date of the notice from the county. The appeal shall be governed by the Tax Court procedures provided in chapter 271, for cases relating to the tax laws as defined in section 271.01, subdivision 5; disregarding sections 273.125, subdivision 5, and 278.03, but including section 278.05, subdivision 2. If the amount of the benefits under this subdivision and penalty are not paid within 60 days, and if no appeal has been filed, the county auditor shall certify the amount of the benefit and penalty to the succeeding year's tax list to be collected as part of the property taxes on the affected buildings.\n[See Note.]\nPreliminary approval for classification as a leasehold cooperative may be granted to property when a developer proposes to construct one or more residential dwellings or buildings using funds provided by the Minnesota Housing Finance Agency if all of the following conditions are met:\n(a) The developer must present an affidavit to the county attorney and to the governing body of the municipality that includes a statement of the developer's intention to comply with all requirements in subdivision 6 and a detailed description of the plan for doing so.\n(b) The commissioner of the Minnesota Housing Finance Agency must provide the county attorney and governing body with a description of the financing and related terms the commissioner proposes to provide with respect to the project, together with an objective assessment of the likelihood that the project will comply with the requirements of subdivision 6.\n(c) The county attorney must review the materials provided under paragraphs (a) and (b), and may require the developer or the Minnesota Housing Finance Agency to provide additional information. If the county attorney determines that it is reasonably likely that the project will meet the requirements of this subdivision, the county attorney shall provide preliminary approval to treatment of the property as a leasehold cooperative.\n(d) The governing body shall conduct a public hearing as provided in subdivision 6, paragraph (j), and make its preliminary findings based on the information provided by the developer and the Minnesota Housing Finance Agency.\nUpon completion of the project and creation of the leasehold cooperative, actual compliance with the requirements of this subdivision must be demonstrated, and certified by the county attorney. A second hearing by the governing body is not required.\nIf the county attorney finds that the homestead treatment granted pursuant to a preliminary approval under this subdivision must be revoked because the completed project failed to meet the requirements of this subdivision, the benefits of the treatment shall be recaptured. The county assessor shall determine the amount by which the tax imposed on the property was reduced because it was treated as a leasehold cooperative. The developer shall be charged an amount equal to the tax reduction received or, if the county attorney determines that the failure to meet the requirements was due to the developer's intentional disregard of the requirements, 150 percent of the tax reduction received. The penalty must be paid to the county treasurer within 90 days after receipt of a statement from the treasurer. The proceeds of the penalty shall be distributed to the local taxing jurisdictions in proportion to the amounts of their levies on the property.\nFor purposes of class 1 determinations, homesteads include:\n(a) buildings and appurtenances owned and used by the occupant as a permanent residence which are located upon land the title to which is vested in a person or entity other than the occupant;\n(b) all buildings and appurtenances located upon land owned by the occupant and used for the purposes of a homestead together with the land upon which they are located, if all of the following criteria are met:\n(1) the occupant is using the property as a permanent residence;\n(2) the occupant is paying the property taxes and any special assessments levied against the property;\n(3) the occupant has signed a lease which has an option to purchase the buildings and appurtenances;\n(4) the term of the lease is at least five years; and\n(5) the occupant has made a down payment of at least $5,000 in cash if the property was purchased by means of a contract for deed or subject to a mortgage;\n(c) all buildings and appurtenances and the land upon which they are located that are used for purposes of a homestead, if all of the following criteria are met:\n(1) the land is owned by a utility, which maintains ownership of the land in order to facilitate compliance with the terms of its hydroelectric project license from the federal Energy Regulatory Commission;\n(2) the land is leased for a term of 20 years or more;\n(3) the occupant is using the property as a permanent residence; and\n(4) the occupant is paying the property taxes and any special assessments levied against the property.\nAny taxpayer meeting all the requirements of this paragraph must notify the county assessor, or the assessor who has the powers of the county assessor pursuant to section 273.063, in writing, as soon as possible after signing the lease agreement and occupying the buildings as a homestead.\n(a) Each family farm corporation; each joint family farm venture; and each limited liability company or partnership which operates a family farm; is entitled to class 1b under section 273.13, subdivision 22, paragraph (b), or class 2a assessment for one homestead occupied by a shareholder, member, or partner thereof who is residing on the land, and actively engaged in farming of the land owned by the family farm corporation, joint family farm venture, limited liability company, or partnership. Homestead treatment applies even if:\n(1) legal title to the property is in the name of the family farm corporation, joint family farm venture, limited liability company, or partnership, and not in the name of the person residing on it; or\n(2) the family farm is operated by a family farm corporation, joint family farm venture, partnership, or limited liability company other than the family farm corporation, joint family farm venture, partnership, or limited liability company that owns the land, provided that:\n(i) the shareholder, member, or partner residing on and actively engaged in farming the land is a shareholder, member, or partner of the family farm corporation, joint family farm venture, partnership, or limited liability company that is operating the farm; and\n(ii) more than half of the shareholders, members, or partners of each family farm corporation, joint family farm venture, partnership, or limited liability company are persons or spouses of persons who are a qualifying relative under section 273.124, subdivision 1, paragraphs (c) and (d).\n\"Family farm corporation,\" \"family farm,\" and \"partnership operating a family farm\" have the meanings given in section 500.24, except that the number of allowable shareholders, members, or partners under this subdivision shall not exceed 12. \"Limited liability company\" has the meaning contained in sections 322C.0102, subdivision 12, and 500.24, subdivision 2, paragraphs (l) and (m). \"Joint family farm venture\" means a cooperative agreement among two or more farm enterprises authorized to operate a family farm under section 500.24.\n(b) In addition to property specified in paragraph (a), any other residences owned by family farm corporations, joint family farm ventures, limited liability companies, or partnerships described in paragraph (a) which are located on agricultural land and occupied as homesteads by its shareholders, members, or partners who are actively engaged in farming on behalf of that corporation, joint farm venture, limited liability company, or partnership must also be assessed as class 2a property or as class 1b property under section 273.13.\n(c) Agricultural property that is owned by a member, partner, or shareholder of a family farm corporation or joint family farm venture, limited liability company operating a family farm, or by a partnership operating a family farm and leased to the family farm corporation, limited liability company, partnership, or joint farm venture, as defined in paragraph (a), is eligible for classification as class 1b or class 2a under section 273.13, if the owner is actually residing on the property, and is actually engaged in farming the land on behalf of that corporation, joint farm venture, limited liability company, or partnership. This paragraph applies without regard to any legal possession rights of the family farm corporation, joint family farm venture, limited liability company, or partnership under the lease.\n(d) Nonhomestead agricultural property that is owned by a family farm corporation, joint farm venture, limited liability company, or partnership; and located not farther than four townships or cities, or combination thereof, from agricultural land that is owned, and used for the purposes of a homestead by an individual who is a shareholder, member, or partner of the corporation, venture, company, or partnership; is entitled to receive the first tier homestead classification rate on any remaining market value in the first homestead class tier that is in excess of the market value of the shareholder's, member's, or partner's class 2 agricultural homestead property, if the owner, or someone acting on the owner's behalf notifies the county assessor by July 1 that the property may be eligible under this paragraph for the current assessment year, for taxes payable in the following year. As used in this paragraph, \"agricultural property\" means property classified as 2a under section 273.13, along with any contiguous property classified as 2b under section 273.13, if the contiguous 2a and 2b properties are under the same ownership.\nAny property that was not used for the purpose of a homestead on the assessment date, but which was used for the purpose of a homestead on December 31 of a year, constitutes class 1 or class 2a.\nAny taxpayer meeting the requirements of this subdivision must notify the county assessor, or the assessor who has the powers of the county assessor under section 273.063, in writing, by December 31 of the year of occupancy in order to qualify under this subdivision. The assessor must not deny full homestead treatment to a property that is partially homesteaded on January 2 but occupied for the purpose of a full homestead on December 31 of a year.\nThe county assessor and the county auditor may make the necessary changes on their assessment and tax records to provide for proper homestead classification as provided in this subdivision.\nIf homestead classification has not been requested as of December 31, the assessor will classify the property as nonhomestead for the current assessment year for taxes payable in the following year, provided that the owner of any property qualifying under this subdivision, which has not been accorded the benefits of this subdivision, may be entitled to receive homestead classification by proper application as provided in section 375.192.\nThe county assessor may publish in a newspaper of general circulation within the county a notice requesting the public to file an application for homestead as soon as practicable after acquisition of a homestead, but no later than December 31.\nThe county assessor shall publish in a newspaper of general circulation within the county no later than December 1 of each year a notice informing the public of the requirement to file an application for homestead by December 31.\nIn the case of manufactured homes assessed as personal property, the homestead must be established, and a homestead classification requested, by May 29 of the assessment year. The assessor may include information on these deadlines for manufactured homes assessed as personal property in the published notice or notices.\nMS 2010 [Repealed, 2011 c 112 art 7 s 9]\nIf the assessor has classified a property as both homestead and nonhomestead, the reductions in tax provided under sections 273.135 and 273.1391 apply to the value of both the homestead and the nonhomestead portions of the property.\n(a) Real estate actually occupied and used for the purpose of a homestead by a person, or by a member of that person's immediate family shall be classified as a homestead even though the person or family is absent if (1) the person or the person's family is absent solely because the person is on active duty with the armed forces of the United States, or is serving as a volunteer under the VISTA or Peace Corps program; (2) the owner intends to return as soon as discharged or relieved from service; and (3) the owner claims it as a homestead. A person who knowingly makes or submits to an assessor an affidavit or other statement that is false in any material matter to obtain or aid another in obtaining a benefit under this subdivision is guilty of a felony.\n(b) In the case of a person who is absent solely because the person is on active duty with the United States armed forces, homestead classification must be granted as provided in this paragraph if the requirements of paragraph (a), clauses (1) to (3), are met, even if the property has not been occupied as a homestead by the person or a member of the person's family. To qualify for this classification, the person who acquires the property must notify the assessor of the acquisition and of the person's absence due to military service. When the person returns from military service and occupies the property as a homestead, the person shall notify the assessor, who will provide for abatement of the difference between the nonhomestead and homestead taxes for the current and two preceding years, not to exceed the time during which the person owned the property.\n(a) A person who meets the homestead requirements under subdivision 1 must file a homestead application with the county assessor to initially obtain homestead classification.\n(b) The commissioner shall prescribe the content, format, and manner of the homestead application required to be filed under this chapter pursuant to section 270C.30. The application must clearly inform the taxpayer that this application must be signed by all owners who occupy the property or by the qualifying relative and returned to the county assessor in order for the property to receive homestead treatment.\n(c) Every property owner applying for homestead classification must furnish to the county assessor the Social Security number or individual taxpayer identification number of each occupant who is listed as an owner of the property on the deed of record, the name and address of each owner who does not occupy the property, and the name and Social Security number or individual taxpayer identification number of the spouse of each occupying owner. The application must be signed by each owner who occupies the property and by each owner's spouse who occupies the property, or, in the case of property that qualifies as a homestead under subdivision 1, paragraph (c), by the qualifying relative.\nIf a property owner occupies a homestead, the property owner's spouse may not claim another property as a homestead unless the property owner and the property owner's spouse file with the assessor an affidavit or other proof required by the assessor stating that the property qualifies as a homestead under subdivision 1, paragraph (e).\nOwners or spouses occupying residences owned by their spouses and previously occupied with the other spouse, either of whom fail to include the other spouse's name and Social Security number or individual taxpayer identification number on the homestead application or provide the affidavits or other proof requested, will be deemed to have elected to receive only partial homestead treatment of their residence. The remainder of the residence will be classified as nonhomestead residential. When an owner or spouse's name and Social Security number or individual taxpayer identification number appear on homestead applications for two separate residences and only one application is signed, the owner or spouse will be deemed to have elected to homestead the residence for which the application was signed.\n(d) If residential real estate is occupied and used for purposes of a homestead by a relative of the owner and qualifies for a homestead under subdivision 1, paragraph (c), in order for the property to receive homestead status, a homestead application must be filed with the assessor. The Social Security number or individual taxpayer identification number of each relative occupying the property and the name and Social Security number or individual taxpayer identification number of the spouse of a relative occupying the property shall be required on the homestead application filed under this subdivision. If a different relative of the owner subsequently occupies the property, the owner of the property must notify the assessor within 30 days of the change in occupancy. The Social Security number or individual taxpayer identification number of a relative occupying the property or the spouse of a relative occupying the property is private data on individuals as defined by section 13.02, subdivision 12, but may be disclosed to the commissioner of revenue, or, for the purposes of proceeding under the Revenue Recapture Act to recover personal property taxes owing, to the county treasurer.\n(e) The homestead application shall also notify the property owners that if the property is granted homestead status for any assessment year, that same property shall remain classified as homestead until the property is sold or transferred to another person, or the owners, the spouse of the owner, or the relatives no longer use the property as their homestead. Upon the sale or transfer of the homestead property, a certificate of value must be timely filed with the county auditor as provided under section 272.115. Failure to notify the assessor within 30 days that the property has been sold, transferred, or that the owner, the spouse of the owner, or the relative is no longer occupying the property as a homestead, shall result in the penalty provided under this subdivision and the property will lose its current homestead status.\n(f) If a homestead application has not been filed with the county by December 31, the assessor shall classify the property as nonhomestead for the current assessment year for taxes payable in the following year, provided that the owner may be entitled to receive the homestead classification by proper application under section 375.192.\nAt the request of the commissioner, each county must give the commissioner a list that includes the name and Social Security number or individual taxpayer identification number of each occupant of homestead property who is the property owner, property owner's spouse, qualifying relative of a property owner, or a spouse of a qualifying relative. The commissioner shall use the information provided on the lists as appropriate under the law, including for the detection of improper claims by owners, or relatives of owners, under chapter 290A.\n(a) If the commissioner finds that a property owner may be claiming a fraudulent homestead, the commissioner shall notify the appropriate counties. Within 90 days of the notification, the county assessor shall investigate to determine if the homestead classification was properly claimed. If the property owner does not qualify, the county assessor shall notify the county auditor who will determine the amount of homestead benefits that had been improperly allowed. For the purpose of this subdivision, \"homestead benefits\" means the tax reduction resulting from the classification as a homestead and the homestead market value exclusion under section 273.13, the taconite homestead credit under section 273.135, the agricultural homestead credit under section 273.1384, and the supplemental homestead credit under section 273.1391.\nThe county auditor shall send a notice to the person who owned the affected property at the time the homestead application related to the improper homestead was filed, demanding reimbursement of the homestead benefits plus a penalty equal to 100 percent of the homestead benefits. The person notified may appeal the county's determination by serving copies of a petition for review with county officials as provided in section 278.01 and filing proof of service as provided in section 278.01 with the Minnesota Tax Court within 60 days of the date of the notice from the county. Procedurally, the appeal is governed by the provisions in chapter 271 which apply to the appeal of a property tax assessment or levy, but without requiring any prepayment of the amount in controversy. If the amount of homestead benefits and penalty is not paid within 60 days, and if no appeal has been filed, the county auditor shall certify the amount of taxes and penalty to the county treasurer. The county treasurer will add interest to the unpaid homestead benefits and penalty amounts at the rate provided in section 279.03 for real property taxes becoming delinquent in the calendar year during which the amount remains unpaid. Interest may be assessed for the period beginning 60 days after demand for payment was made.\nIf the person notified is the current owner of the property, the treasurer may add the total amount of homestead benefits, penalty, interest, and costs to the ad valorem taxes otherwise payable on the property by including the amounts on the property tax statements under section 276.04, subdivision 3. The amounts added under this paragraph to the ad valorem taxes shall include interest accrued through December 31 of the year preceding the taxes payable year for which the amounts are first added. These amounts, when added to the property tax statement, become subject to all the laws for the enforcement of real or personal property taxes for that year, and for any subsequent year.\nIf the person notified is not the current owner of the property, the treasurer may collect the amounts due under the Revenue Recapture Act in chapter 270A, or use any of the powers granted in sections 277.20 and 277.21 without exclusion, to enforce payment of the homestead benefits, penalty, interest, and costs, as if those amounts were delinquent tax obligations of the person who owned the property at the time the application related to the improperly allowed homestead was filed. The treasurer may relieve a prior owner of personal liability for the homestead benefits, penalty, interest, and costs, and instead extend those amounts on the tax lists against the property as provided in this paragraph to the extent that the current owner agrees in writing. On all demands, billings, property tax statements, and related correspondence, the county must list and state separately the amounts of homestead benefits, penalty, interest and costs being demanded, billed or assessed.\n(b) Any amount of homestead benefits recovered by the county from the property owner shall be distributed to the county, city or town, and school district where the property is located in the same proportion that each taxing district's levy was to the total of the three taxing districts' levy for the current year. Any amount recovered attributable to taconite homestead credit shall be transmitted to the St. Louis County auditor to be deposited in the taconite property tax relief account. Any amount recovered that is attributable to supplemental homestead credit is to be transmitted to the commissioner of revenue for deposit in the general fund of the state treasury. The total amount of penalty collected must be deposited in the county general fund.\n(c) If a property owner has applied for more than one homestead and the county assessors cannot determine which property should be classified as homestead, the county assessors will refer the information to the commissioner. The commissioner shall make the determination and notify the counties within 60 days.\nIn addition to lists of homestead properties, the commissioner may ask the counties to furnish lists of all properties and the record owners. The Social Security numbers, individual taxpayer identification numbers, and federal identification numbers that are maintained by a county or city assessor for property tax administration purposes, and that may appear on the lists retain their classification as private or nonpublic data; but may be viewed, accessed, and used by the county auditor or treasurer of the same county for the limited purpose of assisting the commissioner in the preparation of microdata samples under section 270C.12. The commissioner shall use the information provided on the lists as appropriate under the law, including for the detection of improper claims by owners, or relatives of owners, under chapter 290A.\nOn or before April 30 each year beginning in 2007, each county must provide the commissioner with the following data for each parcel of homestead property by electronic means as defined in section 289A.02, subdivision 8:\n(1) the property identification number assigned to the parcel for purposes of taxes payable in the current year;\n(2) the name and Social Security number or individual taxpayer identification number of each occupant of homestead property who is the property owner or qualifying relative of a property owner, and the spouse of the property owner who occupies homestead property or spouse of a qualifying relative of a property owner who occupies homestead property;\n(3) the classification of the property under section 273.13 for taxes payable in the current year and in the prior year;\n(4) an indication of whether the property was classified as a homestead for taxes payable in the current year because of occupancy by a relative of the owner or by a spouse of a relative;\n(5) the property taxes payable as defined in section 290A.03, subdivision 13, for the current year and the prior year;\n(6) the market value of improvements to the property first assessed for tax purposes for taxes payable in the current year;\n(7) the assessor's estimated market value assigned to the property for taxes payable in the current year and the prior year;\n(8) the taxable market value assigned to the property for taxes payable in the current year and the prior year;\n(9) whether there are delinquent property taxes owing on the homestead;\n(10) the unique taxing district in which the property is located; and\n(11) such other information as the commissioner decides is necessary.\nThe commissioner shall use the information provided on the lists as appropriate under the law, including for the detection of improper claims by owners, or relatives of owners, under chapter 290A.\n(a) Real estate of less than ten acres that is the homestead of its owner must be classified as class 2a under section 273.13, subdivision 23, paragraph (a), if:\n(1) the parcel on which the house is located is contiguous on at least two sides to (i) agricultural land, (ii) land owned or administered by the United States Fish and Wildlife Service, or (iii) land administered by the Department of Natural Resources on which in lieu taxes are paid under sections 477A.11 to 477A.14 or section 477A.17;\n(2) its owner also owns a noncontiguous parcel of agricultural land that is at least 20 acres;\n(3) the noncontiguous land is located not farther than four townships or cities, or a combination of townships or cities from the homestead; and\n(4) the agricultural use value of the noncontiguous land and farm buildings is equal to at least 50 percent of the market value of the house, garage, and one acre of land.\nHomesteads initially classified as class 2a under the provisions of this paragraph shall remain classified as class 2a, irrespective of subsequent changes in the use of adjoining properties, as long as the homestead remains under the same ownership, the owner owns a noncontiguous parcel of agricultural land that is at least 20 acres, and the agricultural use value qualifies under clause (4). Homestead classification under this paragraph is limited to property that qualified under this paragraph for the 1998 assessment.\n(b)(i) Agricultural property shall be classified as the owner's homestead, to the same extent as other agricultural homestead property, if all of the following criteria are met:\n(1) the agricultural property consists of at least 40 acres including undivided government lots and correctional 40's;\n(2) the owner, the owner's spouse, or a grandchild, child, sibling, or parent of the owner or of the owner's spouse, is actively farming the agricultural property, either on the person's own behalf as an individual or on behalf of a partnership operating a family farm, family farm corporation, joint family farm venture, or limited liability company of which the person is a partner, shareholder, or member;\n(3) both the owner of the agricultural property and the person who is actively farming the agricultural property under clause (2), are Minnesota residents;\n(4) neither the owner nor the spouse of the owner claims another agricultural homestead in Minnesota; and\n(5) neither the owner nor the person actively farming the agricultural property lives farther than four townships or cities, or a combination of four townships or cities, from the agricultural property, except that if the owner or the owner's spouse is required to live in employer-provided housing, the owner or owner's spouse, whichever is actively farming the agricultural property, may live more than four townships or cities, or combination of four townships or cities from the agricultural property.\nThe relationship under this paragraph may be either by blood or marriage.\n(ii) Property containing the residence of an owner who owns qualified property under clause (i) shall be classified as part of the owner's agricultural homestead, if that property is also used for noncommercial storage or drying of agricultural crops.\n(iii) As used in this paragraph, \"agricultural property\" means class 2a property and any class 2b property that is contiguous to and under the same ownership as the class 2a property.\n(c) Noncontiguous land shall be included as part of a homestead under section 273.13, subdivision 23, paragraph (a), only if the homestead is classified as class 2a and the detached land is located in the same township or city, or not farther than four townships or cities or combination thereof from the homestead. Any taxpayer of these noncontiguous lands must notify the county assessor that the noncontiguous land is part of the taxpayer's homestead, and, if the homestead is located in another county, the taxpayer must also notify the assessor of the other county.\n(d) Agricultural land used for purposes of a homestead and actively farmed by a person holding a vested remainder interest in it must be classified as a homestead under section 273.13, subdivision 23, paragraph (a). If agricultural land is classified class 2a, any other dwellings on the land used for purposes of a homestead by persons holding vested remainder interests who are actively engaged in farming the property, and up to one acre of the land surrounding each homestead and reasonably necessary for the use of the dwelling as a home, must also be assessed class 2a.\n(e) Agricultural land and buildings that were class 2a homestead property under section 273.13, subdivision 23, paragraph (a), for the 1997 assessment shall remain classified as agricultural homesteads for subsequent assessments if:\n(1) the property owner abandoned the homestead dwelling located on the agricultural homestead as a result of the April 1997 floods;\n(2) the property is located in the county of Polk, Clay, Kittson, Marshall, Norman, or Wilkin;\n(3) the agricultural land and buildings remain under the same ownership for the current assessment year as existed for the 1997 assessment year and continue to be used for agricultural purposes;\n(4) the dwelling occupied by the owner is located in Minnesota and is within 30 miles of one of the parcels of agricultural land that is owned by the taxpayer; and\n(5) the owner notifies the county assessor that the relocation was due to the 1997 floods, and the owner furnishes the assessor any information deemed necessary by the assessor in verifying the change in dwelling. Further notifications to the assessor are not required if the property continues to meet all the requirements in this paragraph and any dwellings on the agricultural land remain uninhabited.\n(f) Agricultural land and buildings that were class 2a homestead property under section 273.13, subdivision 23, paragraph (a), for the 1998 assessment shall remain classified agricultural homesteads for subsequent assessments if:\n(1) the property owner abandoned the homestead dwelling located on the agricultural homestead as a result of damage caused by a March 29, 1998, tornado;\n(2) the property is located in the county of Blue Earth, Brown, Cottonwood, Le Sueur, Nicollet, Nobles, or Rice;\n(3) the agricultural land and buildings remain under the same ownership for the current assessment year as existed for the 1998 assessment year;\n(4) the dwelling occupied by the owner is located in this state and is within 50 miles of one of the parcels of agricultural land that is owned by the taxpayer; and\n(5) the owner notifies the county assessor that the relocation was due to a March 29, 1998, tornado, and the owner furnishes the assessor any information deemed necessary by the assessor in verifying the change in homestead dwelling. For taxes payable in 1999, the owner must notify the assessor by December 1, 1998. Further notifications to the assessor are not required if the property continues to meet all the requirements in this paragraph and any dwellings on the agricultural land remain uninhabited.\n(g) Agricultural property of a family farm corporation, joint family farm venture, family farm limited liability company, or partnership operating a family farm as described under subdivision 8 shall be classified homestead, to the same extent as other agricultural homestead property, if all of the following criteria are met:\n(1) the property consists of at least 40 acres including undivided government lots and correctional 40's;\n(2) a shareholder, member, or partner of that entity is actively farming the agricultural property;\n(3) that shareholder, member, or partner who is actively farming the agricultural property is a Minnesota resident;\n(4) neither that shareholder, member, or partner, nor the spouse of that shareholder, member, or partner claims another agricultural homestead in Minnesota; and\n(5) that shareholder, member, or partner does not live farther than four townships or cities, or a combination of four townships or cities, from the agricultural property.\nHomestead treatment applies under this paragraph even if:\n(i) the shareholder, member, or partner of that entity is actively farming the agricultural property on the shareholder's, member's, or partner's own behalf; or\n(ii) the family farm is operated by a family farm corporation, joint family farm venture, partnership, or limited liability company other than the family farm corporation, joint family farm venture, partnership, or limited liability company that owns the land, provided that:\n(A) the shareholder, member, or partner of the family farm corporation, joint family farm venture, partnership, or limited liability company that owns the land who is actively farming the land is a shareholder, member, or partner of the family farm corporation, joint family farm venture, partnership, or limited liability company that is operating the farm; and\n(B) more than half of the shareholders, members, or partners of each family farm corporation, joint family farm venture, partnership, or limited liability company are persons or spouses of persons who are a qualifying relative under section 273.124, subdivision 1, paragraphs (c) and (d).\nHomestead treatment applies under this paragraph for property leased to a family farm corporation, joint farm venture, limited liability company, or partnership operating a family farm if legal title to the property is in the name of an individual who is a member, shareholder, or partner in the entity.\n(h) To be eligible for the special agricultural homestead under this subdivision, an initial full application must be submitted to the county assessor where the property is located. Owners and the persons who are actively farming the property shall be required to complete only a one-page abbreviated version of the application in each subsequent year provided that none of the following items have changed since the initial application:\n(1) the day-to-day operation, administration, and financial risks remain the same;\n(2) the owners and the persons actively farming the property continue to live within the four townships or city criteria and are Minnesota residents;\n(3) the same operator of the agricultural property is listed with the Farm Service Agency;\n(4) a Schedule F or equivalent income tax form was filed for the most recent year;\n(5) the property's acreage is unchanged; and\n(6) none of the property's acres have been enrolled in a federal or state farm program since the initial application.\nThe owners and any persons who are actively farming the property must include the appropriate Social Security numbers or individual taxpayer identification numbers, and sign and date the application. If any of the specified information has changed since the full application was filed, the owner must notify the assessor, and must complete a new application to determine if the property continues to qualify for the special agricultural homestead. The commissioner of revenue shall prepare a standard reapplication form for use by the assessors.\n(i) Agricultural land and buildings that were class 2a homestead property under section 273.13, subdivision 23, paragraph (a), for the 2007 assessment shall remain classified agricultural homesteads for subsequent assessments if:\n(1) the property owner abandoned the homestead dwelling located on the agricultural homestead as a result of damage caused by the August 2007 floods;\n(2) the property is located in the county of Dodge, Fillmore, Houston, Olmsted, Steele, Wabasha, or Winona;\n(3) the agricultural land and buildings remain under the same ownership for the current assessment year as existed for the 2007 assessment year;\n(4) the dwelling occupied by the owner is located in this state and is within 50 miles of one of the parcels of agricultural land that is owned by the taxpayer; and\n(5) the owner notifies the county assessor that the relocation was due to the August 2007 floods, and the owner furnishes the assessor any information deemed necessary by the assessor in verifying the change in homestead dwelling. For taxes payable in 2009, the owner must notify the assessor by December 1, 2008. Further notifications to the assessor are not required if the property continues to meet all the requirements in this paragraph and any dwellings on the agricultural land remain uninhabited.\n(j) Agricultural land and buildings that were class 2a homestead property under section 273.13, subdivision 23, paragraph (a), for the 2008 assessment shall remain classified as agricultural homesteads for subsequent assessments if:\n(1) the property owner abandoned the homestead dwelling located on the agricultural homestead as a result of the March 2009 floods;\n(2) the property is located in the county of Marshall;\n(3) the agricultural land and buildings remain under the same ownership for the current assessment year as existed for the 2008 assessment year and continue to be used for agricultural purposes;\n(4) the dwelling occupied by the owner is located in Minnesota and is within 50 miles of one of the parcels of agricultural land that is owned by the taxpayer; and\n(5) the owner notifies the county assessor that the relocation was due to the 2009 floods, and the owner furnishes the assessor any information deemed necessary by the assessor in verifying the change in dwelling. Further notifications to the assessor are not required if the property continues to meet all the requirements in this paragraph and any dwellings on the agricultural land remain uninhabited.\nMS 1991 Supp [Repealed, 1992 c 511 art 2 s 60]\nMS 1992 [Repealed, 1993 c 375 art 5 s 43]\nFor purposes of class 1a determinations, a homestead includes that portion of property defined as a motel under chapter 157, provided that the person residing in the motel property is using that property as a homestead, is part owner, and is actively engaged in the operation of the motel business. Homestead treatment applies even if legal title to the property is in the name of a corporation or partnership and not in the name of the person residing in the motel. The homestead is limited to that portion of the motel actually occupied by the person.\nA taxpayer meeting the requirements of this subdivision must notify the county assessor, or the assessor who has the powers of the county assessor under section 273.063, in writing, in order to qualify under this subdivision for 1a homestead classification.\nProperty that is not occupied as a homestead on the assessment date will be classified as a homestead if it meets each of the following requirements on that date:\n(a) The structure is a single family or duplex residence.\n(b) The property is owned by a church or an organization that is exempt from taxation under section 501(c)(3) of the Internal Revenue Code of 1986.\n(c) The organization is in the process of renovating the property for use as a homestead by an individual or family whose income is no greater than 60 percent of the county or area gross median income, adjusted for family size, and that renovation process and conveyance for use as a homestead can reasonably be expected to be completed within 12 months after construction begins.\nThe organization must apply to the assessor for classification under this subdivision within 30 days of its acquisition of the property, and must provide the assessor with the information necessary for the assessor to determine whether the property qualifies.\nQualifying buildings and appurtenances, together with the land on which they are located, are classified as homesteads, if the following qualifications are met:\n(1) the property is leased for up to a five-year period by the occupant under a lease-purchase program administered by the Minnesota Housing Finance Agency or a housing and redevelopment authority under sections 469.001 to 469.047;\n(2) the occupant's income is no greater than 80 percent of the county or area median income, adjusted for family size;\n(3) the building consists of one or two dwelling units;\n(4) the lease agreement provides that part of the lease payment is escrowed as a nonrefundable down payment on the housing;\n(5) the administering agency verifies the occupant's income eligibility and certifies to the county assessor that the occupant meets the income standards; and\n(6) the property owner applies to the county assessor by May 30 of each year.\nFor purposes of this subdivision, \"qualifying buildings and appurtenances\" means a one- or two-unit residential building which was unoccupied, abandoned, and boarded for at least six months.\nNo political subdivision may impose any requirements not contained in this chapter or chapter 272 to disqualify property from being classified as a homestead if the property otherwise meets the requirements for homestead treatment under this chapter and chapter 272.\nReal or personal property, including agricultural property, held by a trustee under a trust is eligible for classification as homestead property if the property satisfies the requirements of paragraph (a), (b), (c), (d), or (e).\n(a) The grantor or surviving spouse of the grantor of the trust occupies and uses the property as a homestead.\n(b) A relative or surviving relative of the grantor who meets the requirements of subdivision 1, paragraph (c), in the case of residential real estate; or subdivision 1, paragraph (d), in the case of agricultural property, occupies and uses the property as a homestead.\n(c) A family farm corporation, joint farm venture, limited liability company, or partnership operating a family farm in which the grantor or the grantor's surviving spouse is a shareholder, member, or partner rents the property; and, either (1) a shareholder, member, or partner of the corporation, joint farm venture, limited liability company, or partnership occupies and uses the property as a homestead; or (2) the property is at least 40 acres, including undivided government lots and correctional 40's, and a shareholder, member, or partner of the tenant-entity is actively farming the property on behalf of the corporation, joint farm venture, limited liability company, or partnership.\n(d) A person who has received homestead classification for property taxes payable in 2000 on the basis of an unqualified legal right under the terms of the trust agreement to occupy the property as that person's homestead and who continues to use the property as a homestead; or, a person who received the homestead classification for taxes payable in 2005 under paragraph (c) who does not qualify under paragraph (c) for taxes payable in 2006 or thereafter but who continues to qualify under paragraph (c) as it existed for taxes payable in 2005.\n(e) The qualifications under subdivision 14, paragraph (b), clause (i), are met. For purposes of this paragraph, \"owner\" means the grantor of the trust or the surviving spouse of the grantor.\n(f) For purposes of this subdivision, the following terms have the meanings given them:\n(1) \"agricultural property\" means the house, garage, other farm buildings and structures, and agricultural land;\n(2) \"agricultural land\" has the meaning given in section 273.13, subdivision 23, except that the phrases \"owned by same person\" or \"under the same ownership\" as used in that subdivision mean and include contiguous tax parcels owned by:\n(i) an individual and a trust of which the individual, the individual's spouse, or the individual's deceased spouse is the grantor; or\n(ii) different trusts of which the grantors of each trust are any combination of an individual, the individual's spouse, or the individual's deceased spouse; and\n(3) \"grantor\" means the person creating or establishing a testamentary, inter vivos, revocable or irrevocable trust by written instrument or through the exercise of a power of appointment.\n(g) Noncontiguous agricultural land is included as part of a homestead under this subdivision, only if the homestead is classified as class 2a, as defined in section 273.13, subdivision 23, and the detached land is located in the same township or city, or not farther than four townships or cities or combination thereof from the homestead. Any taxpayer of these noncontiguous lands must notify the county assessor that the noncontiguous land is part of the taxpayer's homestead, and, if the homestead is located in another county, the taxpayer must also notify the assessor of the other county.\nIf the owner of property or the owner's relative who occupies property that is classified as a homestead under subdivision 1, paragraph (c), receives compensation for allowing occupancy of any part of that property for a period that exceeds 31 consecutive days during the calendar year, the recipient of the compensation must register the property with the city in which it is located no later than 60 days after the initial rental period began. This requirement applies to property located in a city that has a population over 25,000. Each city must maintain a file of these property registrations that is open to the public, and retain the registrations for one year after the date of filing.\nFor property classified as an agricultural homestead under section 273.13, subdivision 23, paragraph (a), ownership percentages for property owned by tenants in common are based on deeded ownership amounts for each owner who homesteads the property.",
	"repealed": false
}