{
	"id": "136F.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.94",
	"title": "136F.94 SPECIAL REVENUE FUND.",
	"text": "(a) The gross total income derived from the sale of bonds, and receipts and income derived from charges or fees, rentals, and all other revenue established for the use and service of any buildings or structures shall, within three days after their receipt, be paid to and held by the treasurer of the board as a special fund known as, \"The Board of Trustees of the Minnesota State Colleges and Universities Revenue Fund.\" The treasurer shall be custodian of the special fund, which fund shall be held and disbursed for the purposes provided in sections 136F.90 to 136F.98. The special fund shall be protected by a corporate surety bond executed by the treasurer of the board with a surety authorized to do business under the laws of the state of Minnesota. The amount of the bond shall be fixed by resolution of the board or its successor and may be increased or diminished at any time. The premiums of the bonds shall be payable from \"The Board of Trustees of the Minnesota State Colleges and Universities Revenue Fund\" and charged as an item of maintenance expense.\n(b) A certified copy of each resolution providing for the issuance of bonds under sections 136F.90 to 136F.98 shall be filed with the treasurer of the board, and it shall be the duty of the treasurer to keep and maintain separate accounts in the special fund for each bond issue in accordance with the covenants and the directions set out in the resolution providing for the issuance of the bonds and to disburse funds from the proper account for the payment of the principal of and interest on the bonds in accordance with the directions and covenants of the resolution authorizing the issue. All disbursements for maintenance and operation costs shall be made from the proper maintenance and operation account by order of the board or its successor in accordance with the covenants set out in the resolution authorizing the issuance of bonds. All disbursements for construction costs shall be made from a separate account in the special fund by order of the board or its successor in accordance with the covenants set out in the resolution authorizing the bonds.",
	"repealed": false
}