{
	"id": "428B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/428B.09",
	"title": "428B.09 DISESTABLISHMENT.",
	"text": "An ordinance adopted under this chapter must provide a 30-day period each year in which business owners subject to the service charge may request disestablishment of the district. Beginning one year after establishment of the tourism improvement district, an annual 30-day period of disestablishment begins with the anniversary of the date of establishment. Upon submission of a petition from impacted business owners, the municipality may disestablish a tourism improvement district by adopting an ordinance after holding a public hearing on the disestablishment. Prior to the hearing, the municipality must publish notice of the hearing on disestablishment in at least two issues of the municipality's official newspaper. The two publications must be two weeks apart and the municipality must hold the hearing at least three days after the last publication. Not less than ten days before the hearing, the municipality must mail, or deliver by electronic means, notice to the business owner of each business subject to the service charge. The notice must include:\n(1) the time and place of the hearing;\n(2) a statement that all interested persons will be given an opportunity to be heard at the hearing regarding disestablishment;\n(3) the reason for disestablishment; and\n(4) a proposal to dispose of any assets acquired with the revenues of the service charge imposed under the tourism improvement district.\nAn ordinance disestablishing the tourism improvement district becomes effective following the notice and veto requirements in section 428B.08.\n(a) Upon the disestablishment of a tourism improvement district, any remaining revenues derived from the service charge, or any revenues derived from the sale of assets acquired with the service charge revenues, shall be refunded to business owners located and operating within the tourism improvement district in which service charges were imposed by applying the same method and basis that was used to calculate the service charges levied in the fiscal year in which the district is disestablished.\n(b) If the disestablishment occurs before the service charge is imposed for the fiscal year, the method and basis that was used to calculate the service charge imposed in the immediate prior fiscal year shall be used to calculate the amount of a refund, if any.",
	"repealed": false
}