{
	"id": "326.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.02",
	"title": "326.02 LICENSURE OR CERTIFICATION.",
	"text": "In order to safeguard life, health, and property, and to promote the public welfare, any person in either public or private capacity practicing, or offering to practice, architecture, professional engineering, land surveying, landscape architecture, or professional geoscience, or using the title certified interior designer in this state, either as an individual, a copartner, or as agent of another, shall be licensed or certified as hereinafter provided. It shall be unlawful for any person to practice, or to offer to practice, in this state, architecture, professional engineering, land surveying, landscape architecture, or professional geoscience, or to use the title certified interior designer, or to solicit or to contract to furnish work within the terms of sections 326.02 to 326.15, or to use in connection with the person's name, or to otherwise assume, use or advertise any title or description tending to convey the impression that the person is an architect, professional engineer (hereinafter called engineer), land surveyor, landscape architect, professional geoscientist (hereinafter called geoscientist), or certified interior designer, unless such person is qualified by licensure or certification under sections 326.02 to 326.15. This subdivision does not preclude an individual who retired from one of the professions listed in this subdivision from using the designation architect, professional engineer, land surveyor, landscape architect, professional geoscientist, or certified interior designer as long as the designation is preceded by the word \"retired\" and the individual was licensed or certified in the designated profession in the state of Minnesota on the date the individual retired from the designated profession and the individual's license or certification was not subsequently revoked by the Board of Architecture, Engineering, Land Surveying, Landscape Architecture, Geoscience, and Interior Design.\nAny person shall be deemed to be practicing architecture, within the meaning of sections 326.02 to 326.15, who holds out as being able to perform or who does perform any professional service, such as planning, design, or supervision of construction for the purpose of assuring compliance with specifications and design, in connection with any private or public buildings, structures or projects, or the equipment or utilities thereof, or the accessories thereto, wherein the safeguarding of life, health, or property is concerned or involved, when such professional service requires the application of the art and science of construction based upon the principles of mathematics, aesthetics, and the physical sciences, acquired by education or training, and by experience. For the purposes of this subdivision \"supervision\" is a professional service as distinguished from superintending of construction and means the performance or the supervision thereof, of reasonable and ordinary on the site observations to determine that the construction is in substantial compliance with the approved drawings, plans and specifications.\n(a) Any person shall be deemed to be practicing professional engineering within the meaning of sections 326.02 to 326.15 who holds out as being able to perform or who does perform any technical professional service, such as planning, design or observation of construction for the purpose of assuring compliance with specifications and design, in connection with any public or private structures, buildings, utilities, machines, equipment, processes, works, or projects wherein the public welfare or the safeguarding of life, health, or property is concerned or involved, when such professional service requires the application of the principles of mathematics and the physical and applied engineering sciences, acquired by education or training, and by experience.\n(b) No person other than one licensed under sections 326.02 to 326.15 as a professional engineer may:\n(1) use the term \"professional engineer\";\n(2) use any other abbreviation or term, including the initials \"P.E.\" or \"PE\" by signature, verbal claim, sign, advertisement, letterhead, card, or similar means that would lead the public to believe that the person was a professional engineer; or\n(3) use any means or in any other way make a representation that would lead the public to believe that the person was a professional engineer.\n(c) A professional engineering license satisfies any requirements by the state or its political subdivisions to perform any actions authorized under the professional engineering license. A person licensed as a professional engineer under sections 326.02 to 326.15 shall only be required to obtain a license, certification, or other form of approval for a skill or service in addition to a professional engineering license if the state or political subdivision has made an affirmative written determination in statute, rule, or ordinance that such additional license or certification is necessary to safeguard life, health, or property, or promote the public welfare. This section does not preclude the state or a political subdivision from including additional requirements when soliciting public contracts for engineering services. This paragraph does not apply to practice areas where licenses or certifications are required prior to August 1, 2015.\nA person is considered to be practicing professional geoscience within the meaning of sections 326.02 to 326.15 who holds out as being able to perform or who does perform any technical professional services, the adequate performance of which requires professional geoscience education, training, and experience in the application of special knowledge of the mathematical, physical, chemical, biological, and earth sciences to such services or creative work as consultation, investigation, evaluation, planning, mapping, and inspection of geoscientific work and its responsible supervision.\nA person is considered to practice or offer to practice professional geoscience, within the meaning and intent of sections 326.02 to 326.15 who practices any of the geoscience disciplines defined by the board; who by verbal claim, sign, advertisement, letterhead, card, or in any other way represents oneself to be a professional geoscientist; through the use of some other title implies that the person is a professional geoscientist; or who presents oneself as able to perform or who does perform any geoscience services or that constitutes the practice of a professional geoscience discipline as defined by the board.\n\"Geoscience\" means the science which includes treatment of the earth and its origin and history; the investigation, measurement or sampling, of the earth's constituent rocks, natural and induced fields of force, minerals, fossils, solids, soils, fluids including surface and underground waters, gases, and other materials; and the study, interpretation, and analysis of the natural agents, forces, and processes which cause changes in the earth.\nNothing in this subdivision shall be construed to prevent a professional engineer, as defined in sections 326.02 to 326.15, from acquiring engineering data involving soil, rock, groundwater, and other earth materials; evaluating physical and chemical properties of soil, rock, groundwater, and other earth materials for engineering; and from utilizing these data for analysis, design, and construction. Nothing in this subdivision shall be construed to permit a professional geoscientist to engage in the practice of professional engineering, architecture, landscape architecture, or land surveying or to use the title \"certified interior design\" as those terms are defined in this section. Nothing in this subdivision shall be construed to regulate persons who take soil samples for the purpose of providing recommendations on crop production.\nLand surveying means the application of the principles of mathematics, physical and applied sciences and law to measuring and locating lines, angles, elevations and natural or artificial features in the air, on the surface of the earth, underground and on the beds of bodies of water for the purpose of:\n(1) determining, monumenting, establishing, or reestablishing property boundaries;\n(2) determining, monumenting, or reestablishing the position for any public land survey system corner or line;\n(3) planning, designing, and platting of land and subdivisions including the topography, alignment and grades of streets; and\n(4) preparing and perpetuating maps, record plats, and property descriptions.\nAny person who offers to perform, holds out as being able to perform, or does perform land surveying for others shall be practicing land surveying.\nNothing contained in the provisions of sections 326.02 to 326.15, shall prohibit a licensed professional engineer, architect, landscape architect, or professional geoscientist from doing any work included in the practice of engineering, architecture, landscape architecture, and professional geoscience, if the work does not involve the establishment or reestablishment of property corners, property lines, or public land survey system corners or lines.\nAny person shall be deemed to be practicing landscape architecture, within the meaning of sections 326.02 to 326.15, who holds out as being able to perform or who does perform any professional service in connection with the development of land areas where the dominant purpose of the service is the preservation, enhancement or determination of proper land uses, natural land features, ground cover and planting, naturalistic and aesthetic values, the settings, approaches or environment for structures or other improvements, and the consideration and determination of inherent problems of the land relating to erosion, wear and tear, blight and hazards. This practice shall include the location and arrangement of tangible objects and features incidental and necessary to the purposes outlined but shall not include the design of structures or facilities with separate and self-contained purposes as ordinarily included in the practice of engineering or architecture or the preparation of boundary surveys or final land plats, as ordinarily included in the practice of land surveying.\nNothing contained in sections 326.02 to 326.15 concerning landscape architects shall be construed:\n(1) to apply to a professional engineer duly registered under the laws of this state;\n(2) to apply to an architect registered under the laws of this state;\n(3) to apply to a land surveyor registered under the laws of this state;\n(4) to prevent a registered architect or professional engineer from doing landscape planning and designing;\n(5) to exclude nursery operators or other small business people from the preparation of landscape plans appropriate to the normal operation of their business;\n(6) to authorize a landscape architect to engage in the practice of architecture, engineering, land surveying, or geoscience.\nNo person shall use the designation landscape architect or any title or device indicating or representing that the person is a landscape architect or is practicing landscape architecture unless the person is registered under the provisions of sections 326.02 to 326.15.\n(a) For the purposes of sections 326.02 to 326.15, \"certified interior designer\" means a person who is certified under section 326.10, to use the title certified interior designer and who provides services in connection with the design of public interior spaces, including preparation of documents relative to non-load-bearing interior construction, space planning, finish materials, and furnishings.\n(b) No person may use the title certified interior designer unless that person has been certified as an interior designer or has been exempted by the board. Registered architects may be certified without additional testing. Persons represent themselves to the public as certified interior designers if they use a title that incorporates the words certified interior designer.\n(c) Nothing in this section prohibits the use of the title interior designer or the term interior design by persons not certified by the board.\n(d) Nothing in this section restricts persons not certified by the board from providing interior design services and from saying that they provide such services, as long as they do not use the title certified interior designer.\n(e) Nothing in this section authorizes certified interior designers to engage in the practice of architecture as defined in subdivision 2 or the practice of engineering as defined in subdivision 3.\nThe provisions of sections 326.02 to 326.15 shall not apply to the preparation of plans and specifications for the erection, enlargement, or alteration of any building or other structure by any person, for that person's exclusive occupancy or use, unless such occupancy or use involves the public health or safety or the health or safety of the employees of said person, or of the buildings listed in section 326.03, subdivision 2, nor to any detailed or shop plans required to be furnished by a contractor to a registered engineer, landscape architect, architect, or certified interior designer, nor to any standardized manufactured product, nor to any construction superintendent supervising the execution of work designed by an architect, landscape architect, engineer, or certified interior designer licensed or certified in accordance with section 326.03, nor to the planning for and supervision of the construction and installation of work by an electrical or elevator contractor or master plumber as defined in and licensed pursuant to chapter 326B, nor to the planning for and supervision of the construction and installation of work by a licensed well contractor as defined and licensed pursuant to chapter 103I, where such work is within the scope of such licensed activity and not within the practice of professional engineering, or architecture, or where the person does not claim to be a certified interior designer as defined in subdivision 2, 3, or 4b.",
	"repealed": false
}