{
	"id": "474A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.091",
	"title": "474A.091 ALLOCATION OF UNIFIED POOL.",
	"text": "On the day after the last Monday in June any bonding authority remaining unallocated from the small issue pool, the housing pool, and the public facilities pool is transferred to the unified pool and must be reallocated as provided in this section.\n(a) Issuers may apply for an allocation for residential rental bonds under this section by submitting to the department an application on forms provided by the department accompanied by:\n(1) a preliminary resolution;\n(2) a statement of bond counsel that the proposed issue of obligations requires an allocation under this chapter and the Internal Revenue Code;\n(3) an application deposit in the amount of two percent of the requested allocation;\n(4) a sworn statement from the applicant identifying the project as a preservation project, 30 percent AMI residential rental project, 50 percent AMI residential rental project, 100 percent LIHTC project, 20 percent LIHTC project, or any other residential rental project; and\n(5) a certification from the applicant or its accountant stating that the requested allocation does not exceed the aggregate bond limitation.\nThe issuer must pay the application deposit to the Department of Management and Budget. An entitlement issuer may not apply for an allocation for residential rental project bonds under this section unless it has either permanently issued bonds equal to the amount of its entitlement allocation for the current year plus any amount carried forward from previous years or returned for reallocation all of its unused entitlement allocation. For purposes of this subdivision, its entitlement allocation includes an amount obtained under section 474A.04, subdivision 6.\n(b) An issuer that receives an allocation under this subdivision must permanently issue obligations equal to all or a portion of the allocation received on or before 180 days of the allocation. If an issuer that receives an allocation under this subdivision does not permanently issue obligations equal to all or a portion of the allocation received within the time period provided in this paragraph or returns the allocation to the commissioner, the amount of the allocation is canceled and returned for reallocation through the unified pool.\n(c) The Minnesota Housing Finance Agency may apply for and receive an allocation under this section without submitting an application deposit.\n(a) Issuers may apply for an allocation for all types of qualified bonds other than residential rental bonds under this section by submitting to the department an application on forms provided by the department accompanied by:\n(1) a preliminary resolution;\n(2) a statement of bond counsel that the proposed issue of obligations requires an allocation under this chapter and the Internal Revenue Code;\n(3) the type of qualified bonds to be issued;\n(4) an application deposit in the amount of two percent of the requested allocation; and\n(5) a public purpose scoring worksheet for manufacturing and enterprise zone applications.\nThe issuer must pay the application deposit to the Department of Management and Budget. An entitlement issuer may not apply for an allocation for public facility bonds or mortgage bonds under this section unless it has either permanently issued bonds equal to the amount of its entitlement allocation for the current year plus any amount carried forward from previous years or returned for reallocation all of its unused entitlement allocation. For purposes of this subdivision, an entitlement allocation includes an amount obtained under section 474A.04, subdivision 6.\n(b) An issuer that receives an allocation under this subdivision must permanently issue obligations equal to all or a portion of the allocation received on or before 120 days of the allocation. If an issuer that receives an allocation under this subdivision does not permanently issue obligations equal to all or a portion of the allocation received within the time period provided in this paragraph or returns the allocation to the commissioner, the amount of the allocation is canceled and returned for reallocation through the unified pool.\n(c) Notwithstanding the restrictions imposed on entitlement issuers under this subdivision, the Minnesota Housing Finance Agency may not receive an allocation for mortgage bonds under this section prior to the first Monday in October, but may be awarded allocations for mortgage bonds from the unified pool on or after the first Monday in October. The Minnesota Housing Finance Agency, the Minnesota Office of Higher Education, and the Minnesota Rural Finance Authority may apply for and receive an allocation under this section without submitting an application deposit.\n(a) The commissioner shall allocate available bonding authority under this section on the Monday of every other week beginning with the first Monday in July through and on the last Monday in November. Applications for allocations must be received by the department by 4:30 p.m. on the Monday preceding the Monday on which allocations are to be made. If a Monday falls on a holiday, the allocation will be made or the applications must be received by the next business day after the holiday.\n(b) Prior to October 1, only the following applications shall be awarded allocations from the unified pool. Allocations shall be awarded in the following order of priority:\n(1) applications for residential rental project bonds;\n(2) applications for small issue bonds for manufacturing projects; and\n(3) applications for small issue bonds for agricultural development bond loan projects.\n(c) On the first Monday in October through the last Monday in November, allocations shall be awarded from the unified pool in the following order of priority:\n(1) applications for student loan bonds issued by or on behalf of the Minnesota Office of Higher Education;\n(2) applications for mortgage bonds;\n(3) applications for public facility projects funded by public facility bonds;\n(4) applications for small issue bonds for manufacturing projects;\n(5) applications for small issue bonds for agricultural development bond loan projects;\n(6) applications for residential rental project bonds;\n(7) applications for enterprise zone facility bonds;\n(8) applications for governmental bonds; and\n(9) applications for redevelopment bonds.\n(d) If there are two or more applications for manufacturing projects from the unified pool and there is insufficient bonding authority to provide allocations for all manufacturing projects in any one allocation period, the available bonding authority shall be awarded based on the number of points awarded a project under section 474A.045 with those projects receiving the greatest number of points receiving allocation first. If two or more applications for manufacturing projects receive an equal amount of points, available bonding authority shall be awarded by lot unless otherwise agreed to by the respective issuers.\n(e) If there are two or more applications for enterprise zone facility projects from the unified pool and there is insufficient bonding authority to provide allocations for all enterprise zone facility projects in any one allocation period, the available bonding authority shall be awarded based on the number of points awarded a project under section 474A.045 with those projects receiving the greatest number of points receiving allocation first. If two or more applications for enterprise zone facility projects receive an equal amount of points, available bonding authority shall be awarded by lot unless otherwise agreed to by the respective issuers.\n(f) If there are two or more applications for residential rental projects from the unified pool and there is insufficient bonding authority to provide allocations for all residential rental projects in any one allocation period, the available bonding authority shall be awarded in the following order of priority: (1) preservation projects; (2) 30 percent AMI residential rental projects; (3) 50 percent AMI residential rental projects for which the amount of bonds requested in their respective applications do not exceed the aggregate bond limitations; (4) 100 percent LIHTC projects; (5) 20 percent LIHTC projects; and (6) other residential rental projects. If there are two or more applications for residential rental projects at the same priority level and there is insufficient bonding authority to provide allocations for all the projects in any one allocation period, available bonding authority shall be randomly awarded by lot but only for projects that can receive the full amount of their respective requested allocations. If a residential rental project does not receive any of its requested allocation pursuant to this paragraph and the project applies in the next successive housing pool or the next successive unified pool for an allocation of bonds, the project shall be fully funded up to its original application request for bonding authority before any new project, applying in the same allocation period, that has an equal priority shall receive bonding authority.\n(g) From the first Monday in July through the last Monday in November, $20,000,000 of bonding authority or an amount equal to the total annual amount of bonding authority allocated to the small issue pool under section 474A.03, subdivision 1, less the amount allocated to issuers from the small issue pool for that year, whichever is less, is reserved within the unified pool for small issue bonds to the extent the amounts are available within the unified pool.\n(h) The total amount of allocations for mortgage bonds from the housing pool and the unified pool may not exceed:\n(1) $10,000,000 for any one city; or\n(2) $20,000,000 for any number of cities in any one county.\n(i) The total amount of allocations for student loan bonds from the unified pool may not exceed $25,000,000 per year.\n(j) If there is insufficient bonding authority to fund all projects within any qualified bond category other than enterprise zone facility projects, manufacturing projects, and residential rental projects, allocations shall be awarded by lot unless otherwise agreed to by the respective issuers.\n(k) If an application is rejected, the commissioner must notify the applicant and return the application deposit to the applicant within 30 days unless the applicant requests in writing that the application be resubmitted.\n(l) The granting of an allocation of bonding authority under this section must be evidenced by issuance of a certificate of allocation.\n(a) Bonding authority remaining in the unified pool on October 1 is available for single-family housing programs for cities that applied in January and received an allocation under section 474A.061, subdivision 2a, in the same calendar year. The Minnesota Housing Finance Agency shall receive an allocation for mortgage bonds pursuant to this section, minus any amounts for a city or consortium that intends to issue bonds on its own behalf under paragraph (c).\n(b) The agency may issue bonds on behalf of participating cities. The agency shall request an allocation from the commissioner for all applicants who choose to have the agency issue bonds on their behalf and the commissioner shall allocate the requested amount to the agency. Allocations shall be awarded by the commissioner each Monday commencing on the first Monday in October through the last Monday in November for applications received by 4:30 p.m. on the Monday of the week preceding an allocation.\nFor cities who choose to have the agency issue bonds on their behalf, allocations will be made loan by loan, on a first-come, first-served basis among the cities. The agency shall submit an application fee pursuant to section 474A.03, subdivision 4, and an application deposit equal to two percent of the requested allocation to the commissioner when requesting an allocation from the unified pool. After awarding an allocation and receiving a notice of issuance for mortgage bonds issued on behalf of the participating cities, the commissioner shall transfer the application deposit to the Minnesota Housing Finance Agency.\nFor purposes of paragraphs (a) to (d), \"city\" means a county or a consortium of local government units that agree through a joint powers agreement to apply together for single-family housing programs, and has the meaning given it in section 462C.02, subdivision 6. \"Agency\" means the Minnesota Housing Finance Agency.\n(c) Any city that received an allocation pursuant to section 474A.061, subdivision 2a, paragraph (f), in the current year that wishes to receive an additional allocation from the unified pool and issue bonds on its own behalf or pursuant to a joint powers agreement shall notify the Minnesota Housing Finance Agency by the third Monday in September. The total amount of allocation for mortgage bonds for a city choosing to issue bonds on its own behalf or through a joint powers agreement is limited to the lesser of: (i) the amount requested, or (ii) the product of the total amount available for mortgage bonds from the unified pool, multiplied by the ratio of the population of each city that applied in January and received an allocation under section 474A.061, subdivision 2a, in the same calendar year, as determined by the most recent estimate of the city's population released by the state demographer's office to the total of the population of all the cities that applied in January and received an allocation under section 474A.061, subdivision 2a, in the same calendar year. If a city choosing to issue bonds on its own behalf or through a joint powers agreement is located within a county that has also chosen to issue bonds on its own behalf or through a joint powers agreement, the city's population will be deducted from the county's population in calculating the amount of allocations under this paragraph.\nThe Minnesota Housing Finance Agency shall notify each city choosing to issue bonds on its own behalf or pursuant to a joint powers agreement of the amount of its allocation by October 15. Upon determining the amount of the allocation of each choosing to issue bonds on its own behalf or through a joint powers agreement, the agency shall forward a list specifying the amounts allotted to each city.\nA city that chooses to issue bonds on its own behalf or through a joint powers agreement may request an allocation from the commissioner by forwarding an application with an application fee pursuant to section 474A.03, subdivision 4, and an application deposit equal to two percent of the requested amount to the commissioner no later than 4:30 p.m. on the Monday of the week preceding an allocation. Allocations to cities that choose to issue bonds on their own behalf shall be awarded by the commissioner on the first Monday after October 15 through the last Monday in November. No city may receive an allocation from the commissioner after the last Monday in November. The commissioner shall allocate the requested amount to the city or cities subject to the limitations under this subdivision.\nIf a city issues mortgage bonds from an allocation received under this paragraph, the issuer must provide for the recycling of funds into new loans. If the issuer is not able to provide for recycling, the issuer must notify the commissioner in writing of the reason that recycling was not possible and the reason the issuer elected not to have the Minnesota Housing Finance Agency issue the bonds. \"Recycling\" means the use of money generated from the repayment and prepayment of loans for further eligible loans or for the redemption of bonds and the issuance of current refunding bonds.\n(d) No entitlement city or county or city in an entitlement county may apply for or be allocated authority to issue mortgage bonds or use mortgage credit certificates from the unified pool.\n(e) An allocation awarded to the agency for mortgage bonds under this section may be carried forward by the agency subject to notice requirements under section 474A.131.\nAll remaining bonding authority available for allocation under this section on December 1, is allocated to the Minnesota Housing Finance Agency.\nMS 1988 [Repealed, 1990 c 552 s 24]\n(a) If an issuer that receives an allocation under this section determines that it will not permanently issue obligations equal to all or a portion of the allocation received under this section within the applicable number of days after the allocation required in this chapter or within the time period permitted by federal tax law, whichever is less, the issuer must notify the department. If the issuer notifies the department or the applicable period since allocation has expired prior to the last Monday in November, the amount of allocation is canceled and returned for reallocation through the unified pool. If the issuer notifies the department on or after the last Monday in November, the amount of allocation is canceled and returned for reallocation to the Minnesota Housing Finance Agency. To encourage a competitive application process, the commissioner shall reserve, for new applications, the amount of allocation that is canceled and returned for reallocation under this section for a minimum of seven calendar days.\n(b) An issuer that returns for reallocation all or a portion of an allocation for all types of bonds other than residential rental project bonds received under this section within 120 days of the allocation shall receive within 30 days a refund equal to:\n(1) one-half of the application deposit for the amount of bonding authority returned within 30 days of receiving the allocation;\n(2) one-fourth of the application deposit for the amount of bonding authority returned between 31 and 60 days of receiving the allocation; and\n(3) one-eighth of the application deposit for the amount of bonding authority returned between 61 and 120 days of receiving the allocation.\n(c) An issuer that returns for reallocation all or a portion of an allocation for residential rental project bonds received under this section within 180 days of the allocation shall receive within 30 days a refund equal to:\n(1) one-half of the application deposit for the amount of bonding authority returned within 45 days of receiving the allocation;\n(2) one-fourth of the application deposit for the amount of bonding authority returned between 46 and 90 days of receiving the allocation; and\n(3) one-eighth of the application deposit for the amount of bonding authority returned between 91 and 180 days of receiving the allocation.\n(d) No refund of the application deposit shall be available for allocations returned on or after the last Monday in November.\nNotwithstanding the notice requirements of section 474A.131, subdivision 2, any bonding authority remaining unissued by the Minnesota Housing Finance Agency on the last business day in December shall be carried forward into the next calendar year by the commissioner for the Minnesota Housing Finance Agency.",
	"repealed": false
}