{
	"id": "256B.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.50",
	"title": "256B.50 APPEALS.",
	"text": "A provider may appeal from a determination of a payment rate established pursuant to this chapter or allowed costs under chapter 256R if the appeal, if successful, would result in a change to the provider's payment rate or to the calculation of maximum charges to therapy vendors as provided by section 256R.54. Appeals must be filed in accordance with procedures in this section. This section does not apply to a request from a resident or long-term care facility for reconsideration of the classification of a resident under section 144.0724.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Determination of a payment rate\" means the process by which the commissioner establishes the payment rate paid to a provider pursuant to this chapter, including determinations made in desk audit, field audit, or pursuant to an amendment filed by the provider.\n(c) \"Provider\" means a nursing facility as defined in section 256R.02, subdivision 33, or a facility as defined in section 256B.501, subdivision 1.\n(d) The definitions in section 256R.02 apply to this section.\nTo appeal, the provider shall file with the commissioner a written notice of appeal; the appeal must be postmarked or received by the commissioner within 60 days of the publication date printed on the rate notice. The notice of appeal must specify each disputed item; the reason for the dispute; the total dollar amount in dispute for each separate disallowance, allocation, or adjustment of each cost item or part of a cost item; the computation that the provider believes is correct; the authority in statute or rule upon which the provider relies for each disputed item; the name and address of the person or firm with whom contacts may be made regarding the appeal; and other information required by the commissioner.\n(a) Effective for desk audit appeals for rate years beginning on or after July 1, 1997, and for field audit appeals filed on or after that date, the commissioner shall review appeals and issue a written appeal determination on each appealed item within one year of the due date of the appeal. Upon mutual agreement, the commissioner and the provider may extend the time for issuing a determination for a specified period. The commissioner shall notify the provider by first class mail of the appeal determination. The appeal determination takes effect 30 days following the date of issuance specified in the determination.\n(b) In reviewing the appeal, the commissioner may request additional written or oral information from the provider. The provider has the right to present information by telephone, in writing, or in person concerning the appeal to the commissioner prior to the issuance of the appeal determination within six months of the date the appeal was received by the commissioner. Written requests for conferences must be submitted separately from the appeal letter. Statements made during the review process are not admissible in a contested case hearing absent an express stipulation by the parties to the contested case.\n(c) For an appeal item on which the provider disagrees with the appeal determination, the provider may file with the commissioner a written demand for a contested case hearing to determine the proper resolution of specified appeal items. The demand must be postmarked or received by the commissioner within 30 days of the date of issuance specified in the determination. A contested case demand for an appeal item nullifies the written appeal determination issued by the commissioner for that appeal item. The commissioner shall refer any contested case demand to the Office of the Attorney General.\n(d) A contested case hearing must be heard by an administrative law judge according to sections 14.48 to 14.56. In any proceeding under this section, the appealing party must demonstrate by a preponderance of the evidence that the determination of a payment rate is incorrect.\n(e) Regardless of any rate appeal, the rate established must be the rate paid and must remain in effect until final resolution of the appeal or subsequent desk or field audit adjustment.\n(f) To challenge the validity of rules established by the commissioner pursuant to this section and sections 256B.421, 256B.431, 256B.48, 256B.501, 256B.502, 256R.01, 256R.06, 256R.11, and 256R.12, a provider shall comply with section 14.44.\n(g) The commissioner has discretion to issue to the provider a proposed resolution for specified appeal items upon a request from the provider filed separately from the notice of appeal. The proposed resolution is final upon written acceptance by the provider within 30 days of the date the proposed resolution was mailed to or personally received by the provider, whichever is earlier.\n(h) The commissioner may use the procedures described in this subdivision to resolve appeals filed prior to July 1, 1997.\n[Repealed, 1997 c 107 s 19]\n(a) Notwithstanding section 15.472, paragraph (a), for an issue appealed under subdivision 1, the prevailing party in a contested case proceeding or, if appealed, in subsequent judicial review, must be awarded reasonable attorney fees and costs incurred in litigating the appeal, if the prevailing party shows that the position of the opposing party was not substantially justified. The procedures for awarding fees and costs set forth in section 15.474 must be followed in determining the prevailing party's fees and costs except as otherwise provided in this subdivision. For purposes of this subdivision, \"costs\" means subpoena fees and mileage, transcript costs, court reporter fees, witness fees, postage and delivery costs, photocopying and printing costs, amounts charged the commissioner by the office of administrative hearings, and direct administrative costs of the department; and \"substantially justified\" means that a position had a reasonable basis in law and fact, based on the totality of the circumstances prior to and during the contested case proceeding and subsequent review.\n(b) When an award is made to the department under this subdivision, attorney fees must be calculated at the cost to the department. When an award is made to a provider under this subdivision, attorney fees must be calculated at the rate charged to the provider except that attorney fees awarded must be the lesser of the attorney's normal hourly fee or $100 per hour.\n(c) In contested case proceedings involving more than one issue, the administrative law judge shall determine what portion of each party's attorney fees and costs is related to the issue or issues on which it prevailed and for which it is entitled to an award. In making that determination, the administrative law judge shall consider the amount of time spent on each issue, the precedential value of the issue, the complexity of the issue, and other factors deemed appropriate by the administrative law judge.\n(d) When the department prevails on an issue involving more than one provider, the administrative law judge shall allocate the total amount of any award for attorney fees and costs among the providers. In determining the allocation, the administrative law judge shall consider each provider's monetary interest in the issue and other factors deemed appropriate by the administrative law judge.\n(e) Attorney fees and costs awarded to the department for proceedings under this subdivision must not be reported or treated as allowable costs on the provider's cost report.\n(f) Fees and costs awarded to a provider for proceedings under this subdivision must be reimbursed to them within 120 days of the final decision on the award of attorney fees and costs.\n(g) If the provider fails to pay the awarded attorney fees and costs within 120 days of the final decision on the award of attorney fees and costs, the department may collect the amount due through any method available to it for the collection of medical assistance overpayments to providers. Interest charges must be assessed on balances outstanding after 120 days of the final decision on the award of attorney fees and costs. The annual interest rate charged must be the rate charged by the commissioner of revenue for late payment of taxes that is in effect on the 121st day after the final decision on the award of attorney fees and costs.\n(h) Amounts collected by the commissioner pursuant to this subdivision must be deemed to be recoveries pursuant to section 256.01, subdivision 2, paragraph (n).\n(i) This subdivision applies to all contested case proceedings set on for hearing by the commissioner on or after April 29, 1988, regardless of the date the appeal was filed.\nLegal and related expenses for unresolved challenges to decisions by governmental agencies shall be separately identified and explained on the provider's cost report for each year in which the expenses are incurred. When the challenge is resolved in favor of the governmental agency, the provider shall notify the department of the extent to which its challenge was unsuccessful or the cost report filed for the reporting year in which the challenge was resolved. In addition, the provider shall inform the department of the years in which it claimed legal and related expenses and the amount of the expenses claimed in each year relating to the unsuccessful challenge. The department shall reduce the provider's medical assistance rate in the subsequent rate year by the total amount claimed by the provider for legal and related expenses incurred in an unsuccessful challenge to a decision by a governmental agency.\n[Repealed, 1997 c 107 s 19]\n[Repealed, 1997 c 107 s 19]\n[Repealed, 1997 c 107 s 19]\n[Repealed, 2000 c 449 s 15]",
	"repealed": false
}