{
	"id": "260C.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.151",
	"title": "260C.151 SUMMONS; NOTICE.",
	"text": "After a petition has been filed and unless the parties hereinafter named voluntarily appear, the court shall set a time for a hearing and shall issue a summons requiring the child's parents or legal guardian and any person who has legal custody of the child to appear before the court at a time and place stated. The summons shall have a copy of the petition attached, and shall advise the parties of the right to counsel and of the consequences of failure to obey the summons. The court shall give docket priority to any child in need of protection or services or neglected and in foster care, that contains allegations of child abuse over any other case. As used in this subdivision, \"child abuse\" has the meaning given it in section 630.36, subdivision 2.\nAfter a petition has been filed alleging a child to be in need of protection or services and unless the persons named in clause (1) or (2) voluntarily appears, the court shall issue a notice to:\n(1) a putative father of the child, including any putative father who has timely registered with the Minnesota Fathers' Adoption Registry under section 259.52; and\n(2) a grandparent with the right to participate under section 260C.163, subdivision 2.\n(a) After a petition for termination of parental rights or petition for permanent placement of a child away from a parent under section 260C.505 has been filed, the court shall set a time for the admit or deny hearing as required under the Minnesota Rules of Juvenile Protection Procedure and shall issue a summons requiring the parents of the child to appear before the court at the time and place stated. The court shall issue a notice to:\n(1) a putative father who has timely registered with the Minnesota Fathers' Adoption Registry and who is entitled to notice of an adoption proceeding under section 259.49, subdivision 1; and\n(2) a grandparent with the right to participate under section 260C.163, subdivision 2.\n(b) Neither summons nor notice under this section or section 260C.152 of a termination of parental rights matter or other permanent placement matter under sections 260C.503 to 260C.521 is required to be given to a putative father who has failed to timely register with the Minnesota Fathers' Adoption Registry under section 259.52 unless that individual also meets the requirements of section 257.55 or is required to be given notice under section 259.49, subdivision 1. When a putative father is not entitled to notice under this paragraph and is therefore not given notice, any order terminating the putative father's rights does not give rise to a presumption of parental unfitness under section 260C.301, subdivision 1, paragraph (b), clause (4).\nNotice means written notice as provided in the Minnesota Rules of Juvenile Protection Procedure. The court shall have notice of the pendency of the case and of the time and place of the hearing served as required by subdivision 2. For an Indian child, notice of all proceedings must comply with the Indian Child Welfare Act of 1978, United States Code, title 25, section 1901, et seq., and section 260.765.\nIf a petition alleging a child's need for protection or services, or a petition to terminate parental rights is initiated by a person other than a representative of the Department of Children, Youth, and Families or responsible social services agency, the court administrator shall notify the responsible social services agency of the pendency of the case and of the time and place appointed.\nThe court may issue a subpoena requiring the appearance of any other person whose presence, in the opinion of the court, is necessary.\nIf the court makes individualized, explicit findings, based on the notarized petition or sworn affidavit, that there are reasonable grounds to believe that the child is in surroundings or conditions that endanger the child's health, safety, or welfare that require that responsibility for the child's care and custody be immediately assumed by the responsible social services agency and that continuation of the child in the custody of the parent or guardian is contrary to the child's welfare, the court may order that the officer serving the summons take the child into immediate custody for placement of the child in foster care, preferably with a relative. In ordering that responsibility for the care, custody, and control of the child be assumed by the responsible social services agency, the court is ordering emergency protective care as that term is defined in the juvenile court rules.",
	"repealed": false
}