{
	"id": "281.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/281.29",
	"title": "281.29 STATEMENT TO BE FILED WITH COUNTY AUDITOR.",
	"text": "Each such statement so filed in the office of the county auditor in this state shall be immediately numbered and filed in the auditor's office by such auditor consecutively in the order in which it is received and the auditor shall, at the same time, enter consecutively in the order in which such statement is received, in a book to be kept for that purpose, first, the file number of such statement; second, the date when such statement is received and filed; third, the name of the person or corporation named in such statement as having some right, title, or interest in land or real property, with the post office address of such person or corporation, if given in such statement; and, fourth, the name of the person or corporation named in such statement as the one upon whom or upon which a personal service of notice may be made. At the same time the auditor shall enter the file number of such statement in the real estate transfer book or books under each piece or parcel of land described in such statement. For the duties required of the auditor by sections 281.28 to 281.30 the auditor shall be paid, by the person presenting such statement to be filed, a fee as set by the county board to cover administrative costs for each piece or parcel of land described in such statement. Each such statement shall cease to be valid and effectual as such for any and all purposes of sections 281.28 to 281.30 at the expiration of five years from the date of its filing, or when the person named therein as the one upon whom a personal service of notices may be made dies or ceases to be a resident of such county, or when the corporation named therein as the one upon which a personal service of notices may be made ceases to have an office or place of business within such county. The person or corporation named in a statement filed under the provision of sections 281.28 to 281.30 as having such right, title, or interest may file in the same office in which such statement is filed an instrument releasing any particular piece or parcel of land or real property described in such statement from the effect of such statement, such releasing instrument to be executed with the same formalities as are necessary to entitle conveyances of real estate to record. Such releasing instrument shall be, by the auditor, immediately attached to and filed with such statement affected thereby. Every person or corporation filing such releasing instrument shall, before such releasing instrument is filed, pay to the auditor, for the auditor's own use, a fee of ten cents for each such releasing instrument. From the time such releasing instrument is so filed such statement affected thereby shall cease to be valid and effectual as to such particular piece or parcel of land or real property so released, but shall nevertheless be and remain valid and effectual as such for any and all the purposes of sections 281.28 to 281.30 as to each and every other piece or parcel of land or real property therein described.",
	"repealed": false
}