{
	"id": "116P.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.15",
	"title": "116P.15 CAPITAL CONSTRUCTION AND LAND ACQUISITION; RESTRICTIONS.",
	"text": "A recipient of an appropriation from the trust fund or the Minnesota future resources fund who acquires an interest in real property with the appropriation must comply with subdivision 2. A recipient of an appropriation from the trust fund who uses any portion of the appropriation for a capital construction project with a total cost of $10,000 or more must comply with subdivision 3.\n(a) An easement, fee title, or other interest in real property acquired with an appropriation from the trust fund or the Minnesota future resources fund must be used in perpetuity or for the specific term of an easement interest for the purpose for which the appropriation was made. The ownership of the interest in real property transfers to the state if: (1) the holder of the interest in real property fails to comply with the terms and conditions of the grant agreement or work plan; or (2) restrictions are placed on the land that preclude its use for the intended purpose as specified in the appropriation.\n(b) A recipient of funding who acquires an interest in real property subject to this section may not alter the intended use of the interest in real property or convey any interest in the real property acquired with the appropriation without the prior review and approval of the commission or its successor. The commission shall notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the trust fund or Minnesota future resources fund at least 15 business days before approval under this paragraph. The commission shall establish procedures to review requests from recipients to alter the use of or convey an interest in real property. These procedures shall allow for the replacement of the interest in real property with another interest in real property meeting the following criteria:\n(1) the interest must be at least equal in fair market value, as certified by the commissioner of natural resources, to the interest being replaced; and\n(2) the interest must be in a reasonably equivalent location, and have a reasonably equivalent useful conservation purpose compared to the interest being replaced, taking into consideration all effects from fragmentation of the whole habitat.\n(c) A recipient of funding who acquires an interest in real property under paragraph (a) must separately record a notice of funding restrictions in the appropriate local government office where the conveyance of the interest in real property is filed. The notice of funding agreement must contain:\n(1) a legal description of the interest in real property covered by the funding agreement;\n(2) a reference to the underlying funding agreement;\n(3) a reference to this section; and\n(4) the following statement:\n\"This interest in real property shall be administered in accordance with the terms, conditions, and purposes of the grant agreement controlling the acquisition of the property. The interest in real property, or any portion of the interest in real property, shall not be sold, transferred, pledged, or otherwise disposed of or further encumbered without obtaining the prior written approval of the Legislative-Citizen Commission on Minnesota Resources or its successor. The ownership of the interest in real property transfers to the state if: (1) the holder of the interest in real property fails to comply with the terms and conditions of the grant agreement or work plan; or (2) restrictions are placed on the land that preclude its use for the intended purpose as specified in the appropriation.\"\n(a) A recipient of an appropriation from the trust fund who uses the appropriation to wholly or partially construct a building, trail, campground, or other capital asset may not alter the intended use of the capital asset or convey any interest in the capital asset for 25 years from the date the project is completed without the prior review and approval of the commission or its successor. The commission must notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the trust fund at least 15 business days before approval under this paragraph. The commission must establish procedures to review requests from recipients to alter the use of or convey an interest in a capital asset under this paragraph. These procedures must require that:\n(1) the sale price must be at least fair market value; and\n(2) the trust fund must be repaid a portion of the sale price equal to the percentage of the total funding provided by the fund for constructing the capital asset.\n(b) The commission or its successor may waive the requirements under paragraph (a), clauses (1) and (2), by recommendation to the legislature if the transfer allows for a continued use of the asset in a manner consistent with the original appropriation purpose or with the purposes of the trust fund.\n(c) If both a capital asset and the real property on which the asset is located were wholly or partially purchased with an appropriation from the trust fund and the commission approves a request to alter the use of or convey an interest in the real property under subdivision 2, a separate approval under this subdivision to alter the use of the capital asset is not required.\n(d) A recipient of an appropriation from the trust fund who uses the appropriation to wholly or partially construct a building, trail, campground, or other capital asset must separately record a notice of funding restrictions in the appropriate local government office. The notice of funding restrictions must contain:\n(1) a legal description of the interest in real property covered by the funding agreement;\n(2) a reference to the underlying funding agreement;\n(3) a reference to this subdivision; and\n(4) the following statement:\n\"This interest in real property must be administered in accordance with the terms, conditions, and purposes of the grant agreement controlling the improvement of the property. The interest in real property, or any portion of the interest in real property, must not be altered from its intended use or be sold, transferred, pledged, or otherwise disposed of or further encumbered without obtaining the prior written approval of the Legislative-Citizen Commission on Minnesota Resources or its successor.\"",
	"repealed": false
}