{
	"id": "299A.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.55",
	"title": "299A.55 RAILROAD AND PIPELINE SAFETY; OIL AND OTHER HAZARDOUS SUBSTANCES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Applicable rail carrier\" means a railroad company that is subject to an assessment under section 219.015, subdivision 2.\n(c) \"Emergency manager\" has the meaning given in section 219.055, subdivision 1.\n(d) \"Hazardous substance\" means any material identified in the definition of hazardous substance under section 115B.02, subdivision 8, or Code of Federal Regulations, title 49, section 171.8.\n(e) \"Incident compelling a significant response\" means an event involving rail carrier or pipeline company operations and a derailment, collision, discharge, or other similar activity resulting in applicable response actions performed by firefighters, peace officers, incident commanders, emergency managers, or emergency first responders. For purposes of this paragraph, \"applicable response actions\" consist of one or more of the following: a request for mutual aid or special response resources, establishment of an exclusion zone, an order for evacuation or shelter in place, or emergency notification to the general public.\n(f) \"Oil\" has the meaning given in section 115E.01, subdivision 8.\n(g) \"Pipeline company\" means any individual, partnership, association, or public or private corporation who owns and operates pipeline facilities and is required to show specific preparedness under section 115E.03, subdivision 2.\n(a) A railroad and pipeline safety account is created in the special revenue fund. The account consists of funds collected under subdivision 4 and funds donated, allotted, transferred, or otherwise provided to the account.\n(b) $560,000 is annually appropriated from the railroad and pipeline safety account to the commissioner of the Pollution Control Agency for environmental protection activities related to railroad discharge preparedness under chapter 115E.\n(c) $750,000 in fiscal year 2024 and $1,500,000 in each subsequent fiscal year are transferred from the railroad and pipeline safety account to the grade crossing safety account under section 219.1651.\n(d) Following the appropriation in paragraph (b) and the transfer in paragraph (c), the remaining money in the account is annually appropriated to the commissioner of public safety for the purposes specified in subdivision 3.\n(e) By January 15, 2026, the commissioner of public safety must submit a report on the railroad and pipeline safety account to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The report must list detailed revenues to and expenditures from the account for the previous two fiscal years and must include information on the purpose of each expenditure.\n(f) If the balance of the account at the end of a fiscal biennium is greater than $2,000,000, the amount above $2,000,000 must be transferred to the grade crossing safety account under section 219.1651.\n(a) Subject to funding appropriated for this subdivision, the commissioner shall provide funds for training and response preparedness related to (1) derailments, discharge incidents, or spills involving trains carrying oil or other hazardous substances, and (2) pipeline discharge incidents or spills involving oil or other hazardous substances.\n(b) The commissioner must allocate available funds as follows:\n(1) $100,000 annually for emergency response teams; and\n(2) the remaining amount to the Board of Firefighter Training and Education under section 299N.02, the Division of Homeland Security and Emergency Management, and the State Fire Marshal Division.\n(c) Prior to making allocations under paragraph (b), the commissioner must consult with the Fire Service Advisory Committee under section 299F.012, subdivision 2.\n(d) The commissioner and the entities identified in paragraph (b), clause (2), must prioritize uses of funds based on:\n(1) training needs for firefighters, emergency managers, incident commanders, and emergency first responders;\n(2) community risk from discharge incidents or spills;\n(3) geographic balance;\n(4) risks to the general public; and\n(5) recommendations of the Fire Service Advisory Committee.\n(e) The following are permissible uses of funds provided under this subdivision:\n(1) training costs, which may include, but are not limited to, training curriculum, trainers, trainee overtime salary, other personnel overtime salary, and tuition;\n(2) costs of gear and equipment related to hazardous materials readiness, response, and management, which may include, but are not limited to, original purchase, maintenance, and replacement;\n(3) supplies related to the uses under clauses (1) and (2);\n(4) emergency preparedness planning and coordination;\n(5) emergency response team costs;\n(6) public safety emergency response exercises under section 219.055, subdivision 6;\n(7) incident commander and response site response exercises under section 219.055, subdivision 7;\n(8) education and outreach to encourage the adoption of the AskRail wireless communication device application under section 219.055, subdivision 5;\n(9) postincident review and analysis under subdivision 5, based on costs incurred to state agencies and local units of government; and\n(10) public education and outreach, including but not limited to:\n(i) informing and engaging the public regarding hazards of derailments and discharge incidents;\n(ii) assisting the development of evacuation readiness;\n(iii) undertaking public information campaigns; and\n(iv) providing accurate information to the media on likelihood and consequences of derailments and discharge incidents.\n(f) Notwithstanding paragraph (b), clause (2), from funds in the railroad and pipeline safety account provided for the purposes under this subdivision, the commissioner may retain a balance in the account for budgeting in subsequent fiscal years.\n(a) The commissioner of public safety must annually assess $4,000,000 to railroad and pipeline companies based on the formula specified in paragraph (b). The commissioner must deposit funds collected under this subdivision in the railroad and pipeline safety account under subdivision 2.\n(b) The assessment for each railroad is 70 percent of the total annual assessment amount, divided in equal proportion between applicable rail carriers based on route miles operated in Minnesota. The assessment for each pipeline company is 30 percent of the total annual assessment amount, divided in equal proportion between companies based on the yearly aggregate gallons of oil and other hazardous substances transported by pipeline in Minnesota.\n(c) In addition to the amount identified in paragraph (a), the commissioner must assess the rail carrier or pipeline company involved in an incident compelling a significant response for all postincident review and analysis costs under subdivision 5 incurred by the state and local units of government. This paragraph applies regardless of whether an assessment is imposed under paragraph (a) in a fiscal year.\n(a) After an incident compelling a significant response, or upon request of a fire chief or emergency manager after an incident, the commissioner must ensure a postincident review and analysis is performed in a timely manner. The review and analysis must be undertaken under an agreement with an entity having relevant knowledge and experience that is fully independent of the state, any local units of government involved in the incident, rail carriers, and pipeline companies.\n(b) The review and analysis process must include an after action review and must evaluate, at a minimum, processes occurring during the incident for emergency assessment, hazard operations, population protection, and incident management. The review and analysis must be designed to minimize duplication of topics and issues addressed in any federal review of the incident.\n(c) By March 1 following any calendar year in which one or more postincident reviews and analyses are performed, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation and public safety policy and finance. The report must:\n(1) provide a summary of the incidents;\n(2) identify findings, lessons learned, and process changes; and\n(3) make recommendations for legislative changes, if any.\n(d) Except for the report under paragraph (c), any data under this subdivision are nonpublic data, as defined under section 13.02, subdivision 9.",
	"repealed": false
}