{
	"id": "17.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.055",
	"title": "17.055 EMERGING FARMERS.",
	"text": "To advise the commissioner and legislature regarding the development and implementation of programs and initiatives that support emerging farmers in this state, the commissioner must periodically convene a working group consisting, to the extent possible, of persons who are, and organizations that represent, farmers or aspiring farmers who are women, veterans, persons with disabilities, American Indian or Alaskan Natives, members of a community of color, young, lesbian, gay, bisexual, transgender, queer, intersex, or asexual (LGBTQIA+), or urban, and any other emerging farmers as determined by the commissioner.\nAn emerging farmer account is established in the agricultural fund. The account consists of money appropriated by law and any other money donated, allotted, transferred, or otherwise provided to the account. Money in the account, including interest, is appropriated to the commissioner for the purposes of this section and must be used to further the objectives of the emerging farmer working group.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nThe Emerging Farmers Office exists to support emerging farmers. For purposes of this subdivision, \"emerging farmer\" has the meaning given in subdivision 1. At a minimum, the office must coordinate the emerging farmer working group under subdivision 1 and the beginning farmer equipment and infrastructure grant program under subdivision 3.\n(a) The commissioner may award and administer equipment and infrastructure grants to beginning farmers. The commissioner shall give preference to applicants who are experiencing limited land access or limited market access as those terms are defined in section 17.133, subdivision 1. Grant money may be used for equipment and infrastructure development.\n(b) The commissioner shall develop competitive eligibility criteria and may allocate grants on a needs basis.\n(c) Grant projects may continue for up to two years.\nNo later than February 1 each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over agriculture regarding the emerging farmer working group's activities, recommendations, and any grants awarded under this section.",
	"repealed": false
}