{
	"id": "148E.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.51",
	"title": "148E.51 RULEMAKING.",
	"text": "(a) The Commission shall promulgate reasonable rules in order to effectively and efficiently implement and administer the purposes and provisions of the Compact. A rule shall be invalid and have no force or effect only if a court of competent jurisdiction holds that the rule is invalid because the Commission exercised its rulemaking authority in a manner that is beyond the scope and purposes of the Compact, or the powers granted hereunder, or based upon another applicable standard of review.\n(b) The rules of the Commission shall have the force of law in each member state, provided however that where the rules of the Commission conflict with the laws of the member state that establish the member state's laws, regulations, and applicable standards that govern the practice of social work as held by a court of competent jurisdiction, the rules of the Commission shall be ineffective in that state to the extent of the conflict.\n(c) The Commission shall exercise its rulemaking powers pursuant to the criteria set forth in this section and the rules adopted thereunder. Rules shall become binding on the day following adoption or the date specified in the rule or amendment, whichever is later.\n(d) If a majority of the legislatures of the member states rejects a rule or portion of a rule, by enactment of a statute or resolution in the same manner used to adopt the Compact within four years of the date of adoption of the rule, then such rule shall have no further force and effect in any member state.\n(e) Rules shall be adopted at a regular or special meeting of the Commission.\n(f) Prior to adoption of a proposed rule, the commission shall hold a public hearing and allow persons to provide oral and written comments, data, facts, opinions, and arguments.\n(g) Prior to adoption of a proposed rule by the Commission, and at least 30 days in advance of the meeting at which the Commission will hold a public hearing on the proposed rule, the Commission shall provide a notice of proposed rulemaking:\n(1) on the website of the Commission or other publicly accessible platform;\n(2) to persons who have requested notice of the Commission's notices of proposed rulemaking; and\n(3) in such other way as the Commission may by rule specify.\n(h) The notice of proposed rulemaking shall include:\n(1) the time, date, and location of the public hearing at which the Commission will hear public comments on the proposed rule and, if different, the time, date, and location of the meeting where the Commission will consider and vote on the proposed rule;\n(2) if the hearing is held via telecommunication, video conference, or other electronic means, the Commission shall include the mechanism for access to the hearing in the notice of proposed rulemaking;\n(3) the text of the proposed rule and the reason therefor;\n(4) a request for comments on the proposed rule from any interested person; and\n(5) the manner in which interested persons may submit written comments.\n(i) All hearings will be recorded. A copy of the recording and all written comments and documents received by the Commission in response to the proposed rule shall be available to the public.\n(j) Nothing in this section shall be construed as requiring a separate hearing on each rule. Rules may be grouped for the convenience of the Commission at hearings required by this section.\n(k) The Commission shall, by majority vote of all members, take final action on the proposed rule based on the rulemaking record and the full text of the rule.\n(1) The Commission may adopt changes to the proposed rule, provided the changes do not enlarge the original purpose of the proposed rule.\n(2) The Commission shall provide an explanation of the reasons for substantive changes made to the proposed rule as well as reasons for substantive changes not made that were recommended by commenters.\n(3) The Commission shall determine a reasonable effective date for the rule. Except for an emergency as provided in paragraph (l), the effective date of the rule shall be no sooner than 30 days after issuing the notice that it adopted or amended the rule.\n(l) Upon determination that an emergency exists, the Commission may consider and adopt an emergency rule with 48 hours' notice, with opportunity to comment, provided that the usual rulemaking procedures provided in the Compact and in this section shall be retroactively applied to the rule as soon as reasonably possible, in no event later than 90 days after the effective date of the rule. For the purposes of this provision, an emergency rule is one that must be adopted immediately in order to:\n(1) meet an imminent threat to public health, safety, or welfare;\n(2) prevent a loss of Commission or member state funds;\n(3) meet a deadline for the promulgation of a rule that is established by federal law or rule; or\n(4) protect public health and safety.\n(m) The Commission or an authorized committee of the Commission may direct revisions to a previously adopted rule for purposes of correcting typographical errors, errors in format, errors in consistency, or grammatical errors. Public notice of any revisions shall be posted on the website of the Commission. The revision shall be subject to challenge by any person for a period of 30 days after posting. The revision may be challenged only on grounds that the revision results in a material change to a rule. A challenge shall be made in writing and delivered to the Commission prior to the end of the notice period. If no challenge is made, the revision will take effect without further action. If the revision is challenged, the revision may not take effect without the approval of the Commission.\n(n) No member state's rulemaking requirements shall apply under this compact.",
	"repealed": false
}