{
	"id": "144E.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.41",
	"title": "144E.41 PROGRAM ELIGIBILITY; QUALIFIED AMBULANCE SERVICE PERSONNEL.",
	"text": "(a) Persons eligible to participate in the Cooper/Sams volunteer ambulance program are qualified ambulance service personnel.\n(b) Qualified ambulance service personnel are ambulance attendants, ambulance drivers, and ambulance service medical directors or medical advisors who meet the following requirements:\n(1) employment of the person by or provision by the person of service to an ambulance service that is licensed as such by the state of Minnesota and that provides ambulance services that are generally available to the public and are free of unfair discriminatory practices under chapter 363A;\n(2) performance by the person during the 12 months ending as of the immediately previous June 30 of all or a predominant portion of the person's services in the state of Minnesota or on behalf of Minnesota residents;\n(3) current certification of the person during the 12 months ending as of the immediately previous June 30 by the director as an ambulance attendant, ambulance driver, or ambulance service medical director or medical advisor under section 144E.265 or 144E.28, and supporting rules, and current active ambulance service employment or service provision status of the person; and\n(4) conformance by the person with the definition of the phrase \"volunteer ambulance attendant\" under section 144E.001, subdivision 15, except that for the salary limit specified in that provision there must be substituted, for purposes of this section only, a limit of $6,000 for calendar year 2004, and $6,000 multiplied by the cumulative percentage increase in the national Consumer Price Index, all items, for urban wage earners and clerical workers, as published by the federal Department of Labor, Bureau of Labor Statistics, since December 31, 2004, and for an ambulance service medical director, conformance based solely on the person's hourly stipends or salary for service as a medical director.\n(c) The term \"active ambulance service employment or service provision status\" means being in good standing with and on the active roster of the ambulance service making the certification.\n(d) For a person who is employed by or provides service to more than one ambulance service concurrently during any period during the 12-month period, credit towards an award under this chapter is limited to one ambulance service during any period. The creditable period is with the ambulance service for which the person undertakes the greatest portion of employment or service hours.\n(e) Verification of the person's performance and certification for the 12 months immediately preceding June 30 as required in paragraph (b), clauses (2) and (3), must be reported annually to the director by August 1 in a notarized affidavit from the chief administrative officer of the ambulance service. Affidavits verifying service submitted to the director after August 1 shall not be considered as credited ambulance service for purposes of section 144E.46, unless specifically authorized by law.",
	"repealed": false
}