{
	"id": "15.0147",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.0147",
	"title": "15.0147 COUNCIL ON LGBTQIA2S+ MINNESOTANS.",
	"text": "(a) The Council on LGBTQIA2S+ Minnesotans is established. The council consists of 16 voting members.\n(b) The governor shall appoint a total of 12 public voting members. The governor may additionally appoint a commissioner of a state agency or a designee of the commissioner to serve as an ex-officio, nonvoting member of the council.\n(c) Four legislators shall be appointed to the council. The speaker of the house and the minority leader of the house of representatives shall each appoint one member of the house of representatives to the council. The senate Subcommittee on Committees of the Committee on Rules and Administration shall appoint one member of the senate majority caucus and one member of the senate minority caucus.\n(a) In making appointments to the council, the governor shall consider an appointee's proven dedication and commitment to Minnesota's LGBTQIA2S+ community and any expertise possessed by the appointee that might be beneficial to the council, such as experience in public policy, legal affairs, social work, business, or management. The executive director and legislative members may offer advice to the governor on applicants seeking appointment.\n(b) Terms, compensation, and filling of vacancies for members appointed by the governor are as provided in section 15.059. Removal of members appointed by the governor is governed by section 15.059, except that: (1) a member who misses more than half of the council meetings convened during a 12-month period is automatically removed from the council; and (2) a member appointed by the governor may be removed by a vote of three of the four legislative members of the council. The chair of the council shall inform the governor of the need for the governor to fill a vacancy on the council. Legislative members serve at the pleasure of their appointing authority.\n(c) A member appointed by the governor may serve no more than a total of eight years on the council. A legislator may serve no more than eight consecutive years or 12 nonconsecutive years on the council.\n(a) A member appointed by the governor must attend orientation training within the first six months of service for the member's initial term. The commissioner of administration must arrange for the training to include but not be limited to the legislative process, government data practices, ethics, conflicts of interest, Open Meeting Law, Robert's Rules of Order, fiscal management, and human resources. The governor must remove a member who does not complete the training.\n(b) The council shall annually elect from among the members appointed by the governor a chair and other officers the council deems necessary. These officers and one legislative member selected by the council shall serve as the executive committee of the council.\n(c) Forty percent of voting members of the council constitutes a quorum. A quorum is required to conduct council business. A council member may not vote on any action if the member has a conflict of interest under section 10A.07.\n(d) The council shall receive administrative support from the commissioner of administration under section 16B.371. The council may contract in its own name but may not accept or receive a loan or incur indebtedness except as otherwise provided by law. Contracts must be approved by a majority of the members of the council and executed by the chair and the executive director. The council may apply for, receive, and expend in its own name grants and gifts of money consistent with the powers and duties specified in this section.\n(e) The attorney general shall provide legal services to the council on behalf of the state on all matters relating to the council, including matters relating to the state as the employer of the executive director of the council and other council staff.\n(a) The Legislative Coordinating Commission must appoint an executive director for the council. The executive director must be experienced in administrative activities and familiar with the challenges and needs of Minnesota's LGBTQIA2S+ community of people who identify as lesbian, gay, bisexual, transgender, gender expansive, queer, intersex, asexual, or two-spirit. The executive director serves in the unclassified service at the pleasure of the Legislative Coordinating Commission.\n(b) The Legislative Coordinating Commission must establish a process for recruiting and selecting applicants for the executive director position. This process must include consultation and collaboration with the council.\n(c) The executive director and council members must work together in fulfilling council duties. The executive director must consult with the commissioner of administration to ensure appropriate financial, purchasing, human resources, and other services for operation of the council.\n(d) Once appointed, the council is responsible for supervising the work of the executive director. The council chair must report to the chair of the Legislative Coordinating Commission regarding the performance of the executive director, including recommendations regarding any disciplinary actions. The executive director must appoint and supervise the work of other staff necessary to carry out the duties of the council. The executive director must consult with the council chair prior to taking the following disciplinary actions with council staff: written reprimand, suspension, demotion, or discharge. The executive director and other council staff are executive branch employees.\n(e) The executive director must submit the council's biennial budget request to the commissioner of management and budget as provided under chapter 16A.\n(a) The council must work for the implementation of economic, social, legal, and political equality for Minnesota's community of people who identify as lesbian, gay, bisexual, transgender, gender expansive, queer, intersex, asexual, or two-spirit. The council shall work with the legislature and governor to carry out this work by performing the duties in this section.\n(b) The council shall advise the governor and the legislature on issues confronting the LGBTQIA2S+ community. This may include but is not limited to presenting the results of surveys, studies, and community forums to the appropriate executive departments and legislative committees.\n(c) The council shall advise the governor and the legislature of administrative and legislative changes needed to improve the economic and social condition of Minnesota's LGBTQIA2S+ community. This may include but is not limited to working with legislators to develop legislation to address issues and to work for passage of legislation. This may also include making recommendations regarding the state's affirmative action program and the state's targeted group small business program or working with state agencies and organizations to develop business opportunities and promote economic development for the LGBTQIA2S+ community.\n(d) The council shall advise the governor and the legislature of the implications and effect of proposed administrative and legislative changes on the constituency of the council. This may include but is not limited to tracking legislation, testifying as appropriate, and meeting with executive departments and legislators.\n(e) The council shall serve as a liaison between state government and organizations that serve Minnesota's LGBTQIA2S+ community. This may include but is not limited to working with these organizations to carry out the duties in paragraphs (a) to (d) and working with these organizations to develop informational programs or publications to involve and empower the community in seeking improvement in their economic and social conditions.\n(f) The council shall perform or contract for the performance of studies designed to suggest solutions to the problems of Minnesota's LGBTQIA2S+ community in the areas of education, employment, human rights, health, housing, social welfare, and other related areas.\n(g) In carrying out duties under this subdivision, the council may act to advise on issues that affect the shared constituencies with the councils established in section 15.0145.\nA council member shall:\n(1) attend and participate in scheduled meetings and be prepared by reviewing meeting notes;\n(2) maintain and build communication with Minnesota's LGBTQIA2S+ community;\n(3) collaborate with the council and executive director in carrying out the council's duties; and\n(4) participate in activities the council or executive director deem appropriate and necessary to facilitate the goals and duties of the council.\nThe council must report on the measurable outcomes achieved in the council's current strategic plan to meet its statutory duties, along with the specific objectives and outcome measures proposed for the following year. The council must submit the report by January 15 each year to the chairs and ranking minority members of the legislative committees with primary jurisdiction over state government operations. Each report must cover the calendar year of the year before the report is submitted. The specific objectives and outcome measures for the following current year must focus on three or four achievable objectives, action steps, and measurable outcomes for which the council will be held accountable. The strategic plan may include other items that support the statutory purposes of the council but should not distract from the primary statutory proposals presented. The biennial budget of the council must be submitted to the Legislative Coordinating Commission by February 1 in each odd-numbered year.",
	"repealed": false
}