{
	"id": "179A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.16",
	"title": "179A.16 INTEREST ARBITRATION.",
	"text": "(a) An exclusive representative or an employer of a unit of employees other than essential employees may request interest arbitration by providing written notice of the request to the other party and the commissioner. The written request for arbitration must specify the items to be submitted to arbitration and whether conventional, final-offer total-package, or final-offer item-by-item arbitration is contemplated by the request.\n(b) The items to be submitted to arbitration and the form of arbitration to be used are subject to mutual agreement. If an agreement to arbitrate is reached, it must be reduced to writing and a copy of the agreement filed with the commissioner. A failure to respond, or to reach agreement on the items or form of arbitration, within 15 days of receipt of the request to arbitrate constitutes a rejection of the request.\nAn exclusive representative or employer of a unit of essential employees may petition for binding interest arbitration by filing a written request with the other party and the commissioner. The written request must specify the items which that party wishes to submit to binding arbitration. Within 15 days of the request, the commissioner shall determine whether further mediation of the dispute would be appropriate and shall only certify matters for arbitration in cases where the commissioner believes that both parties have made substantial, good faith bargaining efforts and that an impasse has occurred.\nWithin 15 days from the time the commissioner has certified a matter to be ready for binding arbitration because of an agreement under subdivision 1 or in accordance with subdivision 2, both parties shall submit their final positions on the items in dispute. In the event of a dispute over the items to be submitted to binding arbitration involving essential employees, the commissioner shall determine the items to be decided by arbitration based on the efforts to mediate the dispute and the positions submitted by the parties during the course of those efforts. The parties may stipulate items to be excluded from arbitration.\nThe parties may select persons who are members of the arbitration roster maintained by the bureau to act as the arbitrator or panel in their dispute by mutual agreement. In the event of a mutual agreement on the arbitrator or panel, the commissioner shall advise in writing the arbitrator or panel. If the parties do not mutually agree upon the arbitrator or panel, the commissioner shall provide the parties to the interest arbitration a list of seven arbitrators. The commissioner shall mail the list of arbitrators to the parties within five working days. The parties shall alternately strike names from the list of arbitrators until only a single arbitrator remains, unless the parties request and mutually agree to utilize a panel of three arbitrators. If the parties are unable to agree on who shall strike the first name, the question must be decided by the flip of a coin. The arbitrator or arbitrators remaining after the striking procedure shall constitute the arbitrator or panel.\nThe arbitrator or panel selected by the parties has jurisdiction over the items of dispute certified to and submitted by the commissioner. However, the arbitrator or panel has no jurisdiction or authority to entertain any matter or issue that is not a term and condition of employment, unless the matter or issue was included in the employer's final position. Any decision or part of a decision issued which determines a matter or issue which is not a term or condition of employment and was not included in the employer's final position is void and of no effect. A decision which violates, is in conflict with, or causes a penalty to be incurred under: (1) the laws of Minnesota; or (2) rules promulgated under law, or municipal charters, ordinances, or resolutions, provided that the rules, charters, ordinances, and resolutions are consistent with this chapter, has no force or effect and shall be returned to the arbitrator or panel to make it consistent with the laws, rules, charters, ordinances, or resolutions.\nThe arbitrator or panel may issue subpoenas requiring the attendance and testimony of witnesses and the production of evidence that relates to any matter involved in any dispute before it. The arbitrator or panel may administer oaths and affidavits and may examine witnesses. Attendance of witnesses and the production of evidence may be required from any place in the state at any hearing. However, any hearing must be held in the county where the principal administrative offices of the employer are located, unless another location is selected by agreement of the parties. In case of refusal to obey a subpoena issued under this section, the district court of the state for the county where the proceeding is pending or where the person who refuses to obey is found, or resides, or transacts business, on application of the arbitrator or panel, has jurisdiction to issue an order requiring the person to appear before the panel, to produce evidence, or to give testimony. Failure to obey the order may be punished by the court as a contempt. Posthearing briefs, if any, must be received by the arbitrator within 14 days of the hearing.\n(a) The decision must be issued by the arbitrator or a majority vote of the panel. The decision must resolve the issues in dispute between the parties as submitted by the commissioner. For principals and assistant principals, the arbitrator or panel is restricted to selecting between the final offers of the parties on each impasse item. For other employees, if the parties agree in writing, the arbitrator or panel is restricted to selecting between the final offers of the parties on each impasse item, or the final offer of one or the other parties in its entirety. In considering a dispute and issuing its decision, the arbitrator or panel shall consider the statutory rights and obligations of public employers to efficiently manage and conduct their operations within the legal limitations surrounding the financing of these operations. The decision is final and binding on all parties.\n(b) The arbitrator or panel shall render its decision within 30 days from the date that all arbitration proceedings have concluded. The arbitrator or panel may not request that the parties waive their right to have the decision rendered within 30 days, unless the commissioner grants an extension of the deadline. The commissioner shall remove from the roster for six months the name of any arbitrator who does not render the decision within 30 days or within the extension granted by the commissioner. The commissioner shall adopt rules establishing criteria to be followed in determining whether an extension should be granted. The decision must be for the period stated in the decision, except that decisions determining contracts for teacher units are effective to the end of the contract period determined by section 179A.20.\n(c) The arbitrator or panel shall send its decision to the commissioner, the appropriate representative of the public employer, and the employees. If any issues submitted to arbitration are settled voluntarily before the arbitrator or panel issues a decision, the arbitrator or panel shall report the settlement to the commissioner.\n(d) The parties may, at any time before or after issuance of a decision of the arbitrator or panel, agree upon terms and conditions of employment regardless of the terms and conditions of employment determined by the decision. The parties shall, if so agreeing, execute a written contract or memorandum of contract.\n[Repealed, 2008 c 267 s 1]\nThe commissioner shall maintain a database of all fees, charges, and per diems charged by each arbitrator. The database must include the total charges imposed by the arbitrator in the previous six interest arbitration cases. For each arbitration decision rendered by an arbitrator, the arbitrator shall submit a copy of the award and a description of all fees, charges, and per diems assessed to the parties to the commissioner. Data from this database must be available to the public. All costs of the panel must be shared equally by the parties to the dispute.\nFailure to reach agreement on employer payment of, or contributions toward, premiums for group insurance coverage of retired employees is not subject to interest arbitration procedures under this section, except for units of essential employees.",
	"repealed": false
}