{
	"id": "62J.312",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.312",
	"title": "62J.312 CENTER FOR HEALTH CARE AFFORDABILITY.",
	"text": "(a) The commissioner shall establish a center for health care affordability within the Minnesota Department of Health. The commissioner, through the center, shall carry out the duties assigned under this section.\n(b) The commissioner shall conduct research on and analyze the drivers of health care spending growth in order to increase transparency and identify strategies that help to reduce waste and low-value care; eliminate unproductive administrative spending; enhance the provision of effective, high-value care; consider the sustainability of health care spending growth and the relationship of health care spending growth to health equity; and identify delivery system, payment, and health care market reforms to increase health care affordability.\n(c) To perform the duties under paragraph (b), the commissioner shall:\n(1) identify additional data needed from health care entities and the level of granularity of required reporting, while limiting additional reporting burdens to the extent possible by ensuring effective use of existing data and reporting mechanisms;\n(2) establish the form and manner for data reporting, including but not limited to data specifications, methods of reporting, and reporting schedules;\n(3) assist reporting entities in submitting data and information; and\n(4) conduct background research and environmental scans, perform qualitative and quantitative analyses, and perform economic modeling.\n(a) The commissioner shall obtain public feedback on the research agenda for the center for health care affordability and on the research activities conducted under this section by consulting with health care entities, licensed physicians and other health care providers, employers and other purchasers, the commissioners of human services and management and budget, patients and patient advocates, individuals with expertise in health care spending or health economics, and other stakeholders. The commissioner may convene an advisory body or bodies to obtain public feedback.\n(b) The commissioner shall hold public hearings, at least annually, to share initial and final analyses conducted under this section, solicit community input on strategies to strengthen health care affordability, and hear testimony about experiences and challenges related to health care affordability.\nThe commissioner shall provide periodic reports to the chairs and ranking minority members of the legislative committees with jurisdiction over health care finance and policy describing the analyses conducted under this section and making recommendations for strategies to address unsustainable rates of health care spending growth.\nIn carrying out the duties required by this section, the commissioner may contract with entities with expertise in health economics, health care finance, accounting, and actuarial science.\n(a) The commissioner may request that a state agency provide data in a usable format as requested by the commissioner at no cost to the commissioner.\n(b) The commissioner may also request from a state agency unique or custom data sets. That agency may charge the commissioner for providing the data at the same rate the agency would charge any other public or private entity.\n(c) Unless specified elsewhere in statute, any information provided to the commissioner by a state agency must be de-identified. For purposes of this requirement, \"de-identified\" means that a process was used to prevent the identity of a person from being connected with information and to ensure that all identifiable information has been removed.\n(d) Notwithstanding any provisions to the contrary, the commissioner may use data collected and maintained under section 62U.04 to carry out the duties required under this section.\n(e) Any health care entity subject to reporting under this section that fails to provide data in the form and manner prescribed by the commissioner is subject to a fine paid to the commissioner of up to $500 for each day the data are past due. The commissioner may grant an extension of the reporting deadlines upon a showing of good cause by the entity. Any fine levied against the entity under this subdivision is subject to the contested case and judicial review provisions of sections 14.57 and 14.69.\n(f) Any data submitted to the commissioner must retain their original classification under the Minnesota Data Practices Act under chapter 13.\nMS 2023 Supp [Repealed, 2024 c 127 art 59 s 57]",
	"repealed": false
}