{
	"id": "60C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/60C.05",
	"title": "60C.05 POWERS AND DUTIES.",
	"text": "The association shall:\n(a) Be deemed the insurer to the extent of its obligation on the covered claims and have the right to pursue and retain salvage and subrogation recoverables on covered claim obligations to the extent paid or acknowledged in writing as an obligation by the association.\nThe association shall not be deemed the insolvent insurer for any purpose relating to the issue of whether the association is amenable to the personal jurisdiction of the courts of any state.\n(b) Allocate claims paid and expenses incurred among the five accounts and assess member insurers separately for each account the amounts necessary to pay the obligations of the association under clause (a), the expenses of handling claims, the cost of examinations under section 60C.15, and other expenses authorized by this chapter.\n(c) Notify claimants in this state as considered necessary by the commissioner, to the extent records are available to the association. If sufficient information for notification by mail is not available, notice by publication in a newspaper of general circulation is sufficient.\n(d) Handle claims through its employees or through one or more insurers or other persons designated as servicing facilities. Designation of a servicing facility is subject to the approval of the commissioner, but the designation may be declined.\n(e) Reimburse each servicing facility for obligations of the association paid by the facility and for expenses incurred by the facility while handling claims on behalf of the association and shall pay the other expenses of the association authorized by this chapter.\n(f) Notify each member insurer of its assessment not later than 30 days before it is due.\n(g) Issue to each insurer paying an assessment under this chapter a certificate of contribution, in a form prescribed by the commissioner, for the amount so paid. All outstanding certificates shall be of equal dignity and priority without reference to amounts or dates of issue. A certificate of contribution may be shown by the insurer in its financial statement as an asset in the form and for the amount, if any, and period of time the commissioner approves.\n(h) Have the right to appoint or substitute and to direct legal counsel retained under insurance policies for the defense of covered claims.\nThe association may:\n(a) Employ or retain the persons necessary to handle claims and perform other duties of the association.\n(b) Borrow funds necessary to effect the purposes of this chapter, in accord with the plan of operation.\n(c) Sue or be sued.\n(d) Negotiate and become a party to the contracts necessary to carry out the purpose of this chapter.\n(e) Perform other acts necessary or proper to effectuate the purpose of this chapter.\n(f) Subject to section 60C.06, subdivision 6, refund to the member insurers in proportion to the contribution of each member insurer to that account the amount by which the assets of the account exceed the liabilities, if at the end of the calendar year the board of directors finds that the assets of the association in any account exceed the liabilities of that account as estimated by the board of directors for the coming year.\n(g) Request the court to disapprove or modify any claim for which approval is sought under the provisions of section 60B.45, subdivision 2, or 60B.58, subdivision 2.",
	"repealed": false
}