{
	"id": "116C.731",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.731",
	"title": "116C.731 TRANSPORTING HIGH-LEVEL RADIOACTIVE WASTE.",
	"text": "Before a shipment of high-level radioactive waste is transported in the state, the shipper shall notify the commissioner of public safety. The notice shall include the route, date, and time of the shipment in addition to information required under Code of Federal Regulations, title 10, sections 71.5(a) and 73.37(f).\nPursuant to Code of Federal Regulations, title 49, part 177, the commissioner may require preferred routes, dates, or times for transporting high-level radioactive waste if the commissioner determines, in accordance with United States Department of Transportation \"Guidelines for Selecting Preferred Highway Routes for Large Quantity Shipments of Radioactive Materials,\" that alternatives are safer than those proposed. On an annual basis the commissioner shall review federally approved highway routes for transporting high-level radioactive waste in the state and select new state-designated routes in accordance with Code of Federal Regulations, title 49, part 177, if safety considerations indicate the alternate routes would be preferable. The state does not incur any liability by requiring the alternate routes, dates, or times to be used.\nA person who intends to transport high-level radioactive waste shall submit a transportation fee to the commissioner of public safety in the amount of $1,000 for each vehicle carrying high-level radioactive waste in each shipment with the information required in subdivision 1. The fees shall be deposited by the commissioner into the general fund.\nThe commissioner of public safety shall consult with the commissioners of health and transportation, the commissioner of the Pollution Control Agency, and representatives of the federal Nuclear Regulatory Commission, the federal Emergency Management Agency, and the United States Department of Transportation and before December 1, 1984, shall prepare a plan for emergency response to a high-level radioactive waste transportation accident, including plans for evacuation and cleanup. The commissioner of public safety shall report by January 1 of each year to the legislature on the status of the plan and the ability of the state to respond adequately to an accident.\nThis section does not apply to radioactive materials shipped by or for the United States government for military, national security, or national defense purposes. This section does not require disclosure of defense information or restricted data as defined in the Atomic Energy Act of 1954, United States Code, title 42, section 2014, as amended.",
	"repealed": false
}