{
	"id": "302A.449",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.449",
	"title": "302A.449 PROXIES.",
	"text": "(a) A shareholder may cast or authorize the casting of a vote by (1) filing a written appointment of a proxy, signed by the shareholder, with an officer of the corporation at or before the meeting at which the appointment is to be effective, or (2) telephonic transmission or authenticated electronic communication, whether or not accompanied by written instructions of the shareholder, of an appointment of a proxy with the corporation or the corporation's duly authorized agent at or before the meeting at which the appointment is to be effective. The telephonic transmission or authenticated electronic communication must set forth or be submitted with information from which it can be determined that the appointment was authorized by the shareholder. If it is reasonably concluded that the telephonic transmission or authenticated electronic communication is valid, the inspectors of election or, if there are no inspectors, the other persons making that determination shall specify the information upon which they relied to make that determination. A proxy so appointed may vote on behalf of the shareholder, or otherwise participate, in a meeting by remote communication according to section 302A.436 to the extent the shareholder appointing the proxy would have been entitled to participate by remote communication according to section 302A.436 if the shareholder did not appoint the proxy.\n(b) A copy, facsimile telecommunication, or other reproduction of the original writing or transmission may be substituted or used in lieu of the original writing or transmission for any purpose for which the original writing or transmission could be used, provided that the copy, facsimile telecommunication, or other reproduction is a complete and legible reproduction of the entire original writing or transmission.\n(c) An appointment of a proxy for shares held jointly by two or more shareholders is valid if signed or consented to by authenticated electronic communication by any one of them, unless the corporation receives from any one of those shareholders written notice or authenticated electronic communication either denying the authority of that person to appoint a proxy or appointing a different proxy.\nThe appointment of a proxy is valid for 11 months, unless a longer period is expressly provided in the appointment. No appointment is irrevocable unless the appointment is coupled with an interest in the shares or in the corporation.\nAn appointment may be terminated at will, unless the appointment is coupled with an interest, in which case it shall not be terminated except in accordance with the terms of an agreement, if any, between the parties to the appointment. Termination may be made: (1) by filing written notice of the termination of the appointment with an officer of the corporation, (2) by filing a new written appointment of a proxy, signed by the shareholder, with an officer of the corporation, (3) by telephonic transmission or authenticated electronic communication, whether or not accompanied by written instructions of the shareholder, of a new appointment of a proxy with the corporation or the corporation's duly authorized agent, or (4) by the shareholder's attendance and voting at the meeting of shareholders to which the appointment relates. Termination in any such manner revokes all prior proxy appointments and is effective when filed with an officer of the corporation, when the telephonic transmission or authenticated electronic communication is received by the corporation or the corporation's duly authorized agent, or when the shareholder votes at the meeting. The telephonic transmission or authenticated electronic communication must set forth or be submitted with information from which it can be determined that the new appointment was authorized by the shareholder.\nThe death or incapacity of a person appointing a proxy does not revoke the authority of the proxy, unless written notice of the death or incapacity is received by an officer of the corporation before the proxy exercises the authority under that appointment.\nUnless the appointment specifically provides otherwise, if two or more persons are appointed as proxies for a shareholder:\n(a) Any one of them may vote the shares on each item of business in accordance with specific instructions contained in the appointment; and\n(b) If no specific instructions are contained in the appointment with respect to voting the shares on a particular item of business, the shares shall be voted as a majority of the proxies determine. If the proxies are equally divided, the shares shall not be voted.\nUnless the appointment of a proxy contains a restriction, limitation, or specific reservation of authority, the corporation may accept a vote or action taken by a person named in the appointment. The vote of a proxy is final, binding, and not subject to challenge, but the proxy is liable to the shareholder or beneficial owner for damages resulting from a failure to exercise the proxy or from an exercise of the proxy in violation of the authority granted in the appointment.\nNotwithstanding any contrary provision of this chapter, a proxy relating to a meeting of shareholders required under section 302A.671, subdivision 3, must be solicited separately from the offer to purchase or solicitation of an offer to sell shares of the issuing public corporation. Except for irrevocable proxies appointed in the regular course of business and not in connection with a control share acquisition, all proxies appointed for or in connection with the shareholder authorization of a control share acquisition pursuant to section 302A.671 shall be at all times terminable at will prior to the obtaining of the shareholder authorization, whether or not the proxy is coupled with an interest. Without affecting any vote previously taken, the proxy may be terminated in any manner permitted by subdivision 3, or by giving oral notice of the termination in the open meeting of shareholders held pursuant to section 302A.671, subdivision 3. The presence at a meeting of the person appointing a proxy does not revoke the appointment.\nIf a proxy is given authority by a shareholder to vote on less than all items of business considered at a meeting of shareholders, the shareholder is considered to be present and entitled to vote by the proxy for purposes of section 302A.437, subdivision 1, only with respect to those items of business for which the proxy has authority to vote. A proxy who is given authority by a shareholder who abstains with respect to an item of business is considered to have authority to vote on the item of business for purposes of this subdivision.",
	"repealed": false
}