{
	"id": "62Q.737",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.737",
	"title": "62Q.737 SERVICE CODE CHANGES.",
	"text": "(a) For purposes of this section, \"service code\" means current procedural terminology (CPT), current dental terminology (CDT), ICD-CM, diagnosis-related groups (DRGs), or other coding system.\n(b) The health plan company shall determine the manner in which it adjudicates claims. The provider may request a description of the general coding guidelines applicable to the health care services the provider is reasonably expected to render pursuant to the contract. The health plan company or its designee shall provide the coding guidelines not later than 30 days after the date the health plan receives the request. The health plan company shall provide notice of material changes to the coding guidelines not later than 45 days prior to the date the changes take effect and shall not make retroactive revision to the coding guidelines, but may issue new guidelines. A provider who receives information under this section may use or disclose the information only for the purpose of practice management, billing activities, or other business operations and may not disclose the information to third parties without the consent of the health plan company.\n(c) The health plan company may correct an error in a submitted claim that prevents the claim from being processed, provided that the health plan company:\n(1) notifies the provider of the change and reason for the change according to federal Health Insurance Portability and Accountability Act (HIPAA) transaction standards; and\n(2) offers the provider the opportunity to appeal any changes.\n(d) Nothing in this section shall be interpreted to require a health plan company to violate copyright or other law by disclosing proprietary licensed software. In addition to the above, the health plan company shall, upon request of a contracted provider, disclose the name, edition, and model version of the software that the health plan company uses to determine bundling and unbundling of claims.\n(e) This section does not apply to government programs, including state public programs, Medicare, and Medicare-related coverage.",
	"repealed": false
}