{
	"id": "15.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.75",
	"title": "15.75 CONTRACTS WITH REGIONAL ORGANIZATIONS.",
	"text": "The purpose of this section is to promote efficient and effective delivery of government services throughout greater Minnesota by encouraging state agencies to cooperate in the provision of services with a system of regional organizations that have the capacity to coordinate state resources with resources of local government units.\nA state agency may contract with a system of regional organizations in greater Minnesota for delivery of services not currently delivered at the regional level on behalf of the state agency.\nFor the purposes of this section, the service delivery areas of the system are the challenge grant regions designated under section 116J.415, subdivision 2.\n(a) The system of regional organizations that may provide services for state agencies in service delivery areas are as established in paragraphs (b) to (e).\n(b) If a service delivery area is identical to the region designated under section 462.385, the regional development commission established under section 462.387 shall perform the services.\n(c) If a service delivery area contains more than one region designated under section 462.385, services must be performed on the basis of contractual agreements among all regional development commissions in the service delivery area.\n(d) If a service delivery area is only partially served by active regional development commissions, state funds for the service must first be offered to potential service providers in the area not served by an active commission. If no provider agrees to provide the service, an active commission or other regional entity in the area not served by an active commission, may, on the basis of an agreement with local units of government in the service delivery area, perform the services.\n(e) If a service delivery area does not contain an active regional development commission, state funds for the service must first be offered to potential service providers in the area. If no provider agrees to provide the service, a state agency may enter into an agreement with another regional entity to provide services. In this case, the regional entity providing services shall create an advisory committee which includes elected officials of counties, cities, and towns in the region.\n(f) This subdivision does not limit the authority of a state agency to enter into contractual agreements for services with other agencies or with local units of government.\nThe commissioner of employment and economic development may enter into agreements with regional entities established under subdivision 4 to prepare plans to ensure coordination of the department's business development, community development, workforce development, and trade functions with programs of local units of government and other public and private development agencies in the regions. The plans will identify regional development priorities and serve as a guide for the implementation of the department's programs in the regions.",
	"repealed": false
}