{
	"id": "10A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.27",
	"title": "10A.27 CONTRIBUTION LIMITS.",
	"text": "(a) Except as provided in subdivision 2, a candidate must not permit the candidate's principal campaign committee to accept aggregate contributions made or delivered by any individual, political committee, political fund, or association not registered with the board in excess of the following:\n(1) to candidates for governor and lieutenant governor running together, $4,000 in the election segment of an election cycle for the office sought and $2,000 in the nonelection segment of the election cycle;\n(2) to a candidate for attorney general, $2,500 in the election segment of an election cycle for the office sought and $1,500 in the nonelection segment of the election cycle;\n(3) to a candidate for secretary of state or state auditor, $2,000 in the election segment of an election cycle and $1,000 in the nonelection segment of the election cycle;\n(4) to a candidate for state senator, $1,000 in the election segment of an election cycle for the office sought and $1,000 in a nonelection segment of the election cycle;\n(5) to a candidate for state representative, $1,000 in the election segment of an election cycle for the office sought; and\n(6) to a candidate for judicial office, $2,500 in the election segment of an election cycle for the office sought and $2,500 in a nonelection segment of the election cycle.\n(b) The following deliveries are not subject to the bundling limitation in this subdivision:\n(1) delivery of contributions collected by a member of the candidate's principal campaign committee, such as a block worker or a volunteer who hosts a fundraising event, to the committee's treasurer; and\n(2) a delivery made by an individual on behalf of the individual's spouse.\n(c) A lobbyist, political committee, political party unit, an association that has a political fund, or an association not registered with the board must not make a contribution a candidate is prohibited from accepting.\nA candidate must not permit the candidate's principal campaign committee to accept contributions from any political party units or dissolving principal campaign committees in aggregate in excess of ten times the amount that may be contributed to that candidate as set forth in subdivision 1. The limitation in this subdivision does not apply to a contribution from a dissolving principal campaign committee of a candidate for the legislature to another principal campaign committee of the same candidate.\n[Repealed, 1978 c 463 s 109]\n[Repealed by amendment, 1999 c 220 s 34]\n[Repealed by amendment, 1999 c 220 s 34]\n[Repealed, 1993 c 318 art 2 s 51]\n[Repealed by amendment, 1999 c 220 s 34]\n(a) A candidate must not permit the candidate's principal campaign committee to accept a loan from other than a financial institution for an amount in excess of the contribution limits imposed by this section. A candidate must not permit the candidate's principal campaign committee to accept a loan from a financial institution for which the financial institution may hold an endorser of the loan liable to pay an amount in excess of the amount that the endorser may contribute to that candidate.\n(b) A candidate's principal campaign committee must not accept a loan from the candidate if the terms of the loan require the candidate's principal campaign committee to pay interest to the candidate.\n(a) A candidate or the treasurer of a candidate's principal campaign committee must not accept a contribution from another candidate's principal campaign committee or from any other committee bearing the contributing candidate's name or title or otherwise authorized by the contributing candidate, unless the contributing candidate's principal campaign committee is being dissolved. A candidate's principal campaign committee must not make a contribution to another candidate's principal campaign committee, except when the contributing committee is being dissolved.\n(b) A principal campaign committee that makes a contribution to another principal campaign committee must provide with the contribution a written statement of the committee's intent to dissolve and terminate its registration within 12 months after the contribution was made. If the committee fails to dissolve and terminate its registration by that time, the board may levy a civil penalty up to four times the size of the contribution against the contributing committee. A contribution from a terminating principal campaign committee that is not accepted by another principal campaign committee must be forwarded to the board for deposit in the general account of the state elections campaign account.\n(c) A candidate's principal campaign committee must not accept a contribution from, or make a contribution to, a committee associated with a person who seeks nomination or election to the office of president, senator, or representative in Congress of the United States.\n(d) A candidate or the treasurer of a candidate's principal campaign committee must not accept a contribution from a candidate for political subdivision office in any state, unless the contribution is from the personal funds of the candidate for political subdivision office. A candidate or the treasurer of a candidate's principal campaign committee must not make a contribution from the principal campaign committee to a candidate for political subdivision office in any state.\nA candidate who signs an agreement under section 10A.322 may not contribute to the candidate's own campaign during a segment of an election cycle more than five times the candidate's contribution limit for that segment under subdivision 1.\n(a) A candidate must not permit the candidate's principal campaign committee to accept a contribution from a political committee, political fund, lobbyist, or association not registered with the board if the contribution will cause the aggregate contributions from those types of contributors during an election cycle segment to exceed an amount equal to 20 percent of the election cycle segment expenditure limits for the office sought by the candidate, provided that the 20 percent limit must be rounded to the nearest $100.\n(b) A candidate must not permit the candidate's principal campaign committee to accept a contribution that is prohibited by section 211B.15.\n[Repealed by amendment, 1999 c 220 s 34]\n(a) The treasurer of a political committee, political fund, principal campaign committee, or party unit must not accept a contribution of more than $200 from an association not registered under this chapter unless the contribution is accompanied by a statement that meets the disclosure and reporting period requirements imposed by section 10A.20. The statement may be a written statement or a government website where the disclosure report for the unregistered association may be viewed. This statement must be certified as true and correct by an officer of the contributing association. The committee, fund, or party unit that accepts the contribution must include a copy of the written statement or website with the report that discloses the contribution to the board.\n(b) An unregistered association may provide the statement required by this subdivision to no more than three committees, funds, or party units in a calendar year. Each statement must cover at least the 30 days immediately preceding and including the date on which the contribution was made. An unregistered association or an officer of it is subject to a civil penalty imposed by the board of up to $1,000, if the association or its officer:\n(1) fails to provide a statement as required by this subdivision; or\n(2) fails to register after giving the statement required by this subdivision to more than three committees, funds, or party units in a calendar year.\n(c) The treasurer of a political committee, political fund, principal campaign committee, or party unit who accepts a contribution in excess of $200 from an unregistered association without the required disclosure statement is subject to a civil penalty up to four times the amount in excess of $200.\n(d) This subdivision does not apply:\n(1) when a national political party contributes money to its state committee;\n(2) when a federal committee of a major or minor political party registered with the board gives an in-kind contribution to the federal committee's state central committee or a party organization within a house of the state legislature; or\n(3) to purchases by candidates for federal office of tickets to events or space rental at events held by party units in this state (i) if the geographical area represented by the party unit includes any part of the geographical area of the office that the federal candidate is seeking and (ii) the purchase price is not more than that paid by other attendees or renters of similar spaces.\nAn association may, if not prohibited by other law, contribute revenue from the operation of a business to an independent expenditure or ballot question political committee or fund without complying with subdivision 13.\n(a) An association may, if not prohibited by other law, contribute its general treasury money to an independent expenditure or ballot question political committee or fund, including its own independent expenditure or ballot question political committee or fund, without complying with subdivision 13.\n(b) Before the day when the recipient committee or fund's next report must be filed with the board under section 10A.20, subdivision 2 or 5, an association that has contributed more than $5,000 in aggregate to independent expenditure political committees or funds during the calendar year or has contributed more than $5,000 in aggregate to ballot question political committees or funds during the calendar year must provide in writing to the recipient's treasurer a statement that includes the name, address, and amount attributable to each person that paid the association dues or fees, or made donations to the association that, in total, aggregate more than $5,000 of the contribution from the association to the independent expenditure or ballot question political committee or fund. The statement must also include the total amount of the contribution attributable to persons not subject to itemization under this section. The statement must be certified as true by an officer of the donor association.\n(c) To determine the amount of membership dues or fees, or donations made by a person to an association and attributable to the association's contribution to the independent expenditure or ballot question political committee or fund, the donor association must:\n(1) apply a pro rata calculation to all unrestricted dues, fees, and contributions received by the donor association in the calendar year; or\n(2) as provided in paragraph (d), identify the specific individuals or associations whose dues, fees, or contributions are included in the contribution to the independent expenditure political committee or fund.\n(d) Dues, fees, or contributions from an individual or association must be identified in a contribution to an independent expenditure political committee or fund under paragraph (c), clause (2), if:\n(1) the individual or association has specifically authorized the donor association to use the individual's or association's dues, fees, or contributions for this purpose; or\n(2) the individual's or association's dues, fees, or contributions to the donor association are unrestricted and the donor association designates them as the source of the subject contribution to the independent expenditure political committee or fund.\n(e) After a portion of the general treasury money received by an association from a person has been designated as the source of a contribution to an independent expenditure or ballot question political committee or fund, that portion of the association's general treasury money received from that person may not be designated as the source of any other contribution to an independent expenditure or ballot question political committee or fund.\nThe treasurer of a political committee or political fund receiving a statement required under subdivision 15 must file a copy of the statement before the deadline for the committee or fund's next report filed with the board under section 10A.20, subdivision 2 or 5, after receiving the statement.\n(a) Prior to the merger of separate principal campaign committees for governor and lieutenant governor, each committee may accept contributions up to the limits set forth in section 10A.27, subdivision 1, paragraph (a), for governor and lieutenant governor running together.\n(b) After the merger of the committees, contributions to either committee from a single source must be aggregated in determining whether the contribution limit for the joint committee has been reached or exceeded. If the limit has been exceeded, contributions must be returned as provided in paragraph (c).\n(c) Funds transferred to the joint committee for candidates for governor and lieutenant governor that result in aggregate contributions in excess of the applicable limits may be returned to the contributor within 90 days of the transfer of funds to the joint committee.\nElection segment contribution limits set forth in this section apply to a special election cycle.\nContribution limits apply independently for election segments, nonelection segments, and special election cycles.\n(a) An association that makes a contribution under subdivision 15 and fails to provide the required statement within the time specified is subject to a late filing fee of $100 a day not to exceed $1,000, commencing the day after the statement was due. The board must send notice by certified mail that the individual or association may be subject to a civil penalty for failure to file the statement. An association that fails to provide the required statement within seven days after the certified mail notice was sent by the board is subject to a civil penalty of up to four times the amount of the contribution, but not to exceed $25,000.\n(b) An independent expenditure political committee or an independent expenditure political fund that files a report without including the statement required under subdivision 15 is subject to a late filing fee of $100 a day not to exceed $1,000, commencing the day after the report was due. The board must send notice by certified mail that the independent expenditure political committee or independent expenditure fund may be subject to a civil penalty for failure to file the statement. An association that fails to provide the required statement within seven days after the certified mail notice was sent by the board is subject to a civil penalty of up to four times the amount of the contribution for which disclosure was not filed, but not to exceed $25,000.\n(c) If an independent expenditure political committee or an independent expenditure political fund has been assessed a late filing fee under this subdivision during the prior four years, the board may impose a late filing fee of up to twice the amount otherwise authorized by this subdivision. If an independent expenditure political committee or an independent expenditure political fund has been assessed a late filing fee under this subdivision more than two times during the prior four years, the board may impose a late filing fee of up to three times the amount otherwise authorized by this subdivision.\n(d) No other penalty provided in law may be imposed for conduct that is subject to a civil penalty under this section.",
	"repealed": false
}