{
	"id": "239.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.011",
	"title": "239.011 DIVISION RESPONSIBILITIES AND POWERS.",
	"text": "The division shall:\n(1) ensure that weights and measures in commercial service within the state are suitable for their intended use, properly installed, accurate, and properly maintained by their owners or users;\n(2) prevent unfair or deceptive dealing by weight or measure in a commodity or service advertised, packaged, sold, or purchased within the state;\n(3) make the precision calibration and related metrological certification capabilities of the division available to users of physical standards or weighing and measuring equipment;\n(4) promote uniformity, to the extent practicable and desirable, between the weights and measures requirements of Minnesota and those of other states and federal agencies; and\n(5) adopt weights and measures requirements that will protect consumers, promote equity between buyers and sellers, and encourage desirable economic growth.\nTo carry out the responsibilities in section 239.01 and subdivision 1, the director:\n(1) shall take charge of, keep, and maintain in good order the standard of weights and measures of the state and keep a seal so formed as to impress, when appropriate, the letters \"MINN\" and the date of sealing upon the weights and measures that are sealed;\n(2) has general supervision of the weights, measures, and weighing and measuring devices offered for sale, sold, or in use in the state;\n(3) shall maintain traceability of the state standards to the national standards of the National Institute of Standards and Technology;\n(4) shall enforce this chapter;\n(5) shall grant variances from department rules, within the limits set by rule, when appropriate to maintain good commercial practices or when enforcement of the rules would cause undue hardship;\n(6) shall conduct investigations to ensure compliance with this chapter;\n(7) may delegate to division personnel the responsibilities, duties, and powers contained in this section;\n(8) shall test annually, and approve when found to be correct, the standards of weights and measures used by the division, by a town, statutory or home rule charter city, or county within the state, or by a person using standards to repair, adjust, or calibrate commercial weights and measures;\n(9) shall inspect and test weights and measures kept, offered, or exposed for sale;\n(10) shall inspect and test, to ascertain if they are correct, weights and measures commercially used to:\n(i) determine the weight, measure, or count of commodities or things sold, offered, or exposed for sale, on the basis of weight, measure, or count; and\n(ii) compute the basic charge or payment for services rendered on the basis of weight, measure, or count;\n(11) shall approve for use and mark weights and measures that are found to be correct;\n(12) shall reject, and mark as rejected, weights and measures that are found to be incorrect and may seize them if those weights and measures:\n(i) are not corrected within the time specified by the director;\n(ii) are used or disposed of in a manner not specifically authorized by the director; or\n(iii) are found to be both incorrect and not capable of being made correct, in which case the director shall condemn those weights and measures;\n(13) shall weigh, measure, or inspect packaged commodities kept, offered, or exposed for sale, sold, or in the process of delivery, to determine whether they contain the amount represented and whether they are kept, offered, or exposed for sale in accordance with this chapter and department rules. In carrying out this section, the director must employ recognized sampling procedures, such as those contained in National Institute of Standards and Technology Handbook 133, \"Checking the Net Contents of Packaged Goods\";\n(14) shall prescribe the appropriate term or unit of weight or measure to be used for a specific commodity when an existing term or declaration of quantity does not facilitate value comparisons by consumers, or creates an opportunity for consumer confusion;\n(15) shall allow reasonable variations from the stated quantity of contents, including variations caused by loss or gain of moisture during the course of good distribution practice or by unavoidable deviations in good manufacturing practice, only after the commodity has entered commerce within the state;\n(16) shall inspect and test petroleum products in accordance with this chapter and chapter 296A;\n(17) shall collect inspection fees in accordance with sections 239.10 and 239.101; and\n(18) shall provide metrological services and support to businesses and individuals in the United States who wish to market products and services in the member nations of the European Economic Community, and other nations outside of the United States by:\n(i) meeting, to the extent practicable, the measurement quality assurance standards described in the International Standards Organization ISO 17025;\n(ii) maintaining, to the extent practicable, certification of the metrology laboratory by an internationally accepted accrediting body such as the National Voluntary Laboratory Accreditation Program (NVLAP); and\n(iii) providing calibration and consultation services to metrology laboratories in government and private industry in the United States.\n(a) The annual testing and inspection requirements for liquefied petroleum gas-measuring equipment, as set forth in section 239.10, subdivision 3, shall be deemed to have been met by an owner or seller who has testing and inspection performed annually in compliance with this subdivision. The testing and inspection must meet the following requirements:\n(1) all equipment subject to inspection and testing requirements must be inspected and tested annually;\n(2) inspection testing must only be done by persons who have demonstrated to the director that they are competent to inspect and test liquefied petroleum gas-measuring equipment. Competency may be established by passage of a competency examination, which the director must establish, or by other recognized credentialing processes approved by the director. Persons taking tests established by the director may be charged for the costs of the testing procedure;\n(3) testing and inspection procedures must comply with inspection protocol, which must be established by the director. The director may use existing protocol or recognize any other scientifically established and recognized protocol;\n(4) persons who inspect or test liquefied petroleum gas-measuring equipment must use testing equipment that meets any specifications issued by the director;\n(5) equipment used for testing and inspection must be submitted to the director for calibration by the division whenever ordered by the director; and\n(6) all inspectors, equipment, and inspection protocol must comply with all relevant requirements of Minnesota Statutes, department rules, and written procedures issued by the director.\n(b) Owners or sellers of liquefied petroleum gas may perform their own tests and inspections or have employees do so as long as they meet the requirements of this subdivision. Persons performing inspection and testing may also perform repairs and maintenance on inspected equipment if authorized by the owner. However, they shall not be allowed to take equipment out of service.\n(c) Inspectors shall tag meters that fail the testing process as \"out of tolerance.\" For equipment that has passed inspection, the inspector shall provide to the owner or seller a seal indicating that the equipment has been inspected and the date of the inspection. Whenever an inspector issues a seal to an owner or seller, the inspector shall submit to the director written verification that the equipment was tested by procedures and testing equipment meeting the requirements of this subdivision. The director shall issue seals (stickers) to inspectors for the purposes of this subdivision. The issuance of a seal to an owner or seller establishes only that the equipment was inspected by a certified inspector using qualified equipment and procedures, and that the equipment was found to be within allowable tolerance on the date tested.",
	"repealed": false
}