{
	"id": "256P.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.08",
	"title": "256P.08 CORRECTION OF OVERPAYMENTS AND UNDERPAYMENTS.",
	"text": "Participants who qualify for child care assistance programs under chapter 142E or housing support under chapter 256I are exempt from this section.\n(a) When a participant or former participant receives an overpayment due to client or ATM error, or due to assistance received while an appeal is pending and the participant or former participant is determined ineligible for assistance or for less assistance than was received, except as provided for interim assistance in section 256D.06, subdivision 5, the county agency must recoup or recover the overpayment using the following methods:\n(1) reconstruct each affected budget month and corresponding payment month;\n(2) use the policies and procedures that were in effect for the payment month; and\n(3) do not allow employment disregards in the calculation of the overpayment when the unit has not reported within two calendar months following the end of the month in which the income was received.\n(b) Establishment of an overpayment is limited to six years prior to the month of discovery due to client error or an intentional program violation determined under section 256.046.\n(c) A participant or former participant is not responsible for overpayments due to agency error, unless the amount of the overpayment is large enough that a reasonable person would know it is an error.\nWhen a county agency discovers that a participant or former participant has received an overpayment for one or more months, the county agency must notify the participant or former participant of the overpayment in writing. A notice of overpayment must specify the reason for the overpayment, the authority for citing the overpayment, the time period in which the overpayment occurred, the amount of the overpayment, and the participant's or former participant's right to appeal. No limit applies to the period in which the county agency is required to recoup or recover an overpayment according to subdivisions 4, 5, and 6.\n(a) If an amount of assistance is paid to an assistance unit in excess of the payment due, it shall be recoverable by the agency. The agency shall give written notice to the participant of its intention to recover the overpayment.\n(b) If the individual is no longer receiving assistance, the agency may request voluntary repayment or pursue civil recovery.\n(c) If the individual is receiving assistance, except as provided for interim assistance in section 256D.06, subdivision 5, when an overpayment occurs the agency shall recover the overpayment by withholding an amount equal to:\n(1) three percent of the assistance unit's standard of need for all Minnesota supplemental aid assistance units, and nonfraud cases for general assistance; and\n(2) ten percent where fraud has occurred in general assistance cases; or\n(3) the amount of the monthly general assistance or Minnesota supplemental aid payment, whichever is less.\n(d) In cases when there is both an overpayment and underpayment, the county agency shall offset one against the other in correcting the payment.\n(e) Overpayments may also be voluntarily repaid, in part or in full, by the individual, in addition to the assistance reductions provided in this subdivision, to include further voluntary reductions in the grant level agreed to in writing by the individual, until the total amount of the overpayment is repaid.\n(f) The county agency shall make reasonable efforts to recover overpayments to individuals no longer on assistance. The agency need not attempt to recover overpayments of less than $35 paid to an individual no longer on assistance if the individual does not receive assistance again within three years, unless the individual has been convicted of violating section 256.98.\n(g) Establishment of an overpayment is limited to 12 months prior to the month of discovery due to agency error and six years prior to the month of discovery due to client error or an intentional program violation determined under section 256.046.\n(h) Residents of licensed residential facilities shall not have overpayments recovered from their personal needs allowance.\n(i) Overpayments by another maintenance benefit program shall not be recovered from the general assistance or Minnesota supplemental aid grant.\nA county agency must initiate efforts to recover overpayments paid to a former participant or caregiver. Caregivers, both parental and nonparental, and minor caregivers of an assistance unit at the time an overpayment occurs, whether receiving assistance or not, are jointly and individually liable for repayment of the overpayment. The county agency must request repayment from the former participants and caregivers. When an agreement for repayment is not completed within six months of the date of discovery or when there is a default on an agreement for repayment after six months, the county agency must initiate recovery consistent with chapter 270A or section 541.05. When a person has been disqualified or convicted of fraud under section 256.98, recovery must be sought regardless of the amount of overpayment. When an overpayment is less than $35, and is not the result of a fraud conviction under section 256.98, the county agency must not seek recovery under this subdivision. The county agency must retain information about all overpayments regardless of the amount. When an adult, adult caregiver, or minor caregiver reapplies for assistance, the overpayment must be recouped under subdivision 6.\nA participant may voluntarily repay, in part or in full, an overpayment even if assistance is reduced under this subdivision, until the total amount of the overpayment is repaid. When an overpayment occurs due to fraud, the county agency must recover from the overpaid assistance unit, including child-only cases, ten percent of the applicable standard or the amount of the monthly assistance payment, whichever is less. When a nonfraud overpayment occurs, the county agency must recover from the overpaid assistance unit, including child-only cases, three percent of the MFIP standard of need or the amount of the monthly assistance payment, whichever is less.\nFor recipients receiving benefits by electronic benefit transfer, if the overpayment is a result of an ATM dispensing funds in error to the recipient, the agency may recover the ATM error by immediately withdrawing funds from the recipient's electronic benefit transfer account, up to the amount of the error.\nA county agency must issue a corrective payment for underpayments made to a participant or to a person who would be a participant if an agency or client error causing the underpayment had not occurred. Corrective payments are limited to 12 months prior to the month of discovery. The county agency must issue the corrective payment according to subdivision 10.\nAn underpayment may be identified by a county agency, participant, former participant, or person who would be a participant except for agency or client error.\nA county agency must correct an underpayment within seven calendar days after the underpayment has been identified, by adding the corrective payment amount to the monthly assistance payment of the participant, issuing a separate payment to a participant or former participant, or reducing an existing overpayment balance. When an underpayment occurs in a payment month and is not identified until the next payment month or later, the county agency must first subtract the underpayment from any overpayment balance before issuing the corrective payment. The county agency must not apply an underpayment in a current payment month against an overpayment balance. When an underpayment in the current payment month is identified, the corrective payment must be issued within seven calendar days after the underpayment is identified. Corrective payments must be excluded when determining the applicant's or participant's income and resources for the month of payment. The county agency must correct underpayments using the following methods:\n(1) reconstruct each affected budget month and corresponding payment month; and\n(2) use the policies and procedures that were in effect for the payment month.\nA participant may appeal an underpayment, an overpayment, and a reduction in an assistance payment made to recoup the overpayment under subdivisions 4 and 6. The participant's appeal of each issue must be timely under section 256.045. When an appeal based on the notice issued under subdivision 3 is not timely, the fact or the amount of that overpayment must not be considered as a part of a later appeal, including an appeal of a reduction in an assistance payment to recoup that overpayment.",
	"repealed": false
}