{
	"id": "290B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/290B.04",
	"title": "290B.04 APPLICATION FOR DEFERRAL.",
	"text": "(a) A taxpayer meeting the program qualifications under section 290B.03 may apply to the commissioner of revenue for the deferral of taxes. Applications are due on or before November 1 for deferral of any of the following year's property taxes. A taxpayer may apply in the year in which the taxpayer becomes 65 years old, provided that no deferral of property taxes will be made until the calendar year after the taxpayer becomes 65 years old. The application, which shall be prescribed by the commissioner of revenue, shall include the following items and any other information which the commissioner deems necessary:\n(1) the name, address, and Social Security number of the owner or owners;\n(2) a copy of the property tax statement for the current payable year for the homesteaded property;\n(3) the initial year of ownership and occupancy as a homestead;\n(4) the owner's household income for the previous calendar year; and\n(5) information on any mortgage loans or other amounts secured by mortgages or other liens against the property, for which purpose the commissioner may require the applicant to provide a copy of the mortgage note, the mortgage, or a statement of the balance owing on the mortgage loan provided by the mortgage holder. The commissioner may require the appropriate documents in connection with obtaining and confirming information on unpaid amounts secured by other liens.\nThe application must state that program participation is voluntary. The application must also state that the deferred amount depends directly on the applicant's household income, and that program participation includes authorization for the annual deferred amount, the cumulative deferral and interest that appear on each year's notice prepared by the county under subdivision 6, is public data.\nThe application must state that program participants may claim the property tax refund based on the full amount of property taxes eligible for the refund, including any deferred amounts. The application must also state that property tax refunds will be used to offset any deferral and interest under this program, and that any other amounts subject to revenue recapture under section 270A.03, subdivision 7, will also be used to offset any deferral and interest under this program.\n(b) As part of the initial application process, the commissioner may require the applicant to obtain at the applicant's own cost and submit:\n(1) if the property is registered property under chapter 508 or 508A, a copy of the original certificate of title in the possession of the county registrar of titles (sometimes referred to as \"condition of register\"); or\n(2) if the property is abstract property, a report prepared by a licensed abstracter showing the last deed and any unsatisfied mortgages, liens, judgments, and state and federal tax lien notices which were recorded on or after the date of that last deed with respect to the property or to the applicant.\nThe certificate or report under clauses (1) and (2) need not include references to any documents filed or recorded more than 40 years prior to the date of the certification or report. The certification or report must be as of a date not more than 30 days prior to submission of the application.\nThe commissioner may also require the county recorder or county registrar of the county where the property is located to provide copies of recorded documents related to the applicant or the property, for which the recorder or registrar shall not charge a fee. The commissioner may use any information available to determine or verify eligibility under this section. The household income from the application is private data on individuals as defined in section 13.02, subdivision 12.\nThe commissioner shall approve all initial applications that qualify under this chapter and shall notify qualifying homeowners on or before December 1. The commissioner may investigate the facts or require confirmation in regard to an application. The commissioner shall record or file a notice of qualification for deferral, including the names of the qualifying homeowners and a legal description of the property, in the office of the county recorder, or registrar of titles, whichever is applicable, in the county where the qualifying property is located. The notice must state that it serves as a notice of lien and that it includes deferrals under this section for future years. The commissioner shall prescribe the form of the notice. Execution of the notice by the original or facsimile signature of the commissioner or a delegate entitles the notice to be recorded, and no other attestation, certification, or acknowledgment is necessary. The homeowner shall pay the recording or filing fees for the notice, which, notwithstanding section 357.18, shall be paid by the homeowner at the time of satisfaction of the lien.\nA taxpayer whose initial application has been approved under subdivision 2 shall notify the commissioner of revenue in writing by July 1 if the taxpayer's household income for the preceding calendar year exceeded $96,000. The certification must state the homeowner's total household income for the previous calendar year. No property taxes may be deferred under this chapter in any year following the year in which a program participant filed or should have filed an excess-income certification under this subdivision, unless the participant has filed a resumption of eligibility certification as described in subdivision 4.\nA taxpayer who has previously filed an excess-income certification under subdivision 3 may resume program participation if the taxpayer's household income for a subsequent year is $96,000 or less. If the taxpayer chooses to resume program participation, the taxpayer must notify the commissioner of revenue in writing by July 1 of the year following a calendar year in which the taxpayer's household income is $96,000 or less. The certification must state the taxpayer's total household income for the previous calendar year. Once a taxpayer resumes participation in the program under this subdivision, participation will continue until the taxpayer files a subsequent excess-income certification under subdivision 3 or until participation is terminated under section 290B.08, subdivision 1.\n(a) The commissioner shall assess a penalty equal to 20 percent of the property taxes improperly deferred in the case of a false application, a false certification, or in the case of a required excess-income certification which was not filed as of the applicable due date. The commissioner shall assess a penalty equal to 50 percent of the property taxes improperly deferred if the taxpayer knowingly filed a false application or certification, or knowingly failed to file a required excess-income certification by the applicable due date. The commissioner shall assess penalties under this section through the issuance of an order under the provisions of chapter 270C. Persons affected by a commissioner's order issued under this section may appeal as provided in chapter 270C.\n(b) The commissioner may conduct investigations related to initial applications and excess-income certifications required under this chapter within the period ending 3-1/2 years from the due date of the application or certification.\nAnnually, on or before July 1, the county auditor shall notify, in writing, each participant in the county who is in the senior citizen's deferral program of the current year's deferred taxes and the total cumulative deferred taxes and accrued interest on the participant's property as of that date.\nUpon approval of a senior citizen's initial application, the commissioner of revenue shall pay to the treasurer of the county where the property is located the amount of any delinquent property taxes, penalties, interest, and delinquent special assessments and interest on the property which is the subject of the application.",
	"repealed": false
}