{
	"id": "157.177",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.177",
	"title": "157.177 SEX TRAFFICKING PREVENTION TRAINING.",
	"text": "\"Sex trafficking\" has the meaning given in section 609.321, subdivision 7a.\n(a) Following initial approval of a training program pursuant to paragraph (c), every person, firm, or corporation that operates a hotel or motel in Minnesota shall ensure that each employee who works on site, including but not limited to any owner, operator, or manager, receives the training described in paragraph (c) within the later of 90 days of the time of hire or 120 days of August 1, 2018, and annually thereafter. The operator of each hotel or motel shall annually certify, in an employee roster or in each employee's personnel file, that each employee has received the training approved by the commissioner.\n(b) In addition to the training required under paragraph (a), the operator of each hotel and motel shall conduct an ongoing awareness campaign for employees that addresses the components described in paragraph (c).\n(c) No later than November 1, 2018, the commissioner shall, in consultation with the state hotel and lodging association, approve an educational training program that focuses on the accurate and prompt identification and reporting of, or response to, suspected sex trafficking. The commissioner shall allow the use of existing training modules and materials, to the extent possible. Training must include, at a minimum, instruction on:\n(1) what sex trafficking is in order to raise awareness of it;\n(2) how to recognize potential victims of sex trafficking;\n(3) how to identify activities commonly associated with sex trafficking; and\n(4) effective responses to trafficking situations including, but not limited to, how to report suspected sex trafficking to proper law enforcement officials.\n(d) Each operator must post and maintain a poster, written or approved by the commissioner and containing information described in paragraph (c), in a place readily accessible to each employee who works on site.\n(e) Any cost incurred for the training program shall be the responsibility of the licensee.\nThe training requirements in subdivision 2 do not apply to employees who:\n(1) are under the age of 16 years unless they clean guest rooms;\n(2) work exclusively in a restaurant, providing catering services, or both; or\n(3) do not have direct contact with either guests or guest rooms.\nAn operator or employee of a hotel or motel who acts in good faith is immune from liability in any civil action for reporting suspected sex trafficking activities.\nA hotel or motel operator who fails to provide the prevention training required by subdivision 2 shall be given six months to comply with an order issued pursuant to section 157.20, subdivision 3, for a first violation.",
	"repealed": false
}