{
	"id": "13.384",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.384",
	"title": "13.384 MEDICAL DATA.",
	"text": "As used in this section:\n(a) \"Directory information\" means name of the patient, date admitted, and general condition.\n(b) \"Medical data\" are data collected because an individual was or is a patient or client of a hospital, nursing home, medical center, clinic, health or nursing agency operated by a government entity including business and financial records, data provided by private health care facilities, and data provided by or about relatives of the individual.\n(a) During the time that a person is a patient in a hospital operated by a government entity under legal commitment, directory information is public data. After the person is released by termination of the person's legal commitment, the directory information is private data on individuals.\n(b) If a person is a patient other than pursuant to commitment in a hospital controlled by a government entity, directory information is public data unless the patient requests otherwise, in which case it is private data on individuals.\n(c) Directory information about an emergency patient who is unable to communicate which is public under this subdivision shall not be released until a reasonable effort is made to notify the next of kin or health care agent. Although an individual has requested that directory information be private, the hospital may release directory information to a law enforcement agency pursuant to a lawful investigation pertaining to that individual.\nUnless the data is summary data or a statute specifically provides a different classification, medical data are private but are available only to the subject of the data as provided in sections 144.291 to 144.298, and shall not be disclosed to others except:\n(a) pursuant to section 13.05;\n(b) pursuant to section 253B.0921;\n(c) pursuant to a valid court order;\n(d) to administer federal funds or programs;\n(e) to the surviving spouse, parents, children, siblings, and health care agent of a deceased patient or client or, if there are no surviving spouse, parents, children, siblings, or health care agent to the surviving heirs of the nearest degree of kindred;\n(f) to communicate a patient's or client's condition to a family member, health care agent, or other appropriate person in accordance with acceptable medical practice, unless the patient or client directs otherwise; or\n(g) as otherwise required by law.",
	"repealed": false
}