{
	"id": "116.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.79",
	"title": "116.79 MANAGEMENT PLANS.",
	"text": "(a) To the extent applicable to the facility, a person in charge of a facility that generates, stores, decontaminates, incinerates, or disposes of infectious or pathological waste must prepare a management plan for the infectious or pathological waste handled by the facility. A person may prepare a common management plan for all generating facilities owned and operated by the person. If a single plan is prepared to cover multiple facilities, the plan must identify common policy and procedures for the facilities and any management procedures that are facility specific. The plan must identify each generating facility covered by the plan. A management plan must list all physicians, dentists, chiropractors, podiatrists, veterinarians, certified nurse practitioners, certified nurse midwives, or physician assistants, employed by, under contract to, or working at the generating facilities, except hospitals or laboratories. A management plan from a hospital must list the number of licensed beds and from a laboratory must list the number of generating employees.\n(b) The management plan must describe, to the extent the information is applicable to the facility:\n(1) the type of infectious waste and pathological waste that the person generates or handles;\n(2) the segregation, packaging, labeling, collection, storage, and transportation procedures for the infectious waste or pathological waste that will be followed;\n(3) the decontamination or disposal methods for the infectious or pathological waste that will be used;\n(4) the transporters and disposal facilities that will be used for the infectious waste;\n(5) the steps that will be taken to minimize the exposure of employees to infectious agents throughout the process of disposing of infectious or pathological wastes; and\n(6) the name of the individual responsible for the management of the infectious waste or pathological waste.\n(c) If the generator mails sharps for storage, decontamination, or disposal, the plan must specify how the generator will comply with applicable federal laws and rules. The plan must also specify the name, address, and telephone number of the facility to which the sharps are mailed, the name of the person who receives the sharps at the facility, and the annual amount mailed to the facility. If the facility to which the sharps are mailed is not the disposal facility, the plan must also identify the disposal facility.\n(d) The management plan must be kept at the facility.\n(e) To the extent applicable to the facility, management plans must be accompanied by a statement of the quantity of infectious and pathological waste generated, decontaminated, stored, incinerated, or disposed of at the facility during the previous two-year period. Quantities shall be reported in pounds.\n(f) A management plan must be updated at least once every two years.\nA person who prepares a management plan must comply with the management plan.\n[Repealed, 1Sp1993 c 1 art 9 s 75]\n(a) A person who stores, incinerates, or decontaminates infectious or pathological waste, other than at the facility where the waste was generated, or a person who incinerates infectious or pathological waste on site, must submit a copy of the management plan to the commissioner of the Pollution Control Agency with a fee of $225. The fee must be deposited in the state treasury and credited to the general fund.\n(b) The commissioner shall review the plans and may require a plan to be modified within 180 days after the plan is submitted if the commissioner determines that the plan is not consistent with state or federal law or that the plan is not adequate to minimize exposure of persons to the waste.",
	"repealed": false
}