{
	"id": "295.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.55",
	"title": "295.55 PAYMENT OF TAX.",
	"text": "The provisions of this section apply to the taxes imposed under sections 295.50 to 295.58.\n(a) Each hospital or surgical center must make estimated payments of the taxes for the calendar year in monthly installments to the commissioner within 15 days after the end of the month.\n(b) Estimated tax payments are not required of hospitals or surgical centers if: (1) the tax for the current calendar year is $500 or less; or (2) the tax for the previous calendar year is $500 or less.\n(c) Underpayment of estimated installments bear interest at the rate specified in section 270C.40, from the due date of the payment until paid or until the due date of the annual return whichever comes first. An underpayment of an estimated installment is the difference between the amount paid and the lesser of (1) 90 percent of one-twelfth of the tax for the calendar year or (2) one-twelfth of the total tax for the previous calendar year.\n(a) Each taxpayer, other than a hospital or surgical center, must make estimated payments of the taxes for the calendar year in quarterly installments to the commissioner by April 15, July 15, October 15, and January 15 of the following calendar year.\n(b) Estimated tax payments are not required if: (1) the tax for the current calendar year is $500 or less; or (2) the tax for the previous calendar year is $500 or less.\n(c) Underpayment of estimated installments bear interest at the rate specified in section 270C.40, from the due date of the payment until paid or until the due date of the annual return whichever comes first. An underpayment of an estimated installment is the difference between the amount paid and the lesser of (1) 90 percent of one-quarter of the tax for the calendar year or (2) one-quarter of the total tax for the previous calendar year.\nA taxpayer with an aggregate tax liability of $10,000 or more in a fiscal year ending June 30 must remit all liabilities by electronic means in all subsequent calendar years.\nThe taxpayer must file an annual return reconciling the estimated payments by March 15 of the following calendar year.\nThe commissioner shall prescribe the content, format, and manner of the estimated payment forms and annual return pursuant to section 270C.30.\nIf good cause exists, the commissioner may extend the time for filing MinnesotaCare tax returns for not more than 60 days.",
	"repealed": false
}