{
	"id": "216C.379",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.379",
	"title": "216C.379 ENERGY STORAGE INCENTIVE PROGRAM.",
	"text": "(a) The public utility subject to section 116C.779 must develop and operate a program to provide a grant to customers to reduce the cost to purchase and install an on-site energy storage system, as defined in section 216B.2422, subdivision 1, paragraph (f). The public utility subject to this section must file a plan with the commissioner to operate the program no later than November 1, 2023. The public utility must not operate the program until the program is approved by the commissioner. Any change to an operating program must be approved by the commissioner.\n(b) In order to be eligible to receive a grant under this section, an energy storage system must:\n(1) have a capacity no greater than 50 kilowatt hours; and\n(2) be located within the electric service area of the public utility subject to this section.\n(c) An owner of an energy storage system is eligible to receive a grant under this section if:\n(1) a solar energy generating system is operating at the same site as the proposed energy storage system; or\n(2) the owner has filed an application with the public utility subject to this section to interconnect a solar energy generating system at the same site as the proposed energy storage system.\n(d) The amount of a grant awarded under this section must be based on the number of watt-hours that reflects the duration of the energy storage system at the system's rated capacity, up to a maximum of $5,000.\n(e) The commissioner must annually review and may adjust the amount of grants awarded under this section, but must not increase the amount over that awarded in previous years unless the commissioner demonstrates in writing that an upward adjustment is warranted by market conditions.\n(f) A customer who receives a grant under this section is eligible to receive financial assistance under programs operated by the state or the public utility for the solar energy generating system operating in conjunction with the energy storage system.\n(g) For the purposes of this section, \"solar energy generating system\" has the meaning given in section 216E.01, subdivision 9a.",
	"repealed": false
}