{
	"id": "353E.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/353E.001",
	"title": "353E.001 DEFINITIONS.",
	"text": "\"Duty disability,\" physical or psychological, means a condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of a local government correctional service employee as defined under section 353E.02 and that is the direct result of an injury incurred during, or a disease arising out of, the performance of inherently dangerous duties that are specific to the positions covered by the local government correctional service retirement plan.\n\"Fund\" means the public employees local government correctional service retirement fund.\n\"Less frequent duties\" means tasks designated in the applicant's job description as either required from time to time or as assigned, but which are not carried out as part of the normal routine of the applicant's job.\n\"Member\" means an individual identified as a member under section 353E.02, for whom retirement coverage is provided by the plan.\n\"Normal duties\" means specific tasks designated in the applicant's job description and which the applicant performs on a day-to-day basis, but do not include less frequent duties which may be requested to be done by the employer from time to time.\n\"Plan\" means the public employees local government correctional service retirement plan.\n\"Regular disability,\" physical or psychological, means a condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of a local government correctional service employee as defined under section 353E.02 and that results from a disease or an injury that arises from any activities while not at work or while at work from performing those normal or less frequent duties that do not present inherent dangers that are specific to the occupations covered by the local government correctional service retirement plan.",
	"repealed": false
}