{
	"id": "245G.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.22",
	"title": "245G.22 OPIOID TREATMENT PROGRAMS.",
	"text": "(a) An opioid treatment program licensed under this chapter must also: (1) comply with the requirements of this section and Code of Federal Regulations, title 42, part 8; (2) be registered as a narcotic treatment program with the Drug Enforcement Administration; (3) be accredited through an accreditation body approved by the Division of Pharmacologic Therapy of the Center for Substance Abuse Treatment; (4) be certified through the Division of Pharmacologic Therapy of the Center for Substance Abuse Treatment; and (5) hold a license from the Minnesota Board of Pharmacy or equivalent agency.\n(b) Where a standard in this section differs from a standard in an otherwise applicable administrative rule or statute, the standard of this section applies.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Diversion\" means the use of a medication for the treatment of opioid addiction being diverted from intended use of the medication.\n(c) \"Guest dose\" means administration of a medication used for the treatment of opioid addiction to a person who is not a client of the program that is administering or dispensing the medication.\n(d) \"Medical director\" means a practitioner licensed to practice medicine in the jurisdiction that the opioid treatment program is located who assumes responsibility for administering all medical services performed by the program, either by performing the services directly or by delegating specific responsibility to a practitioner of the opioid treatment program.\n(e) \"Medication used for the treatment of opioid use disorder\" means a medication approved by the Food and Drug Administration for the treatment of opioid use disorder.\n(f) \"Minnesota health care programs\" has the meaning given in section 256B.0636.\n(g) \"Opioid treatment program\" has the meaning given in Code of Federal Regulations, title 42, section 8.12, and includes programs licensed under this chapter.\n(h) \"Practitioner\" means a staff member holding a current, unrestricted license to practice medicine issued by the Board of Medical Practice or nursing issued by the Board of Nursing and is currently registered with the Drug Enforcement Administration to order or dispense controlled substances in Schedules II to V under the Controlled Substances Act, United States Code, title 21, part B, section 821.\n(i) \"Unsupervised use\" or \"take-home dose\" means the use of a medication for the treatment of opioid use disorder dispensed for use by a client outside of the program setting.\nBefore the program may administer or dispense a medication used for the treatment of opioid use disorder:\n(1) a client-specific order must be received from an appropriately credentialed practitioner who is enrolled as a Minnesota health care programs provider and meets all applicable provider standards;\n(2) the signed order must be documented in the client's record; and\n(3) if the practitioner that issued the order is not able to sign the order when issued, the unsigned order must be entered in the client record at the time it was received, and the practitioner must review the documentation and sign the order in the client's record within 72 hours of the medication being ordered. The license holder must report to the commissioner any medication error that endangers a client's health, as determined by the medical director.\n[Repealed, 2024 c 108 art 4 s 28]\nEach client enrolled in the program must receive a minimum of eight random drug abuse tests per 12 months of treatment. Drug abuse tests must be reasonably disbursed over the 12-month period. A license holder may elect to conduct more drug abuse tests.\n(a) To limit the potential for diversion of medication used for the treatment of opioid use disorder to the illicit market, medication dispensed to a client for unsupervised use shall be subject to the requirements of this subdivision. Any client in an opioid treatment program may receive their individualized take-home doses as ordered for days that the clinic is closed for business, on one weekend day (e.g., Sunday) and state and federal holidays, no matter their length of time in treatment, as allowed under Code of Federal Regulations, title 42, part 8.12 (i)(1).\n(b) For take-home doses beyond those allowed by paragraph (a), a practitioner must review and document the criteria in the Code of Federal Regulations, title 42, part 8.12 (i)(2), when determining whether dispensing medication for a client's unsupervised use is safe and it is appropriate to implement, increase, or extend the amount of time between visits to the program.\n(c) The determination, including the basis of the determination must be documented by a practitioner in the client's medical record.\nIf a practitioner assesses, determines, and documents that a client meets the criteria in subdivision 6 and that a patient is safely able to manage unsupervised doses of methadone, the number of take-home doses the client receives must be limited by the number allowed by Code of Federal Regulations, title 42, section 8.12 (i)(3).\nWhen a license holder has reason to accelerate the number of unsupervised use doses of methadone hydrochloride, the license holder must comply with the requirements of Code of Federal Regulations, title 42, section 8.12, the criteria for unsupervised use and must use the exception process provided by the federal Center for Substance Abuse Treatment Division of Pharmacologic Therapies. For the purposes of enforcement of this subdivision, the commissioner has the authority to monitor a program for compliance with federal regulations and may issue licensing actions according to sections 245A.05, 245A.06, and 245A.07 based on the commissioner's determination of noncompliance.\nTo receive a guest dose, the client must be enrolled in an opioid treatment program elsewhere in the state or country and be receiving the medication on a temporary basis because the client is not able to receive the medication at the program in which the client is enrolled. Such arrangements shall not exceed 30 consecutive days in any one program and must not be for the convenience or benefit of either program. A guest dose may also occur when the client's primary clinic is not open and the client is not receiving unsupervised use doses.\nAn opioid treatment program must notify the department within seven days of the program reaching both 90 and 100 percent of the program's capacity to care for clients. Each week, the program must report its capacity, currently enrolled dosing clients, and any waiting list. A program reporting 90 percent of capacity must also notify the department when the program's census increases or decreases from the 90 percent level.\nAn opioid treatment program must have a waiting list system. If the person seeking admission cannot be admitted within 14 days of the date of application, each person seeking admission must be placed on the waiting list, unless the person seeking admission is assessed by the program and found ineligible for admission according to this chapter and Code of Federal Regulations, title 42, part 1, subchapter A, section 8.12 (e), and title 45, parts 160 to 164. The waiting list must assign a unique client identifier for each person seeking treatment while awaiting admission. A person seeking admission on a waiting list who receives no services under section 245G.07, subdivision 1, must not be considered a client as defined in section 245G.01, subdivision 9.\nAn opioid treatment program must consult the capacity management system to ensure that a person on a waiting list is admitted at the earliest time to a program providing appropriate treatment within a reasonable geographic area. If the client was referred through a public payment system and if the program is not able to serve the client within 14 days of the date of application for admission, the program must contact and inform the referring agency of any available treatment capacity listed in the state capacity management system.\nAn opioid treatment program must carry out activities to encourage an individual in need of treatment to undergo treatment. The program's outreach model must:\n(1) select, train, and supervise outreach workers;\n(2) contact, communicate, and follow up with individuals with high-risk substance misuse, individuals with high-risk substance misuse associates, and neighborhood residents within the constraints of federal and state confidentiality requirements;\n(3) promote awareness among individuals who engage in substance misuse by injection about the relationship between injecting substances and communicable diseases such as HIV; and\n(4) recommend steps to prevent HIV transmission.\n(a) A license holder must comply with requirements to submit information and necessary consents to the state central registry for each client admitted, as specified by the commissioner. The license holder must submit data concerning medication used for the treatment of opioid use disorder. The data must be submitted in a method determined by the commissioner and the original information must be kept in the client's record. The information must be submitted for each client at admission and discharge. The program must document the date the information was submitted. The client's failure to provide the information shall prohibit participation in an opioid treatment program. The information submitted must include the client's:\n(1) full name and all aliases;\n(2) date of admission;\n(3) date of birth;\n(4) Social Security number or Alien Registration Number, if any;\n(5) current or previous enrollment status in another opioid treatment program;\n(6) government-issued photo identification card number; and\n(7) driver's license number, if any.\n(b) The requirements in paragraph (a) are effective upon the commissioner's implementation of changes to the drug and alcohol abuse normative evaluation system or development of an electronic system by which to submit the data.\n(a) The program must offer at least 50 consecutive minutes of individual or group therapy treatment services as defined in section 245G.07, subdivision 1, paragraph (a), clause (1), per week, for the first ten weeks following the day of service initiation, and at least 50 consecutive minutes per month thereafter. As clinically appropriate, the program may offer these services cumulatively and not consecutively in increments of no less than 15 minutes over the required time period, and for a total of 60 minutes of treatment services over the time period, and must document the reason for providing services cumulatively in the client's record. The program may offer additional levels of service when deemed clinically necessary.\n(b) Notwithstanding the requirements of comprehensive assessments in section 245G.05, the assessment must be completed within 21 days from the day of service initiation.\n(a) The program must develop and maintain a policy and procedure that requires the ongoing monitoring of the data from the prescription monitoring program (PMP) for each client. The policy and procedure must include how the program meets the requirements in paragraph (b).\n(b) When a medication used for the treatment of substance use disorder is administered or dispensed to a client, the license holder is subject to the following requirements:\n(1) upon admission to an opioid treatment program, a client must be notified in writing that the commissioner of human services and the medical director must monitor the PMP to review the prescribed controlled drugs a client received;\n(2) the medical director or the medical director's delegate must review the data from the PMP described in section 152.126 before the client is ordered any controlled substance, as defined under section 152.126, subdivision 1, paragraph (c), including medications used for the treatment of opioid addiction, and the medical director's or the medical director's delegate's subsequent reviews of the PMP data must occur at least every 90 days;\n(3) a copy of the PMP data reviewed must be maintained in the client's file along with the licensed practitioner's decision for frequency of ongoing PMP checks;\n(4) when the PMP data contains a recent history of multiple prescribers or multiple prescriptions for controlled substances, the physician's review of the data and subsequent actions must be documented in the client's file within 72 hours and must contain the licensed practitioner's determination of whether or not the prescriptions place the client at risk of harm and the actions to be taken in response to the PMP findings. The provider must conduct subsequent reviews of the PMP on a monthly basis; and\n(5) if at any time the licensed practitioner believes the use of the controlled substances places the client at risk of harm, the program must seek the client's consent to discuss the client's opioid treatment with other prescribers and must seek the client's consent for the other prescriber to disclose to the opioid treatment program's licensed practitioner the client's condition that formed the basis of the other prescriptions. If the information is not obtained within seven days, the medical director must document whether or not changes to the client's medication dose or number of unsupervised use doses are necessary until the information is obtained.\n(c) The commissioner shall collaborate with the Minnesota Board of Pharmacy to develop and implement an electronic system for the commissioner to routinely access the PMP data to determine whether any client enrolled in an opioid addiction treatment program licensed according to this section was prescribed or dispensed a controlled substance in addition to that administered or dispensed by the opioid addiction treatment program. When the commissioner determines there have been multiple prescribers or multiple prescriptions of controlled substances for a client, the commissioner shall:\n(1) inform the medical director of the opioid treatment program only that the commissioner determined the existence of multiple prescribers or multiple prescriptions of controlled substances; and\n(2) direct the medical director of the opioid treatment program to access the data directly, review the effect of the multiple prescribers or multiple prescriptions, and document the review.\n(d) If determined necessary, the commissioner shall seek a federal waiver of, or exception to, any applicable provision of Code of Federal Regulations, title 42, section 2.34 (c), before implementing this subdivision.\n(a) A license holder must develop and maintain the policies and procedures required in this subdivision.\n(b) For a program that is not open every day of the year, the license holder must maintain a policy and procedure that covers requirements under subdivisions 6 and 7. Unsupervised use of medication used for the treatment of opioid use disorder for days that the program is closed for business, on one weekend day and state and federal holidays, must meet the requirements under subdivisions 6 and 7.\n(c) The license holder must maintain a policy and procedure that includes specific measures to reduce the possibility of diversion. The policy and procedure must:\n(1) specifically identify and define the responsibilities of the medical and administrative staff for performing diversion control measures; and\n(2) include a process for contacting no less than five percent of clients who have unsupervised use of medication, excluding clients approved solely under subdivision 6, paragraph (a), to require clients to physically return to the program each month. The system must require clients to return to the program within a stipulated time frame and turn in all unused medication containers related to opioid use disorder treatment. The license holder must document all related contacts on a central log and the outcome of the contact for each client in the client's record. The medical director must be informed of each outcome that results in a situation in which a possible diversion issue was identified.\n(d) Medication used for the treatment of opioid use disorder must be ordered, administered, and dispensed according to applicable state and federal regulations and the standards set by applicable accreditation entities. If a medication order requires assessment by the person administering or dispensing the medication to determine the amount to be administered or dispensed, the assessment must be completed by an individual whose professional scope of practice permits an assessment. For the purposes of enforcement of this paragraph, the commissioner has the authority to monitor the person administering or dispensing the medication for compliance with state and federal regulations and the relevant standards of the license holder's accreditation agency and may issue licensing actions according to sections 245A.05, 245A.06, and 245A.07, based on the commissioner's determination of noncompliance.\n(e) The license holder must maintain a ratio of one full-time equivalent alcohol and drug counselor for every 60 clients enrolled in the program. The license holder must determine the appropriate number of clients for which each counselor is responsible based on the needs of each client. The license holder must maintain documentation of the clients assigned to each counselor to demonstrate compliance with this paragraph. For the purpose of this paragraph, \"full-time equivalent\" means working at least 32 hours each week.\nThe license holder must develop and maintain a quality improvement plan that:\n(1) includes evaluation of the services provided to clients to identify issues that may improve service delivery and client outcomes;\n(2) includes goals for the program to accomplish based on the evaluation;\n(3) is reviewed annually by the management of the program to determine whether the goals were met and, if not, whether additional action is required;\n(4) is updated at least annually to include new or continued goals based on an updated evaluation of services; and\n(5) identifies two specific goal areas, in addition to others identified by the program, including:\n(i) a goal concerning oversight and monitoring of the premises around and near the exterior of the program to reduce the possibility of medication used for the treatment of opioid use disorder being inappropriately used by a client, including but not limited to the sale or transfer of the medication to others; and\n(ii) a goal concerning community outreach, including but not limited to communications with local law enforcement and county human services agencies, to increase coordination of services and identification of areas of concern to be addressed in the plan.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63]\n(a) To the fullest extent permitted under Code of Federal Regulations, title 42, sections 2.1 to 2.67, a program shall report to law enforcement any credible evidence that the program or its personnel knows, or reasonably should know, that is directly related to a diversion crime on the premises of the program, or a threat to commit a diversion crime.\n(b) \"Diversion crime,\" for the purposes of this section, means diverting, attempting to divert, or conspiring to divert Schedule I, II, III, or IV drugs, as defined in section 152.02, on the program's premises.\n(c) The program must document the program's compliance with the requirement in paragraph (a) in either a client's record or an incident report. A program's failure to comply with paragraph (a) may result in sanctions as provided in sections 245A.06 and 245A.07.",
	"repealed": false
}