{
	"id": "515B.1-102",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.1-102",
	"title": "515B.1-102 APPLICABILITY.",
	"text": "(a) Except as provided in this section, this chapter, and not chapters 515 and 515A, applies to all common interest communities created within this state on and after June 1, 1994.\n(b) The applicability of this chapter to common interest communities created prior to June 1, 1994, shall be as follows:\n(1) This chapter shall apply to condominiums created under chapter 515A with respect to events and circumstances occurring on and after June 1, 1994; provided (i) that this chapter shall not invalidate the declarations, bylaws or condominium plats of those condominiums, and (ii) that chapter 515A, and not this chapter, shall govern all rights and obligations of a declarant of a condominium created under chapter 515A, and the rights and claims of unit owners against that declarant.\n(2) The following sections in this chapter apply to condominiums created under chapter 515: 515B.1-104 (Variation by Agreement); 515B.1-105 (Separate Titles and Taxation); 515B.1-106 (Applicability of Local Requirements); 515B.1-107 (Eminent Domain); 515B.1-108 (This Chapter Prevails; Supplemental Law); 515B.1-109 (Construction Against Implicit Repeal); 515B.1-112 (Unconscionable Agreement or Term of Contract); 515B.1-113 (Obligation of Good Faith); 515B.1-114 (Remedies to be Liberally Administered); 515B.1-115 (Notice); 515B.1-116 (Recording); 515B.2-103 (Construction and Validity of Declaration and Bylaws); 515B.2-104 (Description of Units); 515B.2-108 (d) (Allocation of Interests); 515B.2-109 (f) (Common Elements and Limited Common Elements); 515B.2-112 (Subdivision, Combination, or Conversion of Units); 515B.2-113 (Alteration of Units); 515B.2-114 (Relocation of Boundaries Between Adjoining Units); 515B.2-115 (Minor Variations in Boundaries); 515B.2-118 (Amendment of Declaration); 515B.2-119 (Termination of Common Interest Community); 515B.3-102 (Powers of Unit Owners' Association); 515B.3-103 (a), (b), and (g) (Board of Directors, Officers, and Declarant Control); 515B.3-107 (Upkeep of Common Interest Community); 515B.3-108 (Meetings); 515B.3-109 (Quorums); 515B.3-110 (Voting; Proxies); 515B.3-111 (Tort and Contract Liability); 515B.3-112 (Conveyance of, or Creation of Security Interests in, Common Elements); 515B.3-113 (Insurance); 515B.3-114 (Replacement Reserves); 515B.3-115 (c), (e), (f), (g), (h), and (i) (Assessments for Common Expenses); 515B.3-116 (Lien for Assessments); 515B.3-117 (Other Liens); 515B.3-118 (Association Records); 515B.3-119 (Association as Trustee); 515B.3-121 (Accounting Controls); 515B.4-107 (Resale of Units); 515B.4-108 (Purchaser's Right to Cancel Resale); and 515B.4-116 (Rights of Action; Attorney's Fees). Section 515B.1-103 (Definitions) shall apply to the extent necessary in construing any of the sections referenced in this section. Sections 515B.1-105, 515B.1-106, 515B.1-107, 515B.1-116, 515B.2-103, 515B.2-104, 515B.2-118, 515B.3-102, 515B.3-110, 515B.3-111, 515B.3-113, 515B.3-116, 515B.3-117, 515B.3-118, 515B.3-121, 515B.4-107, 515B.4-108, and 515B.4-116 apply only with respect to events and circumstances occurring on and after June 1, 1994. All other sections referenced in this section apply only with respect to events and circumstances occurring after July 31, 1999. A section referenced in this section does not invalidate the declarations, bylaws or condominium plats of condominiums created before August 1, 1999. But all sections referenced in this section prevail over the declarations, bylaws, CIC plats, rules and regulations under them, of condominiums created before August 1, 1999, except to the extent that this chapter defers to the declarations, bylaws, CIC plats, or rules and regulations issued under them.\n(3) This chapter shall not apply to cooperatives and planned communities created prior to June 1, 1994, or to planned communities that were created on or after June 1, 1994, and before August 1, 2006, and that consist of more than two but fewer than 13 units; except by election pursuant to subsection (d), and except that sections 515B.1-116, subsections (a), (c), (d), and (e), 515B.4-107, and 515B.4-108, apply to all planned communities and cooperatives regardless of when they are created, unless they are exempt under subsection (e).\n(c) This chapter shall not invalidate any amendment to the declaration, bylaws or condominium plat of any condominium created under chapter 515 or 515A if the amendment was recorded before June 1, 1994. Any amendment recorded on or after June 1, 1994, shall be adopted in conformity with the procedures and requirements specified by those instruments and by this chapter. If the amendment grants to any person any rights, powers or privileges permitted by this chapter, all correlative obligations, liabilities and restrictions contained in this chapter shall also apply to that person.\n(d) Any condominium created under chapter 515, any planned community or cooperative which would be exempt from this chapter under subsection (e), or any planned community or cooperative created prior to June 1, 1994, or any planned community that was created on or after June 1, 1994, and prior to August 1, 2006, and that consists of more than two but fewer than 13 units, may elect to be subject to this chapter, as follows:\n(1) The election shall be accomplished by recording a declaration or amended declaration, and a new or amended CIC plat where required, and by approving bylaws or amended bylaws, which conform to the requirements of this chapter, and which, in the case of amendments, are adopted in conformity with the procedures and requirements specified by the existing declaration and bylaws of the common interest community, and by any applicable statutes.\n(2) In a condominium, the preexisting condominium plat shall be the CIC plat and an amended CIC plat shall be required only if the amended declaration or bylaws contain provisions inconsistent with the preexisting condominium plat. The condominium's CIC number shall be the apartment ownership number or condominium number originally assigned to it by the recording officer. In a cooperative in which the unit owners' interests are characterized as real estate, a CIC plat shall be required. In a planned community, the preexisting plat or registered land survey recorded pursuant to chapter 505, 508, or 508A, or the part of the plat or registered land survey upon which the common interest community is located, shall be the CIC plat.\n(3) The amendment shall comply with section 515B.2-118 (a)(3) and (c); except that the unanimous consent of the unit owners shall not be required for (i) a clarification of the unit boundary description if the clarified boundary description is substantially consistent with the preexisting CIC plat, or (ii) changes from common elements to limited common elements that occur by operation of section 515B.2-109 (c) and (d).\n(4) Except as permitted by paragraph (3), no declarant, affiliate of declarant, association, master association nor unit owner may acquire, increase, waive, reduce or revoke any previously existing warranty rights or causes of action that one of said persons has against any other of said persons by reason of exercising the right of election under this subsection.\n(5) A common interest community which elects to be subject to this chapter may, as a part of the election process, change its form of ownership by complying with section 515B.2-123.\n(e) Except as otherwise provided in this subsection, this chapter shall not apply, except by election pursuant to subsection (d), to the following:\n(1) a planned community which consists of two units, which utilizes a CIC plat complying with section 515B.2-110 (d)(1) and (2), or section 515B.2-1101 (d)(1) and (2), which is not subject to any rights to subdivide or convert units or to add additional real estate, and which is not subject to a master association;\n(2) a common interest community that consists solely of platted lots or other separate parcels of real estate designed or utilized for detached single family dwellings or agricultural purposes, with or without common property, where no association or master association has an obligation to maintain any building containing a dwelling or any agricultural building located or to be located on such platted lots or parcels; except that section 515B.4-101 (e) shall apply to the sale of such platted lots or parcels of real estate if the common interest community is or will be subject to a master declaration;\n(3) a cooperative where, at the time of creation of the cooperative, the unit owners' interests in the dwellings as described in the declaration consist solely of proprietary leases having an unexpired term of fewer than 20 years, including renewal options;\n(4) planned communities utilizing a CIC plat complying with section 515B.2-110 (d)(1) and (2), or section 515B.2-1101 (d)(1) and (2), and cooperatives, which are limited by the declaration to nonresidential uses; or\n(5) real estate subject only to an instrument or instruments filed primarily for the purpose of creating or modifying rights with respect to access, utilities, parking, ditches, drainage, or irrigation.\n(f) Section 515B.4-101 (e) applies to any platted lot or other parcel of real estate that is subject to a master declaration and is not subject to or is exempt from this chapter.\n(g) Section 515B.1-106 and section 515B.2-118, subsections (a)(5), (a)(7), and (d), shall apply to all common interest communities.\n(h) Sections 515B.1-103 (33a), 515B.2-110, 515B.3-105, 515B.3-115, 515B.4-102, and 515B.4-115 apply only to common interest communities created before August 1, 2010. Sections 515B.1-103 (33b), 515B.2-1101, 515B.3-1051, 515B.3-1151, 515B.4-1021, and 515B.4-1151 apply only to common interest communities created on or after August 1, 2010.\n(i) Section 515B.3-114 applies to common interest communities only for the association's fiscal years commencing before January 1, 2012. Section 515B.3-1141 applies to common interest communities only for the association's fiscal years commencing on or after January 1, 2012.\n(j) Section 515B.3-104 applies only to transfers of special declarant rights that are effective before August 1, 2010. Section 515B.3-1041, subsections (a) through (i), apply only to transfers of special declarant rights that are effective on or after August 1, 2010. Section 515B.3-1041, subsections (j) and (k), apply only to special declarant rights reserved in a declaration that is first recorded on or after August 1, 2010.",
	"repealed": false
}