{
	"id": "103I.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.621",
	"title": "103I.621 PERMITS FOR GROUNDWATER THERMAL EXCHANGE DEVICES.",
	"text": "(a) Notwithstanding any department or agency rule to the contrary, the commissioner shall issue, on request by the owner of the property and payment of the permit fee, permits for the reinjection of water by a properly constructed well into the same aquifer from which the water was drawn for the operation of a groundwater thermal exchange device.\n(b) As a condition of the permit, an applicant must agree to allow inspection by the commissioner during regular working hours for department inspectors.\n(c) Not more than 200 permits may be issued for small systems that (1) have maximum capacities of 20 gallons per minute or less, and (2) are compliant with the natural resource water-use requirements under subdivision 2.\n(d) Not more than 100 permits may be issued for larger systems that (1) have maximum capacities over 20 gallons per minute, and (2) are compliant with the natural resource water-use requirements under subdivision 2.\n(e) A person issued a permit must comply with this section and permit conditions deemed necessary to protect public health and safety of groundwater. Permit conditions may include but are not limited to:\n(1) notification to the commissioner at intervals specified in the permit conditions;\n(2) system operation and maintenance;\n(3) system location and construction;\n(4) well location and construction;\n(5) signage requirements;\n(6) reports of system construction, performance, operation, and maintenance;\n(7) removal of the system upon termination of use or failure;\n(8) disclosure of the system at the time of property transfer;\n(9) requirements to obtain approval from the commissioner prior to deviating from the approval plan and conditions;\n(10) groundwater level monitoring; and\n(11) groundwater quality monitoring.\n(f) The property owner or the property owner's agent must submit to the commissioner a permit application on a form provided by the commissioner, or in a format approved by the commissioner, that provides any information necessary to protect public health and safety of groundwater.\n(g) A permit granted under this section is not valid if a water-use permit is required for the project and is not approved by the commissioner of natural resources.\nWater-use permit requirements and penalties under chapter 103G and related rules adopted and enforced by the commissioner of natural resources apply to groundwater thermal exchange permit recipients. A person who violates a provision of this section is subject to enforcement or penalties for the noncomplying activity that are available to the commissioner and the Pollution Control Agency.\n(a) Withdrawal and reinjection for the groundwater thermal exchange device must be accomplished by a closed system in which the waters drawn for thermal exchange do not have contact or commingle with water from other sources or with polluting material or substances. The closed system must be constructed to allow an opening for inspection by the commissioner.\n(b) Wells that are part of a groundwater thermal exchange system may not serve another function, except water may be supplied to the domestic water system if:\n(1) the supply is taken from the thermal exchange system ahead of the heat exchange unit; and\n(2) the domestic water system is protected by an airgap or backflow prevention device as described in rules relating to plumbing enforced by the commissioner of labor and industry.\n(c) A groundwater thermal exchange system may be used for domestic water heating only if the water heating device is an integral part of the heat exchange unit that is used for space heating and cooling.\nThe commissioner may adopt rules to administer this section.",
	"repealed": false
}