{
	"id": "515B.4-101",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-101",
	"title": "515B.4-101 APPLICABILITY; DELIVERY OF DISCLOSURE STATEMENT.",
	"text": "(a) Sections 515B.4-101 through 515B.4-118 apply to all units subject to this chapter, except as provided in subsection (c) or as modified or waived by written agreement of purchasers of a unit which is restricted to nonresidential use.\n(b) Subject to subsections (a) and (c), a declarant who offers a unit to a purchaser shall deliver to the purchaser a current disclosure statement which complies with the requirements of section 515B.4-102. The disclosure statement shall include any material amendments to the disclosure statement made prior to the conveyance of the unit to the purchaser. The declarant shall be liable to the purchaser to whom it delivered the disclosure statement for any false or misleading statement set forth therein or for any omission of a material fact therefrom.\n(c) Neither a disclosure statement nor a resale disclosure certificate need be prepared or delivered in the case of:\n(1) a gratuitous transfer;\n(2) a transfer pursuant to a court order;\n(3) a transfer to a government or governmental agency;\n(4) a transfer to a secured party by foreclosure or deed in lieu of foreclosure;\n(5) an option to purchase a unit, until exercised;\n(6) a transfer to a person who \"controls\" or is \"controlled by,\" the grantor as those terms are defined with respect to a declarant under section 515B.1-103(2);\n(7) a transfer by inheritance;\n(8) a transfer of special declarant rights under section 515B.3-104; or\n(9) a transfer in connection with a change of form of common interest community under section 515B.2-123.\n(d) A purchase agreement for a unit shall contain the following notice: \"The following notice is required by Minnesota Statutes. The purchaser is entitled to receive a disclosure statement or resale disclosure certificate, as applicable. The disclosure statement or resale disclosure certificate contains important information regarding the common interest community and the purchaser's cancellation rights.\"\n(e) The sale, to the initial occupant, of a platted lot or other parcel of real estate (i) which is or may be subject to a master declaration, (ii) which is intended for residential occupancy, and (iii) which does not and is not intended to constitute a unit, shall be subject to the following requirements:\n(1) The purchase agreement for the lot or other parcel shall contain the following notice: \"The following notice is required by Minnesota Statutes: The real estate to be conveyed under this agreement is or may be subject to a master association as defined in Minnesota Statutes, chapter 515B. The master developer is required to provide to the buyer, within ten days after receipt of a request from the buyer or the buyer's authorized representative, a statement containing the information required by Minnesota Statutes, section 515B.4-102(a)(20), with respect to the master association. The statement contains important information regarding the master association. The name, address, and telephone number of the master developer are [insert information].\"\n(2) A master developer shall, within ten days after receipt of a request described in clause (1), furnish to the requesting person the information required to be provided by section 515B.4-102(a)(20).\n(f) A claim by a buyer based upon a failure to comply with subsection (e):\n(1) shall be limited to legal, and not equitable, remedies; or\n(2) shall be barred unless it is commenced within the time period specified in section 515B.4-115(a).",
	"repealed": false
}