{
	"id": "245C.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.17",
	"title": "245C.17 NOTICE OF BACKGROUND STUDY RESULTS.",
	"text": "(a) Within three working days after the commissioner's receipt of a request for a background study submitted through the commissioner's NETStudy or NETStudy 2.0 system, the commissioner shall notify the background study subject and the license holder or other entity as provided in this chapter in writing or by electronic transmission of the results of the study or that more time is needed to complete the study. The notice to the individual shall include the identity of the entity that initiated the background study.\n(b) Before being provided access to NETStudy 2.0, the license holder or other entity under section 245C.04 shall sign an acknowledgment of responsibilities form developed by the commissioner that includes identifying the sensitive background study information person, who must be an employee of the license holder or entity. All queries to NETStudy 2.0 are electronically recorded and subject to audit by the commissioner. The electronic record shall identify the specific user. A background study subject may request in writing to the commissioner a report listing the entities that initiated a background study on the individual.\n(c) When the commissioner has completed a prior background study on an individual that resulted in an order for immediate removal and more time is necessary to complete a subsequent study, the notice that more time is needed that is issued under paragraph (a) shall include an order for immediate removal of the individual from any position allowing direct contact with or access to people receiving services and from working in a children's residential facility, foster residence setting, child care center, or certified license-exempt child care center pending completion of the background study.\n(a) If the information in the study indicates the individual is disqualified from direct contact with, or from access to, persons served by the program, the commissioner shall disclose to the individual studied:\n(1) the information causing disqualification;\n(2) instructions on how to request a reconsideration of the disqualification;\n(3) an explanation of any restrictions on the commissioner's discretion to set aside the disqualification under section 245C.24, when applicable to the individual;\n(4) a statement that when a subsequent background study is initiated on the individual following a set-aside of the individual's disqualification, and the commissioner makes a determination under section 245C.22, subdivision 5, paragraph (b), that the previous set-aside applies to the subsequent background study, the applicant, license holder, or other entity that initiated the background study will be informed in the notice under section 245C.22, subdivision 5, paragraph (c), that the individual's disqualification is set aside for that program or agency; and\n(5) the commissioner's determination of the individual's immediate risk of harm under section 245C.16.\n(b) If the commissioner determines under section 245C.16 that an individual poses an imminent risk of harm to persons served by the program where the individual will have direct contact with, or access to, people receiving services, the commissioner's notice must include an explanation of the basis of this determination.\n(c) If the commissioner determines under section 245C.16 that an individual studied does not pose a risk of harm that requires immediate removal, the individual shall be informed of the conditions under which the agency that initiated the background study may allow the individual to have direct contact with, or access to, people receiving services, as provided under subdivision 3.\n(a) The commissioner shall notify an applicant, license holder, or other entity as provided in this chapter who is not the subject of the study:\n(1) that the commissioner has found information that disqualifies the individual studied from being in a position allowing direct contact with, or access to, people served by the program; and\n(2) the commissioner's determination of the individual's risk of harm under section 245C.16.\n(b) If the commissioner determines under section 245C.16 that an individual studied poses an imminent risk of harm to persons served by the program where the individual studied will have direct contact with, or access to, people served by the program, the commissioner shall order the license holder to immediately remove the individual studied from any position allowing direct contact with, or access to, people served by the program.\n(c) If the commissioner determines under section 245C.16 that an individual studied poses a risk of harm that requires continuous, direct supervision, the commissioner shall order the applicant, license holder, or other entities as provided in this chapter to:\n(1) immediately remove the individual studied from any position allowing direct contact with, or access to, people receiving services; or\n(2) before allowing the disqualified individual to be in a position allowing direct contact with, or access to, people receiving services, the applicant, license holder, or other entity, as provided in this chapter, must:\n(i) ensure that the individual studied is under continuous, direct supervision when in a position allowing direct contact with, or access to, people receiving services during the period in which the individual may request a reconsideration of the disqualification under section 245C.21; and\n(ii) ensure that the disqualified individual requests reconsideration within 30 days of receipt of the notice of disqualification.\n(d) If the commissioner determines under section 245C.16 that an individual studied does not pose a risk of harm that requires continuous, direct supervision, the commissioner shall order the applicant, license holder, or other entities as provided in this chapter to:\n(1) immediately remove the individual studied from any position allowing direct contact with, or access to, people receiving services; or\n(2) before allowing the disqualified individual to be in any position allowing direct contact with, or access to, people receiving services, the applicant, license holder, or other entity as provided in this chapter must ensure that the disqualified individual requests reconsideration within 15 days of receipt of the notice of disqualification.\n(e) The commissioner shall not notify the applicant, license holder, or other entity as provided in this chapter of the information contained in the subject's background study unless:\n(1) the basis for the disqualification is failure to cooperate with the background study;\n(2) the Data Practices Act under chapter 13 provides for release of the information; or\n(3) the individual studied authorizes the release of the information.\nFor studies on individuals pertaining to a license to provide family child care or group family child care, foster care for children in the provider's own home, or foster care or day care services for adults in the provider's own home, the commissioner is not required to provide a separate notice of the background study results to the individual who is the subject of the study unless the study results in a disqualification of the individual.\nFor studies on individuals related to a license to provide child foster care when the applicant or license holder resides in the home where child foster care services are provided, the commissioner shall also provide a notice of the background study results to the county or private agency that initiated the background study.\nFor studies on individuals related to a license to provide adult foster care when the applicant or license holder resides in the adult foster care residence and family adult day services and, effective upon implementation of NETStudy 2.0, family child care, the commissioner shall also provide a notice of the background study results to the county agency that initiated the background study.\n[See Note.]\n(a) For children's residential facilities and foster residence settings, all notices under this section that order the license holder to immediately remove the individual studied from any position allowing direct contact with, or access to a person served by the program, must also order the license holder to immediately remove the individual studied from working in the program, facility, or setting.\n(b) For Title IV-E eligible children's residential facilities and foster residence settings, notices under this section must not allow an individual to work in the program, facility, or setting under supervision.\n(a) For child care centers and certified license-exempt child care centers, all notices under this section that order the license holder to immediately remove the individual studied from any position allowing direct contact with, or access to a person served by the center, must also order the license holder to immediately remove the individual studied from working in any position regardless of whether the individual would have direct contact with or access to children served in the center.\n(b) For child care centers and certified license-exempt child care centers, notices under this section must not allow an individual to work in the center.",
	"repealed": false
}