{
	"id": "115A.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.301",
	"title": "115A.301 INDEMNIFYING CERTAIN DAMAGES ARISING FROM STABILIZATION AND CONTAINMENT FACILITY.",
	"text": "(a) As a condition of obtaining an agency permit and except as provided in paragraph (b), the operator of a hazardous waste stabilization and containment facility established under sections 115A.18 to 115A.30, upon the acceptance of any hazardous waste for stabilization and containment, shall agree to indemnify any other person for any liability the person may have under chapter 115B as a result of a release or threatened release of hazardous waste from the stabilization and containment facility to the extent of the financial responsibility requirement established in subdivision 2.\n(b) The operator is not required to indemnify any person for liability to the extent that:\n(1) the liability is the result of a violation by that person of state or federal law that governs the handling, transportation, or disposal of hazardous substances;\n(2) the liability is the result of a negligent act or omission of that person with respect to the handling, transportation, or disposal of hazardous substances; or\n(3) the liability is one for which a claim has been or may be paid by the Federal Postclosure Liability Fund under United States Code, title 42, section 9607(k).\n(c) The operator is not required to indemnify any person for any claim filed more than 30 years after closure of the stabilization and containment facility in accordance with agency rules.\n(d) The operator may intervene as of right in any action that may result in a claim for indemnification under this subdivision.\n(a) As a condition of obtaining a permit to operate a hazardous waste stabilization and containment facility established under sections 115A.18 to 115A.30, the operator shall demonstrate financial responsibility to pay claims of liability for personal injury, economic loss, response costs, and natural resources damage that the operator may incur as a result of a release or threatened release of a hazardous waste from the facility, including liability for which the operator is required to indemnify other persons under subdivision 1. The amount of the operator's financial responsibility must be at least $40,000,000.\n(b) The agency may require a higher level of financial responsibility as a condition of a permit for a stabilization and containment facility depending upon the size of the facility, the location of the facility, the types of waste that will be accepted at the facility, and other factors affecting the risk of a release and potential liability. The operator may demonstrate financial responsibility by any mechanism approved by the agency's hazardous waste rules. The operator shall maintain financial responsibility as provided in this subdivision during operation of the facility and until 30 years after facility closure in accordance with agency rules, provided that the operator shall maintain financial responsibility after 30 years in the amount and for the time necessary to satisfy any outstanding claims filed within 30 years after facility closure.\n(a) A state facility liability trust fund is established as an account in the state treasury. Money in the fund shall be held in trust by the state to pay claims of liability resulting from the release or threatened release of hazardous waste from a disposal facility established under sections 115A.18 to 115A.30, and to purchase insurance to pay the claims. Subject to the limitations provided in paragraph (b), the fund and insurance purchased by the fund shall pay claims to the extent that the claims are not satisfied by the operator of the facility under subdivision 1, by the Federal Postclosure Liability Fund under United States Code, title 42, section 9607(k), or by any person, including the operator, who is liable for the claim as a result of violation of a state or federal law or a negligent act or omission.\n(b) The state is not obligated to pay any claims in excess of the amount of money in the fund and the limits of any insurance purchased by the fund.\n(c) Interest earned by the money in the fund must be credited to the fund.\nThe agency shall determine the amount of money that will be needed in the state facility liability trust fund to maintain insurance coverage for each facility of at least $10,000,000 during the operating life of the facility and to accumulate a balance of at least $10,000,000 within 20 years after the facility begins operation. The agency may require insurance coverage and accumulation of a fund balance in amounts greater than those provided in this subdivision based upon the factors that the agency must consider in establishing the level of financial responsibility under subdivision 2 and the amount of claims for which the fund is likely to be liable under subdivision 3. Based on the amounts required to purchase insurance and accumulate the fund balance, the agency shall establish a surcharge amount to be collected under subdivision 5. The agency may adjust the amount of the surcharge based on the actual quantities of waste received at the facility. Determinations by the agency under this subdivision are subject to the rulemaking provisions of chapter 14.\nA surcharge must be paid for every ton or part of a ton of hazardous waste accepted for stabilization and containment at a facility. The operator shall collect and hold the surcharge in a separate account. By the first day of each month, the operator shall pay any money in this account to the commissioner of management and budget for credit to the state facility liability trust fund.\n(a) The commissioner of management and budget shall administer the state facility liability trust fund. Money in the fund is appropriated to the commissioner of management and budget for expenditure as provided in subdivision 3. The commissioner shall establish separate accounts in the fund for purchase of insurance and for accumulation of a fund balance as required by the Pollution Control Agency under subdivision 4. After closure of the facility in accordance with agency rules, the commissioner shall consolidate the two accounts and may use any interest income from the fund to purchase insurance to pay claims for which the fund may be liable.\n(b) The commissioner, in consultation with the attorney general, may settle any claims that the fund may be required to pay. If two or more claims are made against the fund, the amount of which would exceed the amount in the fund, the commissioner shall pay any valid claims on a pro rata basis. The commissioner, on behalf of the fund, may intervene as of right in an action that may result in a claim against the fund.\nNothing in this section affects the right of any person to bring an action under any law to recover costs or damages arising out of the release or threatened release of a hazardous substance from a disposal facility established under sections 115A.18 to 115A.30. Any costs or damages recoverable in such an action shall be reduced to the extent that the costs or damages have been paid under subdivisions 1 to 3.",
	"repealed": false
}