{
	"id": "124D.531",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.531",
	"title": "124D.531 ADULT BASIC EDUCATION AID.",
	"text": "(a) The state total adult basic education aid for fiscal year 2024 equals $52,759,000, plus any amount that is not paid during the previous fiscal year as a result of adjustments under subdivision 4, paragraph (a), or section 124D.52, subdivision 3. The state total adult basic education aid for later fiscal years equals:\n(1) the state total adult basic education aid for the preceding fiscal year plus any amount that is not paid for during the previous fiscal year, as a result of adjustments under subdivision 4, paragraph (a), or section 124D.52, subdivision 3; times\n(2) the lesser of:\n(i) 1.03; or\n(ii) the greater of: (A) one plus the percent change in the formula allowance under section 126C.10, subdivision 2, from the previous fiscal year to the current fiscal year; or (B) the average growth in state total contact hours over the prior ten program years.\nThree percent of the state total adult basic education aid must be set aside for adult basic education supplemental service grants under section 124D.522.\n(b) The state total adult basic education aid, excluding basic population aid, equals the difference between the amount computed in paragraph (a), and the state total basic population aid under subdivision 2.\nA district is eligible for basic population aid if the district has a basic service level approved by the commissioner under section 124D.52, subdivision 5, or is a member of a consortium with an approved basic service level. Basic population aid is equal to the greater of $3,844 or $1.73 times the population of the district. District population is determined according to section 275.14.\nAdult basic education programs established under section 124D.52 and approved by the commissioner are eligible for revenue under this subdivision. For fiscal year 2001 and later, adult basic education revenue for each approved program equals the sum of:\n(1) the basic population aid under subdivision 2 for districts participating in the program during the current program year; plus\n(2) 84 percent times the amount computed in subdivision 1, paragraph (b), times the ratio of the contact hours for students participating in the program during the first prior program year to the state total contact hours during the first prior program year; plus\n(3) eight percent times the amount computed in subdivision 1, paragraph (b), times the ratio of the enrollment of English learners during the second prior school year in districts participating in the program during the current program year to the state total enrollment of English learners during the second prior school year in districts participating in adult basic education programs during the current program year; plus\n(4) eight percent times the amount computed in subdivision 1, paragraph (b), times the ratio of the latest federal census count of the number of adults aged 25 or older with no diploma residing in the districts participating in the program during the current program year to the latest federal census count of the state total number of adults aged 25 or older with no diploma residing in the districts participating in adult basic education programs during the current program year.\n(a) Notwithstanding subdivisions 2 and 3, the total adult basic education aid for a program per prior year contact hour must not exceed $30 per prior year contact hour computed under subdivision 3, clause (2).\n(b) The aid for a program under subdivision 3, clause (2), adjusted for changes in program membership, must not exceed the aid for that program under subdivision 3, clause (2), for the first preceding fiscal year by more than the greater of 11 percent or $10,000.\n(c) Adult basic education aid is payable to a program for unreimbursed costs occurring in the program year as defined in section 124D.52, subdivision 3.\n(d) Any adult basic education aid that is not paid to a program because of the program aid limitation under paragraph (a) must be added to the state total adult basic education aid for the next fiscal year under subdivision 1. Any adult basic education aid that is not paid to a program because of the program aid limitations under paragraph (b) must be reallocated among programs by adjusting the rate per contact hour under subdivision 3, clause (2).\n[Repealed, 2007 c 146 art 9 s 19]\n(a) Except as provided in paragraph (b), adult basic education aid must be paid directly to the fiscal agent of each approved program. An approved program must have only one fiscal agent.\n(b) A district that is part of a consortium may request direct payment of basic population aid under subdivision 2. The district must make a written request to the commissioner by June 15 for aid payments the following fiscal year. The request must include certification that:\n(1) the district will deposit direct aid payments in a separate adult basic education account; and\n(2) the district will use direct aid payments only for adult basic education instruction.\nPrograms that receive aid under this section must maintain records that support the aid payments. The commissioner may audit these records upon request. The commissioner must establish procedures for conducting fiscal audits of adult basic education programs. The commissioner must establish procedures to reconcile any discrepancies between aid payments based on information reported to the commissioner and aid estimates based on a program audit.\nA consortium or district shall not spend more than five percent of the consortium or district's total adult basic education aid on administrative costs.\nPrograms that receive aid under this section must submit an annual report to the commissioner that includes revenue and expense reports for each district and program, including instructional services offered in partnership with businesses and nonprofit organizations.\nAn adult basic education program or consortium that has been subject to a service disruption may apply to the commissioner in the form and manner established by the commissioner for an adjusted number of contact hours. The program or consortium must demonstrate to the commissioner's satisfaction that the loss in contact hours due to the service disruption was outside of the control of the adult basic education program or its consortium and that the program or consortium took reasonable actions to avoid the loss of contact hours. If the commissioner approves the program or consortium's request, the commissioner may adjust the number of contact hours of the program, and if applicable, of the consortium, but in no case may the adjusted contact hours yield an aid amount for a consortium under subdivision 3, clause (2), greater than the most recent two-year average aid under that clause.",
	"repealed": false
}