{
	"id": "197.4552",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.4552",
	"title": "197.4552 EXPEDITED AND TEMPORARY LICENSING FOR FORMER AND CURRENT MEMBERS OF THE MILITARY.",
	"text": "Notwithstanding any other law to the contrary, each professional licensing board defined in section 214.01, subdivisions 2 and 3, shall establish a procedure to expedite the issuance of a license or certification to perform professional services regulated by each board to a qualified individual who is:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license or certification application, and has confirmation of an honorable or general discharge status.\n(a) Notwithstanding any other law to the contrary, each professional licensing board defined in section 214.01, subdivisions 2 and 3, shall establish a procedure to issue a temporary license or certification to perform professional services regulated by each board to a qualified individual who is:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license or certification application, and has confirmation of an honorable or general discharge status.\n(b) A qualified individual under paragraph (a) must provide evidence of:\n(1) a current, valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license or certificate issued under this subdivision shall allow a qualified individual to perform regulated professional services for a limited length of time as determined by the licensing board. During the temporary license period, the individual shall complete the full application procedure as required by applicable law.\nEach licensing board may adopt rules to carry out the provisions of this section.",
	"repealed": false
}