{
	"id": "168.1235",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1235",
	"title": "168.1235 VETERANS SERVICE GROUP EMBLEMS.",
	"text": "(a) The commissioner must issue a special plate emblem for each plate to an applicant who:\n(1) is a member of a congressionally chartered veterans service organization and is a registered owner of a passenger automobile, pickup truck, van, or self-propelled recreational vehicle, or is a congressionally chartered veterans service organization that is the registered owner of a passenger automobile, pickup truck, van, or self-propelled recreational vehicle;\n(2) pays the registration tax required by law;\n(3) pays a fee in the amount specified for special plates under section 168.12, subdivision 5, for each set of two plates, and any other fees required by this chapter; and\n(4) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) The additional fee is payable at the time of initial application for the special plate emblem and when the plates must be replaced or renewed.\n(c) The applicant must present a valid card indicating membership in the American Legion, Veterans of Foreign Wars, or Disabled American Veterans.\n(a) The commissioner of veterans affairs, after consultation with each of the congressionally chartered veterans service organizations, shall design the special plate emblems, subject to the approval of the commissioner. The emblem must be at least as large as the letters and numerals on the plate and the commissioner shall allow for plates with spaces for the emblem in place of a numeral or letter.\n(b) Each congressionally chartered veterans service organization must arrange for any applicable rules of the national organization to be changed or copyrights to be released before the commissioner may issue special emblems to members of any particular service organization under this section.\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 9]\nDespite section 168.12 or other law to the contrary, on payment of a fee of $5, the veterans service organization special plate emblems issued under subdivision 1, may be transferred by the owner to other plates on a passenger automobile, pickup truck, van, or self-propelled recreational vehicle registered to the person to whom the emblems were issued.\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 9]",
	"repealed": false
}