{
	"id": "276A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/276A.06",
	"title": "276A.06 NET TAX CAPACITY OF GOVERNMENTAL UNIT.",
	"text": "The county auditor shall determine the net tax capacity of each governmental unit within the county in the manner prescribed by this section.\nThe net tax capacity of a governmental unit is its net tax capacity as determined in accordance with other provisions of law including section 469.177, subdivision 3, subject to the following adjustments:\n(1) There must be subtracted from its net tax capacity, in each municipality in which the governmental unit exercises ad valorem taxing jurisdiction, an amount that bears the same proportion to 40 percent of the amount certified in that year pursuant to sections 276A.04 and 276A.05 for the municipality as the total preceding year's net tax capacity of commercial-industrial property which is subject to the taxing jurisdiction of the governmental unit within the municipality, determined without regard to section 469.177, subdivision 3, bears to the total preceding year's net tax capacity of commercial-industrial property within the municipality, determined without regard to section 469.177, subdivision 3.\n(2) There must be added to its net tax capacity, in each municipality in which the governmental unit exercises ad valorem taxing jurisdiction, an amount which bears the same proportion to the areawide net tax capacity for the year attributable to that municipality as the total preceding year's net tax capacity of residential property which is subject to the taxing jurisdiction of the governmental unit within the municipality bears to the total preceding year's net tax capacity of residential property of the municipality.\nThe county auditor shall apportion the levy of each governmental unit in the county in the manner prescribed by this subdivision. The auditor shall:\n(1) by August 20 of 2014 and each subsequent year, determine the preliminary areawide portion of the levy for each governmental unit by multiplying the local tax rate of the governmental unit for the preceding levy year times the distribution value set forth in subdivision 2, clause (2);\n(2) by September 5 of 2014 and each subsequent year, determine the areawide portion of the levy for each governmental unit by multiplying the preliminary areawide portion of the levy for each governmental unit times a fraction, the numerator of which is the difference between the sum of the preliminary areawide levies for all governmental units in the area minus the school fund allocation and the denominator is the sum of the preliminary areawide levy for all governmental units in the area; and\n(3) by September 5 of 2014 and each subsequent year, determine the local portion of the current year's levy by subtracting the resulting amount from clause (1) from the governmental unit's current year's levy.\nIn 1997 and subsequent years, the county auditor shall divide that portion of the levy determined pursuant to subdivision 3, clause (2), by the net tax capacity of the governmental unit, taking section 469.177, subdivision 3, into account, less that portion subtracted from net tax capacity pursuant to subdivision 2, clause (1). The resulting rate applies to all taxable property except commercial-industrial property, which must be taxed in accordance with subdivision 7.\nOn or before August 25, 1997, and each subsequent year, the county auditor shall certify to the administrative auditor the preliminary portion of the levy of each governmental unit determined pursuant to subdivision 3, clause (1). The administrative auditor shall then determine the areawide tax rate sufficient to yield an amount equal to the sum of the levies from the preliminary areawide net tax capacity. On or before September 1, the administrative auditor shall certify the areawide tax rate to each of the county auditors.\nIf a governmental unit is located in two or more counties, the computations and certifications required by subdivisions 3 to 5 with respect to it must be made by the county auditor who is responsible for allocating its levies between or among the affected counties.\nThe areawide tax rate determined in accordance with subdivision 5 applies to each commercial-industrial property subject to taxation within a municipality, including property located within any tax increment financing district, as defined in section 469.174, subdivision 9, to that portion of the net tax capacity of the item which bears the same proportion to its total net tax capacity as 40 percent of the amount determined pursuant to sections 276A.04 and 276A.05 is to the amount determined pursuant to section 276A.03. The rate of taxation determined in accordance with subdivision 4 applies in the taxation of the remainder of the net tax capacity of the item.\nThe administrative auditor shall determine for each county the difference between the total levy on distribution value pursuant to subdivision 3, clause (1), including the school fund allocation within the county and the total tax on contribution value pursuant to subdivision 7, within the county. On or before May 16 of each year, the administrative auditor shall certify the differences so determined and the county's portion of the school fund allocation to each county auditor. In addition, the administrative auditor shall certify to those county auditors for whose county the total tax on contribution value exceeds the total levy on distribution value the settlement the county is to make to the other counties of the excess of the total tax on contribution value over the total levy on distribution value in the county. On or before June 15 and November 15 of each year, each county treasurer in a county having a total tax on contribution value in excess of the total levy on distribution value shall pay one-half of the excess to the other counties in accordance with the administrative auditor's certification. On or before June 15 and November 15 of each year, each county treasurer shall pay to the administrative auditor that county's share of the school fund allocation. On or before December 1 of each year, the administrative auditor shall pay the school fund allocation to the commissioner of Iron Range resources and rehabilitation for deposit in the Iron Range schools and community development account.\nIn any year in which the highest classification rate for class 3a property changes from the rate in the previous year, the following adjustments shall be made to the procedures described in sections 276A.04 to 276A.06:\n(1) An initial contribution tax capacity shall be determined for each municipality based on the previous year's classification rates.\n(2) Each jurisdiction's distribution tax capacity shall be determined based upon the areawide tax base determined by summing the tax capacities computed under clause (1) for all municipalities and apportioning the resulting sum pursuant to section 276A.05, subdivision 5.\n(3) Each jurisdiction's distribution levy shall be determined by applying the procedures described in subdivision 3, clause (1), to the distribution tax capacity determined pursuant to clause (2).\n(4) Each municipality's final contribution tax capacity shall be determined equal to its initial contribution tax capacity multiplied by the ratio of the new highest classification rate for class 3a property to the previous year's highest classification rate for class 3a property.\n(5) For the purposes of computing education aids and any other state aids requiring the addition of the fiscal disparities distribution tax capacity to the local tax capacity, each municipality's final distribution tax capacity shall be determined equal to its initial distribution tax capacity multiplied by the ratio of the new highest classification rate for class 3a property to the previous year's highest classification rate for class 3a property.\n(6) The areawide tax rate shall be determined by dividing the sum of the amounts determined in clause (3) by the sum of the values determined in clause (4).\n(7) The final contribution tax capacity determined in clause (4) shall also be used to determine the portion of each commercial-industrial property's tax capacity subject to the areawide tax rate pursuant to subdivision 7.\nFor the purpose of computing fiscal capacity under section 276A.01, subdivision 12, a municipality's taxable market value must be adjusted to reflect the reductions to net tax capacity effected by subdivision 2, clause (1), provided that in determining the taxable market value of commercial-industrial property or any class thereof within a municipality, the reduction required by this subdivision is that amount which bears the same proportion to the amount subtracted from the municipality's net tax capacity pursuant to subdivision 2, clause (1), as the taxable market value of commercial-industrial property, or such class thereof, located within the municipality bears to the net tax capacity of commercial-industrial property, or such class thereof, located within the municipality. No adjustment shall be made to taxable market value for the increase in net tax capacity under subdivision 2, clause (2).",
	"repealed": false
}