{
	"id": "631.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/631.425",
	"title": "631.425 RELEASING OFFENDERS FOR EMPLOYMENT.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Court\" means a court having criminal jurisdiction.\n(c) \"Sheriff\" includes a chief of police and workhouse superintendent.\n(d) \"Jail\" includes a county jail, workhouse, and lockup.\nA convicted person at the time of sentencing to jail, or at any time before commitment, may in the discretion of the sentencing court be committed under this section. The court shall cite this section in the sentence if a person is committed under this section.\nIf the person committed under this section has been regularly employed, the sheriff shall arrange for a continuation of the employment insofar as possible without interruption. If the person is not employed, the court may designate a suitable person or agency to make reasonable efforts to secure some suitable employment for that person. An inmate employed under this section must be paid a fair and reasonable wage for work performed and must work at fair and reasonable hours per day and per week. There must not be a fee or charge for the inmate to participate in any employment under this section if the inmate is paying for the cost of the inmate's maintenance under subdivision 5.\nUnless the court otherwise directs, the sheriff or local correctional agency may electronically monitor or confine in jail each inmate during the time the inmate is not employed, or, if the inmate is employed, between the times of employment. The sheriff may not electronically monitor an offender who is sentenced for an offense within the definition of domestic abuse under section 518B.01, subdivision 2, unless the court directs otherwise. The sheriff may assess the cost of electronic monitoring on the offender.\nThe earnings of an inmate may be collected by the sheriff, probation department, local social services agency or suitable person or agency designated by the court. From the earnings, the person or agency designated to collect them may pay:\n(1) the cost of the inmate's maintenance, both inside and outside the jail, but the charge for maintenance inside the jail may not exceed the legal daily allowance for board allowed the sheriff for ordinary inmates;\n(2) to the extent directed by the court, pay the support of dependents, if any;\n(3) court costs and fines; and\n(4) court-ordered restitution, if any. Any balance must be retained until the inmate's discharge and then paid to the inmate.\nThe term of the inmate's sentence, whether the term is part of an executed sentence or is imposed as a condition of probation, shall, when ten days or more, be reduced by one day for each two days served, commencing on the day of arrival, during which the inmate has not violated any rule or discipline of the place within which the person is incarcerated and, if required to labor, has labored with diligence and fidelity.\nIf the inmate violates a condition of work release relating to conduct, custody, or employment, the correctional facility administrator may require that the inmate spend the balance of the inmate's sentence in actual confinement. The facility administrator shall give the inmate an opportunity to be heard before implementing this decision. On appeal by the inmate within seven days, the court must review the facility administrator's decision and, in its review, may (1) uphold or reverse the decision; and (2) order additional sanctions for the work release violation, including canceling any earned reduction in the inmate's term and finding the inmate in contempt of court.\nThe county board or local governing board shall determine how much extra compensation and mileage the sheriff is entitled to under this section.\nThe court may by order authorize the sheriff to whom the inmate is committed to arrange with another sheriff for the employment of the inmate in the other sheriff's jurisdiction. When the inmate is employed in the other jurisdiction, the inmate is in the custody of that jurisdiction's sheriff, but in other respects is subject to the commitment.\nA committing court or sheriff may request the local social services agency or any other welfare agency, public or private, to provide appropriate services to an inmate or the inmate's family.\nThe provisions of this section apply to a person committed to the county jail by a court of record upon an adjudication of contempt of court.\nOn December 31 of each year, each court that has committed a prisoner in accordance with this section shall file with the Department of Corrections, in a form prescribed by the department (1) the number of persons committed, (2) the offenses for which they were committed, (3) the number who had previously been sentenced under this section, and (4) other statistical information prescribed by the department.",
	"repealed": false
}