{
	"id": "144.6501",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6501",
	"title": "144.6501 NURSING HOME ADMISSION CONTRACTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Facility\" means a nursing home licensed under chapter 144A or a boarding care facility licensed under sections 144.50 to 144.58.\n(c) \"Contract of admission,\" \"admission contract,\" or \"admission agreement,\" includes, but is not limited to, all documents that a resident or resident's representative must sign at the time of, or as a condition of, admission to the facility. Oral representations and statements between the facility and the resident or resident's representative are not part of the contract of admission unless expressly contained in writing in those documents. The contract of admission must specify the obligations of the resident or the responsible party.\n(d) \"Legal representative\" means an attorney-in-fact under a valid power of attorney executed by the prospective resident, or a conservator or guardian appointed for the prospective resident, or a representative payee appointed for the prospective resident, or other agent of limited powers.\n(e) \"Responsible party\" means a person who has access to the resident's income and assets and who agrees to apply the resident's income and assets to pay for the resident's care or who agrees to make and complete an application for medical assistance on behalf of the resident.\nAn admission contract must not include a waiver of facility liability for the health and safety or personal property of a resident while the resident is under the facility's supervision. An admission contract must not include a provision that the facility knows or should know to be deceptive, unlawful, or unenforceable under state or federal law, nor any provision that requires or implies a lesser standard of care or responsibility than is required by law.\n(a) A facility shall make complete unsigned copies of its admission contract available to potential applicants and to the state or local long-term care ombudsman immediately upon request.\n(b) A facility shall post conspicuously within the facility, in a location accessible to public view, either a complete copy of its admission contract or notice of its availability from the facility.\n(c) An admission contract must be printed in black type of at least ten-point type size. The facility shall give a complete copy of the admission contract to the resident or the resident's legal representative promptly after it has been signed by the resident or legal representative.\n(d) An admission contract is a consumer contract under sections 325G.29 to 325G.37.\n(e) All admission contracts must state in bold capital letters the following notice to applicants for admission: \"NOTICE TO APPLICANTS FOR ADMISSION. READ YOUR ADMISSION CONTRACT. ORAL STATEMENTS OR COMMENTS MADE BY THE FACILITY OR YOU OR YOUR REPRESENTATIVE ARE NOT PART OF YOUR ADMISSION CONTRACT UNLESS THEY ARE ALSO IN WRITING. DO NOT RELY ON ORAL STATEMENTS OR COMMENTS THAT ARE NOT INCLUDED IN THE WRITTEN ADMISSION CONTRACT.\"\n(a) Before or at the time of admission, the facility shall make reasonable efforts to communicate the content of the admission contract to, and obtain on the admission contract the signature of, the person who is to be admitted to the facility and the responsible party. The admission contract must be signed by the prospective resident unless the resident is legally incompetent or cannot understand or sign the admission contract because of the resident's medical condition.\n(b) If the resident cannot sign the admission contract, the reason must be documented in the resident's medical record by the admitting physician.\n(c) If the determination under paragraph (b) has been made, the facility may request the signature of another person on behalf of the applicant, subject to the provisions of paragraph (d). The facility must not require the person to disclose any information regarding the person's personal financial assets, liabilities, or income, unless the person voluntarily chooses to become financially responsible for the resident's care. The facility must issue timely billing, respond to questions, and monitor timely payment.\n(d) A person who desires to assume financial responsibility for the resident's care may contract with the facility to do so. A person other than the resident or a financially responsible spouse who signs an admission contract must not be required by the facility to assume personal financial liability for the resident's care. However, if the responsible party has signed the admission contract and fails to make timely payment of the facility obligation, or knowingly fails to spend down the resident's assets appropriately for the purpose of obtaining medical assistance, then the responsible party shall be liable to the facility for the resident's costs of care which are not paid for by medical assistance. A responsible party shall be personally liable only to the extent the resident's income or assets were misapplied.\n(e) The admission contract must include written notice in the signature block, in bold capital letters, that a person other than the resident or financially responsible spouse may not be required by the facility to assume personal financial liability for the resident's care.\n(f) This subdivision does not preclude the facility from obtaining the signature of a legal representative, if applicable.\nAn admission contract must clearly and explicitly state whether the facility participates in the Medicare, medical assistance, or Veterans Administration programs. If the facility's participation in any of those programs is limited for any reason, the admission contract must clearly state the limitation and whether the facility is eligible to receive payment from the program for the person who is considering admission or who has been admitted to the facility.\n(a) An admission contract for a facility that is certified for participation in the medical assistance program must state that neither the prospective resident, nor anyone on the resident's behalf, is required to pay privately any amount for which the resident's care at the facility has been approved for payment by medical assistance or to make any kind of donation, voluntary or otherwise. Except as permitted under section 6015 of the Deficit Reduction Act of 2005, Public Law 109-171, an admission contract must state that the facility does not require as a condition of admission, either in its admission contract or by oral promise before signing the admission contract, that residents remain in private pay status for any period of time.\n(b) The admission contract must state that upon presentation of proof of eligibility, the facility will submit a medical assistance claim for reimbursement and will return any and all payments made by the resident, or by any person on the resident's behalf, for services covered by medical assistance, upon receipt of medical assistance payment.\n(c) A facility that participates in the medical assistance program shall not charge for the day of the resident's discharge from the facility or subsequent days.\n(d) If a facility's charges incurred by the resident are delinquent for 30 days, and no person has agreed to apply for medical assistance for the resident, the facility may petition the court under chapter 524 to appoint a representative for the resident in order to apply for medical assistance for the resident.\n(e) The remedy provided in this subdivision does not preclude a facility from seeking any other remedy available under other laws of this state.\nAn admission contract must not include a clause requiring a resident to sign a consent to all treatment ordered by any physician, advanced practice registered nurse, or physician assistant. An admission contract may require consent only for routine nursing care or emergency care. An admission contract must contain a clause that informs the resident of the right to refuse treatment.\nAn admission contract must contain a written acknowledgment that the resident has been informed of the patient's bill of rights, as required in section 144.652.\n(a) Violation of this section is grounds for issuance of a correction order, and if uncorrected, a penalty assessment issued by the commissioner of health, under section 144A.10. The civil fine for noncompliance with a correction order issued under this section is $250 per day.\n(b) Unless otherwise expressly provided, the remedies or penalties provided by this subdivision do not preclude a resident from seeking any other remedy and penalty available under other laws of this state.\nThis section applies to new admissions to facilities on and after October 1, 1989. This section does not require the execution of a new admission contract for a resident who was residing in a facility before June 1, 1989. However, provisions of the admission contract that are inconsistent with or in conflict with this section are voidable at the sole option of the resident. Residents must be given notice of the changes in admission contracts according to this section and must be given the opportunity to execute a new admission contract that conforms to this section.",
	"repealed": false
}