{
	"id": "473.604",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.604",
	"title": "473.604 MEMBERSHIP, GOVERNMENT.",
	"text": "The commission consists of:\n(1) the mayor of each of the cities, or a qualified voter appointed by the mayor, for the term of office as mayor;\n(2) eight members, appointed by the governor, one from each of the following agency districts:\n(i) district A, consisting of council districts 1 and 2;\n(ii) district B, consisting of council districts 3 and 4;\n(iii) district C, consisting of council districts 5 and 6;\n(iv) district D, consisting of council districts 7 and 8;\n(v) district E, consisting of council districts 9 and 10;\n(vi) district F, consisting of council districts 11 and 12;\n(vii) district G, consisting of council districts 13 and 14; and\n(viii) district H, consisting of council districts 15 and 16.\nEach member shall be a resident of the district represented. For appointments after June 2, 2006, a member must have resided in the district for at least six months and in the state for at least one year immediately preceding the appointment. The terms of the members from districts A, B, F, and H expire on January 1, 2007. The terms of the members from districts C, D, E, and G expire on January 5, 2009. The successors of each member must be appointed to four-year terms. Before making an appointment, the governor shall consult with each member of the legislature from the district for which the member is to be appointed, to solicit the legislator's recommendation on the appointment;\n(3) four members appointed by the governor from outside of the metropolitan area to reflect fairly the various regions and interests throughout the state that are affected by the operation of the commission's major airport and airport system. Two of these members must be residents of statutory or home rule charter cities, towns, or counties containing an airport designated by the commissioner of transportation as a key airport. The other two must be residents of statutory or home rule charter cities, towns, or counties containing an airport designated by the commissioner of transportation as an intermediate airport. The members must be appointed by the governor as follows: one for a term of one year, one for a term of two years, one for a term of three years, and one for a term of four years. All of the terms start on July 1, 1989. The successors of each member must be appointed to four-year terms commencing on the first Monday in January of each fourth year after the expiration of the original term. Before making an appointment, the governor shall consult each member of the legislature representing the municipality or county from which the member is to be appointed, to solicit the legislator's recommendation on the appointment; and\n(4) a chair appointed by the governor for a term of four years. The chair may be removed at the pleasure of the governor.\nEach mayor, or any voter appointed by the mayor instead, shall serve as a commissioner for the term of office of such mayor. The office of any commissioner who is a member of a city council or board shall become vacant when for any reason the commissioner ceases to hold the city office to which elected, and the office of any commissioner shall become vacant upon the occurrence of any event referred to in section 351.02. Except as provided in the preceding sentences of this subdivision, each commissioner shall serve until a successor is duly appointed and has qualified. Any vacancy in the office of a commissioner shall immediately be filled for the unexpired term, and in such case, or when the term of a commissioner expires, a successor shall be chosen in the same manner as was the predecessor, and the appointment shall be evidenced in the same manner.\nThe clerk, secretary, or other appropriate official of each appointing public body shall immediately file with the secretary of state a certified copy of each resolution appointing commissioners. The city clerk of each city, upon the election and qualification of each new mayor thereof, shall file with the secretary of state a certificate stating the mayor's full name and address, and that such mayor has elected to act as a commissioner, or, in the event such mayor has appointed some other qualified voter instead, shall file a certified copy of the order of the mayor appointing such commissioner. The governor shall file appointments in the same office. Each person selected as a commissioner shall thereupon file in the same office the oath of office prescribed by the state constitution, article V, section 6, subscribed by the person and certified by the officer administering the same.\nShould any of the said appointments not be made within 60 days after the commencement of the term for which it is to be made, the governor shall upon the request of the chair select and appoint such commissioners as have not been so designated. Any commissioner so appointed by the governor shall be a legal voter of the city, county, or precinct for which appointed. Upon filing the oath of office required by subdivision 3, the appointee shall have all the rights, privileges, and powers of a commissioner duly appointed as provided in subdivision 2. If thereafter any vacancy in the office of a commissioner shall not be promptly filled, the governor may upon request of the chair proceed as in this subdivision provided.\nThe commission shall meet regularly at least once each month, at such time and place as the commission shall by resolution designate. Special meetings may be held at any time upon the call of the chair or any two other members, upon written notice sent by certified mail to each member at least three days prior to the meeting, or upon such other notice as the commission may by resolution provide, or without notice if each member is present or files with the secretary a written consent to the meeting either before or after the meeting. Unless otherwise provided, any action within the authority of the commission may be taken by the affirmative vote of a majority of all the members. A majority of all of the members of the commission shall constitute a quorum, but a lesser number may meet and adjourn from time to time and compel the attendance of absent members.\nThe legislative auditor shall audit the books and accounts of the commission once each year or as often as the legislative auditor's funds and personnel permit. The commission shall pay the total cost of the audit pursuant to section 3.9741.\nMS 1994 [Repealed, 1996 c 305 art 1 s 106]",
	"repealed": false
}