{
	"id": "412.851",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.851",
	"title": "412.851 VACATION OF STREETS.",
	"text": "The council may by resolution vacate any street, alley, public grounds, public way, or any part thereof, on its own motion or on petition of a majority of the owners of land abutting on the street, alley, public grounds, public way, or part thereof to be vacated. When there has been no petition, the resolution may be adopted only by a vote of four-fifths of all members of the council. No vacation shall be made unless it appears in the interest of the public to do so after a hearing preceded by two weeks' published and posted notice. The council shall cause written notice of the hearing to be mailed to each property owner affected by the proposed vacation at least ten days before the hearing. The notice must contain, at minimum, a copy of the petition or proposed resolution as well as the time, place, and date of the hearing. In addition, if the street, alley, public grounds, public way, or any part thereof terminates at, abuts upon, or is adjacent to any public water, written notice of the petition or proposed resolution must be served by certified mail upon the commissioner of natural resources at least 60 days before the hearing on the matter. The notice to the commissioner of natural resources does not create a right of intervention by the commissioner. At least 15 days prior to convening the hearing required under this section, the council or its designee must consult with the commissioner of natural resources to review the proposed vacation. The commissioner must evaluate:\n(1) the proposed vacation and the public benefits to do so;\n(2) the present and potential use of the land for access to public waters; and\n(3) how the vacation would impact conservation of natural resources.\nThe commissioner must advise the city council or its designee accordingly upon the evaluation. After a resolution of vacation is adopted, the clerk shall prepare a notice of completion of the proceedings which shall contain the name of the city, an identification of the vacation, a statement of the time of completion thereof, and a description of the real estate and lands affected thereby. The notice shall be presented to the county auditor who shall enter the same in the transfer records and note upon the instrument, over official signature, the words \"entered in the transfer record.\" The notice shall then be recorded with the county recorder. Any failure to file the notice shall not invalidate any vacation proceedings.",
	"repealed": false
}