{
	"id": "289A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.14",
	"title": "289A.14 USE OF AUTOMATED SALES SUPPRESSION DEVICES; DEFINITIONS.",
	"text": "(a) For the purposes of sections 289A.60, subdivision 32, 289A.63, subdivision 12, and 609.5316, subdivision 3, the following terms have the meanings given.\n(b) \"Automated sales suppression device\" or \"zapper\" means a software program, carried on any tangible medium, or accessed through any other means, that falsifies the electronic records of electronic cash registers and other point-of-sale systems including, but not limited to, transaction data and transaction reports.\n(c) \"Electronic cash register\" means a device that keeps a register or supporting documents through the means of an electronic device or computer system designed to record transaction data for the purpose of computing, compiling, or processing retail sales transaction data in whatever manner.\n(d) \"Phantom-ware\" means hidden preinstalled or later-installed programming option embedded in the operating system of an electronic cash register or hardwired into the electronic cash register that can be used to create a virtual second electronic cash register or may eliminate or manipulate transaction records that may or may not be preserved in digital formats to represent the true or manipulated record of transactions in the electronic cash register.\n(e) \"Transaction data\" includes items purchased by a customer, the price of each item, the taxability determination for each item, a segregated tax amount for each of the taxed items, the date and time of the purchase, the name, address, and identification number of the vendor, and the receipt or invoice number of the transaction.\n(f) \"Transaction report\" means a report documenting, but not limited to, the sales, taxes collected, media totals, and discount voids at an electronic cash register that is printed on cash register tape at the end of a day or shift, or a report documenting every action at an electronic cash register that is stored electronically.",
	"repealed": false
}