{
	"id": "342.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.04",
	"title": "342.04 STUDIES; REPORTS.",
	"text": "(a) The office shall conduct a study to determine the expected size and growth of the regulated cannabis industry and hemp consumer industry, including an estimate of the demand for cannabis flower and cannabis products, the number and geographic distribution of cannabis businesses needed to meet that demand, and the anticipated business from residents of other states.\n(b) The office shall conduct a study to determine the size of the illicit cannabis market, the sources of illicit cannabis flower and illicit cannabis products in the state, the locations of citations issued and arrests made for cannabis offenses, and the subareas, such as census tracts or neighborhoods, that experience a disproportionately large amount of cannabis enforcement.\n(c) The office shall conduct a study on impaired driving to determine:\n(1) the number of accidents involving one or more drivers who admitted to using cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products, or who tested positive for cannabis or tetrahydrocannabinol;\n(2) the number of arrests of individuals for impaired driving in which the individual tested positive for cannabis or tetrahydrocannabinol; and\n(3) the number of convictions for driving under the influence of cannabis flower, cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or tetrahydrocannabinol.\n(d) The office shall provide preliminary reports on the studies conducted pursuant to paragraphs (a) to (c) to the legislature by January 15, 2024, and shall provide final reports to the legislature by January 15, 2025. The reports may be consolidated into a single report by the office.\n(e) The office shall collect existing data from the Department of Human Services, Department of Health, Minnesota state courts, and hospitals licensed under chapter 144 on the utilization of mental health and substance use disorder services, emergency room visits, and commitments to identify any increase in the services provided or any increase in the number of visits or commitments. The office shall also obtain summary data from existing first episode psychosis programs on the number of persons served by the programs and number of persons on the waiting list. All information collected by the office under this paragraph shall be included in the report required under paragraph (f).\n(f) The office shall conduct an annual market analysis on the status of the regulated cannabis industry and submit a report of the findings. The office shall submit the report by January 15, 2025, and each January 15 thereafter and the report may be combined with the annual report submitted by the office. The process of completing the market analysis must include holding public meetings to solicit the input of consumers, market stakeholders, and potential new applicants and must include an assessment as to whether the office has issued the necessary number of licenses in order to:\n(1) ensure the sufficient supply of cannabis flower and cannabis products to meet demand;\n(2) provide market stability;\n(3) ensure a competitive market; and\n(4) limit the sale of unregulated cannabis flower and cannabis products.\n(g) The office shall submit an annual report to the legislature by January 15, 2024, and each January 15 thereafter. The annual report shall include but not be limited to the following:\n(1) the status of the regulated cannabis industry;\n(2) the status of the illicit cannabis market and hemp consumer industry;\n(3) the number of accidents, arrests, and convictions involving drivers who admitted to using cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products or who tested positive for cannabis or tetrahydrocannabinol;\n(4) the change in potency, if any, of cannabis flower and cannabis products available through the regulated market;\n(5) progress on providing opportunities to individuals and communities that experienced a disproportionate, negative impact from cannabis prohibition, including but not limited to providing relief from criminal convictions and increasing economic opportunities;\n(6) the status of racial and geographic diversity in the cannabis industry;\n(7) proposed legislative changes, including but not limited to recommendations to streamline licensing systems and related administrative processes;\n(8) information on the adverse effects of second-hand smoke from any cannabis flower, cannabis products, and hemp-derived consumer products that are consumed by the combustion or vaporization of the product and the inhalation of smoke, aerosol, or vapor from the product; and\n(9) recommendations for the levels of funding for:\n(i) a coordinated education program to address and raise public awareness about the top three adverse health effects, as determined by the commissioner of health, associated with the use of cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products by individuals under 21 years of age;\n(ii) a coordinated education program to educate pregnant individuals, breastfeeding individuals, and individuals who may become pregnant on the adverse health effects of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products;\n(iii) training, technical assistance, and educational materials for home visiting programs, Tribal home visiting programs, and child welfare workers regarding safe and unsafe use of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products in homes with infants and young children;\n(iv) model programs to educate middle school and high school students on the health effects on children and adolescents of the use of cannabis flower, cannabis products, lower-potency hemp edibles, hemp-derived consumer products, and other intoxicating or controlled substances;\n(v) grants issued through the CanTrain, CanNavigate, CanStartup, and CanGrow programs;\n(vi) grants to organizations for community development in social equity communities through the CanRenew program;\n(vii) training of peace officers and law enforcement agencies on changes to laws involving cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products and the law's impact on searches and seizures;\n(viii) training of peace officers to increase the number of drug recognition experts;\n(ix) training of peace officers on the cultural uses of sage and distinguishing use of sage from the use of cannabis flower, including whether the Board of Peace Officer Standards and Training should approve or develop training materials;\n(x) the retirement and replacement of drug detection canines; and\n(xi) the Department of Human Services and county social service agencies to address any increase in demand for services.\n(g) In developing the recommended funding levels under paragraph (f), clause (9), items (vii) to (xi), the office shall consult with local law enforcement agencies, the Minnesota Chiefs of Police Association, the Minnesota Sheriff's Association, the League of Minnesota Cities, the Association of Minnesota Counties, and county social services agencies.",
	"repealed": false
}