{
	"id": "171.182",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.182",
	"title": "171.182 SUSPENSION; UNINSURED VEHICLE.",
	"text": "For the purposes of sections 171.182 to 171.184, the term \"judgment\" means a judgment which has become final by expiration without appeal within the time which an appeal might have been perfected, or by final affirmation on appeal, rendered by a court of competent jurisdiction, including county, municipal, or conciliation court, of any state of the United States, upon a claim for relief arising out of ownership, maintenance, or use of a motor vehicle, for damages, including damages for care and loss of services, because of bodily injury to or death of a person, or for damages because of injury to or destruction of property, including the loss of use thereof, or upon a claim for relief on an agreement of settlement for the damages.\nIf a person fails within 30 days to satisfy a judgment, the court administrator, upon affidavit of the judgment creditor that the judgment has not been satisfied, shall immediately notify the commissioner that the judgment has not been satisfied.\nIf the judgment debtor named in a judgment reported to the commissioner is a nonresident, the commissioner shall notify the official in charge of the issuance of drivers' licenses of the state of which the judgment debtor is a resident.\n(a) The commissioner, upon notification of a judgment, shall suspend the license or the nonresident's operating privilege of the person against whom judgment was rendered if:\n(1) at the time of the accident the person did not maintain the reparation security required by section 65B.48; and\n(2) the judgment has not been satisfied.\n(b) Suspensions under this section are subject to the notice requirements of section 171.18, subdivision 2.\nA license or nonresident's operating privilege shall remain suspended and shall not be renewed, nor shall a license be thereafter issued to the person until every judgment is satisfied in full, or has expired, or to the extent hereinafter provided.\nA person whose license or nonresident's operating privileges has been suspended or has become subject to suspension because of an unsatisfied judgment may be relieved of the suspension by filing with the commissioner an affidavit stating that at the time of the accident giving rise to the judgment the person was insured, that the insurer is liable for the judgment, and the reason, if known, why the judgment has not been paid. The affidavit shall be accompanied by a copy of the insurance policy and other documents the commissioner requires to show that the loss, injury or damage giving rise to the judgment was covered by the policy. If satisfied that the insurer was authorized to issue the policy and is liable for the judgment, at least to the extent and for the amounts required in this chapter, the commissioner shall not suspend the license, or reinstate the license if already suspended.",
	"repealed": false
}