{
	"id": "142G.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.70",
	"title": "142G.70 SANCTIONS.",
	"text": "(a) A participant who fails without good cause under section 142G.71 to comply with the requirements for orientation under section 142G.27, or employment and training services under sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71, and who is not subject to a sanction under subdivision 2, shall be subject to a sanction or case closure as provided in this section. Good cause may only be granted for the month for which the good cause reason applies. Prior to the imposition of a sanction, a county agency shall provide a notice of intent to sanction under section 142G.71, subdivision 2, and, when applicable, a notice of adverse action as provided in section 142G.21, subdivision 5.\n(b) A sanction under this subdivision becomes effective the month following the month in which a required notice is given. A sanction must not be imposed when a participant comes into compliance prior to the effective date of the sanction. For purposes of this subdivision, each month that a participant fails to comply with a requirement of this chapter shall be considered a separate occurrence of noncompliance. If both participants in a two-parent assistance unit are out of compliance at the same time, it is considered one occurrence of noncompliance.\n(c) Sanctions for noncompliance for the first, second, third, fourth, fifth, or sixth consecutive occurrence of noncompliance by a participant in an assistance unit are equal to a reduction of five percent of the cash portion of the MFIP grant received by the assistance unit. The reduction in the grant amount must be in effect for a minimum of one month and shall be removed in the month following the month that the participant in a one-parent assistance unit returns to compliance, unless the requirements in paragraph (h) are met. In a two-parent assistance unit, the grant reduction must be in effect for a minimum of one month and shall be removed in the month following the month both participants return to compliance, unless the requirements in paragraph (h) are met. When an assistance unit comes into compliance with the requirements in section 518A.81, or shows good cause under section 518A.81, subdivision 10, or 142G.71, the sanction occurrences for that assistance unit shall be equal to zero sanctions. If an assistance unit is sanctioned under this clause, the participant's case file must be reviewed to determine if the employment plan is still appropriate.\n(d) For a seventh consecutive occurrence of noncompliance by a participant in an assistance unit, the county agency shall close the MFIP assistance unit's financial assistance case, including the cash and food portions, and redetermine the family's eligibility for Supplemental Nutrition Assistance Program (SNAP) payments. The MFIP case must remain closed for a minimum of one full month. Before the case is closed, the county agency must review the participant's case to determine if the employment plan is still appropriate and attempt to meet with the participant face-to-face. The participant may bring an advocate to the face-to-face meeting. If a face-to-face meeting is not conducted, the county agency must send the participant a written notice that includes the information required under clause (1).\n(1) During the face-to-face meeting, the county agency must:\n(i) determine whether the continued noncompliance can be explained and mitigated by providing a needed preemployment activity, as defined in section 142G.50, subdivision 11, paragraph (a), clause (9);\n(ii) determine whether the participant qualifies for a good cause exception under section 142G.71, or if the sanction is for noncooperation with child support requirements, determine if the participant qualifies for a good cause exemption under section 518A.81, subdivision 10;\n(iii) determine whether the work activities in the employment plan are appropriate based on the criteria in section 142G.56, subdivision 2 or 3;\n(iv) determine whether the participant qualifies for the family violence waiver;\n(v) inform the participant of the participant's sanction status and explain the consequences of continuing noncompliance;\n(vi) identify other resources that may be available to the participant to meet the needs of the family; and\n(vii) inform the participant of the right to appeal under section 142G.45.\n(2) If the lack of an identified activity or service can explain the noncompliance, the county must work with the participant to provide the identified activity.\n(3) The grant must be restored to the full amount for which the assistance unit is eligible retroactively to the first day of the month in which the participant was found to lack preemployment activities or to qualify for a family violence waiver or for a good cause exemption under section 518A.81, subdivision 10, or 142G.71.\n(e) For the purpose of applying sanctions under this section, only consecutive occurrences of noncompliance that occur on or after May 1, 2026, shall be considered when counting the number of sanction occurrences under this subdivision. Active cases under sanction on May 1, 2026, shall be considered to have one sanction occurrence. If the participant comes into compliance, the assistance unit is considered to have zero sanctions.\n(f) An assistance unit whose case is closed under paragraph (d) or (g), may reapply for MFIP using a form prescribed by the commissioner and shall be eligible if the participant complies with MFIP program requirements and demonstrates compliance for up to one month. No assistance shall be paid during this period. The county agency shall not start a new certification period for a participant who has submitted the reapplication form within 30 calendar days of case closure. The county agency must process the form according to section 256P.04, except that the county agency shall not require additional verification of information in the case file unless the information is inaccurate, questionable, or no longer current. If a participant does not reapply for MFIP within 30 calendar days of case closure, a new application must be completed.\n(g) An assistance unit whose case has been closed for noncompliance that reapplies under paragraph (f) is subject to sanction under paragraph (c) and case closure under paragraph (d).\n(h) If an assistance unit is in compliance by the 15th of the month in which the assistance unit has a sanction imposed, the reduction to the assistance unit's cash grant shall be restored retroactively for the current month and the sanction occurrences shall be equal to zero.\n[See Note.]\nThe grant of an MFIP caregiver who refuses to cooperate, as determined by the child support enforcement agency, with support requirements under section 518A.81, shall be subject to sanction as specified in this subdivision and subdivision 1, paragraphs (b) to (h), except the assistance unit's cash portion of the grant must be reduced by 25 percent of the MFIP cash received by the assistance unit. The residual amount of the grant, if any, must be paid to the caregiver. A sanction under this subdivision becomes effective the first month following the month in which a required notice is given. A sanction must not be imposed when a caregiver comes into compliance with the requirements under section 518A.81 prior to the effective date of the sanction. The sanction shall be removed in the month following the month that the caregiver cooperates with the support requirements, unless the requirements in subdivision 1, paragraph (h), are met. Each month that an MFIP caregiver fails to comply with the requirements of section 518A.81 must be considered a separate occurrence of noncompliance for the purpose of applying sanctions under subdivision 1, paragraphs (c) and (d).\n[See Note.]\n(a) Notwithstanding the provisions of subdivisions 1 and 2, for a participant subject to a sanction for refusal to comply with child support requirements under subdivision 2 and subject to a concurrent sanction for refusal to cooperate with other program requirements under subdivision 1, sanctions shall be imposed in the manner prescribed in this subdivision.\n(b) A participant who becomes subject to sanction under both subdivisions 1 and 2 in the same month is subject to sanction as follows:\n(1) in the first month of noncompliance and noncooperation, the participant's cash portion of the grant must be reduced by 25 percent of the MFIP cash received by the assistance unit, with any residual amount paid to the participant;\n(2) in the second and subsequent months of noncompliance and noncooperation, the participant shall be subject to the applicable level of sanction under subdivision 2.\nThe requirement that the county conduct a review as specified in subdivision 1, paragraph (d), remains in effect.\n(c) A participant remains subject to sanction under subdivision 2 if the participant:\n(1) returns to compliance and is no longer subject to sanction for noncompliance with section 142G.27 or sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71; or\n(2) has the sanction for noncompliance with section 142G.27 or sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71 removed upon completion of the review under subdivision 1, paragraph (d).\nA participant remains subject to the applicable level of sanction under subdivision 1 if the participant cooperates and is no longer subject to sanction under subdivision 2.\n[See Note.]\nA participant shall not be sanctioned for failure to meet the agreed-upon hours in a participant's employment plan under section 142G.56, subdivision 2, when the participant fails to meet the agreed-upon hours of participation in paid employment because the participant is not eligible for holiday pay and the participant's place of employment is closed for a holiday.",
	"repealed": false
}