{
	"id": "204C.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.21",
	"title": "204C.21 COUNTING BALLOTS; PILING SYSTEM.",
	"text": "The election judges shall take all the ballots of the same kind and count the votes cast for each office or question, beginning with the first office or question on the ballot. They shall make one pile of the ballots for each candidate who received votes for that office, or one pile for the \"Yes\" votes and one pile for the \"No\" votes on a question. They shall make a pile of totally defective ballots and a pile of totally blank ballots. They shall make a pile of ballots that are not totally defective but are defective with respect to the office or question being counted and a pile of ballots that are not totally blank but are blank with respect to the office or question being counted. After the separation into piles, the election judges shall examine each pile and remove and place in the proper pile any ballots that are found in the wrong pile. The election judges shall count the totally blank and totally defective ballots and set them aside until the counting is over for that ballot. In conducting the count of blank ballots, election judges may presume that the total count provided for sealed prepackaged ballots is correct. The election judges may pile ballots crosswise in groups of 25 in the same pile to facilitate counting. When their counts agree, the election judges shall announce the number of ballots in each pile, and shall write the number in the proper place on the summary statements.\nThe election judges shall then return all the counted ballots, and all the partially defective or partially blank ballots, to the original pile to be separated and counted in the same manner for the next office or question.\nWhere more than one candidate is to be elected to an office, the votes for that office shall be counted and canvassed in the manner provided in subdivision 1 as far as practicable.\nAt a primary the election judges shall first separate the partisan ballots by major political party and then count the votes for each office as provided in subdivision 1. The nonpartisan primary ballots shall be counted separately after the partisan primary ballots have been counted.",
	"repealed": false
}