{
	"id": "552.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/552.06",
	"title": "552.06 SUMMARY EXECUTION OF SUPPORT JUDGMENT UPON FUNDS AT A FINANCIAL INSTITUTION.",
	"text": "(a) This section applies to a judgment debtor who is in arrears in court-ordered support payments in an amount equal to or greater than five times the judgment debtor's total support order.\n(b) Section 518A.46 applies to this section, except if it conflicts with the specific provisions of this section, this section applies.\n(c) Time frames set out in the Rules of Civil Procedure that are inconsistent with this section do not apply to this section.\n(d) The public authority may not proceed with a summary execution of support judgment proceeding:\n(1) if the judgment debtor is in compliance with a previously executed written payment agreement approved by the public authority or the court; and\n(2) until after the judgment has been submitted for federal or state tax intercept.\n(e) Upon receipt of information under section 13B.06 that a judgment debtor holds an account at the financial institution, the public authority may send the financial institution a notice of support judgment levy.\n(f) The support judgment levy and accompanying documentation must contain the name of the judgment debtor, the judgment debtor's Social Security number, any necessary verifying information, the amount of the judgment, and the procedures necessary for the financial institution to process the notice of support judgment levy and complete the disclosure form.\n(g) Notice of support judgment levy under this section commences without notice to the judgment debtor and without the need for prior judicial notice or hearing.\n(h) Within three business days after the public authority sends the notice of support judgment levy to the financial institution, the public authority shall send the judgment debtor a copy of the notice of support judgment levy by first class mail at the judgment debtor's last known address. In addition to the copy of the notice of support judgment levy, information must be provided that describes the exemptions a judgment debtor may claim and the form and procedure for claiming an exemption, the informal resolution process, the responsibilities of the judgment debtor, and the procedure and time frames to contest the levy.\n(a) Upon receipt by the financial institution of a notice of support judgment levy, the financial institution shall seize all funds up to and including the amount contained in the notice from the judgment debtor's account.\n(b) Forty-five days after receiving the levy, the financial institution shall complete the notice of support judgment levy and disclosure form and forward it together with the amount indicated on line 8 of the disclosure form, not to exceed the total amount seized, to the public authority at the address indicated in the notice of support judgment levy.\n(c) When the judgment debtor and the public authority informally resolve a dispute under subdivision 3 and the public authority sends a notice of release to the financial institution, the financial institution shall release seized funds in accordance with the notice of release.\n(d) If the financial institution receives notice of a contest of the summary execution of support judgment, the financial institution shall continue to hold the funds during the period of contest inclusive of any applicable appeal period and, upon receipt of notice to release from the public authority, shall send the lesser of the amount indicated in the notice of release, or the amount indicated on line 8 of the notice of support judgment levy and disclosure form not to exceed the total amount seized.\n(e) If a judgment debtor has multiple accounts within the financial institution, the financial institution shall seize funds in as many accounts of the judgment debtor as is necessary to equal the amount contained in the notice of support judgment levy.\n(f) A financial institution that receives more than one notice of support judgment levy under this section shall withhold sufficient funds to satisfy all notices of support judgment levy, if possible.\n(g) The Consumer Credit Protection Act, United States Code, title 15, section 1673(b), does not apply to funds withheld by a financial institution under this section.\n(h) The public authority shall pay a fee of $15 per levy to the financial institution. Financial institutions and the commissioner of children, youth, and families shall establish procedures to automate the payment of this fee to the maximum extent possible. The fee may be recovered by the public authority from the judgment debtor as an allowable cost.\n(i) No financial institution is liable for damages for complying with this section. The financial institution may rely on the date of mailing or delivery of a notice to it in computing any time periods in this section.\n(a) After the judgment debtor receives a notice of support judgment levy, the judgment debtor may contact the public authority with information regarding a mistake of fact or claim of exemption. In the event the matter is resolved, the public authority shall contact the financial institution and forward to the financial institution a notice of release regarding the appropriate transfer of funds and send a copy to the judgment debtor.\n(b) Contact by the judgment debtor under this subdivision does not constitute a contest to the levy under subdivision 5. The time frame to contest the support judgment levy under subdivision 5 is not stayed while the judgment debtor contacts the public authority. The judgment debtor may contest the levy under subdivision 5.\n(a) If a judgment debtor serves the public authority with a notice of motion and motion under subdivision 5, the public authority shall immediately notify:\n(1) the financial institution, directing the financial institution to continue holding the funds pending resolution of the matter; and\n(2) the obligee, by mailing by first class mail a copy of the notice of motion and motion.\n(b) Upon final resolution of the matter, including the applicable appeal times, the public authority shall forward to the financial institution a notice of release regarding the appropriate transfer of funds.\n(c) Funds received by the public authority must be applied to the judgment identified in the support judgment levy notice in compliance with federal regulations.\n(d) In the event that multiple notices result in an amount of seized funds that is insufficient to satisfy all of the support judgment levies, the public authority shall distribute funds to satisfy each support judgment levy in the order in which they were sent to the financial institution.\n(a) Process to claim exemption. If the judgment debtor elects to claim an exemption, the judgment debtor shall complete the applicable portion of the exemption form, sign it under penalty of perjury, and deliver one copy to the public authority within 20 calendar days of the date postmarked on the correspondence mailed to the judgment debtor. Failure of the judgment debtor to deliver the executed exemption does not constitute a waiver of any claimed right to an exemption. Upon timely receipt of a claim of exemption by the public authority, funds not claimed to be exempt by the judgment debtor remain subject to the support judgment levy. If a claim of exemption is resolved informally, the public authority shall proceed according to subdivision 3.\n(b) Process to contest. (1) The judgment debtor may contest a support judgment levy on the limited grounds that the seizure or the amount seized is improper due to mistake of fact or that the funds held in the account are exempt from levy for child support purposes under state or federal law.\n(2) If the judgment debtor chooses to contest the withholding, within 30 calendar days of notice of support judgment levy, the debtor shall:\n(i) file a motion with the court administrator, including in the motion the alleged mistake of fact or the basis for any claim that the funds are exempted from withholding;\n(ii) obtain a hearing date from the court administrator; and\n(iii) serve the public authority, either personally or by fax, with a copy of the notice of motion and motion no later than two business days after obtaining a hearing date.\n(c) Hearing. The hearing date shall be set at the earliest practicable time, but the matter must be heard no later than ten calendar days from the date a request for hearing is made. The court administrator shall schedule these matters to be heard in the expedited process before a child support magistrate, but may schedule these cases in district court if the availability of child support magistrate does not permit a hearing to occur within the time frames of this section.\nThe state court administrator's office shall prepare and make available to the court administrators and judgment debtors a form to be submitted by the judgment debtor in support of a motion to contest the support judgment levy under this section.",
	"repealed": false
}