{
	"id": "62J.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.88",
	"title": "62J.88 PRESCRIPTION DRUG AFFORDABILITY ADVISORY COUNCIL.",
	"text": "The governor shall appoint a 18-member stakeholder advisory council to provide advice to the board on drug cost issues and to represent stakeholders' views. The governor shall appoint the members of the advisory council based on the members' knowledge and demonstrated expertise in one or more of the following areas: the pharmaceutical business; practice of medicine; patient perspectives; health care cost trends and drivers; clinical and health services research; and the health care marketplace.\nThe council's membership shall consist of the following:\n(1) two members representing patients and health care consumers;\n(2) two members representing health care providers;\n(3) one member representing health plan companies;\n(4) two members representing employers, with one member representing large employers and one member representing small employers;\n(5) one member representing government employee benefit plans;\n(6) one member representing pharmaceutical manufacturers;\n(7) one member who is a health services clinical researcher;\n(8) one member who is a pharmacologist;\n(9) one member representing the commissioner of health with expertise in health economics;\n(10) one member representing pharmaceutical wholesalers;\n(11) one member representing pharmacy benefit managers;\n(12) one member from the Rare Disease Advisory Council;\n(13) one member representing generic drug manufacturers;\n(14) one member representing pharmaceutical distributors; and\n(15) one member who is an oncologist who is not employed by, under contract with, or otherwise affiliated with a hospital.\n(a) The initial appointments to the advisory council must be made by January 1, 2024. The initial appointed advisory council members shall serve staggered terms of two, three, or four years, determined by lot by the secretary of state. Following the initial appointments, the advisory council members shall serve four-year terms.\n(b) Removal and vacancies of advisory council members shall be governed by section 15.059.\nAdvisory council members may be compensated according to section 15.059, except that those advisory council members designated in subdivision 2, clauses (10) to (15), must not be compensated.\nMeetings of the advisory council are subject to chapter 13D. The advisory council shall meet publicly at least every three months to advise the board on drug cost issues related to the prescription drug product information submitted to the board under section 62J.90.\nNotwithstanding section 15.059, the advisory council shall not expire.",
	"repealed": false
}