{
	"id": "471.9981",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.9981",
	"title": "471.9981 COUNTIES AND CITIES; PAY EQUITY COMPLIANCE.",
	"text": "MS 2008 [Repealed, 2009 c 101 art 2 s 110]\nMS 1988 [Repealed, 1990 c 512 s 13]\nMS 1988 [Repealed, 1990 c 512 s 13]\nMS 1988 [Repealed, 1990 c 512 s 13]\nMS 1988 [Repealed, 1990 c 512 s 13]\nBy January 31, 1992, each political subdivision shall submit to the commissioner an implementation report that includes the following information as of December 31, 1991:\n(1) a list of all job classes in the political subdivision;\n(2) the number of employees in each class;\n(3) the number of female employees in each class;\n(4) an identification of each class as male-dominated, female-dominated, or balanced as defined in section 471.991;\n(5) the comparable work value of each class as determined by the job evaluation used by the subdivision in accordance with section 471.994;\n(6) the minimum and maximum salary for each class, if salary ranges have been established, and the amount of time in employment required to qualify for the maximum;\n(7) any additional cash compensation, such as bonuses or lump-sum payments, paid to the members of a class; and\n(8) any other information requested by the commissioner.\nIf a subdivision fails to submit a report, the commissioner shall find the subdivision not in compliance with subdivision 6 and shall impose the penalty prescribed by that subdivision.\nThe implementation report required by subdivision 5a is public data governed by chapter 13.\n(a) The commissioner of management and budget shall review the implementation report submitted by a governmental subdivision to determine whether the subdivision has established equitable compensation relationships as required by section 471.992, subdivision 1, by December 31, 1991, or the later date approved by the commissioner. The commissioner shall notify a subdivision found to have achieved compliance with section 471.992, subdivision 1.\n(b) If the commissioner finds that the subdivision is not in compliance based on the information contained in the implementation report required by section 471.9981, subdivision 5a, the commissioner shall notify the subdivision of the basis for the finding. The notice must include a detailed description of the basis for the finding, specific recommended actions to achieve compliance, and an estimated cost of compliance. If the subdivision disagrees with the finding, it shall notify the commissioner, who shall provide a specified time period in which to submit additional evidence in support of its claim that it is in compliance. The commissioner shall consider at least the following additional information in reconsidering whether the subdivision is in compliance:\n(1) recruitment difficulties;\n(2) retention difficulties;\n(3) recent arbitration awards that are inconsistent with equitable compensation relationships; and\n(4) information that can demonstrate a good faith effort to achieve compliance and continued progress toward compliance, including any constraints the subdivision faces.\nThe subdivision shall also present a plan for achieving compliance and a date for additional review by the commissioner.\n(c) If the subdivision does not make the changes to achieve compliance within a reasonable time set by the commissioner, the commissioner shall notify the subdivision and the commissioner of revenue that the subdivision is subject to a five percent reduction in the aid that would otherwise be payable to that governmental subdivision under section 126C.13, 273.1398, or sections 477A.011 to 477A.014, or to a fine of $100 a day, whichever is greatest. The commissioner of revenue shall enforce the penalty beginning in calendar year 1992 or in the first calendar year beginning after the date for implementation of the plan of a governmental subdivision for which the commissioner of employee relations has approved an implementation date later than December 31, 1991. However, the commissioner of revenue may not enforce a penalty until after the end of the first regular legislative session after a report listing the subdivision as not in compliance has been submitted to the legislature under section 471.999. The penalty remains in effect until the subdivision achieves compliance. The commissioner of management and budget may suspend the penalty upon making a finding that the failure to implement was attributable to circumstances beyond the control of the governmental subdivision or to severe hardship, or that noncompliance results from factors unrelated to the sex of the members dominating the affected classes and that the subdivision is taking substantial steps to achieve compliance to the extent possible.\nA governmental subdivision may appeal the imposition of a penalty under subdivision 6 by filing a notice of appeal with the commissioner of management and budget within 30 days of the commissioner's notification to the subdivision of the penalty. An appeal must be heard as a contested case under sections 14.57 to 14.62. No penalty may be imposed while an appeal is pending.",
	"repealed": false
}