{
	"id": "60B.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.21",
	"title": "60B.21 LIQUIDATION ORDERS.",
	"text": "An order to liquidate the business of a domestic insurer shall appoint the commissioner and successors in office liquidator and shall direct the liquidator forthwith to take possession of the assets of the insurer and to administer them under the orders of the court. The liquidator shall be vested by operation of law with the title to all of the property, contracts, and rights of action and all of the books and records of the insurer ordered liquidated, wherever located, as of the date of the filing of the petition for liquidation. The commissioner may recover and reduce the same to possession except that ancillary receivers in reciprocal states shall have, as to assets located in their respective states, the rights and powers which are prescribed in section 60B.55, subdivision 3, for ancillary receivers appointed in this state as to assets located in this state. The recording of the order with any county recorder in this state imparts the same notice as a deed, bill of sale, or other evidence of title duly recorded with that county recorder.\nUpon issuance of the order, the rights and liabilities of any such insurer and of its creditors, policyholders, shareholders, members, and all other persons interested in its estate are fixed as of the date of filing of the petition for liquidation, except as provided in sections 60B.22, 60B.25, clause (22), and 60B.39.\nAn order to liquidate the business of an alien insurer domiciled in this state shall be in the same terms and have the same legal effect as an order to liquidate a domestic insurer, except that the assets and the business in the United States shall be the only assets and business included under the order.\nAt the time of petitioning for an order of liquidation, or at any time thereafter, the commissioner may petition the court to declare the insurer insolvent, and after such notice and hearing as it deems proper, the court may make the declaration.",
	"repealed": false
}