{
	"id": "223.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.26",
	"title": "223.26 GRAIN INDEMNITY OPT OUT.",
	"text": "(a) A producer that has paid a grain indemnity premium under section 223.25 may receive a refund of that premium from the grain indemnity account by submitting a written demand for a refund to the commissioner, delivered personally or by first-class mail within 12 months after the producer paid the grain indemnity premium.\n(b) The commissioner must prepare a distributable flyer explaining how a producer can opt out of the grain indemnity program and must post the flyer on the Department of Agriculture website. A licensed business must make the flyers available for anyone visiting the licensed business.\n(c) A producer must submit a demand for a refund of a grain indemnity premium under paragraph (a) on a demand for refund form developed by the commissioner. The commissioner must make the form available to a licensee, producer, or member of the public upon request.\n(d) If a producer is entitled to a refund of a grain indemnity premium under this section, the commissioner must pay the refund within 90 days of receiving the demand for a refund. If the grain indemnity account balance is insufficient to pay refunds under this subdivision and valid claims exist, the commissioner must issue refunds for grain indemnity premium payments before issuing payments to claimants once money is deposited into the grain indemnity account.\n(e) If the commissioner announces grain indemnity premiums as required under section 223.25, subdivision 3, by June 30, the commissioner must send a notice to each producer who requested a refund of a grain indemnity premium during the previous three fiscal years. The notice must inform the producer of the deadline for and method of submitting a demand for a refund to the commissioner under paragraphs (a) and (c) and the method for reentering the grain indemnity program under paragraph (f).\n(f) A producer that receives a refund of a grain indemnity premium under paragraph (a) is not entitled to participate in the grain indemnity program or to receive any payment under this section unless the producer reenters the grain indemnity program by meeting all of the following conditions:\n(1) the producer must submit a request for reentry into the grain indemnity program to the commissioner. The producer must submit the request on the form required by the commissioner and must deliver the request to the commissioner;\n(2) the producer's request must be approved by the commissioner; and\n(3) the producer must pay into the grain indemnity account all grain indemnity premiums that were refunded to the producer and interest on the refunds as determined by the commissioner.\n(g) A producer that reenters the grain indemnity program under paragraph (f) is eligible to be reimbursed for claims under the grain indemnity program for any breach of contract that occurs at least 120 days after reentry.\n(h) A producer is not eligible for a refund of a grain indemnity premium under this section if the producer has received payment from the grain indemnity account for a valid claim within the preceding 36 months.",
	"repealed": false
}