{
	"id": "62D.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.115",
	"title": "62D.115 QUALITY OF CARE COMPLAINTS.",
	"text": "For purposes of this section, \"quality of care complaint\" means an expressed dissatisfaction regarding health care services resulting in potential or actual harm to an enrollee. Quality of care complaints may include the following, to the extent that they affect the clinical quality of health care services rendered: access; provider and staff competence; clinical appropriateness of care; communications; behavior; facility and environmental considerations; and other factors that could impact the quality of health care services.\n(a) Each health maintenance organization shall develop and implement a quality of care complaint investigation process that meets the requirements of this section. The process must include a written policy and procedures for the receipt, investigation, and follow-up of quality of care complaints, that includes the requirements in paragraphs (b) to (h).\n(b) A health maintenance organization's definition for quality of care complaints must include the concerns identified in subdivision 1.\n(c) A health maintenance organization must include a description of each quality of care complaint level of severity, including:\n(1) classification of complaints that warrant peer protection confidentiality as defined by the commissioner in paragraph (h); and\n(2) investigation procedures for each level of severity.\n(d) Any complaint with an allegation regarding quality of care or service must be investigated by the health maintenance organization. Documentation must show that each allegation has been addressed.\n(e) Conclusions of each investigation must be supported with evidence that may include an associated corrective action plan implemented and documented and a formal response from a provider to the health maintenance organization if a formal response was submitted to the health maintenance organization. The record of investigation must include all related documents, correspondence, summaries, discussions, consultation, and conferences held.\n(f) A medical director review shall be conducted as part of the investigation process when there is potential for patient harm.\n(g) Each quality of care complaint received by a health maintenance organization must be tracked and trended for review by the health maintenance organization according to provider type and the following type of quality of care issue: behavior, facility, environmental, or technical competence.\n(h) The commissioner, in consultation with interested stakeholders, shall define complaints that are subject to peer protection confidentiality in accordance with state and federal law by January 1, 2018.\nEach health maintenance organization shall submit to the commissioner, as part of the company's annual filing, data on the number of complaints and the category as defined by the commissioner as required under section 62D.08, subdivision 3, clause (f).\nEach health maintenance organization shall maintain records of all quality of care complaints and their resolution and retain those records for five years. Notwithstanding section 145.64, information provided to the commissioner according to this subdivision is classified as confidential data on individuals or protected nonpublic data as defined in section 13.02, subdivision 3 or 13.\nThis section does not apply to quality of care complaints received by a health maintenance organization from an enrollee who is covered under a public health care program administered by the commissioner of human services under chapter 256B or 256L.",
	"repealed": false
}