{
	"id": "137.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.47",
	"title": "137.47 FETAL TISSUE RESEARCH.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Aborted fetal tissue\" means fetal tissue that is available as a result of an elective abortion.\n(c) \"Fetal tissue\" means any body part, organ, or cell of an unborn human child. Fetal tissue does not include tissue or cells obtained from a placenta, umbilical cord, or amniotic fluid.\n(d) \"Institutional Review Board\" or \"IRB\" means the University of Minnesota's Institutional Review Board, the primary unit responsible for oversight of human subjects research protections.\n(e) \"Fetal Tissue Research Committee\" or \"FTR\" means an oversight committee at the University of Minnesota with the responsibility to oversee, review, and approve or deny research using fetal tissue.\n(f) \"Non-aborted fetal tissue\" means fetal tissue that is available as a result of a miscarriage or stillbirth, or fetal tissue from a living unborn child.\n(g) \"Research\" means systematic investigation, including development, testing, and evaluation, designed to develop or contribute to generalizable knowledge. Research does not include a procedure or test administered to a particular patient by a physician for medical purposes.\n(a) A researcher at the University of Minnesota must obtain approval from the FTR before conducting research using fetal tissue. The FTR must consider whether alternatives to fetal tissue would be sufficient for the research. If the proposed research involves aborted fetal tissue, the researcher must provide a written narrative justifying the use of aborted fetal tissue and discussing whether alternatives to aborted fetal tissue, including non-aborted fetal tissue, can be used.\n(b) The FTR must submit its decision to the IRB. The IRB is requested to review the conclusions of the FTR to ensure that all alternatives have been considered.\n(a) No later than January 15 of each year, the Board of Regents must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education policy and finance and health and human services policy and finance. The report must describe:\n(1) all fetal tissue research proposals submitted to the FTR or IRB, including any written narrative required under subdivision 2;\n(2) whether the research proposal involved aborted fetal tissue;\n(3) action by the FTR or IRB on all fetal tissue research proposals, including whether the proposal was approved by the FTR or IRB;\n(4) a list of all new or ongoing fetal tissue research projects at the university, including:\n(i) the date that the project was approved by the FTR or IRB;\n(ii) the source of funding for the project;\n(iii) the goal or purpose of the project;\n(iv) whether the fetal tissue used is aborted fetal tissue or non-aborted fetal tissue;\n(v) the source of the fetal tissue used;\n(vi) references to any publicly available information about the project, such as National Institutes of Health grant award information; and\n(vii) references to any publications resulting from the project.\n(b) The report must not include a researcher's name, other identifying information, contact information, or the location of a laboratory or office.\nThe University of Minnesota is requested to conduct education programs for all students and employees engaged in research on fetal tissue. Programs are requested to include mandatory comprehensive training on applicable federal and state laws, university policies and procedures, and other professional standards related to the respectful, humane, and ethical treatment of fetal tissue in research.",
	"repealed": false
}