{
	"id": "124D.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.83",
	"title": "124D.83 STATE REVENUE FOR AMERICAN INDIAN TRIBAL CONTRACT OR GRANT SCHOOLS.",
	"text": "(a) Each year each American Indian-controlled tribal contract or grant school authorized by the United States Code, title 25, section 450f, that is located on a reservation within the state is eligible to receive tribal contract or grant school aid subject to the requirements in paragraphs (b) to (d).\n(b) The school must plan, conduct, and administer an education program that complies with the requirements of either this chapter and chapters 120A, 120B, 121A, 122A, 123A, 123B, 125A, 125B, 126C, 127A, 129, and 268A or Code of Federal Regulations, title 25, sections 31.0 to 45.80.\n(c) The school must comply with all other state statutes governing independent school districts or their equivalent in the Code of Federal Regulations, title 25.\n(d) The state tribal contract or grant school aid must be used to supplement, and not to replace, the money for American Indian education programs provided by the federal government.\nAn American Indian-controlled tribal contract or grant school that is located on a reservation within the state and that complies with the requirements in subdivision 1 is eligible to receive tribal contract or grant school aid. The amount of aid is derived by:\n(1) multiplying the formula allowance under section 126C.10, subdivision 2, less $170, times the difference between (i) the resident pupil units as defined in section 126C.05, subdivision 6, in average daily membership, excluding section 126C.05, subdivision 13, and (ii) the number of pupils for the current school year, weighted according to section 126C.05, subdivision 1, receiving benefits under section 123B.42 or 123B.44 or for which the school is receiving reimbursement under section 124D.69;\n(2) adding to the result in clause (1) an amount equal to the product of the formula allowance under section 126C.10, subdivision 2, less $300 times the tribal contract compensation revenue pupil units;\n(3) subtracting from the result in clause (2) the amount of money allotted to the school by the federal government through Indian School Equalization Program of the Bureau of Indian Affairs, according to Code of Federal Regulations, title 25, part 39, subparts A to E, for the basic program as defined by section 39.11, paragraph (b), for the base rate as applied to kindergarten through twelfth grade, excluding small school adjustments and additional weighting, but not money allotted through subparts F to L for contingency funds, school board training, student training, interim maintenance and minor repair, interim administration cost, prekindergarten, and operation and maintenance, and the amount of money that is received according to section 124D.69;\n(4) dividing the result in clause (3) by the sum of the resident pupil units in average daily membership, excluding section 126C.05, subdivision 13, plus the tribal contract compensation revenue pupil units; and\n(5) multiplying the sum of the resident pupil units, including section 126C.05, subdivision 13, in average daily membership plus the tribal contract compensation revenue pupil units by the lesser of $3,230 for fiscal year 2019 and 51.17 percent of the formula allowance for fiscal year 2020 and later or the result in clause (4).\nNotwithstanding subdivision 1, paragraphs (b) and (c), a tribal contract or grant school:\n(1) is not subject to the Minnesota Election Law;\n(2) has no authority under this section to levy for property taxes, issue and sell bonds, or incur debt; and\n(3) may request through its managing tribal organization a recommendation of the commissioner of education, for consideration of the legislature, that a tribal contract or grant school not be subject to specified statutes related to independent school districts.\nA school receiving aid under this section may apply annually to the commissioner to receive an early childhood family education grant to provide early childhood family education programs for parents and children who are enrolled or eligible for enrollment in a federally recognized tribe. The grant must be used for programs and services that comply with section 142D.10, except that the school is not required to provide a community education program or establish a community education advisory council. The program must be designed to improve the skills of parents and promote American Indian history, language, and culture. The school must make affirmative efforts to encourage participation by fathers. Admission may not be limited to those enrolled in or eligible for enrollment in a federally recognized tribe.\nPupil units for pupils enrolled in tribal contract schools shall be used only for the purpose of computing tribal contract aid according to this section.",
	"repealed": false
}