{
	"id": "41B.048",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.048",
	"title": "41B.048 AGROFORESTRY LOAN PROGRAM.",
	"text": "The purpose of the agroforestry loan program is to provide low-interest financing to farmers during the growing period required to convert agricultural land to agroforestry.\nThe authority shall establish and implement an agroforestry loan program to help finance the production of short rotation woody crops.\nThe authority may adopt rules necessary for administration of the program established under subdivision 2.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Growing cycle\" means the number of years from planting to harvest.\n(c) \"Harvest\" means the day that the crop arrives at the scale of the buyer of the crop.\n(d) \"Short rotation woody crops\" or \"crop\" means hybrid poplar and other woody plants that are harvested for their fiber within 15 years of planting.\nTo be eligible for this program a borrower must:\n(1) be a resident of Minnesota or any entity eligible to own farm land under section 500.24;\n(2) be or plan to become a grower of short rotation woody crops on agricultural land that is suitable for the profitable production of short rotation woody crops;\n(3) be a member of a producer-owned cooperative that will contract to market the short rotation woody crop to be planted by the borrower;\n(4) demonstrate an ability to repay the loan;\n(5) not receive assistance under this program for more than $150,000 in the producer's lifetime;\n(6) agree to work with appropriate local, state, and federal agencies, and the marketing cooperative, to develop an acceptable establishment and maintenance plan;\n(7) agree not to plant short-rotation woody crops within one-quarter of a mile of state or federally protected prairie; and\n(8) meet any other requirements the authority may impose by administrative procedure or by rule.\n(a) The authority may participate with eligible lenders in agroforestry loans to farmers and agricultural landowners who are eligible under subdivision 5. The authority's participation is limited to 45 percent or $75,000 of total accumulative principal per loan.\n(b) The interest rates and repayment terms of the authority's participation interest may differ from those of the lender's retained portion of the loan.\n(c) The loan may be disbursed over a period not to exceed 12 years.\n(d) A borrower may receive loans, depending on the availability of funds, for planted areas up to 160 acres for up to:\n(1) the total amount necessary for establishment of the crop;\n(2) the total amount of maintenance costs, including weed control, during the first three years; and\n(3) 70 percent of the estimated value of one year's growth of the crop for years four through 12.\n(e) Security for the loan must be the crop, a personal note executed by the borrower, and whatever other security is required by the eligible lender or the authority.\n(f) The authority may prescribe forms and establish an application process for applicants to apply for a loan.\n(g) The authority may impose a reasonable, nonrefundable application fee for each application for a loan under this program. The application fee is initially $50. Application fees received by the authority must be deposited in the Rural Finance Authority administrative account established in section 41B.03.\n(h) Loans under the program must be made using money in the revolving loan account established under section 41B.06.\n(i) All repayments of financial assistance granted under this section, including principal and interest, must be deposited into the revolving loan account established under section 41B.06.\n(j) The interest payable on loans for the agroforestry loan program must be at a rate determined by the authority.\n(k) Loan principal balance outstanding plus all assessed interest must be repaid within 120 days of harvest, but no later than 15 years from planting.\n[Repealed, 2012 c 244 art 1 s 83]\nMS 2020 [Repealed, 2021 c 28 s 26]",
	"repealed": false
}