{
	"id": "48A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.12",
	"title": "48A.12 DEFINITIONS.",
	"text": "For purposes of sections 48A.12 to 48A.22, the following words and phrases have the meanings given them.\n\"Account\" means the client relationship established with a trust company involving the transfer of funds or property to the trust company, including a relationship in which the trust company acts as trustee, executor, administrator, guardian, custodian, conservator, bailee, receiver, registrar, or agent, but excluding a relationship in which the trust company acts solely in an advisory capacity.\n\"Administer\" with respect to real or tangible personal property means, as an agent or in another representative capacity, to possess, purchase, sell, lease or insure, safekeep, or otherwise manage the property.\n\"Affiliate\" means a company that directly or indirectly controls, is controlled by, or is under common control with a trust institution or other company.\n\"Bank\" has the meaning given the term in United States Code, title 12, section 1813(h). The term \"bank\" does not include a \"foreign bank\" as defined in United States Code, title 12, section 3101(7), except for a foreign bank organized under the laws of a territory of the United States, Puerto Rico, Guam, American Samoa, or the Virgin Islands, the deposits of which are insured by the Federal Deposit Insurance Corporation.\n\"Bank supervisory agency\" means:\n(1) an agency of another state with primary responsibility for chartering and supervising a trust institution; and\n(2) the Office of the Comptroller of the Currency, the Federal Deposit Insurance Corporation, the Board of Governors of the Federal Reserve System, the Office of Thrift Supervision, and any successor to these agencies.\n\"Branch,\" with respect to a trust company or depository institution, has the meaning given in section 48A.17 and in sections 47.51 and 49.411, subdivision 2, paragraph (d).\n\"Charter\" means a charter, license, or other authority issued by the commissioner or a bank supervisory agency authorizing a trust institution to act as a fiduciary in its home state.\n\"Client\" means a person to whom a trust institution owes a duty or obligation under a trust or other account administered by the trust institution or as an advisor or agent, regardless of whether the trust institution owes a fiduciary duty to the person. The term includes the noncontingent beneficiaries of an account.\n\"Commissioner\" means the commissioner of commerce and, where appropriate, all of the commissioner's successors and predecessors in office.\n\"Company\" includes a bank, trust company, corporation, limited liability company, partnership, association, business trust, or another trust.\n\"Department\" means the Minnesota Commerce Department.\n\"Fiduciary record\" means a matter written, transcribed, recorded, received, or otherwise in the possession or control of a trust company, whether in physical, electromagnetic, or optical disk form, that is necessary to preserve information concerning an act or event relevant to an account or a client of a trust company.\n\"Home state\" means:\n(1) with respect to a federally chartered trust institution, the state in which the institution maintains its principal office; and\n(2) with respect to any other trust institution, the state that chartered the institution.\n\"Home state regulator\" means the bank supervisory agency with primary responsibility for chartering and supervising an out-of-state trust institution.\n\"Host state\" means a state, other than the home state of a trust institution, in which the trust institution maintains or seeks to acquire or establish an office.\n\"New trust office\" means a trust office located in a host state that:\n(1) is originally established by the trust institution as a trust office; and\n(2) does not become a trust office of the trust institution as a result of:\n(i) the acquisition of another trust institution or trust office of another trust institution; or\n(ii) a merger, consolidation, or conversion involving the trust institution or trust office.\n\"Office,\" with respect to a trust institution, means the principal office, a trust office, or a representative trust office, but not a detached facility.\n\"Out-of-state bank\" means a bank chartered to act as a fiduciary in a state or states other than this state.\n\"Out-of-state trust company\" means a trust company that is not a state trust company whose principal office is not located in this state.\n\"Out-of-state trust institution\" means a trust institution that is not a state trust institution.\n\"Principal office\" with respect to:\n(1) a state trust company, means a location registered with the commissioner as the state trust company's home office at which:\n(i) the state trust company does business;\n(ii) the state trust company keeps its corporate books and a set of its material records, including material fiduciary records; and\n(iii) at least one executive officer of the state trust company maintains an office; or\n(2) a trust institution other than a state trust company, means its principal place of business in the United States.\n\"Registration\" means the process by which a trust institution has been authorized by the commissioner to acquire, establish, or maintain a representative trust office in this state.\n\"Representative trust office\" means an office at which a trust institution has been authorized by the commissioner to engage in a trust business other than:\n(1) accepting or executing trusts, including to:\n(i) act as trustee under a written agreement;\n(ii) receive money or other property in its capacity as a trustee for investment in real or personal property;\n(iii) act as trustee and perform the fiduciary duties committed or transferred to it by order of court of competent jurisdiction;\n(iv) act as trustee of the estate of a deceased person; or\n(v) act as trustee for a minor or incapacitated person;\n(2) administering in any other fiduciary capacity real or personal property; or\n(3) acting according to an order of a court of competent jurisdiction as executor or administrator of the estate of a deceased person or as a guardian or conservator for a minor or incapacitated person.\n\"State\" means a state of the United States, the District of Columbia, a territory of the United States, Puerto Rico, Guam, American Samoa, the Trust Territory of the Pacific Islands, the Virgin Islands, and the Northern Mariana Islands.\n\"State bank and trust\" means a bank chartered by this state with the additional authority to exercise fiduciary powers and privileges set out in sections 48A.07 and 48A.08.\n\"State trust company\" means a corporation or a limited liability trust company organized or reorganized under this chapter, including a trust company organized under the laws of this state before August 1, 1998.\n\"State trust institution\" means a trust institution chartered by the state.\n\"Trust business\" means the holding out by a person to the public by advertising, solicitation, or other means that the person is available to perform any service of a trust institution.\n\"Trust company\" means a state trust company or other company chartered to act as a fiduciary that is not a depository institution or a foreign bank.\n\"Trust institution\" means a bank and trust, or trust company.\n\"Trust office\" means an office, other than the principal office, at which a trust institution is authorized by the commissioner to conduct any trust business incidental to the trust business that it is permitted to conduct at its principal office or branch. It may not accept deposits except as incidental to the trust business.\n\"Unauthorized activity\" means:\n(1) a company, other than one identified in section 48.37, 48A.01, or 48A.11, acting as a fiduciary within this state;\n(2) a company engaging in a trust business in this state at an office of the company that is not its principal office, if it is a state trust institution, or that is not a trust office or a representative trust office of the company; or\n(3) an out-of-state trust institution engaging in a trust business in this state at any time an order issued by the commissioner under section 48A.22 is in effect.",
	"repealed": false
}