{
	"id": "171.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.02",
	"title": "171.02 LICENSES; TYPES, ENDORSEMENTS, RESTRICTIONS.",
	"text": "(a) Except when expressly exempted, a person shall not drive a motor vehicle upon a street or highway in this state unless the person has a valid license under this chapter for the type or class of vehicle being driven.\n(b) The department shall not issue a driver's license to a person unless and until the person's license from any jurisdiction has been invalidated. The department shall provide to the issuing department of any jurisdiction, information that the licensee is now licensed in Minnesota. A person is not permitted to have more than one valid driver's license at any time. The department shall not issue to a person to whom a current Minnesota identification card has been issued a driver's license, other than a limited license, unless the person's Minnesota identification card has been invalidated. This subdivision does not require invalidation of a tribal identification card as a condition of receiving a driver's license.\n(a) Drivers' licenses are classified according to the types of vehicles that may be driven by the holder of each type or class of license. The commissioner may, as appropriate, subdivide the classes listed in this subdivision and issue licenses classified accordingly.\n(b) Except as provided in this subdivision and subdivision 2a, no class of license is valid to operate a motorcycle, school bus, tank vehicle, double-trailer or triple-trailer combination, vehicle transporting hazardous materials, or bus, unless so endorsed. There are four general classes of licenses as described in paragraphs (c) through (f).\n(c) Class D drivers' licenses are valid for:\n(1) operating all farm trucks if the farm truck is:\n(i) controlled and operated by a farmer, including operation by an immediate family member or an employee of the farmer;\n(ii) used to transport agricultural products, farm machinery, or farm supplies, including hazardous materials, to or from a farm;\n(iii) not used in the operations of a common or contract motor carrier as governed by Code of Federal Regulations, title 49, part 365; and\n(iv) used within 150 miles of the farm;\n(2) notwithstanding paragraph (b), operating an authorized emergency vehicle, as defined in section 169.011, subdivision 3, whether or not in excess of 26,000 pounds gross vehicle weight;\n(3) operating a recreational vehicle as defined in section 168.002, subdivision 27, that is operated for personal use;\n(4) operating all single-unit vehicles except vehicles with a gross vehicle weight of more than 26,000 pounds, vehicles designed to carry more than 15 passengers including the driver, and vehicles that carry hazardous materials;\n(5) notwithstanding paragraph (d), operating a type A school bus or a multifunction school activity bus without a school bus endorsement if the requirements of subdivision 2a are satisfied, as determined by the commissioner;\n(6) operating any vehicle or combination of vehicles when operated by a licensed peace officer while on duty;\n(7) towing vehicles if:\n(i) the towed vehicles have a gross vehicle weight of 10,000 pounds or less; or\n(ii) the towed vehicles have a gross vehicle weight of more than 10,000 pounds and the combination of vehicles has a gross vehicle weight of 26,000 pounds or less;\n(8) operating a covered farm vehicle as defined in Code of Federal Regulations, title 49, section 390.5, that is not carrying hazardous materials of a type or quantity that requires the vehicle to be placarded in accordance with Code of Federal Regulations, title 49, section 172.504; and\n(9) operating an autocycle.\n(d) Class C drivers' licenses are valid for:\n(1) operating class D motor vehicles;\n(2) with a hazardous materials endorsement, operating class D vehicles to transport hazardous materials;\n(3) with a passenger endorsement, operating buses; and\n(4) with a passenger endorsement and school bus endorsement, operating school buses.\n(e) Class B drivers' licenses are valid for:\n(1) operating all class C motor vehicles, class D motor vehicles, and all other single-unit motor vehicles including, with a passenger endorsement, buses; and\n(2) towing only vehicles with a gross vehicle weight of 10,000 pounds or less.\n(f) Class A drivers' licenses are valid for operating any vehicle or combination of vehicles.\nNotwithstanding subdivision 2, paragraph (b), the holder of a class D driver's license, without a school bus endorsement, may operate a type A school bus or a multifunction school activity bus under the following conditions:\n(a) The operator is an employee of the entity that owns, leases, or contracts for the school bus and is not solely hired to provide transportation services under this subdivision.\n(b) The operator drives the school bus only from points of origin to points of destination, not including home-to-school trips to pick up or drop off students.\n(c) The operator is prohibited from using the eight-light system. Violation of this paragraph is a misdemeanor.\n(d) The operator's employer has adopted and implemented a policy that provides for annual training and certification of the operator in:\n(1) safe operation of the type of school bus the operator will be driving;\n(2) understanding student behavior, including issues relating to students with disabilities;\n(3) encouraging orderly conduct of students on the bus and handling incidents of misconduct appropriately;\n(4) knowing and understanding relevant laws, rules of the road, and local school bus safety policies;\n(5) handling emergency situations; and\n(6) safe loading and unloading of students.\n(e) A background check or background investigation of the operator has been conducted that meets the requirements under section 122A.18, subdivision 8, or 123B.03 for teachers; section 144.057 or chapter 245C for day care employees; or section 171.321, subdivision 3, for all other persons operating a school bus under this subdivision.\n(f) Operators shall submit to a physical examination as required by section 171.321, subdivision 2, and must have in their possession the original or a copy of a current medical examiner's certificate, or otherwise provide proof of being medically qualified, to operate a school bus under this subdivision.\n(g) The operator's driver's license is verified annually by the entity that owns, leases, or contracts for the school bus.\n(h) A person who sustains a conviction, as defined under section 609.02, of violating section 169A.25, 169A.26, 169A.27, 169A.31, 169A.51, or 169A.52, or a similar statute or ordinance of another state is precluded from operating a school bus for five years from the date of conviction.\n(i) A person who has ever been convicted of a disqualifying offense as defined in section 171.3215, subdivision 1, paragraph (c), may not operate a school bus under this subdivision.\n(j) A person who sustains a conviction, as defined under section 609.02, of a fourth moving offense in violation of chapter 169 is precluded from operating a school bus for one year from the date of the last conviction.\n(k) Students riding the school bus must have training required under section 123B.90, subdivision 2.\n(l) An operator must be trained in the proper use of child safety restraints as set forth in the National Highway Traffic Safety Administration's \"Guideline for the Safe Transportation of Pre-school Age Children in School Buses,\" if child safety restraints are used by the passengers.\n(m) Annual certification of the requirements listed in this subdivision must be maintained under separate file at the business location for each operator licensed under this subdivision and subdivision 2, paragraph (c), clause (5). The business manager, school board, governing body of a nonpublic school, or any other entity that owns, leases, or contracts for the school bus operating under this subdivision is responsible for maintaining these files for inspection.\n(n) The school bus must bear a current certificate of inspection issued under section 169.451.\n(o) If the word \"School\" appears on the front and rear of the bus, the word \"School\" must be covered by a sign that reads \"Activities\" when the bus is being operated under authority of this subdivision.\n(p) The type A-I school bus or multifunction school activity bus is designed to transport 15 or fewer passengers, including the driver.\n(q) The school bus or multifunction school activity bus has a gross vehicle weight rating of 14,500 pounds or less.\n(r) An operator who sustains a conviction as described in paragraph (h), (i), or (j) while employed by the entity that owns, leases, or contracts for the school bus must report the conviction to the employer within ten days of the date of the conviction.\n(s) An operator whose driver's license is suspended, revoked, canceled, or disqualified by Minnesota, another state, or another jurisdiction must notify the operator's employer in writing of the suspension, revocation, cancellation, lost privilege, or disqualification. The operator must notify the operator's employer before the end of the business day immediately following the day the operator received notice of the suspension, revocation, cancellation, lost privilege, or disqualification.\n(a) Notwithstanding subdivision 2, the holder of a class A, B, C, or D driver's license, without a school bus endorsement, may operate a type III vehicle described in section 169.011, subdivision 71, paragraph (h), under the conditions in this subdivision.\n(b) The operator is an employee of the entity that owns, leases, or contracts for the school bus.\n(c) The operator's employer has adopted and implemented a policy that provides for annual training and certification of the operator in:\n(1) safe operation of a type III vehicle;\n(2) understanding student behavior, including issues relating to students with disabilities;\n(3) encouraging orderly conduct of students on the bus and handling incidents of misconduct appropriately;\n(4) knowing and understanding relevant laws, rules of the road, and local school bus safety policies;\n(5) handling emergency situations;\n(6) proper use of seat belts and child safety restraints;\n(7) performance of pretrip vehicle inspections;\n(8) safe loading and unloading of students, including, but not limited to:\n(i) utilizing a safe location for loading and unloading students at the curb, on the nontraffic side of the roadway, or at off-street loading areas, driveways, yards, and other areas to enable the student to avoid hazardous conditions;\n(ii) refraining from loading and unloading students in a vehicular traffic lane, on the shoulder, in a designated turn lane, or a lane adjacent to a designated turn lane;\n(iii) avoiding a loading or unloading location that would require a pupil to cross a road, or ensuring that the driver or an aide personally escort the pupil across the road if it is not reasonably feasible to avoid such a location;\n(iv) placing the type III vehicle in \"park\" during loading and unloading; and\n(v) escorting a pupil across the road under item (iii) only after the motor is stopped, the ignition key is removed, the brakes are set, and the vehicle is otherwise rendered immobile; and\n(9) compliance with paragraph (k), concerning reporting certain convictions to the employer within ten days of the date of conviction.\n(d) A background check or background investigation of the operator has been conducted that meets the requirements under section 122A.18, subdivision 8, or 123B.03 for school district employees; section 144.057 or chapter 245C for day care employees; or section 171.321, subdivision 3, for all other persons operating a type III vehicle under this subdivision.\n(e) Operators shall submit to a physical examination as required by section 171.321, subdivision 2, and must have in their possession the original or a copy of a current medical examiner's certificate, or otherwise provide proof of being medically qualified, to operate a school bus under this subdivision.\n(f) The operator's employer requires preemployment drug testing of applicants for operator positions. Current operators must comply with the employer's policy under section 181.951, subdivisions 2, 4, and 5. Notwithstanding any law to the contrary, the operator's employer may use a Breathalyzer or similar device to fulfill random alcohol testing requirements.\n(g) The operator's driver's license is verified annually by the entity that owns, leases, or contracts for the type III vehicle as required under section 171.321, subdivision 5.\n(h) A person who sustains a conviction, as defined under section 609.02, of violating section 169A.25, 169A.26, 169A.27, or 169A.31, or whose driver's license is revoked under sections 169A.50 to 169A.53 of the implied consent law or section 171.177, or who is convicted of violating or whose driver's license is revoked under a similar statute or ordinance of another state, is precluded from operating a type III vehicle for five years from the date of conviction.\n(i) A person who has ever been convicted of a disqualifying offense as defined in section 171.3215, subdivision 1, paragraph (c), may not operate a type III vehicle under this subdivision.\n(j) A person who sustains a conviction, as defined under section 609.02, of a moving offense in violation of chapter 169 within three years of the first of three other moving offenses is precluded from operating a type III vehicle for one year from the date of the last conviction.\n(k) An operator who sustains a conviction as described in paragraph (h), (i), or (j) while employed by the entity that owns, leases, or contracts for the school bus, shall report the conviction to the employer within ten days of the date of the conviction.\n(l) An operator of a type III vehicle whose driver's license is suspended, revoked, canceled, or disqualified by Minnesota, another state, or another jurisdiction must notify the operator's employer in writing of the suspension, revocation, cancellation, lost privilege, or disqualification. The operator must notify the operator's employer before the end of the business day immediately following the day the operator received notice of the suspension, revocation, cancellation, lost privilege, or disqualification.\n(m) Students riding the type III vehicle must have training required under section 123B.90, subdivision 2.\n(n) Documentation of meeting the requirements listed in this subdivision must be maintained under separate file at the business location for each type III vehicle operator. The business manager, school board, governing body of a nonpublic school, or any other entity that owns, leases, or contracts for the type III vehicle operating under this subdivision is responsible for maintaining these files for inspection.\n(o) The type III vehicle must bear a current certificate of inspection issued under section 169.451.\n(p) An employee of a school or of a school district, who is not employed for the sole purpose of operating a type III vehicle, is exempt from paragraphs (e) and (f).\n(a) A motorized bicycle may not be operated on any public roadway by any person who does not possess a valid driver's license, unless the person has obtained a motorized bicycle operator's permit or motorized bicycle instruction permit from the commissioner of public safety. The operator's permit may be issued to any person who has attained the age of 15 years and who has passed the examination prescribed by the commissioner. The instruction permit may be issued to any person who has attained the age of 15 years and who has successfully completed an approved safety course and passed the written portion of the examination prescribed by the commissioner.\n(b) This course must consist of, but is not limited to, a basic understanding of:\n(1) motorized bicycles and their limitations;\n(2) motorized bicycle laws and rules;\n(3) safe operating practices and basic operating techniques;\n(4) helmets and protective clothing;\n(5) motorized bicycle traffic strategies; and\n(6) effects of alcohol and drugs on motorized bicycle operators.\n(c) The commissioner may adopt rules prescribing the content of the safety course, examination, and the information to be contained on the permits. A person operating a motorized bicycle under a motorized bicycle permit is subject to the restrictions imposed by section 169.974, subdivision 2, on operation of a motorcycle under a two-wheel instruction permit.\n(d) The fees for motorized bicycle operator's permits are as follows:\n(a) The commissioner may issue restricted commercial drivers' licenses and take the following actions to the extent that the actions are authorized by regulation of the United States Department of Transportation in Code of Federal Regulations, title 49, section 383.3, paragraph (f):\n(1) prescribe examination requirements and other qualifications for the license;\n(2) prescribe classes of vehicles that may be operated by holders of the license;\n(3) specify commercial motor vehicle operation that is authorized by the license, and prohibit other commercial motor vehicle operation by holders of the license; and\n(4) prescribe the period of time during which the license is valid.\n(b) Restricted commercial drivers' licenses are subject to sections 171.165 and 171.166 in the same manner as other commercial drivers' licenses.\n(c) Actions of the commissioner under this subdivision are not subject to sections 14.05 to 14.47 of the Administrative Procedure Act.\nPursuant to the waiver authorization set forth in Public Law 104-59, section 345, subsection (a), paragraph (5), a person who operates a commercial motor vehicle for the purpose of removing snow or ice from a roadway by plowing, salting, or sanding is not required to hold a commercial driver's license if the person:\n(1) is an employee of a local unit of government with a population of 3,000 or less;\n(2) is operating within the boundaries of the local unit of government;\n(3) holds a valid class D driver's license; and\n(4) except in the event of a lawful strike, is temporarily replacing the employee who normally operates the vehicle but either is unable to operate the vehicle or is in need of additional assistance due to a snow emergency as determined by the local unit of government.",
	"repealed": false
}