{
	"id": "424B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/424B.06",
	"title": "424B.06 TRANSFERS.",
	"text": "On the effective date of consolidation, the records, assets, and liabilities of the prior firefighters relief associations are transferred to the consolidated firefighters relief association. On the effective date of consolidation, the prior firefighters relief associations cease to exist as legal entities, except for the purposes of winding up association affairs as provided by this chapter.\nOn the effective date of consolidation, the administration of the prior relief associations is transferred to the board of trustees of the subsequent firefighters relief association.\nOn the effective date of consolidation, the secretary and the treasurer of the prior firefighters relief associations shall transfer all records and documents relating to the prior relief associations to the secretary and treasurer of the subsequent firefighters relief association.\n(a) On the effective date of consolidation, the secretary and the treasurer of a prior firefighters relief association shall transfer the assets of the special fund of the applicable relief association to the special fund of the subsequent relief association. Unless the appropriate secretary and treasurer decide otherwise, the assets may be transferred as investment securities rather than cash. The transfer must include any accounts receivable. The appropriate secretary must settle any accounts payable from the special fund of the relief association before the effective date of consolidation.\n(b) Upon the transfer of the assets of the special fund of a prior relief association, the pension liabilities of that special fund become the obligation of the special fund of the subsequent firefighters relief association.\n(c) Upon the transfer of the prior relief association special fund assets, the board of trustees of the subsequent firefighters relief association has legal title to and management responsibility for the transferred assets as trustees for persons having a beneficial interest in those assets arising out of the benefit coverage provided by the prior relief association.\n(d) The subsequent firefighters relief association is the successor in interest in all claims for and against the special funds of the prior firefighters relief associations or the applicable municipalities with respect to the special funds of the prior relief associations. The status of successor in interest does not apply to any claim against a prior relief association, the municipality in which that relief association is located, or any person connected with the prior relief association or the municipality, based on any act or acts that were not done in good faith and that constituted a breach of fiduciary responsibility under common law or chapter 356A.",
	"repealed": false
}