{
	"id": "97A.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.135",
	"title": "97A.135 ACQUIRING WILDLIFE LANDS.",
	"text": "(a) The commissioner or the commissioner of administration shall acquire and improve land for public hunting, game refuges, and food and cover planting. The land may be acquired by a gift, lease, easement, purchase, or condemnation. At least two-thirds of the total area acquired in a county must be open to public hunting. The commissioner may designate, by written order published in the State Register, land acquired under this subdivision as a wildlife management area for the purposes of the outdoor recreation system. Designations of wildlife management areas are exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(b) The commissioner of administration may transfer money to the commissioner for acquiring wildlife lands to qualify for Pittman-Robertson funds. The transferred money is reappropriated to the commissioner for the wildlife land acquisition.\nThe commissioner shall sell or exchange land acquired for public hunting that is unnecessary or unsuitable. The land may not be sold for less than its purchase price. The land may be exchanged for land of equal value that adds to existing public hunting areas. The sales and exchanges must be approved by the Executive Council. This subdivision does not apply to land in a wildlife management area.\n(a) The commissioner may sell or exchange land in a wildlife management area authorized by designation under section 86A.07, subdivision 3, 97A.133, or 97A.145 if the commissioner vacates the designation before the sale or exchange in accordance with this subdivision. The designation may be vacated only if the commissioner finds, after a public hearing, that the disposal of the land is in the public interest.\n(b) A sale under this subdivision is subject to sections 94.09 to 94.16. An exchange under this subdivision is subject to sections 94.341 to 94.347.\n(c) Revenue received from a sale authorized under paragraph (a) is appropriated to the commissioner for acquisition of replacement wildlife management lands.\n(d) Land acquired by the commissioner under this subdivision must meet the criteria in section 86A.05, subdivision 8, and as soon as possible after the acquisition must be designated as a wildlife management area under section 86A.07, subdivision 3, 97A.133, or 97A.145.\n(e) In acquiring land under this subdivision, the commissioner must give priority to land within the same geographic region of the state as the land conveyed.\nOn any public hunting, game refuge, wildlife management area, aquatic management area, or scientific and natural area lands, the commissioner may enter into written cooperative farming agreements on a sharecrop basis, without competitive bidding, for the purpose of wildlife and plant management. Cooperative farming agreements may also be used to allow pasturing of livestock. The agreements may provide for the bartering of a share of any crop, produced from these lands, for services or products that will enhance or benefit the management of state lands for plant and animal species. Cooperative farming agreements pursuant to this section shall not be considered leases for tax purposes under section 272.01, subdivision 2, or 273.19.",
	"repealed": false
}