{
	"id": "43A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.36",
	"title": "43A.36 RELATIONSHIPS WITH OTHER AGENCIES AND JURISDICTIONS.",
	"text": "(a) The commissioner may delegate administrative functions associated with the duties of the commissioner to appointing authorities who have the capability to perform such functions when the commissioner determines that it is in the best interests of the state civil service. The commissioner shall consult with agencies and agencies shall cooperate as appropriate in implementation of this chapter.\n(b) The commissioner, in conjunction with appointing authorities, shall analyze and assess current and future human resource requirements of the civil service and coordinate personnel actions throughout the civil service to meet the requirements. The commissioner shall provide recruiting assistance and make the applicant database available to appointing authorities to use in making appointments to positions in the unclassified service.\n(c) The head of each agency in the executive branch shall designate an agency personnel officer. The agency personnel officer shall be accountable to the agency head for all personnel functions prescribed by laws, rules, collective bargaining agreements, the commissioner and the agency head. Except when otherwise prescribed by the agency head in a specific instance, the personnel officer shall be assumed to be the authority accountable to the agency head over any other officer or employee in the agency for personnel functions.\n(d) The head of each agency in the executive branch shall designate an affirmative action officer who shall have primary responsibility for the administration of the agency's affirmative action plan. The officer shall report directly to the head of the agency on affirmative action matters.\n(e) Pursuant to section 43A.431, the head of each agency in the executive branch shall designate an ADA coordinator who shall have primary responsibility for the administration of ADA policies, procedures, trainings, requests, and arbitration. The coordinator shall report directly to the commissioner.\nThe services and facilities of the department and its staff may be made available upon request to political subdivisions of the state. Enforcement and administration of other provisions of this chapter shall take precedence over the provision of the services and facilities. Political subdivisions shall reimburse the state for the reasonable cost of services and facilities.\nThe commissioner may enter into arrangements with personnel agencies in other jurisdictions to exchange services. The commissioner may also join or subscribe to any association or service having as its purpose the interchange of information relating to the practices of personnel administration and labor relations. The commissioner is authorized as an agent of the state of Minnesota to enter into contracts or cooperative agreements involving matters of personnel and labor relations with other governments within the United States.",
	"repealed": false
}