{
	"id": "18B.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.34",
	"title": "18B.34 NONCOMMERCIAL APPLICATOR LICENSE.",
	"text": "(a) Except for a licensed commercial applicator, certified private applicator, or licensed structural pest control applicator, a person, including a government employee, may not purchase or use a restricted use pesticide in performance of official duties without having a noncommercial applicator license for an appropriate use category.\n(b) A licensee must have a valid license identification card when applying pesticides and must display it upon demand by an authorized representative of the commissioner or a law enforcement officer. The license identification card must contain information required by the commissioner.\n(c) A person licensed under this section is considered qualified and is not required to verify, document, or otherwise prove a particular need prior to use, except as required by the federal label.\n(d) A person licensed under this section must be 18 years of age or older.\nA noncommercial applicator license:\n(1) expires on December 31 of the year for which it is issued unless suspended or revoked before that date;\n(2) is not transferable; and\n(3) must be prominently displayed to the public in the noncommercial applicator's place of business.\nA person must apply to the commissioner for a noncommercial applicator license on forms and in the manner required by the commissioner. The commissioner must prescribe and administer a closed-book, monitored examination, or equivalent measure to determine if the applicant is eligible to acquire a noncommercial applicator license.\n(a) An applicator must apply to the commissioner to renew a noncommercial applicator license. The commissioner may renew a license subject to reexamination, attendance at a recertification workshop approved by the commissioner, or other requirements imposed by the commissioner to provide the applicator with information regarding changing technology and to help assure a continuing level of competence and ability to use pesticides safely and properly. A recertification workshop must meet or exceed the competency standards in Code of Federal Regulations, title 40, part 171. Competency standards for a recertification website must be published on the Department of Agriculture website. Upon the receipt of an applicator's renewal application, the commissioner may require the applicator to attend a recertification workshop. Depending on the application category, the commissioner may require an applicator to complete a recertification workshop once per year, once every two years, or once every three years. If the commissioner requires an applicator to attend a recertification workshop and the applicator fails to attend the workshop, the commissioner may require the applicator to pass a reexamination. The commissioner may require an additional demonstration of applicator qualification if the applicator has had a license suspended or revoked or has otherwise had a history of violations of this chapter.\n(b) An applicator that meets renewal requirements by reexamination instead of attending a recertification workshop must pay the equivalent workshop fee for the reexamination as determined by the commissioner.\n(c) An applicator has 12 months to renew the license after expiration without having to meet initial testing requirements.\n(a) Except as provided under paragraph (b), a person initially applying for or renewing a noncommercial applicator license must pay a nonrefundable application fee of $50.\n(b) A government employee, a contractor providing rest area custodial services for the commissioner of transportation, or a Conservation Corps Minnesota employee is eligible for a reduced fee of $10 if the employee or contractor uses pesticides in the course of performing official duties.\n(c) A license renewal application received after March 1 in the year for which the license is to be issued is subject to a penalty fee of 50 percent of the application fee. The penalty fee must be paid before the renewal license may be issued.\n(d) An application for a duplicate noncommercial applicator license must be accompanied by a nonrefundable application fee of $10.",
	"repealed": false
}