{
	"id": "453.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/453.53",
	"title": "453.53 MUNICIPAL POWER AGENCIES; INCORPORATION.",
	"text": "(a) Any two or more cities or existing municipal power agencies may form a municipal power agency by the execution of an agency agreement authorized by a resolution of the governing body of each city or municipal power agency.\n(b) The agency agreement shall state:\n(1) that the municipal power agency is created and incorporated under the provisions of sections 453.51 to 453.62 as a municipal corporation and a political subdivision of the state, to exercise thereunder a part of the sovereign powers of the state;\n(2) the name of the agency, which shall include the words \"municipal power agency\";\n(3) the names of the cities or municipal power agencies which have approved the agency agreement and are the initial members of the municipal power agency;\n(4) the names and addresses of the persons initially appointed by the resolutions approving the agreement to act as the representatives of the members, respectively, in the exercise of their powers as members;\n(5) limitations, if any, upon the terms of representatives of the respective members, provided that such representatives shall always be selected and vacancies in their offices declared and filled by resolutions of the governing bodies of the respective members;\n(6) the names of the initial board of directors of the municipal power agency, who shall be not less than five persons who are representatives of the respective members, selected by the vote of a majority of such representatives; or the agreement may provide that the representatives of the members from time to time shall be and constitute the board of directors;\n(7) the location by city, town, or other community in the state, of the registered office of the municipal power agency;\n(8) that the cities or municipal power agencies which are members of the municipal power agency are not liable for its obligations; and\n(9) any other provision for regulating the business of the municipal power agency or the conduct of its affairs which may be agreed by the members, consistent with sections 453.51 to 453.62.\nThe agency agreement and a certified copy of the resolution of the governing body of each member shall be filed for record with the secretary of state. Upon the filing of the agency agreement and a certified copy of the resolution of the governing body of each member, the existence of the municipal power agency as a political subdivision of the state and a municipal corporation shall begin.\nThe initial board of directors of the municipal power agency, unless otherwise provided by the agency agreement, shall be elected prior to the filing of the agreement by a majority vote of the persons acting as representatives of the members, from among their members. After commencement of existence, the first meeting of the board of directors shall be held at the call of the directors, after notice, for the purpose of adopting the initial bylaws, electing officers, and for any other business that comes before the meeting.\n(a) The bylaws of the municipal power agency, and any amendments thereto, shall be proposed by the board of directors and shall be adopted by a majority vote of the representatives of the members, unless the agency agreement requires a greater vote, at a meeting held after notice.\n(b) Subject to the provisions of the agency agreement, the bylaws shall state:\n(1) the qualifications of members, and limitations, if any, upon their number;\n(2) conditions of membership, if any;\n(3) manner and time of calling regular meetings of representatives of members;\n(4) manner and conditions of termination of membership; and\n(5) such other provisions for regulating the affairs of the municipal power agency as the representatives of the members shall determine to be necessary.\nEvery municipal power agency shall maintain an office in this state to be known as its registered office. When a municipal power agency desires to change the location of its registered office, it shall file with the secretary of state a certificate of change of location of registered office, stating the new location by city, town, or other community and effective date of change. When the certificate of change of location has been duly filed, the board of directors may make the change without any further action.\nEach of the directors shall hold office for the term for which selected and until a successor has been selected and has qualified. Directors shall discharge their duties in good faith, and with that diligence and care which an ordinary prudent person in a like position would exercise under similar circumstances. The agency agreement or the bylaws may prescribe the number, term of office, powers, authority, and duties of directors, the time and place of their meetings, and other regulations concerning directors. Except where the agency agreement or bylaws prescribe otherwise, the term of office of a director shall be for one year. Except where the agency agreement or bylaws prescribe otherwise, a meeting of the board of directors may be held at any place, within or without the state, designated by the board, after notice, and an act of the majority of the directors present at a meeting at which a quorum is present is the act of the board. Except where the agency agreement or bylaws prescribe otherwise, any vacancy occurring on the board shall be filled by a person nominated by the remaining members of the board and elected by a majority of representatives of the member cities.\nExcept where the agency agreement or bylaws prescribe otherwise, the board of directors shall appoint a president from its membership, and a secretary and treasurer, and any other officers or agents deemed to be necessary, who may but need not be city representatives or directors. An officer may be removed with or without cause by the board of directors. Officers of the municipal power agency shall have the authority and duties in the management of the business of the municipal power agency that the agency agreement or bylaws prescribe, or, in the absence of such prescription, as the board of directors determines.\nExcept as otherwise provided in the agency agreement or the bylaws, the duly authorized representatives of each member shall act as, and vote on behalf of, such member. Except where the agency agreement or bylaws provide otherwise, representatives of the members shall hold at least one meeting each year for the election of directors and for the transaction of any other business. Except where the agency agreement or bylaws prescribe otherwise, special meetings of the representatives may be called for any purpose upon written request to the president or secretary to call the meeting. Such officer shall give notice of the meeting to be held between 10 and 60 days after receipt of such request. Unless the agency agreement or bylaws provide for a different percentage, a quorum for a meeting of the representatives of the members is a majority of the total members and a quorum for meetings of the board of directors is a majority of the membership of such board.\nThe agency agreement may be amended as proposed at any meeting of the representatives of the members for which notice, stating the purpose, shall be given to each representative and, unless the agency agreement or bylaws require otherwise, shall become effective when ratified by resolutions of a majority of the governing bodies of the members. Each amendment and the resolutions approving it shall be filed for record with the secretary of state.\nEach member city shall have full power and authority, within budgetary limits applicable to it, to appropriate money for the payment of expenses of the formation of the municipal power agency and of its representative in exercising its functions as a member of the agency.",
	"repealed": false
}