{
	"id": "85.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.015",
	"title": "85.015 STATE TRAILS.",
	"text": "(a) The commissioner of natural resources shall establish, develop, maintain, and operate the trails designated in this section. Each trail shall have the purposes assigned to it in this section. The commissioner of natural resources may acquire lands by gift or purchase, in fee or easement, for the trail and facilities related to the trail.\n(b) Notwithstanding the offering to public entities, public sale, and related notice and publication requirements of sections 94.09 to 94.165, the commissioner of natural resources, in the name of the state, may sell surplus lands not needed for trail purposes at private sale to adjoining property owners and leaseholders. The conveyance must be by quitclaim in a form approved by the attorney general for a consideration not less than the appraised value.\nNotwithstanding section 272.68, subdivision 3, the commissioner may issue a permit, without a fee, to allow a person who owns land adjacent to a trail established under this section on land owned by the state in fee to continue a subsurface use of the trail right-of-way, if:\n(1) the person was carrying on the use when the state acquired the land for the trail; and\n(2) the use does not interfere with the public's use of the trail.\n(a) Notwithstanding section 16A.695, except as provided in paragraph (b), when a trail is established under this section, a private property owner who has a preexisting right of ingress and egress over the trail right-of-way is granted, without charge, a permanent easement for ingress and egress purposes only. The easement is limited to the preexisting crossing and reverts to the state upon abandonment. Nothing in this subdivision is intended to diminish or alter any written or recorded easement that existed before the state acquired the land for the trail.\n(b) The commissioner of natural resources shall assess the applicant an application fee of $2,000 for reviewing the application and preparing the easement. The applicant shall pay the application fee to the commissioner of natural resources. The commissioner shall not issue the easement until the applicant has paid the application fee in full. The commissioner shall not return the application fee, even if the application is withdrawn or denied.\n(c) Money received under paragraph (b) must be credited to the land management account in the natural resources fund and is appropriated to the commissioner of natural resources to cover the reasonable costs incurred under this section.\n(d) Notwithstanding paragraphs (a) to (c), the commissioner of natural resources may elect to assume the application fee under paragraph (b) if the commissioner determines that issuing the easement will benefit the state's land management interests.\n[Repealed, 1999 c 4 s 5]\nThe commissioner may not prohibit or otherwise restrict operation of an electric-assisted bicycle, as defined in section 169.011, subdivision 27, on any trail under this section for which bicycle use is permitted, unless the commissioner determines that operation of the electric-assisted bicycle is not consistent with (1) the safety or general welfare of trail users; or (2) the terms of any property conveyance.\nTrails designated under this section may include connections to state parks or recreation areas that generally lie in between or within the vicinity of the waymarks specifically named in the designation.\n(a) The trail shall originate in Lake Shetek State Park in Murray County and include the six-mile loop between Currie in Murray County and Lake Shetek State Park. From there, the first half of the trail shall trail southwesterly to Slayton in Murray County; thence westerly to the point of intersection with the most easterly terminus of the state-owned abandoned railroad right-of-way, commonly known as the Casey Jones unit; thence westerly along said Casey Jones unit to Pipestone in Pipestone County; thence southwesterly to Split Rock Creek State Park in Pipestone County; thence southeasterly to Blue Mounds State Park in Rock County; thence southerly to Luverne and Schoneman Park in Rock County, and there terminate. The second half of the trail shall commence in Lake Shetek State Park in Murray County and trail northeasterly to Walnut Grove in Redwood County; thence northeasterly to Redwood Falls in Redwood County to join with the Minnesota River State Trail.\n(b) The trail shall be developed as a multiuse, multiseasonal, dual treadway trail. Nothing herein shall abrogate the purpose for which the Casey Jones unit was originally established, and the use thereof shall be concurrent.\n[Repealed, 2014 c 248 s 19]\n(a) The trail shall originate at Rochester in Olmsted County and shall follow the route of the Chicago Great Western Railroad to Pine Island in Goodhue County and there terminate.\n(b) Additional trails may be established that extend the Douglas Trail system to include Pine Island, Mazeppa in Wabasha County to Zumbrota, Bellechester, Goodhue, and Red Wing in Goodhue County. In addition to the criteria in section 86A.05, subdivision 4, these trails must utilize abandoned railroad rights-of-way where possible.\n(c) The trail shall be developed primarily for riding and hiking.\n(d) Under no circumstances shall the commissioner acquire any of the right-of-way of the Chicago Great Western Railroad until the abandonment of the line of railway described in this subdivision has been approved by the Surface Transportation Board or the former Interstate Commerce Commission.\n(a) The trail shall originate at Kandiyohi County Park on the north shore of Green Lake in Kandiyohi County and thence extend northwesterly to Sibley State Park, thence northwesterly to Glacial Lakes State Park in Pope County, thence northeasterly to Lake Carlos State Park in Douglas County, and there terminate.\n(b) A segment shall be established beginning in the city of Willmar, Kandiyohi County, and extending northeasterly into Stearns County.\n(c) The trail shall be developed primarily for riding and hiking.\n(a) The trail shall originate at Fort Snelling State Park and thence extend generally southwesterly along the Minnesota River Valley through Hennepin, Dakota, Scott, Carver, Sibley, and Le Sueur Counties to the city of Le Sueur, and there terminate. The trail shall include the following state waysides:\n(1) Rice Lake Wayside, in Scott County;\n(2) Carver Rapids Wayside, in Scott County;\n(3) Lawrence wayside, in Scott County;\n(4) Belle Plaine Wayside, in Carver, Scott, and Sibley Counties;\n(5) Blakeley Wayside, in Scott County; and\n(6) Rush River Wayside, in Sibley County.\n(b) The trail shall be developed primarily for riding and hiking. Motorized vehicles are prohibited from that portion of the trail on the north side of the Minnesota River, lying between Fort Snelling State Park and Rice Lake Wayside. That portion of the trail on the north side of the Minnesota River, lying between the Bloomington Ferry Bridge pedestrian crossing and the Cedar Avenue Bridge, must be a paved trail developed primarily for hiking and bicycling.\n(c) In establishing, developing, maintaining, and operating the trail the commissioner shall cooperate with local units of government and private individuals and groups whenever feasible.\n(a) The Mississippi Blufflands Trail shall originate at the Cannon Valley Trail and thence extend generally southeasterly along the Mississippi River through Frontenac State Park in Goodhue County and continue through Goodhue and Wabasha Counties to the city of Lake City, and there terminate. The trail shall include connections to the Rattlesnake Bluff Trail.\n(b) The trail shall be developed primarily for riding and hiking.\n(c) In establishing, developing, maintaining, and operating the trail, the commissioner shall cooperate with local units of government and private individuals and groups whenever feasible.\n(a) The Root River Trail shall originate at Chatfield in Fillmore County, and thence extend easterly in the Root River Valley to the intersection of the river with Minnesota Trunk Highway No. 26 in Houston County, and extend to the Mississippi River.\n(b) Additional trails may be established that extend the Blufflands trail system to include La Crescent, Hokah, Caledonia, and Spring Grove in Houston County; Preston, Harmony, Fountain, Wykoff, Spring Valley, Mabel, Prosper, Canton, Ostrander, and connections to the Iowa border including a connection to Niagara Cave in Fillmore County; Rochester, Dover, Eyota, Stewartville, Byron, and Chester Woods County Park in Olmsted County; and Winona, Minnesota City, Rollingstone, Altura, Lewiston, Utica, St. Charles, and Elba in Winona County. In addition to the criteria in section 86A.05, subdivision 4, these trails must utilize abandoned railroad rights-of-way where possible.\n(c) The trails shall be developed primarily for nonmotorized riding and hiking.\n(a) The trail shall originate in Mankato, Blue Earth County, and shall extend in a northeasterly direction on or along the railroad right-of-way into Rice County.\n(b) The trail shall be developed primarily for riding and hiking. Motorized vehicles, except snowmobiles, are prohibited from the trail.\n(a) The trail shall originate at a point commonly known as Faribault Junction in Rice County, the termination point of the Sakatah Singing Hills Trail, and shall extend through the towns of Faribault, Dundas, Northfield, Waterford, and Randolph, to the termination point of the Cannon Valley Trail in Cannon Falls. The trail may be located within the Cannon River Wild, Scenic, and Recreational Land Use District.\n(b) The trail shall be developed primarily for riding and hiking. Motorized vehicles, except snowmobiles, are prohibited from the trail.\n[Repealed, 1973 c 684 s 3]\n(a) The trail shall originate at Gleason Lake in Plymouth Village, Hennepin County, follow the route of the Chicago Northwestern Railroad, and include a connection to Greenleaf Lake State Recreation Area.\n(b) The trail shall be developed for multiuse wherever feasible. The department shall cooperate in maintaining its integrity for modes of use consistent with local ordinances.\n(c) In establishing, developing, maintaining, and operating the trail, the commissioner shall cooperate with local units of government and private individuals and groups. Before acquiring any parcel of land for the trail, the commissioner of natural resources shall develop a management program for the parcel and conduct a public hearing on the proposed management program in the vicinity of the parcel to be acquired. The management program of the commissioner shall include but not be limited to the following:\n(1) fencing portions of the trail where necessary to protect adjoining landowners; and\n(2) maintaining the trail in a litter-free condition to the extent practicable.\n(d) The commissioner shall not acquire any of the right-of-way of the Chicago Northwestern Railway Company until the abandonment of the line described in this subdivision has been approved by the Surface Transportation Board or the former Interstate Commerce Commission. Compensation, in addition to the value of the land, shall include improvements made by the railroad, including but not limited to, bridges, trestles, public road crossings, or any portion thereof, it being the desire of the railroad that such improvements be included in the conveyance. The fair market value of the land and improvements shall be recommended by two independent appraisers mutually agreed upon by the parties. The fair market value thus recommended shall be reviewed by a review appraiser agreed to by the parties, and the fair market value thus determined, and supported by appraisals, may be the purchase price. The commissioner may exchange lands with landowners abutting the right-of-way described in this section to eliminate diagonally shaped separate fields.\n[Repealed, 2007 c 131 art 1 s 96]\n(a) The trail shall originate at Moorhead in Clay County and extend in an easterly direction through Detroit Lakes in Becker County to mile post 90.92 at Park Rapids in Hubbard County; thence in an easterly direction along the Burlington Northern Railroad right-of-way through Walker in Cass County; thence in a northerly direction along the Burlington Northern Railroad right-of-way to Cass Lake in Cass County, and there terminate. A segment shall be established that connects the trail to Itasca State Park.\n(b) The trail shall be developed primarily for riding and hiking.\n(a)(1) The Taconite Trail shall originate at Ely in St. Louis County and extend southwesterly to Tower in St. Louis County, thence westerly to McCarthy Beach State Park in St. Louis County, thence southwesterly to Grand Rapids in Itasca County and there terminate;\n(2) the C. J. Ramstad/Northshore Trail shall originate in Duluth in St. Louis County and extend northeasterly to Two Harbors in Lake County, thence northeasterly to Grand Marais in Cook County, thence northeasterly to the international boundary in the vicinity of the north shore of Lake Superior, and there terminate;\n(3) the David Dill/Arrowhead Trail shall originate at International Falls in Koochiching County and extend southeasterly through the Pelican Lake area in St. Louis County, intersecting with the Taconite Trail west of Tower; then the David Dill/Taconite Trail continues easterly to Ely in St. Louis County; then the David Dill/Tomahawk Trail extends southeasterly, outside the Boundary Waters Canoe Area, to the area of Little Marais in Lake County and there terminates at the intersection with the C. J. Ramstad/Northshore Trail; and\n(4) the Matthew Lourey Trail shall originate in Duluth in St. Louis County and extend southerly to Chengwatana State Forest in Pine County.\n(b) The trails shall be developed primarily for riding and hiking.\n(c) In addition to the authority granted in subdivision 1, lands and interests in lands for the Arrowhead region trails may be acquired by eminent domain. Before acquiring any land or interest in land by eminent domain the commissioner of administration shall obtain the approval of the governor. The governor shall consult with the Legislative Advisory Commission before granting approval. Recommendations of the Legislative Advisory Commission shall be advisory only. Failure or refusal of the commission to make a recommendation shall be deemed a negative recommendation.\n(a) The trail shall consist of six segments. One segment shall be known as the Gateway Trail and shall originate at the State Capitol and extend northerly and northeasterly to William O'Brien State Park, thence northerly to Taylors Falls in Chisago County. One segment shall originate in Chisago County and extend into Hinckley in Pine County. One segment shall be known as the Brown's Creek Trail and shall originate at Duluth Junction and extend into Stillwater in Washington County. One segment shall be known as the Munger Trail and shall originate at Hinckley in Pine County and extend through Moose Lake in Carlton County to Duluth in St. Louis County. One segment shall be known as the Alex Laveau Trail and shall originate in Carlton County at Carlton and extend through Wrenshall to the Minnesota-Wisconsin border. One segment shall be established that extends the trail to include the cities of Proctor, Duluth, and Hermantown in St. Louis County.\n(b) The Gateway and Brown's Creek Trails shall be developed primarily for hiking and nonmotorized riding and the remaining trails shall be developed primarily for riding and hiking.\n(c) In addition to the authority granted in subdivision 1, lands and interests in lands for the Gateway and Brown's Creek Trails may be acquired by eminent domain.\nThe trail shall originate in Crow Wing State Park in Crow Wing County and shall extend through the city of Baxter and in a northerly direction along the Burlington Northern Railroad right-of-way, intersecting the Heartland State Trail southwest of the city of Walker in Cass County. The trail shall continue on the Heartland State Trail through the city of Walker, then in a northwesterly direction along the Burlington Northern Railroad right-of-way to the city of Bemidji in Beltrami County and terminate in Lake Bemidji State Park.\nThe trail shall originate at the city of Duluth and shall extend in a northeasterly direction along the shoreline of Lake Superior to the city of Two Harbors. The trail shall be designed for bicycles and hikers, shall utilize existing highway and railroad right-of-way where possible, and shall be laid out in a manner to maximize the view of Lake Superior while traversing the length of the trail.\n(a) The trail shall originate in the city of LeRoy and extend in a northwesterly direction through Lake Louise State Park and the cities of Taopi, Adams, Rose Creek, and Lyle, to the city of Austin.\n(b) Additional trails shall be established to connect with the Bluffland trail system in Fillmore County and the trail from Riceville, Iowa.\n(c) The trail shall be developed primarily for hiking and nonmotorized riding.\n(a) The trail shall follow an abandoned railroad line originating in the city of Austin and extending northwesterly through Blooming Prairie and Owatonna to the city of Faribault.\n(b) The trail shall be developed primarily for hiking and nonmotorized riding.\n(a) The trail shall originate in the city of Albert Lea and extend to the city of Austin.\n(b) The trail shall be developed primarily for hiking and nonmotorized riding.\nThe trail shall originate at the Douglas Trail near the city of Rochester in Olmsted County and extend westerly along the Zumbro River Valley to the city of Mantorville and the village of Wasioja in Dodge County, following as closely as possible the Historic Stagecoach Trail to Wasioja, through Rice Lake State Park to the city of Owatonna in Steele County.\n(a) The trail shall originate in the city of Two Harbors and shall extend in a northeasterly direction along the shore of Lake Superior, running parallel to State Highway 61 to the city of Grand Marais.\n(b) The trail shall be developed primarily for hiking and bicycling.\nThe trail shall originate at the entrance to Big Stone Lake State Park and extend along the Minnesota River Valley to connect to the Minnesota Valley Trail at the city of Le Sueur. The trail shall include a loop between Fort Ridgely State Park and the cities of Redwood Falls and Sleepy Eye. A segment shall be established connecting the cities of Granite Falls and Montevideo.\nThe trail shall originate at the city of Fergus Falls and extend in a southeasterly direction through Grant and Douglas Counties to the eastern boundary of Douglas County.\n(a) The trail alignments shall originate in Crow Wing County at the Paul Bunyan Trail in the city of Baxter and shall extend in an east-northeasterly direction to the city of Riverton, Crow Wing County, where they shall connect to the Sagamore Mine segment of the Cuyuna Country State Recreation Area. The trail alignments shall then continue in a northeasterly direction, generally along and using former railroad rights-of-way insofar as practical, to connect with the main body of the Cuyuna Country State Recreation Area, the communities of Ironton and Crosby in Crow Wing County, and the Croft Mine Historical Park. The trail alignments shall then continue in an east-northeasterly direction, generally along and using former railroad rights-of-way insofar as practical, to the city of Cuyuna in Crow Wing County, and then continue east to the city of Aitkin, Aitkin County, and there terminate.\n(b) The trail shall be developed as a multiuse, multiseasonal, dual treadway trail.\nMS 2006 [Never effective]\nThe trail shall originate in the city of Plainview in Wabasha County and extend southwesterly through the city of Elgin in Wabasha County and the town of Viola in Olmsted County to the Chester Woods Trail in Olmsted County.\nThe trail shall originate in Jackson County at the Minnesota-Iowa border and connect with the Dickinson Trail in Mini-Wakan State Park in Iowa. To the greatest extent possible, the trail shall follow the Des Moines River Valley, extending northwesterly through Jackson County to Kilen Woods State Park, through Cottonwood County, and into Murray County. The trail shall terminate at Casey Jones Trail in Murray County.\nThe trail shall originate at Crow Wing State Park in Crow Wing County at the southern end of the Paul Bunyan Trail and shall extend from Crow Wing State Park westerly to the city of Pillager, then southerly along the west side of Camp Ripley, then easterly along the south side of Camp Ripley across to the east side of the Mississippi River, and then northerly through Fort Ripley to Crow Wing State Park. A second segment of the trail shall be established that shall extend in a southerly direction and in close proximity to the Mississippi River from the southeasterly portion of the first segment of the trail to the city of Little Falls, and then terminate at the Soo Line Trail in Morrison County. Separation of motorized and nonmotorized corridors is acceptable as needed.",
	"repealed": false
}