{
	"id": "327B.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/327B.095",
	"title": "327B.095 INTEREST, POINTS, FINANCE CHARGES, FEES, AND OTHER CHARGES.",
	"text": "(a) A manufactured home lender making or modifying a manufactured home loan to a borrower located in this state must not include in the principal amount of any loan, all or any portion of any lender fee in an aggregate amount exceeding:\n(1) five percent of the loan amount for loans over $60,000;\n(2) six percent of the loan amount for loans less than $60,000, but greater than or equal to $40,000; or\n(3) eight percent of the loan amount for loans of less than $40,000.\n(b) \"Lender fee\" means interest, origination points, finance charges, fees, and other charges payable in connection with the manufactured home loan:\n(1) by the borrower to any manufactured home lender or broker or to any assignee of any manufactured home lender or broker; or\n(2) by the lender to a broker.\n(c) Lender fee does not include discount points, provided there is a concomitant benefit to the borrower, recording fees, taxes, passthroughs, or other amounts that are paid by any person to any government entity, filing office, or other third party that is not a manufactured home lender or broker or to any assignee of any manufactured home lender or broker. Lender fee also does not include any amount that is set aside to pay taxes or insurance on any property securing the manufactured home loan.\n(d) \"Loan amount\" means:\n(1) for a line of credit, the maximum principal amount of the line of credit; and\n(2) for any other manufactured home loan, the principal amount of the loan, excluding all interest, points, finance charges, fees, and other charges.\n(e) A manufactured home lender or broker shall not charge, receive, or collect any excess financed interest, points, finance charges, fees, or other charges described in this subdivision, or any interest, points, finance charges, fees, or other charges with respect to this excess.\nNo manufactured home loan may contain a provision requiring or permitting the imposition of a penalty, fee, premium, or other charge in the event the manufactured home loan is prepaid in whole or in part unless the penalty, fee, premium, or other charge constitutes consideration for an equal or greater benefit to the borrower.\nThis section does not apply to a manufactured home loan originated by a federal or state chartered bank, savings bank, credit union, or a licensed sales finance company as defined under section 53C.01, subdivision 12.",
	"repealed": false
}