{
	"id": "18K.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/18K.02",
	"title": "18K.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Applicant\" means an individual who submits an application for a license as required under this chapter. If the applicant is an entity, applicant means the owner or most responsible individual in charge of the entity.\n\"Authorized representative\" means any individual authorized by the licensee to make changes to the license and share data on behalf of the licensee.\n\"Commissioner\" means the commissioner of agriculture.\n\"Entity\" means a corporation, joint stock company, association, limited partnership, limited liability partnership, limited liability company, irrevocable trust, estate, charitable organization, or other similar organization, including any such organization participating in hemp production as a partner in a general partnership, a participant in a joint venture, or a participant in a similar organization.\n\"Industrial hemp\" means the plant Cannabis sativa L. and any part of the plant, whether growing or not, including the plant's seeds, and all the plant's derivatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers, whether growing or not, with a delta-9 tetrahydrocannabinol concentration of not more than 0.3 percent on a dry weight basis. Industrial hemp is not marijuana as defined in section 152.01, subdivision 9.\n\"Marijuana\" has the meaning given in section 152.01, subdivision 9.\n\"Processing\" means rendering by refinement hemp plants or hemp plant parts from their natural or original state after harvest. Processing includes but is not limited to decortication, devitalization, chopping, crushing, extraction, and packaging. Processing does not include typical farm operations such as sorting, grading, baling, and harvesting. Processing does not include the production of artificially derived cannabinoids as defined in section 342.01, subdivision 6.\n\"Processing location\" means any area, building, plant, or facility registered with and approved by the commissioner in which a licensee converts raw hemp into a marketable product.\n\"Processor\" means a person or business that converts raw hemp into a product.",
	"repealed": false
}