{
	"id": "161.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.315",
	"title": "161.315 PROTECTION OF PUBLIC CONTRACTS.",
	"text": "Recognizing that the preservation of the integrity of the public contracting process of the Department of Transportation is vital to the development of a balanced and efficient transportation system and a matter of interest to the people of the state, the legislature hereby determines and declares that:\n(1) the procedures of the department for bidding and awarding department contracts exist to secure the public benefits of free and open competition and to secure the quality of public works;\n(2) the opportunity to be awarded department contracts or to supply goods or services to the department is a privilege, not a right; and\n(3) the privilege of transacting business with the department or local road authority should be denied to persons convicted of a contract crime in order to preserve the integrity of the public contracting process.\nThe terms used in this section have the meanings given them in this subdivision.\n(a) \"Affiliate\" means a predecessor or successor of a person by merger, reorganization, or otherwise, who is, or that has as an officer or director an individual who is, a relative of the person or an individual over whose actions the person exercises substantial influence or control, or a group of entities so connected or associated that one entity controls or has the power to control each of the other entities. \"Affiliate\" includes the affiliate's principals. One person's ownership of a controlling interest in another entity or a pooling of equipment or income among entities is prima facie evidence that one entity is an affiliate of another.\n(b) \"Contract crime\" means a violation of state or federal antitrust law, fraud, theft, embezzlement, bribery, forgery, misrepresentation, making false statements, falsification or destruction of records, or other criminal offense in connection with obtaining, attempting to obtain, or performing a public or private contract or subcontract.\n(c) \"Conviction\" has the meaning given it in section 609.02, subdivision 5.\n(d) \"Debar\" means to disqualify from receiving a contract or from serving as a subcontractor or material supplier as provided by Laws 1984, chapter 654, article 2, section 8.\n(e) \"Person\" means a natural person or a business, corporation, association, partnership, sole proprietorship, or other entity formed to do business as a contractor, subcontractor, or material supplier and includes an affiliate of a person.\n(f) \"Pooling\" means a combination of persons engaged in the same business or combined for the purpose of engaging in a particular business or commercial venture and who all contribute to a common fund or place their holdings of a given stock or other security in the hand and control of a managing member or committee of the combination.\n(g) \"Suspend\" means to temporarily disqualify from receiving a contract or from serving as a subcontractor or material supplier as provided by Laws 1984, chapter 654, article 2, section 8.\n(h) \"Relative\" means an individual related by consanguinity within the second degree as determined by the common law, a spouse, or an individual related to a spouse within the second degree as determined by the common law, and includes an individual in an adoptive relationship within the second degree as determined by the common law.\nExcept as provided in subdivision 4:\n(1) neither the commissioner nor a county, town, or home rule or statutory city may award or approve the award of a contract for goods or services to a person who is suspended or debarred;\n(2) neither the commissioner nor a county, town, or home rule or statutory city may award or approve the award of a contract for goods or services under which a debarred or suspended person will serve as a subcontractor or material supplier;\n(3) a person to whom a contract for goods or services has been awarded may not subcontract with or purchase materials or services from a debarred or suspended person for performance of that contract; and\n(4) when a debarred person sells or otherwise transfers to a relative or to any other party over whose actions the debarred person exercises substantial influence or control, a business, corporation, association, partnership, sole proprietorship, or other entity, or an affiliate of the entity, that is ineligible by virtue of the debarment to contract with a governmental entity, the sold or transferred entity remains ineligible for these contracts for the duration of the seller's or transferor's debarment.\nThe commissioner may terminate a debarment by order, or the commissioner or a county, town, or home rule or statutory city may award a contract to a debarred or suspended person when:\n(1) that person is the sole supplier of a material or service required by the commissioner or a county, town, or home rule or statutory city;\n(2) the commissioner determines that an emergency exists as defined in section 161.32, subdivision 3;\n(3) the commissioner of administration determines that an emergency exists as defined in section 16C.10, subdivision 2;\n(4) in the case of a contract to be awarded by a county, town, or home rule or statutory city, the governing body thereof determines by resolution that an emergency exists that will result in a road, street, or bridge being closed to travel; or\n(5) the contract is for purchasing materials or renting equipment for routine road maintenance.\nA person who has been convicted of a contract crime must be debarred for a period of not less than one year. This subdivision applies to contract crime violations which occur after June 30, 1985.\nThe disqualification of a contractor or its affiliate does not affect the contractor's or its affiliate's obligations under any preexisting contract.",
	"repealed": false
}