{
	"id": "103G.237",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.237",
	"title": "103G.237 COMPENSATION FOR LOSS OF PRIVATE USE.",
	"text": "A person whose replacement plan is not approved must be compensated as provided in this section. The person may drain or fill the wetland without an approved replacement plan if the person:\n(1) is eligible for compensation under subdivision 2;\n(2) applies for compensation in accordance with subdivision 3; and\n(3) does not receive the compensation required in subdivision 4 within 90 days after the application for compensation is received by the board.\nA person is eligible for compensation if:\n(1) the person applies for replacement plan approval under section 103G.2242;\n(2) the replacement plan is not approved or the plan conditions make the proposed use unworkable or not feasible;\n(3) the person appeals the disapproval of the plan;\n(4) the proposed use would otherwise be allowed under federal, state, and local laws, rules, ordinances, and other legal requirements;\n(5) the person has suffered or will suffer damages;\n(6) disallowing the proposed use will enhance the public value of the wetland; and\n(7) the person applies to the board for compensation.\nAn application for compensation must be made on forms prescribed by the board and include:\n(1) the location and public value of the wetland where the use was proposed;\n(2) a description and reason for the proposed wetland use; and\n(3) the objection to the replacement plan, if any.\n(a) The board shall award compensation in an amount equal to the greater of:\n(1) 50 percent of the value of the wetland, calculated by multiplying the acreage of the wetland by the greater of:\n(i) the average equalized estimated market value of agricultural property in the township as established by the commissioner of revenue at the time application for compensation is made; or\n(ii) the assessed value per acre of the parcel containing the wetland, based on the assessed value of the parcel as stated on the most recent tax statement; or\n(2) $200 per acre of wetland subject to the replacement plan, increased or decreased by the percentage change of the assessed valuation of land in the township where the wetland is located from the 1995 valuation.\n(b) A person who receives compensation under paragraph (a) shall convey to the board a permanent conservation easement as described in section 103F.515, subdivision 4. An easement conveyed under this paragraph is subject to correction and enforcement under section 103F.515, subdivisions 8 and 9.\n(a) At the request of a local government unit against which a compensation action is brought based at least in part on the local government unit's application of this section or section 103G.222, 103G.2241, 103G.2242, 103G.2243, or 103G.2372, or rules adopted by the board to implement these sections, the state, through the attorney general, shall intervene in the action on behalf of the local government unit and shall thereafter be considered a defendant in the action. A local government unit making a request under this paragraph shall provide the attorney general with a copy of the complaint as soon as possible after being served. If requested by the attorney general, the court shall grant additional time to file an answer equal to the time between service of the complaint on the local government unit and receipt of the complaint by the attorney general.\n(b) The state is liable for costs, damages, fees, and compensation awarded in the action based on the local government unit's adoption or implementation of standards that are required by state law, as determined by the court. The local government unit is liable for costs, damages, fees, and compensation awarded in the action based on local standards that are more restrictive than state law and rules.\n(c) For the purposes of this subdivision, \"compensation action\" means an action in which the plaintiff seeks compensation for a taking of private property under the state or federal constitution.",
	"repealed": false
}