{
	"id": "16A.662",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.662",
	"title": "16A.662 INFRASTRUCTURE DEVELOPMENT BONDS.",
	"text": "The infrastructure development fund is created as an account in the state treasury. The commissioner of management and budget shall credit to the fund income from the sources provided by law. The commissioner of management and budget shall from time to time certify to the State Board of Investment the assets of the fund not currently needed. The amount certified must be invested by the State Board of Investment subject to section 11A.24. Investment income and investment losses attributable to investment of fund assets must be credited to or borne by the fund.\nWhen authorized by law enacted in accordance with the constitution, article XI, sections 5 and 7, the commissioner may by order sell and issue bonds of the state evidencing public debt incurred for any purpose stated in the law. The bonds are general obligations of the state, and the full faith and credit of the state are pledged for their payment.\nThe bonds must be issued and sold in accordance with section 16A.641. Sections 16A.672 and 16A.675 apply to the bonds.\nThere is established within the state bond fund a separate and special account designated as the infrastructure development bond debt service account. The money on hand in the debt service account must be used solely for the payment of the principal of and interest on bonds issued under Laws 1990, chapter 610, article 1, section 30, subdivision 2, and is appropriated for this purpose. This appropriation does not cancel as long as any of the bonds remain outstanding.\n(a) In order to reduce the amount otherwise required to be transferred to the state bond fund with respect to bonds heretofore or hereafter issued under Laws 1990, chapter 610, article 1, section 30, subdivision 2, the commissioner of management and budget shall assess each higher education system for one-third the amount that would otherwise need to be transferred with respect to those bonds sold to finance capital improvement projects at institutions under the control of the system; provided that, to the extent that the amount to be transferred is for payment of principal and interest on bonds sold to finance life safety improvements, the commissioner must not assess the higher education systems for the transfer.\n(b) After each sale of the bonds, the commissioner of management and budget shall notify the Board of Trustees of the Minnesota State Colleges and Universities and the regents of the University of Minnesota of the amounts for which each system is responsible for each year for the life of the bonds. The amounts payable each year are reduced by one-third of the net income from investment of those bond proceeds that must be allocated among the systems in proportion to the amount of principal and interest otherwise required to be paid by each. Each higher education system shall pay its annual share of debt service payments to the commissioner of management and budget by December 1 each year. If a higher education system fails to make a payment when due, the commissioner of management and budget shall reduce allotments for appropriations from the general fund otherwise payable to the system to cover the amount of the missed debt service payment. The commissioner of management and budget shall credit the payments received from the higher education systems to the infrastructure development bond debt service account in the state bond fund each December 1 before the transfer is made under subdivision 4.\nThere is annually appropriated from the general fund for transfer to the infrastructure development bond debt service account the amount that, added to the amount in the infrastructure development bond debt service account on December 1 each year, after giving effect to subdivisions 4 and 5, is equal to the full amount of principal and interest to come due on all bonds to and including July 1 in the second ensuing year.\nUnder the constitution, article XI, section 7, the state auditor must levy each year on all taxable property within the state a tax sufficient, with the amount then on hand in the infrastructure development bond debt service account, to pay all principal and interest on the bonds due and to become due to and including July 1 in the second ensuing year. The tax is not subject to limit as to rate or amount. However, the amount of money appropriated from other sources as provided in subdivisions 4, 5, and 6, and actually received and on hand before the levy in any year, reduces the amount of the tax otherwise required to be levied. The proceeds of the tax must be credited to the infrastructure development bond debt service account.\nThe proceeds of the bonds must be deposited and spent as provided in this subdivision and are appropriated for those purposes. Any accrued interest and any premium received on the sale of the bonds must be credited to the infrastructure development bond debt service account. Except as otherwise required by law, the balance of the bond proceeds shall be credited to the infrastructure development fund and spent for the purposes specified in the law authorizing the issuance of the bonds. So much of the proceeds as is necessary must be used to pay costs incurred in issuing and selling the bonds.",
	"repealed": false
}