{
	"id": "299F.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.092",
	"title": "299F.092 DEFINITIONS.",
	"text": "The terms used in sections 299F.091 to 299F.099 have the meanings given them in this section.\n\"Classified information\" means information, data, or both that, for security reasons, has been given a special security classification such as \"secret,\" \"confidential,\" \"private,\" or \"nonpublic,\" by federal statute or rule and that, when so classified, is subject to handling, use, and storage in accordance with established standards to prevent unauthorized use or disclosure.\n\"Commissioner\" means the commissioner of public safety.\n\"Emergency response personnel\" means personnel employed or authorized by the federal government, the state, or a political subdivision to provide fire suppression, police protection, emergency medical services, or emergency activities relating to health and safety.\n\"Employer\" means an employer as defined in section 182.651, subdivision 7. For the purposes of sections 299F.091 to 299F.099, \"employer\" also means a partnership or a self-employed person, whether or not the partnership or person has other employees. \"Employer\" does not mean a farm that is a \"small business.\"\n\"Fire department\" means a regularly organized fire department, fire protection district, or fire company as defined in the State Fire Code adopted under section 326B.02, subdivision 6, regularly charged with the responsibility of providing fire protection to the state or a political subdivision.\n\"Hazard category\" means a list or description of hazardous substances, as developed by rule by the commissioner of public safety, including human reproductive hazards, flammable substances, human carcinogens, explosives, corrosives, and reactive agents, that present similar hazards in an emergency, or individual hazardous substances of special concern to emergency response personnel.\n\"Hazardous substance\" means a substance or mixture as defined in section 182.651, subdivisions 14, 17, and 18, except that sections 299F.091 to 299F.099 do not apply to any hazardous substance while it is being transported in interstate or intrastate commerce.\n[Repealed, 1993 c 337 s 20]\n\"Hazardous substance notification report\" means a written record submitted to a fire department, for each workplace, that contains the information required in section 299F.094.\n\"Local fire department\" means the fire department that would normally respond to a fire at a given workplace.\n\"Material safety data sheet\" means a completed form recognized by the occupational safety and health administration, equivalent manufacturer's literature, or another form containing substantially the same information pertaining to a specific hazardous substance or a mixture containing one or more hazardous substances.\n\"Nonpublic data\" has the meaning given it in section 13.02, subdivision 9.\n\"Significant change\" means a change in the reportable quantity of a hazardous substance that places the substance in a different quantity range as specified on the hazardous substance notification report form.\n\"Small business\" means a business entity organized for profit, including any individual, partnership, corporation, joint venture, association, or cooperative that has 20 or fewer full-time employees, or equivalent full-time employees during the preceding fiscal year or not more than $1,000,000 in annual gross revenue in the preceding fiscal year, and that is not an affiliate or subsidiary of a business having more than 20 full-time or equivalent full-time employees and more than $1,000,000 in annual gross revenues. For the purposes of this subdivision, \"equivalent full-time employees\" means part-time employees' work time combined to total 2,000 hours or the equivalent of one full-time employee.\n\"Work area\" means a defined space in a workplace where hazardous chemicals are stored, produced, or used and where employees are present.\n\"Workplace\" means an establishment at one geographical location containing one or more work areas.",
	"repealed": false
}