{
	"id": "181.938",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.938",
	"title": "181.938 NONWORK ACTIVITIES; PROHIBITED EMPLOYER CONDUCT.",
	"text": "For the purpose of this section, \"employer\" has the meaning given it in section 179.01, subdivision 3.\n(a) An employer may not refuse to hire a job applicant or discipline or discharge an employee because the applicant or employee engages in or has engaged in the use or enjoyment of lawful consumable products, if the use or enjoyment takes place off the premises of the employer during nonworking hours. For purposes of this section, \"lawful consumable products\" means products whose use or enjoyment is lawful and which are consumed during use or enjoyment, and includes food, alcoholic or nonalcoholic beverages, tobacco, cannabis flower, as defined in section 342.01, subdivision 16, cannabis products, as defined in section 342.01, subdivision 20, lower-potency hemp edibles as defined in section 342.01, subdivision 50, and hemp-derived consumer products as defined in section 342.01, subdivision 37.\n(b) Cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products are lawful consumable products for the purpose of Minnesota law, regardless of whether federal or other state law considers cannabis use, possession, impairment, sale, or transfer to be unlawful. Nothing in this section shall be construed to limit an employer's ability to discipline or discharge an employee for cannabis flower, cannabis product, lower-potency hemp edible, or hemp-derived consumer product use, possession, impairment, sale, or transfer during working hours, on work premises, or while operating an employer's vehicle, machinery, or equipment, or if a failure to do so would violate federal or state law or regulations or cause an employer to lose a monetary or licensing-related benefit under federal law or regulations.\n(a) It is not a violation of subdivision 2 for an employer to restrict the use of lawful consumable products by employees during nonworking hours if the employer's restriction:\n(1) relates to a bona fide occupational requirement and is reasonably related to employment activities or responsibilities of a particular employee or group of employees; or\n(2) is necessary to avoid a conflict of interest or the appearance of a conflict of interest with any responsibilities owed by the employee to the employer.\n(b) It is not a violation of subdivision 2 for an employer to refuse to hire an applicant or discipline or discharge an employee who refuses or fails to comply with the conditions established by a substance use disorder treatment or aftercare program.\n(c) It is not a violation of subdivision 2 for an employer to offer, impose, or have in effect a health or life insurance plan that makes distinctions between employees for the type of coverage or the cost of coverage based upon the employee's use of lawful consumable products, provided that, to the extent that different premium rates are charged to the employees, those rates must reflect the actual differential cost to the employer.\n(d) It is not a violation of subdivision 2 for an employer to refuse to hire an applicant or discipline or discharge an employee on the basis of the applicant's or employee's past or present job performance.\nThe sole remedy for a violation of subdivision 2 is a civil action for damages. Damages are limited to wages and benefits lost by the individual because of the violation. A court shall award the prevailing party in the action, whether plaintiff or defendant, court costs and a reasonable attorney fee.",
	"repealed": false
}