{
	"id": "477A.0126",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.0126",
	"title": "477A.0126 REIMBURSEMENT TO COUNTIES AND TRIBES FOR CERTAIN OUT-OF-HOME PLACEMENTS.",
	"text": "For purposes of this section, \"out-of-home placement\" means 24-hour substitute care for an Indian child as defined by section 260C.007, subdivision 21, away from the child's parent or guardian and for whom the county or tribal social services agency has been assigned responsibility for the child's placement and care, which includes placement in foster care under section 260C.007, subdivision 18.\n(a) By July 1, 2017, and each June 1 thereafter, each county shall report the following information to the commissioner of children, youth, and families:\n(1) the amount paid out of the county's social service agency budget for out-of-home placement of Indian children in the calendar year immediately preceding the year in which the report was made; and\n(2) the number of days foster care maintenance payments were made for each Indian child the calendar year immediately preceding the year in which the report was made.\n(b) The commissioner of children, youth, and families shall prescribe the format of the report. By July 15, 2017, and each July 1 thereafter, the commissioner of children, youth, and families shall certify to the commissioner of revenue and to the legislative committees with jurisdiction over local government aids and out-of-home placement funding the data reported under this subdivision and whether it accurately reflects total expenditures by counties for out-of-home placement costs of Indian children. The commissioner of children, youth, and families shall also certify to the commissioner of revenue the reimbursement amounts received from the federal government for out-of-home placement costs for the previous calendar year received by each initiative tribe under section 142A.03, subdivision 9.\n(c) Until the commissioner of children, youth, and families develops another mechanism for collecting and verifying data on out-of-home placements of Indian children, the data collected under this subdivision must be used to calculate payments under subdivision 3.\n(a) For aids payable in calendar year 2018 and thereafter, the Department of Revenue shall reimburse each county the county's proportionate share of the appropriation in subdivision 7 that remains after the aid for tribes in subdivision 4 has been paid.\n(b) Each county's proportionate share is based on the county's nonfederal share of the cost for out-of-home placement of Indian children for the calendar year that was certified by the commissioner of children, youth, and families under subdivision 2, paragraph (b), provided that:\n(1) the commissioner of children, youth, and families certifies to the commissioner of revenue that accurate data are available to make the aid determination under this section; and\n(2) the commissioner of children, youth, and families certifies to the commissioner of revenue that the county is in substantial compliance with the compliance review system developed in accordance with subdivision 6.\n(c) If the commissioner of children, youth, and families determines that a county is substantially out of compliance with the Indian Child Welfare Act or the Minnesota Indian Family Preservation Act, as determined under subdivision 6, the commissioner of children, youth, and families shall provide written notice to the county of its noncompliance, and what actions are necessary by the county to improve and maintain compliance.\n(d) If the county remains substantially out of compliance with the Indian Child Welfare Act or the Minnesota Indian Family Preservation Act as determined by the commissioner of children, youth, and families under subdivision 6 for a second consecutive year, the county shall be eligible for 50 percent of the aid under this section beginning with the next certification and until the commissioner of children, youth, and families certifies to the commissioner of revenue that the county is in substantial compliance and is eligible for the aid payment. The commissioner of children, youth, and families shall certify to the commissioner of revenue by July 1 of each year which counties are eligible for an aid reduction in the following year.\n(a) For aid payable in 2023 and later, the commissioner must transfer the total amount of the aid reductions under subdivision 3, paragraph (d), for that year to the Board of Regents of the University of Minnesota for the Tribal and Training Certification Partnership in the College of Education and Human Service Professions at the University of Minnesota, Duluth.\n(b) In order to support consistent training and county compliance with the Indian Child Welfare Act and the Minnesota Indian Family Preservation Act, the Tribal Training and Certification Partnership must use funds transferred under this subdivision to (1) enhance training on the Indian Child Welfare Act and Minnesota Indian Family Preservation Act for county workers and state guardians ad litem, and (2) build indigenous child welfare training for the Tribal child welfare workforce.\nFor aids payable in 2018 and thereafter, the amount of reimbursement to each initiative tribe under section 142A.03, subdivision 9, shall be the greater of:\n(1) five percent of the reimbursement amount received from the federal government for out-of-home placement costs for the previous calendar year that was certified under subdivision 2, paragraph (b); or\n(2) $200,000.\nThe commissioner of revenue must compute the amount of the reimbursement aid payable to each county and tribe under this section. On or before August 1 of each year, the commissioner shall certify the amount to be paid to each county and tribe in the following year. The commissioner shall pay reimbursement aid annually at the times provided in section 477A.015.\n(a) By January 1, 2018, the commissioner of children, youth, and families, in consultation with counties and tribes, shall develop a system to review county compliance with the Indian Child Welfare Act and the Minnesota Indian Family Preservation Act. The system may include, but is not limited to, the cases to be reviewed, the criteria to be reviewed to demonstrate compliance, the rate of noncompliance and the coordinating penalty, the program improvement plan, and training.\n(b) The commissioner of children, youth, and families shall provide continuous review of cases reported by counties for aid payments under this section for compliance with the Indian Child Welfare Act and the Minnesota Indian Family Preservation Act.\n(c) The determination made by the commissioner of children, youth, and families regarding a county's compliance or noncompliance with the Indian Child Welfare Act and the Minnesota Indian Family Preservation Act shall be final.\n(a) $5,000,000 is annually appropriated to the commissioner of revenue from the general fund to pay aid and make transfers required under this section.\n(b) $390,000 is appropriated annually from the general fund to the commissioner of children, youth, and families to implement subdivision 6.",
	"repealed": false
}