{
	"id": "340A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.101",
	"title": "340A.101 DEFINITIONS.",
	"text": "For purposes of this chapter the following terms have the meanings given them.\n\"Alcoholic beverage\" is any beverage containing more than one-half of one percent alcohol by volume.\n\"Affiliate or subsidiary company\" is a company in which a manufacturer or its stockholders own a majority of the stock.\n\"Brew pub\" is a brewer who also holds one or more retail on-sale licenses and who manufactures fewer than 3,500 barrels of malt liquor in a year, at any one licensed premises, the entire production of which is solely for consumption on tap on any licensed premises owned by the brewer, or for off-sale from those licensed premises as permitted in section 340A.24, subdivision 2.\n\"Brewer\" is a person who manufactures malt liquor for sale.\n\"Bulk distilled spirits\" means distilled spirits in a container having a capacity in excess of one gallon.\n\"Bulk wine\" means wine in a container having a capacity of five or more gallons.\n\"City\" is a home rule charter or statutory city unless otherwise specified.\n\"Commissioner\" is the commissioner of public safety except as otherwise provided.\n\"Club\" is an incorporated organization organized under the laws of the state for civic, fraternal, social, or business purposes, for intellectual improvement, or for the promotion of sports, or a congressionally chartered veterans' organization, which:\n(1) has more than 30 members;\n(2) has owned or rented a building or space in a building for more than one year that is suitable and adequate for the accommodation of its members;\n(3) is directed by a board of directors, executive committee, or other similar body chosen by the members at a meeting held for that purpose. No member, officer, agent, or employee shall receive any profit from the distribution or sale of beverages to the members of the club, or their guests, beyond a reasonable salary or wages fixed and voted each year by the governing body.\n\"Department\" is the Department of Public Safety except as otherwise provided.\n\"Distilled spirits\" is ethyl alcohol, hydrated oxide of ethyl, spirits of wine, whiskey, rum, brandy, gin, and other distilled spirits, including all dilutions and mixtures thereof, for nonindustrial use.\n\"Distilled spirits manufacturer\" means a distillery operated within the state producing distilled spirits in a total quantity exceeding the proof gallons limit for a microdistillery in a calendar year.\n\"Exclusive liquor store\" is an establishment used exclusively for the sale of those items authorized in section 340A.412, subdivision 14.\n\"Fortified wine\" is wine to which brandy, or neutral grape spirits, has been added during or after fermentation resulting in a beverage containing not less than one-half of one percent nor more than 24 percent alcohol by volume for nonindustrial use.\n\"Farm winery\" is a winery operated by the owner of a Minnesota farm and producing table, sparkling, or fortified wines from grapes, grape juice, other fruit bases, or honey with a majority of the ingredients grown or produced in Minnesota.\n[See Note.]\n\"General food store\" is a business primarily engaged in selling food and grocery supplies to the public for off-premise consumption.\n\"Home brewing equipment\" means portable equipment designed for use in home manufacturing of malt liquor in quantities of ten gallons or less and supplies and ingredients for home manufacture of malt liquor.\n\"Hotel\" is an establishment where food and lodging are regularly furnished to transients and which has:\n(1) a dining room serving the general public at tables and having facilities for seating at least 30 guests at one time; or\n(2) guest rooms in the following minimum numbers: in first class cities, 50; in second class cities, 15; in all other cities and unincorporated areas, 10.\n\"Intoxicating liquor\" is ethyl alcohol, distilled, fermented, spirituous, vinous, and malt beverages containing more than 3.2 percent of alcohol by weight.\n\"Licensed premises\" is the premises described in the approved license application, subject to the provisions of section 340A.410, subdivision 7. In the case of a restaurant, club, or exclusive liquor store licensed for on-sales of alcoholic beverages and located on a golf course, \"licensed premises\" means the entire golf course except for areas where motor vehicles are regularly parked or operated.\n\"Low-alcohol malt liquor\" is a fermented malt beverage containing two percent or less of alcohol by weight. Notwithstanding any law or rule to the contrary, if either; (a) the term \"low alcohol\" appears on the label of the beverage container; or (b) a brewer has provided written certification to the Department of Public Safety establishing an alcoholic content of two percent or less by weight; no further label shall be required on that container.\n\"Liqueur-filled candy\" is any confectionery containing more than one-half of one percent alcohol by volume in liquid form that is intended for or capable of beverage use.\n\"Malt liquor\" is any beverage made from malt by fermentation, or by the fermentation of malt substitutes, including rice, grain of any kind, glucose, sugar, molasses, or other malt substitute that has not undergone distillation, and that contains not less than one-half of one percent alcohol by volume. \"Beer\" means any beverage meeting the definition of malt liquor under this subdivision.\n\"Manufacturer\" is a person who, by a process of manufacture, fermenting, brewing, distilling, refining, rectifying, blending, or by the combination of different materials, prepares or produces intoxicating liquor for sale.\n\"Microdistillery\" is a distillery operated within the state producing premium, distilled spirits in total quantity not to exceed 40,000 proof gallons in a calendar year.\n\"Municipality\" is a city, county or, for purposes of licensing under section 340A.404, subdivision 7, the Metropolitan Airports Commission.\n\"3.2 percent malt liquor\" is malt liquor containing not less than one-half of one percent alcohol by volume nor more than 3.2 percent alcohol by weight.\n\"Off-sale\" is the sale of alcoholic beverages in original packages for consumption off the licensed premises only.\n\"On-sale\" is the sale of alcoholic beverages for consumption on the licensed premises only.\n\"Package\" is a sealed or corked container of alcoholic beverages.\n\"Person\" has the meaning given it in section 645.44, subdivision 7.\n\"Population\" is determined by the most recent federal decennial census or a special census taken under law.\nMS 2010 [Renumbered subd 24b]\nA \"proof gallon\" is one liquid gallon of distilled spirits that is 50 percent alcohol at 60 degrees Fahrenheit.\n\"Public facility\" is a park, community center, or other accommodation or facility owned or managed by or on behalf of a subdivision of the state, including any county, city, town, township, or independent district of the state.\n\"Restaurant\" is an establishment, other than a hotel, under the control of a single proprietor or manager, where meals are regularly prepared on the premises and served at tables to the general public, and having a minimum seating capacity for guests as prescribed by the appropriate license issuing authority.\n\"Retail\" is sale for consumption.\n\"Table or sparkling wine\" is a beverage made without rectification or fortification and containing not more than 25 percent of alcohol by volume and made by the fermentation of grapes, grape juice, other fruits, or honey.\n\"Theater\" means a building containing an auditorium in which live dramatic, musical, dance, or literary performances are regularly presented to holders of tickets for those performances.\n\"Wholesaler\" is a person who sells alcoholic beverages to persons to whom sale is permitted under section 340A.310, from a stock maintained in a warehouse in the state.\n\"Wine\" is the product made from the normal alcoholic fermentation of grapes, including still wine, sparkling and carbonated wine, wine made from condensed grape must, wine made from other agricultural products than sound, ripe grapes, imitation wine, compounds sold as wine, vermouth, cider, perry and sake, in each instance containing not less than one-half of one percent nor more than 24 percent alcohol by volume for nonindustrial use. Wine does not include distilled spirits as defined in subdivision 9.\nMS 2008 [Renumbered subd 10a]",
	"repealed": false
}