{
	"id": "169.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.64",
	"title": "169.64 PROHIBITED LIGHTS; EXCEPTIONS.",
	"text": "Any lighted lamp or illuminating device upon a motor vehicle, other than a headlamp, a spot lamp, or an auxiliary driving lamp, which projects a beam of light of an intensity greater than 300-candle power, shall be so directed that no part of the beam will strike the level of the roadway on which the vehicle stands at a distance of more than 75 feet from the vehicle.\n(a) Unless otherwise authorized by the commissioner of public safety, no vehicle shall be equipped, nor shall any person drive or move any vehicle or equipment upon any highway with any lamp or device displaying a red light or any colored light other than those required or permitted in this chapter.\n(b) A vehicle manufactured for use as an emergency vehicle may display and use colored lights that are not otherwise required or permitted in this chapter, provided that the vehicle is owned and operated according to section 168.10, is owned and operated solely as a collector's item and not for general transportation purposes, and is registered under section 168.10, subdivision 1a, 1b, 1c, 1d, 1g, or 1h. A person may not activate the colored lights authorized under this paragraph on streets or highways except as part of a parade or other special event.\n(a) Flashing lights are prohibited, except:\n(1) on an authorized emergency vehicle, school bus, bicycle as provided in section 169.222, subdivision 6, road maintenance equipment, tow truck or towing vehicle as provided in section 168B.16, service vehicle, farm tractor, self-propelled farm equipment, rural mail carrier vehicle, or funeral home vehicle;\n(2) on any vehicle as a means of indicating a right or left turn, or the presence of a vehicular traffic hazard requiring unusual care in approaching, overtaking, or passing; or\n(3) as otherwise provided in this section.\n(b) All flashing warning lights must be of the type authorized by section 169.59, subdivision 4, unless otherwise permitted or required in this chapter.\n(c) A stop lamp or signal lamp is prohibited from projecting a glaring or dazzling light, except for:\n(1) strobe lamps as provided under subdivision 8 or section 169.59, subdivision 4; or\n(2) a school bus equipped with a supplemental warning system under section 169.4503, subdivision 31.\n(a) Except as provided in paragraphs (b) to (d), blue lights are prohibited on all vehicles except road maintenance equipment and snow removal equipment operated by or under contract to the state or a political subdivision thereof.\n(b) Authorized emergency vehicles may display flashing blue lights to the rear of the vehicle as a warning signal in combination with other lights permitted or required by this chapter. In addition, authorized emergency vehicles may display, mounted on the passenger side only, flashing blue lights to the front of the vehicle as a warning signal in combination with other lights permitted or required by this chapter.\n(c) A motorcycle may display a blue light of up to one-inch diameter as part of the motorcycle's rear brake light.\n(d) A motor vehicle may display a blue light of up to one-inch diameter as part of the vehicle's rear brake light if:\n(1) the vehicle is a collector vehicle, as described in section 168.10; or\n(2) the vehicle is eligible to display a collector plate under section 168.10.\n(a) It is unlawful to project a white light at the rear of a vehicle while traveling on any street or highway, except:\n(1) for a vehicle moving in reverse;\n(2) for a school bus equipped with a supplemental warning system under section 169.4503, subdivision 31;\n(3) for a strobe lamp as provided under subdivision 8;\n(4) as required for license plate illumination under section 169.50, subdivision 2;\n(5) as provided in section 169.59, subdivision 4; and\n(6) as otherwise provided in this subdivision.\n(b) A lighting device mounted on top of a vehicle engaged in deliveries to residences may project a white light to the rear if the sign projects one or more additional colors to the rear.\n(c) An authorized emergency vehicle may display an oscillating, alternating, or rotating white light used in connection with an oscillating, alternating, or rotating red light when responding to emergency calls.\nMS 2010 [Renumbered 168B.16]\n(a) Any service vehicle may be equipped with a flashing amber lamp of a type approved by the commissioner of public safety.\n(b) A service vehicle shall not display the lighted lamp authorized under paragraph (a) when traveling upon the highway or at any other time except at the scene of a disabled vehicle or while engaged in snow removal or road maintenance.\n(c) A self-propelled implement of husbandry may display the lighted lamp authorized under paragraph (a) at any time.\n[Repealed, 1991 c 277 s 18]\n(a) Notwithstanding any other law to the contrary, a vehicle may be equipped with a 360-degree flashing strobe lamp that emits a white light with a flash rate of 60 to 120 flashes a minute, and the lamp may be used as provided in this subdivision, if the vehicle is:\n(1) a school bus that is subject to and complies with the equipment requirements of section 169.442, subdivision 1, or a Head Start bus. The lamp must operate from a separate switch containing an indicator lamp to show when the strobe lamp is in use; or\n(2) a road maintenance vehicle owned or under contract to the Department of Transportation or a road authority of a county, home rule or statutory city, or town, but the strobe lamp may only be operated while the vehicle is actually engaged in snow removal during daylight hours.\n(b) Notwithstanding any other law to the contrary, a vehicle may be equipped with a 360-degree flashing strobe lamp that emits an amber light with a flash rate of 60 to 120 flashes a minute, and the lamp may be used as provided in this subdivision, if the vehicle is a rural mail carrier vehicle, provided that the strobe lamp is mounted at the highest practicable point on the vehicle. The strobe lamp may only be operated while the vehicle is actually engaged during daylight hours in the delivery of mail to residents on a rural mail route.\n(c) A strobe lamp authorized by this subdivision must be of a double flash type certified to the commissioner of public safety by the manufacturer as being weatherproof and having an effective light output that meets or exceeds the most recent version of SAE International standard J845, Class 2, or a subsequent standard.\nA solid waste vehicle or recycling vehicle may be equipped with a single amber warning lamp that meets the most current SAE International standard for authorized maintenance and service vehicles, Class 2. The lamp may be operated only when the collection vehicle is in the process of collecting solid waste or recycling and is either:\n(1) stopped at an establishment where solid waste or recycling is to be collected; or\n(2) traveling at a speed that is at least ten miles per hour below the posted speed limit and moving between establishments where solid waste or recycling is to be collected.\n(a) Except as provided in paragraph (b), it is prohibited for any person to:\n(1) equip a motor vehicle with any equipment or material that covers a headlamp, tail lamp, or reflector; or\n(2) operate a motor vehicle fitted with or otherwise having equipment or material that covers a headlamp, tail lamp, or reflector.\n(b) Paragraph (a) does not apply to:\n(1) any manufacturer's original equipment or material;\n(2) any equipment or material that is clear and colorless; or\n(3) the covering for auxiliary lights required under section 169.56.",
	"repealed": false
}