{
	"id": "205.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.10",
	"title": "205.10 MUNICIPAL SPECIAL ELECTIONS.",
	"text": "Special elections may be held in a city or town on a question on which the voters are authorized by law or charter to pass judgment. A special election may be ordered by the governing body of the municipality on its own motion or, on a question that has not been submitted to the voters in an election within the previous six months, upon a petition signed by a number of voters equal to 20 percent of the votes cast at the last municipal general election. A question is carried only with the majority in its favor required by law or charter. The election officials for a special election shall be the same as for the most recent municipal general election unless changed according to law. Otherwise special elections shall be conducted and the returns made in the manner provided for the municipal general election.\nSpecial elections shall be held in statutory cities to fill vacancies in elective city offices as provided in section 412.02, subdivision 2a.\n[Repealed, 2017 c 92 art 2 s 26]\n(a) Except as allowed in paragraph (b) and subdivision 4, a special election held in a city or town must be held on one of the following dates: the second Tuesday in February, the second Tuesday in April, the second Tuesday in May, the second Tuesday in August, or the first Tuesday after the first Monday in November. A home rule charter city must not designate additional dates in its charter.\n(b) A special election may be held on a date other than those designated in paragraph (a) if the special election is held in response to an emergency or disaster. \"Emergency\" means an unforeseen combination of circumstances that calls for immediate action to prevent a disaster from developing or occurring. \"Disaster\" means a situation that creates an actual or imminent serious threat to the health and safety of persons or a situation that has resulted or is likely to result in catastrophic loss to property or the environment.\nSpecial elections to fill vacancies in town offices as provided in section 367.03, subdivision 6, must be held with the town general election or on a date authorized by subdivision 3a.\nThe governing body of a city or town may not act to submit a ballot question at a general or special election and may not accept a petition for submission of a ballot question at a general or special election unless all election-related deadlines can be met, including publication deadlines for all required notices. A petition rejected under this subdivision may be resubmitted at a time when compliance with all election-related deadlines is possible. Nothing in this subdivision requires the scheduling of a special election for a ballot question.\nA special election ordered by the governing body of the municipality on its own motion under subdivision 1 may be canceled by motion of the governing body, but not less than 84 days before the election.",
	"repealed": false
}