{
	"id": "181C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/181C.04",
	"title": "181C.04 DEACTIVATION.",
	"text": "(a) A TNC must maintain a written plain-language deactivation policy that provides the policies and procedures for deactivation. The TNC must make the deactivation policy available online, through the TNC's digital platform. Updates or changes to the policy must be provided to drivers at least 48 hours before they go into effect.\n(b) The deactivation policy must be provided in English, Amharic, Arabic, Hmong, Oromo, Somali, and Spanish. TNCs operating in Minnesota must consider updating the languages in which they offer the deactivation policy each year.\n(c) The deactivation policy must:\n(1) state that the deactivation policy is enforceable as a term of the TNC's contract with a driver;\n(2) provide drivers with a reasonable understanding of the circumstances that constitute a violation that may warrant deactivation under the deactivation policy and indicate the consequences known, including the specific number of days or range of days for a deactivation if applicable;\n(3) describe fair and reasonable procedures for notifying a driver of a deactivation and the reason for the deactivation;\n(4) describe fair, objective, and reasonable procedures and eligibility criteria for the reconsideration of a deactivation decision and the process by which a driver may request a deactivation appeal with the TNC, consistent with subdivision 5; and\n(5) be specific enough for a driver to understand what constitutes a violation of the policy and how to avoid violating the policy.\n(d) Serious misconduct must be clearly defined in the TNC deactivation policy.\nA TNC must not deactivate a driver for:\n(1) a violation not reasonably understood as part of a TNC's written deactivation policy;\n(2) a driver's ability to work a minimum number of hours;\n(3) a driver's acceptance or rejection of a ride, as long as the acceptance or rejection is not for a discriminatory purpose;\n(4) a driver's good faith statement regarding compensation or working conditions made publicly or privately; or\n(5) a driver asserting their legal rights under any local, state, or federal law.\n(a) The TNC must provide notice at the time of the deactivation or, for deactivations based on serious misconduct, notice within three days of the deactivation. A written notice must include:\n(1) the reason for deactivation;\n(2) anticipated length of the deactivation, if known;\n(3) what day the deactivation started on;\n(4) an explanation of whether or not the deactivation can be reversed and clear steps for the driver to take to reverse a deactivation;\n(5) instructions for a driver to challenge the deactivation and information on their rights under the appeals process provided under subdivision 5; and\n(6) a notice that the driver has a right to assistance and information on how to contact a driver advocacy group as provided in subdivision 4 to assist in the deactivation appeal process, including the telephone number and website information for one or more driver advocacy groups.\n(b) The TNC must provide a warning to a driver if the driver's behavior could result in a future deactivation. A TNC does not need to provide a warning for behavior that constitutes serious misconduct.\n(a) A TNC must contract with a driver's advocacy organization to provide services to drivers under this section. A driver advocacy group identified in the notice must be an independent, not-for-profit organization operating without excessive influence from the TNC. The TNC must not have any control or influence over the day-to-day operations of the advocacy organization or the organization's staff or management or have control or influence over who receives assistance on specific cases or how assistance is provided in a case. The organization must have been established and operating in Minnesota continuously for at least two years and be capable of providing culturally competent driver representation services, outreach, and education.\n(b) The driver advocacy groups must provide, at no cost to the drivers, assistance with:\n(1) deactivation appeals;\n(2) education and outreach to drivers regarding the drivers' rights and remedies available to them under the law; and\n(3) other technical or legal assistance on issues related to providing services for the TNC and riders.\n(a) The deactivation policy must provide the driver with an opportunity to appeal the deactivation upon receipt of the notice and an opportunity to provide information to support the request. An appeal process must provide the driver with no less than 30 days from the date the notice was provided to the driver to appeal the deactivation and allow the driver to have the support of an advocate or attorney.\n(b) Unless the TNC or the driver requests an additional 15 days, a TNC must review and make a final decision on the appeal within 15 days from the receipt of the requested appeal and information to support the request. A TNC may use a third party to assist with appeals.\n(c) The TNC must consider any information presented by the driver under the appeal process. For a deactivation to be upheld, there must be evidence under the totality of the circumstances to find that it is more likely than not that a rule violation subjecting the driver to deactivation has occurred.\n(d) This section does not apply to deactivations for economic reasons or during a public state of emergency that are not targeted at a particular driver or drivers.\n(e) When an unintentional deactivation of an individual driver occurs due to a purely technical issue and is not caused by any action or fault of the driver, the driver, upon request, must be provided reasonable compensation for the period of time the driver was not able to accept rides through the TNC capped at a maximum of 21 days. For the purposes of this paragraph, \"reasonable compensation\" means compensation for each day the driver was deactivated using the driver's daily average in earnings from the TNC for the 90 days prior to the deactivation.\nConsistent with the deactivation policy created under this section, a driver who was deactivated after January 1, 2021, but before November 1, 2024, and who has not been reinstated may request an appeal of the deactivation under this section, if the driver provides notice of the appeal within 90 days of the date of enactment. The TNC may take up to 90 days to issue a final decision.",
	"repealed": false
}