{
	"id": "174.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.10",
	"title": "174.10 PROCEEDINGS INVOLVING CARRIERS.",
	"text": "The commissioner in any contested case that involves a motor carrier or common carrier by rail as a party shall give reasonable notice to representatives of associations or other interested groups or persons who have registered their names with the commissioner for that purpose, to all parties and to cities and municipalities that the commissioner deems to be interested in the proceeding. The commissioner may prescribe an annual fee as a charge to all registered groups or persons. The fee must be credited to the general fund. This charge is to cover the out-of-pocket costs involved in providing the notice.\nIn all matters over which the commissioner has regulatory, or enforcement authority, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. Any person failing or refusing to appear to testify regarding any matter about which the person may be lawfully questioned or to produce any papers, books, records, documents, or other evidentiary materials in the matter to be heard, after having been required by a subpoena of the commissioner to do so may, upon application by the commissioner to the district court in any district, be ordered to comply therewith. An administrative law judge in a rulemaking or contested case proceeding may, on behalf of the commissioner, issue subpoenas, administer oaths to witnesses, and take their affirmations. Depositions may be taken within or without the state by the commissioner or the commissioner's designee in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon any person named therein, anywhere within the state by any officer authorized to serve subpoenas or other process or paper in civil actions, with the same fees and mileage and in the same manner as prescribed by law for service of process issued out of the district court of this state.\nIn proceedings that involve a motor carrier or common carrier by rail as a party, the matter must be heard by the commissioner as authorized by law.\nIf, in any proceeding the commissioner decides that the department does not have jurisdiction, the commissioner shall issue an order dismissing the proceeding and stating the ground of the dismissal.",
	"repealed": false
}