{
	"id": "121A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.22",
	"title": "121A.22 ADMINISTRATION OF DRUGS AND MEDICINE.",
	"text": "(a) This section applies only:\n(1) when the parent of a pupil requests school personnel to administer drugs or medicine to the pupil; or\n(2) when administration is allowed by the individualized education program of a child with a disability.\nThe request of a parent may be oral or in writing. An oral request must be reduced to writing within two school days, provided that the district may rely on an oral request until a written request is received.\n(b) If the administration of a drug or medication described in paragraph (a) requires a school to store the drug or medication, the parent or legal guardian must inform the school if the drug or medication is a controlled substance. For a drug or medication that is not a controlled substance, the request must include a provision designating the school district as an authorized entity to transport the drug or medication for the purpose of destruction if any unused drug or medication remains in the possession of school personnel. For a drug or medication that is a controlled substance, the request must specify that the parent or legal guardian is required to retrieve the drug or controlled substance when requested by the school.\nIn addition, this section does not apply to drugs or medicine that are:\n(1) purchased without a prescription;\n(2) used by a pupil who is 18 years old or older;\n(3) used in connection with services for which a minor may give effective consent, including section 144.343, subdivision 1, and any other law;\n(4) used in situations in which, in the judgment of the school personnel, including a licensed nurse, who are present or available, the risk to the pupil's life or health is of such a nature that drugs or medicine should be given without delay;\n(5) used off the school grounds;\n(6) used in connection with athletics or extra curricular activities;\n(7) used in connection with activities that occur before or after the regular school day;\n(8) provided or administered by a public health agency to prevent or control an illness or a disease outbreak as provided for in sections 144.05 and 144.12;\n(9) prescription asthma or reactive airway disease medications self-administered by a pupil with an asthma inhaler, consistent with section 121A.221, if the district has received a written authorization from the pupil's parent permitting the pupil to self-administer the medication, the inhaler is properly labeled for that student, and the parent has not requested school personnel to administer the medication to the pupil. The parent must submit written authorization for the pupil to self-administer the medication each school year; or\n(10) epinephrine auto-injectors, consistent with section 121A.2205, if the parent and prescribing medical professional annually inform the pupil's school in writing that (i) the pupil may possess the epinephrine or (ii) the pupil is unable to possess the epinephrine and requires immediate access to epinephrine auto-injectors that the parent provides properly labeled to the school for the pupil as needed.\nDrugs or medicine subject to this section must be in a container with a label prepared by a pharmacist according to section 151.212 and applicable rules.\nDrugs and medicine subject to this section must be administered in a manner consistent with instructions on the label. Drugs and medicine subject to this section must be administered, to the extent possible, according to school board procedures that must be developed in consultation:\n(1) with a licensed nurse, in a district that employs a licensed nurse under section 148.171;\n(2) with a licensed school nurse, in a district that employs a licensed school nurse licensed under Minnesota Rules, part 8710.6100;\n(3) with a public or private health or health-related organization, in a district that contracts with a public or private health or health-related organization, according to section 121A.21; or\n(4) with the appropriate party, in a district that has an arrangement approved by the commissioner of education, according to section 121A.21.\n(a) Each school district must adopt a procedure for the collection and transport of any unclaimed or abandoned prescription drugs or medications remaining in the possession of school personnel in accordance with this subdivision. The procedure must ensure that before the transportation of any prescription drug or medication under this subdivision, the school district shall make a reasonable attempt to return the unused prescription drug or medication to the student's parent or legal guardian. The procedure must provide that transportation of unclaimed or unused prescription drugs or medications occur at least annually, or more frequently as determined by the school district.\n(b) If the unclaimed or abandoned prescription drug is not a controlled substance as defined under section 152.01, subdivision 4, or is an over-the-counter medication, the school district may designate an individual who shall be responsible for transporting the drug or medication to a designated drop-off box or collection site or may request that a law enforcement agency transport the drug or medication to a drop-off box or collection site on behalf of the school district.\n(c) If the unclaimed or abandoned prescription drug is a controlled substance as defined in section 152.01, subdivision 4, a school district or school personnel is prohibited from transporting the prescription drug to a drop-off box or collection site for prescription drugs identified under this paragraph. The school district must request that a law enforcement agency transport the prescription drug or medication to a collection bin that complies with Drug Enforcement Agency regulations, or if a site is not available, under the agency's procedure for transporting drugs.\nFor drugs or medicine used by children with a disability, administration may be as provided in the individualized education program.\nFor the purpose of this section, special health treatments and health functions, such as catheterization, tracheostomy suctioning, and gastrostomy feedings, do not constitute administration of drugs or medicine.",
	"repealed": false
}