{
	"id": "297H.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.04",
	"title": "297H.04 NONMIXED MUNICIPAL SOLID WASTE.",
	"text": "A tax is imposed upon the volume of nonmixed municipal solid waste that is managed.\n(a) Commercial generators that generate nonmixed municipal solid waste shall pay a solid waste management tax of 60 cents per noncompacted cubic yard of periodic waste collection capacity purchased by the generator, based on the size of the container for the nonmixed municipal solid waste, the actual volume, or the weight-to-volume conversion schedule in paragraph (c). However, the tax must be calculated by the waste management service provider using the same method for calculating the waste management service fee so that both are calculated according to container capacity, actual volume, or weight.\n(b) Notwithstanding section 297H.02, a residential generator that generates nonmixed municipal solid waste shall pay a solid waste management tax in the same manner as provided in paragraph (a).\n(c) The tax for:\n(1) construction debris as defined in section 115A.03, subdivision 7, is equal to 60 cents per cubic yard. The commissioner of revenue, after consultation with the commissioner of the Pollution Control Agency, shall determine and publish by notice a weight-to-volume conversion schedule for construction debris;\n(2) industrial waste as defined in section 115A.03, subdivision 13a, is equal to 60 cents per cubic yard. The commissioner of revenue after consultation with the commissioner of the Pollution Control Agency, shall determine and publish by notice a weight-to-volume conversion schedule for various industrial wastes; and\n(3) infectious waste as defined in section 116.76, subdivision 12, and pathological waste as defined in section 116.76, subdivision 14, is 150 pounds equals one cubic yard, or 60 cents per 150 pounds.\nNonmixed municipal solid waste that is separately collected and processed, but must be incinerated with mixed municipal solid waste in accordance with an industrial solid waste management plan approved by the Pollution Control Agency, shall be taxed at the rate for nonmixed municipal solid waste.\nNonmixed municipal solid waste that is separately collected or processed, but is disposed of within the permitted boundaries of a land disposal facility that is also actively accepting and disposing of mixed municipal solid waste, shall be taxed at the rate for mixed municipal solid waste, unless the facility owner and operator can demonstrate a physical separation between the mixed municipal solid waste disposal area and nonmixed municipal solid waste disposal area, such that any air or liquid emissions being collected from the disposal areas are collected separately.",
	"repealed": false
}