{
	"id": "129D.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/129D.14",
	"title": "129D.14 GENERAL NONCOMMERCIAL RADIO STATION GRANTS.",
	"text": "The purposes of this section are to facilitate the use of the noncommercial radio station as a community resource by providing financial assistance to noncommercial radio stations serving Minnesota citizens.\nAs used in this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Corporation for Public Broadcasting\" or \"CPB\" means the nonprofit organization established pursuant to United States Code, title 47, section 396.\n(b) \"Federal Communications Commission\" or \"FCC\" means the federal agency established pursuant to United States Code, title 47, section 151.\n(c) \"Licensee\" means an entity to which the Federal Communications Commission has issued a license to operate a noncommercial radio station as defined in Code of Federal Regulations, title 47, subpart D, section 73.503.\n(d) \"Noncommercial radio station\" means a station operated by a licensee of the FCC as a noncommercial educational radio station as defined in Code of Federal Regulations, title 47, subpart D, section 73.503, licensed to a community within the state and serving a segment of the population of the state.\n(e) \"Operating income\" may include:\n(1) individual and other community contributions;\n(2) all grants received from the Corporation for Public Broadcasting;\n(3) grants received from foundations, corporations, or federal, state, or local agencies or other sources for the purpose of programming or general operating support;\n(4) interest income;\n(5) earned income;\n(6) employee salaries paid through the federal Comprehensive Employment and Training Act, or other similar public employment programs, provided that only salary expended for employee duties directly relating to radio station operations shall be counted;\n(7) employee salaries paid through supporting educational institutions, provided that only salary expended for employee duties directly relating to radio station operations shall be counted;\n(8) direct operating costs provided by supporting educational institutions; and\n(9) no more than $15,000 in volunteer time calculated at the federal minimum wage.\nThe following are specifically excluded in determining a station's operating income:\n(1) dollar representations in in-kind assistance from any source except as stipulated in clauses (8) and (9) above;\n(2) grants or contributions from any source for the purpose of purchasing capital improvements or equipment; and\n(3) noncommercial radio station grants received in the previous fiscal year pursuant to this section.\n(f) \"Local\" means the area designated by the FCC's 60 dBu contour map.\n(a) To qualify for a grant under this section, the licensee must:\n(1) hold a valid noncommercial radio station license from the FCC that is a Class \"A\" or \"C\" FM, as defined in Code of Federal Regulations, title 47, subpart B, sections 73.210 and 73.211 or Class \"C\" or \"D\" AM, as defined in Code of Federal Regulations, title 47, subpart A, section 73.21. Stations with a Class \"L1\" and \"LP100\" are not eligible for this funding. The station must be licensed to a community in the state of Minnesota and must be operated as a noncommercial educational station;\n(2) have facilities adequate to provide local program production and origination;\n(3) employ a minimum of two full-time professional radio staff persons or the equivalent in part-time staff and agree to employ a minimum of two full-time professional radio staff persons or the equivalent in part-time staff throughout the fiscal year of the grant;\n(4) maintain a minimum daily broadcasting schedule of (i) the maximum allowed by its Federal Communications Commission license, or (ii) 12 hours a day during the first year of eligibility for state assistance, 15 hours a day during the second year of eligibility and 18 hours a day during the third and following years of eligibility;\n(5) broadcast 365 days a year or the maximum number of days allowed by its Federal Communications Commission license with an exception for power outages and natural disasters;\n(6) have a daily broadcast schedule devoted primarily to programming that serves ascertained community needs of an educational, informational or cultural nature within its primary signal area; however, a program schedule of a main channel carrier designed to further the principles of one or more particular religious philosophies or including 25 percent or more religious programming on a broadcast day does not meet this criterion, nor does a program schedule of a main channel carrier designed primarily for in-school or professional in-service audiences;\n(7) originate significant, locally produced programming designed to serve its community of license;\n(8) have a total annual operating income and budget of at least $50,000;\n(9) have either a board of directors representing the community or a community advisory board that conducts advisory board meetings that are open to the public;\n(10) have a board of directors that: (i) holds the portion of any meeting relating to the management or operation of the radio station open to the public, and (ii) permits any person to attend any meeting of the board without requiring a person, as a condition to attendance at the meeting, to register the person's name or to provide any other information; and\n(11) have met the criteria in clauses (1) to (10) for six months before it is eligible for state assistance under this section.\n(b) The commissioner shall accept the judgment of Corporation for Public Broadcasting accepted audit when it is available on a station's eligibility for assistance under the criteria of this subdivision. If the station is not qualified for assistance or is qualified for but not receiving funding from the Corporation for Public Broadcasting, an independent audit is required to verify eligibility under paragraph (a), clause (8). If neither is available, the commissioner may accept a written declaration of eligibility signed by an independent auditor, a certified public accountant, or the chief executive officer of the station's parent organization.\nTo be eligible for a grant under this section, a licensee shall submit an application to the commissioner according to state grant policies. Each noncommercial radio station receiving a grant shall report annually by August 1 to the commissioner the purposes for which the money was used in the past year and the anticipated use of the money for the next year. This report shall be submitted along with a new grant request submission. If the application and report are not submitted within the deadline prescribed by the commissioner, the grant may be redistributed to the other noncommercial radio stations eligible for a grant under this section.\n(a) The commissioner shall determine eligibility for block grants and the allocation of block grant money on the basis of audited financial records of the station to receive the block grant funds for the station's fiscal year preceding the year in which the grant is made, as well as on the basis of the other requirements set forth in this section. The commissioner shall annually distribute block grants equally to all stations that comply with the eligibility requirements and for which a licensee applies for a block grant. Grant funds not expended by a station during the first year of the biennium do not cancel and may be carried over into the second fiscal year. The commissioner may promulgate rules to implement this section.\n(b) A station may use grant money under this section for any radio station expenses.\nA station that receives a grant under this section shall have an audit of its financial records made by an independent auditor or Corporation for Public Broadcasting accepted audit for the year it received the grant. A copy of the most recent audit shall be filed with the commissioner. The commissioner may accept a letter of negative assurance from an independent auditor or a certified public accountant.",
	"repealed": false
}