{
	"id": "18G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/18G.02",
	"title": "18G.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Biological control agent\" means a parasitoid, predator, pathogen, or competitive organism intentionally released by humans for the purpose of biological control with the intent of causing a reduction of a host or prey population.\n\"Certificate\" means a document authorized or prepared by a federal or state regulatory official that affirms, declares, or verifies that an article, plant, product, shipment, or other officially regulated item meets phytosanitary, nursery inspection, pest freedom, plant registration or certification, or other legal requirements.\n\"Certification\" means a regulatory official's act of affirming, declaring, or verifying compliance with phytosanitary, nursery inspection, pest freedom, plant registration or certification, or other legal requirements.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's designated employee, representative, or agent.\n\"Compliance agreement\" means a written agreement between an entity and a regulatory agency to achieve compliance with regulatory requirements.\n\"Conveyance\" is a means of transportation.\n\"Department\" means the Department of Agriculture.\n\"Emergency regulation\" means a regulation placed in effect by the commissioner without prior public notice in order to take necessary and immediate regulatory action.\n\"Eradication\" means elimination of a pest from a defined geographic area.\n\"Exotic species\" means a species that is not native to the area. Exotic species also means a species occurring outside its natural range.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Individual\" means a single human being who is not the sole proprietor of a registered business related to plant protection or export certification.\n\"Infected\" means a plant that is:\n(1) contaminated with pathogenic microorganisms;\n(2) being parasitized;\n(3) a host or carrier of an infectious, transmissible, or contagious pest; or\n(4) so exposed to a plant listed in clause (1), (2), or (3) that one of those conditions can reasonably be expected to exist and the plant may also pose a risk of contamination to other plants or the environment.\n\"Infested\" means a plant that contains an unacceptable level of plant pests, including weeds, or contains or harbors plant pests in a quantity that may threaten other plants.\n\"Invasive species\" means an exotic species whose introduction and establishment causes, or may cause, economic or environmental harm or harm to human health.\n\"Mark\" means an official indicator affixed by the commissioner for purposes of identification or separation, to, on, around, or near, plants or plant material known or suspected to be infested or infected with a plant pest or that otherwise needs to be distinguished from other plants or materials. This includes, but is not limited to, paint, markers, tags, seals, stickers, tape, ribbons, signs, or placards.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Owner\" includes, but is not limited to, the person with the legal right of possession, proprietorship of, or responsibility for the property or place where any of the articles regulated in this chapter are found, or the person who is in possession of, proprietorship of, or has responsibility for the regulated articles.\n\"Permit\" means a document issued by a regulatory official that allows the movement of any regulated item from one location to another in accordance with specified conditions or requirements and for a specified purpose.\n\" Entity \" means a registered business such as a firm, corporation, partnership, association, trust, joint stock company, unincorporated organization, or sole proprietorship; the state; a state agency; or a political subdivision.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Phytosanitary certificate\" or \"export certificate\" means a document authorized or prepared by a duly authorized federal or state official that affirms, declares, or verifies that an article, plant, plant product, shipment, or any other officially regulated article meets applicable, legally established, plant pest regulations, including this chapter.\n\"Plant\" means a plant, plant product, plant part, or reproductive or propagative part of a plant, plant product, or plant part, including all growing media, packing material, or containers associated with the plant, plant part, or plant product.\n\"Plant pest\" means any organism determined by the commissioner to be capable of causing harm to terrestrial plants, including but not limited to insects, snails, nematodes, fungi, viruses, bacterium, microorganisms, mycoplasma-like organisms, weeds, and parasitic plants.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Public nuisance\" means:\n(1) a plant, appliance, conveyance, or article that is infested with plant pests that may cause significant damage or harm; or\n(2) premises where a plant pest is found.\n\"Quarantine\" means an enforced isolation or restriction of free movement of plants, plant material, animals, animal products, or any article or material in order to treat, control, or eradicate a plant pest.\n\"Regulated article\" means any item, the movement of which is governed by quarantine or this chapter.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Significant damage\" or \"harm\" means a level of adverse impact that results in unacceptable economic damage, injury, or loss for a particular plant.",
	"repealed": false
}