{
	"id": "43A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.38",
	"title": "43A.38 CODE OF ETHICS FOR EMPLOYEES IN THE EXECUTIVE BRANCH.",
	"text": "For the purpose of this section the following definitions shall apply:\n(a) \"Business\" means any corporation, partnership, proprietorship, firm, enterprise, franchise, association, organization, self-employed individual or any other legal entity which engages either in nonprofit or profit making activities.\n(b) \"Confidential information\" means any information obtained under government authority which has not become part of the body of public information and which, if released prematurely or in nonsummary form, may provide unfair economic advantage or adversely affect the competitive position of an individual or a business.\n(c) \"Private interest\" means any interest, including but not limited to a financial interest, which pertains to a person or business whereby the person or business would gain a benefit, privilege, exemption or advantage from the action of a state agency or employee that is not available to the general public.\nEmployees in the executive branch in the course of or in relation to their official duties shall not directly or indirectly receive or agree to receive any payment of expense, compensation, gift, reward, gratuity, favor, service or promise of future employment or other future benefit from any source, except the state for any activity related to the duties of the employee unless otherwise provided by law. However, the acceptance of any of the following shall not be a violation of this subdivision:\n(a) Gifts of nominal value or gifts or textbooks which may be accepted pursuant to section 15.43.\n(b) Plaques or similar mementos recognizing individual services in a field of specialty or to a charitable cause.\n(c) Payment of reimbursement expenses for travel or meals, not to exceed actual expenses incurred, which are not reimbursed by the state and which have been approved in advance by the appointing authority as part of the work assignment.\n(d) Honoraria or expenses paid for papers, talks, demonstrations, or appearances made by employees on their own time for which they are not compensated by the state.\n(e) Tips received by employees engaged in food service and room cleaning at restaurant and lodging facilities in Itasca State Park.\nAn employee in the executive branch shall not use confidential information to further the employee's private interest, and shall not accept outside employment or involvement in a business or activity that will require the employee to disclose or use confidential information.\n(a) An employee shall not use or allow the use of state time, supplies or state-owned or leased property and equipment for the employee's private interests or any other use not in the interest of the state, except as provided by law.\n(b) An employee may use state time, property, or equipment to communicate electronically with other persons including, but not limited to, elected officials, the employer, or an exclusive bargaining representative under chapter 179A, provided this use, including the value of the time spent, results in no incremental cost to the state or results in an incremental cost that is so small as to make accounting for it unreasonable or administratively impracticable.\n(c) The commissioners of administration and management and budget shall issue a statewide policy on the use of electronic mail and other forms of electronic communications by executive branch state employees. The policy is not subject to the provisions of chapter 14 or 179A. Appointing authorities in the legislative and judicial branches shall issue policies on these issues for their employees. The policies shall permit state employees to make reasonable use of state time, property, and equipment for personal communications and shall address issues of privacy, content of communications, and the definition of reasonable use as well as other issues the commissioners and appointing authorities identify as necessary and relevant.\nThe following actions by an employee in the executive branch shall be deemed a conflict of interest and subject to procedures regarding resolution of the conflicts, section 43A.39 or disciplinary action as appropriate:\n(1) use or attempted use of the employee's official position to secure benefits, privileges, exemptions or advantages for the employee or the employee's immediate family or an organization with which the employee is associated which are different from those available to the general public;\n(2) acceptance of other employment or contractual relationship that will affect the employee's independence of judgment in the exercise of official duties;\n(3) actions as an agent or attorney in any action or matter pending before the employing agency except in the proper discharge of official duties or on the employee's behalf; or\n(4) the solicitation of a financial agreement for the employee or entity other than the state when the state is currently engaged in the provision of the services which are the subject of the agreement or where the state has expressed an intention to engage in competition for the provision of the services; unless the affected state agency waives this clause.\nWhen an employee believes the potential for a conflict of interest exists, it is the employee's duty to avoid the situation. A conflict of interest shall be deemed to exist when a review of the situation by the employee, the appointing authority or the commissioner determines any one of the following conditions to be present:\n(1) the use for private gain or advantage of state time, facilities, equipment or supplies or badge, uniform, prestige or influence of state office or employment;\n(2) receipt or acceptance by the employee of any money or other thing of value from anyone other than the state for the performance of an act which the employee would be required or expected to perform in the regular course or hours of state employment or as part of the duties as an employee;\n(3) employment by a business which is subject to the direct or indirect control, inspection, review, audit or enforcement by the employee;\n(4) the performance of an act in other than the employee's official capacity which may later be subject directly or indirectly to the control, inspection, review, audit or enforcement by the employee.\nIf the employee, appointing authority or commissioner determine that a conflict of interest exists, the matter shall be assigned to another employee who does not have a conflict of interest. If it is not possible to assign the matter to an employee who does not have a conflict of interest, interested persons shall be notified of the conflict and the employee may proceed with the assignment.\nWhere specific provisions of chapter 10A apply to employees and would conflict with this section, the provisions of chapter 10A shall apply.\nThis section shall not be interpreted to apply to any activity which is protected by sections 179A.01 to 179A.25 and collective bargaining agreements and practices thereunder nor to prevent a current or former employee from accepting employment with a labor or employee organization representing employees.",
	"repealed": false
}