{
	"id": "17.4984",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4984",
	"title": "17.4984 AQUATIC FARM LICENSE.",
	"text": "(a) A person or entity may not operate an aquatic farm without first obtaining an aquatic farm license from the commissioner.\n(b) Applications for an aquatic farm license must be made on forms provided by the commissioner.\n(c) Licenses are valid for five years and are transferable upon notification to the commissioner.\n(d) The commissioner shall issue an aquatic farm license on payment of the required license fee under section 17.4988.\n(e) A license issued by the commissioner is not a determination of private property rights, but is only based on a determination that the licensee does not have a significant detrimental impact on the public resource.\n(f) The commissioner shall not issue a new license for aquatic farm purposes on a natural water body that has been restored or subject to a protective easement or other interest in land that was at least partially paid for with state or federal money.\n(g) Before a new aquatic farm license is issued for a natural water body, the applicant must notify all owners of property with direct access to the water body. The notification must include the language of this subdivision.\n(a) An aquatic farm license must list:\n(1) the specific waters of the state that may be used in connection with the licensed aquatic farm and the species approved for each licensed water; and\n(2) whether aeration requiring a permit is approved.\nAdditional waters may not be used until they are approved by the commissioner.\n(b) The right to use waters licensed for private fish hatchery or aquatic farm purposes may be transferred between licensees with prior approval by the commissioner if requirements for species to be raised are met. Waters that are continually connected by a permanent watercourse to other waters must not be approved for aquatic farm use, except that connected waters that are isolated from other waters may be licensed as a single water body. Waters that are intermittently connected or may become connected with other waters may be denied, or screening or other measures may be required to prevent passage of aquatic life. Listed waters may be changed on approval by the area fisheries supervisor or the commissioner.\n(c) The commissioner shall conduct an inspection of waters to be licensed prior to approving or denying initial licensing of the waters. When artificial tanks, jars, or other containers are added to existing licensed facilities, an additional inspection is not required.\n(d) Waters containing fish of significant public value, including game fish and native rough fish, may be denied licensing unless the applicant can demonstrate exclusive riparian control.\n(e) Waters containing fish of significant public value, including game fish and native rough fish, may be denied licensing unless the game fish and native rough fish of significant public value are, at the commissioner's option, and taking into consideration the recommendation of the licensed applicant, sold to the licensee, or removed by the Department of Natural Resources or disposed of as provided in writing by the commissioner.\n(f) Waters licensed under an aquatic farm license may be aerated during open water periods without a separate aeration permit.\n(g) Common carp and bullheads may be removed from licensed waters, and transported and disposed of by the licensee.\n(a) An aquatic farm license must list the species of aquatic life appropriate for the classification of the waters. Listed species of aquatic life may be changed on written request to and approval by the area fisheries supervisor. Species of aquatic life regulated under chapter 97A, 97B, or 97C may not be cultured unless listed on the license.\n(b) All waters licensed before July 1, 1992, under a private fish farm or fish hatchery license must be approved for species listed under current licenses if other conditions for licensing are met.\n(c) If licensed waters are located within a 25-year floodplain and are not enclosed within a building, species of aquatic life may be licensed at the discretion of the commissioner.\n(d) Licensed waters located outside of a 25-year floodplain or enclosed within a building may be licensed for any species, except that the commissioner may deny licensing for species not present in the state.\nThe commissioner shall issue a single license for aquatic farming, with the following information and endorsements:\n(1) waters covered by the license;\n(2) classification of each of the licensed waters;\n(3) aeration endorsement for each licensed water where the licensee has exclusive control of riparian access or where the conditions for an aeration permit have been met; and\n(4) endorsements requested by the licensee.\nIf the state uses waters of the state for aquatic farming, the state shall acquire legal access to the waters and make documentation of the access available to the public.\n(a) The premises, property, vehicles, private aquatic life, and equipment where private aquatic farm operations are being conducted are subject to reasonable and necessary inspections at reasonable times by conservation officers. The reason for the inspection must be provided in writing. The owner, operator, or designee may be present when inspections are conducted.\n(b) Conservation officers may enforce sections 17.4981 to 17.4997 under section 97A.205.\n(a) Licensees must keep complete, up-to-date, nonpublic records of the operation of the aquatic farm. The records must remain available for at least three years.\n(b) The records must be in English and include the following information:\n(1) for each species acquired, the number or pounds of fish or eggs acquired, names and addresses of the sources from which acquired, and the dates of receipt;\n(2) for each species sold or disposed of, the number or pounds of fish sold or disposed of, the names and addresses of the purchasers or persons to whom the conveyances are made, and the dates of sale; and\n(3) for fish sperm or viable eggs, the amount acquired or sold, the names and addresses of the sources from which acquired, the purchasers to whom conveyed, and the dates of purchase or sale.\n(c) On or before March 1 of each year, the licensee shall submit a complete annual report on a form furnished by the commissioner, covering the number or pounds of all species sold or purchased in the preceding licensed year.\n(d) An aquatic farmer shall maintain records for reasonable inspection by the commissioner. Information on aquatic life production, harvest, and sales is nonpublic information.",
	"repealed": false
}