{
	"id": "245A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.12",
	"title": "245A.12 VOLUNTARY RECEIVERSHIP FOR RESIDENTIAL OR NONRESIDENTIAL PROGRAMS.",
	"text": "For purposes of this section and section 245A.13, the following terms have the meanings given them.\n(a) \"Controlling individual\" has the meaning in section 245A.02, subdivision 5a. When used in this section and section 245A.13, it means only those individuals controlling the residential or nonresidential program prior to the commencement of the receivership period.\n(b) \"Physical plant\" means the building or buildings in which a residential or nonresidential program is located; all equipment affixed to the building and not easily subject to transfer as specified in the building and fixed equipment tables of the depreciation guidelines; and auxiliary buildings in the nature of sheds, garages, and storage buildings located on the same site if used for purposes related to resident or client care.\n(c) \"Related party\" means a person who is a close relative of a provider or a provider group; an affiliate of a provider or a provider group; a close relative of an affiliate of a provider or provider group; or an affiliate of a close relative of an affiliate of a provider or provider group. For the purposes of this paragraph, the following terms have the meanings given them.\n(1) \"Affiliate\" means a person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with another person.\n(2) \"Person\" means an individual, a corporation, a partnership, an association, a trust, an unincorporated organization, or a government or political subdivision.\n(3) \"Close relative of an affiliate of a provider or provider group\" means an individual whose relationship by blood, marriage, or adoption to an individual who is an affiliate to a provider or a provider group is no more remote than first cousin.\n(4) \"Control\" includes the terms \"controlling,\" \"controlled by,\" and \"under common control with\" and means the possession, direct or indirect, of the power to direct or cause the direction of the management, operations, or policies of a person, whether through the ownership of voting securities, by contract, or otherwise.\n(5) \"Provider or provider group\" means the license holder or controlling individual prior to the effective date of the receivership.\nA majority of controlling individuals of a residential or nonresidential program licensed or certified by the commissioner may at any time ask the commissioner to assume operation of the program through appointment of a receiver. On receiving the request for a receiver, the commissioner may enter into an agreement with a majority of controlling individuals and become the receiver and operate the residential or nonresidential program under conditions acceptable to both the commissioner and the majority of controlling individuals. The agreement must specify the terms and conditions of the receivership and preserve the rights of the persons being served by the program. A receivership set up under this section terminates at the time specified by the parties to the agreement.\nWhen the commissioner agrees to become the receiver of a residential or nonresidential program, the commissioner may enter into a management agreement with another entity or group to act as the managing agent during the receivership period. The managing agent will be responsible for the day-to-day operations of the program subject at all times to the review and approval of the commissioner. A reasonable fee may be paid to the managing agent for the performance of these services.\nThe provisions of section 245A.13, subdivisions 7 and 8, shall also apply to voluntary receiverships.\nNo controlling individual of a residential or nonresidential program placed into receivership under this section shall apply for or receive a license or certification from the commissioner to operate a residential or nonresidential program for five years from the commencement of the receivership period. This subdivision does not apply to residential programs that are owned or operated by controlling individuals, that were in existence prior to the date of the receivership agreement, and that have not been placed into receivership.\nThe controlling individuals of a residential or nonresidential program placed into receivership remain liable for any claims made against the program that arose from incidents or events that occurred prior to the commencement of the receivership period. Neither the commissioner nor the managing agent of the commissioner assumes this liability.\nNeither the commissioner nor the managing agent of the commissioner shall be liable for payment of any financial obligations of the residential or nonresidential program or of its controlling individuals incurred prior to the commencement of the receivership period unless such liability is expressly assumed in the receivership agreement. Those financial obligations remain the liability of the program and its controlling individuals. Financial obligations of the program incurred after the commencement of the receivership period are the responsibility of the commissioner or the managing agent of the commissioner to the extent such obligations are expressly assumed by each in the receivership or management agreements. The controlling individuals of the residential or nonresidential program remain liable for any financial obligations incurred after the commencement of the receivership period to the extent these obligations are not reimbursed in the rate paid to the program and are reasonable and necessary to the operation of the program. These financial obligations, or any other financial obligations incurred by the program prior to the commencement of the receivership period which are necessary to the continued operation of the program, may be deducted from any rental payments owed to the controlling individuals of the program as part of the receivership agreement.\nOccupation of the physical plant after commencement of the receivership period shall be controlled by paragraphs (a) and (b).\n(a) If the physical plant of a residential or nonresidential program placed in receivership is owned by a controlling individual or related party, the physical plant may be used by the commissioner or the managing agent for purposes of the receivership as long as the receivership period continues. A fair monthly rental for the physical plant shall be paid by the commissioner or managing agent to the owner of the physical plant. This fair monthly rental shall be determined by considering all relevant factors necessary to meet required arm's-length obligations of controlling individuals such as the mortgage payments owed on the physical plant, the real estate taxes, and special assessments. This rental shall not include any allowance for profit or be based on any formula that includes an allowance for profit.\n(b) If the owner of the physical plant of a residential or nonresidential program placed in receivership is not a related party, the controlling individual shall continue as the lessee of the property. However, during the receivership period, rental payments shall be made to the owner of the physical plant by the commissioner or the managing agent on behalf of the controlling individual. Neither the commissioner nor the managing agent assumes the obligations of the lease unless expressly stated in the receivership agreement. Should the lease expire during the receivership, the commissioner or the managing agent may negotiate a new lease for the term of the receivership period.\nThe commissioner may use the medical assistance account and funds for receivership cash flow and accounting purposes.\nThe commissioner may use the accounts and funds that would have been available for the room and board, services, and program costs of persons in the program for costs, cash flow, and accounting purposes related to the receivership.",
	"repealed": false
}