{
	"id": "169.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.98",
	"title": "169.98 POLICE, PATROL, OR SECURITY GUARD VEHICLE.",
	"text": "(a) Except as provided in subdivisions 2 and 2a, all motor vehicles which are primarily used in the enforcement of highway traffic rules by the State Patrol or for general uniform patrol assignment by any municipal police department or other law enforcement agency, except conservation officers, shall have uniform colors and markings as provided in this subdivision. Motor vehicles of:\n(1) municipal police departments, including the University of Minnesota Police Department and park police units, shall be predominantly blue, brown, green, black, or white;\n(2) the State Patrol shall be predominantly maroon; and\n(3) the county sheriff's office shall be predominantly brown, black, gold, or white.\n(b) The identity of the governmental unit operating the vehicle shall be displayed on both front door panels and on the rear of the vehicle. The identity may be in the form of a shield or emblem, or may be the word \"police,\" \"sheriff,\" or the words \"State Patrol\" or \"conservation officer,\" as appropriate, with letters not less than 2-1/2 inches high, one-inch wide and of a three-eighths inch brush stroke. The identity shall be of a color contrasting with the background color so that the motor vehicle is easily identifiable as belonging to a specific type of law enforcement agency. Each vehicle shall be marked with its own identifying number on the rear of the vehicle. The number shall be printed in the same size and color required pursuant to this subdivision for identifying words which may be displayed on the vehicle.\nOnly a person who is licensed as a peace officer or part-time peace officer under sections 626.84 to 626.863 may use a motor vehicle governed by subdivision 1 to stop a vehicle as defined in section 169.011, subdivision 92. In addition, a hazardous materials specialist employed by the Department of Transportation may, in the course of responding to an emergency, use a motor vehicle governed by subdivision 1 to stop a vehicle as defined in section 169.011, subdivision 92.\nExcept as otherwise permitted under sections 221.221 and 299D.06, a motor vehicle governed by subdivision 1 may only be operated by a person licensed as a peace officer or part-time peace officer under sections 626.84 to 626.863. This prohibition does not apply to the following:\n(1) a marked vehicle that is operated for maintenance purposes only;\n(2) a marked vehicle that is operated during a skills course approved by the Peace Officer Standards and Training Board;\n(3) a marked vehicle that is operated to transport prisoners or equipment; or\n(4) a marked vehicle that is operated by a reserve officer providing supplementary assistance at the direction of the chief law enforcement officer or the officer's designee, when a licensed peace officer as defined in section 626.84, subdivision 1, paragraph (c), who is employed by that political subdivision, is on duty within the political subdivision.\nThe commissioner of public safety may authorize the use of specially marked State Patrol vehicles, that have only a marking composed of a shield on the right door with the words inscribed thereon \"Minnesota State Patrol\" for primary use in the enforcement of highway traffic rules when in the judgment of the commissioner of public safety the use of specially marked State Patrol vehicles will contribute to the safety of the traveling public. The number of such specially marked State Patrol vehicles used in the enforcement of highway traffic rules shall not exceed ten percent of the total number of State Patrol vehicles used in traffic law enforcement. All specially marked State Patrol vehicles shall be operated by uniformed members of the State Patrol and so equipped and operated as to clearly indicate to the driver of a car which is signaled to stop that the specially marked State Patrol vehicle is being operated by the State Patrol.\nThe chief of police of a home rule or statutory city, and the sheriff of a county, may authorize within the jurisdiction the use of specially marked police or sheriff's vehicles for primary use in the enforcement of highway traffic laws and ordinances when in the judgment of the chief of police or sheriff the use of specially marked vehicles will contribute to the safety of the traveling public. A specially marked vehicle is a vehicle that is marked only with the shield of the city or county and the name of the proper authority on the right front door of the vehicle. The number of specially marked vehicles owned by a police department of a city of the first class may not exceed ten percent of the total number of vehicles used by that police department in traffic law enforcement, and a city or county that uses fewer than 11 vehicles in traffic law enforcement may not own more than one specially marked vehicle. A specially marked vehicle may be operated only by a uniformed officer and must be equipped and operated to indicate clearly to the driver of a vehicle signaled to stop that the specially marked vehicle is being operated by a police department or sheriff's office.\n(a) All motor vehicles which are used by security guards in the course of their employment may have any color other than those specified in subdivision 1 for law enforcement vehicles. The identity of the security service shall be displayed on the motor vehicle as required for law enforcement vehicles.\n(b) Notwithstanding subdivision 1, paragraph (a), clause (1), a security guard may continue to use a motor vehicle that is predominantly black in the course of the guard's employment if the vehicle was being used in this manner before August 1, 2002.\n(c) Notwithstanding subdivision 1, paragraph (a), clause (3), a security guard may continue to use a motor vehicle that is predominantly gold in the course of the guard's employment if the vehicle was being used in this manner before August 1, 2012.\nAll motor vehicles that are used by a bondsman or bail enforcement agent as defined in section 626.88, subdivision 1, paragraph (d), may have any color other than those specified in subdivision 1 for law enforcement vehicles. A bondsman or bail enforcement agent may not display markings on the vehicle in the form of a police shield, star, or any similar emblem that is typically associated with a marked law enforcement vehicle.\nSubdivisions 1 to 3 shall apply to those motor vehicles purchased subsequent to January 1, 1981.\nMarked State Patrol vehicles are exempt from compliance with any rule requiring a security barrier between the front and rear seats of the vehicle. A State Patrol vehicle shall be equipped with a security barrier at the option of the officer assigned the vehicle.",
	"repealed": false
}