{
	"id": "103C.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.315",
	"title": "103C.315 SUPERVISORS.",
	"text": "(a) Except as provided in paragraph (c), the district board shall consist of five supervisors, elected or appointed as provided in sections 103C.201, subdivision 8, and 103C.305.\n(b) Supervisors must be eligible voters residing in the district.\n(c) In counties where the county board consists of seven members and districts have been divided into supervisor districts, under section 103C.311, subdivision 2, the county board may establish seven supervisor districts, elected or appointed as provided in sections 103C.201, subdivision 8; 103C.305; and 103C.311, subdivision 2.\nThe supervisors appointed by the state board upon the establishment of a district serve terms ending as provided in section 103C.201, subdivision 8. Their successors shall be elected for terms of four years commencing on the first Monday in January and until a successor is elected or appointed and has qualified. Vacancies in the office of supervisor appointed by the state board shall be filled by the state board.\nA majority of the supervisors is a quorum and the concurrence of a majority in any matter is required for its determination except as otherwise expressly provided.\nA supervisor shall receive compensation for services up to $125 per day, and may be reimbursed for expenses, including traveling expenses, necessarily incurred in the discharge of duties. A supervisor may be reimbursed for the use of the supervisor's own automobile in the performance of official duties at a rate up to the maximum tax-deductible mileage rate permitted under the federal Internal Revenue Code.\nA supervisor may be removed from office in accordance with the procedures under sections 351.14 to 351.23 for malfeasance or nonfeasance in office, but for no other reason.\nThe office of soil and water conservation district supervisor and the offices of mayor, clerk, clerk-treasurer, or council member in a statutory or home rule charter city of not more than 2,500 population contained in whole or in part in the soil and water conservation district are compatible offices and one person may hold both offices. The office of soil and water conservation district supervisor and the office of town clerk or town supervisor in a town of not more than 2,500 population contained in whole or in part in the soil and water conservation district are compatible offices and one person may hold both offices. A person holding both offices shall refrain from voting or taking any other formal action on any matter coming before the soil and water conservation district board or the city council or town board that has a substantial effect on both the soil and water conservation district and the city or town. This subdivision does not apply to an office located in whole or in part in Anoka, Hennepin, Ramsey, or Washington County.",
	"repealed": false
}