{
	"id": "13.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.87",
	"title": "13.87 CRIMINAL JUSTICE DATA.",
	"text": "(a) Definition. For purposes of this subdivision, \"criminal history data\" means all data maintained in criminal history records compiled by the Bureau of Criminal Apprehension, including, but not limited to fingerprints, photographs, identification data, arrest data, prosecution data, criminal court data, custody and supervision data.\n(b) Classification. Criminal history data maintained by agencies, political subdivisions and statewide systems are classified as private, pursuant to section 13.02, subdivision 12, except that data created, collected, or maintained by the Bureau of Criminal Apprehension that identify an individual who was convicted of a crime, the offense of which the individual was convicted, associated court disposition and sentence information, controlling agency, and confinement information are public data for 15 years following the discharge of the sentence imposed for the offense. If an individual's name or other identifying information is erroneously associated with a criminal history and a determination is made through a fingerprint verification that the individual is not the subject of the criminal history, the name or other identifying information must be redacted from the public criminal history data. The name and other identifying information must be retained in the criminal history and are classified as private data.\nThe Bureau of Criminal Apprehension shall provide to the public at the central office of the bureau the ability to inspect in person, at no charge, through a computer monitor the criminal conviction data classified as public under this subdivision.\n(c) Limitation. Nothing in paragraph (a) or (b) shall limit public access to data made public by section 13.82.\nAll data pertaining to the purchase or transfer of firearms and applications for permits to carry firearms which are collected by government entities pursuant to sections 624.712 to 624.719 are private, pursuant to section 13.02, subdivision 12.\n(a) The Bureau of Criminal Apprehension shall establish and maintain an Internet website containing public criminal history data by July 1, 2004.\n(b) Notwithstanding section 13.03, subdivision 3, paragraph (a), the bureau may charge a fee for Internet access to public criminal history data provided through August 1, 2005. The fee may not exceed $5 per inquiry or the amount needed to recoup the actual cost of implementing and providing Internet access, whichever is less. Fees collected must be deposited in the general fund as a nondedicated receipt.\n(c) The website must include a notice to the subject of data of the right to contest the accuracy or completeness of data, as provided under section 13.04, subdivision 4, and provide a telephone number and address that the subject may contact for further information on this process.\n(d) The website must include the effective date of data that is posted.\n(e) The website must include a description of the types of criminal history data not available on the site, including arrest data, juvenile data, criminal history data from other states, federal data, data on convictions where 15 years have elapsed since discharge of the sentence, and other data that are not accessible to the public.\n(f) A person who intends to access the website to obtain information regarding an applicant for employment, housing, or credit must disclose to the applicant the intention to do so. The website must include a notice that a person obtaining such access must notify the applicant when a background check using this website has been conducted.\n(g) This subdivision does not create a civil cause of action on behalf of the data subject.\n(a) For purposes of this section, \"name and event index service\" means the data held by the Bureau of Criminal Apprehension that link data about an individual that are stored in one or more databases maintained in criminal justice agencies, as defined in section 299C.46, subdivision 2, and in the judiciary.\n(b) Data collected, created, or maintained by the name and event index service are classified as private data, pursuant to section 13.02, subdivision 12, and become confidential data, pursuant to section 13.02, subdivision 3, when the data links private or public data about a specific individual to any confidential data about that individual. The data in the name and event index service revert to the private data classification when no confidential data about a specific individual are maintained in the databases. The classification of data in the name and event index service does not change the classification of the data held in the databases linked by the service.\nParole and county probation authorities may access data identified in subdivision 2 on an applicant or permit holder who is subject to the supervision of that parole or county probation authority.",
	"repealed": false
}