{
	"id": "574.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/574.26",
	"title": "574.26 CONTRACTORS' BONDS FOR PUBLIC WORK.",
	"text": "(a) Sections 574.26 to 574.32 are the \"Public Contractors' Performance and Payment Bond Act,\" within those sections referred to as \"the act.\"\n(b) For the purposes of the act:\n(1) \"public body\" means the state, municipal corporation, school district, or other public board or body; and\n(2) \"labor and materials\" means work, skill, tools, machinery, materials, insurance premiums, equipment or supplies, or taxes incurred under section 290.92, chapter 268, or 297A; and\n(3) \"contract\" means a contract with a public body for the doing of public work.\n(a) Sections 574.26 to 574.32 do not apply to a manufacturer of public transit buses that manufactures at least 100 public transit buses in a calendar year. For purposes of this section, \"public transit bus\" means a motor vehicle designed to transport people, with a design capacity for carrying more than 40 passengers, including the driver. The term \"public transit bus\" does not include a school bus, as defined in section 169.011, subdivision 71.\n(b) At the discretion of the commissioner of transportation, sections 574.26 to 574.32 do not apply to any projects of the Department of Transportation (1) costing less than the amount in section 471.345, subdivision 3, (2) involving the permanent or semipermanent installation of heavy machinery, fixtures, or other capital equipment to be used primarily for maintenance or repair, or (3) awarded under section 161.32, subdivision 2.\n(c) Sections 574.26 to 574.32 do not apply to contracts for snow removal, ice removal, grading, or other similar routine road maintenance on town roads.\nExcept as provided in sections 574.263 and 574.264 or if the amount of the contract is less than the amount in section 471.345, subdivision 3, a contract with a public body for the doing of any public work is not valid unless the contractor gives (1) a performance bond to the public body with whom the contractor entered into the contract, for the use and benefit of the public body to complete the contract according to its terms, and conditioned on saving the public body harmless from all costs and charges that may accrue on account of completing the specified work, and (2) a payment bond for the use and benefit of all persons furnishing labor and materials engaged under, or to perform the contract, conditioned for the payment, as they become due, of all just claims for the labor and materials. Reasonable attorneys' fees, costs, and disbursements may be awarded in an action to enforce claims under the act if the action is successfully maintained or successfully appealed.\nThe penalty of each bond must not be less than the contract price, and if after the giving of the bond the contract price is increased, for any reason, the public body may require additional bonds, the penalties of which shall be not less than the amount of the increase, and if the additional bonds are not furnished within ten days after demand, the work on the contract shall cease until the additional bonds are furnished. In contracts made by the commissioner of administration or the Department of Transportation of the state, the commissioner of administration or the commissioner of transportation, respectively, may fix the amount of the bond penalty, but at not less than three-quarters of the contract price.",
	"repealed": false
}