{
	"id": "500.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.221",
	"title": "500.221 RESTRICTIONS ON ACQUISITION OF TITLE.",
	"text": "For purposes of this section, \"agricultural land\" means land capable of use in the production of agricultural crops, livestock or livestock products, poultry or poultry products, milk or dairy products, or fruit and other horticultural products but does not include any land zoned by a local governmental unit for a use other than and nonconforming with agricultural use. For the purposes of this section, \"interest in agricultural land\" includes any leasehold interest. For the purposes of this section, a \"permanent resident alien of the United States\" is a natural person who:\n(1) has been lawfully admitted to the United States for permanent residence; or\n(2) is a holder of a nonimmigrant treaty investment visa pursuant to United States Code, title 8, section 1101(a)15(E)(ii).\nA person who qualifies as a permanent resident alien of the United States under clause (1) must also maintain that person's principal, actual dwelling place within the United States for at least six months out of every consecutive 12-month period without regard to intent. A person who qualifies as a permanent resident alien of the United States under clause (2) must also maintain that person's principal actual dwelling place in Minnesota for at least ten months out of every 12-month period, and is limited to dairy farming and up to 1,500 acres of agricultural land. The eligibility of a person under clause (2) is limited to three years, unless the commissioner waives the three-year limitation upon finding that the person is actively pursuing the status under clause (1) or United States citizenship. For the purposes of this section, \"commissioner\" means the commissioner of agriculture.\nAn alien who qualifies under subdivision 1, clause (1), and has been physically absent from the United States for more than six months out of any 12-month period shall be presumed not to be a permanent resident alien. An alien who qualifies under subdivision 1, clause (2), and has been physically absent from Minnesota for more than two months out of any 12-month period shall be presumed not to be a permanent resident alien. Every permanent resident alien of the United States who purchases property subject to this section must:\n(1) file a report with the commissioner within 30 days of the date of purchase; and\n(2) annually, at some time during the month of January, file with the commissioner a statement setting forth the dates and places of that person's residence in the United States during the prior calendar year.\nThe statement required under clause (2) must include an explanation of absences totaling more than two months during the prior calendar year and any facts which support the continuation of permanent resident alien status. Upon receipt of the statement, the commissioner shall have 30 days to review the statement and notify the resident alien whether the facts support continuation of the permanent resident alien status.\nExcept as hereinafter provided, no natural person shall acquire directly or indirectly any interest in agricultural land unless the person is a citizen of the United States or a permanent resident alien of the United States. In addition to the restrictions in section 500.24, no corporation, partnership, limited partnership, trustee, or other business entity shall directly or indirectly, acquire or otherwise obtain any interest, whether legal, beneficial or otherwise, in any title to agricultural land unless at least 80 percent of each class of stock issued and outstanding or 80 percent of the ultimate beneficial interest of the entity is held directly or indirectly by citizens of the United States or permanent resident aliens. This section shall not apply:\n(1) to agricultural land that may be acquired by devise, inheritance, as security for indebtedness, by process of law in the collection of debts, or by any procedure for the enforcement of a lien or claim thereon, whether created by mortgage or otherwise. All agricultural land acquired in the collection of debts or by the enforcement of a lien or claim shall be disposed of within three years after acquiring ownership;\n(2) to citizens or subjects of a foreign country whose rights to hold land are secured by treaty;\n(3) to lands used for transportation purposes by a common carrier, as defined in section 218.011, subdivision 10;\n(4) to lands or interests in lands acquired for use in connection with (i) the production of timber and forestry products by a corporation organized under the laws of Minnesota, or (ii) mining and mineral processing operations. Pending the development of agricultural land for the production of timber and forestry products or mining purposes the land may not be used for farming except under lease to a family farm, a family farm corporation or an authorized farm corporation;\n(5) to agricultural land operated for research or experimental purposes if the ownership of the agricultural land is incidental to the research or experimental objectives of the person or business entity and the total acreage owned by the person or business entity does not exceed the acreage owned on May 27, 1977;\n(6) to the purchase of any tract of 40 acres or less for facilities incidental to pipeline operation by a company operating a pipeline as defined in section 216G.01, subdivision 3;\n(7) to agricultural land and land capable of being used as farmland in vegetable processing operations that is reasonably necessary to meet the requirements of pollution control law or rules;\n(8) to an interest in agricultural land held on the August 1, 2003, by a natural person with a nonimmigrant treaty investment visa, pursuant to United States Code, title 8, section 1101(a)15(E)(ii), if, within five years after August 1, 2003, the person:\n(i) disposes of all agricultural land held; or\n(ii) becomes a permanent resident alien of the United States or a United States citizen; or\n(9) to an easement taken by an individual or entity for the installation and repair of transmission lines and for wind rights.\nIf any person or business entity acquires an interest in agricultural land as permitted by subdivision 2 and thereafter ceases to be a person or entity qualified to acquire an interest in agricultural land as permitted by subdivision 2 by reason of the loss of citizenship or permanent residence status or the loss of citizenship or permanent residence status of its shareholders or the holders of ultimate beneficial interests, the person or entity shall:\n(1) notify the commissioner within 30 days of the loss of qualification and file a report with the commissioner of agriculture giving a description of all agricultural land owned by the person or entity within the state, the date upon which the land was acquired, the date upon which the person or entity ceased to be qualified, and other information reasonably required by the commissioner;\n(2) divest itself of any agricultural land acquired after May 27, 1981, within one year of the date upon which the person or entity ceased to be qualified;\n(3) report the divestiture to the commissioner of agriculture within 90 days after it occurs;\n(4) make other reports as the commissioner may reasonably require; and\n(5) continue to file periodic reports as required by subdivision 4 with respect to any land acquired on or before May 27, 1977.\nThe commissioner, upon the request of any person or upon receipt of any information which leads the commissioner to believe that a violation of this section may exist, may issue subpoenas requiring the appearance of witnesses, the production of relevant records and the giving of relevant testimony. On concluding, as a result of the investigation, that a violation of this section may have occurred, the commissioner shall provide the landowner or the landowner's designee with the opportunity to meet with the commissioner or the commissioner's designee in the county where the land is located to exchange information relating to the compliance with this section and any necessity for divestiture. The commissioner shall have the power to issue additional subpoenas for the meeting. The landowner and any person subpoenaed by the commissioner may be represented by counsel. Notwithstanding the provisions of chapter 14, the preliminary investigation and the meeting do not constitute a contested case hearing.\nWith reason to believe, after investigation, that any person is violating this section, the commissioner shall commence an action in the district court in which any agricultural land relative to the violation is situated, or if situated in two or more counties, in any county in which a substantial part of the land is situated. The commissioner shall file for record with the county recorder or the registrar of titles of each county in which any portion of the land is located a notice of the pendency of the action as provided in section 557.02. If the court finds that the land in question is being held in violation of subdivision 2, it shall enter an order so declaring. The commissioner shall file for record any order with the county recorder or the registrar of titles of each county in which any portion of the land is located. Thereafter, the natural person, corporation, partnership, limited partnership, trustee or other business entity, shall have a period of one year from the date of the order to divest itself of the lands. The aforementioned one year limitation period shall be deemed a covenant running with the title to the land against any grantee or assignee or successor corporation or any noncorporation entity acting as agent, assignee, or successor on behalf of a corporation. Any land not so divested within the time prescribed shall be sold at public sale in the manner prescribed by law for the foreclosure of a mortgage by action. No title to land shall be invalid or subject to forfeiture by reason of the alienage of any former owner or person having a former interest therein.\nThe commissioner may seek injunctive relief whenever a violation of this section is threatened.\nThe commissioner is authorized to enter into a written agreement in settlement of any alleged violation, whether or not a hearing is held on the violation. An agreement may provide for an extension of the time period for divestiture but shall not include a waiver of a divestiture required by this section. The agreement shall be construed as a \"No Contest\" pleading and may include any sanctions, penalties, or affirmative actions which are mutually satisfactory and are consistent with this section. The agreement shall be final and conclusive with respect to the action, except upon a showing of fraud, malfeasance, or misrepresentation of a material fact. The matter agreed upon shall not be reopened or modified by an officer, employee, or agent of the state. The agreement shall be filed in Ramsey County District Court and shall be enforceable by it or the district court of the county in which the person resides or principally does business. Any violator of an agreement may, after notice is given to the alleged violator and a hearing is held, be punished by the district court as for contempt, in addition to other remedies in this section.\n(a) Any natural person, corporation, partnership, limited partnership, trustee, or other business entity prohibited from future acquisition of agricultural land may retain title to any agricultural land lawfully acquired within this state prior to June 1, 1981, but shall file a report with the commissioner of agriculture annually before January 31 containing a description of all agricultural land held within this state, the purchase price and market value of the land, the use to which it is put, the date of acquisition and any other reasonable information required by the commissioner.\n(b) An individual or entity that qualifies for an exemption under subdivision 2, clause (2) or (9), and owns an interest in agricultural land shall file a report with the commissioner of agriculture by December 31 of each year in which the individual or entity acquires an interest in agricultural land. The report must contain a description of all interests in agricultural land held by the individual or entity within this state.\n(c) The commissioner shall make the information available to the public.\n(d) All required annual reports shall include a filing fee of $50 plus $10 for each additional quarter section of land.\nWillful failure to properly file a report required under subdivision 1a or to properly register any parcel of land as required by subdivision 4 is a gross misdemeanor.",
	"repealed": false
}