{
	"id": "465.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.81",
	"title": "465.81 COOPERATION AND COMBINATION.",
	"text": "Sections 465.81 to 465.86 establish procedures to be used by counties, cities, or towns that adopt by resolution an agreement providing a plan to provide combined services during an initial cooperation period that may not exceed two years and then:\n(1) to merge into a single unit of government over the succeeding two-year period; or\n(2) to agree to apportion the entire area of at least one local government unit between or among two or more local government units contiguous to the unit to be apportioned, resulting in the elimination of at least one local government unit over the succeeding two years.\nAs used in sections 465.81 to 465.86, the words defined in this subdivision have the meanings given them in this subdivision.\n\"City\" means home rule charter or statutory cities.\n\"Governing body\" means, in the case of a county, the county board; in the case of a city, the city council; and, in the case of a town, the town board.\n\"Local government unit\" or \"unit\" includes counties, cities, and towns.\nCounties may combine with one or more other counties. Cities may combine with one or more other cities or with one or more towns. Towns may combine with one or more other towns or with one or more cities. Units that combine must be contiguous. A county, through the adoption of a resolution by all county boards that are affected by the combination, may apportion its territory between or among two or more counties contiguous to the county that is to be apportioned. A city, through the adoption of a resolution by all city councils that are affected by the combination, may apportion its territory between or among two or more cities contiguous to the city that is to be apportioned. A township, through the adoption of a resolution by all town boards or city councils that are affected by the combination, may apportion its territory between or among two or more townships or cities contiguous to the township that is to be apportioned.",
	"repealed": false
}