{
	"id": "626.8451",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8451",
	"title": "626.8451 TRAINING IN IDENTIFYING AND RESPONDING TO CERTAIN CRIMES.",
	"text": "(a) The board must approve a list of training courses to assist peace officers in identifying, responding to, and reporting crimes committed in whole or in substantial part because of the victim's or another's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03. The course must include material to help officers distinguish bias crimes from other crimes, to help officers in understanding and assisting victims of these crimes, and to ensure that bias crimes will be accurately reported as required under section 626.5531. The board must review the approved courses every three years and update the list of approved courses as the board, in consultation with communities most targeted by hate crimes because of their characteristics as described above, organizations with expertise in providing training on hate crimes, and the statewide coalition of organizations representing communities impacted by hate crimes, considers appropriate.\n(b) In updating the list of approved training courses described in paragraph (a), the board must consult and significantly incorporate input from communities most targeted by hate crimes because of their characteristics as described in paragraph (a), organizations with expertise in providing training on hate crimes, and the statewide coalition of organizations representing communities impacted by hate crimes.\nIn consultation with the school of law enforcement, the board shall prepare a training course to assist peace officers in responding to crimes of violence and to enhance peace officer sensitivity in interacting with and assisting crime victims. For purposes of this course, harassment and stalking crimes are \"crimes of violence.\" The course must include information about:\n(1) the needs of victims of these crimes and the most effective and sensitive way to meet those needs or arrange for them to be met;\n(2) the extent and causes of crimes of violence, including physical and sexual abuse, physical violence, harassment and stalking, and neglect;\n(3) the identification of crimes of violence and patterns of violent behavior; and\n(4) culturally responsive approaches to dealing with victims and perpetrators of violence.\nAn individual may not be licensed as a peace officer unless the individual has received the training described in subdivision 1. An individual is not eligible to take the peace officer licensing examination after August 1, 1994, unless the individual has received the training described in subdivision 1a.\nThe board must provide to chief law enforcement officers instructional materials patterned after the materials developed by the board under subdivisions 1 and 1a. These materials must meet board requirements for continuing education credit and be updated periodically as the board considers appropriate. The board must also seek funding for an educational conference to inform and sensitize chief law enforcement officers and other interested persons to the law enforcement issues associated with bias crimes and crimes of violence. If funding is obtained, the board may sponsor the educational conference on its own or with other public or private entities.\nA chief law enforcement officer must inform all peace officers within the officer's agency of (1) the requirements of section 626.5531, (2) the availability of the instructional materials provided by the board under subdivision 3, and (3) the availability of continuing education credit for the completion of these materials. The chief law enforcement officer must also encourage these peace officers to review or complete the materials.",
	"repealed": false
}