{
	"id": "43A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.05",
	"title": "43A.05 POWERS AND RESPONSIBILITIES; PERSONNEL.",
	"text": "The commissioner shall perform the duties assigned in this chapter.\nThe commissioner's authority and responsibility shall include but not be limited to maintenance of a classification plan, assignment of all positions in the classified service to job classes, maintenance and approval of total compensation plans for all positions in the executive branch pursuant to the provisions of section 43A.18 and other provisions of law; administration of systems for employee selection; maintenance of employee performance appraisal, training and affirmative action programs; and maintenance and publication of logical career paths in the classified civil service.\nThe commissioner shall have the authority to review and comment upon all requests for other than state appropriated funds by any agency for personnel and labor relations purposes before any funding request is made to a federal, local or private agency.\nThe commissioner shall periodically develop and establish pursuant to this chapter a commissioner's plan. The commissioner shall submit the plan to the Legislative Coordinating Commission.\nThe commissioner shall authorize appointing authorities to pay for time off in emergencies. The commissioner, after consultation with the commissioner of public safety, may excuse employees from duty with full pay in the event of a natural or other emergency, if continued operation would involve a threat to the health or safety of individuals. Absence with pay shall not exceed 16 working hours at any one time unless the commissioner authorizes a longer duration. Authority to excuse employees from duty with full pay on the campuses of the Minnesota State Colleges and Universities is vested in the college and university presidents, under guidelines established by the Board of Trustees of the Minnesota State Colleges and Universities.\nThe commissioner shall compile, subject to availability of funds and personnel, and submit to the Legislative Coordinating Commission by January 1 of each odd-numbered year a list showing, by bargaining unit, and by plan for executive branch employees covered by a plan established under section 43A.18, those female-dominated classes and those male-dominated classes in state civil service for which a compensation inequity exists based on comparability of the value of the work. The commissioner shall also submit to the Legislative Coordinating Commission, along with the list, an estimate of the appropriation necessary for providing comparability adjustments for classes on the list. The commission shall review and approve, disapprove, or modify the list and proposed appropriation. The commission's action must be submitted to the full legislature. The full legislature may approve, reject, or modify the commission's action. The commission shall show the distribution of the proposed appropriation among the bargaining units and among the plans established under 43A.18. Each bargaining unit and each plan must be allocated that proportion of the total proposed appropriation that equals the cost of providing adjustments for the positions in the unit or plan approved by the commission for comparability adjustments divided by the total cost of providing adjustments for all positions on the list approved by the commission for comparability adjustments. Distribution of any appropriated funds within each bargaining unit or plan must be determined by collective bargaining agreements or by plans.\nThe amount recommended by the Legislative Coordinating Commission pursuant to subdivision 5 to make comparability adjustments shall be submitted to the full legislature by March 1 of each odd-numbered year. The legislature may accept, reject, or modify the amount recommended. The commissioner shall allocate the amount appropriated by the legislature, on a pro rata basis, if necessary, to the proper accounts for distribution to incumbents of classes which have been approved for comparability adjustments.\nFunds appropriated for purposes of comparability adjustments for state employees shall be drawn exclusively from and shall not be in addition to the funds appropriated for salary supplements or other employee compensation. Funds not used for purposes of comparability adjustments shall revert to the appropriate fund.\nThe commissioner of human rights or any state court may use as evidence the results of any job evaluation system established under subdivision 5 and the reports compiled under subdivision 5 in any proceeding or action alleging discrimination.",
	"repealed": false
}