{
	"id": "116J.8765",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8765",
	"title": "116J.8765 RESERVE FUND; PREMIUMS.",
	"text": "Upon execution of an agreement between the lender and the commissioner, the commissioner shall establish a reserve fund account with the lender in the name of the commissioner for the purpose of receiving all required premium charges to be paid by the lender and the borrower and transfers made by the commissioner under sections 116J.876 to 116J.8769.\nThe premium charges payable to the reserve fund by the lender and the borrower in connection with a loan filed for enrollment are determined by the lender. The premium paid by the borrower may not be less than 1.5 percent nor greater than 3.5 percent of the amount of the loan. The premium paid by the lender shall be equal to the amount of the premium paid by the borrower. The lender may recover from the borrower the cost of the lender's premium payment, in any manner in which the lender and borrower agree. When enrolling a loan, the commissioner shall transfer into the reserve fund from the account premium amounts determined as follows:\n(a) If the amount of any loan, plus the amount of loans previously enrolled by the lender, is less than $2,000,000, the premium amount transferred must be equal to 150 percent of the combined premiums paid into the reserve fund by the borrower and the lender for each enrolled loan.\n(b) If, prior to the enrollment of the loan, the amount of loans previously enrolled by the lender equals or exceeds $2,000,000, the premium amount transferred must be equal to the combined premiums paid into the reserve fund by the borrower and the lender for each enrolled loan.\n(c) If the amount of loans previously enrolled by the lender is less than $2,000,000, but the enrollment of a loan will cause the aggregate amount of all enrolled loans made by the lender to exceed $2,000,000, the premium amount transferred must be equal to a percentage of the combined amount paid by the lender and the borrower. The percentage must be determined by (1) multiplying by 150 that portion of the loan which when added to the amount of all previously enrolled loans totals $2,000,000, (2) multiplying the balance of the loan by 100, and (3) adding the products of the two amounts and dividing the sum by the total amount of the loan.\nA maximum premium amount of $150,000 may be transferred into the reserve funds of all lenders participating in the program by the commissioner over any three-year period in connection with any one borrower or any group of borrowers among which a common enterprise exists. This maximum premium amount may be exceeded upon the written request by a lender only if the commissioner approves in writing the transfer of an amount in excess of $150,000. For the purpose of this subdivision, the term \"common enterprise\" has the meaning given it in Code of Federal Regulations, title 12, section 32, as amended.\n(a) All money credited to the reserve fund is under the exclusive control of the commissioner. The commissioner may not withdraw money from the reserve fund except as specifically provided in this subdivision and sections 116J.8766 and 116J.8768.\n(b) Money in the reserve fund must be deposited by the commissioner in an account with the lender unless the commissioner determines that the lender is not in substantial compliance with the requirements of the agreement. If money in the reserve fund is not deposited by the commissioner in an account with the lender, it must be invested or reinvested by the commissioner in (1) direct obligations of the United States or the state of Minnesota or in obligations the principal and interest of which are unconditionally guaranteed by the United States or the state of Minnesota, or (2) a deposit account at a depository institution whose deposits are insured by the Federal Deposit Insurance Corporation or the Federal Savings and Loan Insurance Corporation.\n(c) Interest or income earned on the money credited to the reserve fund is part of the reserve fund. The commissioner may withdraw at any time from the reserve fund 50 percent of all interest or income that has been credited to the reserve fund, except that after the first withdrawal the commissioner may not withdraw more than 50 percent of all interest or income that has been credited to the reserve fund since the time of the last withdrawal. Any withdrawal made under this subdivision may be made prior to paying any claim. None of the amounts withdrawn need to be transferred back to the reserve fund. Any withdrawal under this subdivision must be credited in the capital access account.\nThe commissioner shall pledge to the lender that the money in the reserve fund will be available to pay claims under section 116J.8766, that the lender will have a first security interest in the money in the reserve fund to pay the claims, and that the commissioner will not encumber or pledge the money to any other party.\n(a) If the reserve fund is not maintained with the lender, the commissioner shall provide to the lender quarterly transaction reports indicating the balance in the reserve fund, payments and transfers into the reserve fund, withdrawals from the reserve fund, and interest or income earned on money credited to the reserve fund.\n(b) The records of the commissioner with respect to all payments and transfers into the reserve fund, withdrawals from the reserve fund, and interest or income earned on the money credited to the reserve fund, are available to the lender at the offices of the commissioner during normal business hours.",
	"repealed": false
}