{
	"id": "462A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.08",
	"title": "462A.08 BONDS AND NOTES; PURPOSES, TERMS, APPROVAL.",
	"text": "The agency from time to time may issue its bonds and notes in such principal amount as, in the opinion of the agency, shall be necessary to provide sufficient funds for achieving its purposes, including the making of eligible loans and the purchase of eligible securities, the payment of interest on bonds and notes of the agency, the establishment of reserves to secure such bonds and notes, and the payment of all other expenditures of the agency incident to and necessary or convenient to carry out its corporate purposes and powers.\nThe agency from time to time may issue bonds or notes for the purpose of refunding any bonds or notes of the agency then outstanding, or, with the consent of the original issuer, any bonds or notes then outstanding issued by an issuer other than the agency for the purpose of making or purchasing loans for single family housing or multifamily housing developments, including the payment of any redemption premiums thereon and any interest accrued or to accrue to the redemption date next succeeding the date of delivery of such refunding bonds or notes. The proceeds of any such refunding bonds or notes may, in the discretion of the agency, be applied to the purchase or payment at maturity of the bonds or notes to be refunded, or to the redemption of such outstanding bonds or notes on the redemption date next succeeding the date of delivery of such refunding bonds or notes and may, pending such application, be placed in escrow to be applied to such purchase, retirement, or redemption. Any such escrowed proceeds, pending such use, may be invested and reinvested in obligations issued or guaranteed by the state or the United States or by any agency or instrumentality thereof, or in certificates of deposit or time deposits secured in such manner as the agency shall determine, maturing at such time or times as shall be appropriate to assure the prompt payment of the principal of and interest and redemption premiums, if any, on the bonds or notes to be refunded. The income earned or realized on any such investment may also be applied to the payment of the bonds or notes to be refunded. After the terms of the escrow have been fully satisfied, any balance of such proceeds and investment income may be returned to the agency for use by it in any lawful manner. All refunding bonds or notes issued under the provisions of this subdivision shall be issued and secured in the manner provided by resolution of the agency. If bonds or notes are issued by the agency to refund bonds or notes issued by an issuer other than the agency, as authorized by this subdivision, the agency and said issuer may enter into such agreements as they may deem appropriate to facilitate such transaction.\nAll notes or bonds issued under this section are securities as defined in section 336.8-102 and may be issued as certificated securities or as uncertificated securities. Certificated securities may be issued in bearer or registered form. The agency may perform all actions that are permitted or required of issuers of securities under sections 336.8-101 to 336.8-511. If notes or bonds are issued as uncertificated securities, and this chapter or other law requires or permits the notes or bonds to contain a statement or recital, whether on their face or otherwise, it is sufficient compliance with the law that the statement or recital is contained in the transaction statement or in a resolution or other instrument that is made a part of the note or bond by reference in the transaction statement as provided in section 336.8-202. All notes and bonds so issued may be either general obligations of the agency, secured by its full faith and credit, and payable out of any money, assets, or revenues of the agency, subject to the provisions of resolutions or indentures pledging and appropriating particular money, assets, or revenues to particular notes or bonds, or limited obligations of the agency not secured by its full faith and credit, and payable solely from those moneys, assets, or revenues of the agency as may be authorized by resolution or indenture.",
	"repealed": false
}