{
	"id": "290.0131",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0131",
	"title": "290.0131 INDIVIDUALS, ESTATES, AND TRUSTS; ADDITIONS TO FEDERAL TAXABLE INCOME OR FEDERAL ADJUSTED GROSS INCOME.",
	"text": "(a) For the purposes of this section, \"addition\" means an amount that must be added to federal taxable income for a trust or an estate or federal adjusted gross income for an individual in computing net income for the taxable year to which the amounts relate.\n(b) The additions in this section apply to individuals, estates, and trusts.\n(c) Unless specifically indicated or unless the context clearly indicates otherwise, only amounts that were deducted or excluded in computing federal taxable income for a trust or an estate or federal adjusted gross income for individuals are an addition under this section.\n(a) Interest income on obligations of any state other than Minnesota or a political or governmental subdivision, municipality, or governmental agency or instrumentality of any state other than Minnesota exempt from federal income taxes under the Internal Revenue Code or any other federal statute is an addition.\n(b) Exempt-interest dividends as defined in section 852(b)(5) of the Internal Revenue Code are an addition, except the portion of the exempt-interest dividends:\n(1) exempt from state taxation under the laws of the United States; or\n(2) derived from interest income on obligations of the state of Minnesota or its political or governmental subdivisions, municipalities, or governmental agencies or instrumentalities, but only if the portion of the exempt-interest dividends from those Minnesota sources paid to all shareholders represents 95 percent or more of the exempt-interest dividends, including any dividends exempt under clause (1), that are paid by the regulated investment company as defined in section 851(a) of the Internal Revenue Code, or the fund of the regulated investment company as defined in section 851(g) of the Internal Revenue Code, making the payment.\n(c) For the purposes of paragraphs (a) and (b), interest on obligations of an Indian tribal government described in section 7871(c) of the Internal Revenue Code is treated as interest income on obligations of the state in which the tribe is located.\nFor trusts and estates, the amount of income, sales and use, motor vehicle sales, or excise taxes paid or accrued within the taxable year under this chapter and the amount of taxes based on net income, sales and use, motor vehicle sales, or excise taxes paid to any other state or to any province or territory of Canada is an addition to the extent deducted under section 63(d) of the Internal Revenue Code.\nThe capital gain amount of a lump-sum distribution to which the special tax under section 1122(h)(3)(B)(ii) of the Tax Reform Act of 1986, Public Law 99-514, applies is an addition.\n(a) The amount of income taxes paid or accrued within the taxable year under this chapter and taxes based on net income paid to any other state or any province or territory of Canada is an addition to the extent allowed as a deduction in determining federal adjusted gross income.\n(b) For the purpose of this subdivision, income taxes do not include the taxes imposed by sections 290.0922, subdivision 1, paragraph (b); 290.9727; 290.9728; and 290.9729.\nThe amount of expense, interest, or taxes disallowed under section 290.10, subdivision 1, other than expenses or interest used in computing net interest income for the subtraction allowed under section 290.0132, subdivision 2, is an addition.\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nThe amount of a partner's pro rata share of net income which does not flow through to the partner because the partnership elected to pay the tax on the income under section 6242(a)(2) of the Internal Revenue Code is an addition.\n(a) 80 percent of the depreciation deduction allowed under section 168(k) of the Internal Revenue Code is an addition.\n(b) For the purposes of this subdivision, if the taxpayer has an activity that in the taxable year generates a deduction for depreciation under section 168(k) of the Internal Revenue Code and the activity generates a loss for the taxable year that the taxpayer is not allowed to claim for the taxable year, \"the depreciation deduction allowed under section 168(k)\" for the taxable year is limited to excess of the depreciation claimed by the activity under section 168(k) over the amount of the loss from the activity that is not allowed in the taxable year. In succeeding taxable years when the losses not allowed in the taxable year are allowed, the depreciation under section 168(k) is allowed.\n(a) For property placed in service in taxable years beginning before January 1, 2020, except for qualifying depreciable property, 80 percent of the amount by which the deduction allowed under the dollar limits of section 179 of the Internal Revenue Code exceeds the deduction allowable by section 179 of the Internal Revenue Code, as amended through December 31, 2003, is an addition.\n(b) For purposes of this subdivision, \"qualifying depreciable property\" means:\n(1) property for which a depreciation deduction is allowed under section 167 of the Internal Revenue Code; and\n(2) property received as part of an exchange that qualifies for gain or loss recognition deferral under section 1031 of the Internal Revenue Code of 1986, as amended through December 16, 2016, but that does not qualify for gain or loss recognition deferral under section 1031 of the Internal Revenue Code of 1986, as amended through December 31, 2018.\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nThe amount for a first-time home buyer savings account required by section 462D.06, subdivision 2, is an addition.\nThe lesser of the following amounts is an addition:\n(1) the total distributions for the taxable year from a qualified plan under section 529 of the Internal Revenue Code, owned by the taxpayer, that are expended for qualified higher education expenses under section 529(c)(7) of the Internal Revenue Code (expenses for tuition for elementary or secondary public, private, or religious school); or\n(2) the total amount required to be reported to the taxpayer by any trustee of a qualified tuition plan under section 529 of the Internal Revenue Code as earnings on Internal Revenue Service Form 1099Q for the taxable year.\nFor trusts and estates, the amount deducted under section 199A of the Internal Revenue Code in computing the trust or estate's federal taxable income is an addition.\nTo the extent deducted from net income, the amount of income deducted under section 250 of the Internal Revenue Code for the taxable year is an addition.\nMS 2022 [Repealed, 2023 c 64 art 1 s 53]\nFor any taxable year beginning after December 31, 2018, and before January 1, 2021, the amount of business interest deducted under the special rule in section 163(j)(10)(A) and (B) of the Internal Revenue Code of 1986, as amended through December 15, 2022, is an addition. Entities that are part of a combined reporting group under the unitary rules in section 290.17, subdivision 4, must compute deductions and additions as required under section 290.34, subdivision 5.\n(a) The amount of a net operating loss arising in any taxable year beginning after December 31, 2017, and before January 1, 2021, and carried back under section 172(b)(1)(D) of the Internal Revenue Code is an addition in the taxable year the loss is carried. No addition is required for a net operating loss deduction that is a farming loss under section 172(b)(1)(B) of the Internal Revenue Code carried to the two years preceding the year the farming loss arose.\n(b) The amount of a net operating loss deduction in any taxable year beginning after December 31, 2017, and before January 1, 2021, that exceeds the deduction allowed under section 172(a)(2) of the Internal Revenue Code is an addition. For purposes of this paragraph, the deduction allowed under section 172(a)(2) of the Internal Revenue Code is allowed in the case of a taxable year beginning after December 31, 2017.\n(c) The amount of a Minnesota disallowed loss carryover is an addition. For purposes of this paragraph, \"Minnesota disallowed loss carryover\" means, for any taxable year beginning after December 31, 2017, and before January 1, 2021, a disallowed loss carryover as defined in section 461(l)(2) of the Internal Revenue Code, for a loss that is not allowed under section 461(l)(1)(B) of the Internal Revenue Code. For purposes of this paragraph, the limitation under section 461(l)(1)(B) of the Internal Revenue Code applies for any taxable year beginning after December 31, 2017.\n(d) For purposes of this subdivision, \"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended through December 15, 2022.",
	"repealed": false
}