{
	"id": "178.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.09",
	"title": "178.09 INVESTIGATIONS AND ENFORCEMENT OF APPRENTICESHIP AGREEMENTS.",
	"text": "Upon the complaint of any interested person or upon the division's own initiative, the division may investigate to determine if there has been a violation of the terms of an apprenticeship agreement made under this chapter. Complaints must be made in writing within 60 days of the events giving rise to the complaint and must set forth the specific matters complained of together with relevant facts and circumstances. Copies of pertinent documents and correspondence must accompany the complaint. The division may conduct such proceedings as are necessary for that investigation and determination. All such proceedings shall be on a fair and impartial basis.\nWithin 90 days after the receipt of a complaint, the division must issue a determination. The determination of the division shall be filed with the commissioner and written notice shall be served on all parties affected by it. Any person aggrieved by any determination or action of the director may appeal to the commissioner. If no appeal is filed with the commissioner within 15 days of the date of service, the division's determination shall become the final order of the commissioner. If an appeal is filed, the commissioner shall appoint and convene a hearing board to be composed of three members of the Apprenticeship Advisory Board appointed under section 178.02, one member being a representative of an employer organization, one representative being a member of an employee organization, and one member representing the general public. The board shall hold a hearing on the appeal after due notice to the interested parties and shall submit to the commissioner findings of fact and a recommended decision accompanied by a memorandum of the reasons for it. Within 30 days after submission, the commissioner may adopt the recommended decision of the board, or disregard the recommended decision of the board and prepare a decision based on the findings of fact and accompanied by a memorandum of reasons for that decision. Written notice of the commissioner's determination and order shall be served on all parties affected by it. Any person aggrieved by the commissioner's determination and order under this section is entitled to judicial review under sections 14.63 to 14.68 in the same manner that a person aggrieved by a final decision in a contested case is entitled to judicial review. The commissioner's determination and order under this section shall be a final decision and order of the department for purposes of sections 14.63 to 14.68.\nService under this chapter may be by certified first class mail, personal service, or in accordance with any consent to service filed with the commissioner. Service by mail shall be accomplished in the manner provided in Minnesota Rules, part 1400.5550, subpart 2. Personal service shall be accomplished in the manner provided in Minnesota Rules, part 1400.5550, subpart 3.",
	"repealed": false
}