{
	"id": "144G.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.82",
	"title": "144G.82 ADDITIONAL RESPONSIBILITIES OF ADMINISTRATION FOR ASSISTED LIVING FACILITIES WITH DEMENTIA CARE.",
	"text": "The licensee of an assisted living facility with dementia care is responsible for the care and housing of the persons with dementia and the provision of person-centered care that promotes each resident's dignity, independence, and comfort. This includes the supervision, training, and overall conduct of the staff.\n(a) The licensee must follow the assisted living license requirements and the criteria in this section.\n(b) The assisted living director of an assisted living facility with dementia care must complete and document that at least ten hours of the required annual continuing educational requirements relate to the care of individuals with dementia. The training must include medical management of dementia, creating and maintaining supportive and therapeutic environments for residents with dementia, and transitioning and coordinating services for residents with dementia. Continuing education credits may include college courses, preceptor credits, self-directed activities, course instructor credits, corporate training, in-service training, professional association training, web-based training, correspondence courses, telecourses, seminars, and workshops.\n(a) In addition to the policies and procedures required in the licensing of all facilities, the assisted living facility with dementia care licensee must develop and implement policies and procedures that address the:\n(1) philosophy of how services are provided based upon the assisted living facility licensee's values, mission, and promotion of person-centered care and how the philosophy shall be implemented;\n(2) evaluation of behavioral symptoms and design of supports for intervention plans, including nonpharmacological practices that are person-centered and evidence-informed;\n(3) wandering and egress prevention that provides detailed instructions to staff in the event a resident elopes;\n(4) medication management, including an assessment of residents for the use and effects of medications, including psychotropic medications;\n(5) staff training specific to dementia care;\n(6) description of life enrichment programs and how activities are implemented;\n(7) description of family support programs and efforts to keep the family engaged;\n(8) limiting the use of public address and intercom systems for emergencies and evacuation drills only;\n(9) transportation coordination and assistance to and from outside medical appointments; and\n(10) safekeeping of residents' possessions.\n(b) The policies and procedures must be provided to residents and the residents' legal and designated representatives at the time of move-in.",
	"repealed": false
}