{
	"id": "544.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/544.42",
	"title": "544.42 ACTIONS AGAINST PROFESSIONALS; CERTIFICATION OF EXPERT REVIEW.",
	"text": "For purposes of this section:\n(1) \"professional\" means a licensed attorney or an architect, certified public accountant, engineer, land surveyor, or landscape architect licensed or certified under chapter 326 or 326A; and\n(2) \"action\" includes an original claim, cross-claim, counterclaim, or third-party claim. An action does not include a claim for damages requiring notice pursuant to section 604.04.\nIn an action against a professional alleging negligence or malpractice in rendering a professional service where expert testimony is to be used by a party to establish a prima facie case, the party must:\n(1) unless otherwise provided in subdivision 3, paragraph (a), clause (2) or (3), serve upon the opponent with the pleadings an affidavit as provided in subdivision 3; and\n(2) serve upon the opponent within 180 days of commencement of discovery under the Rules of Civil Procedure, rule 26.04(a) an affidavit as provided in subdivision 4.\n(a) The affidavit required by subdivision 2, clause (1), must be drafted by the party's attorney and state that:\n(1) the facts of the case have been reviewed by the party's attorney with an expert whose qualifications provide a reasonable expectation that the expert's opinions could be admissible at trial and that, in the opinion of this expert, the defendant deviated from the applicable standard of care and by that action caused injury to the plaintiff;\n(2) the expert review required by clause (1) could not reasonably be obtained before the action was commenced because of the applicable statute of limitations; or\n(3) the parties have agreed to a waiver of the expert review required by clause (1) or the party has applied for a waiver or modification by the court under paragraph (c).\n(b) If an affidavit is executed under paragraph (a), clause (2), the affidavit in paragraph (a), clause (1), must be served on the defendant or the defendant's counsel within 90 days after service of the summons and complaint.\n(c) The certification of expert review required under this section may be waived or modified if the court where the matter will be venued determines, upon an application served with commencement of the action, that good cause exists for not requiring the certification. Good cause includes, but is not limited to, a showing that the action requires discovery to provide a reasonable basis for the expert's opinion or the unavailability, after a good faith effort, of a qualified expert at reasonable cost. If the court waives or modifies the expert review requirements, the court shall establish a scheduling order for compliance or discovery. If the court denies a request for a waiver under this subdivision, the plaintiff must serve on the defendant the affidavit required under subdivision 2, clause (1), within 60 days, and the affidavit required under subdivision 2, clause (2), within 180 days.\n(a) The affidavit required by subdivision 2, clause (2), must be signed by the party's attorney and state the identity of each person whom the attorney expects to call as an expert witness at trial to testify with respect to the issues of negligence, malpractice, or causation, the substance of the facts and opinions to which the expert is expected to testify, and a summary of the grounds for each opinion. Answers to interrogatories that state the information required by this subdivision satisfy the requirements of this subdivision if they are signed by the party's attorney and served upon the opponent within 180 days after commencement of discovery under the Rules of Civil Procedure, rule 26.04(a).\n(b) The parties by agreement, or the court for good cause shown, may provide for extensions of the time limits specified in subdivision 2, 3, or this subdivision. Nothing in this subdivision prevents any party from calling additional expert witnesses or substituting other expert witnesses.\nIf a party is acting pro se, the party shall sign the affidavit or answers to interrogatories referred to in this section and is bound by those provisions as if represented by an attorney.\n(a) Failure to comply with subdivision 2, clause (1), within 60 days after demand for the affidavit results, upon motion, in mandatory dismissal of each cause of action with prejudice as to which expert testimony is necessary to establish a prima facie case.\n(b) Failure to comply with subdivision 3, paragraph (b) or (c), results, upon motion, in mandatory dismissal of each cause of action with prejudice as to which expert testimony is necessary to establish a prima facie case.\n(c) Failure to comply with subdivision 4 results, upon motion, in mandatory dismissal of each action with prejudice as to which expert testimony is necessary to establish a prima facie case, provided that an initial motion to dismiss an action under this paragraph based upon claimed deficiencies of the affidavit or answers to interrogatories shall not be granted unless, after notice by the court, the nonmoving party is given 60 days to satisfy the disclosure requirements in subdivision 4. In providing its notice, the court shall issue specific findings as to the deficiencies of the affidavit or answers to interrogatories.\nThe signature of the party or the party's attorney constitutes a certification that the person has read the affidavit or answers to interrogatories, and that to the best of the person's knowledge, information, and belief formed after a reasonable inquiry, it is true, accurate, and made in good faith. A certification made in violation of this subdivision subjects the attorney or party responsible for that conduct to reasonable attorney's fees, costs, disbursements, and other damages that may be determined by the court.",
	"repealed": false
}