{
	"id": "458D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.04",
	"title": "458D.04 ORGANIZATION AND OPERATION OF BOARD.",
	"text": "After the selection and qualification of all board members, they shall meet to organize the board at the call of any two board members, upon seven days' notice by registered mail to the remaining seven board members, at a time and place within the district specified in the notice. Seven members shall constitute a quorum at that meeting and all other meetings of the board, but a lesser number may meet and adjourn from time to time and compel the attendance of absent members. At the first meeting the board shall select its officers as hereinafter provided and conduct such other organizational business as may be necessary. Thereafter the board shall meet regularly at such time and place as the board shall by resolution designate. Special meetings may be held at any time upon call of the chair or any two members, upon written notice sent by mail to each member at least three days prior to the meeting, or upon such other notice as the board by resolution may provide, or without notice if each member is present or files with the secretary a written consent to the meeting either before or after the meeting. Any action within the authority of the board may only be taken by the affirmative vote of seven of the members present at a regular or adjourned regular meeting or at a duly held special meeting. All meetings of the board shall be open to the public. The board may adopt a seal, which shall be officially and judicially noticed, to authenticate instruments executed by its authority, but omission of the seal shall not affect the validity of any instrument.\nThe board shall elect a chair from its membership. The term of the first chair of the board shall expire on July 1, 1972, and the terms of successor chairs shall expire on July 1 of each succeeding year. The chair shall preside at all meetings of the board, if present, and shall perform all other duties and functions usually incumbent upon such an officer, and all administrative functions assigned by the board. The board shall elect a vice chair from its membership to act for the chair during temporary absence or disability. The chair may be paid so much compensation in addition to compensation as a board member as the board shall determine.\nThe board shall select a person or persons who may but need not be a member or members of the board, to act as its secretary and treasurer. The secretary and treasurer shall hold office at the pleasure of the board, subject to the terms of any contract of employment which the board may enter into with the secretary or treasurer. The secretary shall record the minutes of all meetings of the board, and shall be custodian of all books and records of the board except such as the board shall entrust to the custody of a designated employee. The treasurer shall be the custodian of all money received by the board except such as the board shall entrust to the custody of a designated employee. The board may appoint a deputy to perform any and all functions of either the secretary or the treasurer. No such secretary or treasurer who is not a member of the board or a deputy of either shall have any right to vote.\nThe board shall appoint an executive director who shall be selected solely upon the basis of training, experience and other qualifications and who shall serve at the pleasure of the board and at a salary to be determined by the board. The executive director need not be a resident of the district. An executive director shall attend all meetings of the board, but shall not vote, and shall have the following powers and duties:\n(a) To see that all resolutions, rules, regulations, or orders of the board are enforced.\n(b) To appoint and remove, upon the basis of merit and fitness, all subordinate officers and regular employees of the board except the secretary and the treasurer and their deputies.\n(c) To present to the board plans, studies and other reports prepared for board purposes and recommend to the board for adoption such measures as the executive director deems necessary to enforce or carry out the powers and duties of the board, or the efficient administration of the affairs of the board.\n(d) To keep the board fully advised as to its financial condition, and to prepare and submit to the board its annual budget and such other financial information as it may request.\n(e) To recommend to the board for adoption such rules and regulations as the executive director deems necessary for the efficient operation of a district disposal system and all local sanitary sewer facilities over which the board may assume responsibility as provided in section 458D.19.\n(f) To perform such other duties as may be prescribed by the board.\nAll persons employed by the executive director shall be public employees, and shall have all the rights and duties conferred on public employees under sections 179A.01 to 179A.25. The board may elect to have such employees become members of either the Public Employees Retirement Association or the Minnesota State Retirement System. The compensation and conditions of employment of such employees shall not be governed by any rule applicable to state employees in the classified service nor to any of the provisions of chapter 15A, unless the board so provides.\nThe board shall by resolution adopt a personnel code for its employees, subject to the provisions of subdivision 5. The code shall include a job classification plan, procedures for employment and promotion of personnel based on merit, procedures for demotion, suspension or discharge of employees, procedures for hearing grievances, procedures for salary administration, and such other provisions as the board deems appropriate. The executive director of the board shall administer the code under the supervision of the board.\nAll employees of the board except those expressly designated for the unclassified service, shall serve in the classified service. The unclassified service shall include: members of the board; the executive director of the board; all officers of the board; and any employee of the board who is determined by the board to have a confidential relationship to the board and any employee of the board expressly exempted from the classified service by law. The code shall also include procedures for open competitive examinations to test the relative fitness of all applicants for positions in the classified service. Such examinations may consist of written or oral tests of the subjective or objective type, physical tests, and practical or demonstrative tests for the evaluation of past training and experience. Oral tests may be used to test the applicant's knowledge of the position applied for or personal fitness for the position. Where there is more than one applicant for the position, the code shall provide for the employment of any one of the two or three applicants best qualified for it.\nWhen a board employee has been demoted, suspended or dismissed by the executive director, the employee may, within 30 days after such action becomes effective, file with the board a written request for a hearing showing a present mailing address. Upon receipt of the request for a hearing the board shall appoint three of its members to act as an appeal board and preside at a hearing on the action of the executive director. The hearing shall be held within 30 days after the request is received by the board, upon written notice mailed or delivered to the employee at the present mailing address, and not less than seven days before the hearing. The appeal board shall approve or disapprove the action of the executive director, and in the case of approval the action of the executive director shall be final. In a case of disapproval the appeal board may reinstate the employee under such conditions as it deems proper, and may order the payment to the employee of compensation lost as a result of the demotion, suspension or dismissal.\nThe board shall adopt resolutions and bylaws establishing procedures for board action, keeping records, approving claims, authorizing or making disbursements, safekeeping funds and audit of all financial operations of the board.\nThe board may procure surety bonds for its officers and employees and in such amounts as are deemed necessary to assure proper performance of their duties and proper accounting for funds in their custody. It may procure insurance against such risks to property and such liability of the board and its officers, agents, and employees for personal injuries or death and property damage and destruction and in such amounts as may be deemed necessary or desirable, with the force and effect stated in chapter 466.",
	"repealed": false
}