{
	"id": "398A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/398A.04",
	"title": "398A.04 POWERS.",
	"text": "An authority may exercise all the powers necessary or desirable to implement the powers specifically granted in this section, and in exercising the powers is deemed to be performing an essential governmental function and exercising a part of the sovereign power of the state, and is a local government unit and political subdivision of the state. Without limiting the generality of the foregoing, the authority may:\n(1) sue and be sued, have a seal, which may but need not be affixed to documents as directed by the board, make and perform contracts, and have perpetual succession;\n(2) acquire real and personal property within or outside its taxing jurisdiction, by purchase, gift, devise, condemnation, conditional sale, lease, lease purchase, or otherwise; or for purposes, including the facilitation of an economic development project pursuant to section 383B.81 or 469.091 or 469.175, subdivision 7, that also improve rail service;\n(3) hold, manage, control, sell, convey, lease, mortgage, or otherwise dispose of real or personal property; and\n(4) make grants or otherwise appropriate funds to the Department of Transportation, the Metropolitan Council, or any other state or local governmental unit for the purposes described in subdivision 2 with respect to railroad facilities located or to be located within the authority's jurisdiction, whether or not the facilities will be acquired, constructed, owned, or operated by the authority.\nThe authority may plan, establish, acquire, develop, construct, purchase, enlarge, extend, improve, maintain, equip, operate, regulate, and protect railroads and railroad facilities, including but not limited to terminal buildings, roadways, crossings, bridges, causeways, tunnels, equipment, and rolling stock. The authority may not expend state or federal funds to engage in planning for or development of light rail transit or commuter rail transit, unless this activity is consistent with a plan adopted by the department of transportation under section 174.84 and a plan adopted by the metropolitan council under section 473.399, and is carried out pursuant to a memorandum of understanding executed by the authority and the commissioner after appropriate consultation with the metropolitan council.\nA regional rail authority may exercise the powers conferred under this section to: plan, establish, acquire, develop, purchase, enlarge, extend, improve, maintain, equip, regulate, and protect; and pay costs of construction and operation of a bus rapid transit system located within its county on transitways included in and approved by the Metropolitan Council's 2030 Transportation Policy Plan. This subdivision applies only to the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\nThe authority may apply to any public agency for permits, consents, authorizations, and approvals required for any project and take all actions necessary to comply with their conditions.\nThe authority shall have all powers granted to a political subdivision in chapter 117 for the acquisition of property for a public purpose, except that it shall have no power of eminent domain with respect to property owned by another authority or political subdivision of Minnesota or any other state, or with respect to property owned or used by a railroad corporation unless the Interstate Commerce Commission or a successor agency, if any, or another authority with power to make the finding, has found that the public convenience and necessity permit discontinuance of rail service on the property. All property taken for the exercise of the powers granted herein is declared to be taken for a public governmental purpose and as a matter of public necessity.\nThe authority may establish charges and rentals for the use, sale, and availability of its property and service and may hold, use, dispose of, invest, and reinvest the income, revenues, and funds derived therefrom. Subject to any agreement with bondholders, it may invest money not required for immediate use, including bond proceeds, in the securities it shall deem prudent, notwithstanding the provisions of any other law relating to the investment of public funds.\n(a) The authority shall be subject to tort liability to the extent provided in chapter 466 and may procure insurance against the liability, and may indemnify and purchase and maintain insurance on behalf of any of its commissioners, officers, employees, or agents, in connection with any threatened, pending, or completed action, suit, or proceeding, as provided in chapter 466, and to the same extent and in the same manner and with the same force and effect as provided in the case of a private corporation by section 302A.521. It may also procure insurance against loss of or damage to property in the amounts, by reason of the risks, and from the insurers as it deems prudent.\n(b) A railroad leasing its tracks and right-of-way to a railroad authority that is created under this chapter and affiliated with a railroad museum is subject to tort liability only to the extent provided for municipalities in chapter 466 as to any claims arising out of fare-paying passenger operations carried on by the railroad authority primarily for the purpose of promoting tourism on tracks and right-of-way leased from the railroad.\nThe authority may accept, contract for, and receive and disburse federal, state, and other funds or property, public or private, made available by grant, loan, or lease, to be used in the exercise of any of its powers, and may comply with the terms and conditions of the grant or loan.\nBefore deciding to exercise the power to tax, the authority shall give six weeks' published notice in all municipalities in the region. If a number of voters in the region equal to five percent of those who voted for candidates for governor at the last gubernatorial election present a petition within nine weeks of the first published notice to the secretary of state requesting that the matter be submitted to popular vote, it shall be submitted at the next general election. The question prepared shall be:\n\"Shall the regional rail authority have the power to impose a property tax?\nIf a majority of those voting on the question approve or if no petition is presented within the prescribed time the authority may levy a tax at any annual rate not exceeding 0.04835 percent of estimated market value of all taxable property situated within the municipality or municipalities named in its organization resolution. Its recording officer shall file, on or before September 15, in the office of the county auditor of each county in which territory under the jurisdiction of the authority is located a certified copy of the board of commissioners' resolution levying the tax, and each county auditor shall assess and extend upon the tax rolls of each municipality named in the organization resolution the portion of the tax that bears the same ratio to the whole amount that the net tax capacity of taxable property in that municipality bears to the net tax capacity of taxable property in all municipalities named in the organization resolution. Collections of the tax shall be remitted by each county treasurer to the treasurer of the authority. For taxes levied in 1991, the amount levied for light rail transit purposes under this subdivision shall not exceed 75 percent of the amount levied in 1990 for light rail transit purposes under this subdivision.\nThe authority may enter into joint powers agreements under section 471.59 or other agreements with the municipality or municipalities named in the organization agreement; with other municipalities situated in the counties named in the resolution, respecting the matters referred to in section 398A.06; with another authority; with a state agency; or with the Metropolitan Council about any matter subject to this chapter.\nThe authority may issue bonds in the manner and upon the conditions provided in section 398A.07.\nThe authority may enter into contracts including leases with any person, firm, or corporation, for terms the authority may determine:\n(1) providing for the operation of any facilities on behalf of the authority, at the rate of compensation as may be determined;\n(2) leasing a rail line for operation by the lessee or any facility or space therein for other commercial purposes, at rentals as may be determined, but no person may be authorized to operate a rail line other than as a common carrier;\n(3) granting the privilege, for compensation as the authority shall determine, of supplying goods, commodities, services, or facilities along rail lines or in or upon other property; and\n(4) making available services furnished by the authority or its agents, at charges, rentals, or fees which shall be reasonable and uniform for the same class of privilege or service.",
	"repealed": false
}