{
	"id": "148E.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.46",
	"title": "148E.46 REISSUANCE OF A MULTISTATE LICENSE BY A NEW HOME STATE.",
	"text": "(a) A licensee can hold a multistate license, issued by their home state, in only one member state at any given time.\n(b) If a licensee changes their home state by moving between two member states:\n(1) The licensee shall immediately apply for the reissuance of their multistate license in their new home state. The licensee shall pay all applicable fees and notify the prior home state in accordance with the rules of the Commission.\n(2) Upon receipt of an application to reissue a multistate license, the new home state shall verify that the multistate license is active, unencumbered, and eligible for reissuance under the terms of the Compact and the rules of the Commission. The multistate license issued by the prior home state will be deactivated and all member states notified in accordance with the applicable rules adopted by the Commission.\n(3) Prior to the reissuance of the multistate license, the new home state shall conduct procedures for considering the criminal history records of the licensee. Such procedures shall include the submission of fingerprints or other biometric-based information by applicants for the purpose of obtaining an applicant's criminal history record information from the Federal Bureau of Investigation and the agency responsible for retaining that state's criminal records.\n(4) If required for initial licensure, the new home state may require completion of jurisprudence requirements in the new home state.\n(5) Notwithstanding any other provision of this Compact, if a licensee does not meet the requirements set forth in this Compact for the reissuance of a multistate license by the new home state, then the licensee shall be subject to the new home state requirements for the issuance of a single state license in that state.\n(c) If a licensee changes their primary state of residence by moving from a member state to a nonmember state, or from a nonmember state to a member state, then the licensee shall be subject to the state requirements for the issuance of a single state license in the new home state.\n(d) Nothing in this Compact shall interfere with a licensee's ability to hold a single state license in multiple states; however, for the purposes of this Compact, a licensee shall have only one home state, and only one multistate license.\n(e) Nothing in this Compact shall interfere with the requirements established by a member state for the issuance of a single state license.",
	"repealed": false
}