{
	"id": "322C.0410",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0410",
	"title": "322C.0410 RIGHT OF MEMBERS, MANAGERS, GOVERNORS, AND DISSOCIATED MEMBERS TO INFORMATION.",
	"text": "In a member-managed limited liability company, the following rules apply:\n(1) On reasonable notice, a member may inspect and copy during regular business hours, at a reasonable location specified by the company, any record maintained by the company regarding the company's activities, financial condition, and other circumstances, to the extent the information is material to the member's rights and duties under the operating agreement or this chapter.\n(2) The company shall furnish to each member:\n(i) without demand, any information concerning the company's activities, financial condition, and other circumstances which the company knows and is material to the proper exercise of the member's rights and duties under the operating agreement or this chapter, except to the extent the company can establish that it reasonably believes the member already knows the information; and\n(ii) on demand, any other information concerning the company's activities, financial condition, and other circumstances, except to the extent the demand or information demanded is unreasonable or otherwise improper under the circumstances.\n(3) The duty to furnish information under clause (2) also applies to each member to the extent the member knows any of the information described in clause (2).\nIn a manager-managed or board-managed limited liability company, the following rules apply:\n(1) The informational rights stated in subdivision 1 and the duty stated in subdivision 1, clause (3), apply to the managers or governors and not the members.\n(2) During regular business hours and at a reasonable location specified by the company, a member may obtain from the company and inspect and copy full information regarding the activities, financial condition, and other circumstances of the company as is just and reasonable if:\n(i) the member seeks the information for a purpose material to the member's interest as a member;\n(ii) the member makes a demand in a record received by the company, describing with reasonable particularity the information sought and the purpose for seeking the information; and\n(iii) the information sought is directly connected to the member's purpose.\n(3) Within ten days after receiving a demand pursuant to clause (2), item (ii), the company shall in a record inform the member that made the demand:\n(i) of the information that the company will provide in response to the demand and when and where the company will provide the information; and\n(ii) if the company declines to provide any demanded information, the company's reasons for declining.\n(4) Whenever this chapter or an operating agreement provides for a member to give or withhold consent to a matter, before the consent is given or withheld, the company shall, without demand, provide the member with all information that is known to the company and is material to the member's decision.\nOn ten days' demand made in a record received by a limited liability company, a dissociated member may have access to information to which the person was entitled while a member if the information pertains to the period during which the person was a member, the person seeks the information in good faith, and the person satisfies the requirements imposed on a member by subdivision 2, clause (2). The company shall respond to a demand made pursuant to this subdivision in the manner provided in subdivision 2, clause (3).\nA limited liability company may charge a person that makes a demand under this section the reasonable costs of copying, limited to the costs of labor and material.\nA member or dissociated member may exercise rights under this section through an agent or, in the case of an individual under legal disability, a legal representative. Any restriction or condition imposed by the operating agreement or under subdivision 7 applies both to the agent or legal representative and the member or dissociated member.\nThe rights under this section do not extend to a person as transferee.\nIn addition to any restriction or condition stated in its operating agreement, a limited liability company, as a matter within the ordinary course of its activities, may impose reasonable restrictions and conditions on access to and use of information to be furnished under this section, including designating information confidential and imposing nondisclosure and safeguarding obligations on the recipient. In a dispute concerning the reasonableness of a restriction under this subdivision, the company has the burden of proving reasonableness.",
	"repealed": false
}