{
	"id": "204B.295",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.295",
	"title": "204B.295 VOTING INSTRUCTIONS AND SAMPLE BALLOTS IN LANGUAGES OTHER THAN ENGLISH; MULTILINGUAL ELECTION JUDGES.",
	"text": "The secretary of state or county auditor must use the Office of Enterprise Translation established in section 16B.373 or must contract with a translator certified by the American Translators Association to develop voting instructions and sample ballots in languages other than English, to be made available in polling places during elections as required by this section. At a minimum, the secretary of state must prepare voting instructions and make the instructions available in polling places in the three most commonly spoken non-English languages in the state as determined by the state demographer for the previous calendar year. For state elections, the secretary of state must prepare and provide example ballots to county auditors and post voting instructions in print, electronic, and audio-visual formats, on the secretary of state's website in at least the three most commonly spoken non-English languages in the state as determined by the state demographer for the previous calendar year.\nBy January 1 of each year, the secretary of state or county auditor, in consultation with the state demographer, must determine the percentage of residents in each census tract who are members of a language minority and who lack sufficient skills in English to vote without assistance. Language minority districts will be designated if three percent or more of the population in a corresponding census tract speak English \"less than very well\" according to the most recent census data. The secretary of state must maintain the list of designated language minority districts on its website. The state demographer must consider the identified margin of error in the census data when identifying census tracts. Designations made in January apply to elections for which absentee balloting begins on or after January 1 of each year and continue through the end of the calendar year.\n(a) If the number of residents determined under subdivision 2 equals three percent or more of a census tract, or if interested citizens or organizations provide information that gives the secretary of state or county auditor sufficient reason to believe a need exists, at least two copies of the translated voting instructions and sample ballots must be provided to each precinct in that district during any regular or special state election conducted in that district. If more than one language is represented in three percent or more of residents as determined in subdivision 2, translated materials must be provided in, at minimum, the highest determined language and any language representing three percent or more of a census tract.\n(b) If the number of residents determined under subdivision 2 equals 20 percent or more of the population of a census tract, or if interested citizens or organizations provide information that gives the secretary of state or county auditor sufficient reason to believe a need exists, at least four copies of the translated voting instructions and sample ballots must be provided to each precinct in that district during any regular or special state election conducted in that district. If more than one language is represented in the 20 or more percent of residents as determined in subdivision 2, translated materials must be provided in, at minimum, the highest determined language and any language representing three percent or more of a census tract. In these precincts, the county auditor or municipal clerk must appoint at least one interpreter to translate in a specified language if ten or more registered voters in the precinct file a request for interpretive services for that language with the secretary of state or county auditor at least 30 days prior to the date of the election. This interpreter must wear a name tag or other badge indicating the interpreter's language certification. For purposes of section 204C.06 and any other applicable law, an interpreter appointed under this section is considered an election official and may be present in a polling place for the purpose of conducting duties assigned by the county auditor or municipal clerk.\n(c) The county auditor must maintain a list of the designated language minority districts on its website, including the precinct name, languages that materials will be provided in, and, if applicable, where interpreters will be provided and the language they speak. This list must be posted no later than 90 days after receiving language minority district designations under subdivision 2 and must be updated as it is determined that materials or interpreters will be provided for additional districts.\nThe translated voting instructions and sample ballots required by this section must be made available for use by voters as a reference when completing and casting an official ballot. In addition to the number of copies required, at least one set of instructions in each applicable language, along with a notice written in that language indicating the availability of those materials, must be posted in a conspicuous location in each polling place.\nFor the purposes of this section, sample ballots must accurately reflect the offices, candidates, and rotation sequence on the ballots used in that polling place. Sample ballots may deviate from other ballot formatting requirements to the extent required to accommodate the translated content.",
	"repealed": false
}