{
	"id": "122A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.20",
	"title": "122A.20 SUSPENSION OR REVOCATION OF LICENSES.",
	"text": "(a) The Professional Educator Licensing and Standards Board or Board of School Administrators, whichever has jurisdiction over a teacher's licensure, may, on the written complaint of the school board employing a teacher, a teacher organization, or any other interested person, refuse to issue, refuse to renew, suspend, or revoke a teacher's license to teach for any of the following causes:\n(1) immoral character or conduct;\n(2) failure, without justifiable cause, to teach for the term of the teacher's contract;\n(3) gross inefficiency or willful neglect of duty;\n(4) failure to meet licensure requirements; or\n(5) fraud or misrepresentation in obtaining a license.\nThe written complaint must specify the nature and character of the charges.\n(b) The Professional Educator Licensing and Standards Board or Board of School Administrators, whichever has jurisdiction over a teacher's licensure, shall refuse to issue, refuse to renew, or automatically revoke a teacher's license to teach without the right to a hearing upon receiving a certified copy of a conviction showing that the teacher has been convicted of child abuse, as defined in section 609.185, sex trafficking in the first degree under section 609.322, subdivision 1, sex trafficking in the second degree under section 609.322, subdivision 1a, engaging in hiring, or agreeing to hire a minor to engage in prostitution under section 609.324, subdivision 1, sexual abuse under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 617.23, subdivision 3, solicitation of children to engage in sexual conduct or communication of sexually explicit materials to children under section 609.352, interference with privacy under section 609.746 or harassment or stalking under section 609.749 and the victim was a minor, using minors in a sexual performance under section 617.246, possessing pornographic works involving a minor under section 617.247, or any other offense not listed in this paragraph that requires the person to register as a predatory offender under section 243.166, or a crime under a similar law of another state or the United States. The board shall send notice of this licensing action to the district in which the teacher is currently employed.\n(c) A person whose license to teach has been revoked, not issued, or not renewed under paragraph (b), may petition the board to reconsider the licensing action if the person's conviction for child abuse or sexual abuse is reversed by a final decision of the court of appeals or the supreme court or if the person has received a pardon for the offense. The petitioner shall attach a certified copy of the appellate court's final decision or the pardon to the petition. Upon receiving the petition and its attachment, the board shall schedule and hold a disciplinary hearing on the matter under section 214.10, subdivision 2, unless the petitioner waives the right to a hearing. If the board finds that, notwithstanding the reversal of the petitioner's criminal conviction or the issuance of a pardon, the petitioner is disqualified from teaching under paragraph (a), clause (1), the board shall affirm its previous licensing action. If the board finds that the petitioner is not disqualified from teaching under paragraph (a), clause (1), it shall reverse its previous licensing action.\n(d) For purposes of this subdivision, the Professional Educator Licensing and Standards Board is delegated the authority to suspend or revoke coaching licenses.\n(a) A school board, superintendent, charter school board, charter school executive director, or charter school authorizer must report to the Professional Educator Licensing and Standards Board, the Board of School Administrators, or the Board of Trustees of the Minnesota State Colleges and Universities, whichever has jurisdiction over the teacher's or administrator's license, when its teacher or administrator is discharged or resigns from employment after a charge is filed with the school board under section 122A.41, subdivisions 6, paragraph (a), clauses (1), (2), and (3), and 7, or after charges are filed that are grounds for discharge under section 122A.40, subdivision 13, paragraph (a), clauses (1) to (5), or when a teacher or administrator is suspended or resigns while an investigation is pending under section 122A.40, subdivision 13, paragraph (a), clauses (1) to (5), or chapter 260E; or 122A.41, subdivisions 6, clauses (1), (2), and (3), and 7; or when a teacher or administrator is suspended without an investigation under section 122A.41, subdivisions 6, paragraph (a), clauses (1), (2), and (3), and 7, or chapter 260E. The report must be made to the appropriate licensing board within ten days after the discharge, suspension, or resignation has occurred. The licensing board to which the report is made must investigate the report for violation of subdivision 1 and the reporting board, administrator, or authorizer must cooperate in the investigation. Notwithstanding any provision in chapter 13 or any law to the contrary, upon written request from the licensing board having jurisdiction over the license, a board, charter school, authorizer, charter school executive director, or school superintendent shall provide the licensing board with information about the teacher or administrator from the district's files, any termination or disciplinary proceeding, any settlement or compromise, or any investigative file. Upon written request from the appropriate licensing board, a board or school superintendent may, at the discretion of the board or school superintendent, solicit the written consent of a student and the student's parent to provide the licensing board with information that may aid the licensing board in its investigation and license proceedings. The licensing board's request need not identify a student or parent by name. The consent of the student and the student's parent must meet the requirements of chapter 13 and Code of Federal Regulations, title 34, section 99.30. The licensing board may provide a consent form to the district. Any data transmitted to any board under this section is private data under section 13.02, subdivision 12, notwithstanding any other classification of the data when it was in the possession of any other agency.\n(b) The licensing board to which a report is made must transmit to the Attorney General's Office any record or data it receives under this subdivision for the sole purpose of having the Attorney General's Office assist that board in its investigation. When the Attorney General's Office has informed an employee of the appropriate licensing board in writing that grounds exist to suspend or revoke a teacher's license to teach, that licensing board must consider suspending or revoking or decline to suspend or revoke the teacher's or administrator's license within 45 days of receiving a stipulation executed by the teacher or administrator under investigation or a recommendation from an administrative law judge that disciplinary action be taken.\n(c) The Professional Educator Licensing and Standards Board and Board of School Administrators must report to the appropriate law enforcement authorities a revocation, suspension, or agreement involving a loss of license, relating to a teacher or administrator's inappropriate sexual conduct with a minor. For purposes of this section, \"law enforcement authority\" means a police department, county sheriff, or Tribal police department. A report by the Professional Educator Licensing and Standards Board to appropriate law enforcement authorities does not diminish, modify, or otherwise affect the responsibilities of a school board or any person mandated to report abuse under chapter 260E.\nA school board, its members in their official capacity, and employees of the district run by the board are immune from civil or criminal liability for reporting or cooperating as required under subdivision 2, if their actions required under subdivision 2 are done in good faith and with due care.\nA school district or charter school may not place a teacher in a teaching assignment if the teacher has been criminally charged in state or federal court with any of the offenses listed in subdivision 1, paragraph (b), or is charged with any other offense not listed in this section that requires the person to register as a predatory offender under section 243.166, or a crime under a similar law of another state or the United States.",
	"repealed": false
}