{
	"id": "340A.504",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.504",
	"title": "340A.504 HOURS AND DAYS OF SALE.",
	"text": "No sale of 3.2 percent malt liquor may be made between 2:00 a.m. and 8:00 a.m. on the days of Monday through Saturday, nor between 2:00 a.m. and 10:00 a.m. on Sunday.\nNo sale of intoxicating liquor for consumption on the licensed premises may be made:\n(1) between 2:00 a.m. and 8:00 a.m. on the days of Monday through Saturday;\n(2) after 2:00 a.m. on Sundays, except as provided by subdivision 3.\nWhere a hotel possessing an on-sale intoxicating liquor license places containers of intoxicating liquor in cabinets in hotel rooms for the use of guests staying in those hotel rooms, and a charge is made for withdrawals from those cabinets, the dispensing of intoxicating liquor from those cabinets does not constitute a sale for purposes of subdivision 2.\n(a) A restaurant, club, bowling center, or hotel with a seating capacity for at least 30 persons and which holds an on-sale intoxicating liquor license may sell intoxicating liquor for consumption on the premises in conjunction with the sale of food between the hours of 8:00 a.m. on Sundays and 2:00 a.m. on Mondays.\n(b) An establishment serving intoxicating liquor on Sundays must obtain a Sunday license. The license must be issued by the governing body of the municipality for a period of one year, and the fee for the license may not exceed $200.\n(c) A city may issue a Sunday intoxicating liquor license only if authorized to do so by the voters of the city voting on the question at a general or special election. A county may issue a Sunday intoxicating liquor license in a town only if authorized to do so by the voters of the town as provided in paragraph (d). A county may issue a Sunday intoxicating liquor license in unorganized territory only if authorized to do so by the voters of the election precinct that contains the licensed premises, voting on the question at a general or special election.\n(d) An election conducted in a town on the question of the issuance by the county of Sunday sales licenses to establishments located in the town must be held on the day of the annual election of town officers.\n(e) Voter approval is not required for licenses issued by the Metropolitan Airports Commission or common carrier licenses issued by the commissioner. Common carriers serving intoxicating liquor on Sunday must obtain a Sunday license from the commissioner at an annual fee of $75, plus $30 for each duplicate.\n(a) No sale of intoxicating liquor may be made by an off-sale licensee:\n(1) on Sundays, except between the hours of 11:00 a.m. and 6:00 p.m.;\n(2) before 8:00 a.m. or after 10:00 p.m. on Monday through Saturday;\n(3) on Thanksgiving Day;\n(4) on Christmas Day, December 25; or\n(5) after 8:00 p.m. on Christmas Eve, December 24.\n(b) No delivery of alcohol to an off-sale or on-sale licensee may be made by a wholesaler or accepted by an off-sale or on-sale licensee on a Sunday. No order solicitation or merchandising may be made by a wholesaler on a Sunday.\nNo establishment licensed under section 340A.414, may permit a person to consume or display intoxicating liquor, and no person may consume or display intoxicating liquor between 1:00 a.m. and 12:00 noon on Sundays, and between 1:00 a.m. and 8:00 a.m. on Monday through Saturday.\nA municipality may further limit the days or hours of on and off sales of alcoholic beverages, provided that further restricted on-sale hours for intoxicating liquor must apply equally to on-sale hours of 3.2 percent malt liquor. A city may not permit the sale of alcoholic beverages during hours when the sale is prohibited by this section.\n(a) No licensee may sell intoxicating liquor or 3.2 percent malt liquor on-sale between the hours of 1:00 a.m. and 2:00 a.m. unless the licensee has obtained a permit from the commissioner. Application for the permit must be on a form the commissioner prescribes. Permits are effective for one year from date of issuance. For retailers of intoxicating liquor, the fee for the permit is based on the licensee's gross receipts from on-sales of alcoholic beverages in the 12 months prior to the month in which the permit is issued, and is at the following rates:\n(1) up to $100,000 in gross receipts, $300;\n(2) over $100,000 but not over $500,000 in gross receipts, $750; and\n(3) over $500,000 in gross receipts, $1,000.\nFor a licensed retailer of intoxicating liquor who did not sell intoxicating liquor at on-sale for a full 12 months prior to the month in which the permit is issued, the fee is $200. For a retailer of 3.2 percent malt liquor, the fee is $200.\n(b) The commissioner shall deposit all permit fees received under this subdivision in the general fund.\n(c) Notwithstanding any law to the contrary, the commissioner of revenue may furnish to the commissioner the information necessary to administer and enforce this subdivision.",
	"repealed": false
}