{
	"id": "241.252",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.252",
	"title": "241.252 FREE COMMUNICATION SERVICES FOR INCARCERATED PERSONS.",
	"text": "(a) A state adult or juvenile facility under the control of the commissioner of corrections must provide incarcerated persons with voice communication services. A facility may supplement voice communication services with other communication services, including but not limited to video communication and email or electronic messaging services. A facility must at least continue to offer the services the facility offered as of January 1, 2023.\n(b) To the extent that voice communication services are provided, which must not be limited beyond program participation and routine facility policies and procedures, neither the individual initiating the communication nor the individual receiving the communication must be charged for the service.\nNothing in this section allows an incarcerated person to violate an active protection order, harassment restraining order, or other no-contact order or directive.\nA state agency must not receive revenue from the provision of voice communication services or any other communication services under this section, but an agency may collect commissions on communication services provided under any contract entered into before January 1, 2023.\n(a) Facilities shall maintain in-person visits for incarcerated persons, and communication services must not be used to replace a facility's in-person visitation program.\n(b) Notwithstanding paragraph (a), the commissioner may waive the in-person visitation program requirement under this subdivision if there is:\n(1) a declared emergency under section 12.31; or\n(2) a local-, state-, or federal-declared natural disaster.\nThe Department of Corrections must include the following information covering the previous calendar year in its annual performance report required under section 241.016:\n(1) its efforts to renegotiate the agency's communication contracts, including the rates the agency is paying or charging incarcerated people or community members for any and all services in the contracts;\n(2) a complete and detailed accounting of how legislatively appropriated funds for communication services are spent, including spending on expenses previously covered by commissions; and\n(3) data on usage of all communication services, including monthly call and message volume.\nFor the purposes of this section, the following terms have the meanings given:\n(1) \"voice communications\" means real-time, audio-only communication services, namely phone calls made over wireline telephony, voice over Internet protocol, or any other technology infrastructure; and\n(2) \"other communication services\" means communication services other than voice communications, including but not limited to video calls and electronic messages.",
	"repealed": false
}