{
	"id": "142D.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.20",
	"title": "142D.20 CHILD CARE IMPROVEMENT GRANTS.",
	"text": "The purpose of this section is to enhance and expand child care sites, to encourage private investment in child care and early childhood education sites, to promote availability of quality, affordable child care throughout Minnesota, and to provide for cooperation between private nonprofit child care organizations, family child care and center providers and the department.\n(a) The commissioner shall distribute money provided by this section through grants to one or more nonprofit corporations to plan, develop, and finance early childhood education and child care sites. A nonprofit corporation must have demonstrated the ability to analyze financing projects, have knowledge of other sources of public and private financing for child care and early childhood education sites, and have a relationship with regional resource and referral programs. The board of directors of a nonprofit corporation must include members who are knowledgeable about early childhood education, child care, development and improvement, and financing.\n(b) The commissioners of the Departments of Human Services, Employment and Economic Development, and the Housing Finance Agency shall advise the boards of any nonprofit corporations that use the grant money provided under this section for loan programs as described in subdivision 3, paragraph (a), clauses (1) to (4). All loans made by a nonprofit corporation under this section must comply with section 363A.16.\n(a) A nonprofit corporation that receives a grant under this section shall use the money for one or more of the following activities:\n(1) to establish a revolving loan fund to make loans to existing, expanding, and new licensed and legal unlicensed child care and early childhood education sites;\n(2) to establish a fund to guarantee private loans to improve or construct a child care or early childhood education site;\n(3) to establish a fund to provide forgivable loans or grants to match all or part of a loan made under this section;\n(4) to establish a fund as a reserve against bad debt;\n(5) to provide business planning assistance for child care providers;\n(6) to provide training and consultation for child care providers to build and strengthen their businesses and acquire key business skills; and\n(7) to provide grants to child care providers for facility improvements, minor renovations, and related equipment and services, including assistance to meet licensing requirements, needed to establish, maintain, or expand licensed and legal unlicensed child care and early childhood education sites.\n(b) A nonprofit corporation establishing loans under this section shall establish the terms and conditions for loans and loan guarantees including, but not limited to, interest rates, repayment agreements, private match requirements, and conditions for loan forgiveness. A nonprofit corporation shall establish a minimum interest rate for loans to ensure that necessary loan administration costs are covered. A nonprofit corporation may use interest earnings for administrative expenses.\nA nonprofit corporation that receives a grant under this section shall:\n(1) annually report by September 30 to the commissioner the purposes for which the grant money was used in the past fiscal year, including a description of projects supported by the financing, an account of loans and grants made, the financing program's assets and liabilities, and an explanation of administrative expenses; and\n(2) annually submit to the commissioner a copy of the report of an independent audit performed in accordance with generally accepted accounting practices and auditing standards.",
	"repealed": false
}