{
	"id": "524.5-412",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-412",
	"title": "524.5-412 PROTECTIVE ARRANGEMENTS AND SINGLE TRANSACTIONS.",
	"text": "(a) If a basis is established for a protective order with respect to an individual, the court, without appointing a conservator, may:\n(1) authorize, direct, or ratify any transaction necessary or desirable to achieve any arrangement for security, service, or care meeting the foreseeable needs of the person subject to conservatorship, including:\n(i) subject to the procedural and notice requirements of section 524.5-418, the sale, mortgage, lease, or other transfer of property;\n(ii) purchase of an annuity;\n(iii) making a contract for lifetime care, a deposit contract, or a contract for training and education;\n(iv) addition to or establishment of a suitable trust, including a trust created under the Uniform Custodial Trust Act; or\n(v) establish, fund, and administer an ABLE account for the person subject to conservatorship. The conservator may exercise all powers over the ABLE account for the benefit of the person subject to conservatorship and shall direct investment of the ABLE accounts property in accordance with the provisions of sections 48A.07, subdivision 6; 501C.0901; and 524.5-423, or as otherwise ordered by the court. The standard of a fiduciary shall be applicable to all ABLE account investments by a conservator; and\n(2) authorize, direct, or ratify any other contract, trust, will, or transaction relating to the property and business affairs of the person subject to conservatorship, including a settlement of a claim, upon determining that it is in the best interest of the person subject to conservatorship.\n(b) In deciding whether to approve a protective arrangement or other transaction under this section, the court shall consider the factors listed in section 524.5-411, paragraph (e).\n(c) The court may appoint an agent to assist in the accomplishment of any protective arrangement or other transaction authorized under this section. The agent has the authority conferred by the order and shall serve until discharged by order after report to the court; provided, however, that if a conservator is appointed, only the conservator has the power to sign all real estate deeds.\n(d) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.",
	"repealed": false
}