{
	"id": "190.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.06",
	"title": "190.06 MILITIA; MEMBERS; EXEMPTIONS.",
	"text": "The militia shall consist of:\n(1) all able-bodied citizens of the state and other able-bodied persons residing in the state who have or shall have declared their intention to become citizens of the United States, when so authorized by federal law, who comply with the minimum age requirements for federal regular military service under United States Code, title 10, section 505, and who are not more than 45 years of age; provided, that the governor may, when the governor deems it necessary for the defense of the state, extend the maximum age for militia service to not more than 64 years; and\n(2) persons who enlist in, are commissioned in, or are otherwise appointed to the Minnesota National Guard in accordance with applicable federal law and regulation, including enlisted members, warrant officers, and commissioned officers.\nThe militia shall be divided into two classes, the organized militia and the unorganized militia. The organized militia shall consist of the following:\n(1) the National Guard;\n(2) the State Guard, which shall comprise all organized components of the militia except the National Guard.\nThe unorganized militia shall consist of all other members of the militia.\nThe governor may authorize the appointment or enlistment of citizens of the state and all other persons, who have or shall have declared their intention to become citizens of the United States, in the medical corps and other noncombatant branches and services of the organized militia, and while so serving they shall have the same status as members of the military forces.\nThe officers, judicial and executive, of the government of the United States and of the states; persons in the military or naval service of the United States; custom house clerks, persons employed by the United States in the transmission of the mail; artificers and workers employed in the armories, arsenals, and navy yards of the United States; pilots and mariners actually employed in the sea service of any citizen or merchant within the United States, shall all be exempt from militia duty without regard to age, and all persons who because of religious beliefs shall claim exemption from military service if the conscientious holding of such belief by such person shall be established under such regulations as the President of the United States shall prescribe, shall be exempt from militia service in a combatant capacity; but no person so exempted shall be exempt from militia service in any capacity that the President of the United States shall declare to be noncombatant.",
	"repealed": false
}