{
	"id": "43A.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.181",
	"title": "43A.181 UNREIMBURSED MEDICAL COSTS VACATION DONATION PROGRAM.",
	"text": "A state employee may donate up to 12 hours of accrued vacation time in any fiscal year to the account established by subdivision 2 for the benefit of another state employee. The employee must notify the employee's agency head of the amount of accrued vacation time the employee wishes to donate and the name of the other state employee who is to benefit from the donation. The agency head shall determine the monetary value of the donated time, using the gross salary of the employee making the donation. The agency head shall transfer that amount, less deductions for applicable taxes and retirement contributions, to the account established by subdivision 2. A donation of accrued vacation time is irrevocable once its monetary value has been transferred to the account.\nThe vacation benefit account, consisting of money transferred under subdivision 1, is administered by the commissioner of management and budget. Money in the account is appropriated to the commissioner for purposes of this section.\nExpenditures from the account established by subdivision 2 may be made to pay unreimbursed medical expenses when the total of those expenses is at least $10,000 and the expenses are incurred because of the illness of or injury to a state employee or the employee's spouse or dependent. Up to 40 percent of the funds donated to an individual employee's account may be used to pay for housing and transportation accessibility costs required by the employee who suffered an injury. Any money remaining after all of the expenses incurred by the employee named to benefit from a donation have been paid may be transferred to a general pool. The commissioner may use the pool to pay unreimbursed medical expenses for another state employee named to benefit from donated vacation time but whose unreimbursed expenses exceed the monetary value of the donated time.",
	"repealed": false
}