{
	"id": "580.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.23",
	"title": "580.23 REDEMPTION BY MORTGAGOR; AFFIDAVIT OF NONAGRICULTURAL USE; WAIVER.",
	"text": "(a) When lands have been sold in conformity with the preceding sections of this chapter, the mortgagor, the mortgagor's personal representatives or assigns, within six months after such sale, except as otherwise provided in subdivision 2 or section 582.032 or 582.32, may redeem such lands, as hereinafter provided, by paying the sum of money for which the same were sold, with interest from the time of sale at the rate provided to be paid on the mortgage debt as stated in the certificate of sale and, if no rate be provided in the certificate of sale, at the rate of six percent per annum, together with any further sums which may be payable as provided in sections 582.03 and 582.031.\n(b) Delivery of funds and documents for redemption must be made at the normal place of business of the recipient, on days other than Sunday, Saturday, and legal holidays, between the hours of 9:00 a.m. and 4:00 p.m.\n(c) Regardless of the length of the redemption period, the sheriff may accept a specific sum less than the full amount due for redemption by the mortgagor upon receipt by the sheriff, prior to expiration of the redemption period, of written confirmation from the holder of the sheriff's certificate or the attorney for the holder of the sheriff's certificate that the holder of the sheriff's certificate has agreed to accept a specific sum less than the full amount due for redemption.\nNotwithstanding the provisions of subdivision 1 hereof, when lands have been sold in conformity with the preceding sections of this chapter, the mortgagor, the mortgagor's personal representatives or assigns, within 12 months after such sale, may redeem such lands in accordance with the provisions of payment of subdivision 1 thereof, if:\n(1) the mortgage was executed prior to July 1, 1967;\n(2) the amount claimed to be due and owing as of the date of the notice of foreclosure sale is less than 66-2/3 percent of the original principal amount secured by the mortgage;\n(3) the mortgage was executed prior to July 1, 1987, and the mortgaged premises, as of the date of the execution of the mortgage, exceeded ten acres in size;\n(4) the mortgage was executed prior to August 1, 1994, and the mortgaged premises, as of the date of the execution of the mortgage, exceeded ten acres but did not exceed 40 acres in size and was in agricultural use as defined in section 40A.02, subdivision 3;\n(5) the mortgaged premises, as of the date of the execution of the mortgage, exceeded 40 acres in size;\n(6) the mortgage was executed on or after August 1, 1994, and the mortgaged premises, as of the date of the execution of the mortgage, exceeded ten acres but did not exceed 40 acres in size and was in agricultural use. For purposes of this clause, \"in agricultural use\" means that at least a portion of the mortgaged premises was classified for ad valorem tax purposes as:\n(i) class 2a agricultural homestead property under section 273.13, subdivision 23;\n(ii) class 2b rural or agricultural nonhomestead property under section 273.13, subdivision 23;\n(iii) class 1b agricultural homestead property under section 273.13, subdivision 22; or\n(iv) exempt wetlands under section 272.02, subdivision 11; or\n(7) the mortgage qualifies as a reverse mortgage as defined in section 47.58.\n(a) With respect to mortgages executed prior to August 1, 1994, an affidavit signed by the mortgagor and a certificate signed by the county assessor where the land is located stating that the mortgaged premises as legally described in the affidavit and certificate are not in agricultural use as defined in section 40A.02, subdivision 3, may be recorded in the office of the county recorder or registrar of titles where the property is located and are prima facie evidence of the facts contained in the affidavit and certificate.\n(b) With respect to mortgages executed on or after August 1, 1994, an affidavit signed by the mortgagor and a certificate signed by the county assessor where the land is located, stating that the mortgaged premises as legally described in the affidavit and certificate are not in agricultural use, may be recorded in the office of the county recorder or registrar of titles where the property is located and are prima facie evidence of the facts contained in the affidavit and certificate. For purposes of this paragraph, \"not in agricultural use\" means that no portion of the mortgaged premises, as legally described in the affidavit or certificate, is currently classified for ad valorem tax purposes in any classification listed in subdivision 2, clause (6), item (i), (ii), (iii), or (iv).\nA mortgagor, before or at the time of granting a mortgage executed on or after August 1, 1994, may waive in writing the mortgagor's right under subdivision 2, clause (6), to have a 12-month redemption period based upon the premises being in agricultural use as of the date of execution of the mortgage. The written waiver must be either a document separate from the mortgage or a separately executed and acknowledged addendum to the mortgage on a separate page. If the written waiver is a separate document, it must be in recordable form and must either recite the recorded document number of the mortgage or recite the names of the mortgagor and mortgagee, the legal description of the mortgaged property, and the date of the mortgage. If the written waiver is a separate document, it must be recorded in the office of the county recorder or registrar of titles no later than ten days after the recording of the mortgage. Where there is a waiver of the rights under subdivision 2, clause (6), the redemption period in subdivision 1 applies.",
	"repealed": false
}