{
	"id": "145D.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/145D.34",
	"title": "145D.34 ENFORCEMENT AND REMEDIES.",
	"text": "The attorney general has the powers in section 8.31. Nothing in this subdivision limits the powers, remedies, or responsibilities of the attorney general under this chapter; chapter 8, 309, 317A, or 501B; or any other chapter. For purposes of this section, an approval by the commissioner for regulatory purposes does not impair or inform the attorney general's authority.\n(a) The attorney general may bring an action in district court to enjoin or unwind a conversion transaction or seek other equitable relief necessary to protect the public interest if:\n(1) a nonprofit health coverage entity or conversion transaction violates sections 145D.30 to 145D.32; or\n(2) the conversion transaction is contrary to the public interest.\nIn seeking injunctive relief, the attorney general must not be required to establish irreparable harm but must instead establish that a violation of sections 145D.30 to 145D.32 occurred or that the requested order promotes the public interest.\n(b) Factors informing whether a conversion transaction is contrary to the public interest include but are not limited to whether:\n(1) the conversion transaction shall result in increased health care costs for patients; and\n(2) the conversion transaction shall adversely impact provider cost trends and containment of total health care spending.\n(c) The attorney general may enforce sections 145D.30 to 145D.32 under section 8.31.\n(d) Failure of the entities involved in a conversion transaction to provide timely information as required by the attorney general or the commissioner shall be an independent and sufficient ground for a court to enjoin or unwind the transaction or provide other equitable relief, provided the attorney general notifies the entities of the inadequacy of the information provided and provides the entities with a reasonable opportunity to remedy the inadequacy.\n(e) An officer, director, or other executive found to have violated sections 145D.30 to 145D.32 shall be subject to a civil penalty of up to $100,000 for each violation. A corporation or other entity which is a party to or materially participated in a conversion transaction found to have violated sections 145D.30 to 145D.32 shall be subject to a civil penalty of up to $1,000,000. A court may also award reasonable attorney fees and costs of investigation and litigation.\nThe commissioner of health must provide the attorney general, upon request, with data and research on broader market trends, impacts on prices and outcomes, public health and population health considerations, and health care access, for the attorney general to use when evaluating whether a conversion transaction is contrary to public interest. The commissioner of health may share with the attorney general, according to section 13.05, subdivision 9, any not public data, as defined in section 13.02, subdivision 8a, held by the commissioner to aid in the investigation and review of the conversion transaction, and the attorney general must maintain this data with the same classification according to section 13.03, subdivision 4, paragraph (c).\nFailure by the attorney general to take action with respect to a conversion transaction under this section does not constitute approval of the conversion transaction or waiver, nor shall failure prevent the attorney general from taking action in the same, similar, or subsequent circumstances.",
	"repealed": false
}