{
	"id": "256Q.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/256Q.05",
	"title": "256Q.05 ABLE PLAN ADMINISTRATION.",
	"text": "The commissioner shall ensure that the plan meets the requirements for an ABLE account under section 529A of the Internal Revenue Code, including any regulations released after July 1, 2015. The commissioner may request a private letter ruling or rulings from the Internal Revenue Service or Secretary of Health and Human Services and must take any necessary steps to ensure that the plan qualifies under relevant provisions of federal law.\n(a) The commissioner shall establish the rules, terms, and conditions for the plan, subject to the requirements of this chapter and section 529A of the Internal Revenue Code.\n(b) The commissioner shall prescribe the application forms, procedures, and other requirements that apply to the plan.\nIn designing and establishing the plan's requirements and in negotiating or entering into contracts with third parties under subdivision 4, the commissioner shall consult with the executive director of the board and the commissioner of the Office of Higher Education. The commissioner and the executive director shall establish an annual fee, equal to a percentage of the average daily net assets of the plan, to be imposed on account owners to recover the costs of administration, record keeping, and investment management as provided in subdivision 5.\nThe commissioner shall administer the plan, including accepting and processing applications, verifying state residency, verifying eligibility, maintaining account records, making payments, and undertaking any other necessary tasks to administer the plan. Notwithstanding other requirements of this chapter, the commissioner shall adopt rules for purposes of implementing and administering the plan. The commissioner may contract with one or more third parties to carry out some or all of these administrative duties, including providing incentives. The commissioner and the board may jointly contract with third-party providers, if the commissioner and board determine that it is desirable to contract with the same entity or entities for administration and investment management.\nThe commissioner, or the commissioner's designee, may impose annual fees, as provided in subdivision 3, on account owners to recover the costs of administration. The commissioner must keep the fees as low as possible, consistent with efficient administration, so that the returns on savings invested in the plan are as high as possible.\n(a) As required under section 529A(d) of the Internal Revenue Code, the commissioner or the commissioner's designee shall submit a notice to the Secretary of the Treasury upon the establishment of each ABLE account. The notice must contain the name and state of residence of the designated beneficiary and other information as the secretary may require.\n(b) As required under section 529A(d) of the Internal Revenue Code, the commissioner or the commissioner's designee shall submit electronically on a monthly basis to the Commissioner of Social Security, in a manner specified by the Commissioner of Social Security, statements on relevant distributions and account balances from all ABLE accounts.\n(a) Data on ABLE accounts and designated beneficiaries of ABLE accounts are private data on individuals or nonpublic data as defined in section 13.02.\n(b) The commissioner may share or disseminate data classified as private or nonpublic in this subdivision as follows:\n(1) with other state or federal agencies, only to the extent necessary to verify identity of, determine the eligibility of, or process applications for an eligible individual participating in the Minnesota ABLE plan; and\n(2) with a nongovernmental person, only to the extent necessary to carry out the functions of the Minnesota ABLE plan, provided the commissioner has entered into a data-sharing agreement with the person, as provided in section 13.05, subdivision 6, prior to sharing data under this clause or a contract with that person that complies with section 13.05, subdivision 11, as applicable.",
	"repealed": false
}