{
	"id": "308B.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.605",
	"title": "308B.605 ASSIGNMENT OF FINANCIAL RIGHTS.",
	"text": "Except as provided in subdivision 3, a member's financial rights are transferable in whole or in part.\nAn assignment of a member's financial rights entitles the assignee to receive, to the extent assigned, only the share of profits and losses and the distributions to which the assignor would otherwise be entitled. An assignment of a member's financial rights does not dissolve the cooperative and does not entitle or empower the assignee to become a member, to exercise any governance rights, to receive any notices from the cooperative, or to cause dissolution. The assignment shall not allow the assignee to control the member's exercise of governance or voting rights.\n(a) A restriction on the assignment of financial rights may be imposed in the articles, in the bylaws, in a member control agreement, by a resolution adopted by the members, by an agreement among or other written action by the members, or by an agreement among or other written action by the members and the cooperative. A restriction is not binding with respect to financial rights reflected in the required records before the adoption of the restriction, unless the owners of those financial rights are parties to the agreement or voted in favor of the restriction.\n(b) Subject to paragraph (c), a written restriction on the assignment of financial rights that is not manifestly unreasonable under the circumstances and is noted conspicuously in the required records may be enforced against the owner of the restricted financial rights or a successor or transferee of the owner, including a pledgee or a legal representative. Unless noted conspicuously in the required records, a restriction, even though permitted by this section, is ineffective against a person without knowledge of the restriction.\n(c) With regard to restrictions on the assignment of financial rights, a would-be assignee of financial rights is entitled to rely on a statement of membership interest issued by the cooperative under section 308B.611. A restriction on the assignment of financial rights, which is otherwise valid and in effect at the time of the issuance of a statement of membership interest but which is not reflected in that statement, is ineffective against an assignee who takes an assignment in reliance on the statement.\n(d) Notwithstanding any provision of law, articles, bylaws, member control agreement, other agreement, resolution, or action to the contrary, a security interest in a member's financial rights may be foreclosed and otherwise enforced, and a secured party may assign a member's financial rights in accordance with chapter 336, without the consent or approval of the member whose financial rights are subject to the security interest.",
	"repealed": false
}