{
	"id": "326B.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.37",
	"title": "326B.37 INSPECTION FEE SCHEDULE.",
	"text": "State electrical inspection fees shall be calculated in accordance with subdivisions 2 to 14.\nThe minimum fee for each separate inspection of an installation, replacement, alteration, or repair is $35. Except as otherwise provided in this section, the maximum number of separate inspections allowed without payment of an additional fee is the whole number resulting from dividing by 35 the total fee calculated in accordance with this section. Where additional separate inspections are necessary, additional fees are required to result in a value equal to the total number of separate inspections multiplied by 35. The fee for any inspections needed after a \"final inspection\" is performed shall be calculated without consideration of any fee paid before the final inspection.\nThe inspection fee for the installation, addition, alteration, or repair of each service, change of service, temporary service, generator, other power supply source, or feeder to a separate structure is:\n(1) 0 ampere to and including 400 ampere capacity, $35;\n(2) 401 ampere to and including 800 ampere capacity, $60; and\n(3) ampere capacity above 800, $100.\nWhere multiple disconnects are grouped at a single location and are supplied by a single set of supply conductors the cumulative rating of the overcurrent devices shall be used to determine the supply ampere capacity.\nThe inspection fee for the installation, addition, alteration, or repair of each circuit, feeder, feeder tap, or set of transformer secondary conductors, including the equipment served, is:\n(1) 0 ampere to and including 200 ampere capacity, $6; and\n(2) ampere capacity above 200, $15.\nWhere existing feeders and circuits are reconnected to overcurrent devices installed as part of the replacement of an existing disconnect, switchboard, motor control center, or panelboard, the inspection fee for each circuit or feeder is $2.\n(a) The inspection fee for a one-family dwelling and each dwelling unit of a two-family dwelling is the following:\n(1) the fee for each service or other source of power as provided in subdivision 3;\n(2) $100 for up to 30 feeders and circuits; and\n(3) for each additional feeder or circuit, the fee as provided in subdivision 4.\nThis fee applies to each separate installation for new dwellings and where 15 or more feeders or circuits are installed or extended in connection with any addition, alteration, or repair to existing dwellings. Where existing feeders and circuits are reconnected to overcurrent devices installed as part of the replacement of an existing panelboard, the fee for each reconnected feeder or circuit is $2. The maximum number of separate inspections shall be determined in accordance with subdivision 2. The fee for additional inspections or other installations is that specified in subdivisions 2, 4, 6, and 8. The installer may submit fees for additional inspections when filing the request for electrical inspection. The fee for each detached accessory structure directly associated with a dwelling unit shall be calculated in accordance with subdivisions 3 and 4. When included on the same request for electrical inspection form, inspection fees for detached accessory structures directly associated with the dwelling unit may be combined with the dwelling unit fees to determine the maximum number of separate inspections in accordance with subdivision 2.\n(b) The inspection fee for each dwelling unit of a multifamily dwelling with three or more dwelling units is $70 for a combination of up to 20 feeders and circuits and $6 for each additional feeder or circuit. This fee applies to each separate installation for each new dwelling unit and where ten or more feeders or circuits are installed or extended in connection with any addition, alteration, or repair to existing dwelling units. Where existing feeders or circuits are reconnected to overcurrent devices installed as part of the replacement of an existing panelboard, the fee for each reconnected feeder or circuit is $2. The maximum number of separate inspections for each dwelling unit shall be determined in accordance with subdivision 2. The fee for additional inspections or for inspection of other installations is that specified in subdivisions 2, 4, 6, and 8. These fees include only inspection of the wiring within individual dwelling units and the final feeder to that unit where the multifamily dwelling is provided with common service equipment and each dwelling unit is supplied by a separate feeder or feeders extended from common service or distribution equipment. The fee for multifamily dwelling services or other power source supplies and all other circuits is that specified in subdivisions 2 to 4.\n(c) A separate request for electrical inspection form must be filed for each dwelling unit that is supplied with an individual set of service entrance conductors. These fees are the one-family dwelling rate specified in paragraph (a).\n(a) The fee for the electrical supply for each manufactured home park lot is $35. This fee includes the service or feeder conductors up to and including the service equipment or disconnecting means. The fee for feeders and circuits that extend from the service or disconnecting means is that specified in subdivision 4.\n(b) The fee for each recreational vehicle site electrical supply equipment is $6 for each circuit originating within the equipment. The fee for recreational vehicle park services, feeders, and circuits is that specified in subdivisions 3 and 4.\n(c) The fee for each street, parking lot, or outdoor area lighting standard and each traffic signal standard is $5. Circuits originating within the standard or traffic signal controller shall not be used when calculating the fee for each standard.\n(d) The fee for transformers for light, heat, and power is $15 for transformers rated up to ten kilovolt-amperes and $30 for transformers rated in excess of ten kilovolt-amperes. The previous sentence does not apply to Class 1 transformers or power supplies for Class 1 power-limited circuits or to Class 2 or Class 3 transformers or power supplies.\n(e) The fee for transformers and electronic power supplies for electric signs and outline lighting is $5 per unit.\n(f) The fee for technology circuits or systems, and circuits of less than 50 volts, is 75 cents for each system device or apparatus.\n(g) The fee for each separate inspection of the bonding for a swimming pool, spa, fountain, an equipotential plane for an agricultural confinement area, or similar installation is $35. Bonding conductors and connections require an inspection before being concealed.\n(h) The fee for all wiring installed on center pivot irrigation booms is $35 plus $5 for each electrical drive unit.\n(i) The fee for retrofit modifications to existing lighting fixtures is 25 cents per luminaire.\n(j) When a separate inspection of a concrete-encased grounding electrode is performed, the fee is $35.\n(k) The fees required by subdivisions 3 and 4 are doubled for installations over 600 volts.\n(a) Whenever any work for which a request for electrical inspection is required has begun without the request for electrical inspection form being filed with the commissioner, a special investigation shall be made before a request for electrical inspection form is accepted.\n(b) An investigation fee, in addition to the full fee required by subdivisions 1 to 6, shall be paid before an inspection is made. The investigation fee is two times the minimum fee specified in subdivision 2 or the inspection fee required by subdivisions 1 to 6, whichever is greater, not to exceed $1,000. The payment of the investigation fee does not exempt any person from compliance with all other provisions of the department rules or statutes nor from any penalty prescribed by law.\nNotwithstanding the provisions of subdivisions 2 and 5, when reinspection is necessary to determine whether unsafe conditions identified during a final inspection have been corrected and the conditions are not the subject of an appeal pending before the commissioner or any court, a reinspection fee of $35 shall be assessed in writing by the inspector.\nWhen inspections scheduled by the installer are preempted, obstructed, prevented, or otherwise not able to be completed as scheduled due to circumstances beyond the control of the inspector, a supplemental inspection fee of $35 shall be assessed in writing by the inspector.\nFor inspections not covered in this section, or for requested special inspections or services, the fee is $80 per hour, including travel time, plus the standard mileage rate per mile traveled, plus the reasonable cost of equipment or material consumed. This provision is applicable to inspection of empty conduits and other jobs as may be determined by the commissioner. This fee may also be assessed when installations are not accessible by roadway and require alternate forms of transportation or are located in the Northwest Angle, or when inspections are performed outside of Minnesota. For purposes of this subdivision, the standard mileage rate is the standard mileage rate effective at the time of travel, as established by the Internal Revenue Service for computing the deductible costs of operating an automobile for business expense purposes.\n(a) For inspection of transitory projects including, but not limited to, festivals, fairs, carnivals, circuses, shows, production sites, and portable road construction plants, the inspection procedures and fees are as specified in paragraphs (b) to (i).\n(b) The fee for inspection of each generator or other source of supply is that specified in subdivision 3. A like fee is required at each engagement or setup.\n(c) In addition to the fee for generators or other sources of supply, there must be an inspection of all installed feeders, circuits, and equipment at each engagement or setup at the hourly rate specified in subdivision 10, with a one-hour minimum.\n(d) An owner, operator, or appointed representative of a transitory enterprise including, but not limited to, festivals, fairs, carnivals, circuses, production companies, shows, portable road construction plants, and similar enterprises shall notify the commissioner of its itinerary or schedule and make application for initial inspection a minimum of 14 days before its first engagement or setup. An owner, operator, or appointed representative of a transitory enterprise who fails to notify the commissioner 14 days before its first engagement or setup may be subject to the investigation fees specified in subdivision 7. The owner, operator, or appointed representative shall request inspection and pay the inspection fee for each subsequent engagement or setup at the time of the initial inspection. For subsequent engagements or setups not listed on the itinerary or schedule submitted to the commissioner and where the commissioner is not notified at least 48 hours in advance, a charge of $100 may be made in addition to all required fees.\n(e) Amusement rides, devices, concessions, attractions, or other units must be inspected at their first appearance of the year. The inspection fee is $35 per unit with a supply of up to 60 amperes and $40 per unit with a supply above 60 amperes.\n(f) An additional fee at the hourly rate specified in subdivision 10 must be charged for additional time spent by each inspector if equipment is not ready or available for inspection at the time and date specified on the application for initial inspection or the request for electrical inspection form.\n(g) In addition to the fees specified in paragraphs (b) and (c), a fee of one hour at the hourly rate specified in subdivision 10 must be charged for inspections required to be performed on Saturdays, Sundays, holidays, or after regular business hours.\n(h) The fee for reinspection of corrections or supplemental inspections where an additional trip is necessary may be assessed as specified in subdivision 8.\n(i) The commissioner shall retain the inspection fee when an owner, operator, or appointed representative of a transitory enterprise fails to notify the commissioner at least 48 hours in advance of a scheduled inspection that is canceled.\nWhen the fee calculated in accordance with subdivisions 2 to 11 results in a total fee that unreasonably exceeds the cost of inspection, the commissioner may negotiate a fee that more reasonably offsets the cost of inspection.\n[Repealed, 2010 c 280 s 40; 2010 c 347 art 3 s 75]\nFor purposes of interpretation of this section and Minnesota Rules, chapter 3800, the most recently adopted edition of the National Electrical Code shall be prima facie evidence of the definitions, interpretations, and scope of words and terms used.\n[Repealed, 2017 c 68 art 1 s 27]\n(a) The inspection fee for the installation of a wind turbine is:\n(1) zero watts to and including 100,000 watts, $80;\n(2) 100,001 watts to and including 500,000 watts, $105;\n(3) 500,001 watts to and including 1,000,000 watts, $120;\n(4) 1,000,001 watts to and including 1,500,000 watts, $125;\n(5) 1,500,001 watts to and including 2,000,000 watts, $130;\n(6) 2,000,001 watts to and including 3,000,000 watts, $145; and\n(7) 3,000,001 watts and larger, $160.\n(b) For the purpose of paragraph (a), the watt rating is the total estimated alternating current energy output of one individual wind turbine.\n(a) The inspection fee for the installation of a solar photovoltaic system is:\n(1) zero watts to and including 5,000 watts, $60;\n(2) 5,001 watts to and including 10,000 watts, $100;\n(3) 10,001 watts to and including 20,000 watts, $150;\n(4) 20,001 watts to and including 30,000 watts, $200;\n(5) 30,001 watts to and including 40,000 watts, $250;\n(6) 40,001 watts to and including 1,000,000 watts, $250, and $25 for each additional 10,000 watts over 40,000 watts;\n(7) 1,000,001 watts to 5,000,000 watts, $2,650, and $15 for each additional 10,000 watts over 1,000,000 watts; and\n(8) 5,000,001 watts and larger, $8,650, and $10 for each additional 10,000 watts over 5,000,000 watts.\n(b) For the purpose of paragraph (a), the watt rating is the total estimated alternating current energy output of the solar photovoltaic system.",
	"repealed": false
}