{
	"id": "5A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/5A.03",
	"title": "5A.03 ORGANIZATION APPLICATION FOR REGISTRATION.",
	"text": "(a) An application for registration as an international student exchange visitor placement organization must be submitted in the form prescribed by the secretary of state. The application must include:\n(1) evidence that the organization meets the standards established by the secretary of state by rule;\n(2) the name, address, and telephone number of the organization, its chief executive officer, and the person within the organization who has primary responsibility for supervising placements within the state;\n(3) the organization's unified business identification number, if any;\n(4) the organization's Office of Exchange Coordination and Designation, United States Department of State number, if any;\n(5) evidence of Council on Standards for International Educational Travel listing, if any;\n(6) whether the organization is exempt from federal income tax; and\n(7) a list of the organization's placements in Minnesota for the previous academic year including the number of students placed, their home countries, the school districts in which they were placed, and the length of their placements.\n(b) The application must be signed by the chief executive officer of the organization and the person within the organization who has primary responsibility for supervising placements within Minnesota. If the secretary of state determines that the application is complete, the secretary of state shall file the application and the applicant is registered.\n(c) Organizations that have registered shall inform the secretary of state of any changes in the information required under paragraph (a), clause (1), within 30 days of the change. There is no fee to amend a registration.\n(d) Registration under this chapter is valid for one year. The registration may be renewed annually. The fee to renew a registration is $50 per year.\n(e) Organizations registering for the first time in Minnesota must pay an initial registration fee of $150.\n(f) Fees collected by the secretary of state under this section must be deposited in the state treasury and credited to the general fund.\n(a) A school district or charter school with enrolled students who participate in a foreign exchange or study or other travel abroad program under a written agreement between the district or charter school and the program provider must use a form developed by the Department of Education to annually report to the department by November 1 the following data from the previous school year:\n(1) the number of Minnesota student deaths that occurred while Minnesota students were participating in the foreign exchange or study or other travel abroad program and that resulted from Minnesota students participating in the program;\n(2) the number of Minnesota students hospitalized due to accidents and the illnesses that occurred while Minnesota students were participating in the foreign exchange or study or other travel abroad program and that resulted from Minnesota students participating in the program; and\n(3) the name and type of the foreign exchange or study or other travel abroad program and the city or region where the reported death, hospitalization due to accident, or the illness occurred.\n(b) School districts and charter schools must ask but must not require enrolled eligible students and the parents or guardians of other enrolled students who complete a foreign exchange or study or other travel abroad program to disclose the information under paragraph (a).\n(c) When reporting the data under paragraph (a), a school district or charter school may supplement the data with a brief explanatory statement. The Department of Education annually must aggregate and publish the reported data on the department website in a format that facilitates public access to the aggregated data and include links to both the United States Department of State's Consular Information Program that informs the public of conditions abroad that may affect students' safety and security and the publicly available reports on sexual assaults and other criminal acts affecting students participating in a foreign exchange or study or other travel abroad program.\n(d) School districts and charter schools with enrolled students who participate in foreign exchange or study or other travel abroad programs under a written agreement between the district or charter school and the program provider are encouraged to adopt policies supporting the programs and to include program standards in their policies to ensure students' health and safety.\n(e) To be eligible under this subdivision to provide a foreign exchange or study or other travel abroad program to Minnesota students enrolled in a school district or charter school, a program provider annually must register with the secretary of state and provide the following information on a form developed by the secretary of state: the name, address, and telephone number of the program provider, its chief executive officer, and the person within the provider's organization who is primarily responsible for supervising programs within the state; the program provider's unified business identification number, if any; whether the program provider is exempt from federal income tax; a list of the program provider's placements in foreign countries for the previous school year including the number of Minnesota students placed, where Minnesota students were placed, and the length of their placement; the terms and limits of the medical and accident insurance available to cover participating students and the process for filing a claim; and the signatures of the program provider's chief executive officer and the person primarily responsible for supervising Minnesota students' placements in foreign countries. If the secretary of state determines the registration is complete, the secretary of state shall file the registration and the program provider is registered. Registration with the secretary of state must not be considered or represented as an endorsement of the program provider by the secretary of state. The secretary of state annually must publish on its website aggregated data under paragraph (c) received from the Department of Education.\n(f) Program providers, annually by August 1, must provide the data required under paragraph (a), clauses (1) to (3), to the districts and charter schools with enrolled students participating in the provider's program.\n(g) The Department of Education must publish the information it has under paragraph (c), but it is not responsible for any errors or omissions in the information provided to it by a school district or charter school. A school district or charter school is not responsible for omissions in the information provided to it by students and programs.",
	"repealed": false
}