{
	"id": "62J.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.89",
	"title": "62J.89 CONFLICTS OF INTEREST.",
	"text": "For purposes of this section, \"conflict of interest\" means a financial or personal association that has the potential to bias or have the appearance of biasing a person's decisions in matters related to the board, the advisory council, or in the conduct of the board's or council's activities. A conflict of interest includes any instance in which a person, a person's immediate family member, including a spouse, parent, child, or other legal dependent, or an in-law of any of the preceding individuals, has received or could receive a direct or indirect financial benefit of any amount deriving from the result or findings of a decision or determination of the board. For purposes of this section, a financial benefit includes honoraria, fees, stock, the value of the member's, immediate family member's, or in-law's stock holdings, and any direct financial benefit deriving from the finding of a review conducted under sections 62J.85 to 62J.95. Ownership of securities is not a conflict of interest if the securities are: (1) part of a diversified mutual or exchange traded fund; or (2) in a tax-deferred or tax-exempt retirement account that is administered by an independent trustee.\n(a) Prior to the acceptance of an appointment or employment, or prior to entering into a contractual agreement, a board or advisory council member, board staff member, or third-party contractor must disclose to the appointing authority or the board any conflicts of interest. The information disclosed must include the type, nature, and magnitude of the interests involved.\n(b) A board member, board staff member, or third-party contractor with a conflict of interest with regard to any prescription drug product under review must recuse themselves from any discussion, review, decision, or determination made by the board relating to the prescription drug product.\n(c) Any conflict of interest must be disclosed in advance of the first meeting after the conflict is identified or within five days after the conflict is identified, whichever is earlier.\nBoard members, board staff, or third-party contractors are prohibited from accepting gifts, bequeaths, or donations of services or property that raise the specter of a conflict of interest or have the appearance of injecting bias into the activities of the board.",
	"repealed": false
}