{
	"id": "174.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.12",
	"title": "174.12 TRANSPORTATION ECONOMIC DEVELOPMENT PROGRAM.",
	"text": "(a) The commissioners of transportation and employment and economic development shall develop and implement a transportation economic development program, as provided in this section, that provides financial assistance on a geographically balanced basis through competitive grants for projects in all modes of transportation that provide measurable local, regional, or statewide economic benefit.\n(b) The commissioners of transportation and employment and economic development may provide financial assistance for a transportation project at their discretion, subject to the requirements of this section.\n(a) A transportation economic development account is established in the special revenue fund under the budgetary jurisdiction of the legislative committees having jurisdiction over transportation finance. Money in the account may be expended only as appropriated by law. The account may not contain money transferred or otherwise provided from the trunk highway fund.\n(b) A transportation economic development account is established in the trunk highway fund. The account consists of funds donated, allotted, transferred, or otherwise provided to the account. Money in the account may be used only for trunk highway purposes. All funds in the account are available until expended.\nIn implementing the transportation economic development program, the commissioners of transportation and employment and economic development shall make reasonable efforts to (1) publicize each solicitation for applications among all eligible recipients, and (2) provide technical and informational assistance in creating and submitting applications.\nThe commissioner of employment and economic development shall develop economic impact performance measures to analyze projects for which financial assistance under this section is being applied for or has been previously provided.\nThe commissioners of transportation and employment and economic development shall establish criteria for evaluating projects for financial assistance under this section. At a minimum, the criteria must provide an objective method to prioritize and select projects on the basis of:\n(1) the extent to which the project provides measurable economic benefit;\n(2) consistency with relevant state and local transportation plans;\n(3) the availability and commitment of funding or in-kind assistance for the project from nonpublic sources;\n(4) the need for the project as part of the overall transportation system;\n(5) the extent to which completion of the project will improve the movement of people and freight; and\n(6) geographic balance as required under subdivision 7, paragraph (b).\n(a) Following the criteria established under subdivision 5, the commissioner of employment and economic development shall (1) evaluate proposed projects, and (2) certify those that may receive financial assistance.\n(b) As part of the project evaluation process, the commissioner of transportation shall certify those projects that constitute an eligible and appropriate transportation project.\n(a) The financial assistance awarded by the commissioners of transportation and employment and economic development may not exceed 70 percent of a project's total costs.\n(b) The commissioners of transportation and employment and economic development shall ensure that financial assistance is provided in a manner that is balanced throughout the state, including with respect to (1) the number of projects receiving funding in a particular geographic location or region of the state, and (2) the total amount of financial assistance provided for projects in a particular geographic location or region of the state.\n(a) By February 1 of each odd-numbered year, the commissioner of transportation, with assistance from the commissioner of employment and economic development, must submit a report on the transportation economic development program to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance and economic development policy and finance.\n(b) At a minimum, the report must:\n(1) summarize the requirements and implementation of the transportation economic development program established in this section;\n(2) review the criteria and economic impact performance measures used for evaluation, prioritization, and selection of projects;\n(3) provide a brief overview of each project that received financial assistance under the program, which must at a minimum identify:\n(i) basic project characteristics, such as funding recipient, geographic location, and type of transportation modes served;\n(ii) sources and respective amounts of project funding; and\n(iii) the degree of economic benefit anticipated or observed, following the economic impact performance measures established under subdivision 4;\n(4) identify the allocation of funds, including but not limited to a breakdown of total project funds by transportation mode, the amount expended for administrative costs, and the amount transferred to the transportation economic development assistance account;\n(5) evaluate the overall economic impact of the program; and\n(6) provide recommendations for any legislative changes related to the program.\n(c) Notwithstanding paragraph (a), a report is not required in an odd-numbered year if no project received financial assistance during the preceding 24 months.",
	"repealed": false
}