{
	"id": "327B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/327B.04",
	"title": "327B.04 MANUFACTURERS AND DEALERS; LICENSES; BONDS.",
	"text": "No person shall act as a dealer in manufactured homes, new or used, without a license, a surety bond, and liability insurance as provided in this section. No person shall manufacture manufactured homes without a license for each manufacturing facility shipping into or located within Minnesota's boundaries, a surety bond, and liability insurance as provided in this section. The licensing and bonding requirements of this section do not apply to any bank, savings bank, savings association, or credit union, chartered by either this state or the federal government, which acts as a dealer only by repossessing manufactured homes and then offering the homes for resale.\nAny dealer who has a place of business at more than one location shall designate one location as its principal place of business, one name as its principal name, and all other established places of business as subagencies. A subagency license shall be required for each subagency. Subagency license renewal must coincide with the principal license date. No dealer shall do business as a dealer under any other name than the name on its license.\nApplication for a license and its renewal shall be made to the commissioner, shall be in writing, and duly verified by oath. The applicant shall submit any information required by the commissioner, upon forms provided by the commissioner for that purpose, including:\n(a) proof of identity;\n(b) the name under which the applicant will be licensed and do business in this state;\n(c) the applicant's type and place of business;\n(d) the name, home and business address of the applicant's directors, officers, limited and general partners, controlling shareholders and affiliates;\n(e) whether the applicant, or any of its directors, officers, limited or general partners, controlling shareholders or affiliates, has been convicted of a crime within the previous ten years that either related directly to the business for which the license is sought or involved fraud, misrepresentation or misuse of funds, or has suffered a judgment in a civil action involving fraud, misrepresentation, or conversion within the previous five years or has had any government license or permit suspended or revoked as a result of an action brought by a federal or state governmental agency in this or any other state within the last five years; and\n(f) the applicant's qualifications and business history, including whether the applicant, or any of its directors, officers, limited or general partners, controlling shareholders or affiliates has ever been adjudged bankrupt or insolvent, or has any unsatisfied court judgments outstanding against it or them.\nNo application shall be granted nor license issued until the applicant proves to the commissioner that:\n(a) the applicant has a permanent, established place of business at each licensed location. An \"established place of business\" means a permanent enclosed building other than a residence, or a commercial office space, either owned by the applicant or leased by the applicant for a term of at least one year, located in an area where zoning regulations allow commercial activity, and where the books, records and files necessary to conduct the business are kept and maintained. The owner of a licensed manufactured home park who resides in or adjacent to the park may use the residence as the established place of business required by this subdivision, unless prohibited by local zoning ordinance.\nIf a license is granted, the licensee may use unimproved lots and premises for sale, storage, and display of manufactured homes, if the licensee first notifies the commissioner in writing;\n(b) if the applicant desires to sell, solicit or advertise the sale of new manufactured homes, it has a bona fide contract or franchise in effect with a manufacturer or distributor of the new manufactured home it proposes to deal in;\n(c) the applicant has secured: (1) a surety bond in the amount of $20,000 for each agency and each subagency location that bears the applicant's name and the name under which the applicant will be licensed and do business in this state. Each bond is for the protection of consumer customers, and must be executed by the applicant as principal and issued by a surety company admitted to do business in this state. Each bond shall be exclusively for the purpose of reimbursing consumer customers and shall be conditioned upon the faithful compliance by the applicant with all of the laws and rules of this state pertaining to the applicant's business as a dealer or manufacturer, including sections 325D.44, 325F.67 and 325F.69, and upon the applicant's faithful performance of all its legal obligations to consumer customers; and (2) a certificate of liability insurance in the amount of $1,000,000 that provides aggregate coverage for the agency and each subagency location. In the event of a policy cancellation, the insurer shall send written notice to the commissioner at the same time that a cancellation request is received from or a notice is sent to the insured;\n(d) the applicant has established a trust account as required by section 327B.08, subdivision 3, unless the applicant states in writing its intention to limit its business to selling, offering for sale, soliciting or advertising the sale of new manufactured homes; and\n(e) the applicant has provided evidence of having had at least two years' prior experience in the sale of manufactured homes, working for a licensed dealer. The applicant does not have to satisfy the two-year prior experience requirement if:\n(1) the applicant sells or brokers used manufactured homes as permitted under section 327B.01, subdivision 7; or\n(2) the applicant:\n(i) has met all other licensing requirements;\n(ii) is the owner of a manufactured home park; and\n(iii) is selling new manufactured homes installed in the manufactured home park that the applicant owns.\nAny person licensed as a real estate broker or salesperson under chapter 82 who brokers the sale of used manufactured homes is not required to obtain a license or a bond as required by this section, but is subject to all other provisions of sections 327B.01 to 327B.12. Any real estate broker or salesperson who violates a provision of sections 327B.06 to 327B.09 in selling or offering for sale a used manufactured home shall be deemed to have violated a provision of chapter 82.\nFor each license granted the commissioner shall issue a certificate which includes the name of the licensee, the name of the surety company and the amount of the surety bond, and the insurance underwriter and policy number, the names and addresses of any related principal or subagencies, and a license number.\nIn addition to the requirements of this section, each application for a license or license renewal must be accompanied by all applicable fees required by section 326B.092. The fees shall be set in an amount which over the fiscal biennium will produce revenues approximately equal to the expenses which the commissioner expects to incur during that fiscal biennium while administering and enforcing sections 327B.01 to 327B.12. If the license is granted, the commissioner shall license the applicant as a dealer or manufacturer for the remainder of the licensure period. Upon application by the licensee, the commissioner shall renew the license for a two-year period, if:\n(1) the renewal application satisfies the requirements of subdivisions 3 and 4;\n(2) the renewal applicant has made all listings, registrations, notices and reports required by the commissioner during the preceding licensure period; and\n(3) the renewal applicant has paid all fees owed pursuant to sections 327B.01 to 327B.12 and all taxes, arrearages, and penalties owed to the state.\n(a) Fees for licenses issued pursuant to this section shall be calculated pursuant to section 326B.092.\n(b) All initial limited dealer licenses shall be effective for more than one calendar year and shall expire on December 31 of the year after the year in which the application is made.\n(c) For the purposes of calculating fees under section 326B.092, any license issued under this section is a business license, except that a subagency license is a master license. The commissioner shall in a manner determined by the commissioner, without the need for any rulemaking under chapter 14, phase in the renewal of limited dealer licenses from one year to two years. By June 30, 2011, all renewed limited dealer licenses shall be two-year licenses.\nThe commissioner shall issue a limited dealer's license to an owner of a manufactured home park authorizing the licensee as principal only to engage in the sale, offering for sale, soliciting, or advertising the sale of used manufactured homes located in the owned manufactured home park. The licensee must be the title holder of the homes and may engage in no more than ten sales during each year of the two-year licensure period. An owner may, upon payment of the applicable fee and compliance with this subdivision, obtain a separate license for each owned manufactured home park and is entitled to sell up to 20 homes per license period provided that only one limited dealer license may be issued for each park. The license shall be issued after:\n(1) receipt of an application on forms provided by the commissioner containing the following information:\n(i) the identity of the applicant;\n(ii) the name under which the applicant will be licensed and do business in this state;\n(iii) the name and address of the owned manufactured home park, including a copy of the park license, serving as the basis for the issuance of the license;\n(iv) the name, home, and business address of the applicant;\n(v) the name, address, and telephone number of one individual that is designated by the applicant to receive all communications and cooperate with all inspections and investigations of the commissioner pertaining to the sale of manufactured homes in the manufactured home park owned by the applicant;\n(vi) whether the applicant or its designated individual has been convicted of a crime within the previous ten years that is either related directly to the business for which the license is sought or involved fraud, misrepresentation or misuse of funds, or has suffered a judgment in a civil action involving fraud, misrepresentation, or conversion within the previous five years or has had any government license or permit suspended or revoked as a result of an action brought by a federal or state governmental agency in this or any other state within the last five years; and\n(vii) the applicant's qualifications and business history, including whether the applicant or its designated individual has ever been adjudged bankrupt or insolvent, or has any unsatisfied court judgments outstanding against it or them;\n(2) payment of the license fee established by subdivision 7a; and\n(3) provision of a surety bond in the amount of $5,000. A separate surety bond must be provided for each limited license.\nThe applicant need not comply with subdivision 4, paragraph (e). The holding of a limited dealer's license does not satisfy the requirement contained in subdivision 4, paragraph (e), for the licensee or salespersons with respect to obtaining a dealer license. The commissioner may, upon application for a renewal of a license, require only a verification that copies of sales documents have been retained and payment of the renewal fees established by section 326B.092. \"Sales documents\" mean only the safety feature disclosure form defined in section 327C.07, subdivision 3a, title of the home, financing agreements, and purchase agreements.\nThe license holder shall, upon request of the commissioner, make available for inspection during business hours sales documents required to be retained under this subdivision.\nService of a document on a limited dealer licensed under this section may be effected by mail to or by personal service on: (1) the licensee at the licensee's last known address; or (2) the individual designated by the licensee at that individual's last known address.",
	"repealed": false
}