{
	"id": "383B.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.29",
	"title": "383B.29 DUTIES OF HUMAN RESOURCES BOARD.",
	"text": "When any member of the board is not present at the time a matter is submitted to the board such matter shall be deemed submitted to each member of the board with like effect as though each member of the board had been present at the time of submission of such matter. Whenever during the consideration of a matter which is before the board, there is a change in the personnel of the board, the matter shall be deemed submitted to the new member, or members, as though said new member, or members, had been a member of the board at the time of the submission of the matter.\nNo meetings of the board shall be held unless at least four members are present. A majority vote of all members present shall constitute the decision of the board. The board shall keep records and minutes of its business and official actions which shall be open to public inspection subject to such reasonable rules as to time and place of inspection as the board may establish.\n(a) The board shall establish rules for the classified service with the assistance of the human resources director. All rules and amendments proposed by the board shall be subject to public hearing upon prior notice to department heads, employees, affected labor organizations, and the public, as the board may, by rule prescribe. The rules as approved by the majority vote of the board shall be submitted to the county board for approval or rejection. When approved, by majority vote and in the form of a written resolution, the rules shall have the force and effect of law. The rules may be amended and repealed with the consent of the county board in the same manner as provided for original adoption.\n(b) The rules shall provide for:\n(1) selection methods and the establishment of lists to fill positions in the county service including promotion;\n(2) the appointment of qualified candidates to vacant positions, if the vacancy is not filled by recall from the layoff list, demotion, reinstatement, reassignment, transfer from other employers or with county service. Whenever practicable, vacancies must be filled by promotion. The 20 persons having the highest qualifications that meet the requirements of the position to be filled, when available, must be referred to appointing authority when a vacancy occurs;\n(3) a period of probation during which period the probationer may be discharged or demoted, without right of appeal. The period of probation, which is determined by the department director and the human resources director, must not exceed 12 months unless approved by the board;\n(4) seasonal, provisional, temporary, and emergency appointments. The appointments, except seasonal, must not exceed six calendar months in any 12-month period. Seasonal appointments must not exceed nine calendar months in any 12-month period;\n(5) voluntary demotion; reassignment; transfers from within county service or other employers; and reinstatement of persons who without fault or delinquency on their part are separated from the service or demoted;\n(6) a compensation plan for classes and positions not represented by an exclusive bargaining representative to be presented to the county board for approval;\n(7) a classification plan for positions in the county service to be presented to the county board for approval;\n(8) leaves of absence with or without pay; layoffs; hours of employment; vacations and sick leave; severance pay, and other benefits and emoluments as may improve the public service;\n(9) suspensions without pay for disciplinary purposes, discharges, or demotion of a permanent employee only when the person has been presented with written charges and has been allowed a hearing;\n(10) establishment of reasonable fees, not to exceed the actual cost of service or material provided;\n(11) establishment of rules of conduct that are conditions of employment in the county service;\n(12) policies to deal with falsification of an application or record to improve prospects for employment or with interference with the selection process; and\n(13) a panel of three department directors, randomly selected from outside the employee's department, to hear and decide nondisciplinary appeals within the jurisdiction of the rules, if there has been a preliminary showing to the county attorney that a rule violation has occurred, except appeals relating to layoffs shall be heard by the board.\nThe board, with the assistance of the human resources director, shall utilize and prescribe the duties of hearing officers, or contract with the Office of Administrative Hearings pursuant to section 14.55. When it is determined that a disciplinary or veteran's hearing be held which requires a hearing officer, the director will first ascertain the availability and timeliness of scheduling the hearing through the office of administrative hearings pursuant to section 14.55. If it is determined that a prompt hearing is not readily available through the office of administrative hearings, the board, with the assistance of the human resources director, may then utilize an impartial hearing officer. Decisions of the hearing officers are final and binding on the parties and the Human Resources Board, except as provided in section 197.46.",
	"repealed": false
}