{
	"id": "147D.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.21",
	"title": "147D.21 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "Three years after the date of initial licensure and every three years thereafter, a licensed traditional midwife must complete a minimum of 30 contact hours of board-approved continuing education and attest to completion of continuing education requirements by reporting to the board. At least five contact hours within a three-year reporting period must involve adult cardiopulmonary resuscitation and either infant cardiopulmonary resuscitation or neonatal advanced life support.\nThe board shall approve continuing education programs that meet the following criteria:\n(1) the program content directly relates to the practice of traditional midwifery;\n(2) each member of the program faculty is knowledgeable in the subject matter as demonstrated by a degree from an accredited education program, verifiable experience in the field of traditional midwifery, special training in the subject matter, or experience teaching in the subject area;\n(3) the program lasts at least one contact hour;\n(4) there are specific, measurable, written objectives, consistent with the program, describing the expected outcomes for the participants; and\n(5) the program sponsor has a mechanism to verify participation and maintains attendance records for three years.\nContinuing education program topics may include, but are not limited to, traditional midwifery care in the prenatal, labor, birth, and postpartum and newborn periods; assessing contraindications; care in emergency situations; ethics; and nutrition.\nA licensed traditional midwife may not apply contact hours acquired in one three-year reporting period to a future continuing education reporting period.\nThe board shall periodically select a random sample of licensed traditional midwives and require those licensed traditional midwives to supply the board with evidence of having completed the continuing education to which they attested. Documentation may come directly from the licensed traditional midwife or from state or national organizations that maintain continuing education records.",
	"repealed": false
}