{
	"id": "469.064",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.064",
	"title": "469.064 PORT AUTHORITY ACTIVITIES.",
	"text": "A port authority may cooperate with or act as agent for the federal or the state government, or a state public body, or an agency or instrumentality of a government or a public body to carry out sections 469.048 to 469.068 or any other related federal, state, or local law in the area of river, harbor, and industrial development district improvement.\nA port authority may study and analyze industrial development needs in its port district, and ways to meet the needs. A port authority may study the desirable patterns for industrial land use and community growth and other factors affecting local industrial development in the district and make the result of the studies available to the public and to industry in general. A port authority may engage in research and disseminate information on river, harbor, and industrial development in the port district.\nA port authority may accept conveyances of land from all other public agencies, commissions, or other units of government, including the housing and redevelopment authority of the city of Saint Paul and the state Metropolitan Airports Commission, if the land can be properly used by the port authority in a river, harbor, and industrial development district, to carry out the purposes of sections 469.048 to 469.068.\nA port authority may carry out the law on industrial development districts to develop and improve the lands in an industrial development district to make it suitable and available for industrial uses and purposes. A port authority may dredge, bulkhead, fill, grade, and protect the property and do anything necessary and expedient, after acquiring the property, to make it suitable and attractive as a tract for industrial development. A port authority may lease some or all of its lands or property and may set up local improvement districts in all or part of an industrial development district.\nIn general, with respect to an industrial development district, a port authority may use all the powers given a port authority by law.\nA port authority after authorizing bonds under section 469.060 or 469.061 may borrow to provide money immediately required for the bond purpose. The loans may not exceed the amount of the bonds. The authority shall by resolution decide the terms of the loans. The loans must be evidenced by negotiable notes due in not more than 12 months from the date of the loan payable to the order of the lender or to bearer, to be repaid with interest from the proceeds of the bonds when the bonds are issued and delivered to the bond purchasers. The loan must not be obtained from any commissioner of the port authority or from any corporation, association, or other institution of which a port authority commissioner is a stockholder or officer.\nThe proceeds of obligations issued by a port authority under section 469.061 and temporary loans obtained under subdivision 5 may be used to make or purchase loans for port, industrial, or economic facilities that the authority believes will require financing. To make or purchase the loans, the port authority may enter into loan and related agreements, both before and after issuing the obligations, with persons, firms, public or private corporations, federal or state agencies, and governmental units under terms and conditions the port authority considers appropriate. A governmental unit in the state may apply, contract for, and receive the loans. Chapter 475 does not apply to the loans.",
	"repealed": false
}