{
	"id": "119A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/119A.03",
	"title": "119A.03 COMMISSIONER.",
	"text": "The department is under the administrative control of the commissioner. The commissioner is appointed by the governor with the advice and consent of the senate. The commissioner must possess broad knowledge and experience in strengthening children and families. The commissioner has the general powers as provided in section 15.06, subdivision 6.\nThe commissioner's salary must be established according to the procedure in section 15A.0815, in the same range as that specified for the commissioner of management and budget.\nThe commissioner shall:\n(1) identify measurable outcomes by which programs administered by the department will be evaluated at the state and local level;\n(2) develop linkages with other state departments to ensure coordination and consistent state policies promoting healthy development of children and families;\n(3) prepare, in consultation with the Children's Cabinet and affected parties, prior to July 1 of each year, guidelines governing planning, reporting, and other procedural requirements necessary to administer this chapter;\n(4) facilitate inclusive processes when designing or implementing guidelines and strategies to achieve agency goals for children and families;\n(5) facilitate intergovernmental and public-private partnership strategies necessary to implement this chapter;\n(6) submit to the federal government, or provide assistance to local governments and organizations in submitting, where appropriate and feasible, requests for federal waivers or recommendations for changes in federal law necessary to carry out the purposes of this chapter;\n(7) coordinate review of all plans and other documents required under the guidelines provided for in clause (3);\n(8) coordinate development of the management support system components required for implementation of this chapter;\n(9) review other programs serving children and families to determine the feasibility for transfer to the Department of Education or the feasibility of inclusion in the funding consolidation process; and\n(10) monitor local compliance with this chapter.",
	"repealed": false
}