{
	"id": "115B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.17",
	"title": "115B.17 STATE RESPONSE TO RELEASES.",
	"text": "Whenever there is a release or substantial threat of release from a facility of any pollutant or contaminant which presents an imminent and substantial danger to the public health or welfare or the environment or whenever a hazardous substance is released or there is a threatened release of a hazardous substance from a facility:\n(a) The agency may take any removal or remedial action relating to the hazardous substance, or pollutant or contaminant, which the agency deems necessary to protect the public health or welfare or the environment. Before taking any action the agency shall:\n(1) Request any responsible party known to the agency to take actions which the agency deems reasonable and necessary to protect the public health or welfare or the environment, stating the reasons for the actions, a reasonable time for beginning and completing the actions taking into account the urgency of the actions for protecting the public health or welfare or the environment, and the intention of the agency to take action if the requested actions are not taken as requested;\n(2) Notify the owner of real property where the facility is located or where response actions are proposed to be taken, if the owner is not a responsible party, that responsible parties have been requested to take response actions and that the owner's cooperation will be required in order for responsible parties or the agency to take those actions; and\n(3) Determine that the actions requested by the agency will not be taken by any known responsible party in the manner and within the time requested.\n(b) The commissioner may take removal action which the commissioner deems necessary to protect the public health or welfare or the environment if the commissioner determines that the release or threatened release constitutes an emergency requiring immediate action to prevent, minimize or mitigate damage to the public health or welfare or the environment. Before taking any action the commissioner shall make reasonable efforts in light of the urgency of the action to follow the procedure provided in clause (a).\nNo removal action taken by any person shall be construed as an admission of liability for a release or threatened release.\nWhenever the agency or commissioner is authorized to act pursuant to subdivision 1 or whenever the agency or commissioner has reason to believe that a release of a hazardous substance, or a pollutant or contaminant, has occurred or is about to occur, or that illness, disease, or complaints thereof may be attributable to exposure to a hazardous substance, or a pollutant or contaminant, the agency or commissioner may undertake investigations, monitoring, surveys, testing, and other similar activities necessary or appropriate to identify the existence and extent of the release or threat thereof, the source and nature of the hazardous substances, or pollutants or contaminants, and the extent of danger to the public health or welfare or the environment. In addition, the agency may undertake planning, legal, fiscal, economic, engineering, architectural, and other studies or investigations necessary or appropriate to plan and direct a response action, to recover the costs of the response action, and to enforce the provisions of sections 115B.01 to 115B.18.\nIn determining the appropriate standards to be achieved by response actions taken or requested under this section to protect public health and welfare and the environment from a release or threatened release, the commissioner shall consider the planned use of the property where the release or threatened release is located.\nBefore selecting a remedial action to respond to a release or threatened release listed pursuant to subdivision 13, the commissioner shall give written notice of the proposed remedial action to the public by publication of a notice in a newspaper of general circulation in the affected area, and provide an opportunity for submission of comments on the proposed remedial action. The notice shall also be given by certified mail to all persons known to the commissioner at the time of the notice who the commissioner has reason to believe are responsible for the release or threatened release, including all persons who have previously received a request for response action under subdivision 1 with respect to the release or threatened release.\nAny person who the agency has reason to believe is responsible for a release or threatened release as provided in section 115B.03, or who is the owner of real property where the release or threatened release is located or where response actions are proposed to be taken, when requested by the agency, or any member, employee or agent thereof who is authorized by the agency, shall furnish to the agency any information which that person may have or may reasonably obtain which is relevant to the release or threatened release.\nThe agency or any member, employee or agent thereof authorized by the agency, upon presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda or data of any person who has a duty to provide information to the agency under subdivision 3; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized by this section including obtaining information from any person who has a duty to provide the information under subdivision 3, conducting surveys or investigations, and taking removal or remedial action.\nExcept as otherwise provided in this subdivision, data obtained from any person pursuant to subdivision 3 or 4 is public data as defined in section 13.02. Upon certification by the subject of the data that the data relates to sales figures, processes or methods of production unique to that person, or information which would tend to affect adversely the competitive position of that person, the commissioner shall classify the data as private or nonpublic data as defined in section 13.02. Notwithstanding any other law to the contrary, data classified as private or nonpublic under this subdivision may be disclosed when relevant in any proceeding under sections 115B.01 to 115B.18, or to other public agencies concerned with the implementation of sections 115B.01 to 115B.18.\nAny reasonable and necessary expenses incurred by the agency or commissioner pursuant to this section, including all response costs, and administrative and legal expenses, may be recovered in a civil action brought by the attorney general against any person who may be liable under section 115B.04 or any other law. The agency's certification of expenses shall be prima facie evidence that the expenses are reasonable and necessary. Any expenses incurred pursuant to this section which are recovered by the attorney general pursuant to section 115B.04 or any other law, including any award of attorneys fees, shall be deposited in the remediation fund.\nFor the purpose of this subdivision, the state is the trustee of the air, water and wildlife of the state. An action pursuant to section 115B.04 for damages with respect to air, water or wildlife may be brought by the attorney general in the name of the state as trustee for those natural resources. Any damages recovered by the attorney general pursuant to section 115B.04 or any other law for injury to, destruction of, or loss of natural resources resulting from the release of a hazardous substance, or a pollutant or contaminant, shall be deposited in the remediation fund.\n[Repealed, 1990 c 597 s 73]\nThe agency, commissioner, and the commissioner of labor and industry shall make reasonable efforts to coordinate any actions taken under this section and under sections 182.65 to 182.674 to avoid duplication or conflict of actions or requirements with respect to a release or threatened release affecting the safety of any conditions or place of employment.\nThe agency and commissioner shall make reasonable efforts to coordinate and consult with the commissioner of health in planning and directing response actions with respect to a release or threatened release affecting the public health. If the commissioner of health, upon the request of the agency, takes any actions authorized under this section, the agency shall reimburse the commissioner of health from the fund for the reasonable and necessary expenses incurred in taking those actions and may recover any amount spent from the fund under subdivision 6.\nWhen the agency or commissioner has requested a person who is responsible for a release or threatened release to take any response action under subdivision 1, no political subdivision shall request or order that person to take any action which conflicts with the action requested by the agency or commissioner of the Pollution Control Agency.\nFor the purpose of permitting a political subdivision or private person to recover response costs as provided in section 115B.04, subdivision 6, the agency may authorize the political subdivision to take removal or remedial actions or may authorize the private person to take removal actions with respect to any release of a hazardous substance which was placed or came to be located in the facility before April 1, 1982. The authorization shall be based on application of the criteria in the rules of the agency adopted under subdivision 13 or, if the rules have not been adopted, under the criteria set forth in subdivision 13 on which the rules are required to be based. The authorization shall not be inconsistent with the criteria. This subdivision shall not be construed to prohibit a political subdivision or private person from taking removal or remedial actions without the authorization of the agency.\n(a) By November 1, 1983, the Pollution Control Agency shall establish a temporary list of priorities among releases or threatened releases for the purpose of taking remedial action and, to the extent practicable consistent with the urgency of the action, for taking removal action under this section. The temporary list, with any necessary modifications, shall remain in effect until the Pollution Control Agency adopts rules establishing state criteria for determining priorities among releases and threatened releases. The Pollution Control Agency shall adopt the rules by July 1, 1984. After rules are adopted, a permanent priority list shall be established, and may be modified from time to time, using the current guidance and tools for the Hazard Ranking System adopted by the federal Environmental Protection Agency and according to the criteria set forth in the rules. Before any list is established under this subdivision the Pollution Control Agency shall publish the list in the State Register and allow 30 days for comments on the list by the public.\n(b) The temporary list and the rules required by this subdivision shall be based upon the relative risk or danger to public health or welfare or the environment, taking into account to the extent possible the population at risk, the hazardous potential of the hazardous substances at the facilities, the potential for contamination of drinking water supplies, the potential for direct human contact, the potential for destruction of sensitive ecosystems, the administrative and financial capabilities of the Pollution Control Agency, and other appropriate factors.\n(a) The commissioner may, upon request, assist a person in determining whether real property has been the site of a release or threatened release of a hazardous substance, pollutant, or contaminant. The commissioner may also assist in, or supervise, the development and implementation of reasonable and necessary response actions. Assistance may include review of agency records and files, and review and approval of a requester's investigation plans and reports and response action plans and implementation.\n(b) Except as otherwise provided in this paragraph, the person requesting assistance under this subdivision shall pay the agency for the agency's cost, as determined by the commissioner, of providing assistance. A state agency, political subdivision, or other public entity is not required to pay for the agency's cost to review agency records and files. The first $350,000 received annually by the agency for assistance under this subdivision from persons who are not otherwise responsible under sections 115B.01 to 115B.18 must be deposited in the remediation fund and is exempt from section 16A.1285. Money received after the first $350,000 must be deposited in the state treasury and credited to an account in the special revenue fund. Money in the account is annually appropriated to the commissioner for the purposes of administering this subdivision.\n(c) When a person investigates a release or threatened release in accordance with an investigation plan approved by the commissioner under this subdivision, the investigation does not associate that person with the release or threatened release for the purpose of section 115B.03, subdivision 3, paragraph (a), clause (4).\nThe agency may acquire, by purchase or donation, interests in real property, including easements, environmental covenants under chapter 114E, and leases, that the agency determines are necessary for response action. The agency may acquire an easement by condemnation only if the agency is unable, after reasonable efforts, to acquire an interest in real property by purchase or donation. The provisions of chapter 117 govern condemnation proceedings by the agency under this subdivision. A donation of an interest in real property to the agency is not effective until the agency executes a certificate of acceptance. The state is not liable under this chapter solely as a result of acquiring an interest in real property under this subdivision. Agency approval of an environmental covenant under chapter 114E is sufficient evidence of acceptance of an interest in real property where the agency is expressly identified as a holder in the covenant.\n(a) If the commissioner determines that real or personal property acquired by the agency for response action is no longer needed for response action purposes, the commissioner may:\n(1) transfer the property to the commissioner of administration to be disposed of in the manner required for other surplus property subject to conditions the commissioner determines necessary to protect the public health and welfare or the environment, or to comply with federal law;\n(2) transfer the property to another state agency, a political subdivision, or special purpose district as provided in paragraph (b); or\n(3) if required by federal law, take actions and dispose of the property as required by federal law.\n(b) If the commissioner determines that real or personal property acquired by the agency for response action must be operated, maintained, or monitored after completion of other phases of the response action, the commissioner may transfer ownership of the property to another state agency, a political subdivision, or special purpose district that agrees to accept the property. A state agency, political subdivision, or special purpose district is authorized to accept and implement the terms and conditions of a transfer under this paragraph. The commissioner may set terms and conditions for the transfer that the commissioner considers reasonable and necessary to ensure proper operation, maintenance, and monitoring of response actions, protect the public health and welfare and the environment, and comply with applicable federal and state laws and regulations. The state agency, political subdivision, or special purpose district to which the property is transferred is not liable under this chapter solely as a result of acquiring the property or acting in accordance with the terms and conditions of the transfer.\n(c) If the agency acquires property under subdivision 15, the commissioner may lease or grant an easement in the property to a person during the implementation of response actions if the lease or easement is compatible with or necessary for response action implementation.\n(d) The proceeds of a sale, lease, or other transfer of property under this subdivision by the commissioner or by the commissioner of administration shall be deposited in the remediation fund. Any share of the proceeds that the agency is required by federal law or regulation to reimburse to the federal government is appropriated from the account to the agency for that purpose. Except for section 94.16, subdivision 2, the provisions of section 94.16 do not apply to real property sold by the commissioner of administration which was acquired under subdivision 15.\nIn addition to the general authority vested in the agency to settle any claims under sections 115B.01 to 115B.18, the agency may exercise the settlement authorities provided in subdivisions 17 to 20. If the agency does not obtain complete relief for all of its claims under sections 115B.01 to 115B.18, pursuant to a settlement, the agency may bring claims under those sections against any person who is not a party to the settlement, but the settlement shall reduce the liability of any person who is not a party to the settlement by the amount of the settlement.\nNotwithstanding anything to the contrary in section 115B.08 or any other law, a person who resolves its liability to the agency under sections 115B.01 to 115B.18 in a settlement shall not be liable for any claim for contribution regarding matters addressed in the settlement. Except as otherwise provided in the settlement, a party to a settlement retains any right under section 115B.08 or any other law to bring a claim for contribution against any person who is not a party to the settlement. Any claim for contribution against a person who is not a party to the settlement shall be subordinate to any claim asserted against such person by the agency.\n(a) When the agency determines that some but not all persons responsible for a release are willing to implement response actions, the agency may agree, pursuant to a settlement of its claims under sections 115B.01 to 115B.18, to reimburse the settling parties for response costs incurred to take the actions. The agency may agree to reimburse any amount which does not exceed the amount that the agency estimates may be attributable to the liability of responsible persons who are not parties to the settlement. Reimbursement may be provided only for the cost of conducting remedial design and constructing remedial action pursuant to the terms of the settlement. Reimbursement under this subdivision shall be paid only upon the agency's determination that the remedial action approved by the agency has been completed in accordance with the terms of the settlement. The agency may use money appropriated to it for actions authorized under section 115B.20, subdivision 2, clause (2), to pay reimbursement under this subdivision.\n(b) The agency may agree to provide reimbursement under a settlement only when all of the following requirements have been met:\n(1) the agency has made the determination under paragraph (c) regarding persons who are not participating in the settlement, and has provided written notice to persons identified under paragraph (c), clauses (1) and (2), of their opportunity to participate in the settlement or in a separate settlement under subdivision 20;\n(2) the release addressed in the settlement has been assigned a priority pursuant to agency rules adopted under subdivision 13, and the priority is at least as high as a release for which the agency would be allowed to allocate funds for remedial action under the rules;\n(3) an investigation of the release addressed in the settlement has been completed in accordance with a plan approved by the agency; and\n(4) the agency has approved the remedial action to be implemented under the settlement.\n(c) Before entering into a settlement providing for reimbursement under this subdivision, the agency shall determine that there are one or more persons who meet any of the following criteria who are not participating in the settlement:\n(1) persons identified by the agency as responsible for the release addressed in the settlement but who are likely to have only minimal involvement in actions leading to the release, or are insolvent or financially unable to pay any significant share of response action costs;\n(2) persons identified by the agency as responsible for the release other than persons described in clause (1) and who are unwilling to participate in the settlement or to take response actions with respect to the release;\n(3) persons whom the agency has reason to believe are responsible for the release addressed in the settlement but whom the agency has been unable to identify; or\n(4) persons identified to the agency by a party to the proposed settlement as persons who are potentially responsible for the release but for whom the agency has insufficient information to determine responsibility.\n(d) Except as otherwise provided in this subdivision, a decision of the agency under this subdivision to offer or agree to provide reimbursement in any settlement, or to determine the amount of reimbursement it will provide under a settlement, is a matter of agency discretion in the exercise of its enforcement authority. In exercising discretion in this matter, the agency may consider, among other factors, the degree of cooperation with the agency that has been shown prior to the settlement by the parties seeking reimbursement.\n(e) The agency may require as a term of settlement under this subdivision that the parties receiving reimbursement from the agency waive any rights they may have to bring a claim for contribution against persons who are not parties to the settlement.\n(f) Notwithstanding any provision to the contrary in paragraphs (a) to (e), until June 30, 2001, the agency may use the authority under this subdivision to enter into agreements for the implementation of a portion of an approved response action plan and to provide funds in the form of a grant for the purpose of implementing the agreement. The amount paid for implementing a portion of an approved response action plan may not exceed the proportion of the costs of the response action plan which are attributable to the liability of responsible persons who are not parties to the agreement.\n(g) A decision of the agency under paragraph (f) to offer or agree to provide funds in any agreement or to determine the specific remedial actions included in any agreement to implement an approved action plan or the amount of funds the agency will provide under an agreement is a matter of agency discretion in the exercise of its enforcement authority.\n(a) The agency may agree to separately settle its claims under sections 115B.01 to 115B.18 with any persons:\n(1) whose liability for response costs or response actions, in the determination of the agency, is minimal in comparison with the liability of other persons responsible for the release; or\n(2) who are responsible for a release but, in the determination of the agency, are insolvent or financially unable to pay any significant share of their liability for the response costs.\n(b) A settlement under this subdivision may require the parties to pay a fixed amount in money or in kind toward the implementation of response actions, and may include a premium for the risk of additional future response costs or response action requirements. The agency may require as a term of a settlement under this subdivision that the settling responsible persons waive any rights they may have to bring a claim for contribution against persons who are not parties to the settlement.\n(c) All amounts paid to the agency under a settlement entered into pursuant to this subdivision shall be deposited in the account and are appropriated to the agency to pay for response actions and associated administrative and legal costs related to the release addressed in the settlement, including reimbursement for response costs under subdivision 19.",
	"repealed": false
}