{
	"id": "62L.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.23",
	"title": "62L.23 SUSPENSION OF REINSURANCE OPERATIONS; REACTIVATION.",
	"text": "The commissioner may, by order, suspend the operation of sections 62L.13 to 62L.22, upon receipt of a recommendation for suspension from the association board of directors. The order is effective 30 days after publication in the State Register.\nUpon the issuance of an order issued pursuant to subdivision 1, the association shall suspend its operations in an orderly manner supervised by the commissioner and shall provide for the proper storage of the association's records. Notwithstanding the provisions of subdivision 1, the association may continue to levy assessments under section 62L.22 for the purpose of satisfying the association's presuspension expenses and the expenses associated with the association's suspension activities pursuant to this subdivision. The assessments must be approved by the commissioner.\nEffective upon the effective date of an order issued pursuant to subdivision 1, reinsurance must be terminated for any person reinsured by the association pursuant to section 62L.18. No health carrier may cancel or fail to renew a health benefit plan for any person whose reinsurance with the association has been terminated subsequently to the issuance of an order pursuant to subdivision 1 solely because of the termination of reinsurance.\nThe commissioner may, by order, reactivate the operation of sections 62L.13 to 62L.22, on a finding that the private market for reinsurance of health benefit plans has failed and that commercial reinsurance is unavailable to health carriers operating in the small employer market in Minnesota. The commissioner may not make findings or issue an order pursuant to this subdivision until a hearing is held pursuant to chapter 14.\nAfter issuance of any order pursuant to subdivision 4, the commissioner shall immediately appoint an interim board of directors of the association. The terms of members of this interim board must be for a period not to exceed 18 months. The board shall cause the reinsurance operations of the association to be resumed within 180 days of an order issued pursuant to subdivision 4.\nIf the commissioner issues an order pursuant to subdivision 4, any health carrier may elect to participate in the reinsurance association, notwithstanding any departicipation by the health carrier within the preceding five years that, pursuant to section 62L.17, would have otherwise prohibited the health carrier's participation.",
	"repealed": false
}