{
	"id": "276A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/276A.01",
	"title": "276A.01 DEFINITIONS.",
	"text": "In sections 276A.01 to 276A.09, the terms defined in this section have the meanings given them unless the context indicates otherwise.\n\"Area\" means the territory included within all taconite assistance areas defined in section 273.1341.\n\"Commercial-industrial property\" means the following categories of property, as defined in section 273.13, excluding that portion of the property (i) that may, by law, constitute the tax base for a tax increment pledged pursuant to sections 469.174 to 469.178, certification of which was requested prior to May 1, 1996, to the extent and while the tax increment is so pledged; or (ii) that is exempt from taxation under section 272.02:\n(1) that portion of class 5 property consisting of unmined iron ore and low-grade iron-bearing formations as defined in section 273.14, tools, implements, and machinery, except the portion of high voltage transmission lines, the value of which is deducted from net tax capacity under section 273.425; and\n(2) that portion of class 3 and class 5 property which is either used or zoned for use for any commercial or industrial purpose, including property that becomes taxable under section 298.25, except for such property which is, or, in the case of property under construction, will when completed be used exclusively for residential occupancy and the provision of services to residential occupants thereof. Property must be considered as used exclusively for residential occupancy only if each of not less than 80 percent of its occupied residential units is, or, in the case of property under construction, will when completed be occupied under an oral or written agreement for occupancy over a continuous period of not less than 30 days.\nIf the classification of property prescribed by section 273.13 is modified by legislative amendment, the references in this subdivision are to the successor class or classes of property, or portions thereof, that include the kinds of property designated in this subdivision.\n\"Residential property\" means the following categories of property, as defined in section 273.13, excluding that portion of the property that is exempt from taxation pursuant to section 272.02:\n(1) class 1a, 1b, and 2a property, limited to the homestead dwelling, a garage, and the one acre of land on which the dwelling is located;\n(2) that portion of class 3 property used exclusively for residential occupancy; and\n(3) property valued and assessed under section 273.13, subdivision 25, except for hospitals and property valued and assessed under section 273.13, subdivision 25, paragraph (d), clauses (1) and (3).\n\"Governmental unit\" means a county, city, town, school district, or other taxing unit or body which levies ad valorem taxes in whole or in part within the area.\n\"Administrative auditor\" means the person selected under section 276A.02.\n\"Population\" means the most recent estimate of the population of a municipality made by the state demographer and filed with the commissioner of revenue as of July 15 of the year in which a municipality's distribution net tax capacity is calculated. The state demographer shall annually estimate the population of each municipality and, in the case of a municipality which is located partly within and partly without the area, the proportion of the total which resides within the area, and shall file the estimates with the commissioner of revenue.\n\"Municipality\" means a city, town, or township located in whole or part within the area. If a municipality is located partly within and partly without the area, the references in sections 276A.01 to 276A.09 to property or any portion thereof subject to taxation or taxing jurisdiction within the municipality are to the property or portion thereof that is located in that portion of the municipality within the area, except that the fiscal capacity of the municipality must be computed upon the basis of the valuation and population of the entire municipality. A municipality shall be excluded from the area if its municipal comprehensive zoning and planning policies conscientiously exclude most commercial-industrial development, for reasons other than preserving an agricultural use. The commissioner of Iron Range resources and rehabilitation and the commissioner of revenue shall jointly make this determination annually and shall notify those municipalities that are ineligible to participate in the tax base sharing program provided in this chapter for the following year. Before making the determination, the commissioner of Iron Range resources and rehabilitation must consult the Iron Range Resources and Rehabilitation Board.\n\"County\" means each county in which a governmental unit is located in whole or in part.\n\"Adjusted market value\" of real and personal property within a municipality means the taxable market value, as defined in section 272.03, of all real and personal property, including the value of manufactured housing, within the municipality, adjusted for sales ratios in a manner similar to the adjustments made to city and town net tax capacities under section 273.1325, subdivisions 1 to 6.\nMS 2012 [Repealed, 2013 c 143 art 14 s 111]\n\"Fiscal capacity\" of a municipality means its adjusted market value, determined as of January 2 of any year, divided by its population, determined as of a date in the same year.\n\"Average fiscal capacity\" of municipalities means the sum of the adjusted market values of all municipalities, determined as of January 2 of any year, divided by the sum of their populations, determined as of a date in the same year.\n\"Levy\" means the amount certified to the county auditor pursuant to chapter 275, less all reductions made by the auditor pursuant to any provision of law in determining the amount to be spread against taxable property.\n\"Net tax capacity\" means the taxable market value of real and personal property multiplied by its net tax capacity rates in section 273.13.\n\"Local tax rate\" means a governmental unit's levy, including any portion levied against market value under section 126C.17, subdivision 10, divided by its net tax capacity.\n(a) \"School fund allocation\" means an amount up to 25 percent of the areawide levy certified by the commissioner of Iron Range resources and rehabilitation, after consultation with the Iron Range Resources and Rehabilitation Board, to be used for the purposes of the Iron Range schools and community development account under section 298.28, subdivision 7a.\n(b) The allocation under paragraph (a) shall only be made after the commissioner of Iron Range resources and rehabilitation, after consultation with the Iron Range Resources and Rehabilitation Board, has certified by June 30 that the Iron Range schools and community development account has insufficient funds to make payments as authorized under section 298.28, subdivision 7a.",
	"repealed": false
}