{
	"id": "80D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/80D.06",
	"title": "80D.06 RESERVE FUND ESCROW.",
	"text": "At the time a facility is first occupied by any resident and thereafter, the provider shall establish and maintain on a current basis, in escrow with a bank or trust company having its principal place of business in this state, as an escrow agent, a portion of all entrance fees received by the provider in an aggregate amount of up to the total of all principal and interest payments due during the next 12 months on account of any first mortgage loan or other long-term financing of the facility. The funds in the escrow account may be invested with the earnings thereon payable to the provider. If the provider requests and sets forth its reasons in writing, the escrow agent shall release up to 1/12 of the original principal balance of the escrow account. A release of funds shall not be made more than once during any calendar month, and then only after the escrow agent has given written notice of the release and the reasons therefor to any resident or association of residents, or the legal representative of a resident or association of residents, that has requested it at least ten days prior to the release.\nAny person or affiliate of any person that controls any part of the reserve escrow fund comprised in part or totally of funds removed from the provider's resources, is liable for the debts of the provider up to the amount of the provider's contribution to the fund plus any prorated interest the fund may earn.\nIn those instances where a provider has been offering continuing care in a facility since prior to January 1, 1975, the following shall apply. The provider shall establish a reserve escrow fund and shall contribute to it 15 percent of each new entrance fee received by the provider after December 31, 1981. The funds thereby received shall be permitted to accumulate until there is in the reserve fund an amount equal to the total of all principal and interest payments due during the next 12 months on account of any first mortgage loan or other long-term financing obligation of the facility.",
	"repealed": false
}