{
	"id": "308C.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.225",
	"title": "308C.225 AMENDMENT OF ORGANIZATIONAL DOCUMENTS TO BE GOVERNED BY THIS CHAPTER.",
	"text": "(a) A housing cooperative organized under chapter 308A or 308B may convert and become exclusively subject to this chapter by amending the housing cooperative's organizational documents to conform to the requirements of this chapter and filing a certificate of conversion that complies with this chapter.\n(b) A housing cooperative organized under chapter 308A or 308B that intends to convert to a cooperative subject to this chapter must provide its members with a disclosure statement of the rights and obligations of the members and the capital structure of the cooperative before becoming subject to this chapter. A cooperative organized under chapter 308A or 308B upon distribution of the disclosure required in this subdivision must obtain the approval of its members as necessary for amending its articles under chapter 308A or 308B.\n(a) A housing cooperative organized under chapter 308A or 308B that is converting to be subject to this chapter must file with the secretary of state and the applicable county recorder:\n(1) a certificate of conversion stating:\n(i) the date on which the entity was first organized;\n(ii) the name of the chapter 308A or 308B cooperative and, if the name is changed, the name of the housing cooperative to be governed under this chapter; and\n(iii) the future effective date and time, which must be a date and time certain, that it will be governed by this chapter, if the effective date and time is not to be the date and time of filing; and\n(2) a certificate of amendment amending the housing cooperative's articles to conform with the requirements of this chapter.\n(b) The conversion is effective upon the filing with the secretary of state and upon the recording of the written certificate in the county recorder's office.\nThe conversion of a housing cooperative organized under chapter 308A or 308B to a cooperative governed by this chapter does not affect any obligations or liabilities of the cooperative before the conversion or the personal liability of any person incurred before the conversion. When the conversion is effective, the rights, privileges, and powers of the cooperative; real and personal property of the cooperative; debts due to the cooperative; and causes of action belonging to the cooperative remain vested in the cooperative and are the property of the cooperative as converted and governed by this chapter. Title to real property vested by deed or otherwise in the housing cooperative organized under chapters 308A and 308B does not revert and is not impaired by reason of the cooperative being converted and governed by this chapter. Rights of creditors and liens upon property of the housing cooperative under chapters 308A and 308B are preserved unimpaired, and debts, liabilities, and duties of the housing cooperative under chapters 308A and 308B remain attached to the housing cooperative as converted and governed by this chapter and may be enforced against the housing cooperative to the same extent as if the debts, liabilities, and duties had originally been incurred or contracted by the cooperative as organized under this chapter. The rights, privileges, powers, and interests in property of the cooperative under chapters 308A and 308B, as well as the debts, liabilities, and duties of the cooperative are not deemed, as a consequence of the conversion, to have been transferred for any purpose of the laws of this state.",
	"repealed": false
}