{
	"id": "65B.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.54",
	"title": "65B.54 CLAIMS PRACTICES.",
	"text": "Basic economic loss benefits are payable monthly as loss accrues. Loss accrues not when injury occurs, but as income loss, replacement services loss, survivor's economic loss, survivor's replacement services loss, or medical or funeral expense is incurred. Benefits are overdue if not paid within 30 days after the reparation obligor receives reasonable proof of the fact and amount of loss realized, unless the reparation obligor elects to accumulate claims for periods not exceeding 31 days and pays them within 15 days after the period of accumulation. If reasonable proof is supplied as to only part of a claim, and the part totals $100 or more, the part is overdue if not paid within the time provided by this section. Medical or funeral expense benefits may be paid by the reparation obligor directly to persons supplying products, services, or accommodations to the claimant. Claims by a health provider defined in section 62J.03, subdivision 8, for medical expense benefits covered by this chapter shall be submitted to the reparation obligor pursuant to the uniform electronic transaction standards required by section 62J.536 and the rules promulgated under that section. Payment of benefits for such claims for medical expense benefits are not due if the claim is not received by the reparation obligor pursuant to those electronic transaction standards and rules. Notwithstanding any such submission, a reparation obligor may require additional reasonable proof regarding the fact and the amount of loss realized regarding such a claim. A health care provider cannot directly bill an insured for the amount of any such claim not remitted pursuant to the transaction standards required by section 62J.536 if the reparation obligor is acting in compliance with these standards in receiving or paying such a claim.\nOverdue payments shall bear simple interest at the rate of 15 percent per annum.\nA claim for basic economic loss benefits shall be paid without deduction for the benefits which are to be subtracted pursuant to section 65B.61, if these benefits have not been paid to the claimant before the reparation benefits are overdue or the claim is paid. The obligor is entitled to reimbursement from the person obligated to make the payments or from the claimant who actually receives the payments.\nA reparation obligor may bring an action to recover benefits which are not payable, but are in fact paid, because of an intentional misrepresentation of a material fact, upon which the reparation obligor relies, by the claimant or by a person providing products or services for which basic economic loss benefits are payable. The action may be brought only against the person providing the products or services, unless the claimant has intentionally misrepresented the facts or knew of the misrepresentation. A reparation obligor may offset amounts the reparation obligor is entitled to recover from the claimant under this subdivision against any basic economic loss benefits otherwise due the claimant.\nA reparation obligor who rejects a claim for benefits shall give to the claimant prompt written notice of the rejection, specifying the reason. If a claim is rejected for a reason other than that the person is not entitled to the basic economic loss benefits claimed, the written notice shall inform the claimant that the claimant may file the claim with the assigned claims bureau and shall give the name and address of the bureau.\n(a) A licensed health care provider shall not initiate direct contact, in person, over the telephone, or by other electronic means, with any person who has suffered an injury arising out of the maintenance or use of an automobile, for the purpose of influencing that person to receive treatment or to purchase any good or item from the licensee or anyone associated with the licensee. This subdivision prohibits such direct contact whether initiated by the licensee individually or on behalf of the licensee by any employee, independent contractor, agent, or third party, including a capper, runner, or steerer, as defined in section 609.612, subdivision 1, paragraph (c). This subdivision does not apply when an injured person voluntarily initiates contact with a licensee.\n(b) This subdivision does not prohibit licensees, or persons acting on their behalf, from mailing advertising literature directly to such persons, so long as:\n(1) the word \"ADVERTISEMENT\" appears clearly and conspicuously at the beginning of the written materials;\n(2) the name of the individual licensee appears clearly and conspicuously within the written materials;\n(3) the licensee is clearly identified as a licensed health care provider within the written materials; and\n(4) the licensee does not initiate, individually or through any employee, independent contractor, agent, or third party, direct contact with the person after the written materials are sent.\n(c) This subdivision does not apply to:\n(1) advertising that does not involve direct contact with specific prospective patients, in public media such as telephone directories, professional directories, ads in newspapers and other periodicals, radio or television ads, websites, billboards, mailed or electronically transmitted communication, or similar media if such advertisements comply with paragraph (d);\n(2) general marketing practices, other than those described in clause (1), such as giving lectures; participating in special events, trade shows, or meetings of organizations; or making presentations relative to the benefits of a specific medical treatment;\n(3) contact with friends or relatives, or statements made in a social setting;\n(4) direct contact initiated by an ambulance service licensed under chapter 144E, a medical response unit registered under section 144E.275, or by the emergency department of a hospital licensed under chapter 144, for the purpose of rendering emergency care; or\n(5) a situation in which the injured person:\n(i) had a prior professional relationship with the licensee;\n(ii) has selected that licensee as the licensee from whom the injured person receives health care; or\n(iii) has received treatment related to the accident from the licensee.\n(d) For purposes of this paragraph, \"legal name,\" for an individual means the name under which an individual is licensed or registered as a health care professional in Minnesota or an adjacent state, and for a business entity, a name under which the entity is registered with the secretary of state in Minnesota or an adjacent state, so long as the name does not include any misleading description of the nature of its health care practice; and \"health care provider\" means an individual or business entity that provides medical treatment of an injury eligible as a medical expense claim under this chapter. In addition to any laws governing, or rules adopted by, a health care provider licensing board, any solicitation or advertisement for medical treatment, or for referral for medical treatment, of an injury eligible for treatment under this chapter must: (1) be undertaken only by or at the direction of a health care provider; (2) prominently display or reference the legal name of the health care provider; (3) display or reference the license type of the health care provider, or in the case of a health care provider that is a business entity, the license type of all of the owners of the health care provider but need not include the names of the owners; (4) not contain any false, deceptive, or misleading information, or misrepresent the services to be provided; (5) not include any reference to the dollar amounts of the potential benefits under this chapter; and (6) not imply endorsement by any law enforcement personnel or agency.\n(e) A violation of this subdivision is grounds for the licensing authority to take disciplinary action against the licensee, including revocation in appropriate cases.",
	"repealed": false
}