{
	"id": "16A.963",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.963",
	"title": "16A.963 ELECTRIC VEHICLE INFRASTRUCTURE APPROPRIATION BONDS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Appropriation bond\" or \"bond\" means a bond, note, or other similar instrument of the state payable during a biennium from one or more of the following sources:\n(1) money appropriated by law from the general fund in any biennium for debt service due with respect to obligations described in subdivision 2, paragraph (a);\n(2) proceeds of the sale of obligations described in subdivision 2, paragraph (a);\n(3) payments received for that purpose under agreements and ancillary arrangements described in subdivision 2, paragraph (d); and\n(4) investment earnings on amounts in clauses (1) to (3).\n(c) \"Debt service\" means the amount payable in any biennium of principal, premium, if any, and interest on appropriation bonds, and the fees, charges, and expenses related to the bonds.\n(a) Subject to the limitations of this subdivision, the commissioner may sell and issue appropriation bonds of the state under this section for public purposes as provided by law, including for the purposes of financing the cost of acquiring and installing electric vehicle charging infrastructure on publicly owned property. Appropriation bonds may be sold and issued in amounts that, in the opinion of the commissioner, are necessary to provide sufficient money to the commissioner of administration under subdivision 7, not to exceed $2,000,000 net of costs of issuance, for the purposes as provided under this subdivision, and to pay debt service including capitalized interest, costs of issuance, costs of credit enhancement, or make payments under other agreements entered into under paragraph (d).\n(b) Proceeds of the appropriation bonds must be credited to a special appropriation electric vehicle infrastructure bond proceeds fund in the state treasury. All income from investment of the bond proceeds, as estimated by the commissioner, is appropriated to the commissioner for the payment of principal and interest on the appropriation bonds.\n(c) Appropriation bonds may be issued in one or more issues or series on the terms and conditions the commissioner determines to be in the best interests of the state, but the term on any series of appropriation bonds may not exceed 21 years. The appropriation bonds of each issue and series thereof shall be dated and bear interest, and may be includable in or excludable from the gross income of the owners for federal income tax purposes.\n(d) At the time of, or in anticipation of, issuing the appropriation bonds, and at any time thereafter, so long as the appropriation bonds are outstanding, the commissioner may enter into agreements and ancillary arrangements relating to the appropriation bonds, including but not limited to trust indentures, grant agreements, lease or use agreements, operating agreements, management agreements, liquidity facilities, remarketing or dealer agreements, letter of credit agreements, insurance policies, guaranty agreements, reimbursement agreements, indexing agreements, or interest exchange agreements. Any payments made or received according to the agreement or ancillary arrangement shall be made from or deposited as provided in the agreement or ancillary arrangement. The determination of the commissioner, included in an interest exchange agreement, that the agreement relates to an appropriation bond, shall be conclusive.\n(e) The commissioner may enter into written agreements or contracts relating to the continuing disclosure of information necessary to comply with or facilitate the issuance of appropriation bonds in accordance with federal securities laws, rules, and regulations, including Securities and Exchange Commission rules and regulations in Code of Federal Regulations, title 17, section 240.15c 2-12. An agreement may be in the form of covenants with purchasers and holders of appropriation bonds set forth in the order or resolution authorizing the issuance of the appropriation bonds, or a separate document authorized by the order or resolution.\n(f) The appropriation bonds are not subject to chapter 16C.\n(a) Appropriation bonds may be issued in the form of bonds, notes, or other similar instruments, and in the manner provided in section 16A.672. In the event that any provision of section 16A.672 conflicts with this section, this section shall control.\n(b) Every appropriation bond shall include a conspicuous statement of the limitation established in subdivision 6.\n(c) Appropriation bonds may be sold at either public or private sale upon such terms as the commissioner shall determine are not inconsistent with this section and may be sold at any price or percentage of par value. Any bid received may be rejected.\n(d) Appropriation bonds must bear interest at a fixed or variable rate.\n(e) Notwithstanding any other law, appropriation bonds issued under this section shall be fully negotiable.\nThe commissioner may issue appropriation bonds for the purpose of refunding any appropriation bonds then outstanding, including the payment of any redemption premiums on the bonds, any interest accrued or to accrue to the redemption date, and costs related to the issuance and sale of the refunding bonds. The proceeds of any refunding bonds may, at the discretion of the commissioner, be applied to the purchase or payment at maturity of the appropriation bonds to be refunded, to the redemption of the outstanding appropriation bonds on any redemption date, or to pay interest on the refunding bonds and may, pending application, be placed in escrow to be applied to the purchase, payment, retirement, or redemption. Any escrowed proceeds, pending such use, may be invested and reinvested in obligations that are authorized investments under section 11A.24. The income earned or realized on the investment may also be applied to the payment of the appropriation bonds to be refunded or interest or premiums on the refunded appropriation bonds, or to pay interest on the refunding bonds. After the terms of the escrow have been fully satisfied, any balance of the proceeds and any investment income may be returned to the general fund or, if applicable, the special appropriation electric vehicle infrastructure bond proceeds fund for use in any lawful manner. All refunding bonds issued under this subdivision must be prepared, executed, delivered, and secured by appropriations in the same manner as the appropriation bonds to be refunded.\nAny of the following entities may legally invest any sinking funds, money, or other funds belonging to them or under their control in any appropriation bonds issued under this section:\n(1) the state, the investment board, public officers, municipal corporations, political subdivisions, and public bodies;\n(2) banks and bankers, savings and loan associations, credit unions, trust companies, savings banks and institutions, investment companies, insurance companies, insurance associations, and other persons carrying on a banking or insurance business; and\n(3) personal representatives, guardians, trustees, and other fiduciaries.\nThe appropriation bonds are not public debt of the state, and the full faith, credit, and taxing powers of the state are not pledged to the payment of the appropriation bonds or to any payment that the state agrees to make under this section. Appropriation bonds shall not be obligations paid directly, in whole or in part, from a tax of statewide application on any class of property, income, transaction, or privilege. Appropriation bonds shall be payable in each fiscal year only from amounts that the legislature may appropriate for debt service for any fiscal year, provided that nothing in this section shall be construed to require the state to appropriate money sufficient to make debt service payments with respect to the appropriation bonds in any fiscal year. Appropriation bonds shall be canceled and shall no longer be outstanding on the earlier of (1) the first day of a fiscal year for which the legislature shall not have appropriated amounts sufficient for debt service, or (2) the date of final payment of the principal of and interest on the appropriation bonds.\nThe proceeds of appropriation bonds issued under subdivision 2, paragraph (a), and interest credited to the special appropriation electric vehicle infrastructure bond proceeds fund are appropriated as follows:\n(1) to the commissioner of administration to design, install, and equip electrical infrastructure and electric vehicle charging stations on state-owned property as specified in subdivision 2, paragraph (a); and\n(2) to the commissioner for debt service on the bonds including capitalized interest, nonsalary costs of issuance of the bonds, costs of credit enhancement of the bonds, and payments under any agreements entered into under subdivision 2, paragraph (d), as permitted by state and federal law.\nAn amount needed to pay principal and interest on appropriation bonds issued under subdivision 2, paragraph (a), is appropriated each fiscal year from the general fund to the commissioner, subject to repeal, unallotment under section 16A.152, or cancellation, otherwise pursuant to subdivision 6, for deposit into the bond payments account established for such purpose in the special appropriation electric vehicle infrastructure bond proceeds fund. The appropriation is available beginning in fiscal year 2021 and remains available through fiscal year 2042.\nThe waiver of immunity by the state provided for by section 3.751, subdivision 1, shall be applicable to the appropriation bonds and any ancillary contracts to which the commissioner is a party.",
	"repealed": false
}