{
	"id": "169.8665",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.8665",
	"title": "169.8665 SPECIAL SOYBEAN MEAL-HAULING VEHICLE PERMIT.",
	"text": "The commissioner may issue a permit for a vehicle that transports soybean meal and meets the following requirements:\n(1) is a combination of vehicles, including a truck-tractor and a semitrailer drawing one additional semitrailer, and no semitrailer used in the three-vehicle combination has an overall length in excess of 28-1/2 feet;\n(2) does not exceed a maximum gross vehicle weight of 106,000 pounds; and\n(3) is operated only in this state on marked U.S. Highway 75 in Crookston to marked U.S. Highway 2, and on marked U.S. Highway 2 from Crookston to the North Dakota border.\nThe commissioner may issue a permit for a vehicle that transports soybean meal and meets the following requirements:\n(1) is a combination of vehicles consisting of a truck-tractor and a single semitrailer that may exceed 48 feet, but not 53 feet, if the distance from the kingpin to the centerline of the rear axle group of the semitrailer does not exceed 43 feet;\n(2) does not exceed a maximum gross vehicle weight of 106,000 pounds; and\n(3) is operated only on the highways specified in subdivision 1, clause (3).\n(a) A vehicle issued a permit under subdivision 1 or 2:\n(1) is subject to the axle weight limits in section 169.824;\n(2) is subject to bridge load limits posted pursuant to section 169.84;\n(3) is subject to seasonal load restrictions under section 169.87;\n(4) may not be operated with a load that exceeds the tire manufacturer's recommended load under section 169.823, the manufacturer's gross vehicle weight rating as affixed to the vehicle, or other certification of gross weight rating under Code of Federal Regulations, title 49, sections 567.4 to 567.7;\n(5) may not be operated on the interstate highway system; and\n(6) may be operated on streets or highways under the control of a local authority only upon the approval of the local authority. However, vehicles may have reasonable access to terminals and facilities for food, fuel, repairs, and rest, and for continuity of route within one mile of the national network as provided by section 169.81, subdivision 3, and Code of Federal Regulations, title 23, section 658.19.\n(b) The seasonal weight increases authorized under section 169.826 do not apply to permits issued under this section.\nVehicle permits issued under subdivision 1 must be annual permits. The fee is $850 for each vehicle, or a proportional amount as provided in section 169.86, subdivision 5, and must be deposited in the trunk highway fund. An amount sufficient to administer the permit program is appropriated from the trunk highway fund to the commissioner for the costs of administering the permit program.\nUpon request of the permit applicant, the expiration date for a permit issued under this section must be the same as the expiration date of the permitted vehicle's registration.",
	"repealed": false
}