{
	"id": "209.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/209.021",
	"title": "209.021 NOTICE OF CONTEST.",
	"text": "Service of a notice of contest must be made in the same manner as the service of summons in civil actions. The notice of contest must specify the grounds on which the contest will be made. The contestant shall serve notice of the contest on the parties enumerated in this section. Except as provided in section 204D.27, notice must be served and filed within five days after the canvass is completed in the case of a primary or special primary or within seven days after the canvass is completed in the case of a special or general election. If a contest is based on a deliberate, serious, and material violation of the election laws that was discovered from the statements of receipts and disbursements required to be filed by candidates and committees, the action may be commenced and the notice served and filed within ten days after the filing of the statements in the case of a general or special election or within five days after the filing of the statements in the case of a primary or special primary. If a notice of contest questions only which party received the highest number of votes legally cast at the election, a contestee who loses may serve and file a notice of contest on any other ground during the three days following expiration of the time for appealing the decision on the vote count.\nIf the contest relates to a nomination or election for statewide office, the contestant shall file the notice of contest with the court administrator of District Court in Ramsey County. For contests relating to any other office, the contestant shall file the notice of contest with the court administrator of district court in the county where the contestee maintains residence.\nIf the contest relates to a constitutional amendment, the contestant shall file the notice of contest with the court administrator of District Court in Ramsey County. If the contest relates to any other question, the contestant shall file the notice of contest with the court administrator of district court for the county or any one of the counties where the question appeared on the ballot.\nIn all contests relating to the nomination or election of a candidate, the notice of contest must be served on the candidate who is the contestee, a copy of the notice must be sent to the contestee's last known address by certified mail, and a copy must be furnished to the official authorized to issue the certificate of election. If personal or substituted service on the contestee cannot be made, an affidavit of the attempt by the person attempting to make service and the affidavit of the person who sent a copy of the notice to the contestee by certified mail is sufficient to confer jurisdiction upon the court to decide the contest.\nIf the contest relates to a constitutional amendment, notice of contest must be served on the secretary of state, who is the contestee. If a contest relates to a question voted on within only one county, school district, or municipality, a copy of the notice of contest must be served on the county auditor, clerk of the school district, or municipal clerk, respectively, who is the contestee. If the contest is upon the question of consolidation or reorganization of a school district, a copy of the notice of contest must be served on the county auditor authorized by law to issue the order.",
	"repealed": false
}