{
	"id": "290.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.371",
	"title": "290.371 NOTICE OF BUSINESS ACTIVITIES REPORT.",
	"text": "Every corporation that, during any calendar year or fiscal accounting year beginning after December 31, 1986, obtained any business from within this state as described in section 290.015, subdivision 1, except corporations specifically exempted under subdivision 2, must file a notice of business activities report, as provided in this section. Filing of the report is not a factor in determining whether a corporation is subject to taxation under this chapter.\nMS 1987 Supp [Repealed, 1988 c 719 art 2 s 56]\nA corporation is not required to file a notice of business activities report if:\n(1) by the end of an accounting period for which it was otherwise required to file a notice of business activities report under this section, it had received a certificate of authority to do business in this state;\n(2) a timely return has been filed under section 289A.08;\n(3) the corporation is exempt from taxation under this chapter pursuant to section 290.05; or\n(4) the corporation's activities in Minnesota, or the interests in property which it owns, consist solely of activities or property exempted from jurisdiction to tax under section 290.015, subdivision 3, paragraph (b).\nEvery corporation not exempt under subdivision 2 must file annually a notice of business activities report, including such forms as the commissioner may require, with respect to each of its calendar or fiscal accounting years beginning after December 31, 1986, on or before the 15th day of the fourth month after the close of the calendar or fiscal accounting year.\n(a) Any corporation required to file a notice of business activities report does not have any cause of action upon which it may bring suit under Minnesota law, except for issues related to its Minnesota tax liability, unless the corporation has filed a notice of business activities report.\n(b) The failure of a corporation to file a timely report prevents the use of the courts in this state, except regarding activities and property described in section 290.015, subdivision 3, paragraph (b), for all contracts executed and all causes of action that arose at any time before the end of the last accounting period for which the corporation failed to file a required report.\n(c) The court in which the issues arise must excuse the corporation for its failure to file a report when due, and restore the corporation's cause of action under the laws of this state, if the corporation has paid all taxes, interest, and civil penalties due the state for all periods, or provided for payment of them by adequate security or bond approved by the commissioner.\n(d) Pursuant to section 270B.14, subdivision 6, the commissioner may acknowledge whether or not a particular corporation has filed with the commissioner reports or returns required by this chapter if the acknowledgment:\n(1) is to a party in a civil action;\n(2) relates to the filing status of another party in the same civil action; and\n(3) is in response to a written request accompanied by a copy of the summons and complaint in the civil action.\n[Renumbered subd 4]",
	"repealed": false
}