{
	"id": "524.6-204",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.6-204",
	"title": "524.6-204 RIGHT OF SURVIVORSHIP.",
	"text": "(a) Sums remaining on deposit at the death of a party to a joint account belong to the surviving party or parties as against the estate of the decedent unless: (1) there is clear and convincing evidence of a different intention; or (2) there is a different disposition made by a valid will specifically referring to such account, as provided in this section. If there are two or more surviving parties, their respective ownerships during lifetime shall be in proportion to their previous ownership interests under section 524.6-203 augmented by an equal share for each survivor of any interest the decedent may have owned in the account immediately before death; and the right of survivorship continues between the surviving parties. The interest so determined is also the interest disposable by will.\n(b) If the account is a P.O.D. account, on the death of the original party or of the survivor of two or more original parties, any sums remaining on deposit belong to the P.O.D. payees if surviving, or to the survivor of them if one or more die before the surviving original party; if two or more P.O.D. payees survive, there is no right of survivorship in event of death of a P.O.D. payee thereafter unless the terms of the account or deposit agreement expressly provide for survivorship between them.\n(c) In other cases, the death of any party to a multiple-party account has no effect on beneficial ownership of the account other than to transfer the rights of the decedent as part of the estate.\n(d) A right of survivorship arising from the express terms of the account, or under this section, or under a P.O.D. payee designation, may be changed by specific reference by will, but the terms of such will shall not be binding upon any financial institution unless it has been given a notice in writing of a claim thereunder, in which event the deposit shall remain undisbursed until an order has been made by the probate court adjudicating the decedent's interest disposable by will.",
	"repealed": false
}