{
	"id": "16A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.17",
	"title": "16A.17 PREPARATION OF STATE PAYROLL.",
	"text": "The commissioner, with the approval of the governor, may choose to pay salaried employees semimonthly or biweekly.\n[Repealed, 1976 c 231 s 34]\nThe commissioner may adjust the salary of an employee to provide equal payments through the year and to make use of modern accounting in preparing the payroll. Adjusted salaries must be based on a year of 2088 working hours. Fractions may be dropped or added in order to permit equal payments even if the salary is then slightly changed.\nThe commissioner shall set procedures for allocating and encumbering equal salary payments when a payroll period extends beyond the end of the fiscal year.\nSubdivision 4 applies to salaries of state officers and employees payable in equal payments throughout the year notwithstanding any other provision in Minnesota Statutes. No provision of any subsequent law relating to the budget, allotment, and encumbrance system or to appropriations for the payment of salaries of state officers and employees shall be construed as inconsistent with this subdivision except as expressly provided in the subsequent act that subdivision 4 does not apply or is superseded, modified, amended, or repealed.\nWhen the department prepares the payroll for an agency, the commissioner assumes the agency head's duties to make authorized or required deductions from, or employer contributions on, the pay of the agency's employees and to prepare and issue the necessary payments.\nThe commissioner may require an employee making a voluntary deduction and the recipient of the deduction to provide information on the amount of or a change in the amount of the deduction. The employee making a voluntary deduction must sign and send the deduction instructions to the intended recipient of the deduction. The intended recipient shall forward the original signed instruction and other required information to the employee's payroll preparer.\nThe commissioner shall prepare the payroll for the executive branch. Upon request of the Rules Committee of the senate or house of representatives or the supreme court, as appropriate, the commissioner shall prepare the payrolls of the legislative and judicial branches in a similar way.\nThe commissioner may authorize an official to certify the hours worked for payroll purposes in anticipation of the hours actually worked.\nMS 1974 [Repealed, 1975 c 273 s 3]\nThe commissioner shall prescribe procedures to assure payment is made only for hours worked except:\n(1) for leave under a collective bargaining agreement;\n(2) for leave under a plan according to section 43A.18 or the rules of the Department of Management and Budget; or\n(3) to resolve a formal employee grievance permitted by law or collective bargaining agreement.\nThe head of an agency shall release to the commissioner money held for an employee when the commissioner certifies to the head that the money is required to correct an overpayment to an employee. An employee's contribution to a retirement fund may not be released until the person otherwise entitled to the employee's retirement account has been notified of the release certification and is eligible to apply for a refund. Released funds are the equivalent of a refund. Funds may not be released if the employee or a survivor is entitled to an immediate or deferred annuity or to a survivor's benefit.\nIf a direct appropriation for payroll preparation is made, the commissioner shall bill an agency for its share of payroll costs. The billing shall be done through the indirect cost billing system. Money collected must be deposited in the general fund.\nNotwithstanding section 177.23, the commissioner may require direct deposit for all state employees who are being paid by the state payroll system.",
	"repealed": false
}