{
	"id": "144.0526",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0526",
	"title": "144.0526 MINNESOTA ONE HEALTH ANTIMICROBIAL STEWARDSHIP COLLABORATIVE.",
	"text": "The commissioner of health shall establish the Minnesota One Health Antimicrobial Stewardship Collaborative. The commissioner shall hire a director to execute operations, conduct health education, and provide technical assistance.\nThe commissioner of health shall oversee a program to:\n(1) maintain the position of director of One Health Antimicrobial Stewardship to lead state antimicrobial stewardship initiatives across human, animal, and environmental health;\n(2) communicate to professionals and the public the interconnectedness of human, animal, and environmental health, especially related to preserving the efficacy of antibiotic medications, which are a shared resource;\n(3) leverage new and existing partnerships. The commissioner of health shall consult and collaborate with academic institutions, industry and community organizations, and organizations and agencies in fields including but not limited to health care, veterinary medicine, and animal agriculture to inform strategies for education, practice improvement, and research in all settings where antimicrobial products are used;\n(4) ensure that veterinary settings have education and strategies needed to practice appropriate antibiotic prescribing, implement clinical antimicrobial stewardship programs, and prevent transmission of antimicrobial-resistant microbes; and\n(5) support collaborative research and programmatic initiatives to improve the understanding of the impact of antimicrobial use and resistance in the natural environment.\nBy January 15, 2025, and every two years thereafter, the commissioner of health shall report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over health policy and finance on the work accomplished by the commissioner under this section and the collaborative research conducted in the previous two years and on program goals for the upcoming two years.",
	"repealed": false
}