{
	"id": "518A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.75",
	"title": "518A.75 COST-OF-LIVING ADJUSTMENTS IN MAINTENANCE OR CHILD SUPPORT ORDER.",
	"text": "(a) An order establishing, modifying, or enforcing maintenance or child support shall provide for a biennial adjustment in the amount to be paid based on a change in the cost of living. An order that provides for a cost-of-living adjustment shall specify the cost-of-living index to be applied and the date on which the cost-of-living adjustment shall become effective. The court may use the Consumer Price Index for all urban consumers, Minneapolis-St. Paul (CPI-U), the Consumer Price Index for wage earners and clerical, Minneapolis-St. Paul (CPI-W), or another cost-of-living index published by the Department of Labor which it specifically finds is more appropriate. Cost-of-living increases under this section shall be compounded. The court may also increase the amount by more than the cost-of-living adjustment by agreement of the parties or by making further findings.\n(b) The adjustment becomes effective on the first of May of the year in which it is made, for cases in which payment is made to the public authority. For cases in which payment is not made to the public authority, application for an adjustment may be made in any month but no application for an adjustment may be made sooner than two years after the date of the dissolution decree. A court may waive the requirement of the cost-of-living clause if it expressly finds that the obligor's occupation or income, or both, does not provide for cost-of-living adjustment or that the order for maintenance or child support has a provision such as a step increase that has the effect of a cost-of-living clause. The court may waive a cost-of-living adjustment in a maintenance order if the parties so agree in writing. The commissioner of children, youth, and families may promulgate rules for child support adjustments under this section in accordance with the rulemaking provisions of chapter 14. Notice of this statute must comply with section 518.68, subdivision 2.\nNo adjustment under this section may be made unless the order provides for it and the public authority or the obligee, if the obligee is requesting the cost-of-living adjustment, sends notice of the intended adjustment to the obligor at the obligor's last known address at least 20 days before the effective date of the adjustment. The notice shall inform the obligor of the date on which the adjustment will become effective and the procedures for contesting the adjustment.\n(a) To contest cost-of-living adjustments initiated by the public authority or an obligee who has applied for or is receiving child support and maintenance collection services from the public authority, other than income withholding only services, the obligor, before the effective date of the adjustment, must:\n(1) file a motion contesting the cost-of-living adjustment with the court administrator; and\n(2) serve the motion by first-class mail on the public authority and the obligee.\nThe hearing shall take place in the expedited child support process as governed by section 484.702.\n(b) To contest cost-of-living adjustments initiated by an obligee who is not receiving child support and maintenance collection services from the public authority, or for an obligee who receives income withholding only services from the public authority, the obligor must, before the effective date of the adjustment:\n(1) file a motion contesting the cost-of-living adjustment with the court administrator; and\n(2) serve the motion by first-class mail on the obligee.\nThe hearing shall take place in district court.\n(c) Upon receipt of a motion contesting the cost-of-living adjustment, the cost-of-living adjustment shall be stayed pending further order of the court.\n(d) The court administrator shall make available pro se motion forms for contesting a cost-of-living adjustment under this subdivision.\nIf, at a hearing pursuant to this section, the obligor establishes an insufficient cost of living or other increase in income that prevents fulfillment of the adjusted maintenance or basic support obligation, the court or child support magistrate may direct that all or part of the adjustment not take effect. If, at the hearing, the obligor does not establish this insufficient increase in income, the adjustment shall take effect as of the date it would have become effective had no hearing been requested.",
	"repealed": false
}