{
	"id": "174.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.30",
	"title": "174.30 OPERATING STANDARDS FOR SPECIAL TRANSPORTATION SERVICE.",
	"text": "(a) The operating standards for special transportation service adopted under this section do not apply to special transportation provided by:\n(1) a public transit provider receiving financial assistance under sections 174.24 or 473.371 to 473.449;\n(2) a volunteer driver, as defined in section 65B.472, subdivision 1, paragraph (h), using a private automobile;\n(3) a school bus as defined in section 169.011, subdivision 71; or\n(4) an emergency ambulance regulated under chapter 144E.\n(b) The operating standards adopted under this section only apply to providers of special transportation service who receive grants or other financial assistance from either the state or the federal government, or both, to provide or assist in providing that service; except that the operating standards adopted under this section do not apply to any nursing home licensed under section 144A.02, to any board and care facility licensed under section 144.50, or to any day training and habilitation services, day care, or group home facility licensed under sections 245A.01 to 245A.19 unless the facility or program provides transportation to nonresidents on a regular basis and the facility receives reimbursement, other than per diem payments, for that service under rules promulgated by the commissioner of human services.\n(c) Notwithstanding paragraph (b), the operating standards adopted under this section do not apply to any vendor of services licensed under chapter 245D that provides transportation services to consumers or residents of other vendors licensed under chapter 245D and transports 15 or fewer persons, including consumers or residents and the driver.\nFor purposes of this section, unless the context clearly indicates otherwise, \"disqualified\" means an individual disqualified under chapter 245C who has not received a disqualification set-aside under sections 245C.22 and 245C.23 specific to that special transportation service provider.\n(a) The commissioner of transportation shall adopt by rule standards for the operation of vehicles used to provide special transportation service which are reasonably necessary to protect the health and safety of individuals using that service. The commissioner, as far as practicable, consistent with the purpose of the standards, shall avoid adoption of standards that unduly restrict any public or private entity or person from providing special transportation service because of the administrative or other cost of compliance.\n(b) Standards adopted under this section must include but are not limited to:\n(1) qualifications of drivers and attendants, including driver training requirements that must be met before a driver provides special transportation;\n(2) safety of vehicles and necessary safety equipment;\n(3) general requirements concerning inspection and maintenance of vehicles, replacement vehicles, standard vehicle equipment, and specialized equipment necessary to ensure vehicle usability and safety for disabled persons; and\n(4) minimum insurance requirements.\n(c) The commissioner shall consult with the Council on Disability before making a decision on a variance from the standards.\n(a) Every special transportation service provider shall systematically inspect, repair, and maintain, or cause to be inspected, repaired, and maintained, the vehicles and equipment subject to the control of the provider. Each vehicle and its equipment must be inspected daily. A vehicle may not be operated in a condition that is likely to cause an accident or breakdown of the vehicle. Equipment, including specialized equipment necessary to ensure vehicle usability and safety for disabled persons, must be in proper and safe operating condition at all times.\n(b) Each special transportation provider shall maintain the following records for each vehicle:\n(1) an identification of the vehicle, including make, serial number, and year, and, if the vehicle is not owned by the provider, the name and address of the person furnishing the vehicle;\n(2) a schedule of inspection and maintenance operations to be performed;\n(3) a record of inspections, repairs, and maintenance showing the date and nature;\n(4) a lubrication record;\n(5) a record of tests conducted to ensure that emergency doors or windows and wheelchair lifts function properly; and\n(6) a record of trips, limited to date, time, and driver's name.\n(a) A special transportation service that transports individuals occupying wheelchairs is subject to the provisions of sections 299A.11 to 299A.17 concerning wheelchair securement devices. The commissioners of transportation and public safety shall cooperate in the enforcement of this section and sections 299A.11 to 299A.17 so that a single inspection is sufficient to ascertain compliance with sections 299A.11 to 299A.17 and with the standards adopted under this section. Representatives of the Department of Transportation may inspect wheelchair securement devices in vehicles operated by special transportation service providers to determine compliance with sections 299A.11 to 299A.17 and to issue certificates under section 299A.14, subdivision 4.\n(b) In place of a certificate issued under section 299A.14, the commissioner may issue a decal under subdivision 4 for a vehicle equipped with a wheelchair securement device if the device complies with sections 299A.11 to 299A.17 and the decal displays the information in section 299A.14, subdivision 4.\n(c) For vehicles designated as protected transport under section 256B.0625, subdivision 17, paragraph (l), the commissioner of transportation, during the commissioner's inspection, shall check to ensure the safety provisions contained in that paragraph are in working order.\n(a) The commissioner shall inspect or provide for the inspection of vehicles at least annually. In addition to scheduled annual inspections and reinspections scheduled for the purpose of verifying that deficiencies have been corrected, unannounced inspections of any vehicle may be conducted.\n(b) On determining that a vehicle or vehicle equipment is in a condition that is likely to cause an accident or breakdown, the commissioner shall require the vehicle to be taken out of service immediately. The commissioner shall require that vehicles and equipment not meeting standards be repaired and brought into conformance with the standards and shall require written evidence of compliance from the operator before allowing the operator to return the vehicle to service. The commissioner may prohibit a vehicle from being placed in or returned to service under a certificate of compliance until the vehicle fully complies with all of the requirements in Minnesota Rules, chapter 8840.\n(c) The commissioner shall provide in the rules procedures for inspecting vehicles, removing unsafe vehicles from service, determining and requiring compliance, and reviewing driver qualifications.\n(d) The commissioner shall design a distinctive decal to be issued to special transportation service providers with a current certificate of compliance under this section. A decal is valid for one year from the last day of the month in which it is issued. A person who is subject to the operating standards adopted under this section may not provide special transportation service in a vehicle that does not conspicuously display a decal issued by the commissioner.\n(e) All special transportation service providers shall pay an annual fee of $45 to obtain a decal. Providers of ambulance service, as defined in section 144E.001, subdivision 3, are exempt from the annual fee. Fees collected under this paragraph must be deposited in the trunk highway fund, and are appropriated to the commissioner to pay for costs related to administering the special transportation service program.\n(f) Special transportation service providers shall prominently display in each vehicle all contact information for the submission of complaints regarding the transportation services provided to that individual. All vehicles providing service under section 473.386 shall display contact information for the Metropolitan Council. All other special transportation service vehicles shall display contact information for the commissioner of transportation.\n(g) Nonemergency medical transportation providers must comply with Minnesota Rules, part 8840.5450, except that a provider may use the phrase \"nonemergency medical transportation\" in its name or in advertisements or information describing the service.\n(a) The commissioner may refuse to issue a certificate of compliance if an individual specified in subdivision 10, paragraph (a), clauses (1) to (3), is disqualified or is not on the provider's active roster, as defined in section 245C.02, subdivision 17a, paragraph (b).\n(b) The commissioner shall annually evaluate or provide for the evaluation of each provider of special transportation service regulated under this section and certify that the provider is in compliance with the standards under this section.\nMS 2018 [Repealed, 2020 c 100 s 30]\nThe rules authorized under this section shall be adopted in accordance with the provisions of the Administrative Procedure Act, sections 14.001 to 14.69.\n(a) Notwithstanding any other law, ordinance, or resolution to the contrary, an operator of special transportation service that has been issued a current certificate of compliance under subdivision 4a for vehicles used to provide that service is not required to obtain any other state or local permit, license or certificate as a condition of operating the vehicles for that purpose. This subdivision does not exempt any vehicle from the requirements imposed on vehicles generally as a condition of using the public streets and highways.\n(b) The requirements of sections 169.781 to 169.783 and chapter 221 do not apply to vehicles when they are being operated under a current certificate of compliance issued by the commissioner.\nNo state agency, political subdivision, or other public agency shall provide any capital or operating assistance to or reimbursement for special transportation service unless the operator providing the service has a current certificate of compliance issued under subdivision 4a.\n(a) The commissioner may issue an order requiring violations of this section and the operating standards adopted under this section to be corrected and assessing monetary penalties of up to $1,000 for all violations identified during a single inspection, investigation, or audit. Section 221.036 applies to administrative penalty orders issued under this section or section 174.315. The commissioner shall suspend, without a hearing, a special transportation service provider's certificate of compliance for failure to pay, or make satisfactory arrangements to pay, an administrative penalty when due.\n(b) If the commissioner determines that an individual subject to background studies under subdivision 10, paragraph (a), is disqualified or is not on the provider's active roster, as defined in section 245C.02, subdivision 17a, paragraph (b), the commissioner must issue a written notice ordering the special transportation service provider to immediately cease permitting the individual to perform services or functions listed in subdivision 10, paragraph (a). The written notice must include a warning that failure to comply with the order may result in the suspension or revocation of the provider's certificate of compliance under this section.\n(c) The commissioner may suspend or revoke a provider's certificate of compliance upon determining that, following receipt by a provider of written notice under paragraph (b), the individual has continued to perform services or functions listed in subdivision 10, paragraph (a), for the provider. A provider whose certificate is suspended or revoked may appeal the commissioner's action in a contested case proceeding under chapter 14.\n(d) If the commissioner determines that a provider has failed to pay the decal fees as required by subdivision 4, the commissioner must send written notice by certified mail ordering the provider to pay the applicable fees within 60 days after the notice was mailed.\n(e) The commissioner may suspend a provider's certificate of compliance if the provider fails to submit the required payment after receiving written notice under paragraph (d). A provider whose certificate is suspended may appeal the commissioner's action in a contested case proceeding under chapter 14.\n(f) Penalties collected under this section must be deposited in the state treasury and credited to the trunk highway fund.\n(a) The commissioner shall investigate all complaints over which the commissioner has jurisdiction regarding special transportation service providers regulated under this section.\n(b) When information is furnished to the Department of Transportation that alleges a violation of this section, an operating standard adopted under this section, or section 174.315, the following data are classified as confidential data or protected nonpublic data:\n(1) names of complainants;\n(2) complaint letters; and\n(3) other unsolicited data when furnished by a person who is not the subject of the data and who is not a department employee.\n(a) Providers of special transportation service regulated under this section must initiate background studies in accordance with chapter 245C on the following individuals:\n(1) each person with a direct or indirect ownership interest of five percent or higher in the transportation service provider;\n(2) each controlling individual as defined under section 245A.02;\n(3) managerial officials as defined in section 245A.02;\n(4) each driver employed by the transportation service provider;\n(5) each individual employed by the transportation service provider to assist a passenger during transport; and\n(6) all employees of the transportation service agency who provide administrative support, including those who:\n(i) may have face-to-face contact with or access to passengers, their personal property, or their private data;\n(ii) perform any scheduling or dispatching tasks; or\n(iii) perform any billing activities.\n(b) The transportation service provider must initiate the background studies required under paragraph (a) using the online NETStudy system operated by the commissioner of human services.\n(c) The transportation service provider shall not permit any individual to provide any service or function listed in paragraph (a) until the transportation service provider has received notification from the commissioner of human services indicating that the individual:\n(1) is not disqualified under chapter 245C; or\n(2) is disqualified, but has received a set-aside of that disqualification according to sections 245C.22 and 245C.23 related to that transportation service provider.\n(d) When a local or contracted agency is authorizing a ride under section 256B.0625, subdivision 17, by a volunteer driver, as defined in section 65B.472, subdivision 1, paragraph (h), and the agency authorizing the ride has reason to believe the volunteer driver has a history that would disqualify the individual or that may pose a risk to the health or safety of passengers, the agency may initiate a background study to be completed according to chapter 245C using the commissioner of human services' online NETStudy system, or through contacting the Department of Human Services background study division for assistance. The agency that initiates the background study under this paragraph shall be responsible for providing the volunteer driver with the privacy notice required under section 245C.05, subdivision 2c, and payment for the background study required under section 245C.10, subdivision 11, before the background study is completed.",
	"repealed": false
}