{
	"id": "168.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.013",
	"title": "168.013 VEHICLE REGISTRATION TAXES.",
	"text": "Motor vehicles, except as set forth in section 168.012, using the public streets or highways in the state shall be taxed in lieu of all other taxes thereon, except wheelage taxes, so-called, which may be imposed by any city as provided by law, and except gross earnings taxes paid by companies subject or made subject thereto, and shall be privileged to use the public streets and highways, on the basis and at the rate for each calendar year as hereinafter provided.\nMS 1971 [Repealed, 1973 c 218 s 9]\n(a) On passenger automobiles as defined in section 168.002, subdivision 24, and hearses, except as otherwise provided, the registration tax is calculated as $10 plus:\n(1) for a vehicle initially registered in Minnesota prior to November 16, 2020, 1.54 percent of the manufacturer's suggested retail price of the vehicle and the destination charge, subject to the adjustments in paragraphs (e) and (f); or\n(2) for a vehicle initially registered in Minnesota on or after November 16, 2020, 1.575 percent of the manufacturer's suggested retail price of the vehicle, subject to the adjustments in paragraphs (e) and (f).\n(b) The registration tax calculation must not include the cost of each accessory or item of optional equipment separately added to the vehicle and the manufacturer's suggested retail price. The registration tax calculation must not include a destination charge, except for a vehicle previously registered in Minnesota prior to November 16, 2020.\n(c) The registrar must determine the manufacturer's suggested retail price:\n(1) using list price information published by the manufacturer or any nationally recognized firm or association compiling such data for the automotive industry;\n(2) if a dealer does not determine the amount, using the retail price label as provided by the manufacturer under United States Code, title 15, section 1232; or\n(3) if the retail price label is not available, using the actual sales price of the vehicle.\nIf the registrar is unable to ascertain the manufacturer's suggested retail price of any registered vehicle in the foregoing manner, the registrar may use any other available source or method.\n(d) The registrar must calculate the registration tax using information available to dealers and deputy registrars at the time the initial application for registration is submitted.\n(e) The amount under paragraph (a), clauses (1) and (2), must be calculated based on a percentage of the manufacturer's suggested retail price, as follows:\n(1) during the first year of vehicle life, upon 100 percent of the price;\n(2) for the second year, 95 percent of the price;\n(3) for the third year, 90 percent of the price;\n(4) for the fourth year, 80 percent of the price;\n(5) for the fifth year, 70 percent of the price;\n(6) for the sixth year, 60 percent of the price;\n(7) for the seventh year, 50 percent of the price;\n(8) for the eighth year, 40 percent of the price;\n(9) for the ninth year, 25 percent of the price; and\n(10) for the tenth year, ten percent of the price.\n(f) For the 11th and each succeeding year, the amount under paragraph (a), clauses (1) and (2), must be calculated as $20.\n(g) Except as provided in subdivision 23, for any vehicle previously registered in Minnesota and regardless of prior ownership, the total amount due under this subdivision and subdivision 1m must not exceed the smallest total amount previously paid or due on the vehicle.\nOn motorcycles the tax is $10, which includes the surtax provided for in subdivision 14.\n(a) On farm trucks having a gross weight of not more than 57,000 pounds, the tax shall be based on total gross weight and shall be 45 percent of the Minnesota base rate prescribed by subdivision 1e during each of the first eight years of vehicle life, but in no event less than $35, and during the ninth and succeeding years of vehicle life the tax shall be 27 percent of the Minnesota base rate prescribed by subdivision 1e, but in no event less than $21.\n(b) On farm trucks having a gross weight of more than 57,000 pounds, the tax shall be 60 percent of the Minnesota base rate during each of the first eight years of vehicle life and 36 percent of the Minnesota base rate during the ninth and succeeding years.\n(a) On trailers registered at a gross vehicle weight of greater than 3,000 pounds, the annual tax is based on total gross weight and is 30 percent of the Minnesota base rate prescribed in subdivision 1e, when the gross weight is 15,000 pounds or less, and when the gross weight of a trailer is more than 15,000 pounds, the tax for the first eight years of vehicle life is 100 percent of the tax imposed in the Minnesota base rate schedule, and during the ninth and succeeding years of vehicle life the tax is 75 percent of the Minnesota base rate prescribed by subdivision 1e. A trailer registered at a gross vehicle weight greater than 3,000 pounds but no greater than 7,200 pounds may be taxed either: (1) annually as provided in this paragraph; or (2) once every three years on the basis of total gross weight and is 90 percent of the Minnesota base rate prescribed in subdivision 1e, provided that the filing fee under section 168.33, subdivision 7, paragraph (a), is multiplied by three, with funds collected by the commissioner allocated proportionally in the same manner as provided in section 168.33, subdivision 7, paragraph (e).\n(b) Farm trailers with a gross weight in excess of 10,000 pounds and as described in section 168.002, subdivision 8, are taxed as farm trucks as prescribed in subdivision 1c.\n(c) Effective on and after July 1, 2001, trailers registered at a gross vehicle weight of 3,000 pounds or less, excluding recreational vehicles, must display a distinctive plate. The registration on the license plate is valid for the life of the trailer only if it remains registered at the same gross vehicle weight. The onetime registration tax for trailers registered for the first time in Minnesota is $55. For trailers registered in Minnesota before July 1, 2001, and for which:\n(1) registration is desired for the remaining life of the trailer, the registration tax is $25; or\n(2) permanent registration is not desired, the biennial registration tax is $10 for the first renewal if registration is renewed between and including July 1, 2001, and June 30, 2003. These trailers must be issued permanent registration at the first renewal on or after July 1, 2003, and the registration tax is $20.\nFor trailers registered at a gross weight of 3,000 pounds or less before July 1, 2001, but not renewed until on or after July 1, 2003, the registration tax is $20 and permanent registration must be issued.\n(a) On trucks and tractors except those in this chapter defined as farm trucks and on truck-tractor and semitrailer combinations except those defined as farm combinations, the tax based on total gross weight shall be graduated according to the Minnesota base rate schedule prescribed in this subdivision, but in no event less than $120.\nMinnesota Base Rate Schedule\nScheduled taxes include five percent\nsurtax provided for in subdivision 14\n(b) For purposes of the Minnesota base rate schedule, for vehicles with six or more axles in the \"S\" and \"T\" categories, the base rates are $1,520 and $1,620 respectively.\n(c) For each vehicle with a gross weight in excess of 80,000 pounds an additional tax of $50 is imposed for each ton or fraction thereof in excess of 80,000 pounds, subject to subdivision 12 or section 169.86, subdivision 5a, as applicable.\n(d) For purposes of registration identification, for vehicles registered in the \"O\" category, the owner must declare at the time of registration whether the vehicle will carry a weight of 55,000 pounds or more and therefore be subject to the federal heavy vehicle use tax. For those owners who declare a weight less than 55,000 pounds, a distinctive weight sticker must be issued and the owner is restricted to a gross vehicle weight of less than 55,000 pounds.\n(e) Truck-tractors except those herein defined as farm vehicles shall be taxed in accordance with the foregoing gross weight tax schedule on the basis of the combined gross weight of the truck-tractor and any semitrailer or semitrailers which the applicant proposes to combine with the truck-tractor.\n(f) On trucks, truck-tractors and semitrailer combinations, except those defined as farm trucks and farm combinations, the tax for each of the first eight years of vehicle life is 100 percent of the tax imposed in the Minnesota base rate schedule, and during the ninth and succeeding years of vehicle life, the tax is 75 percent of the Minnesota base rate prescribed by this subdivision.\n(g) For the purpose of registration, trailers coupled with a truck-tractor, semitrailer combination are semitrailers.\n(a) On all intercity buses, the tax during each the first two years of vehicle life shall be based on the gross weight of the vehicle and graduated according to the following schedule:\n(b) During each of the third and fourth years of vehicle life, the tax shall be 75 percent of the foregoing scheduled tax; during the fifth year of vehicle life, the tax shall be 50 percent of the foregoing scheduled tax; during the sixth year of vehicle life, the tax shall be 37-1/2 percent of the foregoing scheduled tax; and during the seventh and each succeeding year of vehicle life, the tax shall be 25 percent of the foregoing scheduled tax; provided that the annual tax paid in any year of its life for an intercity bus shall be not less than $175 for a vehicle of over 25-passenger seating capacity and not less than $125 for a vehicle of 25-passenger and less seating capacity.\n(c) On all intracity buses operated by an auto transportation company in the business of transporting persons for compensation as a common carrier and operating within the limits of cities, the tax during each year of the vehicle life of each such bus shall be $2.\n(d) On all other buses and commuter vans, as defined in section 168.126, the tax during each of the first three years of the vehicle life shall be based on the gross weight of the vehicle and graduated according to the following schedule: Where the gross weight of the vehicle is 6,000 pounds or less, $25. Where the gross weight of the vehicle is more than 6,000 pounds, and not more than 8,000 pounds, the tax shall be $25 plus an additional tax of $5 per ton for the ton or major portion in excess of 6,000 pounds. Where the gross weight of the vehicle is more than 8,000 pounds, and not more than 20,000 pounds, the tax shall be $30 plus an additional tax of $10 per ton for each ton or major portion in excess of 8,000 pounds. Where the gross weight of the vehicle is more than 20,000 pounds and not more than 24,000 pounds, the tax shall be $90 plus an additional tax of $15 per ton for each ton or major portion in excess of 20,000 pounds. Where the gross weight of the vehicle is more than 24,000 pounds and not more than 28,000 pounds, the tax shall be $120 plus an additional tax of $25 per ton for each ton or major portion in excess of 24,000 pounds. Where the gross weight of the vehicle is more than 28,000 pounds, the tax shall be $170 plus an additional tax of $30 per ton for each ton or major portion in excess of 28,000 pounds.\n(e) During the fourth and succeeding years of vehicle life, the tax shall be 80 percent of the foregoing scheduled tax but in no event less than $20 per vehicle.\n(a) Self-propelled recreational vehicles must be separately licensed and taxed annually on the basis of total gross weight. The tax must be graduated according to the Minnesota base rate schedule prescribed in subdivision 1e, but in no event less than $20, except as otherwise provided in this subdivision.\n(b) For all self-propelled recreational vehicles, the tax for the ninth and succeeding years of vehicle life is 75 percent of the tax imposed in the Minnesota base rate schedule.\n(c) Towed recreational vehicles must be separately licensed and taxed under either one of the following, as determined by the vehicle owner: (1) annually on the basis of total gross weight at 30 percent of the Minnesota base rate prescribed in subdivision 1e; or (2) once every three years on the basis of total gross weight at 90 percent of the Minnesota base rate prescribed in subdivision 1e, provided that the filing fee under section 168.33, subdivision 7, paragraph (a), is multiplied by three, with funds collected by the commissioner allocated proportionally in the same manner as provided in section 168.33, subdivision 7, paragraph (e). In no event is the tax under this paragraph less than $5.\n(d) Notwithstanding any law to the contrary, all trailers and semitrailers taxed pursuant to this section are exempt from any wheelage tax now or hereafter imposed by any political subdivision or political subdivisions.\nOn motorized bicycles the tax is $6, which includes the surtax provided for in subdivision 14.\nMS 1984 [Repealed, 1985 c 291 s 27]\nMS 1994 [Repealed, 1995 c 264 art 3 s 51]\nA commuter van, as defined in section 168.126, must be separately licensed and taxed annually on the basis of total gross weight and the tax must be graduated according to the schedule prescribed in subdivision 1f.\nThe tax on vehicle-mounted concrete pumps and street-sweeping vehicles that are not registered under section 168.187 is 15 percent of the Minnesota base rate schedule. Vehicles registered under this subdivision must display plates from a distinctive series.\nIn addition to the tax under subdivision 1a, a surcharge of $75 is imposed for an all-electric vehicle, as defined in section 169.011, subdivision 1a. Notwithstanding subdivision 8, revenue from the fee imposed under this subdivision must be deposited in the highway user tax distribution fund.\nWhen a motor vehicle first becomes subject to taxation during the registration period for which the tax is paid, or when a vehicle becomes subject to taxation upon transfer from a motor vehicle dealer, the tax shall be for the remainder of the period prorated on a monthly basis, 1/12 of the annual tax for each calendar month or fraction thereof; provided, however, that for a vehicle having an annual tax of $10 or less there shall be no reduction until on and after September 1 when the annual tax shall be reduced one-half.\n(a) The applicant for all licenses based on gross weight shall state the unloaded weight of the motor vehicle, trailer, or semitrailer and the maximum load the applicant proposes to carry on it, the sum of which constitutes the gross weight upon which the license tax must be paid. However, the declared gross weight upon which the tax is paid must not be less than 1-1/4 times the declared unloaded weight of the motor vehicle, trailer, or semitrailer to be registered, except recreational vehicles taxed under subdivision 1g, school buses taxed under subdivision 18, and tow trucks or towing vehicles defined in section 168B.011, subdivision 12a. The gross weight of a tow truck or towing vehicle is the actual weight of the tow truck or towing vehicle fully equipped, but does not include the weight of a wrecked or disabled vehicle towed or drawn by the tow truck or towing vehicle.\n(b) Except as provided by special permit issued under section 169.86, the gross weight of a motor vehicle, trailer, or semitrailer must not exceed the gross weight upon which the license tax has been paid by more than four percent or 1,000 pounds, whichever is greater; provided that, a vehicle transporting unfinished forest products on a highway, other than a highway that is part of the system of interstate and defense highways, unless a federal exemption is granted, in accordance with paragraph (d), clause (3):\n(1) shall not exceed its gross vehicle weight upon which the license tax has been paid, or gross axle weight on any axle, by more than five percent and, notwithstanding other law to the contrary, is not subject to any fee, fine, or other assessment or penalty for exceeding a gross vehicle or axle weight by up to five percent. This clause applies year round to suppliers of unfinished forest products to mills; and\n(2) is not subject to any provision of paragraph (d) or chapter 169 limiting the gross axle weight of any individual axle unless the entire vehicle also exceeds its gross vehicle weight plus its weight allowance allowed in clause (1) and plus any weight allowance permitted under section 169.826 or 169.8261, in which case the vehicle is subject to all applicable penalties for excess weight violations.\n(c) The gross weight of the motor vehicle, trailer, or semitrailer for which the license tax is paid must be indicated by a distinctive character on the license plate or plates except as provided in subdivision 12 or section 169.86, subdivision 5a, as applicable, and the plate or plates must be kept clean and clearly visible at all times.\n(d) The owner, driver, or user of a motor vehicle, trailer, or semitrailer, upon conviction for transporting a gross weight in excess of the gross weight for which it was registered or for operating a vehicle with an axle weight exceeding the maximum lawful axle load weight, is guilty of a misdemeanor and subject to increased registration or reregistration according to the following schedule:\n(1) Upon conviction for transporting a gross weight in excess of the gross weight for which a motor vehicle, trailer, or semitrailer is registered by more than the allowance set forth in paragraph (b) but less than 25 percent, or for operating or using a motor vehicle, trailer, or semitrailer with an axle weight exceeding the maximum lawful axle load as provided in sections 169.822 to 169.829 by more than the allowance set forth in paragraph (b) but less than 25 percent, the owner, driver, or user of the motor vehicle, trailer, or semitrailer used to commit the violation, in addition to any penalty imposed for the misdemeanor, shall apply to the registrar to increase the authorized gross weight to be carried on the vehicle to a weight equal to or greater than the gross weight the owner, driver, or user was convicted of carrying. The increase is computed for the balance of the calendar year on the basis of 1/12 of the annual tax for each month remaining in the calendar year beginning with the first day of the month in which the violation occurred. If the additional registration tax computed upon that weight, plus the tax already paid, amounts to more than the regular tax for the maximum gross weight permitted for the vehicle under sections 169.822 to 169.829, that additional amount must nevertheless be paid into the highway fund, but the additional tax thus paid does not authorize or permit any person to operate the vehicle with a gross weight in excess of the maximum legal weight as provided by sections 169.822 to 169.829. Unless the owner within 30 days after a conviction applies to increase the authorized weight and pays the additional tax as provided in this section, the registrar shall revoke the registration on the vehicle and demand the return of the registration card and plates issued on that registration.\n(2) Upon conviction of an owner, driver, or user of a motor vehicle, trailer, or semitrailer for transporting a gross weight in excess of the gross weight for which the motor vehicle, trailer, or semitrailer was registered by 25 percent or more or for operating or using the vehicle or trailer with an axle weight exceeding the maximum lawful axle load as provided in sections 169.822 to 169.829 by 25 percent or more, and in addition to any penalty imposed for the misdemeanor, the registrar shall either (i) cancel the reciprocity privileges on the vehicle involved if the vehicle is being operated under reciprocity or (ii) if the vehicle is not being operated under reciprocity, cancel the certificate of registration on the vehicle operated and demand the return of the registration certificate and registration plates. The registrar may not cancel the registration or reciprocity privileges for any vehicle found in violation of seasonal load restrictions imposed under section 169.87 unless the axle weight exceeds the year-round weight limit for the highway on which the violation occurred. The registrar may investigate any allegation of gross weight violations and demand that the operator show cause why all future operating privileges in the state should not be revoked unless the additional tax assessed is paid.\n(3) Clause (1) does not apply to the first haul of unprocessed or raw farm products or unfinished forest products, when the registered gross weight is not exceeded by more than ten percent. For purposes of this clause, \"first haul\" means (i) the first, continuous transportation of unprocessed or raw farm products from the place of production or on-farm storage site to any other location within 100 miles of the place of production or on-farm storage site, or (ii) the continuous or noncontinuous transportation of unfinished forest products from the place of production to the place of final processing or manufacture located within 200 miles of the place of production.\n(4) When the registration on a motor vehicle, trailer, or semitrailer is revoked by the registrar according to this section, the vehicle must not be operated on the highways of the state until it is registered or reregistered, as the case may be, and new plates issued, and the registration fee is the annual tax for the total gross weight of the vehicle at the time of violation. The reregistration pursuant to this subdivision of any vehicle operating under reciprocity agreements pursuant to section 168.181 or 168.187 must be at the full annual registration fee without regard to the percentage of vehicle miles traveled in this state.\nMotor vehicles using the public streets and highways of this state, and owned by companies paying taxes under gross earnings system of taxation, shall be registered and taxed as provided for the registration and taxation of motor vehicles by this chapter, notwithstanding the fact that earnings from such vehicles may be included in the earnings of such companies upon which such gross earnings taxes are computed, and all provisions of this chapter are hereby made applicable to the enforcement and collection of the tax herein provided for.\nMotor vehicles not subject to taxation as provided in section 168.012, but subject to taxation as personal property within the state under section 273.36 or 273.37, subdivision 1, have a classification rate as provided in section 273.13, subdivision 24, provided, that if the person against whom any tax has been levied on the ad valorem basis because of any motor vehicle shall, during the calendar year for which such tax is levied, be also taxed under the provisions of this chapter, then and in that event, upon proper showing, the commissioner of revenue shall grant to the person against whom said ad valorem tax was levied, such reduction or abatement of net tax capacity or taxes as was occasioned by the so-called ad valorem tax imposed, and provided further that, if said ad valorem tax upon any motor vehicle has been assessed against a dealer in new and unused motor vehicles, and the tax imposed by this chapter for the required period is thereafter paid by the owner, then and in that event, upon proper showing, the commissioner of revenue, upon the application of said dealer, shall grant to such dealer against whom said ad valorem tax was levied such reduction or abatement of net tax capacity or taxes as was occasioned by the so-called ad valorem tax imposed. If such motor vehicle be registered and taxed under this chapter for a fractional part of the calendar year only, then such ad valorem tax shall be reduced in the percentage which such fractional part of the years bears to a full year.\nThe owner of every motor vehicle not exempted by section 168.012 or 168.28, shall, so long as it is subject to taxation within the state, list and register the same and pay the tax herein provided annually; provided, however, that any dealer in motor vehicles, to whom dealer's plates have been issued as provided in this chapter, coming into the possession of any such motor vehicle to be held solely for the purpose of sale or demonstration or both, shall be entitled to withhold the tax becoming due on such vehicle for the following year. When, thereafter, such vehicle is otherwise used or is sold, leased, or rented to another person, firm, corporation, or association, the tax for the remainder of the year, prorated on a monthly basis, shall become payable immediately.\nAny act required herein of a registered owner may be performed in the registered owner's behalf by a duly authorized agent. Any person having a lien upon, or claim to, any motor vehicle may pay any tax due thereon to prevent the penalty for delayed registration from accruing, but the registration certificate and number plates shall not be issued until legal ownership is definitely determined.\n(a) Unless otherwise specified in this chapter, the net proceeds of the registration tax imposed under this chapter must be collected by the commissioner, paid into the state treasury, and credited to the highway user tax distribution fund.\n(b) All fees collected under this chapter, unless otherwise specified, must be deposited in the driver and vehicle services operating account under section 299A.705.\nNo city shall impose any tax or license fee or bond of any kind for the operation of any motor vehicle on its streets if the person or company owning or operating such vehicle holds a certificate or permit to operate such vehicle issued in accordance with the provisions of Minnesota Statutes 1945, chapter 221, provided, that this section shall not apply to vehicles transporting persons for hire which are operated exclusively within any city or contiguous cities.\nMS 1949 [Repealed, 1973 c 218 s 9]\n[Obsolete, 1951 c 123 s 2]\n(a) Whenever an owner has registered a vehicle and paid the tax as provided in subdivisions 1 to 1g, on the basis of a selected gross weight of the vehicle and thereafter such owner desires to operate such vehicle with a greater gross weight than that for which the tax has been paid, such owner shall be permitted to reregister such vehicle by paying the additional tax due thereon for the remainder of the calendar year for which such vehicle has been reregistered, the additional tax computed pro rata by the month, 1/12 of the annual tax due for each month of the year remaining in the calendar year, beginning with the first day of the month in which such owner desires to operate the vehicle with the greater weight. In computing the additional tax as aforesaid, the owner shall be given credit for the unused portion of the tax previously paid computed pro rata by the month, 1/12 of the annual tax paid for each month of the year remaining in the calendar year beginning with the first day of the month in which such owner desires to operate the vehicle with the greater weight. An owner will be permitted one reduction of gross weight or change of registration per year, which will result in a refund. This refund will be prorated monthly beginning with the first day of the month after such owner applies to amend the registration. The application for amendment shall be accompanied by a fee of $3, and all fees shall be deposited in the highway user tax distribution fund. Provided, however, the owner of a vehicle may reregister the vehicle for a weight of more than 81,000 pounds for one or more 30-day periods. For each 30-day period, the additional tax shall be equal to 1/12 of the difference between the annual tax for the weight at which the vehicle is registered and reregistered.\n(b) This subdivision does not apply to the owner of a vehicle who pays the additional tax for excessive gross weight under section 169.86, subdivision 5a, when buying a permit to operate with the greater gross weight.\nMS 1971 [Repealed, 1973 c 218 s 9]\nBeginning in and for the first calendar year following the issuance and sale of bonds of the state of Minnesota under the provisions of the Constitution of the state of Minnesota, article 14, section 4, and after July 1, 1957, under the provisions of the Constitution of the state of Minnesota, article 14, section 11, the proceeds of the sale of which are to be used in the construction of bridges and approaches thereto forming a part of the trunk highway system, all motor vehicle taxes imposed by subdivisions 1 to 1g shall be increased by 5 percent; such increased rate of tax shall remain in effect until and including the calendar year following the year in which all principal and interest on all of any such bonds shall be paid in full. Immediately upon the payment in full of all interest and principal on all of any such bonds, the commissioner of management and budget shall certify that fact to the registrar of motor vehicles and the registrar shall, for the second calendar year and thereafter following receipt of such certification, cease to collect motor vehicle taxes at the increased rate prescribed by this subdivision.\nWhenever the tax on any vehicle as computed under the provisions of this section is found to be indivisible by $1, the registrar is authorized to adjust such tax to the nearest even dollar.\nMS 2022 [Repealed, 2023 c 25 s 190]\nMS 1980 [Repealed, 1981 c 363 s 58]\nNotwithstanding the provisions of subdivision 1, school buses used exclusively for the transportation of students under contract with a school district, used in connection with transportation for nonprofit educational institutions, or used as provided under section 169.4475, shall be taxed during each year of the vehicle life of such bus in the amount of $25.\nA motor vehicle licensed as a farm truck may be rented to any governmental unit for use in snow removal, flood, tornado, fire or other emergency or disaster situation without affecting its license status.\nNo person may register a motor vehicle that, along with the trailers and semitrailers customarily used with the same type of motor vehicle, has a taxable gross weight of at least 55,000 pounds and is subject to the use tax imposed by the Internal Revenue Code of 1954, section 4481, unless proof of payment of the use tax, if required and in a form as may be prescribed by the secretary of the treasury, is presented.\nFor every vehicle registration renewal required under this chapter, the commissioner shall collect a surcharge of $2.25. Surcharges collected under this subdivision must be credited to the driver and vehicle services technology account under section 299A.705.\nAs part of procedures for payment of the vehicle registration tax under this section, the commissioner shall allow a vehicle owner to add to the tax a $2 donation for the purposes of public information and education on anatomical gifts under section 171.075, for in-person transactions conducted by a deputy registrar appointed under section 168.33, subdivision 2. This subdivision applies to annual renewal registrations only, and does not apply to registrations authorized under sections 168.053 to 168.057, 168.127, 168.187, and 168.27.\n(a) Except as provided in this subdivision, the commissioner must not adjust the manufacturer's suggested retail price or destination charge for any vehicle in a subsequent registration period following initial registration in Minnesota.\n(b) The commissioner must adjust the registration tax amount of any vehicle to correct an error or omission that was made in determining or entering the registration tax amount or the destination charge amount. For a vehicle with a registration tax determined based on the actual sales price, the commissioner must adjust the registration tax within two years of the initial registration using one of the methods described in subdivision 1a, paragraph (c), clauses (1) to (2). The adjusted registration tax amount is effective starting with the vehicle's next registration period. The commissioner must not collect any amount that would have been paid but for the error or omission.\n(c) When the commissioner makes an adjustment to the registration tax amount pursuant to this subdivision, the commissioner must mail written notice to the owner of the vehicle stating that an adjustment was made to the registration tax amount, the reason for the adjustment, and contact information so that the owner may contact the department to ask questions.",
	"repealed": false
}