{
	"id": "136A.246",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.246",
	"title": "136A.246 DUAL TRAINING COMPETENCY GRANTS.",
	"text": "The commissioner shall make grants for the training of employees to achieve the competency standard for an occupation identified by the commissioner of labor and industry under section 175.45 and Laws 2014, chapter 312, article 3, section 21. An individual must, no later than the commencement of the training, be an employee of the employer seeking a grant to train that individual.\n(a) The terms defined in this subdivision apply to this section.\n(b) \"Competency standard\" has the meaning given in section 175.45, subdivision 2.\n(c) \"Eligible training\" means training provided by an eligible training provider that:\n(1) includes training to meet one or more identified competency standards;\n(2) is instructor-led for a majority of the training; and\n(3) results in the employee receiving an industry-recognized degree, certificate, or credential.\n(d) \"Eligible training provider\" means an institution:\n(1) operated by the Board of Trustees of the Minnesota State Colleges and Universities or the Board of Regents of the University of Minnesota;\n(2) licensed or registered as a postsecondary institution by the office; or\n(3) exempt from the provisions of section 136A.822 to 136A.834 or 136A.61 to 136A.71 as approved by the office.\n(e) \"Industry-recognized degrees, certificates, or credentials\" means:\n(1) certificates, diplomas, or degrees issued by a postsecondary institution;\n(2) registered apprenticeship certifications or certificates;\n(3) occupational licenses or registrations;\n(4) certifications issued by, or recognized by, industry or professional associations; and\n(5) other certifications as approved by the commissioner.\nAn employer or an organization representing the employer is eligible to apply for a grant to train employees if the employer has an employee who is in or is to be trained to be in an occupation for which a competency standard has been identified and the employee has not attained the competency standard prior to the commencement of the planned training. A grantee must have an agreement with an eligible training provider to provide eligible training prior to payment of the grant.\nThe Office of Higher Education and the Department of Labor and Industry must cooperate in maintaining an inventory of degree, certificate, and credential programs that provide training to meet competency standards. The inventory must be posted on each agency's website with contact information for each program. The postings must be updated periodically.\nApplications must be made to the commissioner on a form provided by the commissioner. The commissioner must, to the extent possible, make the application form as short and simple to complete as is reasonably possible. The commissioner shall establish a schedule for applications and grants. The application must include, without limitation:\n(1) the projected number of employee trainees;\n(2) the competency standard for which training will be provided;\n(3) the credential the employee will receive upon completion of training;\n(4) the name and address of the eligible training provider;\n(5) the period of the training; and\n(6) the cost of the training charged by the eligible training provider. The cost of training includes tuition, fees, and required and recommended books and materials.\nAn application may be made for training of employees of multiple employers either by the employers or by an organization on their behalf.\n(a) The commissioner shall make at least an approximately equal dollar amount of grants for training for employees whose work site is projected to be outside the metropolitan area as defined in section 473.121, subdivision 2, as for employees whose work site is projected to be within the metropolitan area.\n(b) In determining the award of grants, the commissioner must consider, among other factors:\n(1) the aggregate state and regional need for employees with the competency to be trained;\n(2) the competency standards developed by the commissioner of labor and industry as part of the Minnesota dual-training pipeline program;\n(3) the per employee cost of training;\n(4) the additional employment opportunities for employees because of the training;\n(5) the on-the-job training the employee receives;\n(6) the employer's demonstrated ability to recruit, train, and retain employees who are recent high school graduates or who recently passed high school equivalency tests;\n(7) projected increases in compensation for employees receiving the training;\n(8) the amount of employer training cost match, if required, on both a per employee and aggregate basis; and\n(9) the employer's demonstrated ability to recruit, train, and retain employees who are employees of color, American Indian employees, and employees with disabilities.\nA large employer must pay for at least 25 percent of the cost of training. For the purpose of this subdivision, a \"large employer\" means a business with more than $25,000,000 in annual gross revenue in the previous calendar year.\n(a) The commissioner shall pay the grant to the employer after the employer presents satisfactory evidence to the commissioner that the employer has paid the eligible training provider.\n(b) If an employer demonstrates that it is not able to pay for the training in advance, the commissioner shall make grant payments directly to the eligible training provider.\n(a) The maximum grant for an application for the cost of training is $150,000. The maximum grant for an application for trainee support is ten percent of the grant amount for the cost of training. The maximum total grant per application is $165,000. A grant may not exceed $6,000 per year for a maximum of $24,000 per employee.\n(b) An employee who is attending an eligible training provider that is an institution under section 136A.103 must apply for Pell and state grants as a condition of payment for training that employee under this section.\nCommencing in 2017, the commissioner shall annually by February 1 report on the activity of the grant program for the preceding fiscal year to the chairs of the legislative committees with jurisdiction over workforce policy and finance. At a minimum, the report must include:\n(1) research and analysis on the costs and benefits of the grants for employees and employers;\n(2) the number of employees who commenced training and the number who completed training; and\n(3) recommendations, if any, for changes to the program.\nA dual training account is created in the special revenue fund in the state treasury. The commissioner shall deposit into the account appropriations made for the purposes of this section. Money in the account is appropriated to the commissioner for the purposes for which it was appropriated.\nThe commissioner may expend up to five percent of the appropriation made for the purposes of this section for administration of this section.",
	"repealed": false
}