{
	"id": "252A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/252A.19",
	"title": "252A.19 MODIFICATION OF GUARDIANSHIP; RESTORATION TO LEGAL CAPACITY.",
	"text": "The commissioner shall serve as public guardian with all the powers awarded pursuant to the guardianship, until termination or modification by the court.\nThe commissioner, person subject to public guardianship, or any interested person may petition the appointing court or the court to which venue has been transferred:\n(1) for an order to remove the guardianship;\n(2) for an order to limit or expand the powers of the guardianship;\n(3) for an order to appoint a guardian under sections 524.5-101 to 524.5-502;\n(4) for an order to restore the person subject to public guardianship or protected person to full legal capacity;\n(5) to review de novo any decision made by the public guardian for or on behalf of a person subject to public guardianship or protected person; or\n(6) for any other order as the court may deem just and equitable.\nUpon the filing of the petition the court shall fix the time and place for the hearing. Notice of the filing of the petition and of the hearing shall be provided in the manner set forth in section 252A.081.\nThe commissioner shall, at the court's request, arrange for the preparation of a comprehensive evaluation of the person subject to public guardianship or protected person.\nUpon proof of the allegations of the petition the court shall enter an order removing the guardianship or limiting or expanding the powers of the guardianship or restoring the person subject to public guardianship or protected person to full legal capacity or may enter such other order as the court may deem just and equitable.\nThe county attorney may attend the hearing and may oppose the petition in the court and in the appellate courts if the county attorney deems it for the best interest of the public.\nThe attorney general may appear and represent the commissioner in such proceedings. The commissioner shall support or oppose the petition if the commissioner deems such action necessary for the protection and supervision of the person subject to public guardianship or protected person.\nIn all such proceedings, the protected person or person subject to public guardianship shall be afforded an opportunity to be represented by counsel, and if neither the protected person or person subject to public guardianship nor others provide counsel the court shall appoint counsel to represent the protected person or person subject to public guardianship.\nIn proceedings where private guardianship or conservatorship is being sought under sections 524.5-101 to 524.5-502, costs are reimbursable under section 524.5-502.",
	"repealed": false
}