{
	"id": "62Q.677",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.677",
	"title": "62Q.677 LIFETIME AND ANNUAL LIMITS.",
	"text": "Except as provided in subdivision 2, this section applies to a health plan company providing coverage under an individual or group health plan. For purposes of this section, essential health benefits is defined under section 62Q.81.\n(a) The prohibition on lifetime limits applies to grandfathered plans providing individual health plan coverage or group health plan coverage.\n(b) The prohibition and limits on annual limits apply to grandfathered plans providing group health plan coverage, but do not apply to grandfathered plans providing individual health plan coverage.\n(a) Except as provided in subdivisions 4 and 5, a health plan company offering coverage under an individual or group health plan shall not establish a lifetime limit on the dollar amount of essential health benefits for any individual.\n(b) Except as provided in subdivisions 4, 5, and 6, a health plan company shall not establish any annual limit on the dollar amount of essential health benefits for any individual.\n(a) Subdivision 3 does not prevent a health plan company from placing annual or lifetime dollar limits for any individual on specific covered benefits that are not essential health benefits as defined in section 62Q.81, subdivision 4, to the extent that the limits are otherwise permitted under applicable federal or state law.\n(b) Subdivision 3 does not prevent a health plan company from placing an annual or lifetime limit for services provided by out-of-network providers.\nThis section does not prohibit a health plan company from excluding all benefits for a given condition.\nFor plan or policy years beginning before January 1, 2014, for any individual, a health plan company may establish an annual limit on the dollar amount of benefits that are essential health benefits provided the limit is no less than the following:\n(1) for a plan or policy year beginning after September 22, 2010, but before September 23, 2011, $750,000;\n(2) for a plan or policy year beginning after September 22, 2011, but before September 23, 2012, $1,250,000; and\n(3) for a plan or policy year beginning after September 22, 2012, but before January 1, 2014, $2,000,000.\nIn determining whether an individual has received benefits that meet or exceed the allowable limits, a health plan company shall take into account only essential health benefits.\nFor plan or policy years beginning before January 1, 2014, a health plan is exempt from the annual limit requirements if the health plan is approved for a waiver from the requirements by the United States Department of Health and Human Services, but the exemption only applies for the specified period of time that the waiver from the United States Department of Health and Human Services is applicable.\n(a) At the time a health plan company receives a waiver from the United States Department of Health and Human Services, the health plan company shall notify prospective applicants and affected policyholders and the commissioner in each state where prospective applicants and any affected insured are known to reside.\n(b) At the time the waiver expires or is otherwise no longer in effect, the health plan company shall notify affected policyholders and the commissioner in each state where any affected insured is known to reside.\nA health plan company shall comply with all provisions of the Affordable Care Act with regard to reinstatement of coverage for individuals whose coverage or benefits under a health plan ended by reason of reaching a lifetime dollar limit on the dollar value of all benefits for the individual.\nThis section does not require compliance with any provision of the Affordable Care Act before the effective date provided for that provision in the Affordable Care Act. The commissioner shall enforce this section.",
	"repealed": false
}