{
	"id": "136A.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.103",
	"title": "136A.103 INSTITUTION ELIGIBILITY REQUIREMENTS.",
	"text": "(a) A postsecondary institution is eligible for state student aid under chapter 136A and sections 197.791 and 299A.45, if the institution is located in this state and:\n(1) is operated by this state or the Board of Regents of the University of Minnesota; or\n(2) is operated privately and, as determined by the office, meets the requirements of paragraph (b).\n(b) A private institution must:\n(1) maintain academic standards substantially equivalent to those of comparable institutions operated in this state;\n(2) be licensed or registered as a postsecondary institution by the office; and\n(3)(i) by July 1, 2010, participate in the federal Pell Grant program under Title IV of the Higher Education Act of 1965, Public Law 89-329, as amended; or\n(ii) if an institution was participating in state student aid programs as of June 30, 2010, and the institution did not participate in the federal Pell Grant program by June 30, 2010, the institution must require every student who enrolls to sign a disclosure form, provided by the office, stating that the institution is not participating in the federal Pell Grant program.\n(c) An institution that offers only graduate-level degrees or graduate-level nondegree programs is an eligible institution if the institution is licensed or registered as a postsecondary institution by the office.\n(d) An eligible institution under paragraph (b), clause (3), item (ii), that changes ownership as defined in section 136A.63, subdivision 2, must participate in the federal Pell Grant program within four calendar years of the first ownership change to continue eligibility.\n(e) An institution that loses its eligibility for the federal Pell Grant program is not an eligible institution. The office may terminate an institution's eligibility to participate in state student aid programs effective the date of the loss of eligibility for the federal Pell Grant program.\n(f) An institution must maintain adequate administrative and financial standards and compliance with all state statutes, rules, and administrative policies related to state financial aid programs.\n(g) The office may terminate a postsecondary institution's eligibility to participate in state student aid programs if the institution is terminated from participating in federal financial aid programs by the United States Department of Education for a violation of laws, regulations, or participation agreements governing federal financial aid programs.",
	"repealed": false
}