{
	"id": "16B.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.97",
	"title": "16B.97 GRANTS MANAGEMENT.",
	"text": "(a) A grant agreement is a written instrument or electronic document defining a legal relationship between a granting agency and a grantee when the principal purpose of the relationship is to transfer cash or something of value to the recipient to support a public purpose authorized by law instead of acquiring by professional or technical contract, purchase, lease, or barter property or services for the direct benefit or use of the granting agency.\n(b) This section does not apply to general obligation grants as defined by section 16A.695 and capital project grants to political subdivisions as defined by section 16A.86.\nThe commissioner shall provide leadership and direction for policy related to grants management in Minnesota in order to foster more consistent, streamlined interaction between executive agencies, funders, and grantees that will enhance access to grant opportunities and information and lead to greater program accountability and transparency. The commissioner has the duties and powers stated in this section. Executive agencies shall fully cooperate with the commissioner in the creation, management, and oversight of state grants and must do what the commissioner requires under this section. The commissioner may adopt rules to carry out grants governance, oversight, and management.\nThe commissioner has the authority to:\n(1) review grants management practices and establish and enforce policy and procedure improvements;\n(2) sponsor, support, and facilitate innovative and collaborative grants management projects with public and private organizations;\n(3) review, recommend, and implement alternative strategies for grants management;\n(4) collect and disseminate information, issue reports relating to grants management, and sponsor and conduct conferences and studies;\n(5) participate in conferences and other appropriate activities related to grants management issues;\n(6) suspend or debar grantees from eligibility to receive state-issued grants for up to three years for reasons specified in Minnesota Rules, part 1230.1150, subpart 2. A grantee may obtain an administrative hearing pursuant to sections 14.57 to 14.62 before a suspension or debarment is effective by filing a written request for hearing within 20 days of notification of suspension or debarment;\n(7) establish offices for the purpose of carrying out grants governance, oversight, and management; and\n(8) require granting agencies to submit grant solicitation documents for review prior to issuance at dollar levels determined by the commissioner.\n(a) The commissioner shall:\n(1) create general grants management policies and procedures that are applicable to all executive agencies. The commissioner may approve exceptions to these policies and procedures for particular grant programs. Exceptions shall expire or be renewed after five years. Executive agencies shall retain management of individual grants programs;\n(2) provide a central point of contact concerning statewide grants management policies and procedures;\n(3) serve as a resource to executive agencies in such areas as training, evaluation, collaboration, and best practices in grants management;\n(4) ensure grants management needs are considered in the development, upgrade, and use of statewide administrative systems and leverage existing technology wherever possible;\n(5) oversee and approve future professional and technical service contracts and other information technology spending related to executive agency grants management systems and activities;\n(6) provide a central point of contact for comments about executive agencies violating statewide grants governance policies and about fraud and waste in grants processes;\n(7) forward received comments to the appropriate agency for further action, and may follow up as necessary;\n(8) provide a single listing of all available executive agency competitive grant opportunities and resulting grant recipients;\n(9) selectively review development and implementation of executive agency grants, policies, and practices; and\n(10) selectively review executive agency compliance with best practices.\n(b) The commissioner may determine that it is cost-effective for agencies to develop and use shared grants management technology systems. This system would be governed under section 16E.01, subdivision 3, paragraph (b).\nData maintained by the commissioner that identify a person providing comments to the commissioner under subdivision 4, paragraph (a), clauses (6) and (7), are private and nonpublic data but may be shared with the executive agency that is the subject of the comments.",
	"repealed": false
}