{
	"id": "260C.188",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.188",
	"title": "260C.188 CHILDREN IN CUSTODY; RESPONSIBILITY FOR MEDICAL CARE.",
	"text": "If a child is taken into custody as provided in section 260C.175 and detained in a local juvenile secure detention facility or a shelter care facility, the child's county of residence shall pay the costs of medical services provided to the child during the period of time the child is residing in the facility. The county of residence is entitled to reimbursement from the child or the child's family for payment of medical bills to the extent that the child or the child's family has the ability to pay for the medical services. If there is a disagreement between the county and the child or the child's family concerning the ability to pay or whether the medical services were necessary, the court with jurisdiction over the child shall determine the extent, if any, of the child's or the family's ability to pay for the medical services or whether the services are necessary. If the child is covered by health or medical insurance or a health plan when medical services are provided, the county paying the costs of medical services has a right of subrogation to be reimbursed by the insurance carrier or health plan for all amounts spent by it for medical services to the child that are covered by the insurance policy or health plan, in accordance with the benefits, limitations, exclusions, provider restrictions, and other provisions of the policy or health plan. The county may maintain an action to enforce this subrogation right. The county does not have a right of subrogation against the medical assistance program or the MinnesotaCare program.\nAs part of its intake procedure for children, the official having custody over the child shall ask the child or the child's family, as appropriate, whether the child has health coverage. If the child has coverage under a policy of accident and health insurance regulated under chapter 62A, a health maintenance contract regulated under chapter 62D, a group subscriber contract regulated under chapter 62C, a health benefit certificate regulated under chapter 64B, a self-insured plan, or other health coverage, the child or the child's family, as appropriate, shall provide to the official having custody over the child the name of the carrier or administrator and other information and authorizations necessary for the official having custody over the child to obtain specific information about coverage.\nA county board may authorize the officials having custody over children to fulfill the county board's obligation to provide the medical aid required by subdivision 1 in accordance with the terms of the health plan covering the child, where possible, subject to any rules and exceptions provided by the county board. The official having custody over a child has no obligation to the child or to the child's family to obtain the child's health care in accordance with the child's health coverage.\nSubdivisions 1, 2, and 3 apply to any medical aid, including dental care, provided to children held in custody by the county as described in subdivision 1.",
	"repealed": false
}