{
	"id": "62E.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.15",
	"title": "62E.15 SOLICITATION OF ELIGIBLE PERSONS.",
	"text": "The association pursuant to a plan approved by the commissioner shall disseminate appropriate information to the residents of this state regarding the existence of the comprehensive health insurance plan and the means of enrollment. Means of communication may include use of the press, radio and television, as well as publication in appropriate state offices and publications.\nThe association shall devise and implement means of maintaining public awareness of the provisions of sections 62E.01 to 62E.19 and shall administer these sections in a manner which facilitates public participation in the state plan.\nThe association may annually verify the uninsurability of each policyholder to insure that only eligible persons are enrolled in the plan.\nThe writing carrier shall pay an agent's referral fee of $50 to each insurance agent who refers an applicant to the state plan, if the application is accepted. Selling or marketing of qualified state plans shall not be limited to the writing carrier or its agents. The referral fees shall be paid by the writing carrier from money received as premiums for the state plan.\nEvery insurer and health maintenance organization which rejects or applies underwriting restrictions to an applicant for a plan of health coverage shall: (1) provide the applicant with a written notice of rejection or the underwriting restrictions applied to the applicant in a manner consistent with the requirements in section 72A.499; (2) notify the applicant of the existence of the state plan, the requirements for being accepted in it, and the procedure for applying to it; and (3) provide the applicant with written materials explaining the state plan in greater detail. This written material shall be provided by the association to every insurer at no charge.\nEvery insurer and health maintenance organization before issuing a conversion policy or contract of health insurance shall:\n(1) notify the applicant of the existence of the state plan, the requirements for being accepted in it, the procedure for applying to it, and the plan rates; and\n(2) provide the applicant with written materials explaining the state plan in greater detail. This written material shall be provided by the association to every insurer and health maintenance organization at no charge.\nEvery insurer and health maintenance organization which provides health coverage to an insured through a conversion plan shall annually:\n(1) notify the insured of the existence of the state plan, the requirements for being accepted in it, the procedure for applying to it, and the plan rates; and\n(2) provide the applicant with written materials explaining the state plan in greater detail. This written material shall be provided by the association to every insurer and health maintenance organization at no charge.\nFor Medicare supplement conversion policies issued prior to August 1, 1992, the requirements of subdivisions 5 and 6 apply only when the conversion rates offered to the applicant by the insurer or health maintenance organization exceed the association rates.",
	"repealed": false
}