{
	"id": "45.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.32",
	"title": "45.32 INSTRUCTORS.",
	"text": "Each course of study, except on-demand courses, must have an instructor who is qualified by education, training, or experience to ensure competent instruction. In the case of an on-demand course, this requirement applies to the author of the course material. Failure to have only qualified instructors teach at an approved course offering will result in loss of course approval. A person applying for approval as an instructor must make available upon request such records and data required by the commissioner to administer the provisions and further the purposes of this chapter.\nQualified continuing education instructors must have one of the following qualifications:\n(1) a four-year degree in any area plus two years practical experience in the subject area being taught;\n(2) five years of practical experience in the subject area being taught; or\n(3) a college or graduate degree in the subject area being taught.\nIn addition to qualifying under subdivision 2, an instructor of the Minnesota Supervisor/Trainee Appraiser Course offered as continuing education must:\n(1) be licensed in good standing as either a certified residential real property appraiser or a certified general real property appraiser, and must have been so licensed for the three-year period immediately preceding the individual's application to become an instructor of the Minnesota Supervisor/Trainee Appraiser Course; and\n(2) not have been the subject of any license or certificate suspension or revocation, or been prohibited from supervising activities in this state or any other state within the three years immediately preceding the individual's application to become an instructor of the Minnesota Supervisor/Trainee Appraiser Course.\nQualified prelicense instructors must have one of the following qualifications:\n(1) a four-year degree in the industry for which the course is being taught;\n(2) a four-year degree with three years full-time experience in the industry for which the course is being taught;\n(3) a four-year degree with three years full-time experience in the business or profession relating to the subject being taught;\n(4) a postgraduate degree and completion of 45 hours of continuing education in the industry for which the course is being taught;\n(5) a two-year degree in the industry for which the education is being given and completion of 45 hours of continuing education in the industry for which the course is being taught;\n(6) a two-year degree or certificate with five years full-time experience in the industry for which the course is being taught;\n(7) a degree or certificate with five years full-time experience in the business or profession relating to the subject being taught; or\n(8) eight years of experience in the subject area being taught, gained in the eight years immediately preceding the first course offering taught.\nIn addition to qualifying under subdivision 3, an instructor of the Minnesota Supervisor/Trainee Appraiser Course offered as prelicense education must:\n(1) be licensed in good standing as either a certified residential real property appraiser or a certified general real property appraiser, and must have been so licensed for the three-year period immediately preceding the individual's application to become an instructor of the Minnesota Supervisor/Trainee Appraiser Course; and\n(2) not have been the subject of any license or certificate suspension or revocation, or been prohibited from supervising activities in this state or any other state within the three years immediately preceding the individual's application to become an instructor of the Minnesota Supervisor/Trainee Appraiser Course.\nApproved instructors are responsible for:\n(1) compliance with all laws and rules relating to industry education;\n(2) providing students with current and accurate information;\n(3) maintaining an atmosphere conducive to learning in the classroom;\n(4) in conjunction with the coordinator, assuring and certifying attendance of students enrolled in courses;\n(5) providing assistance to students and responding to questions relating to course materials; and\n(6) attending the workshops or instructional programs that are required by the commissioner.",
	"repealed": false
}