{
	"id": "136A.1241",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1241",
	"title": "136A.1241 FOSTERING INDEPENDENCE HIGHER EDUCATION GRANTS.",
	"text": "The office must establish a grant program for individuals who satisfy the eligibility requirements under subdivision 3. Using available FAFSA or other state aid data, the office shall identify and inform eligible individuals, and the institutions for which the individuals have been accepted or are attending, of their eligibility for the foster grant. This program is established to provide an individual who is currently or was formerly in foster care with foster grants for up to five years for higher education costs.\n(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Adoption\" means adoption of an individual who has been in the care and custody of a responsible social services agency or Tribal social services agency and in foster care.\n(c) \"Eligible institution\" means an eligible public institution or an eligible private institution.\n(d) \"Eligible private institution\" or \"private institution\" means an institution eligible for state student aid under section 136A.103, paragraph (a), clause (2).\n(e) \"Eligible public institution\" or \"public institution\" means an institution operated by the Board of Trustees of the Minnesota State Colleges and Universities or the Board of Regents of the University of Minnesota.\n(f) \"Foster care\" has the meaning given in section 260C.007, subdivision 18.\n(g) \"Foster grant\" means a grant under this section.\n(h) \"Office\" means the Office of Higher Education.\n(i) \"Recognized cost of attendance\" means the amount calculated under subdivision 4.\n(j) \"Responsible social services agency\" has the meaning given in section 260C.007, subdivision 27a.\n(k) \"Tribal social services agency\" has the meaning given in section 260.755, subdivision 21.\n(a) An individual who is eligible for the Education and Training Voucher Program is eligible for a foster grant.\n(b) If the individual is not eligible for the Education and Training Voucher Program, in order to receive a foster grant, an individual must:\n(1) meet the definition of a resident student under section 136A.101, subdivision 8;\n(2) be at least 13 years of age but fewer than 27 years of age;\n(3) after the individual's 13th birthday, be in or have been in foster care in Minnesota before, on, or after June 27, 2021, including any of the following:\n(i) placement in foster care at any time while 13 years of age or older;\n(ii) adoption from foster care at any time after reaching 13 years of age; or\n(iii) placement from foster care with a permanent legal custodian at any time after reaching 13 years of age;\n(4) have graduated from high school or completed the equivalent as approved by the Department of Education;\n(5) have been accepted for admission to, or be currently attending, an eligible institution;\n(6) have submitted a FAFSA;\n(7) be meeting satisfactory academic progress as defined under section 136A.101, subdivision 10;\n(8) not be in default, as defined by the office, of any federal or state student educational loan;\n(9) not be more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement or, if the applicant is more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement, be complying with a written payment agreement under section 518A.69 or order for arrearages; and\n(10) not have been convicted of or pled nolo contendere or guilty to a crime involving fraud in obtaining federal Title IV funds within the meaning of Code of Federal Regulations, subtitle B, chapter VI, part 668, subpart C.\n(a) The recognized cost of attendance for a public institution has the meaning given in Code of Federal Regulations, title 20, chapter 28, subchapter IV, part F, section 1087ll.\n(b) The recognized cost of attendance for a private institution equals the lesser of:\n(1) the cost of attendance for the institution as calculated under Code of Federal Regulations, title 20, chapter 28, subchapter IV, part F, section 1087ll; or\n(2) for two-year programs, an amount equal to the highest recognized cost of attendance charged at a public two-year institution, or for four-year programs, an amount equal to the highest recognized cost of attendance at a public university.\n(a) Each student shall be awarded a foster grant based on the federal need analysis. Applicants are encouraged to apply for all other sources of financial aid. The amount of the foster grant must be equal to the applicant's recognized cost of attendance after accounting for:\n(1) the results of the federal need analysis;\n(2) the amount of a federal Pell Grant award for which the applicant is eligible;\n(3) the amount of the state grant;\n(4) the Federal Supplemental Educational Opportunity Grant;\n(5) the sum of all Tribal scholarships;\n(6) the amount of any other state and federal gift aid;\n(7) the Education and Training Voucher Program;\n(8) extended foster care benefits under section 260C.451;\n(9) the amount of any private grants or scholarships, excluding grants and scholarships provided by the private institution of higher education in which the eligible student is enrolled; and\n(10) for public institutions, the sum of all institutional grants, scholarships, tuition waivers, and tuition remission amounts.\n(b) The foster grant shall be paid directly to the eligible institution where the student is enrolled.\n(c) An eligible private institution may opt out of participating in the foster grant program established under this section. To opt out, the institution shall provide notice to the office by March 1 for the next academic year. An institution that opts out of participating, but participated in the program a previous year, must hold harmless currently enrolled recipients by continuing to provide the benefit under paragraph (d) as long as the student remains eligible.\n(d) An eligible private institution that does not opt out under paragraph (c) and accepts the student's application to attend the institution must provide institutional grants, scholarships, tuition waivers, or tuition remission in an amount equal to the difference between:\n(1) the institution's cost of attendance as calculated under subdivision 4, paragraph (b), clause (1); and\n(2) the sum of the foster grant under this subdivision and the sum of the amounts in paragraph (a), clauses (1) to (9).\n(e) An undergraduate student who is eligible may apply for and receive a foster grant in any year of undergraduate study unless the student has obtained a baccalaureate degree or received foster grant funds for a period of ten full-time semesters or the equivalent for a four-year undergraduate degree. A foster grant student enrolled in a two-year degree, certificate, or diploma program may apply for and receive a foster grant in any year of undergraduate study unless the student has obtained a baccalaureate degree or received foster grant funds for a period of six full-time semesters or the equivalent.\n(f) Foster grants may be awarded to an eligible student for four quarters, three semesters, or the equivalent during the course of a single fiscal year. In calculating the award amount, the office must use the same calculation it would for any other term.\n(g) The commissioner shall establish a priority application deadline.\n(h) If there is a projected shortfall in available resources, the commissioner must proportionately reduce awards to keep spending within available resources.\n(i) Applicants applying after the priority deadline for whom the office has received a completed application must be placed on a waiting list in order of application completion date. Awards must be made on a first-come, first-served basis in the order complete applications are received. Students who received the Fostering Independence Grant in the previous year shall be given priority. If there are multiple applications with identical completion dates, those applications must be further sorted by application receipt date. Awards must be made to eligible students until the appropriation is expended.\n(a) The office shall, by September 1, 2022, and September 1 each year thereafter, prepare and provide the information to be disseminated by responsible social services agencies, Tribal social services agencies, the office, the Department of Human Services, and eligible state and private institutions that:\n(1) describes the availability of the program established under this section;\n(2) explains how to participate in the program; and\n(3) includes information on all available federal and state grants identified under subdivision 5.\n(b) The office shall maintain and annually update the list of eligible private institutions that opt out under subdivision 5, paragraph (c), and post the list of the institutions on the office's website.\nThe office shall assist foster grant applicants eligible under subdivision 3 by providing assistance in:\n(1) completing the foster grant application; and\n(2) accessing and applying for available federal and state financial aid resources under subdivision 5.\n(a) The office shall prepare an anonymized report to be submitted annually to the chairperson and minority chairperson of the legislative committees with jurisdiction over higher education that contains:\n(1) the number of students receiving foster grants and the institutions attended; and\n(2) annual retention and graduation data on students receiving foster grants.\n(b) The report required under this subdivision may be combined with other legislatively required reporting. If submitted as a separate report, the report must be submitted by January 15.",
	"repealed": false
}