{
	"id": "142A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.02",
	"title": "142A.02 CREATION OF THE DEPARTMENT OF CHILDREN, YOUTH, AND FAMILIES.",
	"text": "The Department of Children, Youth, and Families is established. The commissioner of children, youth, and families is hereby constituted the \"state agency\" for the purposes of Title IV of the Social Security Act of the United States and the laws of this state.\nThe restructuring of agencies under Laws 2023, chapter 70, article 12, must be conducted in accordance with sections 15.039 and 43A.045.\n(a) Personnel relating to the functions assigned to the commissioner in section 142A.03 are transferred to the department effective 30 days after approval by the commissioner.\n(b) Before the commissioner's appointment, personnel relating to the functions in this section may be transferred beginning July 1, 2024, with 30 days' notice from the commissioner of management and budget.\n(c) The following protections shall apply to employees who are transferred to the department from state agencies:\n(1) no transferred employee shall have their employment status and job classification altered as a result of the transfer;\n(2) transferred employees who were represented by an exclusive representative prior to the transfer shall continue to be represented by the same exclusive representative after the transfer;\n(3) any applicable collective bargaining agreements with exclusive representatives shall continue in full force and effect for transferred employees after the transfer;\n(4) when an employee in a temporary unclassified position is transferred to the department, the total length of time that the employee has served in the appointment shall include all time served in the appointment at the transferring agency and the time served in the appointment at the department. An employee in a temporary unclassified position who was hired by a transferring agency through an open competitive selection process in accordance with a policy enacted by the commissioner of management and budget shall be considered to have been hired through such process after the transfer;\n(5) the state shall have the obligation to meet and negotiate with the exclusive representatives of the transferred employees about any proposed changes affecting or relating to the transferred employees' terms and conditions of employment to the extent that the proposed changes are not addressed in the applicable collective bargaining agreement; and\n(6) in the event that the state transfers ownership or control of any facilities, services, or operations of the department to another private or public entity by subcontracting, sale, assignment, lease, or other transfer, the state shall require as a written condition of the transfer of ownership or control the following:\n(i) employees who perform work in the facilities, services, or operations must be offered employment with the entity acquiring ownership or control before the entity offers employment to any individual who was not employed by the transferring agency at the time of the transfer; and\n(ii) the wage and benefit standards of the transferred employees must not be reduced by the entity acquiring ownership or control through the expiration of the collective bargaining agreement in effect at the time of the transfer or for a period of two years after the transfer, whichever is longer.\nThere is no liability on the part of, and no cause of action arises against, the state of Minnesota or its officers or agents for any action or inaction of any entity acquiring ownership or control of any facilities, services, or operations of the department.\n(d) To the extent that departmental changes affect the operations of any school district or charter school, employers have the obligation to bargain about any changes affecting or relating to employees' terms and conditions of employment if the changes are necessary during or after the term of an existing collective bargaining agreement.",
	"repealed": false
}