{
	"id": "150A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.21",
	"title": "150A.21 REMOVABLE DENTAL PROSTHESES; OWNER IDENTIFICATION.",
	"text": "Every complete upper and lower denture and removable dental prosthesis fabricated by a dentist licensed under section 150A.06, or fabricated pursuant to the dentist's or dental therapist's work order, shall be marked with the name and Social Security number of the patient for whom the prosthesis is intended. The markings shall be done during fabrication and shall be permanent, legible and cosmetically acceptable. The exact location of the markings and the methods used to apply or implant them shall be determined by the dentist or dental laboratory fabricating the prosthesis. If in the professional judgment of the dentist or dental laboratory, this identification is not practicable, identification shall be provided as follows:\n(a) The Social Security number of the patient may be omitted if the name of the patient is shown;\n(b) The initials of the patient may be shown alone, if use of the name of the patient is impracticable;\n(c) The identification marks may be omitted in their entirety if none of the forms of identification specified in clauses (a) and (b) are practicable or clinically safe.\nAny removable dental prosthesis in existence prior to August 1, 1978, which was not marked in accordance with subdivision 1 at the time of its fabrication, shall be so marked at the time of any subsequent rebasing.\nThe commissioner of health shall provide technical assistance for marking methods and materials and other matters necessary to effectuate the provisions of this section.\nFailure of any dentist or dental therapist to comply with this section shall be deemed to be a violation for which the dentist or dental therapist may be subject to proceedings pursuant to section 150A.08, provided the dentist is charged with the violation within two years of initial insertion of the dental prosthetic device.",
	"repealed": false
}