{
	"id": "60A.951",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.951",
	"title": "60A.951 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 60A.951 to 60A.956.\n\"Authorized person\" means the county attorney, sheriff, or chief of police responsible for investigations in the county where the suspected insurance fraud occurred; the superintendent of the Bureau of Criminal Apprehension; the commissioner of commerce; the Commerce Fraud Bureau; the commissioner of labor and industry; the attorney general; or any duly constituted criminal investigative department or agency of the United States.\n\"Commissioner\" means the commissioner of commerce for insurers regulated by the commissioner of commerce, and means the commissioner of health for insurers regulated by the commissioner of health.\n\"Insurance fraud\" occurs when a person presents or causes to be presented to any insurer, or prepares with knowledge or belief that it will be so presented, a written or oral statement, including a computer-generated document, an electronic claim filing, or other electronic transmission, that contains materially false or misleading information, or a material and misleading omission, concerning:\n(1) an application for the issuance of an insurance policy;\n(2) the rating of an insurance policy;\n(3) a claim for payment, reimbursement, or benefits payable under an insurance policy to an insured, a beneficiary, or a third party;\n(4) premiums on an insurance policy; or\n(5) payments made in accordance with the terms of an insurance policy.\n\"Insurance policy\" or \"policy\" means the written instrument in which are set forth the terms of any certificate of insurance, binder of coverage, or contract of insurance, including a certificate, binder, or contract issued by a state-assigned risk plan; benefit plan; nonprofit hospital service plan; motor club service plan; or surety bond, cash bond, or any other alternative to insurance authorized by the Minnesota Financial Responsibility Act.\n\"Insurance professional\" means sales agents, agencies, managing general agents, brokers, producers, claims representatives, adjusters, and third-party administrators.\n\"Insurance transaction\" means a transaction by, between, or among:\n(1) an insurer or a person who acts on behalf of an insurer; and\n(2) an insured, claimant, applicant for insurance, public adjuster, insurance professional, practitioner who performs professional services as defined by section 319B.02, subdivision 19, attorney, or any person who acts on behalf of any of the foregoing for the purpose of obtaining insurance or reinsurance, calculating insurance premiums, submitting a claim, negotiating or adjusting a claim, or otherwise obtaining insurance, self-insurance, or reinsurance, or obtaining the benefits or annuities thereof or therefrom.\n\"Insurer\" means insurance company, risk retention group as defined in section 60E.02, service plan corporation as defined in section 62C.02, health maintenance organization as defined in section 62D.02, community integrated service network as defined in section 62N.02, fraternal benefit society regulated under chapter 64B, township mutual company regulated under chapter 67A, joint self-insurance plan or multiple employer trust regulated under chapter 60F, 62H, or section 471.617, subdivision 2, persons administering a self-insurance plan as defined in section 60A.23, subdivision 8, clause (2), paragraphs (a) and (d), and the Workers' Compensation Reinsurance Association established in section 79.34.\n\"Person\" means a natural person, company, corporation, unincorporated association, partnership, professional corporation, and any other entity.\n\"Premium\" means consideration paid or payable for coverage under an insurance policy. Premium includes any payment, whether due within the insurance policy term or otherwise; any deductible payment, whether advanced by the insurer or insurance professional and subject to reimbursement by the insured or otherwise; any self-insured retention or payment, whether advanced by the insurer or insurance professional and subject to reimbursement by the insured or otherwise; and any collateral or security to be provided to collateralize any such obligations to pay.\n\"Relevant information\" includes, but is not limited to:\n(1) pertinent insurance policy information, including the application for a policy;\n(2) policy premium payment records;\n(3) a history of previous claims made by the insured including, where the insured is a corporation, limited liability company, or partnership, a history of claims by a subsidiary or any affiliates, and a history of claims of any other business association in which individual officers or partners or their family members are known to be involved;\n(4) material relating to the investigation, including the statement of any person and the proof of loss;\n(5) billing records; and\n(6) any other information which an authorized person identifies and which appears reasonably related to the investigation.",
	"repealed": false
}