{
	"id": "174.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.24",
	"title": "174.24 PUBLIC TRANSPORTATION PARTICIPATION PROGRAM.",
	"text": "A public transportation participation program is established to carry out the objectives stated in section 174.21 by providing financial assistance from the state, including the greater Minnesota transit account established in section 16A.88, to eligible recipients outside of the metropolitan area.\n(a) The commissioner must develop a greater Minnesota transit investment plan that contains a goal of meeting at least 80 percent of total transit service needs in greater Minnesota by July 1, 2015, and meeting at least 90 percent of total transit service needs in greater Minnesota by July 1, 2025.\n(b) The plan must include, but is not limited to, the following:\n(1) an analysis of ridership and total transit service needs throughout greater Minnesota;\n(2) a calculation of the level and type of service required to meet total transit service needs, for the transit system classifications as provided under subdivision 3b, paragraph (c), of large urbanized area, small urbanized area, rural area, elderly and disabled service, and complementary paratransit service (ADA);\n(3) an analysis of costs and revenue options;\n(4) a plan to reduce total transit service needs as specified in this subdivision; and\n(5) identification of the operating and capital costs necessary to meet 100 percent of the greater Minnesota transit targeted and projected bus service hours, as identified in the greater Minnesota transit plan, for 2010, 2015, 2020, 2025, and 2030.\n(c) The plan must specifically address special transportation service ridership and needs. The plan must also provide that recipients of operating assistance under this section provide fixed route public transportation service without charge for disabled veterans in accordance with subdivision 7.\nAny legislatively established public transportation commission or authority, any county or statutory or home rule charter city providing financial assistance to or operating public transportation, any private operator of public transportation, any tribal government, or any combination thereof is eligible to receive financial assistance through the public transportation participation program. Except as provided in subdivision 2b for assistance provided from federal funds, eligible recipients must be located outside of the metropolitan area.\nActivities eligible for assistance under the program include but are not limited to:\n(1) planning and engineering design for transit services and facilities;\n(2) capital assistance to purchase or refurbish transit vehicles and other capital expenditures necessary to provide a transit service;\n(3) operating assistance as provided under subdivision 3b; and\n(4) other assistance for public transportation services that furthers the purposes of section 174.21.\n(a) The commissioner may accept and disburse federal funds received and appropriated under section 174.23, subdivision 1, as an additional source of funds for implementing the public transportation participation program established in this section. This authority includes, but is not limited to:\n(1) adopting administrative rules to establish financial assistance allocation priorities, identify factors to consider in reviewing an applicant's management plan, evaluate a request for financial assistance, and determine the amount of financial assistance to be provided; and\n(2) establishing project selection criteria under the United States Code, title 49, section 5311, state management plan as approved by the Federal Transit Administration, United States Department of Transportation.\n(b) If the commissioner accepts and disburses federal funds as provided in paragraph (a), the commissioner shall:\n(1) maintain separate accounts for (i) state sources of funds, and (ii) federal sources of funding; and\n(2) ensure that all state sources of funds are only used for assistance to eligible recipients as provided in subdivision 2.\nPayment of financial assistance shall be by contract between the commissioner and an eligible recipient.\n[Repealed, 1984 c 654 art 3 s 153 subd 1]\n(a) Prior to distributing operating assistance to eligible recipients for any contract period, the commissioner must place all recipients into one of the following classifications: large urbanized area service, small urbanized area service, rural area service, elderly and disabled service, and complementary paratransit service (ADA).\n(b) The commissioner must distribute the operating assistance amount under this section so that the percentage from local sources paid by any recipient will not exceed the following percentage for that recipient's classification, except as provided in this subdivision:\n(1) for urbanized area service and small urban area service, 20 percent;\n(2) for rural area service, 15 percent; and\n(3) for elderly and disabled service and complementary paratransit service (ADA), 15 percent.\n(c) For purposes of this subdivision, \"local sources\" means all local sources of funds and includes all operating revenue, tax levies, and contributions from public funds.\n(d) If a recipient informs the commissioner in writing after the establishment of these percentages but prior to the distribution of financial assistance for any year that paying its designated percentage of the operating assistance amount from local sources will cause undue hardship, the commissioner may reduce the percentage to be paid from local sources by the recipient and increase the percentage to be paid from local sources by one or more other recipients inside or outside the classification. However, the commissioner may not reduce or increase any recipient's percentage under this paragraph for more than two years successively. If for any year the funds appropriated to the commissioner to carry out the purposes of this section are insufficient to allow the commissioner to pay the state share of the operating assistance amount as provided in this paragraph, the commissioner must reduce the state share in each classification to the extent necessary.\nThe commissioner must determine the total cost of any planning and engineering design, capital assistance, other capital expenditures, and other assistance for public transportation services that furthers the purposes of section 174.21 for any public transportation system receiving or applying for the assistance in accordance with generally accepted accounting principles. The percentage of local sources paid by any recipient must not exceed 20 percent of the awarded amount. To be eligible for non-operating-cost financial assistance, an applicant or recipient must provide to the commissioner all financial records and other information and must permit any inspection reasonably necessary to determine total cost and the amount of assistance that may be paid to the applicant or recipient. When more than one county or municipality contributes assistance to the operation of a public transportation system, the commissioner must identify one as a lead agency for the purpose of receiving money under this section. The commissioner has the sole discretion to determine the amount of state funds distributed to any recipient for non-operating-cost assistance.\n[Repealed, 1984 c 654 art 3 s 153 subd 1]\n[Repealed, 2013 c 127 s 71]\nPayments for planning and engineering design, eligible capital assistance, operating assistance, and other eligible assistance for public transportation services furthering the purposes of section 174.21 shall be made in an appropriate manner as determined by the commissioner, except that payments for operating assistance shall be made quarterly. The first quarterly payment for operating assistance shall be made no later than the last business day of the first month of the contract.\n(a) Any legislatively established public transportation commission or authority, county, or statutory or home rule charter city that (1) is located outside the metropolitan area, and (2) provides financial assistance to or operates public transportation, may provide paratransit as a complement to fixed route service as required in United States Code, title 42, section 12143, as amended through December 31, 1994, outside its jurisdictional boundaries.\n(b) Service described in paragraph (a) may be provided only if (1) the commission, authority, county, or city enters into a contract for the service with a political subdivision, individual, or private entity for the service, and (2) the contract requires full or partial payment to the commission, authority, county, or city for the cost of the service.\nAn eligible recipient of operating assistance under this section, who contracts or has contracted to provide fixed route public transportation, shall provide fixed route public transportation service free of charge for veterans, as defined in section 197.447, certified as disabled. For purposes of this section, \"certified as disabled\" means certified in writing by the United States Department of Veterans Affairs or the state commissioner of veterans affairs as having a permanent service-connected disability.\nThe portion of the cost to provide financial assistance for the Greater Minnesota Transit component of the Northstar Commuter Rail is exempt from the requirements in subdivision 1.",
	"repealed": false
}