{
	"id": "260B.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.181",
	"title": "260B.181 PLACE OF TEMPORARY CUSTODY; SHELTER CARE FACILITY.",
	"text": "A child taken into custody pursuant to sections 260B.175 and 260C.175 may be detained for up to 24 hours in a shelter care facility, secure detention facility, or, if there is no secure detention facility available for use by the county having jurisdiction over the child, in a jail or other facility for the confinement of adults who have been charged with or convicted of a crime in quarters separate from any adult confined in the facility which has been approved for the detention of juveniles by the commissioner of corrections. At the end of the 24-hour detention any child requiring further detention may be detained only as provided in this section.\nNotwithstanding the provisions of subdivision 1, if the child had been taken into custody pursuant to section 260B.175, subdivision 1, clause (a), and is not alleged to be delinquent, the child shall be detained in the least restrictive setting consistent with the child's health and welfare and in closest proximity to the child's family as possible. Placement may be with a child's relative, a designated caregiver under chapter 257A, or in a shelter care facility. The placing officer shall comply with this section and shall document why a less restrictive setting will or will not be in the best interests of the child for placement purposes.\nIf the child had been taken into custody and detained as one who is alleged to be delinquent or a juvenile petty offender by reason of:\n(1) having committed an offense which would not constitute a violation of a state law or local ordinance if the child were an adult; or\n(2) having been previously adjudicated delinquent or a juvenile petty offender, or conditionally released by the juvenile court without adjudication, has violated probation, parole, or other field supervision under which the child had been placed as a result of behavior described in this subdivision; the child may be placed only in a shelter care facility.\nIf a child is taken into custody as one who:\n(1) has allegedly committed an act which would constitute a violation of a state law or a local ordinance if the child were an adult; or\n(2) is reasonably believed to have violated the terms of probation, parole, or other field supervision under which the child had been placed as a result of behavior described under clause (1);\nthe child may be detained in a shelter care or secure juvenile detention facility. If the child cannot be detained in another type of detention facility, and if there is no secure juvenile detention facility or existing acceptable detention alternative available for juveniles within the county, a child described in this subdivision may be detained up to 24 hours, excluding Saturdays, Sundays, and holidays, or up to six hours in a standard metropolitan statistical area, in a jail, lockup or other facility used for the confinement of adults who have been charged with or convicted of a crime, in quarters separate from any adult confined in the facility which has been approved for the detention of juveniles by the commissioner of corrections. If continued detention in an adult jail is approved by the court under section 260B.178, subdivision 2, and there is no juvenile secure detention facility available for use by the county having jurisdiction over the child, such child may be detained for no more than eight days from and including the date of the original detention order in separate quarters in any jail or other adult facility for the confinement of persons charged with or convicted of crime which has been approved by the commissioner of corrections to be suitable for the detention of juveniles for up to eight days. Except for children who have been referred for prosecution pursuant to section 260B.125, and as hereinafter provided, any child requiring secure detention for more than eight days from and including the date of the original detention order must be removed to an approved secure juvenile detention facility. A child 16 years of age or older against whom a motion to refer for prosecution is pending before the court may be detained for more than eight days in separate quarters in a jail or other facility which has been approved by the commissioner of corrections for the detention of juveniles for up to eight days after a hearing and subject to the periodic reviews provided in section 260B.178. No child under the age of 14 may be detained in a jail, lockup or other facility used for the confinement of adults who have been charged with or convicted of a crime.\nIn order for a child to be detained at a state correctional institution for juveniles, the commissioner of corrections must first consent thereto, and the county must agree to pay the costs of the child's detention.\nWhere the commissioner directs that a child be detained in an approved juvenile facility with the approval of the administrative authority of the facility as provided in subdivision 4 or section 260B.176, subdivision 2, the costs of such detention shall be a charge upon the county for which the child is being detained.",
	"repealed": false
}