{
	"id": "281.273",
	"url": "https://www.revisor.mn.gov/statutes/cite/281.273",
	"title": "281.273 EXPIRATION OF TIME OF REDEMPTION ON LANDS OWNED BY PERSONS IN MILITARY SERVICE.",
	"text": "When a county sheriff or other person serves notice of expiration of the time for redemption of any parcel of real property from delinquent taxes upon any occupant of the real property, the sheriff or other person shall inquire of the occupant and otherwise as the sheriff or other person may deem proper whether the real property was owned and occupied for dwelling, professional, business or agricultural purposes by a person in the military service of the United States as defined in the Servicemembers Civil Relief Act, as amended, or the person's dependents at the commencement of the period of military service. On finding that the real property is so owned, the sheriff or other person shall make a certificate to the county auditor, setting forth the description of the property, the name of the owner, the particulars of the owner's military service so far as ascertained or claimed, and the names and addresses of the persons of whom the sheriff or other person made inquiry. The certificate shall be filed with the county auditor and shall be prima facie evidence of the facts stated. If the real property described in the certificate becomes forfeited to the state, it shall be withheld from sale or conveyance as tax-forfeited property in accordance with and subject to the provisions of the Servicemembers Civil Relief Act, as amended, except that the requirement in United States Code, title 50, section 560, that the property be occupied by the dependent or employee of the person in military service does not apply. The period of withholding from sale or conveyance shall be no longer than is required by that act. If upon further investigation the sheriff or other person finds at any time that the certificate is erroneous in any particular, the sheriff or other person shall file a supplemental certificate referring to the matter in error and stating the facts as found. The supplemental certificate shall be prima facie evidence of the facts stated, and shall supersede any prior certificate so far as in conflict therewith. If it appears from the supplemental certificate that the owner of the real property affected is not entitled to have the same withheld from sale under the Servicemembers Civil Relief Act, as amended, the property shall not be withheld from sale further under this section.",
	"repealed": false
}