{
	"id": "43A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.06",
	"title": "43A.06 POWERS AND RESPONSIBILITIES; LABOR RELATIONS.",
	"text": "(a) The commissioner shall perform the duties assigned to the commissioner by this section and sections 3.855 and 179A.01 to 179A.25.\n(b) The commissioner shall be the state labor negotiator for purposes of negotiating and administering agreements with exclusive representatives of employees and shall perform any other duties delegated by the commissioner subject to the limitations in paragraph (c).\n(c) The Board of Trustees of the Minnesota State Colleges and Universities may exercise the powers under this section for employees included in the units provided in section 179A.10, subdivision 2, clauses (9), (10), and (11), except with respect to sections 43A.22 to 43A.31, which shall continue to be the responsibility of the commissioner. The commissioner shall have the right to review and comment to the Minnesota State Colleges and Universities on the board's final proposals prior to exchange of final positions with the designated bargaining units as well as any requests for interest arbitration. The legislature encourages the Board of Trustees, in coordination with the commissioner of management and budget and the Board of Regents of the University of Minnesota, to endeavor in collective bargaining negotiations to seek fiscal balance recognizing the ability of the employer to fund the agreements or awards.\nThe commissioner shall represent the state at hearings conducted by the commissioner of the bureau of mediation services.\nThe commissioner shall represent the state in all collective bargaining between the state and exclusive representatives, and shall represent the state in mediation and arbitration of collective bargaining disputes.\nThe commissioner shall report to the Legislative Coordinating Commission pursuant to section 3.855.\nThe commissioner shall be responsible for management interpretation of all collective bargaining agreements between the state and exclusive representatives and provide management personnel with training in the interpretation and application of these collective bargaining agreements.\nThe commissioner shall oversee the administration of all written grievances arising under collective bargaining agreements between the state and an exclusive representative and shall represent the state at all grievance arbitrations.\nThe commissioner shall have final authority to decide if a grievance shall be submitted to arbitration or if it shall be settled without arbitration.\nThe commissioner shall direct investigations and shall have authority to decide whether agencies in the executive branch shall settle unfair labor practice charges filed against the employer, appointing authorities or their agents pursuant to chapter 179A.",
	"repealed": false
}