{
	"id": "626A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.06",
	"title": "626A.06 PROCEDURE FOR INTERCEPTION OF WIRE, ELECTRONIC, OR ORAL COMMUNICATIONS.",
	"text": "Each application for a warrant authorizing or approving the interception of a wire, electronic, or oral communication shall be made in writing upon oath or affirmation to a judge of the district court, of the court of appeals, or of the supreme court and shall state the applicant's authority to make such application. Each application shall include the following information:\n(1) the identity of the investigative or law enforcement officer making the application, and the officer authorizing the application;\n(2) a full and complete statement of the facts and circumstances relied upon by the applicant, to justify the applicant's belief that an order should be issued, including (i) details as to the particular offense that has been, is being, or is about to be committed, (ii) except as provided in subdivision 11, a particular description of the nature and location of the facilities from which or the place where the communication is to be intercepted, (iii) a particular description of the type of communications sought to be intercepted, (iv) the identity of the person, if known, committing the offense and whose communications are to be intercepted;\n(3) a full and complete statement as to whether or not other investigative procedures have been tried and failed or why they reasonably appear to be unlikely to succeed if tried or to be too dangerous;\n(4) a statement of the period of time for which the interception is required to be maintained. If the nature of the investigation is such that the authorization for interception should not automatically terminate when the described type of communication has been first obtained, a particular description of facts establishing probable cause to believe that additional communications of the same type will occur thereafter;\n(5) a full and complete statement of the facts concerning all previous applications known to the individual authorizing and making the application, made to any judge for authorization to intercept, or for approval of interceptions of, wire, electronic, or oral communications involving any of the same persons, facilities, or places specified in the application, and the action taken by the judge on each such application;\n(6) where statements in the application are solely upon the information or belief of the applicant, the grounds for the belief must be given; and\n(7) the names of persons submitting affidavits in support of the application.\nThe court to whom any such application is made, before issuing any warrant thereon, may examine on oath the person seeking the warrant and any witnesses the person may produce, and must take the person's affidavit or other affidavits in writing, and cause them to be subscribed by the party or parties making the same. The court may also require the applicant to furnish additional documentary evidence or additional oral testimony to satisfy itself of the existence of probable cause for issuance of the warrant.\nUpon such application the judge may enter an ex parte order, as requested or as modified, authorizing or approving interception of wire, electronic, or oral communications within the territorial jurisdiction of the court in which the judge is sitting, if the judge determines on the basis of the facts submitted by the applicant that:\n(1) there is probable cause for belief that an individual is committing, has committed, or is about to commit a particular offense enumerated in section 626A.05, subdivision 2;\n(2) there is probable cause for belief that particular communications concerning that offense will be obtained through such interception;\n(3) normal investigative procedures have been tried and have failed or reasonably appear to be unlikely to succeed if tried or to be too dangerous;\n(4) except as provided in subdivision 11, there is probable cause for belief that the facilities from which, or the place where, the wire, electronic, or oral communications are to be intercepted are being used, or are about to be used, in connection with the commission of such offense, or are leased to, listed in the name of, or commonly used by such person.\nNothing in this chapter is to be considered as modifying in any way the existence or scope of those privileged communications defined in chapter 595. In acting upon an application for a warrant for intercepting communications, the potential contents of any such future communications that are within the provisions of chapter 595 shall not be considered by the court in making its finding as to the probability that material evidence will be obtained by such interception of communications.\nEach warrant to intercept communications shall be directed to a law enforcement officer, commanding the officer to hold the recording of all intercepted communications conducted under said warrant in custody subject to the further order of the court issuing the warrant. The warrant shall contain the grounds for its issuance with findings, as to the existence of the matters contained in subdivision 1 and shall also specify:\n(1) the identity of the person, if known, whose communications are to be intercepted and recorded;\n(2) the nature and location of the communications facilities as to which, or the place where, authority to intercept is granted, and in the case of telephone or telegraph communications the general designation of the particular line or lines involved;\n(3) a particular description of the type of communication sought to be intercepted, and a statement of the particular offense to which it relates;\n(4) the identity of the law enforcement office or agency authorized to intercept the communications, the name of the officer or officers thereof authorized to intercept communications, and of the person authorizing the application;\n(5) the period of time during which such interception is authorized, including a statement as to whether or not the interception shall automatically terminate when the described communication has been first obtained;\n(6) any other limitations on the interception of communications being authorized, for the protection of the rights of third persons;\n(7) a statement that using, divulging, or disclosing any information concerning such application and warrant for intercepting communications is prohibited and that any violation is punishable by the penalties of this chapter;\n(8) a statement that the warrant shall be executed as soon as practicable, shall be executed in such a way as to minimize the interception of communications not otherwise subject to interception under this chapter and must terminate upon attainment of the authorized objective, or in any event in 30 days. The 30-day period begins on the earlier of the day on which the investigative or law enforcement officer first begins to conduct an interception under the order or ten days after the order is received. In the event the intercepted communication is in a code or foreign language, and an expert in that foreign language or code is not reasonably available during the interception period, minimization may be accomplished as soon as practicable after such interception.\nAn order authorizing the interception of a wire, oral, or electronic communication under this chapter must, upon request of the applicant, direct that a provider of wire or electronic communication service, landlord, custodian, or other person shall furnish the applicant immediately all information, facilities, and technical assistance necessary to accomplish the interception unobtrusively and with a minimum of interference with the services that the service provider, landlord, custodian, or person is according the person whose communications are to be intercepted. A provider of wire or electronic communication service, landlord, custodian, or other person furnishing facilities or technical assistance must be compensated by the applicant for reasonable expenses incurred in providing the facilities or assistance.\nDenial of an application for a warrant to intercept communications or of an application for renewal of such warrant shall be by written order that shall include a statement as to the offense or offenses designated in the application, the identity of the official applying for the warrant and the name of the law enforcement office or agency.\nAn interception under this chapter may be conducted in whole or in part by an employee of the state or any subdivision of the state who is an investigative or law enforcement officer authorized to conduct the investigation.\nNo warrant entered under this section may authorize or approve the interception of any wire, electronic, or oral communication for any period longer than is necessary to achieve the objective of the authorization, nor in any event longer than 30 days.\nThe effective period of any warrant for intercepting communications shall terminate immediately when any person named in the warrant has been charged with an offense specified in the warrant.\nAny judge of the district court, of the court of appeals, or of the supreme court may grant extensions of a warrant, but only upon application for an extension made in accordance with subdivision 1 and the court making the findings required by subdivision 3. The period of extension shall be no longer than the authorizing judge deems necessary to achieve the purposes for which it was granted and in no event for longer than 30 days. In addition to satisfying the requirements of subdivision 1, an application for an extension of any warrant for intercepting communications shall also:\n(1) contain a statement that all interception of communications under prior warrants has been in compliance with this chapter;\n(2) contain a statement setting forth the results thus far obtained from the interception or a reasonable explanation of the failure to obtain results;\n(3) state the continued existence of the matters contained in subdivision 1; and\n(4) specify the facts and circumstances of the interception of communications under prior warrants which are relied upon by the applicant to show that such continued interception of communications is necessary and in the public interest.\nAny warrant for intercepting communications under this section, or any order renewing a prior warrant, together with the application made therefor and any supporting papers upon which the application was based, shall be delivered to and retained by the applicant as authority for the interception of communications authorized therein. A true copy of such warrant and the application made therefor shall be retained in the possession of the judge issuing the same, and, in the event of the denial of an application for such a warrant, a true copy of the papers upon which the application was based shall in like manner be retained by the judge denying the same.\nWhenever a warrant authorizing interception is entered pursuant to this section, the warrant may require reports to be made to the judge who issued the order showing what progress has been made toward achievement of the authorized objective and the need for continued interception. Such reports shall be made at such intervals as the judge may require.\nA warrant for intercepting communications and the application, affidavits, and return prepared in connection therewith, and also any information concerning the application for, the granting of, or the denial of a warrant for intercepting communications shall remain secret and subject to all the penalties of this chapter for unauthorized disclosure to persons not lawfully engaged in preparing and executing such a warrant, unless and until the same shall have been disclosed in a criminal trial or proceeding or shall have been furnished to a defendant pursuant to this chapter.\nA warrant for the interception of communications may in all cases be served by any of the officers mentioned in its direction, but by no other person except if the officer requires aid while present and acting in its execution.\nThe requirements of subdivision 1, clause (2), item (ii), and subdivision 3, clause (4), relating to the specification of the facilities from which, or the place where, the communication is to be interpreted do not apply if:\n(1) in the case of an application with respect to the interception of an oral communication:\n(i) the application contains a full and complete statement as to why the specification is not practical and identifies the person committing the offense and whose communications are to be intercepted; and\n(ii) the judge finds that the specification is not practical;\n(2) in the case of an application with respect to a wire or electronic communication:\n(i) the application identifies the person believed to be committing the offense and whose communications are to be intercepted and the applicant makes a showing of a purpose, on the part of that person, to thwart interception by changing facilities; and\n(ii) the judge finds that the purpose has been adequately shown.\nAn interception of a communication under an order with respect to which the requirements of subdivision 1, clause (2), item (ii), and subdivision 3, clause (4), do not apply by reason of subdivision 11 must not begin until the facilities from which, or the place where, the communication is to be intercepted is ascertained by the person implementing the interception order. A provider of wire or electronic communications service that has received an order as provided for in subdivision 11, clause (2), may move the court to modify or quash the order on the ground that its assistance with respect to the interception cannot be performed in a timely or reasonable fashion. The court, upon notice to the attorney applying for the warrant, shall decide a motion expeditiously.",
	"repealed": false
}