{
	"id": "253B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.17",
	"title": "253B.17 PETITIONS; JUDICIAL DETERMINATION.",
	"text": "Any patient, except one committed as a sexually dangerous person or a person with a sexual psychopathic personality or as a person who has a mental illness and is dangerous to the public as provided in section 253B.18, subdivision 3, or any interested person may petition the committing court or the court to which venue has been transferred for an order that the patient is not in need of continued care and treatment under commitment or for an order that an individual is no longer a person who poses a risk of harm due to mental illness, or a person who has a developmental disability or chemical dependency, or for any other relief.\nA patient committed as a person who poses a risk of harm due to mental illness, a person who has a mental illness and is dangerous to the public, a sexually dangerous person, or a person with a sexual psychopathic personality may petition the committing court or the court to which venue has been transferred for a hearing concerning the administration of neuroleptic medication.\nUpon the filing of the petition, the court shall fix the time and place for the hearing on it. Ten days' notice of the hearing shall be given to the county attorney, the patient, patient's counsel, the person who filed the initial commitment petition, the head of the facility or program to which the person is committed, and other persons as the court directs. Any person may oppose the petition.\nThe court shall appoint a court examiner and, at the patient's request, shall appoint a second court examiner of the patient's choosing to be paid for by the county at a rate of compensation to be fixed by the court. Unless otherwise agreed by the parties, a court examiner shall file a report with the court not less than 48 hours prior to the hearing under this section.\nThe patient, patient's counsel, the petitioner, and the county attorney shall be entitled to be present at the hearing and to present and cross-examine witnesses, including court examiners. The court may hear any relevant testimony and evidence offered at the hearing.\nUpon completion of the hearing, the court shall enter an order stating its findings and decision and mail the order to the head of the treatment facility, state-operated treatment program, or community-based treatment program.",
	"repealed": false
}