{
	"id": "103E.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.321",
	"title": "103E.321 VIEWERS' REPORT.",
	"text": "The viewers' report must show, in tabular form, for each lot, 40-acre tract, and fraction of a lot or tract under separate ownership that is benefited or damaged:\n(1) a description of the lot or tract, under separate ownership, that is benefited or damaged;\n(2) the names of the owners as they appear on the current tax records of the county and their addresses;\n(3) the number of acres in each tract or lot;\n(4) the number and value of acres added to a tract or lot by the proposed drainage of public waters;\n(5) the damage, if any, to riparian rights;\n(6) the damages paid for the permanent strip of perennial vegetation under section 103E.021;\n(7) the total number and value of acres added to a tract or lot by the proposed drainage of public waters, wetlands, and other areas not currently being cultivated;\n(8) the number of acres and amount of benefits being assessed for drainage of areas which before the drainage benefits could be realized would require a public-waters-work permit to work in public waters under section 103G.245 to excavate or fill a navigable water body under United States Code, title 33, section 403, or a permit to discharge into waters of the United States under United States Code, title 33, section 1344;\n(9) the number of acres and amount of benefits being assessed for drainage of areas that would be considered conversion of a wetland under United States Code, title 16, section 3821, if the area was placed in agricultural production;\n(10) the amount of right-of-way acreage required; and\n(11) the amount that each tract or lot will be benefited or damaged.\n(a) The viewers' report must include a benefits and damages statement that shows for each property owner how the benefits or damages for similar tracts or lots were determined. For similar tracts or lots the report must describe:\n(1) the existing land use, property value, and economic productivity;\n(2) the potential land use, property value, and economic productivity after the drainage project is constructed; and\n(3) the benefits or damages from the proposed drainage project.\n(b) The soil and water conservation districts and county assessors shall cooperate with viewers to provide information required under paragraph (a).\nIf the viewers are unable to agree, each viewer shall separately state findings on the disputed issue. A majority of the viewers may perform the required duties under this chapter.\nWhen the viewers complete their duties, they shall file the viewers' report with the auditor of each affected county. A detailed statement must be filed with the viewers' report showing the actual time the viewers were engaged and the costs incurred. The viewers shall perform their duties and complete the viewers' report as soon as possible after their first meeting.",
	"repealed": false
}