{
	"id": "524.5-302",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-302",
	"title": "524.5-302 APPOINTMENT OF GUARDIAN BY WILL OR OTHER WRITING.",
	"text": "(a) A parent, by will or other signed writing executed in the same manner as a health care directive pursuant to chapter 145C, may appoint a guardian for an unmarried child who the parent believes is an incapacitated person, may specify the desired limitations on the powers to be given to the guardian, and may revoke or amend the appointment prior to court confirmation.\n(b) An individual by will or other signed writing executed in the same manner as a health care directive pursuant to chapter 145C may appoint a guardian for his or her spouse who the appointing spouse believes is an incapacitated person, may specify the desired limitations on the powers to be given to the guardian, and may revoke or amend the appointment prior to court confirmation.\n(c) Subject to the right of the incapacitated person, the person having custody or care of the incapacitated person if other than the appointing parent or spouse or the adult nearest in kinship to the incapacitated person to object, the guardian's appointment becomes effective upon the death of the appointing parent or spouse, the adjudication of incapacity of the appointing parent or spouse, or a written determination by a physician who has examined the appointing parent or spouse that the appointing parent or spouse is no longer able to care for the incapacitated person, whichever occurs first.\n(d) Upon petition of the appointing parent or spouse, and a finding that the appointing parent or spouse will likely become unable to care for the incapacitated person within two years or less, and after notice as provided in this section, the court, before the appointment becomes effective, may confirm the appointing parent's or spouse's selection of a guardian and terminate the rights of others to object.\n(e) The guardian becomes eligible to act upon the filing of an acceptance of appointment, which must be filed within 30 days following the effective date of the guardian's appointment. The guardian shall:\n(1) file the notice of acceptance of appointment and a copy of the will with the court of the county in which the will was or could be probated or, in the case of another appointing instrument, file the acceptance of appointment and the appointing instrument with the court in the county in which the incapacitated person resides or is present; and\n(2) give written notice of the acceptance of appointment to the appointing parent or spouse if living, the incapacitated person, a person having custody or care of the incapacitated person other than the appointing parent or spouse, and the adult nearest in kinship.\n(f) Unless the appointment was previously confirmed by the court, the notice given under paragraph (e), clause (2), must include a statement of the right of those notified to terminate the appointment by filing a written objection as provided in this section.\n(g) An appointment effected by filing the guardian's acceptance under a will probated in the state of the testator's domicile is effective in this state.\n(h) The filing of a written objection to an appointment by the alleged incapacitated person or another interested person in the court in which the guardian's written acceptance was filed terminates the appointment. An objection may be withdrawn and, if withdrawn, is of no effect. An objection does not preclude the court from appointing the parental or spousal appointee as guardian. The court may treat the filing of an objection as a petition for the appointment of an emergency guardian under section 524.5-311 or for the appointment of a limited or unlimited guardian under section 524.5-303 and proceed accordingly.\n(i) Unless the appointment was previously confirmed by the court, within 30 days after filing the notice and the appointing instrument, a guardian appointed under this section shall file a petition in the court for confirmation of the appointment, giving notice in the manner provided in section 524.5-308, and, if necessary, for an appointment as conservator.\n(j) The authority of a guardian appointed under this section terminates upon the first to occur of the appointment of a guardian by the court or the giving of written notice to the guardian of the filing of an objection pursuant to paragraph (h).\n(k) The appointment of a guardian under this section is not a determination of incapacity.\n(l) The powers of a guardian who timely complies with the requirements of paragraphs (e) and (f) relate back to give acts by the guardian which are of benefit to the incapacitated person and occurred on or after the date the appointment became effective the same effect as those that occurred after the filing of the acceptance of appointment.",
	"repealed": false
}