{
	"id": "62J.536",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.536",
	"title": "62J.536 UNIFORM ELECTRONIC TRANSACTIONS AND IMPLEMENTATION GUIDE STANDARDS.",
	"text": "(a) Beginning January 15, 2009, all group purchasers must accept from health care providers the eligibility for a health plan transaction described under Code of Federal Regulations, title 45, part 162, subpart L. Beginning July 15, 2009, all group purchasers must accept from health care providers the health care claims or equivalent encounter information transaction described under Code of Federal Regulations, title 45, part 162, subpart K.\n(b) Beginning January 15, 2009, all group purchasers must transmit to providers the eligibility for a health plan transaction described under Code of Federal Regulations, title 45, part 162, subpart L. Beginning December 15, 2009, all group purchasers must transmit to providers the health care payment and remittance advice transaction described under Code of Federal Regulations, title 45, part 162, subpart P.\n(c) Beginning January 15, 2009, all health care providers must submit to group purchasers the eligibility for a health plan transaction described under Code of Federal Regulations, title 45, part 162, subpart L. Beginning July 15, 2009, all health care providers must submit to group purchasers the health care claims or equivalent encounter information transaction described under Code of Federal Regulations, title 45, part 162, subpart K.\n(d) Beginning January 15, 2009, all health care providers must accept from group purchasers the eligibility for a health plan transaction described under Code of Federal Regulations, title 45, part 162, subpart L. Beginning December 15, 2009, all health care providers must accept from group purchasers the health care payment and remittance advice transaction described under Code of Federal Regulations, title 45, part 162, subpart P.\n(e) Beginning January 1, 2012, all health care providers, health care clearinghouses, and group purchasers must provide an appropriate, standard, electronic acknowledgment when receiving the health care claims or equivalent encounter information transaction or the health care payment and remittance advice transaction. The acknowledgment provided must be based on one or more of the following American National Standards Institute, Accredited Standards Committee X12 standard transactions or National Council for Prescription Drug Program (NCPDP) standards:\n(1) TA1;\n(2) 999;\n(3) 277CA; or\n(4) the appropriate NCPDP response standard as the electronic acknowledgment.\nHealth care providers, health care clearinghouses, and group purchasers may send and receive more than one type of standard acknowledgment as mutually agreed upon. The mutually agreed upon acknowledgments must be exchanged electronically. Electronic exchanges of acknowledgments do not include email or facsimile.\n(f) Each of the transactions described in paragraphs (a) to (e) shall require the use of a single, uniform companion guide to the implementation guides described under Code of Federal Regulations, title 45, part 162. The companion guides will be developed pursuant to subdivision 2.\n(g) Notwithstanding any other provisions in sections 62J.50 to 62J.61, all group purchasers and health care providers must exchange claims and eligibility information electronically using the transactions, companion guides, implementation guides, and timelines required under this subdivision. Group purchasers may not impose any fee on providers or providers' clearinghouses for the use of the transactions prescribed in this subdivision. Health care providers may not impose a fee on group purchasers or group purchasers' clearinghouses for the use of the transactions prescribed in this subdivision. A clearinghouse may not charge a fee solely to receive a standard transaction from a health care provider, a health care provider's clearinghouse, a group purchaser, or a group purchaser's clearinghouse when it is not an agent of the sending entity. A clearinghouse may not charge a fee solely to send a standard transaction to a health care provider, a health care provider's clearinghouse, a group purchaser, or a group purchaser's clearinghouse when it is not an agent of the receiving entity.\n(h) Nothing in this subdivision shall prohibit group purchasers and health care providers from using a direct data entry, web-based methodology for complying with the requirements of this subdivision. Any direct data entry method for conducting the transactions specified in this subdivision must be consistent with the data content component of the single, uniform companion guides required in paragraph (f) and the implementation guides described under Code of Federal Regulations, title 45, part 162.\n(a) At least 12 months prior to the timelines required in subdivision 1, the commissioner of health shall promulgate rules pursuant to section 62J.61 establishing and requiring group purchasers and health care providers to use the transactions and the uniform, standard companion guides required under subdivision 1, paragraph (f).\n(b) The commissioner of health must consult with the Minnesota Administrative Uniformity Committee on the development of the single, uniform companion guides required under subdivision 1, paragraph (f), for each of the transactions in subdivision 1. The single uniform companion guides required under subdivision 1, paragraph (f), must specify uniform billing and coding standards. The commissioner of health shall base the companion guides required under subdivision 1, paragraph (f), billing and coding rules, and standards on the Medicare program, with modifications that the commissioner deems appropriate after consulting the Minnesota Administrative Uniformity Committee.\n(c) No group purchaser or health care provider may add to or modify the single, uniform companion guides defined in subdivision 1, paragraph (f), through additional companion guides or other requirements.\n(d) In promulgating the rules in paragraph (a), the commissioner shall not require data content that is not essential to accomplish the purpose of the transactions in subdivision 1.\nFor transactions with group purchasers defined in section 62J.03, subdivision 6, that are not covered under United States Code, title 42, sections 1320d to 1320d-8, the requirements of this section are modified as follows:\n(1) The group purchasers may be exempt from one or more of the requirements to exchange claims and eligibility information electronically using the transactions, companion guides, implementation guides, and timelines in subdivision 1 if the commissioner of health determines that:\n(i) a transaction is incapable of exchanging data that are currently being exchanged on paper and is necessary to accomplish the purpose of the transaction; or\n(ii) another national electronic transaction standard would be more appropriate and effective to accomplish the purpose of the transaction.\n(2) If group purchasers are exempt from one or more of the requirements to exchange claims and eligibility information electronically using the transactions, companion guides, implementation guides, and timelines in subdivision 1, providers shall also be exempt from exchanging those transactions with the group purchaser.\n(3) If the commissioner of health exempts a group purchaser from one or more of the requirements because a transaction is incapable of exchanging data that are currently being exchanged on paper and are necessary to accomplish the purpose of the transaction, the commissioner shall review that exemption annually. If the commissioner determines that the exemption is no longer necessary or appropriate, the commissioner of health shall adopt rules pursuant to section 62J.61 establishing and requiring group purchasers and health care providers to use the transactions and the uniform, standard companion guides required under subdivision 1, paragraph (e). Group purchasers and providers shall have 12 months to implement any rules adopted.\n(4) If the commissioner of health exempts a group purchaser from one or more of the requirements because another national electronic transaction standard would be more appropriate and effective to accomplish the purpose of the transaction, the commissioner shall adopt rules pursuant to section 62J.61 establishing and requiring group purchasers and health care providers to use the national electronic transaction standard. Group purchasers and providers shall have 12 months to implement any rules adopted.\n(5) The requirement of paper claims attachments shall not indicate that a health care claims or equivalent encounter information transaction described under Code of Federal Regulations, title 45, part 162, subpart K, is incapable of exchanging data that are currently being exchanged on paper provided that the electronic health care claims transaction has a mechanism to link the paper attachments to the electronic claim.\n(a) The commissioner of health shall, to the extent practicable, seek the cooperation of health care providers, health care clearinghouses, and group purchasers in obtaining compliance with this section and may provide technical assistance to health care providers, health care clearinghouses, and group purchasers.\n(b) A person who believes a health care provider, health care clearinghouse, or group purchaser is not complying with the requirements of this section may file a complaint with the commissioner of health. Complaints filed under this section must meet the following requirements:\n(1) A complaint must be filed in writing, either on paper or electronically.\n(2) A complaint must name the person that is the subject of the complaint and describe the acts or omissions believed to be in violation of this section.\n(3) A complaint must be filed within 180 days of when the complainant knew or should have known that the act or omission complained of occurred.\n(4) The commissioner may prescribe additional procedures for the filing of complaints as required to satisfy the requirements of this section.\n(c) The commissioner of health may investigate complaints filed under this section. The investigation may include a review of the pertinent policies, procedures, or practices of the health care provider, health care clearinghouse, or group purchaser and of the circumstances regarding any alleged violation. At the time of initial written communication with the health care provider, health care clearinghouse, or group purchaser about the complaint, the commissioner of health shall describe the acts or omissions that are the basis of the complaint. The commissioner may conduct compliance reviews to determine whether health care providers, health care clearinghouses, and group purchasers are complying with this section.\n(d) Health care providers, health care clearinghouses, and group purchasers must cooperate with the commissioner of health if the commissioner undertakes an investigation or compliance review of the policies, procedures, or practices of the health care provider, health care clearinghouse, or group purchaser to determine compliance with this section. This cooperation includes, but is not limited to:\n(1) A health care provider, health care clearinghouse, or group purchaser must permit access by the commissioner of health during normal business hours to its facilities, books, records, accounts, and other sources of information that are pertinent to ascertaining compliance with this section.\n(2) If any information required of a health care provider, health care clearinghouse, or group purchaser under this section is in the exclusive possession of any other agency, institution, or person and the other agency, institution, or person fails or refuses to furnish the information, the health care provider, health care clearinghouse, or group purchaser must so certify and set forth what efforts it has made to obtain the information.\n(3) Any individually identifiable health information obtained by the commissioner of health in connection with an investigation or compliance review under this section may not be used or disclosed by the commissioner of health, except as necessary for ascertaining or enforcing compliance with this section.\n(e) If an investigation of a complaint indicates noncompliance, the commissioner of health shall attempt to reach a resolution of the matter by informal means. Informal means may include demonstrated compliance or a completed corrective action plan or other agreement. If the matter is resolved by informal means, the commissioner of health shall so inform the health care provider, health care clearinghouse, or group purchaser and, if the matter arose from a complaint, the complainant, in writing. If the matter is not resolved by informal means, the commissioner of health shall:\n(1) inform the health care provider, health care clearinghouse, or group purchaser and provide an opportunity for the health care provider, health care clearinghouse, or group purchaser to submit written evidence of any mitigating factors or other considerations. The health care provider, health care clearinghouse, or group purchaser must submit any such evidence to the commissioner of health within 30 calendar days of receipt of the notification; and\n(2) inform the health care provider, health care clearinghouse, or group purchaser, through a notice of proposed determination according to paragraph (i), that the commissioner of health finds that a civil money penalty should be imposed.\n(f) If, after an investigation or a compliance review, the commissioner of health determines that further action is not warranted, the commissioner of health shall so inform the health care provider, health care clearinghouse, or group purchaser and, if the matter arose from a complaint, the complainant, in writing.\n(g) A health care provider, health care clearinghouse, or group purchaser may not threaten, intimidate, coerce, harass, discriminate against, or take any other retaliatory action against any individual or other person for:\n(1) filing of a complaint under this section;\n(2) testifying, assisting, or participating in an investigation, compliance review, proceeding, or contested case proceeding under this section; or\n(3) opposing any act or practice made unlawful by this section, provided the individual or person has a good faith belief that the practice opposed is unlawful, and the manner of opposition is reasonable and does not involve an unauthorized disclosure of a patient's health information.\n(h) The commissioner of health may impose a civil money penalty on a health care provider, health care clearinghouse, or group purchaser if the commissioner of health determines that the health care provider, health care clearinghouse, or group purchaser has violated this section. If the commissioner of health determines that more than one health care provider, health care clearinghouse, or group purchaser was responsible for a violation, the commissioner of health may impose a civil money penalty against each health care provider, health care clearinghouse, or group purchaser. The amount of a civil money penalty shall be determined as follows:\n(1) The amount of a civil money penalty shall be up to $100 for each violation, but not exceed $25,000 for identical violations during a calendar year.\n(2) In the case of continuing violation of this section, a separate violation occurs each business day that the health care provider, health care clearinghouse, or group purchaser is in violation of this section.\n(3) In determining the amount of any civil money penalty, the commissioner of health may consider as aggravating or mitigating factors, as appropriate, any of the following:\n(i) the nature of the violation, in light of the purpose of the goals of this section;\n(ii) the time period during which the violation occurred;\n(iii) whether the violation hindered or facilitated an individual's ability to obtain health care;\n(iv) whether the violation resulted in financial harm;\n(v) whether the violation was intentional;\n(vi) whether the violation was beyond the direct control of the health care provider, health care clearinghouse, or group purchaser;\n(vii) any history of prior compliance with the provisions of this section, including violations;\n(viii) whether and to what extent the provider, health care clearinghouse, or group purchaser has attempted to correct previous violations;\n(ix) how the health care provider, health care clearinghouse, or group purchaser has responded to technical assistance from the commissioner of health provided in the context of a compliance effort; or\n(x) the financial condition of the health care provider, health care clearinghouse, or group purchaser including, but not limited to, whether the health care provider, health care clearinghouse, or group purchaser had financial difficulties that affected its ability to comply or whether the imposition of a civil money penalty would jeopardize the ability of the health care provider, health care clearinghouse, or group purchaser to continue to provide, or to pay for, health care.\n(i) If a penalty is proposed according to this section, the commissioner of health must deliver, or send by certified mail with return receipt requested, to the respondent written notice of the commissioner of health's intent to impose a penalty. This notice of proposed determination must include:\n(1) a reference to the statutory basis for the penalty;\n(2) a description of the findings of fact regarding the violations with respect to which the penalty is proposed;\n(3) the amount of the proposed penalty;\n(4) any circumstances described in paragraph (i) that were considered in determining the amount of the proposed penalty;\n(5) instructions for responding to the notice, including a statement of the respondent's right to a contested case proceeding and a statement that failure to request a contested case proceeding within 30 calendar days permits the imposition of the proposed penalty; and\n(6) the address to which the contested case proceeding request must be sent.\n(j) A health care provider, health care clearinghouse, or group purchaser may contest whether the finding of facts constitute a violation of this section, according to a contested case proceeding as set forth in sections 14.57 to 14.62, subject to appeal according to sections 14.63 to 14.68.\n(k) Any data collected by the commissioner of health as part of an active investigation or active compliance review under this section are classified as protected nonpublic data pursuant to section 13.02, subdivision 13, in the case of data not on individuals and confidential pursuant to section 13.02, subdivision 3, in the case of data on individuals. Data describing the final disposition of an investigation or compliance review are classified as public.\n(l) Civil money penalties imposed and collected under this subdivision shall be deposited into a revolving fund and are appropriated to the commissioner of health for the purposes of this subdivision, including the provision of technical assistance.\nNotwithstanding section 62J.03, subdivision 8, for purposes of this section, \"health care provider\" includes licensed nursing homes, licensed boarding care homes, and licensed home care providers.\n(a) Beginning January 1, 2012, health care clearinghouses must use and make available suitable tracking mechanisms to allow health care providers and group purchasers to determine in a timely fashion that health care claims or equivalent encounter information transactions and health care payment and remittance advice transactions were delivered to their intended final destination. Clearinghouses must provide clear, understandable, accurate information and instructions for tracking claims and remittance advice transactions to all clients, potential clients, or interested parties. Clearinghouses must provide clear, accurate information and instructions for receiving and responding to questions or concerns from health care providers or group purchasers regarding tracking of health care claims and remittance advice transactions. This information must include any designated points of contact and contact information, hours of operation, and other information to assist providers and group purchasers with questions or concerns.\n(b) Health care clearinghouses must make or provide electronic connections with other clearinghouses or trading partners requesting such a connection to meet the requirements of this section. A health care clearinghouse must connect electronically in a timely manner with any entity willing and capable of meeting the standard business terms and conditions of the clearinghouse, as well as any applicable laws and regulations. Any connectivity sought or established under this subdivision must be consistent with this section and with other applicable laws and rules. Health care providers and group purchasers may determine which clearinghouses they choose to work with and with which to enter into agent relationships.\n(c) Acceptance of a compliant standard transaction may not be contingent on purchase of additional services. A health care clearinghouse may not condition acceptance of a compliant standard transaction from a provider, provider's agent, group purchaser, or group purchaser's agent on the provider's or group purchaser's agreement to pay for an additional service such as transmitting attachments electronically.\n(d) The commissioner may:\n(1) require information and data from health care clearinghouses, including information regarding clearinghouse operations and performance, to ensure that requirements of this section and related rules are fulfilled;\n(2) require that clearinghouses with websites post, maintain, and regularly update on their websites point-of-contact information and other information needed by clients, potential clients, and others to obtain answers to questions or to conduct business;\n(3) require that all clearinghouses provide timely, clear, accurate, reliable information to their clients, potential clients, or any interested parties regarding their products or services, pricing, and other business and service information; and\n(4) post information from clearinghouses on a Department of Health website and make the information broadly available through other means.\nThe commissioner shall determine the manner, content, timing, frequency, and other specifications for information to be posted or submitted by health care clearinghouses.",
	"repealed": false
}