{
	"id": "270A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/270A.03",
	"title": "270A.03 DEFINITIONS.",
	"text": "For purposes of sections 270A.01 to 270A.12, the terms defined in this section have the meanings given them.\n\"Claimant agency\" means any state agency, as defined by section 14.02, subdivision 2, the regents of the University of Minnesota, any district court of the state, any county, any statutory or home rule charter city, including a city that is presenting a claim for a municipal hospital or a public library or a municipal ambulance service, a hospital district, any ambulance service licensed under chapter 144E, any public agency responsible for child support enforcement, any public agency responsible for the collection of court-ordered restitution, and any public agency established by general or special law that is responsible for the administration of a low-income housing program.\n\"Commissioner\" means the commissioner of revenue.\n\"Debtor\" means a natural person obligated on a debt to a claimant agency or having a delinquent account with a public agency responsible for child support enforcement.\n(a) \"Debt\" means a legal obligation of a natural person to pay a fixed and certain amount of money, which equals or exceeds $25 and which is due and payable to a claimant agency. The term includes criminal fines imposed under section 609.10 or 609.125, fines imposed for petty misdemeanors as defined in section 609.02, subdivision 4a, and restitution. A debt may arise under a contractual or statutory obligation, a court order, or other legal obligation, but need not have been reduced to judgment.\nA debt includes any legal obligation of a current recipient of assistance which is based on overpayment of an assistance grant where that payment is based on a client waiver or an administrative or judicial finding of an intentional program violation; or where the debt is owed to a program wherein the debtor is not a client at the time notification is provided to initiate recovery under this chapter and the debtor is not a current recipient of Supplemental Nutrition Assistance Program (SNAP) benefits, transitional child care, or transitional medical assistance.\n(b) A debt does not include any legal obligation to pay a claimant agency for medical care, including hospitalization if the income of the debtor at the time when the medical care was rendered does not exceed the following amount:\n(1) for an unmarried debtor, an income of $13,280 or less;\n(2) for a debtor with one dependent, an income of $17,010 or less;\n(3) for a debtor with two dependents, an income of $20,120 or less;\n(4) for a debtor with three dependents, an income of $22,820 or less;\n(5) for a debtor with four dependents, an income of $24,070 or less; and\n(6) for a debtor with five or more dependents, an income of $25,100 or less.\nFor purposes of this paragraph, \"debtor\" means the individual whose income, together with the income of the individual's spouse, other than a separated spouse, brings the individual within the income provisions of this paragraph. For purposes of this paragraph, a spouse, other than a separated spouse, shall be considered a dependent.\n(c) The commissioner shall annually adjust the amounts in paragraph (b) as provided in section 270C.22. The statutory year is taxable year 2019.\n(d) Debt also includes an agreement to pay a MinnesotaCare premium, regardless of the dollar amount of the premium authorized under section 256L.15, subdivision 1a.\n\"Department\" means the Department of Revenue.\n\"Refund\" means an individual income tax refund or political contribution refund, pursuant to chapter 290, or a property tax credit or refund, pursuant to chapter 290A, or a sustainable forest payment to a claimant under chapter 290C.\nFor purposes of this chapter, lottery prizes, as set forth in section 349A.08, subdivision 8, and amounts granted to persons by the legislature on the recommendation of the joint senate-house of representatives Subcommittee on Claims shall be treated as refunds.\nIn the case of a joint property tax refund payable to spouses under chapter 290A, the refund shall be considered as belonging to each spouse in the proportion of the total refund that equals each spouse's proportion of the total income determined under section 290A.03, subdivision 3. In the case of a joint income tax refund under chapter 289A, the refund shall be considered as belonging to each spouse in the proportion of the total refund that equals each spouse's proportion of the total taxable income determined under section 290.01, subdivision 29. The commissioner shall remit the entire refund to the claimant agency, which shall, upon the request of the spouse who does not owe the debt, determine the amount of the refund belonging to that spouse and refund the amount to that spouse. For court fines, fees, and surcharges and court-ordered restitution under section 611A.04, subdivision 2, the notice provided by the commissioner of revenue under section 270A.07, subdivision 2, paragraph (b), serves as the appropriate legal notice to the spouse who does not owe the debt.\n\"Restitution\" means money due to the victim of a crime or a juvenile offense under an order of restitution issued by a court under section 609.10, or 609.125 as part of a sentence or as a condition of probation, or under an order entered by a court under section 260B.198, subdivision 1, paragraph (a), clause (5), following a finding of delinquency.",
	"repealed": false
}