{
	"id": "290.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.36",
	"title": "290.36 INVESTMENT COMPANIES; REPORT OF NET INCOME; COMPUTATION OF AMOUNT OF INCOME ALLOCABLE TO STATE.",
	"text": "The taxable net income of investment companies shall be computed as follows:\nEach investment company transacting business as such in this state shall report to the commissioner the net income returned by the company for the taxable year to the United States under the provisions of the Internal Revenue Code, less the credits provided therein and subject to the adjustments required by this chapter. The commissioner shall compute therefrom the taxable net income of the investment company by assigning to this state that proportion of such net income, less such credits which the aggregate of the gross payments collected by the company during the taxable year from old and new business upon investment contracts issued by the company and held by residents of this state, bears to the total amount of the gross payments collected during such year by the company from such business upon investment contracts issued by the company and held by persons residing within the state and elsewhere.\nAs used in this section, the term \"investment company\" means any person, copartnership, association, or corporation, whether local or foreign, coming within the purview of section 54.26, and who or which is registered under the Investment Company Act of 1940 (United States Code, title 15, section 80a-1 and following), as amended through December 31, 1986, and who or which solicits or receives payments to be made to itself and which issues therefor, or has issued therefor and has or shall have outstanding so-called bonds, shares, coupons, certificates of membership, or other evidences of obligation or agreement or pretended agreement to return to the holders or owners thereof money or anything of value at some future date; and as to whom the gross payments received during the taxable year in question upon outstanding investment contracts, plus interest and dividends earned on investment contracts determined by prorating the total dividends and interest for the taxable year in question in the same proportion that certificate reserves as defined by the Investment Company Act of 1940, as amended through December 31, 1986, is to total assets, shall be at least 50 percent of the company's gross payments upon investment contracts plus gross income from all other sources except dividends from subsidiaries for the taxable year in question. The term \"investment contract\" shall mean any such so-called bonds, shares, coupons, certificates of membership, or other evidences of obligation or agreement or pretended agreement issued by an investment company.",
	"repealed": false
}