{
	"id": "15C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/15C.08",
	"title": "15C.08 PROSECUTING ATTORNEY AND PRIVATE PARTY ROLES.",
	"text": "(a) Except as otherwise provided by this section, if the prosecuting attorney does not intervene at the outset in an action brought by a person under section 15C.05, the person has the same rights in conducting the action as the prosecuting attorney would have. A copy of each pleading or other paper filed in the action and a copy of the transcript of each deposition taken must be mailed to the prosecuting attorney if the prosecuting attorney so requests and pays the cost of doing so.\n(b) If the prosecuting attorney elects not to intervene at the outset of the action, the court, without limiting the status and rights of the person initiating the action, may nevertheless permit the prosecuting attorney to intervene at a later date, upon a showing of good cause. If the prosecuting attorney so intervenes, the prosecuting attorney subsequently has primary responsibility for conducting the action.\n(c) If the prosecuting attorney elects at the outset of the action to intervene, the prosecuting attorney has the primary responsibility for prosecuting the action. The person who initially brought the action remains a party but the person's acts do not bind the prosecuting attorney.\n(d) If the prosecuting attorney elects to intervene, either at the outset or subsequently, the prosecuting attorney may file the prosecuting attorney's own complaint or amend the complaint of the person who initially brought the action to clarify or add details to the claims in which the prosecuting attorney is intervening and to add any additional claims with respect to which the prosecuting attorney contends the prosecuting attorney is entitled to relief. For statute of limitations purposes, any prosecuting attorney pleading relates back to the filing date of the complaint of the person who originally brought the action, to the extent that the claim of the prosecuting attorney arises out of the conduct, transactions, or occurrences set forth, or attempted to be set forth, in the prior complaint of that person.\n(e) Whether or not the prosecuting attorney intervenes in the action, the prosecuting attorney may move to dismiss the action for good cause. The person who brought the action must be notified of the filing of the motion and may oppose it and present evidence at the hearing. The prosecuting attorney may also settle the action. If the prosecuting attorney intends to settle the action, the prosecuting attorney shall notify the person who brought the action. The state or the political subdivision may settle the action with the defendant notwithstanding the objections of the person initiating the action if the court determines, after a hearing, that the proposed settlement is fair, adequate, and reasonable under all the circumstances. Upon a showing of good cause, the hearing may be held in chambers.",
	"repealed": false
}