{
	"id": "353E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/353E.06",
	"title": "353E.06 DISABILITY BENEFITS.",
	"text": "A member who is determined to qualify for a duty disability as defined in section 353E.001, subdivision 1, is entitled to a disability benefit. The disability benefit must be based on covered service under this chapter only and is an amount equal to 47.5 percent of the average salary defined in section 353E.04, subdivision 2, plus an additional 1.9 percent for each year of covered service under this chapter in excess of 25 years.\nA member who has at least one year of covered service under this chapter and who is determined to qualify for a regular disability benefit as defined in section 353E.001, subdivision 4, is entitled to a disability benefit based on covered service under this chapter. The disability benefit must be computed in the same manner as an annuity under section 353E.04, subdivision 3, and as though the employee had at least ten years of covered correctional service.\nA disabled member may elect the normal disability benefit or an optional annuity as provided in section 353.30, subdivision 3. The election of an optional annuity must be made before the commencement of payment of the disability benefit and is effective on the date on which the disability benefit begins to accrue as provided in section 353.33, subdivision 2. Upon becoming effective, the optional annuity begins to accrue on the same date as provided for the disability benefit.\n(a) Procedures for the application process and determining eligibility for disability benefits are defined in section 353.031.\n(b) The disability benefit begins to accrue when the applicant is no longer receiving any form of compensation, whether salary or paid leave; 90 days preceding the filing of the application, or, if annual or sick leave, or any other employer-paid salary continuation plan is paid for more than the 90-day period, from the date salary ceased, whichever is latest. No member is entitled to receive a disability benefit payment when there remains to the member's credit any unused annual leave, sick leave, or any other employer-paid salary continuation benefits or under any other circumstances when, during the period of disability, there has been no impairment of the person's salary.\n(c) No payment may accrue beyond the end of the month in which entitlement has terminated. If the disabilitant dies before negotiating the check for the month in which death occurs, payment must be made to the optional annuitant or beneficiary.\n(a) The disability benefit paid to a disabled member terminates at the end of the month in which the employee reaches age 55, or the first of the month after the expiration of the 60-month period from the effective date of the disability benefit, whichever is later.\n(b) If the disabled member is still disabled when the employee has been collecting the disability benefit for 60 months or has reached age 55, whichever is later, the employee is deemed to be a retired employee and, if the employee had elected an optional annuity under subdivision 3, must receive an annuity in accordance with the terms of the optional annuity previously elected.\n(c) If the employee had not elected an optional annuity under subdivision 3, the employee may elect either to receive a single life retirement annuity computed in the manner provided in section 353E.04, subdivision 3, or to receive an optional annuity as provided in section 353.30, subdivision 3, based on the same length of service as used in the calculation of the disability benefit. Election of an optional annuity must be made within 90 days before termination of the disability benefit under paragraph (a).\n(d) When an individual's disability benefit terminates under this subdivision and is recalculated as a retirement annuity, the annuity must include all prior adjustments provided under Minnesota Statutes 2008, section 11A.18, through January 1, 2009, and thereafter as provided in section 356.415.\n(a) If a member receiving disability benefits resumes a gainful occupation with earnings, the amount of the member's disability benefit must be reduced as described in paragraph (b) if the total of the disability benefit and earnings exceeds the greater of:\n(1) the base monthly salary rate the member had been receiving at the date of disability; or\n(2) the base monthly salary rate currently paid by the employing governmental subdivision for similar positions.\n(b) If paragraph (a) applies, the member's disability benefit must be reduced until the disability benefit plus the monthly earnings from employment do not exceed the greater of the salaries described in paragraph (a), clause (1) or (2).\nIf the employee is entitled to receive a disability benefit as provided in subdivision 1 or 2 and has credit for less covered correctional service than the length of service upon which the correctional disability benefit is based, and also has credit for public employees retirement plan service, the employee is entitled to a disability benefit or deferred retirement annuity based on the regular plan service only for the service that, when combined with the correctional service, exceeds the number of years on which the correctional disability benefit is based. The disabled employee who also has credit for regular plan service must in all respects qualify under section 353.33 to be entitled to receive a disability benefit based on the public employees retirement plan service, except that the service may be combined to satisfy length of service requirements. Any deferred annuity to which the employee may be entitled based on public employees retirement plan service must be augmented as provided in section 353.71 while the employee is receiving a disability benefit under this section.\nContinuing eligibility for a disability benefit is subject to section 353.031, subdivision 8.\nA disability benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}