{
	"id": "216C.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.375",
	"title": "216C.375 SOLAR FOR SCHOOLS PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Developer\" means an entity that installs a solar energy system on a school building that has been awarded a grant under this section.\n(c) \"Electricity expenses\" means expenses associated with:\n(1) purchasing electricity from a utility; or\n(2) purchasing and installing a solar energy system, including financing and power purchase agreement payments, operation and maintenance contract payments, and interest charges.\n(d) \"Photovoltaic device\" has the meaning given in section 216C.06, subdivision 16.\n(e) \"School\" means:\n(1) a school that operates as part of a school district;\n(2) a Tribal contract school; or\n(3) a state college or university that is under the jurisdiction of the Board of Trustees of the Minnesota State Colleges and Universities.\n(f) \"School district\" means:\n(1) an independent school district, as defined in section 120A.05, subdivision 10;\n(2) a special school district, as defined in section 120A.05, subdivision 14; or\n(3) a cooperative unit, as defined in section 123A.24, subdivision 2.\n(g) \"Solar energy system\" means photovoltaic or solar thermal devices.\n(h) \"Solar thermal\" has the meaning given to \"qualifying solar thermal project\" in section 216B.2411, subdivision 2, paragraph (d).\n(i) \"State colleges and universities\" has the meaning given in section 136F.01, subdivision 4.\nA solar for schools program is established in the Department of Commerce. The purpose of the program is to provide grants to stimulate the installation of solar energy systems on or adjacent to school buildings by reducing the school's electricity expenses, and to enable schools to use the solar energy system as a teaching tool that can be integrated into the school's curriculum.\nA solar for schools program account is established in the special revenue fund. Money received from the general fund and from the renewable development account established under section 116C.779, subdivision 1, must be transferred to the commissioner of commerce and credited to the account. The account consists of money received from the general fund and the renewable development account, provided by law, donated, allocated, transferred, or otherwise provided to the account. Earnings, including interest, dividends, and any other earnings arising from the assets of the account, must be credited to the account. Except as otherwise provided in this paragraph, money deposited in the account remains in the account until expended. Any money that remains in the account on June 30, 2034, cancels to the general fund.\n(a) Money in the account is appropriated to the commissioner and may be used only:\n(1) for grant awards made under this section; and\n(2) to pay the reasonable costs incurred by the department to administer this section.\n(b) Grant awards made with funds from the general fund must be used only for grants for solar energy systems installed on or adjacent to school buildings receiving retail electric service from a utility that is not subject to section 116C.779, subdivision 1.\n(c) Grant awards made with funds from the renewable development account must be used only for grants for solar energy systems installed on or adjacent to school buildings receiving retail electric service from a utility that is subject to section 116C.779, subdivision 1.\n(a) A grant may be awarded to a school under this section only if the school building is owned by the grantee and the solar energy system that is the subject of the grant:\n(1) is installed on or adjacent to the school building that consumes the electricity generated by the solar energy system, on property within the service territory of the utility currently providing electric service to the school building;\n(2) if installed on or adjacent to a school building receiving retail electric service from a utility that is not subject to section 116C.779, subdivision 1, has a capacity that does not exceed the lesser of: (i) 40 kilowatts alternating current or, with the consent of the interconnecting electric utility, up to 1,000 kilowatts alternating current; or (ii) 120 percent of the estimated annual electricity consumption of the school building at which the solar energy system is installed;\n(3) if installed on or adjacent to a school building receiving retail electric service from a utility that is subject to section 116C.779, subdivision 1, has a capacity that does not exceed the lesser of 1,000 kilowatts alternating current or 120 percent of the estimated annual electricity consumption of the school building at which the solar energy system is installed; and\n(4) has real-time and cumulative display devices, located in a prominent location accessible to students and the public, that indicate the system's electrical performance.\n(b) A school that receives a rebate or other financial incentive under section 216B.241 for a solar energy system and that demonstrates considerable need for financial assistance, as determined by the commissioner, is eligible for a grant under this section for the same solar energy system.\n(a) The commissioner must issue a request for proposals to utilities, schools, and developers who may wish to apply for a grant under this section on behalf of a school.\n(b) A utility or developer must submit an application to the commissioner on behalf of a school on a form prescribed by the commissioner. The form must include, at a minimum, the following information:\n(1) the capacity of the proposed solar energy system and the amount of electricity that is expected to be generated;\n(2) the current energy demand of the school building on which the solar energy generating system is to be installed and information regarding any distributed energy resource, including subscription to a community solar garden, that currently provides electricity to the school building;\n(3) a description of any solar thermal devices proposed as part of the solar energy system;\n(4) the total cost to purchase and install the solar energy system and the solar energy system's lifecycle cost, including removal and disposal at the end of the system's life;\n(5) a copy of the proposed contract agreement between the school and the utility to which the solar energy system is interconnected or the developer that includes provisions addressing responsibility for maintenance of the solar energy system;\n(6) the school's plan to make the solar energy system serve as a visible learning tool for students, teachers, and visitors to the school, including how the solar energy system may be integrated into the school's curriculum and provisions for real-time monitoring of the solar energy system performance for display in a prominent location within the school or on-demand in the classroom;\n(7) information that demonstrates the school's level of need for financial assistance available under this section;\n(8) information that demonstrates the school's readiness to implement the project, including but not limited to the availability of the site on which the solar energy system is to be installed and the level of the school's engagement with the utility providing electric service to the school building on which the solar energy system is to be installed on issues relevant to the implementation of the project, including metering and other issues;\n(9) with respect to the installation and operation of the solar energy system, the willingness and ability of the developer or the public utility to:\n(i) pay employees and contractors a prevailing wage rate, as defined in section 177.42, subdivision 6; and\n(ii) adhere to the provisions of section 177.43;\n(10) the school's projected reductions in electricity expenses resulting from purchasing and installing the solar energy system; and\n(11) any other information deemed relevant by the commissioner.\n(c) The commissioner must administer an open application process under this section at least twice annually.\n(d) The commissioner must develop administrative procedures governing the application and grant award process.\n(e) The school, the developer, or the utility to which the solar energy generating system is interconnected must annually submit to the commissioner on a form prescribed by the commissioner a report containing the following information for each of the 12 previous months:\n(1) the total number of kilowatt-hours of electricity consumed by the school;\n(2) the total number of kilowatt-hours generated by the solar energy generating system;\n(3) the amount paid by the school to its utility for electricity; and\n(4) any other information requested by the commissioner.\nAt the commissioner's request, a school awarded a grant under this section must provide the commissioner information regarding energy conservation measures implemented at the school building at which the solar energy system is installed. The commissioner may make recommendations to the school regarding cost-effective conservation measures it can implement and may provide technical assistance and direct the school to available financial assistance programs.\nThe commissioner must provide technical assistance to schools to develop and execute projects under this section.\nThe commissioner must award a grant from the account established under subdivision 3 to a school for the necessary costs associated with the purchase and installation of a solar energy system. The amount of the grant must be based on the commissioner's assessment of the school's need for financial assistance.\nNo application may be submitted under this section after December 31, 2032.\nBeginning January 15, 2022, and each year thereafter until January 15, 2035, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy regarding: (1) grants and amounts awarded to schools under this section during the previous year; (2) the amount of electricity generated by solar energy generating systems awarded a grant under this section; and (3) the impact on school electricity expenses.\nRenewable energy credits associated with the electricity generated by a solar energy generating system installed under this section in the electric service area of a public utility subject to section 116C.779 are the property of the public utility for the life of the solar energy generating system.",
	"repealed": false
}