{
	"id": "116.385",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.385",
	"title": "116.385 TRICHLOROETHYLENE; BAN.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Small business\" means a business that has less than 500 full-time equivalent employees.\n(c) \"Trichloroethylene\" means a chemical with the Chemical Abstract Services Registry Number of 79-01-6.\n(a) Beginning June 1, 2022, an owner or operator of a facility required to have an air emissions permit issued by the Pollution Control Agency may not use trichloroethylene at its permitted facility, including in any manufacturing, processing, or cleaning processes, except as otherwise provided in this section. Cessation of use must be made enforceable in the air emissions permit for the facility or in an enforceable agreement by June 1, 2022. The commissioner of the Pollution Control Agency must not issue an air emissions permit that authorizes using trichloroethylene at a permitted facility after January 1, 2022, except as described in paragraph (b) and subdivision 4.\n(b) If a small business needs additional time to assess replacement chemicals or modifications to facility operations, then by June 1, 2022, the commissioner shall include a schedule of compliance in the facility's permit or enter into an enforceable agreement that requires compliance with this section before June 1, 2023. A small business owner or operator requesting additional time under this paragraph must demonstrate compliance with the health-based value and health risk limits for trichloroethylene, as established by the Department of Health as of January 1, 2019. Owners or operators may be required to comply with additional restrictions based on impacts from nearby sources or background concentrations. Owners or operators may be required to provide additional information as requested by the commissioner to evaluate site-specific conditions or impacts.\nAn owner or operator that must comply with this section and elects to replace trichloroethylene with another chemical must replace trichloroethylene with a chemical demonstrated to be less toxic to human health and reviewed in a form determined and approved by the commissioner of the Pollution Control Agency.\n(a) The commissioner of the Pollution Control Agency shall grant exceptions to the prohibition in subdivision 2, for any of the following uses where compliance with the health-based value and health risk limits for trichloroethylene established by the Department of Health as of January 1, 2019, is demonstrated:\n(1) use of trichloroethylene in closed systems so that no trichloroethylene is emitted from the facility;\n(2) holding trichloroethylene or products containing trichloroethylene for distribution to a third party; and\n(3) a hospital licensed under sections 144.50 to 144.56, or an academic medical facility.\n(b) The commissioner of the Pollution Control Agency may grant exceptions to the prohibition in subdivision 2 through the variance process established in Minnesota Rules, part 7000.7000, for any of the following uses where compliance with the health-based value and health risk limits for trichloroethylene established by the Department of Health as of January 1, 2019, is demonstrated:\n(1) a facility that uses trichloroethylene exclusively for research and development, or other laboratory or experimental purposes; and\n(2) a facility that processes trichloroethylene for waste disposal.\n(c) Owners or operators of facilities seeking an exception under this section must submit information to the commissioner that specifies the exception that applies and provide all information needed to determine applicability.\nNothing in subdivision 4 shall be construed to authorize a use of an amount of trichloroethylene that exceeds the levels authorized in a stipulation agreement entered into between the Pollution Control Agency and a permittee that was in effect on June 1, 2022.\nThis act is the \"White Bear Area Neighborhood Concerned Citizens Group Ban TCE Act.\"",
	"repealed": false
}