{
	"id": "148E.0753",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.0753",
	"title": "148E.0753 EMERITUS ACTIVE LICENSE STATUS.",
	"text": "(a) At the time of license renewal, a licensee may apply for emeritus active license status by:\n(1) submitting a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(2) paying the fee specified in section 148E.180; and\n(3) demonstrating to the satisfaction of the board that the licensee is retired from social work practice as defined in section 148E.010, subdivisions 6 and 11, other than the limited practice allowed in subdivision 2.\n(b) By submitting an application for emeritus active license status, an applicant authorizes the board to:\n(1) investigate any information provided or requested in the application. The board may request that the applicant provide additional information, verification, or documentation;\n(2) determine if the applicant has met the continuing education requirements specified in sections 148E.130 to 148E.145; and\n(3) determine whether the applicant has met the supervision requirements specified in sections 148E.100 to 148E.125.\n(c) An application that the applicant has not completed and signed, or that is not accompanied by the correct fee, is void. The board must return the application to the applicant, along with any fee.\n(a) A licensee who has emeritus active license status is only authorized to engage in:\n(1) pro bono or unpaid social work practice as specified in section 148E.010, subdivisions 6 and 11; or\n(2) paid social work practice not to exceed 500 clock hours per calendar year for the exclusive purpose of:\n(i) providing licensing supervision as specified in sections 148E.100 to 148E.125;\n(ii) providing consultation to licensees as specified in section 148E.200, subdivision 2; or\n(iii) presenting continuing education activities as specified in section 148E.130, subdivision 9.\n(b) In all professional use of the social worker's name, a licensee must include \"emeritus active\" in all use of their LSW, LGSW, LISW, or LICSW license credential.\n(a) An applicant who has emeritus active license status may renew their license according to the requirements specified in section 148E.070 and must pay one-half of the renewal fee specified in section 148E.180, subdivision 3.\n(b) Failure to renew an emeritus active license status will result in an expired license as specified in section 148E.070.\n(c) At the time of license renewal, a licensee must provide evidence satisfactory to the board that the licensee has, during the renewal term, completed one-half of the clock hours of continuing education as specified in section 148E.130, including at least two clock hours in social work ethics.\nAn applicant may restore a license in emeritus active status to active license status according to section 148E.080.\nThe board may resolve any pending complaints against a licensee before approving an application for emeritus active license status specified in this section. The board may take action according to sections 148E.255 to 148E.290 against a licensee who has emeritus active license status specified in this section based on conduct occurring before the emeritus active license status or conduct occurring while the license is in emeritus active license status.",
	"repealed": false
}