{
	"id": "72A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.25",
	"title": "72A.25 UNFAIR COMPETITION.",
	"text": "Whenever the commissioner has reason to believe that any person engaged in the business of insurance is engaged in this state in any method of competition or in any act or practice in the conduct of that business which is not defined in section 72A.20, that said method of competition is unfair or that said act or practice is unfair or deceptive and that a proceeding in respect thereto would be to the interest of the public, the commissioner may issue and serve upon that person a statement of the charges in that respect and a notice of a hearing thereon to be held at a time and place fixed in the notice, which shall not be less than 20 days after the date of the service thereof. Each such hearing shall be conducted in the same manner as the hearings provided for in section 72A.22, and the provisions of that section as to service are made applicable to proceedings under this section. Upon good cause shown, the commissioner shall permit any person to intervene, appear and be heard at such hearing by counsel or in person. The commissioner shall, after the hearing, make a written report which shall include findings as to the facts and shall serve a copy thereof upon the person served with the statement of charges.\nIf the report charges a violation of sections 72A.17 to 72A.32 and if the method of competition, act, or practice charged has not been discontinued, the commissioner may, through the attorney general, at any time after 20 days after the service of the report, cause a petition to be filed in the District Court of Ramsey County, to enjoin and restrain that person from engaging in the method, act, or practice charged. A transcript of the proceedings before the commissioner, including all evidence taken and the report and findings, shall be filed with the petition. Upon the filing of the petition and transcript the court shall have jurisdiction of the proceedings and shall have power to make and enter appropriate orders in connection therewith and to issue such writs as are ancillary to its jurisdiction or necessary in its judgment to prevent injury to the public pendente lite.\nIf the court finds that the method of competition complained of is unfair or that the act or practice complained of is unfair and deceptive, and that the proceeding by the commissioner with respect thereto is to the interests of the public, it shall issue its order enjoining and restraining the continuance of that method of competition, act, or practice. The findings of the commissioner shall be given the same effect as those of a referee appointed pursuant to rule 53 of the Rules of Civil Procedure.\nIf either party shall apply to the court before the entry of its order for leave to adduce additional evidence, and shall show to the satisfaction of the court that said additional evidence is material and that there were reasonable grounds for the failure to adduce it in the proceeding before the commissioner, the court may order said additional evidence to be taken before the commissioner and to be adduced upon the hearing in such manner and upon such terms and conditions as to the court may seem proper. The commissioner may modify the findings of fact, or make new findings, by reason of the additional evidence so taken, and shall file those modified or new findings with the return of the additional evidence. Any such additional evidence and modified or new findings shall be considered by the court in making and entering its final order, together with the matters submitted in the original transcript.",
	"repealed": false
}