{
	"id": "245A.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.155",
	"title": "245A.155 CARE OF INDIVIDUALS ON MEDICAL MONITORING EQUIPMENT.",
	"text": "This section applies to foster care agencies and licensed foster care providers who place, supervise, or care for individuals who rely on medical monitoring equipment to sustain life or monitor a medical condition that could become life-threatening without proper use of the medical equipment in respite care or foster care.\nIn order for an agency to place an individual who relies on medical equipment to sustain life or monitor a medical condition that could become life-threatening without proper use of the medical equipment with a foster care provider, the agency must ensure that the foster care provider has received the training to operate such equipment as observed and confirmed by a qualified source, and that the provider:\n(1) is currently caring for an individual who is using the same equipment in the foster home; or\n(2) has written documentation that the foster care provider has cared for an individual who relied on such equipment within the past six months; or\n(3) has successfully completed training with the individual being placed with the provider.\nA foster care provider shall not care for an individual who relies on medical equipment to sustain life or monitor a medical condition unless the provider has received the training to operate such equipment as observed and confirmed by a qualified source, and:\n(1) is currently caring for an individual who is using the same equipment in the foster home; or\n(2) has written documentation that the foster care provider has cared for an individual who relied on such equipment within the past six months; or\n(3) has successfully completed training with the individual being placed with the provider.\nFor purposes of this section, a \"qualified source\" includes a health care professional or an individual who provides training on such equipment.\nThe agency supervising the foster care provider shall keep a training and skills form on file for each foster care provider and update the form annually. The agency placing the individual shall obtain a copy of the training and skills form from the foster care provider or the agency supervising the foster care provider and shall keep it and any updated information on file for the duration of the placement. The form must be made available to the parents or the primary caregiver and social worker of the individual, or the individual, whichever is applicable, in order to make an informed placement decision. The agency shall use the training and skills form developed by the commissioner of human services.",
	"repealed": false
}