{
	"id": "144G.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.63",
	"title": "144G.63 ORIENTATION AND ANNUAL TRAINING REQUIREMENTS.",
	"text": "(a) All staff providing and supervising direct services must complete an orientation to assisted living facility licensing requirements and regulations before providing assisted living services to residents. The orientation may be incorporated into the training required under subdivision 5. The orientation need only be completed once for each staff person and is not transferable to another facility, except as provided in paragraph (b).\n(b) A staff person is not required to repeat the orientation required under subdivision 2 if the staff person transfers from one licensed assisted living facility to another facility operated by the same licensee or by a licensee affiliated with the same corporate organization as the licensee of the first facility, or to another facility managed by the same entity managing the first facility. The facility to which the staff person transfers must document that the staff person completed the orientation at the prior facility. The facility to which the staff person transfers must nonetheless provide the transferred staff person with supplemental orientation specific to the facility and document that the supplemental orientation was provided. The supplemental orientation must include the types of assisted living services the staff person will be providing, the facility's category of licensure, and the facility's emergency procedures. A staff person cannot transfer to an assisted living facility with dementia care without satisfying the additional training requirements under section 144G.83.\n(a) The orientation must contain the following topics:\n(1) an overview of this chapter;\n(2) an introduction and review of the facility's policies and procedures related to the provision of assisted living services by the individual staff person;\n(3) handling of emergencies and use of emergency services;\n(4) compliance with and reporting of the maltreatment of vulnerable adults under section 626.557 to the Minnesota Adult Abuse Reporting Center (MAARC);\n(5) the assisted living bill of rights and staff responsibilities related to ensuring the exercise and protection of those rights;\n(6) the principles of person-centered planning and service delivery and how they apply to direct support services provided by the staff person;\n(7) handling of residents' complaints, reporting of complaints, and where to report complaints, including information on the Office of Health Facility Complaints;\n(8) consumer advocacy services of the Office of Ombudsman for Long-Term Care, Office of Ombudsman for Mental Health and Developmental Disabilities, Managed Care Ombudsman at the Department of Human Services, county-managed care advocates, or other relevant advocacy services; and\n(9) a review of the types of assisted living services the staff member will be providing and the facility's category of licensure.\n(b) In addition to the topics in paragraph (a), orientation may also contain training on providing services to residents with hearing loss. Any training on hearing loss provided under this subdivision must be high quality and research based, may include online training, and must include training on one or more of the following topics:\n(1) an explanation of age-related hearing loss and how it manifests itself, its prevalence, and the challenges it poses to communication;\n(2) health impacts related to untreated age-related hearing loss, such as increased incidence of dementia, falls, hospitalizations, isolation, and depression; or\n(3) information about strategies and technology that may enhance communication and involvement, including communication strategies, assistive listening devices, hearing aids, visual and tactile alerting devices, communication access in real time, and closed captions.\nStaff providing assisted living services must be oriented specifically to each individual resident and the services to be provided. This orientation may be provided in person, orally, in writing, or electronically.\nAll direct care staff and supervisors providing direct services must demonstrate an understanding of the training specified in section 144G.64.\n[See Note.]\n(a) All staff that perform direct services must complete at least eight hours of annual training for each 12 months of employment. The training may be obtained from the facility or another source and must include topics relevant to the provision of assisted living services. The annual training must include:\n(1) training on reporting of maltreatment of vulnerable adults under section 626.557;\n(2) review of the assisted living bill of rights and staff responsibilities related to ensuring the exercise and protection of those rights;\n(3) review of infection control techniques used in the home and implementation of infection control standards including a review of hand washing techniques; the need for and use of protective gloves, gowns, and masks; appropriate disposal of contaminated materials and equipment, such as dressings, needles, syringes, and razor blades; disinfecting reusable equipment; disinfecting environmental surfaces; and reporting communicable diseases;\n(4) effective approaches to use to problem solve when working with a resident's challenging behaviors, and how to communicate with residents who have dementia, Alzheimer's disease, or related disorders;\n(5) review of the facility's policies and procedures relating to the provision of assisted living services and how to implement those policies and procedures; and\n(6) the principles of person-centered planning and service delivery and how they apply to direct support services provided by the staff person.\n(b) In addition to the topics in paragraph (a), annual training may also contain training on providing services to residents with hearing loss. Any training on hearing loss provided under this subdivision must be high quality and research based, may include online training, and must include training on one or more of the following topics:\n(1) an explanation of age-related hearing loss and how it manifests itself, its prevalence, and challenges it poses to communication;\n(2) the health impacts related to untreated age-related hearing loss, such as increased incidence of dementia, falls, hospitalizations, isolation, and depression; or\n(3) information about strategies and technology that may enhance communication and involvement, including communication strategies, assistive listening devices, hearing aids, visual and tactile alerting devices, communication access in real time, and closed captions.\nThe assisted living facility must implement all orientation and training topics covered in this section.\nThe assisted living facility shall retain evidence in the employee record of each staff person having completed the orientation and training required by this section.",
	"repealed": false
}