{
	"id": "60K.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.46",
	"title": "60K.46 REQUIRED AND PROHIBITED ACTS.",
	"text": "(a) For the purpose of this section, \"personal solicitation\" means any contact by a producer, or any person acting on behalf of a producer, made for the purpose of selling or attempting to sell insurance, when either the producer or the person acting for the producer contacts the buyer in person, by telephone, or by electronic means, except:\n(1) an attempted sale in which the buyer personally knows the identity of the producer, the name of the general agency, if any, which the producer represents, and the fact that the producer is an insurance producer;\n(2) an attempted sale in which the prospective purchaser of insurance initiated the contact; or\n(3) a personal contact which takes place at the producer's place of business.\n(b) Before a personal solicitation, the producer or person acting for a producer shall, at the time of initial personal contact with the potential buyer, clearly and expressly disclose in writing:\n(1) the name of the person making the contact;\n(2) the name of the producer, general agency, or insurer that the person represents; and\n(3) the fact that the producer, agency, or insurer is in the business of selling insurance.\nIf the initial personal contact is made by telephone, the disclosures required by this subdivision need not be made in writing.\nNo person shall charge a fee for any services rendered in connection with the solicitation, negotiation, or servicing of any insurance contract unless:\n(1) before rendering the services, a written statement is provided disclosing:\n(i) the services for which fees are charged;\n(ii) the amount of the fees;\n(iii) that the fees are charged in addition to premiums; and\n(iv) that premiums include a commission; and\n(2) all fees charged are reasonable in relation to the services rendered.\nA duly licensed producer may pay commissions or assign or direct that commissions be paid to a partnership of which the producer is a member, employee, or agent, or to a corporation of which the producer is an officer, employee, or agent.\nIn recommending the purchase of any life, endowment, individual accident and sickness, long-term care, annuity, life-endowment, or Medicare supplement insurance to a customer, a producer must have reasonable grounds for believing that the recommendation is suitable for the customer and must make reasonable inquiries to determine suitability. The suitability of a recommended purchase of insurance will be determined by reference to the totality of the particular customer's circumstances, including, but not limited to, the customer's income, the customer's need for insurance, and the values, benefits, and costs of the customer's existing insurance program, if any, when compared to the values, benefits, and costs of the recommended policy or policies. This subdivision does not apply to limited lines insurance under section 60K.38, subdivision 1, paragraph (c).\nAll premiums or other money received by a producer from an insured or applicant for insurance must be promptly deposited directly in a business checking, savings, or other similar account maintained by the producer or agency, unless the money is forwarded directly to the designated insurer.\nExcept as otherwise provided by law, no insurance producer may disclose or cause to be disclosed to any other person the identity of a person insured through the producer without the consent of the insured.\nAn insurance producer having express authority to bind coverage, who orally agrees on behalf of an insurer to provide insurance coverage, or to alter an existing insurance agreement, shall execute and forward a memorandum or binder containing the terms of the oral agreement to the insured within five business days from the time the oral agreement is entered, unless the insurer forwards the information. The memorandum of coverage or binder may be forwarded by mail, facsimile, or electronically. The memorandum of coverage or binder must be forwarded by mail, unless the insured authorizes facsimile or electronic transmission of it. A memorandum of coverage or binder must be provided by the insurer to the policyholder upon request.\nAn insurance producer shall not issue a certificate of insurance, or other evidence of insurance coverage that either affirmatively or negatively amends, extends, or alters the coverage as provided by the policy, or provides notice of cancellation to a third party that exceeds the statutory notice requirement to a policyholder.",
	"repealed": false
}