{
	"id": "160.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.83",
	"title": "160.83 RUSTIC ROADS PROGRAM.",
	"text": "A \"rustic road\" is a road that is not on the state-aid system that has the following characteristics: outstanding natural features or scenic beauty; an average daily traffic volume of less than 150 vehicles per day; year-round use as a local access road; and maximum allowable speed of 45 miles per hour.\nA road authority other than the commissioner may, by resolution, designate a road or highway under its jurisdiction a rustic road and the road authority may designate the type and character of vehicles that may be operated on the rustic road; designate the road or a portion of the road as a pedestrian way or bicycle way, or both; and establish priority of right-of-way, paint lines, and construct dividers to physically separate vehicular, bicycle, or pedestrian traffic.\nTwo or more road authorities may jointly designate a rustic road along a common boundary or into or through their jurisdictions. The road authorities may enter into agreements to divide the costs and responsibility for maintaining the rustic road.\nA rustic road must be maintained by the road authority having jurisdiction over the road and is not eligible for state-aid funding. State money must not be spent to construct, reconstruct, maintain, or improve a rustic road.\n(a) A rustic road may be maintained at a level less than the minimum standards required for state-aid highways, roads, and streets, but must be maintained at the level required to serve anticipated traffic volumes. Where a road has been designated by resolution as a rustic road and speed limits have been posted under subdivision 1, the road authority with jurisdiction over the road, and its officers and employees, are exempt from liability for any tort claim for injury to person or property arising from travel on the rustic road related to its maintenance, design, or condition if:\n(1) the maintenance, design, or condition is consistent with the anticipated use as described in subdivision 2; and\n(2) the maintenance, design, or condition is not grossly negligent.\n(b) Nothing in this subdivision exempts a road authority from its duty to maintain bridges under chapter 165 or other applicable law.",
	"repealed": false
}