{
	"id": "116X.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116X.05",
	"title": "116X.05 ENVIRONMENT AND NATURAL RESOURCES TRUST FUND COMMUNITY GRANT ADVISORY COUNCIL; REPORTING.",
	"text": "The commissioner of natural resources must establish an Environment and Natural Resources Trust Fund Community Grant Advisory Council.\n(a) The commissioner, in consultation with the commissioners of health and the Pollution Control Agency, must appoint 11 residents of Minnesota to the advisory council, and the appointees must include:\n(1) two members who are members of the Minnesota Ojibwe Tribe;\n(2) two members who are members of the Minnesota Dakota Tribe; and\n(3) four members who identify as Black or African American, Hispanic or Latino, Asian, or Pacific Islander or as members of a community of color.\n(b) In addition to the members appointed under paragraph (a), the commissioner, in consultation with the commissioners of health and the Pollution Control Agency, may appoint up to eight additional residents of Minnesota to the advisory council when, in the commissioner's discretion, it is necessary to ensure that the advisory council is sufficiently representative of various Minnesota communities.\n(c) The commissioner must make appointments to the advisory council under this subdivision that result in substantially equal representation of rural, suburban, and urban communities.\n(d) The membership appointed under paragraphs (a) and (b) must include persons who:\n(1) have experience or expertise in the science, policy, or practice of the protection, conservation, preservation, and enhancement of the state's air, water, land, fish, wildlife, and other natural resources, including expertise in understanding the cultural context in which these activities are undertaken from the perspective of Tribal communities;\n(2) have strong knowledge of environment and natural resource issues around the state, including those that are of particular importance to Tribal communities; and\n(3) have demonstrated the ability to work in a collaborative environment.\n(e) Members serve staggered three-year terms, beginning in January of the first year and continuing through the end of December of the final year. Members continue to serve until their replacement is named. Initial appointees may be appointed to terms of less than three years to establish a structure of staggered terms.\n(f) A member appointed under this subdivision may not be a registered lobbyist.\n(a) The advisory council must:\n(1) advise the commissioner on developing forms and applications and reporting for grants awarded under the grant program;\n(2) review proposed grant program policies and budgets for the upcoming year;\n(3) propose changes to the grant program, as needed;\n(4) review other relevant information;\n(5) make recommendations to the legislature and the commissioner for improving management of the grant program; and\n(6) review and advise on recipient eligibility.\n(b) The commissioner must provide the council with the information required to perform its duties under this subdivision.\nMembers of the council are entitled to per diem and reimbursement for expenses incurred in the services of the commission, as provided in section 15.059, subdivision 3.\nMeetings of the advisory council must be open to the public and are subject to chapter 13D.",
	"repealed": false
}