{
	"id": "297A.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.66",
	"title": "297A.66 JURISDICTION TO REQUIRE COLLECTION AND REMITTANCE OF TAX.",
	"text": "(a) To the extent allowed by the United States Constitution and the laws of the United States, the terms \"retailer maintaining a place of business in this state,\" and \"marketplace provider maintaining a place of business in this state,\" or similar terms mean a retailer or marketplace provider:\n(1) having or maintaining within this state, directly or by a subsidiary or an affiliate, an office, place of distribution, sales, storage, or sample room or place, warehouse, or other place of business, including the employment of a resident of this state who works from a home office in this state; or\n(2) having a representative, including, but not limited to, an affiliate, agent, salesperson, canvasser, solicitor, or other third party operating in this state under the authority of the retailer or marketplace provider, or its subsidiary, for any purpose, including the repairing, selling, delivering, installing, facilitating sales, processing sales, or soliciting of orders for the retailer's or a retailer's goods or services, or the leasing of tangible personal property located in this state, whether the place of business or agent, representative, affiliate, salesperson, canvasser, or solicitor is located in the state permanently or temporarily, or whether or not the retailer or marketplace provider, subsidiary, or affiliate is authorized to do business in this state.\n(b) To the extent allowed by the United States Constitution and the laws of the United States, the terms \"retailer not maintaining a place of business in this state,\" and \"marketplace provider not maintaining a place of business in this state,\" or similar terms mean a retailer or marketplace provider making or facilitating retail sales from outside this state to a destination within this state and not maintaining a place of business in this state as provided in paragraph (a) that engages in the regular or systematic soliciting of sales from potential customers in this state by:\n(1) distribution, by mail or otherwise, of catalogs, periodicals, advertising flyers, or other written solicitations of business to customers in this state;\n(2) advertisements on billboards or other outdoor advertising in this state;\n(3) advertisements in newspapers published in this state;\n(4) advertisements in trade journals or other periodicals the circulation of which is primarily within this state;\n(5) advertisements in a Minnesota edition of a national or regional publication or a limited regional edition in which this state is included as part of a broader regional or national publication that are not placed in other geographically defined editions of the same issue of the same publication;\n(6) advertisements in regional or national publications in an edition that is not by its contents geographically targeted to Minnesota but is sold over the counter in Minnesota or by subscription to Minnesota residents;\n(7) advertisements broadcast on a radio or television station located in Minnesota; or\n(8) any other solicitation by telephone, computer database, cable, optic, microwave, or any other communication system, including but not limited to a website accessible from within Minnesota.\nThe location of independent vendors that provide products or services to a retailer or marketplace provider in connection with a retailer or marketplace provider's solicitation of customers within this state, including such products and services as creation of copy, printing, distribution, and recording is not considered in determining whether the retailer or marketplace provider is required to collect tax. Paragraph (b) must be construed without regard to the state from which distribution of the materials originated or in which they were prepared.\n(c) \"Regular or systematic soliciting of sales from potential customers in this state\" means the retailer not maintaining a place of business in this state or marketplace provider not maintaining a place of business in this state is engaged in any of the solicitations listed in paragraph (b), and:\n(1) makes or facilitates 200 or more retail sales from outside this state to destinations in this state during the prior 12-month period; or\n(2) makes or facilitates retail sales totaling more than $100,000 from outside this state to destinations in this state during the prior 12-month period.\n(d) \"Marketplace provider\" means any person who facilitates a retail sale by a retailer by:\n(1) listing or advertising for sale by the retailer in any forum, tangible personal property, services, or digital goods that are subject to tax under this chapter; and\n(2) either directly or indirectly through agreements or arrangements with third parties collecting payment from the customer and transmitting that payment to the retailer regardless of whether the marketplace provider receives compensation or other consideration in exchange for its services.\n(e) \"Destination of a sale\" means the location to which the retailer makes delivery of the property sold, or causes the property to be delivered, to the purchaser of the property, or to the agent or designee of the purchaser. The delivery may be made by any means, including the United States Postal Service or a for-hire carrier.\n[See Note.]\n(a) Except as provided in paragraph (d), a retailer maintaining a place of business in this state and a retailer not maintaining a place of business in this state who makes retail sales in Minnesota or to a destination in Minnesota shall collect sales and use taxes and remit them to the commissioner under section 297A.77 for all retail sales other than those facilitated by a marketplace provider maintaining a place of business in this state or a marketplace provider not maintaining a place of business in this state that is required to collect and remit sales and use taxes under paragraph (b).\n(b) Except as provided in paragraph (d), a marketplace provider maintaining a place of business in this state and a marketplace provider not maintaining a place of business in this state who facilitates retail sales in Minnesota or to a destination in Minnesota shall collect sales and use taxes and remit them to the commissioner under section 297A.77 unless:\n(1) the retailer provides a copy of the retailer's registration to collect sales and use taxes in this state to the marketplace provider; and\n(2) the marketplace provider and retailer agree that the retailer will collect and remit the sales and use taxes on marketplace sales facilitated by the marketplace provider.\n(c) Nothing in paragraph (b) shall be construed to interfere with the ability of a marketplace provider and a retailer to enter into an agreement regarding fulfillment of the requirements of this chapter.\n(d) A retailer not maintaining a place of business in this state and a marketplace provider not maintaining a place of business in this state shall:\n(1) begin collecting and remitting sales and use taxes to the commissioner on the first day of a calendar month occurring no later than 60 days after the retailer or marketplace provider engages in regular or systematic soliciting of sales from potential customers in this state; and\n(2) continue to collect and remit sales and use taxes to the commissioner until at least the last day of the 12th calendar month following the calendar month in which the retailer or marketplace provider began collecting and remitting sales and use taxes under clause (1).\n(e) A retailer not maintaining a place of business in this state and a marketplace provider not maintaining a place of business in this state may cease collecting and remitting sales and use taxes to the commissioner after the period in paragraph (d), clause (2), if the retailer or marketplace provider no longer engages in regular or systematic soliciting of sales from potential customers in this state.\n(f) A retailer or marketplace provider may cease collecting and remitting sales and use taxes under paragraph (e) only after notifying the commissioner that the retailer or marketplace provider is no longer engaged in the regular or systematic soliciting of sales from potential customers in this state. The commissioner shall prescribe the content, format, and manner of the notification pursuant to section 270C.30. If a retailer or marketplace provider subsequently engages in regular or systematic soliciting of sales from potential customers in this state, the retailer shall again comply with the requirements of paragraph (d).\n[See Note.]\n(a) A marketplace provider is deemed the retailer or seller for all retail sales it facilitates, and is subject to audit on the retail sales it facilitates if it is required to collect sales and use taxes and remit them to the commissioner under subdivision 2, paragraphs (b) and (c).\n(b) A marketplace provider is not liable for failing to file, collect, and remit sales and use taxes to the commissioner if the marketplace provider demonstrates that the error was due to incorrect or insufficient information given to the marketplace provider by the retailer. This paragraph does not apply if the marketplace provider and the marketplace retailer are related as defined in subdivision 4, paragraph (b).\n(a) An entity is an \"affiliate\" of the retailer for purposes of subdivision 1, paragraph (a), if the entity:\n(1) uses its facilities or employees in this state to advertise, promote, or facilitate the establishment or maintenance of a market for sales of items by the retailer to purchasers in this state or for the provision of services to the retailer's purchasers in this state, such as accepting returns of purchases for the retailer, providing assistance in resolving customer complaints of the retailer, or providing other services;\n(2) has the same or a similar business name to the retailer and sells, from a location or locations in this state, tangible personal property, digital goods, or services, taxable under this chapter, that are similar to that sold by the retailer;\n(3) maintains an office, distribution facility, salesroom, warehouse, storage place, or other similar place of business in this state to facilitate the delivery of tangible personal property, digital goods, or services sold by the retailer to its customers in this state;\n(4) maintains a place of business in this state and uses trademarks, service marks, or trade names in this state that are the same or substantially similar to those used by the retailer, and that use is done with the express or implied consent of the holder of the marks or names;\n(5) delivers, installs, or assembles tangible personal property in this state, or performs maintenance or repair services on tangible personal property in this state, for tangible personal property sold by the retailer;\n(6) facilitates the delivery of tangible personal property to customers of the retailer by allowing the customers to pick up tangible personal property sold by the retailer at a place of business the entity maintains in this state; or\n(7) shares management, business systems, business practices, or employees with the retailer, or engages in intercompany transactions with the retailer related to the activities that establish or maintain the market in this state of the retailer.\n(b) Two entities are related parties under this section if one of the entities meets at least one of the following tests with respect to the other entity:\n(1) one or both entities is a corporation, and one entity and any party related to that entity in a manner that would require an attribution of stock from the corporation to the party or from the party to the corporation under the attribution rules of section 318 of the Internal Revenue Code owns directly, indirectly, beneficially, or constructively at least 50 percent of the value of the corporation's outstanding stock;\n(2) one or both entities is a partnership, estate, or trust and any partner or beneficiary, and the partnership, estate, or trust and its partners or beneficiaries own directly, indirectly, beneficially, or constructively, in the aggregate, at least 50 percent of the profits, capital, stock, or value of the other entity or both entities;\n(3) an individual stockholder and the members of the stockholder's family (as defined in section 318 of the Internal Revenue Code) owns directly, indirectly, beneficially, or constructively, in the aggregate, at least 50 percent of the value of both entities' outstanding stock;\n(4) the entities are related within the meaning of subsections (b) and (c) of section 267 or 707(b)(1) of the Internal Revenue Code; or\n(5) the entities have one or more ownership relationships and the relationships were designed with a principal purpose of avoiding the application of this section.\n(c) An entity is an affiliate under the provisions of this subdivision if the requirements of paragraphs (a) and (b) are met during any part of the 12-month period ending on the first day of the month before the month in which the sale was made.\n[See Note.]\n(a) \"Solicitor,\" for purposes of subdivision 1, paragraph (a), means a person, whether an independent contractor or other representative, who directly or indirectly solicits business for the retailer.\n(b) A retailer is presumed to have a solicitor in this state if it enters into an agreement with a resident under which the resident, for a commission or other substantially similar consideration, directly or indirectly refers potential customers, whether by a link on an Internet website, or otherwise, to the seller. This paragraph only applies if the total gross receipts are at least $10,000 in the 12-month period ending on the last day of the most recent calendar quarter before the calendar quarter in which the sale is made. For purposes of this paragraph, gross receipts means receipts from sales to customers located in the state who were referred to the retailer by all residents with this type of agreement with the retailer.\n(c) The presumption under paragraph (b) may be rebutted by proof that the resident with whom the seller has an agreement did not engage in any solicitation in the state on behalf of the retailer that would satisfy the nexus requirement of the United States Constitution during the 12-month period in question. Nothing in this section shall be construed to narrow the scope of the terms affiliate, agent, salesperson, canvasser, or other representative for purposes of subdivision 1, paragraph (a).\n(d) For purposes of this subdivision, \"resident\" includes an individual who is a resident of this state, as defined in section 290.01, or a business that owns tangible personal property located in this state or has one or more employees providing services for the business in this state.\n(e) This subdivision does not apply to chapter 290 and does not expand or contract the jurisdiction to tax a trade or business under chapter 290.\nMS 2018 [Repealed, 1Sp2019 c 6 art 3 s 19]\nIf the state has withdrawn its membership or been expelled from the streamlined sales and use tax agreement, it shall not use a seller's registration with the central registration system and the collection of sales and use taxes in the state as a factor in determining whether the seller has nexus with that state for any tax at any time.\nAn accommodations intermediary shall collect sales tax and remit it to the commissioner under section 297A.77 for services provided in connection with or for lodging located in this state.",
	"repealed": false
}