{
	"id": "129D.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/129D.13",
	"title": "129D.13 GRANTS.",
	"text": "The commissioner shall distribute the money provided by sections 129D.11 to 129D.13. Annually the commissioner shall make block grants which shall be distributed in equal amounts to public stations for operational costs. The commissioner shall allocate money appropriated for the purposes of sections 129D.11 to 129D.13 in such a manner that each eligible public station receives a block grant. In addition, the commissioner shall make matching grants to public stations. Matching grants shall be used for operational costs and shall be allocated using the procedure developed for distribution of state money under this section for grants made in fiscal year 1979. No station's matching grant in any fiscal year shall exceed the amount of Minnesota-based contributions received by that station in the previous fiscal year. Grants made pursuant to this subdivision may only be given to those federally licensed stations that are certified as eligible for community service grants through the Corporation for Public Broadcasting. Grant funds not expended by a station during the first year of the biennium do not cancel and may be carried over into the second fiscal year.\nIn calculating the amount of contributions received by a public station pursuant to subdivision 1, there shall be excluded: contributions, whether monetary or in kind, from the Corporation for Public Broadcasting; tax generated funds, including payments by public or private elementary and secondary schools; that portion of any foundation or corporation donation in excess of $2,500 from any one contributor in the previous station fiscal year; contributions from any source if made for the purpose of capital expenditures; and contributions from all sources based outside the state.\nEach station receiving a grant shall report annually by August 1 to the commissioner the purposes for which the money was used in the past year and the anticipated use of the money in the next year. This report shall be submitted along with a new grant request submission. If the report is not submitted, the commissioner may redistribute that money to other educational stations.\n[Repealed, 2009 c 78 art 9 s 9]",
	"repealed": false
}