{
	"id": "315.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.23",
	"title": "315.23 INCORPORATION OF DIOCESAN COUNCIL, SYNOD, PRESBYTERY, CONFERENCE, ASSOCIATION, CONSOCIATION, OR SIMILAR ORGANIZATIONS.",
	"text": "A diocesan council, synod, presbytery, conference, association, consociation, or other general organization for ecclesiastical or religious purposes, existing in a church or religious denomination in this state, and composed of or representing several parishes, congregations, or particular churches under church law, may form a corporation. To do so, it must adopt a canon or resolution stating:\n(1) its purpose to form a corporation;\n(2) its name and its general purposes and powers, consistent with law;\n(3) the name of the church or religious denomination to which the body organizing the corporation belongs, and the district or territorial limits of its jurisdiction;\n(4) the number and official titles of the officers through whom it will act, by whom and how the officers are elected or appointed, the length of their terms, and their general duties, powers, and authority; and\n(5) the names and addresses of the first officers of the corporation.\nA copy of the resolution or canon, certified by the presiding officer of the body adopting it, verified by the affidavit of its secretary or clerk, and endorsed with the certificate of the attorney general that it conforms to law, must be filed with the county recorder of the county where the body is located. The county recorder shall record it, including the endorsement, and issue a certificate that the law has been complied with and the body is incorporated according to law. The county recorder shall keep an alphabetical index of these corporations.\nThe body organizing the corporation or its successor may amend or modify the resolution under which the corporation was formed. It may change its jurisdictional limits, the number, official titles, terms of office, or the manner of electing or appointing officers, or their duties, powers, and authority, or the purposes and powers of the corporation. The change must be consistent with law, and not impair trusts or vested rights of property. The amendment must be made by resolution or canon adopted at two successive sessions of the body, so certified, verified, and recorded with the county recorder where the body is located.",
	"repealed": false
}