{
	"id": "181.9447",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.9447",
	"title": "181.9447 USE OF EARNED SICK AND SAFE TIME.",
	"text": "An employee may use accrued earned sick and safe time for:\n(1) an employee's:\n(i) mental or physical illness, injury, or other health condition;\n(ii) need for medical diagnosis, care, or treatment of a mental or physical illness, injury, or health condition;\n(iii) need for preventive medical or health care; or\n(iv) need to make arrangements for or attend funeral services or a memorial, or address financial or legal matters that arise after the death of a family member;\n(2) care of a family member:\n(i) with a mental or physical illness, injury, or other health condition;\n(ii) who needs medical diagnosis, care, or treatment of a mental or physical illness, injury, or other health condition; or\n(iii) who needs preventive medical or health care;\n(3) absence due to domestic abuse, sexual assault, or stalking of the employee or employee's family member, provided the absence is to:\n(i) seek medical attention related to physical or psychological injury or disability caused by domestic abuse, sexual assault, or stalking;\n(ii) obtain services from a victim services organization;\n(iii) obtain psychological or other counseling;\n(iv) seek relocation or take steps to secure an existing home due to domestic abuse, sexual assault, or stalking; or\n(v) seek legal advice or take legal action, including preparing for or participating in any civil or criminal legal proceeding related to or resulting from domestic abuse, sexual assault, or stalking;\n(4) closure of the employee's place of business due to weather or other public emergency or an employee's need to care for a family member whose school or place of care has been closed due to weather or other public emergency;\n(5) the employee's inability to work or telework because the employee is: (i) prohibited from working by the employer due to health concerns related to the potential transmission of a communicable illness related to a public emergency; or (ii) seeking or awaiting the results of a diagnostic test for, or a medical diagnosis of, a communicable disease related to a public emergency and such employee has been exposed to a communicable disease or the employee's employer has requested a test or diagnosis; and\n(6) when it has been determined by the health authorities having jurisdiction or by a health care professional that the presence of the employee or family member of the employee in the community would jeopardize the health of others because of the exposure of the employee or family member of the employee to a communicable disease, whether or not the employee or family member has actually contracted the communicable disease.\nFor the purposes of this subdivision, a public emergency shall include a declared emergency as defined in section 12.03 or a declared local emergency under section 12.29.\nAn employer may require notice of the need for use of earned sick and safe time as provided in this paragraph. If the need for use is foreseeable, an employer may require advance notice of the intention to use earned sick and safe time but must not require more than seven days' advance notice. If the need is unforeseeable, an employer may require an employee to give notice of the need for earned sick and safe time as soon as practicable. An employer that requires notice of the need to use earned sick and safe time in accordance with this subdivision shall have a written policy containing reasonable procedures for employees to provide notice of the need to use earned sick and safe time, and shall provide a written copy of such policy to employees. If a copy of the written policy has not been provided to an employee, an employer shall not deny the use of earned sick and safe time to the employee on that basis.\n(a) When an employee uses earned sick and safe time for more than three consecutive scheduled work days, an employer may require reasonable documentation that the earned sick and safe time is covered by subdivision 1.\n(b) For earned sick and safe time under subdivision 1, clauses (1), (2), (5), and (6), reasonable documentation may include a signed statement by a health care professional indicating the need for use of earned sick and safe time. However, if the employee or employee's family member did not receive services from a health care professional, or if documentation cannot be obtained from a health care professional in a reasonable time or without added expense, then reasonable documentation for the purposes of this paragraph may include a written statement from the employee indicating that the employee is using or used earned sick and safe time for a qualifying purpose covered by subdivision 1, clause (1), (2), (5), or (6).\n(c) For earned sick and safe time under subdivision 1, clause (3), an employer must accept a court record or documentation signed by a volunteer or employee of a victims services organization, an attorney, a police officer, or an antiviolence counselor as reasonable documentation. If documentation cannot be obtained in a reasonable time or without added expense, then reasonable documentation for the purposes of this paragraph may include a written statement from the employee indicating that the employee is using or used earned sick and safe time for a qualifying purpose covered under subdivision 1, clause (3).\n(d) For earned sick and safe time to care for a family member under subdivision 1, clause (4), an employer must accept as reasonable documentation a written statement from the employee indicating that the employee is using or used earned sick and safe time for a qualifying purpose as reasonable documentation.\n(e) An employer must not require disclosure of details relating to domestic abuse, sexual assault, or stalking or the details of an employee's or an employee's family member's medical condition as related to an employee's request to use earned sick and safe time under this section.\n(f) Written statements by an employee may be written in the employee's first language and need not be notarized or in any particular format.\nAn employer may not require, as a condition of an employee using earned sick and safe time, that the employee seek or find a replacement worker to cover the hours the employee uses as earned sick and safe time.\nEarned sick and safe time may be used in the same increment of time for which employees are paid, provided an employer is not required to provide leave in less than 15-minute increments nor can the employer require use of earned sick and safe time in more than four-hour increments.\n(a) An employer shall not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against a person because the person has exercised or attempted to exercise rights protected under this act, including but not limited to because the person requested earned sick and safe time, used earned sick and safe time, requested a statement of accrued sick and safe time, informed any person of his or her potential rights under sections 181.9445 to 181.9448, made a complaint or filed an action to enforce a right to earned sick and safe time under this section, or is or was participating in any manner in an investigation, proceeding, or hearing under this chapter.\n(b) It shall be unlawful for an employer's absence control policy or attendance point system to count earned sick and safe time taken under sections 181.9445 to 181.9448 as an absence that may lead to or result in retaliation or any other adverse action.\n(c) It shall be unlawful for an employer or any other person to report or threaten to report the actual or suspected citizenship or immigration status of a person or their family member to a federal, state, or local agency for exercising or attempting to exercise any right protected under sections 181.9445 to 181.9448.\n(d) A person need not explicitly refer to sections 181.9445 to 181.9448 or the rights enumerated herein to be protected from retaliation.\n(a) During any use of earned sick and safe time, the employer must maintain coverage under any group insurance policy, group subscriber contract, or health care plan for the employee and any dependents, as if the employee was not using earned sick and safe time, provided, however, that the employee must continue to pay any employee share of the cost of such benefits.\n(b) An employee returning from a leave under this section is entitled to return to employment at the same rate of pay the employee had been receiving when the leave commenced, plus any automatic adjustments in the employee's pay scale that occurred during the leave period. The employee returning from a leave is entitled to retain all accrued preleave benefits of employment and seniority as if there had been no interruption in service, provided that nothing under this section prevents the accrual of benefits or seniority during the leave pursuant to a collective bargaining or other agreement between the employer and employees.\nAn employee, by agreement with the employer, may return to work part time during the leave period without forfeiting the right to return to employment at the end of the leave, as provided under this section.\n(a) Employers must give notice to all employees that they are entitled to earned sick and safe time, including the amount of earned sick and safe time, the accrual year for the employee, the terms of its use under this section, and a copy of the written policy for providing notice as provided under subdivision 2; that retaliation against employees who request or use earned sick and safe time is prohibited; and that each employee has the right to file a complaint or bring a civil action if earned sick and safe time is denied by the employer or the employee is retaliated against for requesting or using earned sick and safe time.\n(b) Employers must supply employees with a notice in English and the primary language of the employee, as identified by the employee, that contains the information required in paragraph (a) at commencement of employment or January 1, 2024, whichever is later.\n(c) The means used by the employer must be at least as effective as the following options for providing notice:\n(1) posting a copy of the notice at each location where employees perform work and where the notice must be readily observed and easily reviewed by all employees performing work;\n(2) providing a paper or electronic copy of the notice to employees; or\n(3) a conspicuous posting in a web-based or app-based platform through which an employee performs work.\nThe notice must contain all information required under paragraph (a).\n(d) An employer that provides an employee handbook to its employees must include in the handbook notice of employee rights and remedies under this section.\n(e) The Department of Labor and Industry shall prepare a uniform employee notice form for employers to use that provides the notice information required under this section. The commissioner shall prepare the uniform employee notice in the five most common languages spoken in Minnesota. Upon the written request of an employer who is subject to this section, the commissioner shall provide a copy of the uniform employee notice in any primary language spoken by an employee in the employer's place of business. If the commissioner does not provide the copy of the uniform employee notice in response to a request under this paragraph, the employer who makes the request is not subject to a penalty for failing to provide the required notice under this subdivision for violations that arise after the date of the request.\n(a) Employers shall retain accurate records documenting hours worked by employees and earned sick and safe time taken and comply with all requirements under section 177.30.\n(b) At the end of each pay period, the employer shall provide, in writing or electronically, information stating the employee's current amount of:\n(1) the total number of earned sick and safe time hours available to the employee for use under section 181.9446; and\n(2) the total number of earned sick and safe time hours used during the pay period under section 181.9447.\nEmployers may choose a reasonable system for providing this information, including but not limited to listing information on or attached to each earnings statement or an electronic system where employees can access this information. An employer who chooses to provide this information by electronic means must provide employee access to an employer-owned computer during an employee's regular working hours to review and print.\n(c) An employer must allow an employee to inspect records required by this section and relating to that employee at a reasonable time and place.\n(d) The records required by this section must be kept for three years.\n(e) All records required to be kept under this section must be readily available for inspection by the commissioner upon demand. The records must be either kept at the place where employees are working or kept in a manner that allows the employer to comply with this paragraph within 72 hours.\n(a) If, in conjunction with this section, an employer possesses:\n(1) health or medical information regarding an employee or an employee's family member;\n(2) information pertaining to domestic abuse, sexual assault, or stalking;\n(3) information that the employee has requested or obtained leave under this section; or\n(4) any written or oral statement, documentation, record, or corroborating evidence provided by the employee or an employee's family member, the employer must treat such information as confidential.\nInformation given by an employee may only be disclosed by an employer if the disclosure is requested or consented to by the employee, when ordered by a court or administrative agency, or when otherwise required by federal or state law.\n(b) Records and documents relating to medical certifications, recertifications, or medical histories of employees or family members of employees created for purposes of section 177.50 or sections 181.9445 to 181.9448 must be maintained as confidential medical records separate from the usual personnel files. At the request of the employee, the employer must destroy or return the records required by sections 181.9445 to 181.9448 that are older than three years prior to the current calendar year, unless state or federal law, rule, or regulation requires the employer to retain such records.\n(c) Employers may not discriminate against any employee based on records created for the purposes of section 177.50 or sections 181.9445 to 181.9448.\nNotwithstanding subdivision 1, an employee may not use sick and safe time under the conditions in subdivision 1, clause (4), if:\n(1) the employee's preassigned or foreseeable work duties during a public emergency or weather event would require the employee to respond to the public emergency or weather event;\n(2) the employee is a firefighter; a peace officer subject to licensure under sections 626.84 to 626.863; a 911 telecommunicator as defined in section 403.02, subdivision 17c; a guard at a correctional facility; or a public employee holding a commercial driver's license; and\n(3) one of the following two conditions are met:\n(i) the employee is represented by an exclusive representative under section 179A.03, subdivision 8, and the collective bargaining agreement or memorandum of understanding governing the employee's position explicitly references section 181.9447, subdivision 1, clause (4), and clearly and unambiguously waives application of that section for the employee's position; or\n(ii) the employee is not represented by an exclusive representative, the employee is needed for the employer to maintain minimum staffing requirements, and the employer has a written policy explicitly referencing section 181.9447, subdivision 1, clause (4), that is provided to such employees in a manner that meets the requirements of other earned sick and safe time notices under section 181.9447, subdivision 9.",
	"repealed": false
}