{
	"id": "136A.658",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.658",
	"title": "136A.658 EXEMPTION; STATE AUTHORIZATION RECIPROCITY AGREEMENT SCHOOLS.",
	"text": "(a) The office may participate in an interstate reciprocity agreement regarding postsecondary distance education if it determines that participation is in the best interest of Minnesota postsecondary students.\n(b) If the office decides to participate in an interstate reciprocity agreement, an institution that meets the following requirements is exempt from the provisions of sections 136A.61 to 136A.71:\n(1) the institution is situated in a state which is also participating in the interstate reciprocity agreement;\n(2) the institution has been approved to participate in the interstate reciprocity agreement by the institution's home state and other entities with oversight of the interstate reciprocity agreement; and\n(3) the institution has elected to participate in and operate in compliance with the terms of the interstate reciprocity agreement.\n(c) If the office participates in an interstate reciprocity agreement and the office is responsible for the administration of that interstate reciprocity agreement, which may include the approval of applications for membership of in-state institutions to participate in the interstate reciprocity agreement, the office shall collect reasonable fees sufficient to recover, but not exceed, its costs to administer the interstate reciprocity agreement. The office processing fees for approving an in-state institution application shall be as follows:\n(1) $750 for institutions with fewer than 2,500 full-time enrollment;\n(2) $3,000 for institutions with 2,501 to 20,000 full-time enrollment; and\n(3) $7,500 for institutions with greater than 20,001 full-time enrollment.\nFull-time enrollment is established using the previous year's full-time enrollment as established in the United States Department of Education Integrated Postsecondary Education Data System.",
	"repealed": false
}