{
	"id": "256B.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.093",
	"title": "256B.093 SERVICES FOR PERSONS WITH TRAUMATIC BRAIN INJURIES.",
	"text": "(a) The commissioner of human services shall:\n(1) maintain a statewide traumatic brain injury program;\n(2) supervise and coordinate services and policies for persons with traumatic brain injuries;\n(3) contract with qualified agencies or employ staff to provide statewide administrative case management and consultation;\n(4) maintain an advisory committee to provide recommendations in reports to the commissioner regarding program and service needs of persons with brain injuries;\n(5) investigate the need for the development of rules or statutes for the brain injury home and community-based services waiver; and\n(6) investigate present and potential models of service coordination which can be delivered at the local level.\n(b) The advisory committee required by paragraph (a), clause (4), must consist of no fewer than ten members and no more than 30 members. The commissioner shall appoint all advisory committee members to one- or two-year terms and appoint one member as chair.\nPersons eligible for traumatic brain injury administrative case management and consultation must be eligible medical assistance recipients who have traumatic or certain acquired brain injury and are at risk of institutionalization.\nThe department shall fund administrative case management under this subdivision using medical assistance administrative funds. The traumatic brain injury program duties include:\n(1) recommending to the commissioner in consultation with the medical review agent according to Minnesota Rules, parts 9505.0501 to 9505.0540, the approval or denial of medical assistance funds to pay for out-of-state placements for traumatic brain injury services and in-state traumatic brain injury services provided by designated Medicare long-term care hospitals;\n(2) coordinating the brain injury home and community-based waiver;\n(3) providing ongoing technical assistance and consultation to county and facility case managers to facilitate care plan development for appropriate, accessible, and cost-effective medical assistance services;\n(4) providing technical assistance to promote statewide development of appropriate, accessible, and cost-effective medical assistance services and related policy;\n(5) providing training and outreach to facilitate access to appropriate home and community-based services to prevent institutionalization;\n(6) facilitating appropriate admissions, continued stay review, discharges, and utilization review for neurobehavioral hospitals and other specialized institutions;\n(7) providing technical assistance on the use of prior authorization of home care services and coordination of these services with other medical assistance services;\n(8) developing a system for identification of nursing facility and hospital residents with traumatic brain injury to assist in long-term planning for medical assistance services. Factors will include, but are not limited to, number of individuals served, length of stay, services received, and barriers to community placement; and\n(9) providing information, referral, and case consultation to access medical assistance services for recipients without a county or facility case manager. Direct access to this assistance may be limited due to the structure of the program.\nThe annual appropriation established under section 171.29, subdivision 2, paragraph (c), shall be used for traumatic brain injury program services that include, but are not limited to:\n(1) collaborating with counties, providers, and other public and private organizations to expand and strengthen local capacity for delivering needed services and supports, including efforts to increase access to supportive residential housing options;\n(2) participating in planning and accessing services not otherwise covered in subdivision 3 to allow individuals to attain and maintain community-based services;\n(3) providing information, referral, and case consultation to access health and human services for persons with traumatic brain injury not eligible for medical assistance, though direct access to this assistance may be limited due to the structure of the program; and\n(4) collaborating on injury prevention efforts.\nFor purposes of this section, the following definitions apply:\n(a) \"Traumatic brain injury\" means a sudden insult or damage to the brain or its coverings, not of a degenerative or congenital nature. The insult or damage may produce an altered state of consciousness and may result in a decrease in cognitive, behavioral, emotional, or physical functioning resulting in partial or total disability.\n(b) \"Home care services\" means medical assistance home care services defined under section 256B.0625, subdivisions 6a, 7, and 19a.",
	"repealed": false
}