{
	"id": "336A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/336A.03",
	"title": "336A.03 CONTENTS OF FINANCING STATEMENT OR LIEN NOTICE.",
	"text": "An effective financing statement or lien notice must substantially comply with this section but may contain minor errors that are not seriously misleading.\n(a) An effective financing statement is an original or reproduced copy of the statement or an electronically reproduced copy of the statement.\n(b) A lien notice is an original or reproduced copy of the notice or an electronically reproduced copy of the notice.\n(a) An effective financing statement or lien notice must contain:\n(1) a description of the farm products subject to the security interest or farm products statutory lien, including the amount of the farm products, if applicable, and the name of the county where the farm products are produced or located;\n(2) the name and address of the secured party or the lienholder;\n(3) the name and address of the debtor;\n(4) in the case of an effective financing statement, the Social Security number of the debtor, or, if the debtor is doing business other than as an individual, the United States Internal Revenue Service taxpayer identification number of the debtor; and\n(5) in the case of a lien notice, any payment obligations imposed on the buyer, commission merchant, or selling agent as a condition for waiver or release of the farm products statutory lien.\n(b) An effective financing statement or lien notice for one or more debtors may cover more than one farm product located in more than one county.\n(c) The effective financing statement and lien notice may not be combined with a Uniform Commercial Code financing statement form or format and must be filed on the form or in the format designated by the secretary of state as an effective financing statement/lien notice.\n(d) An effective financing statement or the record authorizing the filing of an effective financing statement must contain the following statement, all in capital letters:\n\"THE INFORMATION CONTAINED IN AN EFFECTIVE FINANCING STATEMENT WILL BE SENT TO FARM PRODUCT BUYERS REGISTERED IN MINNESOTA. SALE OF FARM PRODUCTS TO THOSE BUYERS MAY RESULT IN A CHECK BEING ISSUED PAYABLE JOINTLY TO BOTH THE SELLER AND THE SECURED PARTY.\"\n(e) A description of the farm products must include a product code provided by the secretary of state and if applicable, the amount of the farm product in those situations where this information is needed to distinguish that part of the farm product subject to the security interest or farm products statutory lien from that part which is not. The amount may be described by the number of acres, the number of bushels, the number of head, or any other accepted method of counting the specific farm product. A dollar amount may not be used as this description.\n(f) The name of the county where the farm products are produced or located must be designated by using the two-digit county code provided by the secretary of state.\n(g) The party completing the effective financing statement or lien notice is responsible for choosing and listing the farm product and county codes on the document from the lists provided by the secretary of state. The filing officer shall reject those documents that do not have farm product and county codes.\n(h) The name of the secured party or lienholder must be the full legal name of that person or other legal entity. Business names must be presented as they have been registered and only those abbreviations appearing in the name as registered are acceptable. If the secured party or lienholder is an individual, the person's full first name, middle initial, if any, and full last name are the person's full legal name. Nicknames or abbreviations of individual names, except a middle initial, are not acceptable. The single address must be a mailing address and include a city, state, and zip code.\n(i) The name of the debtor must be the full legal name of the individual or other legal entity. Business names must be presented as they have been registered and only those abbreviations appearing in the name as registered are acceptable. If the debtor is an individual, the person's full first name, middle initial, if any, and full last name are the person's full legal name. Nicknames or abbreviations of individual names, except a middle initial, are not acceptable. The single address must be a mailing address and include a city, state, and a zip code.\nA lien notice must be signed, authorized, or otherwise authenticated by the lienholder. An effective financing statement must be signed, authorized, or otherwise authenticated by:\n(1) the secured party; and\n(2) the debtor, except that an effective financing statement filed online need not be signed by the debtor if the secured party obtains the debtor's signature on a paper effective financing statement for this lien.\nAn effective financing statement or lien notice must be amended in writing within three months after material changes occur to reflect the material changes. To amend information contained on an effective financing statement or lien notice, the existing effective financing statement or lien notice must be terminated and a new effective financing statement or lien notice filed. The amendment to an effective financing statement or a lien statement must be signed, authorized, or otherwise authenticated, and filed in the same manner required for the original document.\n(a) An effective financing statement is effective for five years from the date of filing. The effective period may be extended for additional periods of five years as provided in section 336A.06.\n(b) An effective financing statement is not effective after:\n(1) the effective financing statement lapses on the expiration of the effective period; or\n(2) a notice that the effective financing statement is terminated is signed, authorized, or otherwise authenticated by the secured party and filed in the filing office.\n(c) A lien notice is not effective after:\n(1) five years from the date of filing;\n(2) expiration of the period for commencing an action to enforce the lien under applicable Minnesota law; or\n(3) the obligation secured by the farm products statutory lien no longer exists.",
	"repealed": false
}