{
	"id": "611A.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.80",
	"title": "611A.80 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 611A.80 to 611A.88.\n\"Coerce\" means to use or threaten to use any form of domination, restraint, or control for the purpose of causing an individual to engage in or remain in prostitution or to relinquish earnings derived from prostitution. Coercion exists if the totality of the circumstances establish the existence of domination, restraint, or control that would have the reasonably foreseeable effect of causing an individual to engage in or remain in prostitution or to relinquish earnings from prostitution. Evidence of coercion may include, but is not limited to:\n(1) physical force or actual or implied threats of physical force;\n(2) physical or mental torture;\n(3) implicitly or explicitly leading an individual to believe that the individual will be protected from violence or arrest;\n(4) kidnapping;\n(5) defining the terms of an individual's employment or working conditions in a manner that can foreseeably lead to the individual's use in prostitution;\n(6) blackmail;\n(7) extortion or claims of indebtedness;\n(8) threat of legal complaint or report of delinquency;\n(9) threat to interfere with parental rights or responsibilities, whether by judicial or administrative action or otherwise;\n(10) promise of legal benefit, such as posting bail, procuring an attorney, protecting from arrest, or promising unionization;\n(11) promise of financial rewards;\n(12) promise of marriage;\n(13) restraining speech or communication with others, such as exploiting a language difference, or interfering with the use of mail, telephone, or money;\n(14) isolating an individual from others;\n(15) exploiting a condition of developmental disability, cognitive limitation, affective disorder, or substance dependency;\n(16) taking advantage of lack of intervention by child protection;\n(17) exploiting victimization by previous sexual abuse or battering;\n(18) exploiting pornographic performance;\n(19) interfering with opportunities for education or skills training;\n(20) destroying property;\n(21) restraining movement;\n(22) exploiting HIV status, particularly where the defendant's previous coercion led to the HIV exposure; or\n(23) exploiting needs for food, shelter, safety, affection, or intimate or marital relationships.\n\"Promotes the prostitution of an individual\" has the meaning given in section 609.321, subdivision 7.\n\"Prostitution\" has the meaning given in section 609.321, subdivision 9.",
	"repealed": false
}