{
	"id": "56.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.14",
	"title": "56.14 DUTIES OF LICENSEE.",
	"text": "Every licensee shall:\n(1) deliver to the borrower (or if there are two or more borrowers to one of them) at the time any loan is made a statement making the disclosures and furnishing the information required by the federal Truth-in-Lending Act, United States Code, title 15, sections 1601 to 1667e, as amended from time to time, with respect to the contract of loan. A copy of the loan contract may be delivered in lieu of a statement if it discloses the required information;\n(2) deliver or mail to the borrower without request, a written receipt within 30 days following payment for each payment by coin or currency made on account of any loan wherein charges are computed and paid on unpaid principal balances for the time actually outstanding, specifying the amount applied to charges and the amount, if any, applied to principal, and stating the unpaid principal balance, if any, of the loan; and wherein precomputed charges have been added to the principal of the loan specifying the amount of the payment applied to principal and charges combined, the amount applied to default or extension charges, if any, and stating the unpaid balance, if any, of the precomputed loan contract. A periodic statement showing a payment received by mail complies with this clause;\n(3) permit payment to be made in advance in any amount on any contract of loan at any time, but the licensee may apply the payment first to all charges in full at the agreed rate up to the date of the payment;\n(4) upon repayment of the loan in full, mark indelibly every obligation and security, other than a mortgage or security agreement which secures a new loan to the licensee, signed by the borrower with the word \"Paid\" or \"Canceled,\" and release any mortgage or security agreement which no longer secures a loan to the licensee, restore any pledge, and cancel and return any note, and any assignment given to the licensee which does not secure a new loan to the licensee within 20 days after the repayment. For purposes of this requirement, the document including actual evidence of an obligation or security may be maintained, stored, and retrieved in a form or format acceptable to the commissioner under section 46.04, subdivision 3;\n(5) display prominently in each licensed place of business a full and accurate schedule, to be approved by the commissioner, of the charges to be made and the method of computing the same; furnish a copy of the contract of loan to any person obligated on it or who may become obligated on it at any time upon the request of that person;\n(6) show in the loan contract or statement of loan the rate or rates of charge on which the charge in the contract is based, expressed in terms of rate or rates per annum. The rate expression shall be printed in at least 8-point type on the loan statement or copy of the loan contract given to the borrower.",
	"repealed": false
}