{
	"id": "115A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.15",
	"title": "115A.15 STATE GOVERNMENT RESOURCE RECOVERY.",
	"text": "There is established within state government a resource recovery program to promote the reduction of waste generated by state agencies, the separation and recovery of recyclable and reusable commodities, the procurement of recyclable commodities and commodities containing recycled materials, and the uniform disposition of recovered materials and surplus property. The program shall be administered by the commissioner of administration.\nFor the purposes of this section, the following terms have the meanings given them.\n(a) \"Recyclable commodities\" means materials, pieces of equipment, and parts which are not reusable but which contain recoverable resources.\n(b) \"Reusable commodities\" means materials, pieces of equipment, parts, and used supplies which can be reused for their original purpose in their existing condition.\nThe commissioner of administration shall develop policies to require state agencies and the state legislature to separate all recyclable and reusable commodities wherever feasible. The commissioner shall issue guidelines for the procurement of recyclable commodities and commodities containing recycled materials that include definitions of recycled materials, the percentage of recycled materials to be contained in each commodity and performance specifications. To the extent practicable, the guidelines shall be written so as to give preference to recyclable commodities and commodities containing recycled materials. The commissioner shall inform state agencies whenever recycled commodities are available for purchase. The commissioner shall investigate opportunities for the inclusion of and may include local governments and regional agencies in administrative state programs to reduce waste, and to separate and recover recyclable and reusable commodities.\nThe commissioner of administration shall have such powers as are necessary to implement and operate the program. All state agencies shall comply with the policies, guidelines, and procedures established by the commissioner pursuant to this section. The commissioner shall have the power to issue orders to compel compliance.\nThe commissioner of administration shall employ an administrator to manage the resource recovery program and other staff and consultants as are necessary to carry out the program.\nBy January 1 of each odd-numbered year, the commissioner of administration shall submit a report to the governor and to the senate and house of representatives committees having jurisdiction over environment and natural resources and environment and natural resources finance summarizing past activities and proposed goals of the program for the following biennium. The report shall include at least:\n(1) a summary list of product and commodity purchases that contain recycled materials;\n(2) the results of any performance tests conducted on recycled products and agencies' experience with recycled products used;\n(3) a list of all organizations participating in and using the cooperative purchasing program; and\n(4) a list of products and commodities purchased for their recyclability and of recycled products reviewed for purchase.\nAll revenues resulting from the sale of recyclable and reusable commodities made available for sale as a result of the resource recovery program will be used by the service provider to offset the cost of the recycling.\nTo reduce the amount of solid waste generated by the state and to provide a model for other public and private procurement systems, the commissioner, in cooperation with the commissioner of the Pollution Control Agency, shall develop waste reduction procurement programs, including an expanded life-cycle costing system for procurement of durable and repairable items by November 1, 1991. On implementation of the model procurement system, the commissioner, in cooperation with the commissioner of the Pollution Control Agency, shall develop and distribute informational materials for the purpose of promoting the procurement model to other public and private entities under section 115A.072, subdivision 4.\nThe commissioner of administration shall develop and implement a cooperative purchasing program under section 471.59 to include state agencies, local governmental units, and, where feasible, other state governments and the federal government, for the purpose of purchasing materials made from recycled materials. By July 1, 1991, the commissioner shall develop a program to promote the cooperative purchasing program to those units of government and other persons.\n(a) Each state agency shall recycle the solid waste generated by its offices and other operations located in the metropolitan area at a rate that is the highest of: (1) 60 percent by weight; (2) the recycling rate required of a metropolitan county under section 115A.551, subdivision 2a; or (3) the recycling rate in compliance with the solid waste management policy plan goals under section 473.149. Each state agency shall recycle at least 60 percent by weight of the solid waste generated by its offices and other operations located outside of the metropolitan area. By March 1 of each year, each state agency shall report to the Pollution Control Agency the estimated recycling rates from the previous calendar year. State agencies shall report progress in achieving the recycling goal in the format specified by the Pollution Control Agency. The Pollution Control Agency shall incorporate these figures into the reports submitted by the counties under section 115A.557, subdivision 3, to determine each county's progress toward the goal in section 115A.551, subdivision 2a.\n(b) Each state agency shall work to meet the recycling goal individually. If the recycling goal is not met by a state agency, that agency shall provide information to all employees in the agency regarding recycling opportunities and expectations, and notify the Pollution Control Agency of the action that has been taken to meet the recycling goal.\n(a) The commissioner shall establish a recyclable materials collection and transportation system for state offices and other state operations in the metropolitan area that will maximize the types and amount of materials collected and the number of state offices and other state operations served, and will minimize barriers to effective and efficient collection, transportation, and marketing of recyclable materials.\n(b) The commissioner may contract with private entities for the activities required in this subdivision if the commissioner determines that it would be cost-effective to do so.",
	"repealed": false
}