{
	"id": "518.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.131",
	"title": "518.131 TEMPORARY ORDERS AND RESTRAINING ORDERS.",
	"text": "In a proceeding brought for custody, dissolution, or legal separation, or for disposition of property, maintenance, or child support following the dissolution of a marriage, either party may, by motion, request from the court and the court may grant a temporary order pending the final disposition of the proceeding to or for:\n(a) Temporary custody and parenting time regarding the minor children of the parties. In addition to the requirements under section 518.17, subdivision 1, the court must consider the child's parenting time with each parent before the pending action commenced. If the child's access to a parent was limited or restricted before the action commenced, the court must determine the child's custody and parenting time in a manner that supports the child's opportunity to develop a relationship with both parents in accordance with sections 518.17 and 518.175;\n(b) Temporary maintenance of either spouse;\n(c) Temporary child support for the children of the parties;\n(d) Temporary costs and reasonable attorney fees;\n(e) Award the temporary use and possession, exclusive or otherwise, of the family home, furniture, household goods, automobiles, and other property of the parties;\n(f) Restrain one or both parties from transferring, encumbering, concealing, or disposing of property except in the usual course of business or for the necessities of life, and to account to the court for all such transfers, encumbrances, dispositions, and expenditures made after the order is served or communicated to the party restrained in open court;\n(g) Restrain one or both parties from harassing, vilifying, mistreating, molesting, disturbing the peace, or restraining the liberty of the other party or the children of the parties;\n(h) Restrain one or both parties from removing any minor child of the parties from the jurisdiction of the court;\n(i) Exclude a party from the family home of the parties or from the home of the other party; and\n(j) Require one or both of the parties to perform or to not perform such additional acts as will facilitate the just and speedy disposition of the proceeding, or will protect the parties or their children from physical or emotional harm.\nNo temporary order shall:\n(a) Deny parenting time to a parent unless the court finds that the parenting time is likely to cause physical or emotional harm to the child;\n(b) Exclude a party from the family home of the parties unless the court finds that physical or emotional harm to one of the parties or to the children of the parties is likely to result, or that the exclusion is reasonable in the circumstances; or\n(c) Vacate or modify an order granted under section 518B.01, subdivision 6, paragraph (a), clause (1), restraining an abusing party from committing acts of domestic abuse, except that the court may hear a motion for modification of an order for protection concurrently with a proceeding for dissolution of marriage upon notice of motion and motion. The notice required by court rule shall not be waived. If the proceedings are consolidated and the motion to modify is granted, a separate order for modification of an order for protection shall be issued.\nA party may request and the court may make an ex parte restraining order which may include any matter that may be included in a temporary order except:\n(a) A restraining order may not exclude either party from the family home of the parties except upon a finding by the court of immediate danger of physical harm to the other party or the children of either party; and\n(b) A restraining order may not deny parenting time to either party or grant custody of the minor children to either party except upon a finding by the court of immediate danger of physical harm to the minor children of the parties.\nRestraining orders shall be personally served upon the party to be restrained and shall be accompanied with a notice of the time and place of hearing for disposition of the matters contained in the restraining order at a hearing for a temporary order. When a restraining order has been issued, a hearing on the temporary order shall be held at the earliest practicable date. The restrained party may upon written notice to the other party advance the hearing date to a time earlier than that noticed by the other party. The restraining order shall continue in full force and effect only until the hearing time noticed, unless the court, for good cause and upon notice extends the time for hearing.\nA temporary order shall continue in full force and effect until the earlier of its amendment or vacation, dismissal of the main action or entry of a final decree of dissolution or legal separation.\nIf a proceeding for dissolution or legal separation is dismissed, a temporary custody order is vacated unless one of the parties or the child's custodian moves that the proceeding continue as a custody proceeding and the court finds, after a hearing, that the circumstances of the parties and the best interests of the child require that a custody order be issued.\nThe court shall be guided by the factors set forth in chapter 518A (concerning child support), and sections 518.552 (concerning maintenance), 518.17 to 518.175 (concerning custody and parenting time), and 518.14 (concerning costs and attorney fees) in making temporary orders and restraining orders.\nTemporary orders shall be made solely on the basis of affidavits and argument of counsel except upon demand by either party in a motion or responsive motion made within the time limit for making and filing a responsive motion that the matter be heard on oral testimony before the court, or if the court in its discretion orders the taking of oral testimony.\nA temporary order or restraining order:\n(a) Shall not prejudice the rights of the parties or the child which are to be adjudicated at subsequent hearings in the proceeding; and\n(b) May be revoked or modified by the court before the final disposition of the proceeding upon the same grounds and subject to the same requirements as the initial granting of the order.\nIn addition to being punishable by contempt, a violation of a provision of a temporary order or restraining order granting the relief authorized in subdivision 1, clause (g), (h), or (i), is a misdemeanor.\n(a) While the proceeding is pending, the court must give priority to scheduling and holding an expedited hearing for temporary relief when a party credibly alleges that:\n(1) the party has been denied parenting time with a child for 14 consecutive days or more; or\n(2) the party has been unreasonably denied access to necessary financial resources or support during a pending marital dissolution.\n(b) A court must hold a priority hearing under this subdivision within 30 days of the party's request.\n(c) A court must consider credible allegations of domestic abuse, substance abuse, maltreatment findings, or neglect as a reasonable basis for a party who has denied parenting time to the other party.\n(d) If temporary parenting time is ordered, the court may also order temporary child support if requested by the other party.",
	"repealed": false
}