{
	"id": "326B.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.163",
	"title": "326B.163 DEFINITIONS; ELEVATORS.",
	"text": "For the purposes of sections 326B.106 and 326B.163 to 326B.187, the terms defined in this section shall have the meanings given them.\n\"Passenger or freight elevator\" means all elevators except those that comply with the safety rules of the department relating to construction and installation and that have automatic operation or continuous pressure operation.\nAutomatic operation shall mean operation wherein the starting of the elevator car is effected in response to momentary actuation of operating devices at the landing or of operating devices in the car identified with the landings, or both, or in response to an automatic starting mechanism and wherein the car is stopped automatically at the landings.\nContinuous pressure operation shall mean operation by means of buttons or switches in the car and at the landing, any one of which may be used to control the movement of the car as long as the button or switch is manually maintained in the actuating position.\nAs used in this chapter, \"elevator\" means moving walks and vertical transportation devices such as escalators, passenger elevators, freight elevators, dumbwaiters, hand-powered elevators, endless belt lifts, and platform lifts. Elevator does not include external temporary material lifts or temporary construction personnel elevators at sites of construction of new or remodeled buildings.\nAs used in this chapter, \"platform lift\" means a powered hoisting and lowering device designed to transport mobility-impaired persons on a guided platform.\n\"Municipality,\" as used in sections 326B.163 to 326B.187, means a city, county, or town meeting the requirements of section 368.01, subdivision 1.\n\"Elevator inspection\" means an examination of elevator installations, repairs, alterations, removal, and construction for compliance with the State Building Code that may include witnessing tests performed on elevators by elevator personnel, performing tests on elevators, or an audit of records related to routine and periodic maintenance and testing, or any combination thereof when performed by the department or a municipality authorized to perform such inspections.\n\"Elevator inspector\" means an individual who meets the requirements established pursuant to section 326B.187, clause (1), who is performing elevator inspections for the department or a municipality authorized to perform such inspections.\n\"Direct supervision\" means:\n(1) an unlicensed individual is being directly supervised by an individual licensed to perform the elevator work being supervised during the entire time the unlicensed individual is performing elevator work;\n(2) the licensed individual is physically present at the location where the unlicensed individual is performing elevator work and immediately available to the unlicensed individual at all times for assistance and direction;\n(3) the licensed individual shall review the elevator work performed by the unlicensed individual before the elevator work is operated; and\n(4) the licensed individual is able to and does determine that all elevator work performed by the unlicensed individual is performed in compliance with the elevator code.\n\"Elevator contractor\" means a licensed contractor whose responsible licensed individual is a master elevator constructor. An elevator contractor license does not itself qualify its holder to perform or supervise elevator work authorized by holding a personal license issued by the commissioner.\n\"Limited elevator contractor\" means a licensed contractor whose responsible licensed individual is a limited master elevator constructor. A limited elevator contractor or its employees may only install, test, or alter residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators.\n\"Limited elevator work\" means the installing, maintaining, altering, repairing, testing, planning, or laying out of residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators as covered by Minnesota Rules, chapters 1307 and 1315. Limited elevator work also includes electrical wiring on the load side of the elevator equipment disconnect and the decommissioning of elevator equipment to enable safe removal.\n\"Elevator work\" means the installing, maintaining, altering, repairing, testing, planning, or laying out of elevator apparatus or equipment as covered by Minnesota Rules, chapters 1307 and 1315. Elevator work also includes the disconnection of electrical wiring on the load side of the elevator equipment disconnect and the decommissioning of elevator equipment to enable safe removal.\n\"Master elevator constructor\" means an individual having the necessary qualifications, training, experience, and technical knowledge to properly plan, lay out, supervise, and perform the installation, maintenance, altering, testing, wiring, and repair of apparatus and equipment for elevators, including electrical wiring on the load side of the elevator equipment disconnect and who is licensed as a master elevator constructor by the commissioner.\n\"Limited master elevator constructor\" means an individual having the necessary qualifications, training, experience, and technical knowledge to properly plan, lay out, supervise, and perform the testing, altering, installation, maintenance, and repair of wiring, apparatus, and equipment for residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators, including wiring on the load side of the elevator equipment disconnect and who is licensed as a limited master elevator constructor by the commissioner.\n\"Limited journeyworker elevator constructor\" means an individual having the necessary qualifications, training, experience, and technical knowledge to install, maintain, alter, test, and repair apparatus and equipment for residential elevators, platform lifts, stairway chairlifts, dumbwaiters, material lifts, limited use or limited application elevator equipment, conveyors, and special purpose personnel elevators, including electrical wiring on the load side of the elevator equipment disconnect and who is licensed as a limited journeyworker elevator constructor by the commissioner.\n\"Journeyworker elevator constructor\" means an individual having the necessary qualifications, training, experience, and technical knowledge to install, maintain, alter, test, and repair apparatus and equipment for elevators, including electrical wiring on the load side of the elevator equipment disconnect and who is licensed as a journeyworker elevator constructor by the commissioner.\n\"Registered unlicensed elevator constructor\" means an individual who has registered with the department but is not licensed by the commissioner to perform elevator work.\n\"Residential dwelling\" is a single dwelling unit that is contained in a one-family, two-family, or multifamily dwelling. A residential dwelling also includes outdoor space at a one-family dwelling.\n\"Responsible licensed individual\" means an individual licensed as a master elevator constructor or limited master elevator constructor who is identified as the responsible licensed individual on an elevator contractor license application.",
	"repealed": false
}