{
	"id": "3.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.305",
	"title": "3.305 LEGISLATIVE COORDINATING COMMISSION; BICAMERAL LEGISLATIVE ADMINISTRATION.",
	"text": "(a) \"Legislative commission\" means a joint commission, committee, or other entity in the legislative branch composed exclusively of members of the senate and the house of representatives.\n(b) \"Joint offices\" means the Revisor of Statutes, Legislative Reference Library, the Office of Legislative Auditor, the Legislative Budget Office, and any other joint legislative service office.\nThe budget request of a legislative commission or joint office shall be submitted to the Legislative Coordinating Commission for review and approval before its submission to the appropriate fiscal committees of the senate and the house of representatives. In reviewing the budgets, the Legislative Coordinating Commission shall evaluate and make recommendations on how to improve the efficiency and effectiveness of bicameral support functions and services and on whether there is a continuing need for the various legislative commissions. The executive director of the Legislative Coordinating Commission shall recommend and the commission shall establish the compensation of all employees of any legislative commission or joint office, except classified employees of the Legislative Audit Commission.\nThe Legislative Coordinating Commission may transfer unobligated balances among general fund appropriations to the legislature.\nAll employees of legislative commissions and joint offices are employees of the legislature in the unclassified service of the state, except classified employees in the legislative auditor's office.\nThe executive director of the Legislative Coordinating Commission shall provide and manage office space and equipment and hire, supervise, and manage all administrative, clerical, and secretarial staff for all legislative commissions, except the Legislative Advisory Commission and the Legislative Audit Commission.\n[Repealed, 1Sp2003 c 1 art 2 s 136]\nThe Legislative Coordinating Commission may establish joint commissions, committees, subcommittees, task forces, and similar bicameral working groups to assist and advise the coordinating commission in carrying out its duties. The customary appointing authority in each house shall appoint the members of any such entity. The coordinating commission may delegate to an entity, in writing, specific powers and duties of the coordinating commission. All entities established by the commission under this subdivision expire on January 1 of each odd-numbered year, unless renewed by affirmative action of the commission.\nThe appointment of a member to a legislative commission, except a member serving ex officio, is rendered void by three unexcused absences of the member from the meetings of the commission. If an appointment becomes void, the legislative commission shall notify the appointing authority of this and request another appointment.\nUpon written request of two or more of its members or five or more members of the legislature, the Legislative Coordinating Commission shall review a state agency rule as defined in section 14.02, subdivision 4. The commission may perform this review by holding one or more commission meetings or by establishing a bicameral group as provided in subdivision 6 to hold these meetings.\nThe Legislative Coordinating Commission shall oversee and coordinate all joint legislative studies mandated by the legislature and may require regular progress reports to the commission and appropriate standing committees of the house of representatives and the senate. Appropriations for all joint legislative studies except those specifically assigned to an existing legislative commission shall be made to the Legislative Coordinating Commission. Responsibility and appropriations for a joint legislative study may be delegated by the Legislative Coordinating Commission to an existing staff office of the house of representatives or senate, a legislative commission, a joint legislative committee or office or a state agency. The office, commission, joint committee, or agency responsible for the study may contract with another agent for assistance.\nThe Legislative Coordinating Commission may call upon any agency or political subdivision of the state for available data, and the agencies shall cooperate with the commission to the fullest possible extent.",
	"repealed": false
}