{
	"id": "43A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.30",
	"title": "43A.30 PAYMENT OF PREMIUMS.",
	"text": "Each agency shall pay the amounts due for state paid life insurance and hospital, medical and dental benefits coverage authorized for eligible employees pursuant to this chapter.\nEach agency shall pay the amounts from accounts and funds from which the agency receives its revenues, including appropriations from the general fund and from any other fund, now or hereafter existing for the payment of salaries and in the same proportion as it pays therefrom the amounts of salaries. In order to enable the commissioner of management and budget to maintain proper records covering the appropriations pursuant to this section, the commissioner of management and budget may require certifications in connection with payments as the commissioner of management and budget deems necessary from the Minnesota Historical Society, the University of Minnesota, or any agency whose employees receive benefits pursuant to this chapter. The accounts and funds from which agencies receive appropriations under the terms of this section are a source of revenue for the purposes of any other law or statutory enactment.\nIf an eligible person who is on any payroll of the state or an eligible person's dependents is enrolled for any of the optional coverages made available by the commissioner pursuant to section 43A.26 the commissioner of management and budget, upon the person's written order, shall deduct from the salary or wages of the person those amounts required from time to time to maintain the optional coverages in force, and issue a payment therefor to the appropriate carrier.\n[Repealed, 1Sp1981 c 4 art 4 s 10]\nThe commissioner may direct that all or a part of the amounts paid for life insurance, hospital, medical, and dental benefits, and optional coverages authorized for eligible employees and other eligible persons be deposited by the state in an employee insurance trust fund in the state treasury, from which the approved claims of eligibles are to be paid. Investment income and investment losses attributable to the investment of the fund shall be credited to the fund. There is appropriated from the fund to the commissioner amounts needed to pay the approved claims of eligibles, related service charges, insurance premiums, and refunds. The commissioner shall not market or self-insure life insurance. The commissioner may market and self-insure dental and optional coverages. Nothing in this subdivision precludes the commissioner from determining plan design, providing informational materials, or communicating with employees about coverages.\nThe commissioner may administer the employee insurance program. The commissioner may assess agencies, and employers of persons eligible for state-paid insurance and benefits under section 43A.24, the cost of these administrative services, including assessment, referral, and training services provided by the employee assistance program under section 43A.319, and include it in the amounts billed for life insurance, hospital, medical, and dental benefits, and optional coverages authorized. Receipts from the assessments must be deposited in the state treasury and credited to a special account in the employee insurance trust fund and are appropriated to the commissioner to pay these administrative costs.\nThe commissioner shall maintain a contingency reserve within the employee insurance trust fund. The reserve must be used to increase the controls over medical plan provisions and insurance costs for the state's employee populations. The reserve consists of appropriations from the general fund, receipts from billings to agencies, and credited investment gains and losses attributable to balances in the account. The State Board of Investment shall invest the assets of the account according to section 11A.24.",
	"repealed": false
}