{
	"id": "471.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.59",
	"title": "471.59 JOINT EXERCISE OF POWERS.",
	"text": "(a) Two or more governmental units, by agreement entered into through action of their governing bodies, may jointly or cooperatively exercise any power common to the contracting parties or any similar powers, including those which are the same except for the territorial limits within which they may be exercised. The agreement may provide for the exercise of such powers by one or more of the participating governmental units on behalf of the other participating units.\n(b) The term \"governmental unit\" as used in this section includes every city, county, town, school district, service cooperative under section 123A.21, independent nonprofit firefighting corporation, other political subdivision of this or another state, another state, federally recognized Indian Tribe, the University of Minnesota, the Minnesota Historical Society, historic preservation corps under paragraph (c), nonprofit hospitals licensed under sections 144.50 to 144.56, rehabilitation facilities and extended employment providers that are certified by the commissioner of employment and economic development, day and supported employment services licensed under chapter 245D, and any agency of the state of Minnesota or the United States, and includes any instrumentality of a governmental unit. For the purpose of this section, an instrumentality of a governmental unit means an instrumentality having independent policy-making and appropriating authority.\n(c) For purposes of this section, \"historic preservation corps\" means a nonprofit corporation under section 501(c)(3) of the Internal Revenue Code that provides on-the-job training and workforce development skills to youth and young adults by engaging them in repairing and maintaining historic structures, buildings, and sites. Historic preservation corps are governmental units for the purposes of this section and have the rights and liabilities available under this section.\n(a) A governmental unit participating in a joint venture or joint enterprise, including participation in a cooperative activity undertaken pursuant to this section or other law, is not liable for the acts or omissions of another governmental unit participating in the joint venture or joint enterprise, unless the participating governmental unit has agreed in writing to be responsible for the acts or omissions of another participating governmental unit.\n(b) For purposes of determining total liability for damages, the participating governmental units and the joint board, if one is established, are considered a single governmental unit and the total liability for the participating governmental units and the joint board, if established, shall not exceed the limits on governmental liability for a single governmental unit as specified in section 3.736 or 466.04, subdivision 1, or as waived or extended by the joint board or all participating governmental units under section 3.736, subdivision 8; 466.06; or 471.981. This paragraph does not protect a governmental unit from liability for its own independent acts or omissions not directly related to the joint activity.\n(c) If a participating governmental unit has procured or extended insurance coverage pursuant to section 3.736, subdivision 8; 466.06; or 471.981 in excess of the limits on governmental liability under section 3.736 or 466.04, subdivision 1, covering participation in the joint venture or joint enterprise, the procurement of that insurance constitutes a waiver of the limits of governmental liability for that governmental unit to the extent that valid and collectable insurance or self-insurance, including, where applicable, proceeds from the Minnesota Guarantee Fund, exceeds those limits and covers that governmental unit's liability for the claim, if any.\nSuch agreement shall state the purpose of the agreement or the power to be exercised and it shall provide for the method by which the purpose sought shall be accomplished or the manner in which the power shall be exercised. When the agreement provides for use of a joint board, the board shall be representative of the parties to the agreement. A joint board that is formed for educational purposes may conduct public meetings via interactive television if the board complies with chapter 13D in each location where board members are present. Irrespective of the number, composition, terms, or qualifications of its members, such board is deemed to comply with statutory or charter provisions for a board for the exercise by any one of the parties of the power which is the subject of the agreement.\nThe parties to such agreement may provide for disbursements from public funds to carry out the purposes of the agreement. Funds may be paid to and disbursed by such agency as may be agreed upon, but the method of disbursement shall agree as far as practicable with the method provided by law for the disbursement of funds by the parties to the agreement. Contracts let and purchases made under the agreement shall conform to the requirements applicable to contracts and purchases of any one of the parties, as specified in the agreement. Strict accountability of all funds and report of all receipts and disbursements shall be provided for.\nSuch agreement may be continued for a definite term or until rescinded or terminated in accordance with its terms.\nSuch agreement shall provide for the disposition of any property acquired as the result of such joint or cooperative exercise of powers, and the return of any surplus moneys in proportion to contributions of the several contracting parties after the purpose of the agreement has been completed.\nResidence requirements for holding office in any governmental unit shall not apply to any officer appointed to carry out any such agreement.\nThis section does not dispense with procedural requirements of any other act providing for the joint or cooperative exercise of any governmental power.\nNotwithstanding the provisions of subdivision 1 requiring commonality of powers between parties to any agreement the board of county commissioners of any county may by resolution enter into agreements with any other governmental unit as defined in subdivision 1 to perform on behalf of that unit any service or function which that unit would be authorized to provide for itself.\nFor the purposes of the development, coordination, presentation and evaluation of training programs for local government officials, governmental units may exercise their powers under this section in conjunction with organizations representing governmental units and local government officials.\nNotwithstanding the provisions of subdivision 1 requiring commonality of powers between parties to any agreement, the governing body of any governmental unit as defined in subdivision 1 may enter into agreements with any other governmental unit to perform on behalf of that unit any service or function which the governmental unit providing the service or function is authorized to provide for itself. If the agreement has the effect of eliminating or replacing a public employee who is part of a collective bargaining agreement represented by an exclusive representative, and there is no provision in the collective bargaining agreement detailing the effect of the action on the affected public employee, negotiations on the effects to the employee of the job elimination or restructuring must be conducted between the exclusive representative and the employer.\n(a) Two or more governmental units, through action of their governing bodies, by adoption of a joint powers agreement that complies with the provisions of subdivisions 1 to 5, may establish a joint board to issue bonds or obligations under any law by which any of the governmental units establishing the joint board may independently issue bonds or obligations and may use the proceeds of the bonds or obligations to carry out the purposes of the law under which the bonds or obligations are issued. A joint board established under this section may issue obligations and other forms of indebtedness only in accordance with express authority granted by the action of the governing bodies of the governmental units that established the joint board. Except as provided in paragraphs (b) and (c), the joint board established under this subdivision must be composed solely of members of the governing bodies of the governmental unit that established the joint board. A joint board established under this subdivision may not pledge the full faith and credit or taxing power of any of the governmental units that established the joint board. The obligations or other forms of indebtedness must be obligations of the joint board issued on behalf of the governmental units creating the joint board. The obligations or other forms of indebtedness must be issued in the same manner and subject to the same conditions and limitations that would apply if the obligations were issued or indebtedness incurred by one of the governmental units that established the joint board, provided that any reference to a governmental unit in the statute, law, or charter provision authorizing the issuance of the bonds or the incurring of the indebtedness is considered a reference to the joint board.\n(b) Notwithstanding paragraph (a), one school district, one county, and one public health entity, through action of their governing bodies, may establish a joint board to establish and govern a family services collaborative under section 142D.15. The school district, county, and public health entity may include other governmental entities at their discretion. The membership of a board established under this paragraph, in addition to members of the governing bodies of the participating governmental units, must include the representation required by section 142D.15, subdivision 1, paragraph (a), selected in accordance with section 142D.15, subdivision 1, paragraph (c).\n(c) Notwithstanding paragraph (a), counties, school districts, and mental health entities, through action of their governing bodies, may establish a joint board to establish and govern a children's mental health collaborative under sections 245.491 to 245.495, or a collaborative established by the merger of a children's mental health collaborative and a family services collaborative under section 142D.15. The county, school district, and mental health entities may include other entities at their discretion. The membership of a board established under this paragraph, in addition to members of the governing bodies of the participating governmental units, must include the representation provided by section 245.493, subdivision 1.\nIn the event that an agreement authorizes the exercise of peace officer or police powers by an officer appointed by one of the governmental units within the jurisdiction of the other governmental unit, an officer acting pursuant to that agreement has the full and complete authority of a peace officer as though appointed by both governmental units and licensed by the state of Minnesota, provided that:\n(1) the peace officer has successfully completed professionally recognized peace officer preemployment education which the Minnesota Board of Peace Officer Standards and Training has found comparable to Minnesota peace officer preemployment education; and\n(2) the officer is duly licensed or certified by the peace officer licensing or certification authority of the state in which the officer's appointing authority is located.\nIf an agreement, merger, or consolidation authorizes the exercise of peace officer or police powers by an officer appointed by one of the governmental units within the jurisdiction of the other governmental unit, a peace officer or public safety dispatcher, working pursuant to or as a result of that agreement, merger, or consolidation, must receive credit for accumulated vacation and sick leave time earned within the governmental unit employing the peace officer or public safety dispatcher immediately preceding the agreement, merger, or consolidation. If a peace officer or public safety dispatcher working pursuant to an agreement, merger, or consolidation becomes employed by the new entity, that peace officer or public safety dispatcher is considered to have begun employment with the new entity on the first day of employment by the governmental unit employing the peace officer or public safety dispatcher immediately preceding the creation of the new entity and must be credited with all previously accumulated vacation and sick leave time.\nIf there is an agreement, merger, or consolidation between two or more local correctional or detention facilities, a correctional officer who becomes employed by a new entity created by the agreement, merger, or consolidation must receive credit for accumulated vacation and sick leave time earned by the correctional officer during the officer's employment with a governmental unit immediately preceding the creation of the new entity. If a correctional officer working pursuant to an agreement, merger, or consolidation becomes employed by the new entity, the correctional officer is considered to have begun employment with the new entity on the first day of employment with the governmental unit employing the correctional officer immediately preceding the creation of the new entity and must be credited with all previously accumulated vacation and sick leave time.\n(a) For purposes of implementing a federal court order or decree, two or more housing and redevelopment authorities, or public entities exercising the public housing powers of housing and redevelopment authorities, may by adoption of a joint powers agreement that complies with the provisions of subdivisions 1 to 5, establish a joint board for the purpose of acquiring an interest in, rehabilitating, constructing, owning, or managing low-rent public housing located in the metropolitan area, as defined in section 473.121, subdivision 2, and financed, in whole or in part, with federal financial assistance under Section 5 of the United States Housing Act of 1937. The joint board established pursuant to this subdivision shall:\n(1) be composed of members designated by the governing bodies of the governmental units which established such joint board and possess such representative and voting power provided by the joint powers agreement;\n(2) constitute a public body, corporate, and politic; and\n(3) notwithstanding the provisions of subdivision 1, requiring commonality of powers between parties to a joint powers agreement, and solely for the purpose of acquiring an interest in, rehabilitating, constructing, owning, or managing federally financed low-rent public housing, possess all of the powers and duties contained in sections 469.001 to 469.047 and, if at least one participant is an economic development authority, sections 469.090 to 469.1081, except (i) as may be otherwise limited by the terms of the joint powers agreement; and (ii) a joint board shall not have the power to tax pursuant to section 469.033, subdivision 6, or 469.107, nor shall it exercise the power of eminent domain. Every joint powers agreement establishing a joint board shall specifically provide which and under what circumstances the powers granted herein may be exercised by that joint board.\n(b) If a housing and redevelopment authority exists in a city which intends to participate in the creation of a joint board pursuant to paragraph (a), such housing and redevelopment authority shall be the governmental unit which enters into the joint powers agreement unless it determines not to do so, in which event the governmental entity which enters into the joint powers agreement may be any public entity of that city which exercises the low-rent public housing powers of a housing and redevelopment authority.\n(c) A joint board shall not make any contract with the federal government for low-rent public housing, unless the governing body or bodies creating the participating authority in whose jurisdiction the housing is located has, by resolution, approved the provision of that low-rent public housing.\n(d) This subdivision does not apply to any housing and redevelopment authority, or public entity exercising the powers of a housing and redevelopment authority, within the jurisdiction of a county housing and redevelopment authority which is actively carrying out a public housing program under Section 5 of the United States Housing Act of 1937. For purposes of this paragraph, a county housing and redevelopment authority is considered to be actively carrying out a public housing program under Section 5 of the United States Housing Act of 1937, if it (1) owns 200 or more public housing units constructed under Section 5 of the United States Housing Act of 1937, and (2) has applied for public housing development funds under Section 5 of the United States Housing Act of 1937, during the three years immediately preceding January 1, 1996.\n(e) For purposes of sections 469.001 to 469.047, \"city\" means the city in which the housing units with respect to which the joint board was created are located and \"governing body\" or \"governing body creating the authority\" means the council of such city.",
	"repealed": false
}