{
	"id": "97B.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.645",
	"title": "97B.645 WOLVES.",
	"text": "Except as provided in this subdivision, a person may not use a dog or horse to take a wolf. A person may use a guard animal to harass, repel, or destroy wolves to protect a person's livestock, domestic animals, or pets. A person whose guard animal destroys a wolf under this subdivision must protect all evidence and report the taking to a conservation officer as soon as practicable but no later than 48 hours after the wolf is destroyed.\n[Repealed, 2012 c 277 art 1 s 91]\nA person may, at any time and without a permit, take a wolf in defense of the person's own life or the life of another. A person who destroys a wolf under this subdivision must protect all evidence and report the taking to a conservation officer as soon as practicable but no later than 48 hours after the wolf is destroyed.\nTo discourage wolves from contact or association with people and domestic animals, a person may, at any time and without a permit, harass a wolf that is within 500 yards of people, buildings, dogs, livestock, or other domestic pets and animals. A wolf may not be purposely attracted, tracked, or searched out for the purpose of harassment. Harassment that results in physical injury to a wolf is prohibited.\nAn owner of livestock, guard animals, or domestic animals, and the owner's agents may, at any time and without a permit, shoot or destroy a wolf when the wolf is posing an immediate threat to livestock, a guard animal, or a domestic animal located on property owned, leased, or occupied by the owner of the livestock, guard animal, or domestic animal. A person who destroys a wolf under this subdivision must protect all evidence and report the taking to a conservation officer as soon as practicable but no later than 48 hours after the wolf is destroyed.\nAn owner of a domestic pet may, at any time and without a permit, shoot or destroy a wolf when the wolf is posing an immediate threat to a domestic pet under the supervision of the owner. A person who destroys a wolf under this subdivision must protect all evidence and report the taking to a conservation officer as soon as practicable but no later than 48 hours after the wolf is destroyed.\n(a) In response to a reported wolf taking under subdivision 3, 5, or 6, the commissioner shall:\n(1) investigate the reported taking;\n(2) collect appropriate written and photographic documentation of the circumstances and site of the taking, including, but not limited to, documentation of animal husbandry practices;\n(3) confiscate salvageable remains of the wolf killed; and\n(4) dispose of any salvageable wolf remains confiscated under this subdivision by sale or donation for educational purposes.\n(b) The commissioner shall produce monthly reports of activities under this subdivision.\n(c) In response to a reported wolf taking under subdivision 5, the commissioner must notify the county extension agent. The county extension agent must recommend what, if any, cost-conscious livestock best management practices and nonlethal wolf depredation controls are needed to prevent future wolf depredation. Any best management practices recommended by the county extension agent must be consistent with the best management practices developed by the commissioner of agriculture under section 3.737, subdivision 5.\n(a) Notwithstanding the provisions of subdivisions 1 and 4 to 7, and season and time of day restrictions in the game and fish laws, but subject to the remaining provisions of the game and fish laws, in zone B, a person may:\n(1) shoot a wolf on land owned, leased, or managed by the person at any time to protect the person's livestock, domestic animals, or pets; or\n(2) employ a predator controller certified under section 97B.671 to trap a wolf on land owned, leased, or managed by the person or on land within one mile of the land owned, leased, or managed by the person to protect the person's livestock, domestic animals, or pets.\n(b) The person must report the wolf shot or trapped under this subdivision to a conservation officer as soon as practicable but no later than 48 hours after the wolf was shot or trapped. The wolf must be disposed of as prescribed by the commissioner.\nThere shall be no open season for wolves until after the wolf is delisted under the federal Endangered Species Act of 1973. After that time, the commissioner may prescribe open seasons and restrictions for taking wolves but must provide opportunity for public comment.\nA person may not release a wolf-dog hybrid. A person may not release a captive wolf without a permit from the commissioner.\nNotwithstanding the provisions of this section, a person may not take, harass, buy, sell, possess, transport, or ship wolves in violation of federal law.\n(a) For purposes of this section, the terms used have the meanings given.\n(b) \"Guard animal\" means a donkey, llama, dog, or other domestic animal specifically bred, trained, and used to protect livestock, domestic animals, or pets from wolf depredation.\n(c) \"Immediate threat\" means the observed behavior of a wolf in the act of stalking, attacking, or killing livestock, a guard animal, or a domestic pet under the supervision of the owner. If a wolf is not observed stalking or attacking, the presence of a wolf feeding on an already dead animal whose death was not caused by wolves is not an immediate threat.\n(d) \"Zone B\" means all that part of Minnesota south and west of a line beginning on state Trunk Highway No. 48 at the eastern boundary of the state; thence westerly along state Trunk Highway No. 48 to Interstate Highway No. 35; thence northerly on Interstate Highway No. 35 to state Highway No. 23; thence west one-half mile on state Highway No. 23 to state Trunk Highway No. 18; thence westerly along state Trunk Highway No. 18 to state Trunk Highway No. 65; thence northerly on state Trunk Highway No. 65 to state Trunk Highway No. 210; thence westerly along state Trunk Highway No. 210 to state Trunk Highway No. 6; thence northerly on state Trunk Highway No. 6 to Emily; thence westerly along County State-Aid Highway No. 1, Crow Wing County, to County State-Aid Highway No. 2, Cass County; thence westerly along County State-Aid Highway No. 2 to Pine River; thence northwesterly along state Trunk Highway No. 371 to Backus; thence westerly along state Trunk Highway No. 87 to U.S. Highway No. 71; thence northerly along U.S. Highway No. 71 to state Trunk Highway No. 200; thence northwesterly along state Trunk Highway No. 200 to County State-Aid Highway No. 2, Clearwater County; thence northerly along County State-Aid Highway No. 2 to Shevlin; thence along U.S. Highway No. 2 to Bagley; thence northerly along state Trunk Highway No. 92 to Gully; thence northerly along County State-Aid Highway No. 2, Polk County, to County State-Aid Highway No. 27, Pennington County; thence along County State-Aid Highway No. 27 to state Trunk Highway No. 1; thence easterly along state Trunk Highway No. 1 to County State-Aid Highway No. 28, Pennington County; thence northerly along County State-Aid Highway No. 28 to County State-Aid Highway No. 54, Marshall County; thence northerly along County State-Aid Highway No. 54 to Grygla; thence west and northerly along state Highway No. 89 to Roseau; thence northerly along state Trunk Highway No. 310 to the Canadian border.",
	"repealed": false
}