{
	"id": "203B.082",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.082",
	"title": "203B.082 ABSENTEE BALLOT DROP BOXES; SECURITY AND INTEGRITY.",
	"text": "As used in this section, \"drop box\" means a secure receptacle or container established to receive completed absentee ballots 24 hours per day. Drop box does not include a receptacle or container maintained by the United States Postal Service, or a location at which a voter or an agent may return a completed absentee ballot by providing it directly to an employee of the county auditor or municipal clerk.\nThe county auditor or municipal clerk may provide locations at which a voter may deposit a completed absentee ballot enclosed in the completed signature envelope in a secure drop box, consistent with the following security and integrity standards:\n(1) each drop box must be continually recorded during the absentee voting period;\n(2) each drop box must be designed to prevent an unauthorized person from moving, removing, or tampering with the drop box;\n(3) each drop box placed in an outdoor location must be fastened to a building, bolted to a concrete pad, or otherwise attached to a similarly secure structure;\n(4) ballots deposited in a drop box must be secured against access by any unauthorized person, and in the case of a drop box located in an outdoor location, the drop box must be secured against damage due to weather or other natural conditions;\n(5) each drop box must contain signage or markings that:\n(i) clearly identifies the drop box as an official absentee ballot return location; and\n(ii) include the location and hours where an agent may return an absentee ballot;\n(6) deposited ballots must be collected at least once per business day during the absentee voting period by the county auditor, municipal clerk, or an elections official trained by the county auditor or municipal clerk in the proper maintenance and handling of absentee ballots and absentee ballot drop boxes, and in the security measures used to protect absentee ballots; and\n(7) ballots collected from each drop box must be properly date-stamped and stored in a locked ballot container or other secured and locked space consistent with any applicable laws governing the collection and storage of absentee ballots.\n(a) The county auditor or municipal clerk must provide a list of designated absentee ballot drop box locations to the secretary of state no later than 40 days prior to the start of the absentee voting period at every regularly scheduled primary or general election. The list must be published on the website of the county or municipality and on the website of the secretary of state at least 35 days prior to the start of the absentee voting period.\n(b) The county auditor or municipal clerk must provide an updated list of designated absentee ballot drop box locations to the secretary of state no later than 20 days prior to the start of the absentee voting period at every regularly scheduled primary or general election, if any locations have changed or been added since submission of the list under paragraph (a). The list must be published on the website of the county or municipality and on the website of the secretary of state at least 15 days prior to the start of the absentee voting period.\nSection 211B.11 applies to conduct within 100 feet of an absentee ballot drop box established under this section.",
	"repealed": false
}