{
	"id": "290C.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.13",
	"title": "290C.13 APPEALS.",
	"text": "A claimant may obtain reconsideration by the commissioner of a determination removing enrolled land from the sustainable forest incentive program, a determination denying an application to enroll land in the program, or a denial of part or all of an incentive payment by filing an administrative appeal under subdivision 4. A claimant cannot obtain reconsideration under this section if the action taken by the commissioner is the outcome of an administrative appeal.\nA claimant who wishes to seek administrative review must follow the procedures in subdivision 4.\nFor purposes of this section, the term \"notice date\" means the notice date designated by the commissioner on the order or notice of the determination removing enrolled land or the notice date designated by the commissioner on the notice denying an application to enroll land or denying part or all of an incentive payment.\nWithin 60 days after the notice date, the claimant must file a written appeal with the commissioner. The appeal need not be in any particular form but must contain the following information:\n(1) name and address of the claimant;\n(2) if a corporation, the state of incorporation of the claimant, and the principal place of business of the corporation;\n(3) the Minnesota or federal business identification number or Social Security number of the claimant;\n(4) the date;\n(5) the periods involved and the amount of payment involved for each year or period;\n(6) the findings in the notice that the claimant disputes;\n(7) a summary statement that the claimant relies on for each exception; and\n(8) the claimant's signature or signature of the claimant's duly authorized agent.\nWhen requested in writing and within the time allowed for filing an administrative appeal, the commissioner may extend the time for filing an appeal for a period not more than 30 days from the expiration of the 60 days from the notice date.\nOn the basis of applicable law and available information, the commissioner shall determine the validity, if any, in whole or in part, of the appeal and notify the claimant of the decision. This notice must be in writing and contain the basis for the determination. The commissioner shall consult with the commissioner of natural resources when an appeal relates to the use of the property for forestry or nonforestry purposes and for appeals related to forest management plans.\nWhen it appears to be in the best interests of the state, the commissioner may settle the amount of any incentive payments, payments owed by the claimant under section 290C.11, paragraph (b) or (c), penalties, or interest that the commissioner has under consideration by virtue of an appeal filed under this section. An agreement must be in writing and signed by the commissioner and the claimant, or the claimant's representative authorized by the claimant to enter into an agreement. The agreement is final and conclusive and, except upon a showing of fraud or malfeasance, or misrepresentation of a material fact, the case must not be reopened as to the matters agreed upon.\nWithin 60 days after the commissioner denies an appeal, or within 120 days after the commissioner received a written appeal if the commissioner has not made a determination in that time, the claimant may appeal to Tax Court under chapter 271 as if the appeal is from an order of the commissioner.\nThis section is not subject to chapter 14.",
	"repealed": false
}