{
	"id": "352B.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.011",
	"title": "352B.011 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Accumulated deductions\" means the total sums deducted from the salary of a member and the total amount of assessments paid by a member in place of deductions and credited to the member's individual account as permitted by law without interest.\n(a) \"Allowable service\" means:\n(1) service in a month during which a member is paid a salary from which a member contribution is deducted, deposited, and credited in the State Patrol retirement fund;\n(2) any period of authorized leave of absence without pay that does not exceed one year and for which the employee obtains credit by payment to the fund under section 352B.013; and\n(3) eligible periods of uniformed service for which the member obtained service credit by making the payment required under section 352B.086 to the fund.\n(b) Allowable service also includes any period of absence from duty by a member who, by reason of injury incurred in the performance of duty, is temporarily disabled and for which disability the state is liable under the workers' compensation law, until the date authorized by the executive director for commencement of payment of a disability benefit or until the date of a return to employment if in conformity with section 352B.085.\n\"APRN\" means an individual licensed as an advanced practice registered nurse by the Board of Nursing as defined in section 148.171, subdivision 3, who provides services to a member or an applicant that are within the scope of the APRN's professional licensure.\n(a) Subject to the limitations of section 356.611, \"average monthly salary\" means the average of the highest monthly salaries for five years of service as a member upon which contributions were deducted from pay under section 352B.02, or upon which appropriate contributions or payments were made to the fund to receive allowable service and salary credit as specified under the applicable law. Average monthly salary must be based upon all allowable service if this service is less than five years.\n(b) The salary used for the calculation of \"average monthly salary\" means the salary of the member as defined in section 352.01, subdivision 13. \"Average monthly salary\" includes the salary of the member during the period of covered employment rendered after reaching the allowable service credit limit of section 352B.08, subdivision 2, paragraph (b). The salary used for the calculation of \"average monthly salary\" does not include any lump-sum annual leave payments and overtime payments made at the time of separation from state service, any amounts of severance pay, or any reduced salary paid during the period the person is entitled to workers' compensation benefit payments for temporary disability.\n\"Department head\" means the head of any department, institution, or branch of the state service that directly pays salaries from state funds to a member who prepares, approves, and submits salary abstracts of employees to the commissioner of Minnesota Management and Budget.\n\"Dependent child\" means an individual who is a natural or adopted unmarried child of a deceased member and is under the age of 18 years, including any child of the member conceived during the lifetime of the member and born after the death of the member unless a parent-child relationship does not exist under section 524-2.120, subdivision 10.\n\"Duty disability\" means a physical or psychological condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of the position held by the person as a member of the State Patrol retirement fund, and that is the direct result of any injury incurred during, or a disease arising out of, the performance of normal duties or the actual performance of less frequent duties, either of which are specific to protecting the property and personal safety of others and that present inherent dangers that are specific to the positions covered by the State Patrol retirement fund.\n\"Fund\" means the State Patrol retirement fund.\n\"Less frequent duties\" means tasks which are designated in the member's job description as either required from time to time or as assigned, but which are not carried out as part of the normal routine of the member's position.\n\"Member\" means:\n(1) a State Patrol member currently employed under section 299D.03 by the state, who is a peace officer under section 626.84, and whose salary or compensation is paid out of state funds;\n(2) a conservation officer employed under section 97A.201, currently employed by the state, whose salary or compensation is paid out of state funds;\n(3) a crime bureau officer who was employed by the crime bureau and was a member of the Highway Patrolmen's retirement fund on July 1, 1978, whether or not that person has the power of arrest by warrant after that date, or who is employed as police personnel, with powers of arrest by warrant under Minnesota Statutes 2009, section 299C.04, and who is currently employed by the state, and whose salary or compensation is paid out of state funds;\n(4) a public safety employee who is a peace officer under section 626.84, subdivision 1, paragraph (c), and who is employed by the Division of Alcohol and Gambling Enforcement under section 299L.01;\n(5) a Fugitive Apprehension Unit officer after October 31, 2000, who is employed by the Office of Special Investigations of the Department of Corrections and who is a peace officer under section 626.84;\n(6) an employee of the Department of Commerce defined as a peace officer in section 626.84, subdivision 1, paragraph (c), who is employed by the Commerce Fraud Bureau under section 45.0135 after January 1, 2005, and who has not attained the mandatory retirement age specified in section 43A.34, subdivision 4;\n(7) an employee of the Department of Public Safety, who is a licensed peace officer under section 626.84, subdivision 1, paragraph (c), and is employed as the statewide coordinator of the Violent Crime Coordinating Council; and\n(8) an individual who is a member under any of clauses (1) to (7) on the date the individual applies for duty disability benefits based on a psychological condition under section 352B.102 continues to be a member even if the individual is later transferred to or accepts employment with the individual's employing entity in a position that is not a position described in clauses (1) to (7).\n\"Normal duties\" means specific tasks which are designated in the member's job description and which the applicant performs on a day-to-day basis, but do not include less frequent duties which may be requested to be done by the employer from time to time.\n\"Regular disability\" means a physical or psychological condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of the position held by a person who is a member of the State Patrol retirement plan, and which results from a disease or an injury that arises from any activities while not at work, or while at work and performing those normal or less frequent duties that do not present inherent dangers that are specific to the occupations covered by the State Patrol retirement plan.\n\"Surviving spouse\" means a member's or former member's legally married spouse at the time of death.\n\"Total and permanent duty disability\" means a physical or psychological condition that is expected to prevent a member, for a period of not less than 12 months, from engaging in any substantial gainful activity and that is the direct result of great bodily harm incurred during the performance of duties that are specific to protecting the property and personal safety of others and that present inherent dangers specific to the positions covered by the State Patrol retirement fund.",
	"repealed": false
}