{
	"id": "256B.0952",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0952",
	"title": "256B.0952 COUNTY DUTIES; QUALITY ASSURANCE TEAMS.",
	"text": "Counties or providers shall give notice to the commission and commissioners of human services and health of intent to join the alternative quality assurance licensing system. A county or provider choosing to participate in the alternative quality assurance licensing system commits to participate for three years.\nA county or group of counties that chooses to participate in the alternative licensing system shall appoint a quality assurance review council comprised of advocates; consumers, families, and their legal representatives; providers; and county staff. The council shall:\n(1) review summary reports from quality assurance team reviews and make recommendations to counties regarding program licensure;\n(2) make recommendations to the commission regarding the alternative licensing system and quality assurance process; and\n(3) resolve complaints between the quality assurance teams, counties, providers, and consumers, families, and their legal representatives.\nThe county, based on reports from quality assurance managers and recommendations from the quality assurance review council regarding the findings of quality assurance teams, shall notify the commissioners of human services and health regarding whether facilities, programs, or services have met the outcome standards for licensure and are eligible for payment.\n(a) A county or group of counties that chooses to participate in the alternative licensing system shall designate a quality assurance manager and shall establish quality assurance teams in accordance with subdivision 5. The manager shall recruit, train, and assign duties to the quality assurance team members. In assigning team members to conduct the quality assurance process at a facility, program, or service, the manager shall take into account the size of the service provider, the number of services to be reviewed, the skills necessary for team members to complete the process, and other relevant factors. The manager shall ensure that no team member has a financial, personal, or family relationship with the facility, program, or service being reviewed or with any clients of the facility, program, or service.\n(b) Quality assurance teams shall report the findings of their quality assurance reviews to the quality assurance manager. The quality assurance manager shall provide the report from the quality assurance team to the county and, upon request, to the commissioners of human services and health, and shall provide a summary of the report to the Quality Assurance Review Council.\nQuality assurance teams shall be comprised of county staff; providers; consumers, families, and their legal representatives; members of advocacy organizations; and other involved community members. Team members must satisfactorily complete the training program approved by the commission and must demonstrate performance-based competency. Team members are not considered to be county employees for purposes of workers' compensation, unemployment insurance, or state retirement laws solely on the basis of participation on a quality assurance team. A per diem may be paid to team members for time spent on alternative quality assurance process matters. All team members may be reimbursed for expenses related to their participation in the alternative process.\nParticipating counties shall perform licensing functions and activities as delegated by the commissioner of human services in accordance with section 245A.16.",
	"repealed": false
}