{
	"id": "34A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/34A.12",
	"title": "34A.12 POWERS OF THE COMMISSIONER.",
	"text": "The commissioner may, for the purposes of this chapter:\n(1) gather and compile information concerning and investigate the organization, business, conduct, practices, and management of a person in intrastate commerce and the person's relation to other persons; and\n(2) require, by general or special orders, a person, persons, or a class of persons engaged in intrastate commerce to file with the commissioner, in the form the commissioner prescribes, annual and special reports or answers in writing to specific questions, giving the commissioner the information the commissioner requires about the organization, business, conduct, practices, management, and relation to other persons, of the person filing the reports or answers. The reports and answers must be made under oath, or otherwise, as the commissioner prescribes, and filed with the commissioner within a reasonable time the commissioner prescribes, unless additional time is granted by the commissioner.\n(a) For purposes of this chapter, the commissioner must at all reasonable times be allowed to examine and copy documentary evidence of a person being investigated or proceeded against. The commissioner may subpoena witnesses and require the production of documentary evidence of a person relating to any matter under investigation. The commissioner may sign subpoenas, administer oaths and affirmations, examine witnesses, and receive evidence.\n(b) Attendance of witnesses and the production of documentary evidence may be required at a designated hearing place. In case of disobedience to a subpoena, the commissioner may invoke the aid of the district court to require the attendance and testimony of witnesses and the production of documentary evidence.\n(c) The district court, in case of refusal to obey a subpoena issued to a person, may issue an order requiring the person to appear before the commissioner or to produce documentary evidence if ordered, or to give evidence touching the matter in question. Failure to obey the order of the court may be punishable by the court as a contempt.\n(d) Upon the application of the attorney general at the request of the commissioner, the district court may order a person to comply with this chapter or an order of the commissioner made under this chapter.\n(e) The commissioner may order testimony to be taken by deposition in a proceeding or investigation pending under this chapter at any state of the proceeding or investigation. Depositions may be taken before a person designated by the commissioner and having power to administer oaths. The testimony must be reduced to writing by the person taking the deposition or under the person's direction and must then be signed by the witness. A person may be compelled to appear and depose and to produce documentary evidence in the same manner as witnesses may be compelled to appear and testify and produce documentary evidence before the commissioner.\n(f) Witnesses summoned before the commissioner may be paid the same fees and mileage that are paid witnesses in the district courts. Witnesses whose depositions are taken and the persons taking them may be entitled to the fees that are paid for those services in the district court.\n(g) A person is not excused from attending and testifying or from producing books, papers, schedules of charges, contracts, agreements, or other documentary evidence before the commissioner or in obedience to the subpoena of the commissioner whether the subpoena is signed or issued by the commissioner or the commissioner's agent, or in any cause or proceeding, criminal or otherwise, based upon or growing out of an alleged violation of this chapter because the testimony or evidence, documentary or otherwise, required of the person may tend to incriminate the person or subject the person to a penalty or forfeiture. No person may be prosecuted or subjected to a penalty or forfeiture on account of a matter concerning which the person is compelled, after having claimed a privilege against self-incrimination, to testify or produce evidence, documentary or otherwise, except that a witness is not exempt from prosecution and punishment for perjury committed in testifying.\n(a) A person who neglects or refuses to attend and testify, to answer a lawful inquiry, or to produce documentary evidence, if it is in the person's power to do so in obedience to the subpoena or lawful requirement of the commissioner, is guilty of a misdemeanor.\n(b) A person who willfully:\n(1) makes or causes to be made a false entry or statement of fact in a report required under this chapter;\n(2) makes or causes to be made a false entry in an account, record, or memorandum kept by a person subject to this chapter;\n(3) neglects or fails to make or to cause to be made full and correct entries in the accounts, records, or memoranda of all facts and transactions relating to the person's business;\n(4) leaves the jurisdiction of this state;\n(5) mutilates, alters, or by any other means falsifies documentary evidence of a person subject to this chapter; or\n(6) refuses to submit to the commissioner, for inspection and copying, any documentary evidence of a person subject to this chapter in the person's possession or control, is guilty of a misdemeanor.\n(c) A person required by this chapter to file an annual or special report who fails to do so within the time fixed by the commissioner for filing the report and continues the failure for 30 days after notice of failure to file, is guilty of a misdemeanor.\n(d) An officer or employee of this state who makes public information obtained by the commissioner without the commissioner's authority, unless directed by a court, is guilty of a misdemeanor.",
	"repealed": false
}