{
	"id": "103E.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.025",
	"title": "103E.025 PROCEDURE FOR DRAINAGE PROJECT THAT AFFECTS STATE LAND OR WATER AREA USED FOR CONSERVATION.",
	"text": "If a land or water area owned by the state and held or used to protect or propagate wild animals, provide hunting or fishing for the public, or for any other purpose relating to the conservation, development, or use of soil, water, forests, wild animals, or related natural resources will be affected by any public project or proceeding for drainage under any law, all procedures relating to the project or proceeding are subject to this section, if applicable.\n(a) Any part of the state land or water area may be taken or damaged for a public project after payment of just compensation as provided by law and under the provisions of this subdivision.\n(b) The authority having jurisdiction of the drainage project or proceeding shall first find and determine that there is public necessity for the taking or damage that is greater than the public interest in the purposes for which the affected land and water areas are held or used by the state.\n(c) In determining the compensation to be paid for the taking or damage, the authority must give proper consideration to the value of the land and water area for the purposes it is held or used by the state and other material elements of value.\n(d) Public waters may not be taken, damaged, or impaired except as otherwise expressly authorized by law, and a provision of any other law for the protection or conservation of public waters may not be abridged or superseded by this subdivision.\nIn determining benefits to the state land or water area in any proceeding to levy assessments or offset benefits against damages, proper consideration must be given to the value of the area for the purpose it is held or used by the state, with other material elements of value.\nAny amounts paid to the state for taking or damaging the state land or water area in a proceeding must be credited to the proper account for acquisition, development, or maintenance of the areas, and the amount is appropriated to the commissioner for those purposes to remain available until expended.\nAssessments for benefits made against the state land or water area in a proceeding must be paid out of money appropriated and available to pay assessments as provided by law.",
	"repealed": false
}