{
	"id": "144.0724",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0724",
	"title": "144.0724 RESIDENT REIMBURSEMENT CLASSIFICATION.",
	"text": "The commissioner of health shall establish resident reimbursement case mix classifications based upon the assessments of residents of nursing homes and boarding care homes conducted under this section and according to section 256R.17.\nFor purposes of this section, the following terms have the meanings given.\n(a) \"Assessment reference date\" or \"ARD\" means the specific end point for look-back periods in the MDS assessment process. This look-back period is also called the observation or assessment period.\n(b) \"Case mix index\" means the weighting factors assigned to the case mix reimbursement classifications determined by an assessment.\n(c) \"Index maximization\" means classifying a resident who could be assigned to more than one category, to the category with the highest case mix index.\n(d) \"Minimum Data Set\" or \"MDS\" means a core set of screening, clinical assessment, and functional status elements, that include common definitions and coding categories specified by the Centers for Medicare and Medicaid Services and designated by the Department of Health.\n(e) \"Representative\" means a person who is the resident's guardian or conservator, the person authorized to pay the nursing home expenses of the resident, a representative of the Office of Ombudsman for Long-Term Care whose assistance has been requested, or any other individual designated by the resident.\n(f) \"Activities of daily living\" includes personal hygiene, dressing, bathing, transferring, bed mobility, locomotion, eating, and toileting.\n(g) \"Nursing facility level of care determination\" means the assessment process that results in a determination of a resident's or prospective resident's need for nursing facility level of care as established in subdivision 11 for purposes of medical assistance payment of long-term care services for:\n(1) nursing facility services under chapter 256R;\n(2) elderly waiver services under chapter 256S;\n(3) CADI and BI waiver services under section 256B.49; and\n(4) state payment of alternative care services under section 256B.0913.\n[Repealed by amendment, 2014 c 147 s 1]\n(a) Resident case mix reimbursement classifications shall be based on the Minimum Data Set, version 3.0 assessment instrument, or its successor version mandated by the Centers for Medicare and Medicaid Services that nursing facilities are required to complete for all residents. Case mix reimbursement classifications shall also be based on assessments required under subdivision 4. Assessments must be completed according to the Long Term Care Facility Resident Assessment Instrument User's Manual Version 3.0 or a successor manual issued by the Centers for Medicare and Medicaid Services. The optional state assessment must be completed according to the OSA Manual Version 1.0 v.2.\n(b) Each resident must be classified based on the information from the Minimum Data Set according to the general categories issued by the Minnesota Department of Health, utilized for reimbursement purposes.\n(a) A facility must conduct and electronically submit to the federal database MDS assessments that conform with the assessment schedule defined by the Long Term Care Facility Resident Assessment Instrument User's Manual, version 3.0, or its successor issued by the Centers for Medicare and Medicaid Services. The commissioner of health may substitute successor manuals or question and answer documents published by the United States Department of Health and Human Services, Centers for Medicare and Medicaid Services, to replace or supplement the current version of the manual or document.\n(b) The assessments required under the Omnibus Budget Reconciliation Act of 1987 (OBRA) used to determine a case mix reimbursement classification include:\n(1) a new admission comprehensive assessment, which must have an assessment reference date (ARD) within 14 calendar days after admission, excluding readmissions;\n(2) an annual comprehensive assessment, which must have an ARD within 92 days of a previous quarterly review assessment or a previous comprehensive assessment, which must occur at least once every 366 days;\n(3) a significant change in status comprehensive assessment, which must have an ARD within 14 days after the facility determines, or should have determined, that there has been a significant change in the resident's physical or mental condition, whether an improvement or a decline, and regardless of the amount of time since the last comprehensive assessment or quarterly review assessment;\n(4) a quarterly review assessment must have an ARD within 92 days of the ARD of the previous quarterly review assessment or a previous comprehensive assessment;\n(5) any significant correction to a prior comprehensive assessment, if the assessment being corrected is the current one being used for reimbursement classification;\n(6) any significant correction to a prior quarterly review assessment, if the assessment being corrected is the current one being used for reimbursement classification; and\n(7) any modifications to the most recent assessments under clauses (1) to (6).\n(c) The optional state assessment must accompany all OBRA assessments. The optional state assessment is also required to determine reimbursement when:\n(1) all speech, occupational, and physical therapies have ended. If the most recent optional state assessment completed does not result in a rehabilitation case mix reimbursement classification, then the optional state assessment is not required. The ARD of this assessment must be set on day eight after all therapy services have ended; and\n(2) isolation for an infectious disease has ended. If isolation was not coded on the most recent optional state assessment completed, then the optional state assessment is not required. The ARD of this assessment must be set on day 15 after isolation has ended.\n(d) In addition to the assessments listed in paragraphs (b) and (c), the assessments used to determine nursing facility level of care include the following:\n(1) preadmission screening completed under section 256.975, subdivisions 7a to 7c, by the Senior LinkAge Line or other organization under contract with the Minnesota Board on Aging; and\n(2) a nursing facility level of care determination as provided for under section 256B.0911, subdivision 26, as part of a face-to-face long-term care consultation assessment completed under section 256B.0911, by a county, tribe, or managed care organization under contract with the Department of Human Services.\n(a) A facility must submit to the commissioner of health an admission assessment for all residents who stay in the facility 14 days or less, unless the resident is admitted and discharged from the facility on the same day, in which case the admission assessment is not required. When an admission assessment is not submitted, the case mix classification shall be the rate with a case mix index of 1.0.\n(b) Notwithstanding the admission assessment requirements of paragraph (a), a facility may elect to accept a short stay rate with a case mix index of 1.0 for all facility residents who stay 14 days or less in lieu of submitting an admission assessment. Facilities shall make this election annually.\n(c) Nursing facilities must elect one of the options described in paragraphs (a) and (b) by reporting to the commissioner of health, as prescribed by the commissioner. The election is effective on July 1 each year.\n(a) A facility that fails to complete or submit an assessment according to subdivisions 4 and 5 for a case mix reimbursement classification when the assessment is due is subject to a reduced rate for that resident. The reduced rate shall be the lowest rate for that facility. The reduced rate is effective on the day of admission for new admission assessments, on the ARD for significant change in status assessments, or on the day that the assessment was due for all other assessments and continues in effect until the first day of the month following the date of submission and acceptance of the resident's assessment.\n(b) If loss of revenue due to penalties incurred by a facility for any period of 92 days are equal to or greater than 0.1 percent of the total operating costs on the facility's most recent annual statistical and cost report, a facility may apply to the commissioner of human services for a reduction in the total penalty amount. The commissioner of human services, in consultation with the commissioner of health, may, at the sole discretion of the commissioner of human services, limit the penalty for residents covered by medical assistance to ten days.\n(a) The commissioner of health shall provide to a nursing facility a notice for each resident of the classification established under subdivision 1. The notice must inform the resident of the case mix reimbursement classification assigned, the opportunity to review the documentation supporting the classification, the opportunity to obtain clarification from the commissioner, the opportunity to request a reconsideration of the classification, and the address and telephone number of the Office of Ombudsman for Long-Term Care. The commissioner must transmit the notice of resident classification by electronic means to the nursing facility. The nursing facility is responsible for the distribution of the notice to each resident or the resident's representative. This notice must be distributed within three business days after the facility's receipt.\n(b) If a facility submits a modified assessment resulting in a change in the case mix reimbursement classification, the facility must provide a written notice to the resident or the resident's representative regarding the item or items that were modified and the reason for the modifications. The written notice must be provided within three business days after distribution of the resident case mix reimbursement classification notice.\n(a) The resident, the resident's representative, the nursing facility, or the boarding care home may request that the commissioner of health reconsider the assigned case mix reimbursement classification and any item or items changed during the audit process. The request for reconsideration must be submitted in writing to the commissioner of health.\n(b) For reconsideration requests initiated by the resident or the resident's representative:\n(1) The resident or the resident's representative must submit in writing a reconsideration request to the facility administrator within 30 days of receipt of the resident classification notice. The written request must include the reasons for the reconsideration request.\n(2) Within three business days of receiving the reconsideration request, the nursing facility must submit to the commissioner of health a completed reconsideration request form, a copy of the resident's or resident's representative's written request, and all supporting documentation used to complete the assessment being reconsidered. If the facility fails to provide the required information, the reconsideration will be completed with the information submitted and the facility cannot make further reconsideration requests on this classification.\n(3) Upon written request and within three business days, the nursing facility must give the resident or the resident's representative a copy of the assessment being reconsidered and all supporting documentation used to complete the assessment. Notwithstanding any law to the contrary, the facility may not charge a fee for providing copies of the requested documentation. If a facility fails to provide the required documents within this time, it is subject to the issuance of a correction order and penalty assessment under sections 144.653 and 144A.10. Notwithstanding those sections, any correction order issued under this subdivision must require that the nursing facility immediately comply with the request for information, and as of the date of the issuance of the correction order, the facility shall forfeit to the state a $100 fine for the first day of noncompliance, and an increase in the $100 fine by $50 increments for each day the noncompliance continues.\n(c) For reconsideration requests initiated by the facility:\n(1) The facility is required to inform the resident or the resident's representative in writing that a reconsideration of the resident's case mix reimbursement classification is being requested. The notice must inform the resident or the resident's representative:\n(i) of the date and reason for the reconsideration request;\n(ii) of the potential for a case mix reimbursement classification change and subsequent rate change;\n(iii) of the extent of the potential rate change;\n(iv) that copies of the request and supporting documentation are available for review; and\n(v) that the resident or the resident's representative has the right to request a reconsideration also.\n(2) Within 30 days of receipt of the audit exit report or resident classification notice, the facility must submit to the commissioner of health a completed reconsideration request form, all supporting documentation used to complete the assessment being reconsidered, and a copy of the notice informing the resident or the resident's representative that a reconsideration of the resident's classification is being requested.\n(3) If the facility fails to provide the required information, the reconsideration request may be denied and the facility may not make further reconsideration requests on this classification.\n(d) Reconsideration by the commissioner must be made by individuals not involved in reviewing the assessment, audit, or reconsideration that established the disputed classification. The reconsideration must be based upon the assessment that determined the classification and upon the information provided to the commissioner of health under paragraphs (a) to (c). If necessary for evaluating the reconsideration request, the commissioner may conduct on-site reviews. Within 15 business days of receiving the request for reconsideration, the commissioner shall affirm or modify the original resident classification. The original classification must be modified if the commissioner determines that the assessment resulting in the classification did not accurately reflect characteristics of the resident at the time of the assessment. The commissioner must transmit the reconsideration classification notice by electronic means to the nursing facility. The nursing facility is responsible for the distribution of the notice to the resident or the resident's representative. The notice must be distributed by the nursing facility within three business days after receipt. A decision by the commissioner under this subdivision is the final administrative decision of the agency for the party requesting reconsideration.\n(e) The case mix reimbursement classification established by the commissioner shall be the classification which applies to the resident while the request for reconsideration is pending. If a request for reconsideration applies to an assessment used to determine nursing facility level of care under subdivision 4, paragraph (d), the resident shall continue to be eligible for nursing facility level of care while the request for reconsideration is pending.\n(f) The commissioner may request additional documentation regarding a reconsideration necessary to make an accurate reconsideration determination.\n(g) Data collected as part of the reconsideration process under this section is classified as private data on individuals and nonpublic data pursuant to section 13.02. Notwithstanding the classification of these data as private or nonpublic, the commissioner is authorized to share these data with the U.S. Centers for Medicare and Medicaid Services and the commissioner of human services as necessary for reimbursement purposes.\n(a) The commissioner shall audit the accuracy of resident assessments performed under section 256R.17 through any of the following: desk audits; on-site review of residents and their records; and interviews with staff, residents, or residents' families. The commissioner shall reclassify a resident if the commissioner determines that the resident was incorrectly classified.\n(b) The commissioner is authorized to conduct on-site audits on an unannounced basis.\n(c) A facility must grant the commissioner access to examine the medical records relating to the resident assessments selected for audit under this subdivision. The commissioner may also observe and speak to facility staff and residents.\n(d) The commissioner shall consider documentation under the time frames for coding items on the minimum data set as set out in the Long-Term Care Facility Resident Assessment Instrument User's Manual or OSA Manual version 1.0 v.2 published by the Centers for Medicare and Medicaid Services.\n(e) The commissioner shall develop an audit selection procedure that includes the following factors:\n(1) Each facility shall be audited annually. If a facility has two successive audits in which the percentage of change is five percent or less and the facility has not been the subject of a special audit in the past 36 months, the facility may be audited biannually. A stratified sample of 15 percent, with a minimum of ten assessments, of the most current assessments shall be selected for audit. If more than 20 percent of the case mix reimbursement classifications are changed as a result of the audit, the audit shall be expanded to a second 15 percent sample, with a minimum of ten assessments. If the total change between the first and second samples is 35 percent or greater, the commissioner may expand the audit to all of the remaining assessments.\n(2) If a facility qualifies for an expanded audit, the commissioner may audit the facility again within six months. If a facility has two expanded audits within a 24-month period, that facility will be audited at least every six months for the next 18 months.\n(3) The commissioner may conduct special audits if the commissioner determines that circumstances exist that could alter or affect the validity of case mix reimbursement classifications of residents. These circumstances include, but are not limited to, the following:\n(i) frequent changes in the administration or management of the facility;\n(ii) an unusually high percentage of residents in a specific case mix reimbursement classification;\n(iii) a high frequency in the number of reconsideration requests received from a facility;\n(iv) frequent adjustments of case mix reimbursement classifications as the result of reconsiderations or audits;\n(v) a criminal indictment alleging provider fraud;\n(vi) other similar factors that relate to a facility's ability to conduct accurate assessments;\n(vii) an atypical pattern of scoring minimum data set items;\n(viii) nonsubmission of assessments;\n(ix) late submission of assessments; or\n(x) a previous history of audit changes of 35 percent or greater.\n(f) If the audit results in a case mix reimbursement classification change, the commissioner must transmit the audit classification notice by electronic means to the nursing facility within 15 business days of completing an audit. The nursing facility is responsible for distribution of the notice to each resident or the resident's representative. This notice must be distributed by the nursing facility within three business days after receipt. The notice must inform the resident of the case mix reimbursement classification assigned, the opportunity to review the documentation supporting the classification, the opportunity to obtain clarification from the commissioner, the opportunity to request a reconsideration of the classification, and the address and telephone number of the Office of Ombudsman for Long-Term Care.\nMS 2020 [Repealed, 1Sp2021 c 7 art 3 s 47]\n(a) For purposes of medical assistance payment of long-term care services, a recipient must be determined, using assessments defined in subdivision 4, to meet one of the following nursing facility level of care criteria:\n(1) the person requires formal clinical monitoring at least once per day;\n(2) the person needs the assistance of another person or constant supervision to begin and complete at least four of the following activities of living: bathing, bed mobility, dressing, eating, grooming, toileting, transferring, and walking;\n(3) the person needs the assistance of another person or constant supervision to begin and complete toileting, transferring, or positioning and the assistance cannot be scheduled;\n(4) the person has significant difficulty with memory, using information, daily decision making, or behavioral needs that require intervention;\n(5) the person has had a qualifying nursing facility stay of at least 90 days;\n(6) the person meets the nursing facility level of care criteria determined 90 days after admission or on the first quarterly assessment after admission, whichever is later; or\n(7) the person is determined to be at risk for nursing facility admission or readmission through a face-to-face long-term care consultation assessment as specified in section 256B.0911, subdivision 17 to 21, 23, 24, 27, or 28, by a county, tribe, or managed care organization under contract with the Department of Human Services. The person is considered at risk under this clause if the person currently lives alone or will live alone or be homeless without the person's current housing and also meets one of the following criteria:\n(i) the person has experienced a fall resulting in a fracture;\n(ii) the person has been determined to be at risk of maltreatment or neglect, including self-neglect; or\n(iii) the person has a sensory impairment that substantially impacts functional ability and maintenance of a community residence.\n(b) The assessment used to establish medical assistance payment for nursing facility services must be the most recent assessment performed under subdivision 4, paragraphs (b) and (c), that occurred no more than 90 calendar days before the effective date of medical assistance eligibility for payment of long-term care services. In no case shall medical assistance payment for long-term care services occur prior to the date of the determination of nursing facility level of care.\n(c) The assessment used to establish medical assistance payment for long-term care services provided under chapter 256S and section 256B.49 and alternative care payment for services provided under section 256B.0913 must be the most recent face-to-face assessment performed under section 256B.0911, subdivisions 17 to 21, 23, 24, 27, or 28, that occurred no more than 60 calendar days before the effective date of medical assistance eligibility for payment of long-term care services.\n(a) A resident or prospective resident whose level of care determination results in a denial of long-term care services can appeal the determination as outlined in section 256B.0911, subdivision 30, clause (9).\n(b) The commissioner of human services shall ensure that notice of changes in eligibility due to a nursing facility level of care determination is provided to each affected recipient or the recipient's guardian at least 30 days before the effective date of the change. The notice shall include the following information:\n(1) how to obtain further information on the changes;\n(2) how to receive assistance in obtaining other services;\n(3) a list of community resources; and\n(4) appeal rights.",
	"repealed": false
}