{
	"id": "90.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.151",
	"title": "90.151 PERMITS TO CUT AND REMOVE TIMBER.",
	"text": "(a) Following receipt of the down payment for state timber required under section 90.14 or 90.191, the commissioner shall issue a numbered permit to the purchaser, in a format approved by the commissioner, by the terms of which the purchaser is authorized to enter upon the land and to cut and remove the timber described in the permit as designated for cutting in the report of the state appraiser, according to the provisions of this chapter. The permit must be correctly dated and executed by the commissioner and signed by the purchaser. If a permit is not signed by the purchaser within 45 days from the date of purchase, the permit cancels and the down payment for timber required under section 90.14 forfeits to the state. The commissioner may grant an additional period for the purchaser to sign the permit, not to exceed ten business days, provided the purchaser pays a $200 penalty fee.\n(b) The permit expires no later than five years after the date of sale as the commissioner shall specify or as specified under section 90.191, and the timber must be cut and removed within the time specified. If additional time is needed, the permit holder must request, before the expiration date, and may be granted, for good and sufficient reasons, up to 90 additional days for the completion of skidding, hauling, and removing all equipment and buildings. All cut timber, equipment, and buildings not removed from the land after expiration of the permit becomes the property of the state.\n(c) The commissioner may grant additional time not to exceed 240 days for removing cut timber, equipment, and buildings upon receipt of a written request by the permit holder for good and sufficient reasons. The permit holder may combine in the written request under this paragraph the request for additional time under paragraph (b).\nThe permit shall state the amount of timber estimated for cutting on the land, the estimated value thereof, and the price at which it is sold in units of per thousand feet, per cord, per piece, per ton, or by whatever description sold, and shall specify that all landings of cut products shall be legibly marked with the assigned permit number. The permit shall provide for the continuous identification and control of the cut timber from the time of cutting until delivery to the consumer. The permit shall provide that failure to continuously identify the timber as specified in the permit constitutes trespass.\nThe permit shall contain such provisions as may be necessary to secure to the state the title of all timber cut thereunder wherever found until full payment therefor and until all provisions of the permit have been fully complied with. The permit shall provide that from the date cutting commences until the expiration of the permit, including all extensions, the purchaser and successors in interest shall be liable to the state for the full permit price of all timber covered thereby, notwithstanding any subsequent damage or injury thereto or trespass thereon or theft thereof, and without prejudice to the right of the state to pursue such timber and recover the value thereof anywhere prior to the payment therefor in full to the state. If an effective permit is forfeited prior to any cutting activity, the purchaser is liable to the state for a sum equal to the down payment and bid guarantee. Upon recovery from any person other than the permit holder, the permit holder shall be deemed released to the extent of the net amount, after deducting all expenses of collecting same, recovered by the state from such other person.\nOnce a permit becomes effective and cutting commences, the permit holder is liable to the state for the permit price for all timber required to be cut, including timber not cut. The permit shall provide that all timber sold or designated for cutting shall be cut in such a manner so as not to cause damage to other timber; that the permit holder shall remove all timber authorized and designated to be cut under the permit; that timber sold by measure identified in the permit, but later determined by the commissioner not to be convertible into the permit's measure, shall be paid for by the piece or cord or other unit of measure according to the size, species, or value, as may be determined by the commissioner; and that all timber products, except as specified by the commissioner, shall be scaled and the final settlement for the timber cut shall be made on this scale.\nThe permit shall provide that the permit holder upon request of the commissioner shall make a report in writing to the commissioner under oath enumerating and stating the amounts of timber cut under such permit, the kinds of timber removed and the amounts of each in board feet, per piece, in cords, or any other unit of measure, in the manner required by the commissioner. Any false return or report made to the commissioner by any such permit holder or by any one representing the permit holder shall constitute a gross misdemeanor.\nThe permit shall provide that the permit holder shall not start cutting any state timber nor clear landings nor logging roads until the commissioner has been notified and has given prior approval to such cutting operations. Approval shall not be granted until the permit holder has completed a presale conference with the state appraiser designated to supervise the cutting. The permit holder shall also give prior notice whenever permit operations are to be temporarily halted, whenever permit operations are to be resumed, and when permit operations are to be completed.\nThe permit shall provide that the permit holder shall pay the permit price value for any timber sold which is negligently destroyed or damaged by the permit holder in cutting or removing other timber sold. If the permit holder shall cut or remove or negligently destroy or damage any timber upon the land described, not sold under the permit, except such timber as it may be necessary to cut and remove in the construction of necessary logging roads and landings approved as to location and route by the commissioner, such timber shall be deemed to have been cut in trespass. The permit holder shall be liable for any such timber and recourse may be had upon the security deposit.\nThe permit shall provide that the commissioner shall have the power to order suspension of all operations under the permit when the conditions thereof have not been complied with and any timber cut or removed during such suspension shall be deemed to have been cut in trespass; that the commissioner may cancel the permit at any time due to a breach of the permit conditions and such cancellation shall constitute repossession of the timber by the state; that the permit holder shall remove equipment and buildings from such land within 90 days after such cancellation; that, if the purchaser at any time fails to pay any obligations to the state under any other permits, any or all permits may be canceled; and that any timber cut or removed in violation of the terms of the permit or of any law shall constitute trespass.\nThe permit shall provide that the permit holder shall dispose of or treat all slashings or other refuse resulting from cutting operations, as specified in the permit, in the manner now or hereafter provided by law.\nThe permit shall provide that at any time the state may bring an action or suit to restrain, enjoin and prohibit the further cutting or removal of timber or the further entry of the permit holder or representatives upon any of the lands covered by the permit when in the opinion of the attorney general any of the terms of the permit are being or have been violated, which suit shall be without prejudice to any other action or proceeding on behalf of the state.\nExcept as authorized under section 90.191, any permit which fails to conform to the requirements of this section or, in the case of a permit issued under section 90.121, which fails to conform to the requirements of section 90.121, shall be void.\nThe permit shall provide that should the commissioner find it advisable to salvage or remove for proper forest management certain unsold timber within the permit area, this timber, with the written consent of the permit holder, may be added at an appraised price to the timber sold.\n[Repealed, 1994 c 551 s 12]\n[Repealed, 1994 c 551 s 12]\nThe permit may include a schedule of liquidated damage charges for breach of permit terms by the permit holder. The damage charges shall be limited to amounts that are reasonable in light of the anticipated or actual harm caused by the breach, the difficulties of proof of loss, and the inconvenience or nonfeasibility of otherwise obtaining an adequate remedy.",
	"repealed": false
}