{
	"id": "354A.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.021",
	"title": "354A.021 TEACHERS RETIREMENT FUND ASSOCIATION IN ST. PAUL.",
	"text": "There is established the teachers retirement fund association in the city of St. Paul. The association is known as the \"St. Paul Teachers Retirement Fund Association.\" The association is a continuation of the teachers retirement fund association with the same corporate name established under the authorization contained in Laws 1909, chapter 343, section 1.\n(a) The teachers retirement fund association must be organized and governed pursuant to this chapter and chapter 317A, except that the association must be deemed to be a nonprofit corporation without coming within the definition in section 317A.011, subdivision 6. Any corporate action of any teachers retirement fund association taken prior to April 9, 1976, must be deemed to be valid if it conformed with Minnesota Statutes 1976, chapter 317 or 354A, or Revised Laws 1905, chapter 58, as amended through April 9, 1976.\n(b) In addition to the other powers and duties of the board of trustees of the teachers retirement fund association, the board must approve early retirement and optional annuity factors, subject to review by the actuary retained by the Legislative Commission on Pensions and Retirement; must establish the schedule for implementation of the approved factors; and must notify the Legislative Commission on Pensions and Retirement of the implementation schedule.\nWithin the teachers retirement fund association there must be created a special retirement fund, which must include all of the assets of the teachers retirement fund association other than assets of a tax-sheltered annuity program and fund authorized pursuant to subdivision 5 which were acquired for the specific purpose of being credited to that fund. The special retirement fund must be credited with all employee and employer contributions, all interest and all other income authorized by law. Within the special retirement fund there may be established separate special retirement fund accounts for the purpose of providing convenience in the funding of and accounting for retirement annuities and any authorized ancillary benefits.\nThe assets of the special retirement fund shall be disbursed only for the purposes provided for in this chapter, the articles of incorporation or bylaws in effect as of March 31, 1975, and the articles of incorporation or bylaws adopted subsequent to March 31, 1975 in accordance with the provisions of section 354A.12. All appropriate expenses of and any authorized benefits provided by the teachers retirement fund association shall be paid from the special retirement fund. Amounts necessary to make payments from the special retirement fund of the teachers retirement fund association are hereby appropriated.\n[Repealed, 2014 c 296 art 6 s 48]\nThe trustees of the teachers retirement fund association must administer the fund in accordance with the applicable portions of this chapter, of the articles of incorporation, of the bylaws, and of chapters 356 and 356A. The purpose of this subdivision is to establish the teachers retirement fund association as a trust under the laws of the state of Minnesota for all purposes related to section 401(a) of the Internal Revenue Code of the United States, including all amendments.\nThe board of trustees of the teachers retirement fund association may contract for the services of an approved actuary and fix the reasonable compensation for those services. Any approved actuary retained by the board must function as the actuarial advisor to the board and may perform actuarial valuations and experience studies to supplement those performed by the actuary retained under section 356.214. Any supplemental actuarial valuations or experience studies must be filed with the executive director of the Legislative Commission on Pensions and Retirement.\nThe books and accounts of the teachers retirement fund association must be examined and audited periodically as considered necessary by the state auditor. A full and detailed report of the examination and audit must be made and a copy provided to the teachers retirement fund association board of trustees. The cost of any examination and audit must be paid by the teachers retirement fund association in accordance with section 6.56. For purposes of section 6.56, the teachers retirement fund association is considered a local governmental entity equivalent to a county, city, town, or school district.\n(a) On or before July 1, 2006, and within six months of the date of the approval of any amendment to the articles of incorporation or bylaws, the chief administrative officer of the teachers retirement fund association must prepare and publish an updated compilation of the articles of incorporation and the bylaws of the association.\n(b) The chief administrative officer of the teachers retirement fund association must certify the accuracy and the completeness of the compilation.\n(c) The compilation of the articles of incorporation and bylaws of the teachers retirement fund association must contain an index.\n(d) The compilation must be made available to association members and other interested parties. The association may charge a fee for a copy that reflects the price of printing or otherwise producing the copy. The compilation must be filed, without charge, by the teachers retirement fund association with the Legislative Commission on Pensions and Retirement, the Legislative Reference Library, the state auditor, the commissioner of education, the chancellor of the Minnesota State Colleges and Universities system, and the superintendent of Independent School District No. 625, St. Paul. The compilation may be filed by email.\n(e) The teachers retirement fund association may contract with the revisor of statutes for the preparation of the compilation.\n(f) If the teachers retirement fund association makes an updated copy of its articles of incorporation and bylaws available on its website, the teachers retirement fund association is not obligated to file a hard copy of the documents under paragraph (d) for the applicable filing period.",
	"repealed": false
}