{
	"id": "169.781",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.781",
	"title": "169.781 ANNUAL COMMERCIAL VEHICLE INSPECTION; INSPECTORS, FEE, PENALTY.",
	"text": "For purposes of sections 169.781 to 169.783:\n(a) \"Commercial motor vehicle\":\n(1) means a motor vehicle as defined in section 169.011, subdivision 16, paragraph (a), or combination of motor vehicles used to transport passengers or property if the motor vehicle:\n(i) has a gross vehicle weight of more than 26,000 pounds;\n(ii) is a vehicle in a combination of more than 26,000 pounds;\n(iii) is a bus; or\n(iv) is of any size and is used in the transportation of hazardous materials that are required to be placarded under Code of Federal Regulations, title 49, parts 100-185; and\n(2) does not include (i) a school bus or Head Start bus displaying a certificate under section 169.451, or (ii) a bus operated by the Metropolitan Council or by a local transit commission created in chapter 458A.\n(b) \"Commissioner\" means the commissioner of public safety.\n(c) \"Owner\" means a person who owns, or has control, under a lease of more than 30 days' duration, of one or more commercial motor vehicles.\n(a) It is unlawful for a person to operate or permit the operation, in violation of the requirements of paragraph (b), of:\n(1) a commercial motor vehicle registered in Minnesota;\n(2) special mobile equipment as defined in section 168.002, subdivision 31, and which is self-propelled, if it is mounted on a commercial motor vehicle chassis; or\n(3) a vehicle used to transport passengers by a motor carrier of railroad employees under section 221.0255.\n(b) A vehicle described in paragraph (a):\n(1) must display a valid safety inspection decal issued by an inspector certified by the commissioner; or\n(2) must carry (i) proof that the vehicle complies with federal motor vehicle inspection requirements for vehicles in interstate commerce, and (ii) a certificate of compliance with federal requirements issued by the commissioner under subdivision 9.\n(a) An inspection required by this section may be performed only by:\n(1) an employee of the Department of Public Safety or Transportation who has been certified by the commissioner after having received training provided by the State Patrol; or\n(2) another person who has been certified by the commissioner after having received training provided by the State Patrol or other training approved by the commissioner.\n(b) A person who is not an employee of the Department of Public Safety or Transportation may be certified by the commissioner if the person is:\n(1) an owner, or employee of the owner, of one or more commercial motor vehicles that are power units;\n(2) a dealer licensed under section 168.27 and engaged in the business of buying and selling commercial motor vehicles, or an employee of the dealer;\n(3) engaged in the business of repairing and servicing commercial motor vehicles; or\n(4) employed by a governmental agency that owns commercial vehicles.\n(c) Certification of persons described in paragraph (b), clauses (1) to (4), is effective for two years from the date of certification. The commissioner may require biennial retraining of persons holding a certificate under paragraph (b) as a condition of renewal of the certificate. The commissioner may charge a fee of not more than $10 for each certificate issued and renewed. A certified person described in paragraph (b), clauses (1) to (4), may charge a reasonable fee for each inspection of a vehicle not owned by the person or the person's employer.\n(d) Except as otherwise provided in subdivision 5, the standards adopted by the commissioner for commercial motor vehicle inspections under sections 169.781 to 169.783 must be the standards prescribed in Code of Federal Regulations, title 49, section 396.17, and in chapter III, subchapter B, appendix A.\n(e) The commissioner may classify types of vehicles for inspection purposes and may issue separate classes of inspector certificates for each class.\n(f) The commissioner, after notice and an opportunity for a hearing, may suspend a certificate issued under paragraph (b) for failure to meet annual certification requirements prescribed by the commissioner or failure to inspect commercial motor vehicles in accordance with inspection procedures established by the State Patrol. The commissioner shall revoke a certificate issued under paragraph (b) if the commissioner determines after notice and an opportunity for a hearing that the certified person issued an inspection decal for a commercial motor vehicle when the person knew or reasonably should have known that the vehicle was in such a state of repair that it would have been declared out of service if inspected by an employee of the State Patrol. Suspension and revocation of certificates under this subdivision are not subject to sections 14.57 to 14.69.\n(a) A person performing an inspection under this section shall issue an inspection report to the owner of the commercial motor vehicle inspected. The report must include:\n(1) the full name of the person performing the inspection, and the person's inspector certification number;\n(2) the name of the owner of the vehicle and, if applicable, the United States Department of Transportation carrier number issued to the owner of the vehicle, or to the operator of the vehicle if other than the owner;\n(3) the vehicle identification number and, if applicable, the license plate number of the vehicle;\n(4) the date and location of the inspection;\n(5) the vehicle components inspected and a description of the findings of the inspection, including identification of the components not in compliance with federal motor carrier safety regulations; and\n(6) the inspector's certification that the inspection was complete, accurate, and in compliance with the requirements of this section.\n(b) The owner must retain a copy of the inspection report for at least 14 months at a location in the state where the vehicle is domiciled or maintained. The inspector must maintain a copy of the inspection report for a period of 14 months following the inspection in a location in the state where the inspector conducts business. During this period the report must be available for inspection by an authorized federal, state, or local official.\n(c) The commissioner shall prescribe the form of the inspection report and revise it as necessary to comply with state and federal law and regulations. The adoption of the report form is not subject to the Administrative Procedure Act.\n(a) A person inspecting a commercial motor vehicle shall issue an inspection decal for the vehicle if each inspected component of the vehicle complies with federal motor carrier safety regulations. The decal must state that in the month specified on the decal the vehicle was inspected and each inspected component complied with federal motor carrier safety regulations. The decal is valid for 12 months after the month specified on the decal. The commissioners of public safety and transportation shall make decals available, at a fee of not more than $2 for each decal, to persons certified to perform inspections under subdivision 3, paragraph (b). Decals are issued to inspectors by serial number and are not transferable unless approved by the commissioner.\n(b) A person who, with the intent to defraud, falsely makes, duplicates, alters, or forges a decal or other writing or thing purporting to be a Minnesota inspection decal described in this subdivision is guilty of a gross misdemeanor. A person who, with the intent to defraud, possesses a decal or other writing or thing falsely purporting to be a Minnesota inspection decal described in this subdivision is guilty of a gross misdemeanor.\nEmployees of the State Patrol and motor transportation representatives of the Department of Transportation may review records required to be kept under subdivision 4, paragraph (b), and conduct random vehicle inspections and audits at the facility of an owner of a commercial motor vehicle.\nThe commissioner shall pay all revenues received under this section to the commissioner of management and budget for deposit in the trunk highway fund.\nA violation of this section is a misdemeanor.\nAn owner of a commercial motor vehicle that is subject to and in compliance with federal motor vehicle inspection requirements for vehicles in interstate commerce may apply to the commissioner for a certificate of compliance with federal requirements. On payment of a fee equal to the fee for an inspection decal under subdivision 5, the commissioner shall issue the certificate to the applicant. This subdivision only applies to Minnesota-licensed vehicles that are not housed or maintained in Minnesota.\n(a) This section does not apply to a vehicle operated by a motor carrier of passengers, as defined in section 221.012, subdivision 26, if the vehicle has been inspected under section 221.0252, subdivision 3, paragraph (a), clause (2), within the previous 12 months.\n(b) This section does not apply to a covered farm vehicle, as defined in Code of Federal Regulations, title 49, section 390.5, that is not carrying hazardous materials of a type or quantity that requires the vehicle to be placarded in accordance with Code of Federal Regulations, title 49, section 172.504.",
	"repealed": false
}