{
	"id": "299C.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.62",
	"title": "299C.62 BACKGROUND CHECK.",
	"text": "The superintendent shall develop procedures in accordance with United States Code, title 34, section 40102, to enable a qualified entity to request a background check to determine whether a covered worker is the subject of any reported conviction for a background check crime. The superintendent is authorized to exchange fingerprints with the Federal Bureau of Investigation for purposes of the background check. The superintendent shall recover the cost of a background check through a fee charged to the qualified entity and make reasonable efforts to respond to the inquiry within 15 business days.\nThe superintendent may not perform a background check of a covered individual under this section unless the covered individual:\n(1) completes and signs a statement that:\n(i) contains the name, address, and date of birth appearing on a valid identification document, as defined in United States Code, title 18, section 1028, of the covered individual;\n(ii) the covered individual has not been convicted of a crime and, if the covered individual has been convicted of a crime, contains a description of the crime and the particulars of the conviction;\n(iii) notifies the covered individual that the entity may request a background check under subdivision 1;\n(iv) notifies the covered individual of the covered individual's rights under subdivision 3; and\n(v) notifies the covered individual that prior to the completion of the background check the qualified entity may choose to deny the covered individual access to a person to whom the qualified entity provides care; and\n(2) if requesting a national criminal history background check, provides a set of fingerprints.\nThe qualified entity shall notify the covered individual who is subjected to a background check under subdivision 1 that the individual has the right to:\n(1) obtain a copy of any background check report;\n(2) challenge the accuracy or completeness of the information contained in the background report or record pursuant to section 13.04, subdivision 4, or applicable federal authority; and\n(3) be given notice of the opportunity to appeal and instructions on how to complete the appeals process.\nThe superintendent shall respond to a background check request within a reasonable time after receiving a request from a qualified entity or the signed, written document described in subdivision 2. The superintendent shall provide the qualified entity with a copy of the covered individual's criminal record or a statement that the covered individual is not the subject of a criminal history record at the bureau. It is the responsibility of the qualified entity to determine if the covered individual qualifies as an employee, volunteer, or independent contractor under this section.\nSections 299C.60 to 299C.64 do not create a duty to perform a background check.\nEvidence or proof that a background check of a volunteer was not requested under sections 299C.60 to 299C.64 by a qualified entity is not admissible in evidence in any litigation against a nonprofit or charitable organization.",
	"repealed": false
}