{
	"id": "246.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.51",
	"title": "246.51 PAYMENT FOR CARE AND TREATMENT; DETERMINATION.",
	"text": "[Repealed, 2009 c 79 art 3 s 19]\nThe executive board shall determine available health plan coverage from a health plan company for services provided to clients admitted to a state-operated community-based program. If the health plan coverage requires a co-pay or deductible, or if there is no available health plan coverage, the executive board shall determine or redetermine what part of the noncovered cost of care, if any, the client is able to pay. If the client is unable to pay the uncovered cost of care, the executive board shall determine the client's relatives' ability to pay. The client and relatives shall provide to the executive board documents and proof necessary to determine the client's and relatives' ability to pay. Failure to provide the executive board with sufficient information to determine ability to pay may make the client or relatives liable for the full cost of care until the time when sufficient information is provided. If the executive board determines that the responsible party does not have the ability to pay, the executive board shall waive payment of the portion that exceeds ability to pay under the determination.\nThe executive board shall determine or redetermine, if necessary, what part of the cost of care, if any, a client who received services in regional treatment centers or nursing homes operated by state-operated services is able to pay. If the client is unable to pay the full cost of care, the executive board shall determine if the client's relatives have the ability to pay. The client and relatives shall provide to the executive board documents and proof necessary to determine the client's and relatives' ability to pay. Failure to provide the executive board with sufficient information to determine ability to pay may make the client or relatives liable for the full cost of care until the time when sufficient information is provided. No parent is liable for the cost of care given a client at a regional treatment center after the client has reached the age of 18 years.\nThe executive board shall adopt, pursuant to the Administrative Procedure Act, rules establishing uniform standards for determination of client liability and relative, guardian or conservator responsibility for care provided at state facilities. The standards for determination may differ for mental illness, substance use disorder, or developmental disability. The standards established in rules adopted under chapter 254B must determine the amount of client and relative responsibility when a portion of the client's cost of care has been paid under chapter 254B. These rules must have the force and effect of law.\nThe executive board may recover, under sections 246.50 to 246.55, the cost of any care provided in a state facility, including care provided prior to July 1, 1989, regardless of the terminology used to designate the status or condition of the person receiving the care or the terminology used to identify the facility. For purposes of recovering the cost of care provided prior to July 1, 1989, the term \"state facility\" as used in sections 246.50 to 246.55 includes \"state hospital,\" \"regional treatment center,\" or \"regional center\"; and the term \"client\" includes, but is not limited to, persons designated as \"having a mental illness or developmental disability,\" or \"having a substance use disorder.\"",
	"repealed": false
}