{
	"id": "161.1231",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.1231",
	"title": "161.1231 PARKING FACILITIES FOR I-394.",
	"text": "Notwithstanding any other law, the commissioner may acquire land by purchase, gift, or eminent domain for parking facilities described in this section and may construct, operate, repair, and maintain parking facilities primarily to serve vehicles traveling the route in the interstate highway system described generally as Legislative Routes Nos. 10 and 107 between I-494 and the Hawthorne interchange in the city of Minneapolis, also known as I-394. Other vehicles may use the parking facilities when space is available.\nThe commissioner shall adopt rules and establish procedures for the operation and use of the parking facilities. The rules are exempt from the requirements of chapter 14. A copy of the rules that regulate use of the facilities by drivers must be posted in each parking facility. The rules must:\n(1) establish incentives, which must include preferential parking locations, to encourage drivers of vehicles that travel I-394 and that are occupied by two or more persons to use the facilities;\n(2) define peak travel hours and provide that during peak travel hours single-occupant vehicles be charged a surcharge to bring the parking fee for those vehicles to approximately the same level as parking fees charged in the private parking ramps located in Minneapolis;\n(3) provide preferential parking locations for vehicles licensed and operated under section 168.021;\n(4) establish application, permit, and use requirements; and\n(5) provide for removal and impoundment of vehicles and assessment of a service fee on vehicles parked in violation of this section and the rules adopted under it.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\n(a) The commissioner may make agreements with or may lease the parking facilities to the city of Minneapolis or to a private party. The agreement or lease may allow the city of Minneapolis or private party to operate the facilities according to the commissioner's rules and procedures and to collect the fees established by the commissioner. The commissioner shall require a private operator to obtain liability insurance in an amount prescribed by the commissioner to insure the operator and the state against all claims occurring because of the existence of the agreement or lease. The agreement may provide for reasonable compensation.\n(b) The commissioner may negotiate the agreement or lease without requiring competitive bids. The terms of an agreement or lease must be approved by the federal agency that grants money for the construction of the facilities.\nThe commissioner shall establish and collect fees for use of the parking facilities. The fees must be established and adjusted in compliance with United States Code, title 23, section 137, and are not subject to chapter 14, including section 14.386, or 16A.1285.\nThis section must be enforced in the same manner as parking ordinances or laws are enforced in Minneapolis. The commissioner may revoke the permit or refuse to issue a permit to a person who repeatedly violates subdivision 7 or the rules of the commissioner.\nA person may not park a motor vehicle in a parking facility described in subdivision 1 except in compliance with subdivision 5 and the rules of the commissioner adopted under subdivision 2. Violation of this subdivision is a misdemeanor.\nFees collected by the commissioner under this section must be deposited in the state treasury and credited to a special account. Money in the account is appropriated to the commissioner to construct, operate, repair, and maintain: (1) the parking facilities, (2) managed lanes, and (3) related multimodal and technology improvements that serve users of the parking facilities.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\nMS 2018 [Repealed, 2020 c 83 art 1 s 103]",
	"repealed": false
}