{
	"id": "368.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/368.01",
	"title": "368.01 POWERS OF CERTAIN METROPOLITAN AREA TOWNS.",
	"text": "A town that has platted portions where 1,200 or more people reside or a town that has a platted area within 20 miles of the city hall of a city of the first class having over 200,000 population shall have the powers enumerated in this section. Its town board may adopt, amend, or repeal ordinances and rules for the purposes enumerated.\nA town with a population of 1,000 or more that does not qualify under subdivision 1, shall have the enumerated powers upon an affirmative vote of its electors at the annual town meeting. The population must be established by the most recent federal decennial census, special census as provided in section 368.015, or population estimate by the state demographer made according to section 4A.02, whichever has the latest stated date of count or estimate.\nThe town board may construct or acquire structures needed for town purposes, and control, protect, and insure public buildings, property, and records.\nThe town board may:\n(1) lay out, open, change, widen or extend streets, alleys, parks, squares, and other public ways and grounds and grade, pave, repair, control, and maintain them;\n(2) establish and maintain drains, canals, and sewers;\n(3) alter, widen or straighten watercourses; and\n(4) lay, repair, or otherwise improve or discontinue sidewalks, paths and crosswalks.\nIt may by ordinance regulate the use of streets and other public grounds to prevent encumbrances or obstructions, and require the owners or occupants of buildings and the owners of vacant lots to remove snow, ice, dirt, or rubbish from the adjacent sidewalks. In default of compliance it may remove the encumbrances, obstructions, or substances and assess the cost against the property as a special assessment.\nThe town board may provide for, and by ordinance regulate, the setting out and protection of trees, shrubs, and flowers in the town or upon its property.\nThe town board may acquire by purchase, gift, devise, condemnation or otherwise, hold and manage cemetery grounds, enclose, lay out and ornament them and sell and convey lots in them. It may by ordinance regulate cemeteries and the disposal of dead bodies.\nThe town board may provide and by ordinance regulate the use of wells, cisterns, reservoirs, waterworks and other means of water supply.\nThe town board may acquire, improve and operate, and by ordinance regulate tourist camps and automobile parking facilities.\nThe town board may provide hospitals. The town board of a town operating a municipal hospital may by ordinance establish a hospital board with powers and duties to manage and operate the hospital that the town board confers on it. The town board may, by vote of all its members, abolish the hospital board. The hospital board shall consist of five members, each appointed by the town board for a term of five years. Terms of the first members shall be arranged so that the term of one member expires each year. A vacancy shall be filled for the unexpired term. A member may be removed by the town board for cause after a hearing.\nThe town board may establish a fire department, appoint its officers and members and prescribe their duties, and provide fire apparatus. It may adopt ordinances to prevent, control or extinguish fires.\nThe town board may by ordinance name or rename town streets and public places and number or renumber its lots and blocks, or part of them. It may make and record a consolidated plat of the town.\nThe town board may by ordinance restrain or license and regulate auctioneers, transient merchants and dealers, hawkers, peddlers, solicitors, and canvassers.\nThe town board may by ordinance license and regulate baggage wagons, dray drivers, taxicabs, and automobile rental agencies and liveries. At a minimum, an ordinance to license or regulate taxicabs or small vehicle passenger service must provide for driver qualifications, insurance, vehicle safety, and periodic vehicle inspections. An ordinance that regulates pedicabs, rickshaws, or other similar vehicles used for passenger service may permit authorized vehicles to be equipped with an electric motor that meets the requirements for an electric-assisted bicycle under section 169.011, subdivision 27, clause (3).\nThe town board may by ordinance regulate the keeping of animals, restrain their running at large, authorize their impounding and sale or summary destruction, establish pounds, and license and regulate riding academies.\n(a) The town board may by ordinance:\n(1) prohibit or regulate slaughterhouses;\n(2) prevent the bringing, depositing, or leaving within the town of any unwholesome substance or deposit of solid waste within the town not otherwise authorized by law;\n(3) require the owners or occupants of lands to remove unwholesome substances or the unauthorized deposit of solid waste and, if not removed, provide for their removal at the expense of the owner or occupant, which expense shall be a lien upon the property and may be collected as a special assessment;\n(4) provide for or regulate the disposal of sewage, garbage, and other refuse; and\n(5) provide for the cleaning of, and removal of obstructions from waters in the town and prevent their obstruction or pollution.\n(b) The town board may establish a community health board under section 145A.07, subdivision 2, with all the powers of a community health board under the general laws.\nThe town board may by ordinance define nuisances and provide for their prevention or abatement.\nThe town board may by ordinance:\n(1) prevent or license and regulate the exhibition of circuses, theatrical performances, amusements, or shows of any kind, and the keeping of billiard tables and bowling alleys;\n(2) prohibit gambling and gambling devices; and\n(3) license, regulate or prohibit devices commonly used for gambling purposes.\nMS 1982 [Repealed, 1984 c 562 s 48]\nThe town board may by ordinance regulate the construction of buildings.\nThe town board may provide for the government and good order of the town, the suppression of vice and immorality, the prevention of crime, the protection of public and private property, the benefit of residence, trade, and commerce, and the promotion of health, safety, order, convenience, and the general welfare by ordinances consistent with the Constitution and laws of the United States and this state as it deems expedient.\nThe town board may create departments and advisory boards and appoint town officers, employees, and agents as deemed necessary for the proper management and operation of town affairs. It may prescribe the duties and compensation of all officers, appointive and elective, employees, and agents, if not otherwise prescribed by law. It may require any officer or employee to furnish a bond conditioned for the faithful exercise of duties and the proper application of, and payment upon demand of, all money officially received by the officer or employee. Unless otherwise prescribed by law, it shall fix the amount of the bonds. The bonds furnished by the clerk and treasurer shall be corporate surety bonds. It may provide for the payment from town funds of the premium on the official bond of any town officer or employee. It may, except as otherwise provided, remove any appointive officer or employee when in its judgment the public welfare will be promoted by the removal. This provision does not modify the laws relating to veterans preference or to members of a town police or fire civil service commission or public utilities commission.\nEvery ordinance shall be enacted by a majority vote of all the members of the town board unless a larger number is required by law. It shall be signed by the chair of the town board, attested by the clerk and published once in a qualified newspaper having general circulation within the town. If the town board determines that publication of the title and a summary of an ordinance would clearly inform the public of the intent and effect of the ordinance, the town board may by a two-thirds vote of its members, or a four-fifths vote in a town having a five-member board, direct that only the title of the ordinance and a summary be published with notice that a printed copy of the ordinance is available for inspection by any person during regular office hours of the town clerk and at any other location which the town board designates. A copy of the entire text of the ordinance shall be posted in the community library, if there is one, or if not, in any other public location which the town board designates. Before the publication of the title and summary the town board shall approve the text of the summary and determine that it clearly informs the public of the intent and effect of the ordinance. Publishing the title and summary shall fulfill all legal publication requirements as completely as if the entire ordinance is published. The text of the summary shall be published in a body type no smaller than eight-point type. Proof of the publication shall be attached to and filed with the ordinance. Every ordinance shall be recorded in the ordinance book within 20 days after publication of the ordinance or its title and summary. All ordinances shall be suitably entitled and shall be substantially in the style: \"The Town Board of Supervisors of ........ ordains:\".\nThe town board may declare that the violation of any ordinance is a penal offense and prescribe penalties for it. No penalty shall exceed that provided by law for a misdemeanor, but the costs of prosecution may be added.\nThe town board may issue certificates of indebtedness within debt limits to purchase fire or police equipment or ambulance equipment or street construction or maintenance equipment. The certificates shall be payable in not more than five years and be issued on terms and in the manner as the board may determine. If the amount of the certificates to be issued to finance a purchase exceeds 0.24177 percent of the estimated market value of the town, they shall not be issued for at least ten days after publication in the official newspaper of a town board resolution determining to issue them. If before the end of that time, a petition asking for an election on the proposition signed by voters equal to ten percent of the number of voters at the last regular town election is filed with the clerk, the certificates shall not be issued until the proposition of their issuance has been approved by a majority of the votes cast on the question at a regular or special election. A tax levy shall be made for the payment of the principal and interest on the certificates as in the case of bonds.\nA town may establish, improve, ornament, maintain and manage parks, parkways, and recreational facilities and by ordinance protect and regulate their use.\nThe town board may by resolution vacate all or part of any street, alley, public grounds or public way on its own motion or on petition of a majority of the owners of land abutting the street, alley, public grounds, public way, or part to be vacated. When there has been no petition, the resolution may be adopted only by a vote of four-fifths of all members of the board of supervisors. No such vacation shall be made unless it appears in the interest of the public to do so after a hearing preceded by two weeks' published and posted notice. The board shall cause written notice of the hearing to be mailed to each property owner affected by the proposed vacation at least ten days before the hearing. The notice must contain, at minimum, a copy of the petition or proposed resolution as well as the time, place, and date of the hearing. In addition, if the street, alley, public grounds, public way, or any part of it, terminates at or abuts upon any public water, no vacation shall be made unless written notice of the petition or proposed resolution is served by certified mail upon the commissioner of natural resources at least 30 days before the hearing on the matter. The notice to the commissioner of natural resources is for notification purposes only and does not create a right of intervention by the commissioner. After a resolution of vacation is adopted, the clerk shall prepare a notice of completion of the proceedings which shall contain the name of the town, an identification of the vacation, a statement of the time of completion thereof and a description of the real estate and lands affected. The notice shall be presented to the county auditor who shall enter it in the transfer records and note upon the instrument, over the auditor's official signature, the words \"entered in the transfer record.\" The notice shall then be filed with the county recorder. Failure to file the notice shall not invalidate the vacation proceedings.\nAll fines, forfeitures, and penalties recovered for violation of a statute or ordinance to which the town is entitled by law shall be paid into the town treasury. Every court or officer receiving money for a violation, shall return it under oath in accordance with law, and be entitled to duplicate receipts for the amounts paid. One of the receipts shall be filed with the town clerk.\nA town that has special powers under this section may acquire private property within or without its limits by eminent domain for any purpose for which it is authorized by law to take or hold property by purchase or gift. It may also acquire by eminent domain a right-of-way for sewerage or drainage purposes and an outlet for sewerage or drainage within or without its limits. The procedure shall be that prescribed by chapter 117.\nMS 1982 [Repealed, 1984 c 562 s 48]\nThis section shall not be construed to repeal or rescind the powers of any town provided by other law.\nThe town clerk of each town exercising special powers under this section shall so notify in writing the county auditor of the county in which the town is located and the secretary of state. The written notice shall be filed by the county auditor and the secretary of state as a public record.\nIf a town exercises a power under this section it may continue to exercise the power notwithstanding any later change in population.",
	"repealed": false
}