{
	"id": "256P.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.07",
	"title": "256P.07 REPORTING OF INCOME AND CHANGES.",
	"text": "Participants who receive Supplemental Security Income and qualify for Minnesota supplemental aid under chapter 256D or for housing support under chapter 256I are exempt from reporting income under this chapter.\n[See Note.]\nParticipants who qualify for child care assistance programs under chapter 142E are exempt from this section except the reporting requirements in subdivision 6.\n[See Note.]\nAn applicant or participant must provide information on an application and any subsequent reporting forms about the assistance unit's circumstances that affect eligibility or benefits. An applicant or assistance unit must report changes that affect eligibility or benefits as identified in subdivisions 3, 4, 5, 7, 8, and 9 during the application period or by the tenth of the month following the month that the assistance unit's circumstances changed. When information is not accurately reported, both an overpayment and a referral for a fraud investigation may result. When information or documentation is not provided, the receipt of any benefit may be delayed or denied, depending on the type of information required and its effect on eligibility.\n[See Note.]\n(a) An assistance unit must report changes or anticipated changes as described in this section.\n(b) An assistance unit must report:\n(1) a change in eligibility for Supplemental Security Income, Retirement Survivors Disability Insurance, or another federal income support;\n(2) a change in address or residence;\n(3) a change in household composition with the exception of programs under chapter 256I;\n(4) cash prizes and winnings according to guidance provided for the Supplemental Nutrition Assistance Program;\n(5) a change in citizenship or immigration status;\n(6) a change in family status with the exception of programs under chapter 256I; and\n(7) a change that makes the value of the assistance unit's assets at or above the asset limit.\n(c) When an agency could have reduced or terminated assistance for one or more payment months if a delay in reporting a change specified under paragraph (b) had not occurred, the agency must determine whether the agency could have issued a timely notice on the day that the change occurred. When a timely notice could have been issued, each month's overpayment subsequent to the notice must be considered a client error overpayment under section 256P.08.\n[See Note.]\nIn addition to subdivision 3, an assistance unit under chapter 142G must report:\n(1) a pregnancy not resulting in birth when there are no other minor children;\n(2) a change in school attendance of a parent under 20 years of age; and\n(3) an individual in the household who is 18 or 19 years of age attending high school who graduates or drops out of school.\n[See Note.]\nIn addition to subdivisions 3 and 4, an assistance unit participating in the diversionary work program under section 142G.90 must report on an application:\n(1) shelter expenses; and\n(2) utility expenses.\n[See Note.]\n(a) An assistance unit under chapter 119B, within ten days of the change, must report:\n(1) a change in a parentally responsible individual's custody schedule for any child receiving child care assistance program benefits;\n(2) a permanent end in a parentally responsible individual's authorized activity;\n(3) if the unit's family's annual included income exceeds 85 percent of the state median income, adjusted for family size;\n(4) a change in address or residence;\n(5) a change in household composition;\n(6) a change in citizenship or immigration status; and\n(7) a change in family status.\n(b) An assistance unit subject to section 142E.11, subdivision 1, paragraph (b), must report a change in the unit's authorized activity status.\n(c) An assistance unit must notify the county when the unit wants to reduce the number of authorized hours for children in the unit.\n[See Note.]\n(a) In addition to subdivision 3, an assistance unit participating in the Minnesota supplemental aid program under chapter 256D and not receiving Supplemental Security Income must report:\n(1) a change in unearned income of $50 per month or greater; and\n(2) a change in earned income of $100 per month or greater.\n(b) An assistance unit receiving housing assistance under section 256D.44, subdivision 5, paragraph (g), including an assistance unit that also receives Supplemental Security Income, must report:\n(1) a change in shelter expenses; and\n(2) a new rent subsidy or a change in rent subsidy.\n[See Note.]\n(a) In addition to subdivision 3, an assistance unit participating in the housing support program under chapter 256I and not receiving Supplemental Security Income must report:\n(1) a change in unearned income of $50 per month or greater; and\n(2) a change in earned income of $100 per month or greater, unless the assistance unit is already subject to six-month reporting requirements in section 256P.10.\n(b) Notwithstanding the exemptions in subdivisions 1 and 3, an assistance unit receiving housing support under chapter 256I, including an assistance unit that receives Supplemental Security Income, must report:\n(1) a new rent subsidy or a change in rent subsidy;\n(2) a change in the disability status of a unit member; and\n(3) a change in household composition if the assistance unit is a participant in housing support under section 256I.04, subdivision 3, paragraph (a), clause (3).\n[See Note.]\nIn addition to subdivision 3, an assistance unit participating in the general assistance program under chapter 256D must report:\n(1) a change in unearned income of $50 per month or greater;\n(2) a change in earned income of $100 per month or greater, unless the assistance unit is already subject to six-month reporting requirements in section 256P.10; and\n(3) changes in any condition that would result in the loss of basis for eligibility in section 256D.05, subdivision 1, paragraph (a).\n[See Note.]",
	"repealed": false
}