{
	"id": "90.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.161",
	"title": "90.161 SECURITY DEPOSITS REQUIRED FOR EFFECTIVE TIMBER PERMITS.",
	"text": "(a) Except as otherwise provided by law, the purchaser of any state timber, before any timber permit becomes effective for any purpose, shall give good and valid security in the form of cash; a certified check; a cashier's check; a postal, bank, or express money order; a corporate surety bond; or an irrevocable bank letter of credit to the state of Minnesota equal to the value of all timber covered or to be covered by the permit, as shown by the sale price bid and the appraisal report as to quantity, less the amount of any payments pursuant to section 90.14.\n(b) The security deposit shall be conditioned upon the faithful performance by the purchaser and successors in interest of all terms and conditions of the permit and all requirements of law in respect to timber sales. The security deposit shall be approved in writing by the commissioner and filed for record in the commissioner's office.\n(c) A purchaser may post bond for 100 percent of the purchase price and request refund of the amount of any payments pursuant to section 90.14. The commissioner may credit the refund to any other permit held by the same permit holder if the permit is delinquent as provided in section 90.181, subdivision 2, or may credit the refund to any other permit to which the permit holder requests that it be credited.\n(d) In the event of a default, the commissioner may take from the deposit the sum of money to which the state is entitled. The commissioner shall return the remainder of the deposit, if any, to the person making the deposit. When cash is deposited as security, it shall be applied to the amount due when a statement is prepared and transmitted to the permit holder according to section 90.181. Any balance due to the state shall be shown on the statement and shall be paid as provided in section 90.181. Any amount of the deposit in excess of the amount determined to be due according to section 90.181 shall be returned to the permit holder when a final statement is transmitted under section 90.181. All or part of a cash deposit may be withheld from application to an amount due on a nonfinal statement if it appears that the total amount due on the permit will exceed the bid price.\n(e) If an irrevocable bank letter of credit is provided as security under paragraph (a), at the written request of the permittee, the commissioner shall annually allow the amount of the bank letter of credit to be reduced by an amount proportionate to the value of timber that has been harvested and for which the state has received payment under the timber permit. The remaining amount of the bank letter of credit after a reduction under this paragraph must not be less than the value of the timber remaining to be harvested under the timber permit.\n(f) If cash; a certified check; a cashier's check; a personal check; or a postal, bank, or express money order is provided as security under paragraph (a) and no cutting of state timber has taken place on the permit, the commissioner may credit the security provided, less any deposit required under section 90.14, to any other permit to which the permit holder requests in writing that it be credited.\nIf the security deposit is not furnished, no harvesting may occur and 15 percent of the permit's purchase price shall forfeit to the state when the permit expires.\nWhen security is provided by surety bond and the permit holder defaults in payment, the surety upon the bond shall make payment in full to the state of all sums of money due under such permit; and thereupon such surety shall be deemed immediately subrogated to all the rights of the state in the timber so paid for; and such subrogated party may pursue the timber and recover therefor, or have any other appropriate relief in relation thereto which the state might or could have had if such surety had not made such payment. No assignment or other writing on the part of the state shall be necessary to make such subrogation effective, but the certificate signed by and bearing the official seal of the commissioner, showing the amount of such timber, the lands from which it was cut or upon which it stood, and the amount paid therefor, shall be prima facie evidence of such facts.\nPrior to any cutting activity, or activities incidental to the preparation for harvest, a purchaser having posted a security deposit for 100 percent of the purchase price of a sale may request the release of the security and the commissioner shall grant the release while retaining, or upon repayment of, the permit's down payment and bid guarantee deposit requirement.\nAny security required under this section shall be returned to the purchaser within 60 days after the final scale.",
	"repealed": false
}