{
	"id": "162.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.09",
	"title": "162.09 MUNICIPAL STATE-AID STREET SYSTEM.",
	"text": "(a) There is created a municipal state-aid street system within statutory and home rule charter cities having a population of 5,000 or more. The extent of the municipal state-aid street system for a city shall not exceed:\n(1) 20 percent of the total miles of city streets and county roads partially or totally within the jurisdiction of that city; plus\n(2) the mileage of all trunk highways reverted or turned back to the jurisdiction of the city pursuant to law on and after July 1, 1965; plus\n(3) the mileage of county highways reverted or turned back to the jurisdiction of the city pursuant to law on or after May 11, 1994.\n(b) For purposes of this subdivision, the total miles of city streets and county roads within the jurisdiction of a city includes all miles of county highways turned back to that city's jurisdiction on or after May 11, 1994.\n(c) The system shall be established, located, constructed, reconstructed, improved, and maintained as public highways partially or totally within such cities under rules, not inconsistent with this section, made and promulgated by the commissioner as hereinafter provided.\nMS 2012 [Repealed, 2014 c 286 art 4 s 2]\nMS 2012 [Repealed, 2014 c 227 art 1 s 23; 2014 c 286 art 4 s 2]\n(a) The commissioner may grant variances from the rules and from the engineering standards developed pursuant to section 162.13, subdivision 2. A political subdivision in which a municipal state-aid street is located or is proposed to be located may submit a written request to the commissioner for a variance for that street. The commissioner shall comply with section 174.75, subdivision 5, in evaluating a variance request related to a complete streets project.\n(b) The commissioner may grant or deny the variance within 30 days of receiving the variance request. If the variance is denied, the political subdivision may request, within 30 days of receiving notice of denial, and shall be granted a contested case hearing.\n(c) For purposes of this subdivision, \"political subdivision\" includes (1) an agency of a political subdivision which has jurisdiction over parks, and (2) a regional park authority.\n(a) In determining whether any city has a population of 5,000 or more, the last federal census shall be conclusive, except as otherwise provided in this subdivision.\n(b) The governing body of a city may contract with the United States Bureau of the Census to take a special census. A certified copy of the results of the census shall be filed with the appropriate state authorities by the city. The result of the census shall be the population of the city for the purposes of any law providing that population is a required qualification for distribution of highway aids under chapter 162. The special census shall remain in effect until the next federal census is completed and filed. The expense of taking the special census shall be paid by the city.\n(c) If an entire area not heretofore incorporated as a city is incorporated as such during the interval between federal censuses, its population shall be determined by its incorporation census. The incorporation census shall be determinative of the population of the city only until the next federal census.\n(d) The population of a city created by the consolidation of two or more previously incorporated cities shall be determined by the most recent population estimate of the Metropolitan Council or state demographer, until the first federal decennial census or special census taken after the consolidation.\n(e) The population of a city that is not receiving a municipal state-aid street fund apportionment shall be determined, upon request of the city, by the most recent population estimate of the Metropolitan Council or state demographer. A municipal state-aid street fund apportionment received by the city must be based on this population estimate until the next federal decennial census or special census.\n(f) A city that is found in the most recent federal decennial census to have a population of less than 5,000 is deemed for the purposes of this chapter and the Minnesota Constitution, article XIV, to have a population of 5,000 or more under the following circumstances: (1) immediately before the most recent federal decennial census, the city was receiving municipal state-aid street fund distributions; and (2) the population of the city was found in the most recent federal decennial census to be less than 5,000. Following the end of the first calendar year that ends in \"5\" after the decennial census and until the next decennial census, the population of any city must be determined under paragraphs (a) to (e).\nMS 2002 [Repealed, 1Sp2003 c 19 art 2 s 79]\nThe governing bodies of such cities shall by resolution and subject to the concurrence of the commissioner locate and establish a system of municipal state-aid streets in accordance with the rules of the commissioner. A certified copy of the resolution shall be transmitted to the commissioner. Upon receipt of the resolution it shall be the duty of the commissioner to review each system, considering the availability of funds and the desirability of each system in relation to an integrated and coordinated system of highways. After review, the commissioner shall, by written order, approve each system or any portion thereof which in the commissioner's judgment is feasible and desirable. A certified copy of the order shall be filed with the clerk and the engineer of the city.\nThe municipal state-aid street system must not include a segment of a city street that is designated as a pedestrian mall under chapter 430.\nThe governing bodies of such cities shall have the power to acquire by purchase, gift, or eminent domain proceedings, lands and properties necessary for the establishment, location, relocation, construction, reconstruction, improvement, and maintenance of the municipal state-aid street system.\nThe governing body of any such city, subject to the concurrence of the commissioner, may establish and locate any municipal state-aid street on new locations where there is no existing street, or it may establish and locate such street upon and over any established street or specified portion of any street within its limits.\nAny municipal state-aid street may be abandoned, changed, or revoked as such by joint action of the commissioner and the governing body of the city within which the street is located.\nThe governing bodies of two or more of such cities, with the consent of the commissioner, may establish and locate a municipal state-aid street along or near the common boundary line of the cities. The governing bodies of the cities may enter into agreements providing for the division of costs and responsibilities to be borne by each for right-of-way, construction, improvement, and maintenance of such municipal state-aid streets.",
	"repealed": false
}