{
	"id": "268B.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.085",
	"title": "268B.085 NOTICE TO EMPLOYER; SCHEDULES.",
	"text": "(a) If the need for leave is foreseeable, an employee must provide the employer at least 30 days' advance notice before leave under this chapter is to begin. If 30 days' notice is not practicable because of a lack of knowledge of approximately when leave will be required to begin, a change in circumstances, or a medical emergency, notice must be given as soon as practicable. Whether leave is to be continuous or is to be taken intermittently, notice need only be given one time, but the employee must advise the employer as soon as practicable if dates of scheduled leave change or are extended, or were initially unknown. In those cases where the employee is required to provide at least 30 days' notice of foreseeable leave and does not do so, the employee must explain the reasons why notice was not practicable upon request from the employer.\n(b) \"As soon as practicable\" means as soon as both possible and practical, taking into account all of the facts and circumstances in the individual case. When an employee becomes aware of a need for leave under this chapter less than 30 days in advance, it should be practicable for the employee to provide notice of the need for leave either the same day or the next day, unless the need for leave is based on a medical emergency. In all cases, however, the determination of when an employee could practicably provide notice must take into account the individual facts and circumstances.\n(c) An employee shall provide at least oral, telephone, or text message notice sufficient to make the employer aware that the employee needs leave allowed under this chapter and the anticipated timing and duration of the leave.\n(d) In addition to any other prohibition imposed under this chapter, an employer must not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for providing this certification.\n(e) An employer may require an employee to comply with the employer's usual and customary notice and procedural requirements for requesting leave, including the employer's attendance or call-out policies and procedures, absent unusual circumstances or other circumstances caused by the reason for the employee's need for leave. An employee may be required by an employer's or covered business entity's policy to contact a specific individual or designated phone number to report this information. Leave under this chapter must not be delayed or denied where an employer's usual and customary notice or procedural requirements require notice to be given sooner than set forth in this subdivision.\n(f) An employer may require that an employee taking leave under this chapter provide a copy of the certification under section 268B.06, subdivision 3. Upon written request from the employer, the employee shall provide a copy of the certification as soon as practicable and possible given all of the facts and circumstances in the individual case. Providing certification at or around the time the employee provides a certification to the department shall be considered practicable.\n(g) If an employer has failed to provide notice to the employee as required under section 268B.26, paragraph (a), (b), or (e), the employee is not required to comply with the notice requirements of this subdivision.\n(h) An employer may not require, as a condition of an employee taking leave under this chapter, that the employee seek or find a replacement worker to cover the hours the employee uses under this chapter.\n[See Note.]\nBonding leave taken under this chapter begins at a time requested by the employee. Bonding leave must end within 12 months of the birth, adoption, or placement of a foster child, except that, in the case where the child must remain in the hospital longer than the mother, the leave must end within 12 months after the child leaves the hospital. Employees may also use bonding leave before the actual placement or adoption of a child in situations that include but are not limited to where the employee may be required to:\n(1) attend counseling sessions;\n(2) appear in court;\n(3) consult with the attorney or doctors representing the birth parent;\n(4) submit to a physical examination; or\n(5) travel to another country to complete an adoption.\n[See Note.]\n(a) Leave under this chapter, based on a serious health condition, may be taken intermittently if such leave is reasonable and appropriate to the needs of the individual with the serious health condition. For all other leaves under this chapter, leave may be taken intermittently. Intermittent leave is leave taken in separate blocks of time due to a single, seven-day qualifying event.\n(b) For an applicant who takes leave on an intermittent schedule, the weekly benefit amount shall be prorated.\n(c) An employee requesting leave taken intermittently shall provide the employer with a schedule of needed workdays off as soon as practicable and must make a reasonable effort to schedule the intermittent leave so as not to disrupt unduly the operations of the employer. If this cannot be done to the satisfaction of both employer and employee, the employer cannot require the employee to change their leave schedule in order to accommodate the employer.\n(d) Notwithstanding the allowance for intermittent leave under this subdivision, an employer shall not be required under this chapter to provide, but may elect to provide, more than 480 hours of intermittent leave in any 12-month period. If an employer limits hours of intermittent leave pursuant to this paragraph, an employee is entitled to take their remaining leave continuously, subject to the total amount of leave available under section 268B.04, subdivision 5. An employer may run intermittent leave available under the Family and Medical Leave Act, United States Code, title 29, sections 2601 to 2654, as amended, concurrent with an employee's entitlement to intermittent leave under this chapter.\n[See Note.]",
	"repealed": false
}