{
	"id": "14.388",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.388",
	"title": "14.388 GOOD CAUSE EXEMPTION.",
	"text": "If an agency for good cause finds that the rulemaking provisions of this chapter are unnecessary, impracticable, or contrary to the public interest when adopting, amending, or repealing a rule to:\n(1) address a serious and immediate threat to the public health, safety, or welfare;\n(2) comply with a court order or a requirement in federal law in a manner that does not allow for compliance with sections 14.14 to 14.28;\n(3) incorporate specific changes set forth in applicable statutes when no interpretation of law is required; or\n(4) make changes that do not alter the sense, meaning, or effect of a rule,\nthe agency may adopt, amend, or repeal the rule after satisfying the requirements of subdivision 2 and section 14.386, paragraph (a), clauses (1) to (4). The agency shall incorporate its findings and a brief statement of its supporting reasons in its order adopting, amending, or repealing the rule.\nAfter considering the agency's statement and any comments received, the Office of Administrative Hearings shall determine whether the agency has provided adequate justification for its use of this section.\nRules adopted, amended, or repealed under clauses (1) and (2) are effective for a period of two years from the date of publication of the rule in the State Register.\nRules adopted, amended, or repealed under clause (3) or (4) are effective upon publication in the State Register.\nAn agency proposing to adopt, amend, or repeal a rule under this section must give electronic notice of its intent in accordance with section 16E.07, subdivision 3, and notice by United States mail or electronic mail to persons who have registered their names with the agency under section 14.14, subdivision 1a. The notice must be given no later than the date the agency submits the proposed rule to the Office of Administrative Hearings for review of its legality and must include:\n(1) the proposed rule, amendment, or repeal;\n(2) an explanation of why the rule meets the requirements of the good cause exemption under subdivision 1; and\n(3) a statement that interested parties have five working days after the date of the notice to submit comments to the Office of Administrative Hearings.\nIf a rule has been disapproved by an administrative law judge, the agency may ask the chief administrative law judge to review the rule. The agency must give notice of its request for review in accordance with subdivision 2. The notice must be given no later than the date the agency requests review by the chief judge and must include a summary of any information or arguments the agency intends to submit to the chief judge that were not submitted to the judge who disapproved the rule.\nThe costs of any proceeding conducted by the Office of Administrative Hearings in accordance with this section must be paid by the agency seeking to adopt, amend, or repeal a rule under this section.",
	"repealed": false
}