{
	"id": "257.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.64",
	"title": "257.64 PRETRIAL ORDERS AND RECOMMENDATIONS.",
	"text": "On the basis of the information produced at the pretrial hearing, including information as to the financial status of the parties, the court may:\n(a) recommend that the alleged father voluntarily acknowledge his paternity of the child if the parties have agreed on a financial settlement; or\n(b) recommend that the matter be compromised by an agreement among the alleged father, the mother, and the child, in which the father and child relationship is not determined but in which a defined economic obligation is undertaken by the alleged father in favor of the child and, if appropriate, in favor of the mother, subject to approval by the court. In reviewing the obligation undertaken by the alleged father in a compromise agreement, the court shall consider the best interest of the child, in the light of the applicable factors enumerated in section 518.17, subdivision 3, discounted by the improbability, as it appears to the court, of establishing the alleged father's paternity or nonpaternity of the child in a trial of the action. In the best interest of the child, the court may order that the alleged father's identity be kept confidential. In that case, the court may designate a person or agency to receive from the alleged father and disburse on behalf of the child all amounts paid by the alleged father in fulfillment of obligations imposed on him. The child, on reaching 21 years of age or older, may petition the court to disclose the alleged father's identity. The court shall grant the petition if after considering the interests of all known persons involved, the court determines that disclosure of the information would be of greater benefit than nondisclosure.\nIf the parties accept a recommendation made in accordance with subdivision 1, judgment shall be entered accordingly. The court shall advise all parties that pretrial recommendations are not binding and will have no effect if the recommendation is disregarded and the matter is set for trial.\nIf a party refuses to accept a recommendation made under subdivision 1 and blood or genetic tests have not been taken, the court shall require the parties to submit to blood or genetic tests. If a party refuses to accept the final recommendation the action shall be set for trial.\nThe guardian ad litem may accept or refuse to accept a recommendation under this section.\nThe informal hearing may be terminated and the action set for trial if the court finds it unlikely that all parties would accept a recommendation made under subdivision 1 or 3.",
	"repealed": false
}