{
	"id": "181.9446",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.9446",
	"title": "181.9446 ACCRUAL OF EARNED SICK AND SAFE TIME.",
	"text": "(a) An employee accrues a minimum of one hour of earned sick and safe time for every 30 hours worked up to a maximum of 48 hours of earned sick and safe time in a year. Employees may not accrue more than 48 hours of earned sick and safe time in a year unless the employer agrees to a higher amount.\n(b)(1) Except as provided in clause (2), employers must permit an employee to carry over accrued but unused sick and safe time into the following year. The total amount of accrued but unused earned sick and safe time for an employee must not exceed 80 hours at any time, unless an employer agrees to a higher amount.\n(2) In lieu of permitting the carryover of accrued but unused sick and safe time into the following year as provided under clause (1), an employer may provide an employee with earned sick and safe time for the year that meets or exceeds the requirements of this section that is available for the employee's immediate use at the beginning of the subsequent year as follows: (i) 48 hours, if an employer pays an employee for accrued but unused sick and safe time at the end of a year at the same base rate as an employee earns from employment and in no case at a rate less than that provided under section 177.24 or an applicable local minimum wage; or (ii) 80 hours, if an employer does not pay an employee for accrued but unused sick and safe time at the end of a year.\n(c) Employees who are exempt from overtime requirements under United States Code, title 29, section 213(a)(1), as amended through January 1, 2024, are deemed to work 40 hours in each workweek for purposes of accruing earned sick and safe time, except that an employee whose normal workweek is less than 40 hours will accrue earned sick and safe time based on the normal workweek.\n(d) Earned sick and safe time under this section begins to accrue at the commencement of employment of the employee.\n(e) Employees may use earned sick and safe time as it is accrued.",
	"repealed": false
}