{
	"id": "268B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.06",
	"title": "268B.06 ELIGIBILITY REQUIREMENTS; PAYMENTS THAT AFFECT BENEFITS.",
	"text": "(a) An applicant may be eligible to receive family or medical leave benefits for any week if:\n(1) the week for which benefits are requested is in the applicant's benefit year;\n(2) the applicant was unable to perform regular work due to a serious health condition, a qualifying exigency, safety leave, family care, bonding, or medical care related to pregnancy. For bonding leave, eligibility ends 12 months after birth or placement;\n(3) the applicant has sufficient wage credits from an employer or employers as defined in section 268B.01, subdivision 45, to establish a benefit account under section 268B.04; and\n(4) an applicant requesting benefits under this chapter must fulfill certification requirements under subdivision 3.\n(b) A self-employed individual or independent contractor who has elected and been approved for coverage under section 268B.11 need not fulfill the requirement of paragraph (a), clause (3) or (4).\n(a) The period for which an applicant is seeking benefits must be or have been based on a single event of at least seven calendar days' duration related to medical care related to pregnancy, family care, a qualifying exigency, safety leave, or the applicant's serious health condition. The days must be consecutive, unless the leave is intermittent. The seven-day qualifying event under this paragraph is a retroactively payable period, not an unpaid waiting period.\n(b) Benefits related to bonding need not meet the seven-day qualifying event requirement.\n(c) The commissioner shall use the rulemaking authority under section 268B.02, subdivision 3, to adopt rules regarding what serious health conditions and other events are prospectively presumed to constitute seven-day qualifying events under this chapter.\n[See Note.]\n(a) Certification for an applicant taking leave related to the applicant's serious health condition shall be sufficient if the certification states the date on which the serious health condition began, the probable duration of the condition, and the appropriate medical facts within the knowledge of the health care provider as required by the commissioner. If the applicant requests intermittent leave, the certification must include the health care provider's reasonable estimate of the frequency and duration and estimated treatment schedule, if applicable.\n(b) Certification for an applicant taking leave to care for a family member with a serious health condition shall be sufficient if the certification states the date on which the serious health condition commenced, the probable duration of the condition, the appropriate medical facts within the knowledge of the health care provider as required by the commissioner, a statement that the family member requires care, and an estimate of the amount of time that the family member will require care.\n(c) Certification for an applicant taking leave due to medical care related to pregnancy shall be sufficient if the certification states the applicant is experiencing medical care related to pregnancy and recovery period based on appropriate medical facts within the knowledge of the health care provider.\n(d) Certification for an applicant taking bonding leave because of the birth of the applicant's child shall be sufficient if the certification includes either the child's birth certificate or a document issued by the health care provider of the child or the health care provider of the person who gave birth, stating the child's birth date or estimated due date.\n(e) Certification for an applicant taking bonding leave because of the placement of a child with the applicant for adoption or foster care shall be sufficient if the applicant provides a document issued by the health care provider of the child, an adoption or foster care agency involved in the placement, or by other individuals as determined by the commissioner that confirms the placement and the date of placement. To the extent that the status of an applicant as an adoptive or foster parent changes while an application for benefits is pending, or while the covered individual is receiving benefits, the applicant must notify the department of such change in status in writing.\n(f) Certification for an applicant taking leave because of a qualifying exigency shall be sufficient if the certification includes:\n(1) a copy of the family member's active-duty orders;\n(2) other documentation issued by the United States armed forces; or\n(3) other documentation permitted by the commissioner.\n(g) Certification for an applicant taking safety leave is sufficient if the certification includes a court record or documentation signed by a qualified person acting in the qualified person's professional capacity to declare a need for safety leave. The commissioner must not require disclosure of details relating to an applicant's or applicant's family member's domestic abuse, sexual assault, or stalking. The commissioner may adopt rules regarding safety leave.\n(h) Certifications under paragraphs (a) to (d) must be reviewed and signed by a health care provider with knowledge of the qualifying event associated with the leave.\n(i) For a leave taken on an intermittent basis, based on a serious health condition of an applicant or applicant's family member, the certification under this subdivision must include an explanation of how such leave would be medically beneficial to the individual with the serious health condition.\n[See Note.]\nAn applicant is ineligible for family or medical leave benefits for any portion of a typical workweek:\n(1) that occurs before the effective date of leave;\n(2) that the applicant fails or refuses to provide information on an issue of ineligibility required under section 268B.07, subdivision 2;\n(3) for which the applicant worked for pay;\n(4) for which the applicant is incarcerated; or\n(5) for which the applicant is receiving or has received unemployment insurance benefits.\n[See Note.]\n(a) An employee may use vacation pay, sick pay, or paid time off pay in lieu of family or medical leave program benefits under this chapter, provided the employee is concurrently eligible and subject to the total amount of leave available under section 268B.04, subdivision 5. Subject to the limitations of section 268B.09, subdivisions 6 and 7, an employee is entitled to the employment protections under section 268B.09 for those workdays during which this option is exercised. This subdivision applies to private plans under section 268B.10.\n(b) An employer may offer supplemental benefit payments, as defined in section 268B.01, subdivision 41, to an employee taking leave under this chapter. The choice to receive supplemental benefits lies with the employee. Nothing in this section shall be construed as requiring an employee to receive or an employer to provide supplemental benefits payments. The total amount of paid benefits under this chapter and the supplemental benefits paid must not exceed the employee's usual salary.\n(c) An employer may provide an employee with wage replacement during an absence. If the total amount of paid benefits under this chapter and the supplemental benefits paid exceed the employee's usual salary, the employee must refund the excess to either the employer or the paid leave division.\n(d) If an employer provides wage replacement to an employee for weeks that should be paid by the division, the department may reimburse the employer directly for those weeks.\n[See Note.]\n(a) An applicant is not eligible to receive benefits for any portion of a week in which the applicant is receiving or has received compensation for loss of wages equal to or in excess of the applicant's weekly family or medical leave benefit amount under:\n(1) the workers' compensation law of this state; or\n(2) the workers' compensation law of any other state or similar federal law.\n(b) This subdivision does not apply to an applicant who has a claim pending for loss of wages under paragraph (a). If the applicant later receives compensation as a result of the pending claim, the applicant is subject to paragraph (a) and the family or medical leave benefits paid are overpaid benefits under section 268B.185.\n(c) If the amount of compensation described under paragraph (a) for any week is less than the applicant's weekly family or medical leave benefit amount, benefits requested for that week are reduced by the amount of that compensation payment.\n[Never effective, 2024 c 127 art 73 s 51]\n[See Note.]\nAn employee may receive disability insurance payments in addition to family and medical leave benefits provided the employee is concurrently eligible for both benefits. Disability insurance benefits may be offset by family and medical leave benefits paid to the employee pursuant to the terms of a disability insurance policy.\n[See Note.]\n(a) An applicant who is receiving, has received, or has filed for primary Social Security disability benefits for any week is ineligible for benefits for that week, unless:\n(1) the Social Security Administration approved the collecting of primary Social Security disability benefits each month the applicant was employed during the base period; or\n(2) the applicant provides a statement from an appropriate health care professional who is aware of the applicant's Social Security disability claim and the basis for that claim, certifying that the applicant is able to perform the essential functions of their employment with or without a reasonable accommodation.\n(b) If an applicant meets the requirements of paragraph (a), clause (1) or (2), there is no deduction from the applicant's weekly benefit amount for any Social Security disability benefits.\n(c) Information from the Social Security Administration is conclusive, absent specific evidence showing that the information was erroneous.\n(a) An applicant is not eligible to receive benefits or take protected leave under the provisions of this chapter for any week the applicant is a seasonal employee as defined in section 268B.01, subdivision 35.\n(b) If benefits are denied to any applicant under paragraph (a) who remains employed more than 150 days, the applicant is only entitled to benefits beginning the Sunday following the completion of the 150-day period.",
	"repealed": false
}