{
	"id": "13.386",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.386",
	"title": "13.386 TREATMENT OF GENETIC INFORMATION HELD BY GOVERNMENT ENTITIES AND OTHER PERSONS.",
	"text": "(a) \"Genetic information\" means information about an identifiable individual derived from the presence, absence, alteration, or mutation of a gene, or the presence or absence of a specific DNA or RNA marker, which has been obtained from an analysis of:\n(1) the individual's biological information or specimen; or\n(2) the biological information or specimen of a person to whom the individual is related.\n(b) \"Genetic information\" also means medical or biological information collected from an individual about a particular genetic condition that is or might be used to provide medical care to that individual or the individual's family members.\nGenetic information held by a government entity is private data on individuals as defined by section 13.02, subdivision 12.\n(a) Unless otherwise expressly provided by law, genetic information about an individual:\n(1) may be collected by a government entity, as defined in section 13.02, subdivision 7a, or any other person only with the written informed consent of the individual;\n(2) may be used only for purposes to which the individual has given written informed consent;\n(3) may be stored only for a period of time to which the individual has given written informed consent; and\n(4) may be disseminated only:\n(i) with the individual's written informed consent; or\n(ii) if necessary in order to accomplish purposes described by clause (2). A consent to disseminate genetic information under item (i) must be signed and dated. Unless otherwise provided by law, such a consent is valid for one year or for a lesser period specified in the consent.\n(b) Newborn screening activities conducted under sections 144.125 to 144.128 are subject to paragraph (a). Other programs and activities governed under section 144.192 are not subject to paragraph (a).\nMS 2012 [Expired, 2012 c 292 art 4 s 1]",
	"repealed": false
}