{
	"id": "256B.076",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.076",
	"title": "256B.076 CASE MANAGEMENT SERVICES.",
	"text": "(a) It is the policy of this state to ensure that individuals on medical assistance receive cost-effective and coordinated care, including efforts to address the profound effects of housing instability, food insecurity, and other social determinants of health. Therefore, subject to federal approval, medical assistance covers targeted case management services as described in this section.\n(b) The commissioner, in collaboration with Tribes, counties, providers, and individuals served, must propose further modifications to targeted case management services to ensure a program that complies with all federal requirements, delivers services in a cost-effective and efficient manner, creates uniform expectations for targeted case management services, addresses health disparities, and promotes person- and family-centered services.\n(a) The commissioner must develop and implement a statewide rate methodology for any county that subcontracts targeted case management services to a vendor. The commissioner must publish the final draft of the proposed rate methodology at least 30 days prior to posting the state plan amendment for public comment and must take stakeholder feedback into consideration by providing an opportunity for the public to provide feedback on the proposed rate methodology. The commissioner must respond to comments received before the submission of the state plan amendment, explaining the commissioner's decisions regarding the responses and identifying any changes made in an effort to respond to public feedback. On January 1, 2022, or upon federal approval, whichever is later, a county must use this methodology for any targeted case management services paid by medical assistance and delivered through a subcontractor.\n(b) In setting this rate, the commissioner must include the following:\n(1) prevailing wages;\n(2) employee-related expense factor;\n(3) paid time off and training factors;\n(4) supervision and span of control;\n(5) distribution of time factor;\n(6) administrative factor;\n(7) absence factor;\n(8) program support factor;\n(9) caseload sizes as published by the commissioner; and\n(10) culturally specific program factor as described in subdivision 3.\n(c) A county may request that the commissioner authorize a rate based on a different caseload size when a subcontractor is assigned to serve individuals with needs, such as homelessness or specific linguistic or cultural needs, that significantly differ from other eligible populations. A county must include the following in the request:\n(1) the number of clients to be served by a full-time equivalent staffer;\n(2) the specific factors that require a case manager to provide a significantly different number of hours of reimbursable services to a client; and\n(3) how the county intends to monitor caseload size and outcomes.\n(d) The commissioner must adjust only the factor for caseload size in paragraph (b), clause (9), in response to a request under paragraph (c). The commissioner must not duplicate costs assumed by the culturally specific program factor in paragraph (b), clause (10), in response to a request under paragraph (c). With agreement of counties and in consultation with other stakeholders, the commissioner may introduce factors and adjustments other than those listed in paragraphs (b) and (c), subject to federal approval.\n(a) \"Culturally specific program\" means a targeted case management program that:\n(1) ensures effective, equitable, comprehensive, and respectful quality care services that are responsive to individuals within a specific population's values, beliefs, practices, health literacy, preferred language, and other communication needs;\n(2) is designed to address the unique needs of individuals who share a common language or racial, ethnic, or social background;\n(3) is governed with significant input from individuals of the specific background that the program is designed to serve; and\n(4) employs individuals to provide targeted case management, at least 50 percent of whom are of the specific background that the program is designed to serve.\n(b) The culturally specific program factor in subdivision 2, paragraph (b), clause (10), adjusts the targeted case management rate for culturally specific programs to reflect the staffing and programmatic costs necessary to provide culturally specific targeted case management.\nIf a county agency provides case management under contracts with other individuals or agencies and the county agency utilizes a competitive proposal process for the procurement of contracted case management services, the competitive proposal process must include evaluation criteria to ensure that the county maintains a culturally responsive program for case management services adequate to meet the needs of the population of the county. For the purposes of this section, \"culturally responsive program\" means a case management services program that:\n(1) ensures effective, equitable, comprehensive, and respectful quality care services that are responsive to individuals within a specific population's values, beliefs, practices, health literacy, preferred language, and other communication needs; and\n(2) is designed to address the unique needs of individuals who share a common language or racial, ethnic, or social background.",
	"repealed": false
}