{
	"id": "246.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.13",
	"title": "246.13 RECORDS OF PERSONS RECEIVING STATE-OPERATED SERVICES.",
	"text": "(a) The chief executive officer or a designee shall have, accessible only by consent of the executive board or on the order of a judge or court of record, a record showing:\n(1) the residence, sex, age, nativity, occupation, civil condition, and date of entrance or commitment of every person, in the state-operated services facilities as defined under section 246C.02 under exclusive control of the executive board;\n(2) the date of discharge of any such person and whether such discharge was final;\n(3) the condition of the person when the person left the state-operated services facility;\n(4) the vulnerable adult abuse prevention associated with the person; and\n(5) the date and cause of any death of such person.\n(b) The record in paragraph (a) must state every transfer of a person from one state-operated services facility to another, naming each state-operated services facility. The head of each facility or a designee must provide this transfer information to the executive board, along with other obtainable facts as the executive board requests.\n(c) The head of the state-operated services facility or designee shall inform the executive board of any discharge, transfer, or death of a person in that facility within ten days of the date of discharge, transfer, or death in a manner determined by the executive board.\n(d) The executive board shall maintain an adequate system of records and statistics for all basic record forms, including patient personal records and medical record forms. The use and maintenance of such records must be consistent throughout all state-operated services facilities.\n(a) As used in this section:\n(1) \"appropriate and necessary medical and other records\" includes patient medical records and other protected health information as defined by Code of Federal Regulations, title 45, section 164.501, relating to a patient in a state-operated services facility including but not limited to the patient's treatment plan and abuse prevention plan pertinent to the patient's ongoing care, treatment, or placement in a community-based treatment facility or a health care facility that is not operated by state-operated services, including information describing the level of risk posed by a patient when the patient enters the facility;\n(2) \"community-based treatment\" means the community support services listed in section 253B.02, subdivision 4b;\n(3) \"criminal history data\" means data maintained or used by the Departments of Corrections and Public Safety and by the supervisory authorities listed in section 13.84, subdivision 1, that relate to an individual's criminal history or propensity for violence, including data in the:\n(i) Corrections Offender Management System (COMS);\n(ii) Statewide Supervision System (S3);\n(iii) Bureau of Criminal Apprehension criminal history data as defined in section 13.87;\n(iv) Integrated Search Service as defined in section 13.873; and\n(v) Predatory Offender Registration (POR) system;\n(4) \"designated agency\" means the agency defined in section 253B.02, subdivision 5;\n(5) \"law enforcement agency\" means the law enforcement agency having primary jurisdiction over the location where the offender expects to reside upon release;\n(6) \"predatory offender\" and \"offender\" mean a person who is required to register as a predatory offender under section 243.166; and\n(7) \"treatment facility\" means a facility as defined in section 253B.02, subdivision 19.\n(b) To promote public safety and for the purposes and subject to the requirements of this paragraph, the executive board or the executive board's designee shall have access to, and may review and disclose, medical and criminal history data as provided by this section, as necessary to comply with Minnesota Rules, part 1205.0400, to:\n(1) determine whether a patient is required under state law to register as a predatory offender according to section 243.166;\n(2) facilitate and expedite the responsibilities of the special review board and end-of-confinement review committees by corrections institutions and state treatment facilities;\n(3) prepare, amend, or revise the abuse prevention plans required under section 626.557, subdivision 14, and individual patient treatment plans required under section 253B.03, subdivision 7;\n(4) facilitate the custody, supervision, and transport of individuals transferred between the Department of Corrections and Direct Care and Treatment; and\n(5) effectively monitor and supervise individuals who are under the authority of the Department of Corrections, Direct Care and Treatment, and the supervisory authorities listed in section 13.84, subdivision 1.\n(c) The state-operated services treatment facility or a designee must make a good faith effort to obtain written authorization from the patient before releasing information from the patient's medical record.\n(d) If the patient refuses or is unable to give informed consent to authorize the release of information required under this subdivision, the chief executive officer or a designee shall provide the appropriate and necessary medical and other records. The chief executive officer or a designee shall comply with the minimum necessary privacy requirements.\n(e) The executive board may have access to the National Crime Information Center (NCIC) database through the Department of Public Safety in support of the public safety functions described in paragraph (b).\n(a) When a patient under the care and supervision of state-operated services is released to a community-based treatment facility or health care facility, state-operated services may disclose all appropriate and necessary health and other information relating to the patient.\n(b) The information that must be provided under paragraph (a) to the designated agency, community-based treatment facility, or health care facility includes but is not limited to the patient's abuse prevention plan required under section 626.557, subdivision 14, paragraph (b).\n(a) When the head of a state-operated facility or a designee determines that a patient is required to register as a predatory offender under section 243.166 or to provide notice of a change in status under section 243.166, subdivision 4a, the head of the facility or a designee shall provide written notice to the patient of the requirement.\n(b) If the patient refuses, is unable, or lacks capacity to comply with the requirements described in paragraph (a) within five days after receiving the notification of the duty to comply, state-operated services staff shall obtain and disclose the necessary data to complete the registration form or change of status notification for the patient. The head of the treatment facility or a designee shall also forward the completed registration or change of status data to the Bureau of Criminal Apprehension and, as applicable, the patient's corrections agent and the law enforcement agency in the community in which the patient currently resides. If, after providing notification, the patient refuses to comply with the requirements described in paragraph (a), the head of the treatment facility or a designee shall also notify the county attorney in the county in which the patient is currently residing of the refusal.\n(c) The duties of state-operated services described in this subdivision do not relieve the patient of the ongoing individual duty to comply with the requirements of section 243.166.\nSections 246.71 to 246.722 apply to state-operated services facilities.",
	"repealed": false
}