{
	"id": "290.0132",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0132",
	"title": "290.0132 INDIVIDUALS, ESTATES, AND TRUSTS; SUBTRACTIONS FROM FEDERAL TAXABLE INCOME OR FEDERAL ADJUSTED GROSS INCOME.",
	"text": "(a) For the purposes of this section, \"subtraction\" means an amount that shall be subtracted from federal taxable income for a trust or an estate or federal adjusted gross income for an individual in computing net income for the taxable year to which the amounts relate.\n(b) The subtractions in this section apply to individuals, estates, and trusts.\n(c) Unless specifically indicated or unless the context clearly indicates otherwise, no amount deducted, subtracted, or otherwise excluded in computing federal taxable income for a trust or an estate or federal adjusted gross income for an individual is a subtraction under this section.\nNet interest income on obligations of any authority, commission, or instrumentality of the United States to the extent includable in taxable income for federal income tax purposes, but exempt from state income tax under the laws of the United States, is a subtraction.\nThe amount of any overpayment of income tax to Minnesota or to any other state, for any previous taxable year, is a subtraction, whether the amount is received as a refund or as a credit to another taxable year's income tax liability.\n(a) Subject to the limits in paragraph (b), the following amounts paid to others for each qualifying child are a subtraction:\n(1) education-related expenses; plus\n(2) tuition and fees paid to attend a school described in section 290.0674, subdivision 1a, paragraph (b), clause (4), that are not included in education-related expenses; less\n(3) any amount used to claim the credit under section 290.0674.\n(b) The maximum subtraction allowed under this subdivision is:\n(1) $1,625 for each qualifying child in kindergarten through grade 6; and\n(2) $2,500 for each qualifying child in grades 7 through 12.\n(c) The definitions in section 290.0674, subdivision 1a, apply to this subdivision.\nThe subtraction base amount allowed under section 290.0802 is a subtraction.\nIncome realized on disposition of property exempt from tax under section 290.491 is a subtraction.\nFor an individual who does not itemize deductions under section 290.0132, subdivision 19, for the taxable year, an amount equal to 50 percent of the excess of charitable contributions over $500 allowable as a deduction for the taxable year under section 290.0122, subdivision 4, is a subtraction. The subtraction under this subdivision must not include a distribution that is excluded from federal adjusted gross income and that is not deductible under section 408(d)(8)(E) of the Internal Revenue Code.\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\n(a) In each of the five taxable years immediately following the taxable year in which an addition is required under section 290.0131, subdivision 9, or 290.0133, subdivision 11, for a shareholder of a corporation that is an S corporation, an amount equal to one-fifth of the delayed depreciation is a subtraction.\n(b) For purposes of this subdivision, \"delayed depreciation\" means the amount of the addition made by the taxpayer under section 290.0131, subdivision 9, or 290.0133, subdivision 11, for a shareholder of an S corporation, minus the positive value of any net operating loss under section 172 of the Internal Revenue Code generated for the taxable year of the addition. The resulting delayed depreciation cannot be less than zero.\nMS 2020 [Expired, 2016 c 158 art 3 s 9]\n(a) Compensation paid to members of the Minnesota National Guard or other reserve components of the United States military for active service, including compensation for services performed under the Active Guard Reserve (AGR) program, is a subtraction.\n(b) For purposes of this subdivision, \"active service\" means:\n(1) state active service as defined in section 190.05, subdivision 5a, clause (1); or\n(2) federally funded state active service as defined in section 190.05, subdivision 5b, and includes service performed under section 190.08, subdivision 3.\nCompensation paid to Minnesota residents who are members of the armed forces of the United States or United Nations for active duty performed under United States Code, title 10, or the authority of the United Nations, is a subtraction.\n(a) An amount, not to exceed $10,000, equal to qualified expenses related to a qualified donor's donation, while living, of one or more of the qualified donor's organs to another person for human organ transplantation, is a subtraction.\n(b) For purposes of this subdivision:\n(1) \"organ\" means all or part of an individual's liver, pancreas, kidney, intestine, lung, or bone marrow;\n(2) \"human organ transplantation\" means the medical procedure by which transfer of a human organ is made from the body of one person to the body of another person;\n(3) \"qualified expenses\" means unreimbursed expenses for both the individual and the qualified donor for (i) travel, (ii) lodging, and (iii) lost wages net of sick pay, except that the expenses may be subtracted under this subdivision only once; and\n(4) \"qualified donor\" means the individual or the individual's dependent, as defined in section 152 of the Internal Revenue Code.\n(c) An individual may claim the subtraction in this subdivision for each instance of organ donation for transplantation during the taxable year in which the qualified expenses occur.\nIn each of the five taxable years immediately following the taxable year in which an addition is required under section 290.0131, subdivision 10, or 290.0133, subdivision 12, for a shareholder of a corporation that is an S corporation, an amount equal to one-fifth of the addition made by the taxpayer under section 290.0131, subdivision 10, or 290.0133, subdivision 12, for a shareholder of a corporation that is an S corporation, minus the positive value of any net operating loss under section 172 of the Internal Revenue Code generated for the taxable year of the addition, is a subtraction. If the net operating loss exceeds the addition for the taxable year, a subtraction is not allowed under this subdivision.\nFor nonresidents of Minnesota, compensation paid to a service member as defined in United States Code, title 10, section 101(a)(5), for military service as defined in United States Code, title 50, section 3911(2), is a subtraction.\nNational service educational awards received from the National Service Trust under United States Code, title 42, sections 12601 to 12604, for service in an approved Americorps National Service program are a subtraction.\nMS 2018 [Expired]\nThe amount of the net operating loss allowed under section 290.095, subdivision 11, paragraph (c), is a subtraction.\n(a) The standard deduction amount allowed under section 290.0123, subdivision 1, is a subtraction.\n(b) A taxpayer may elect to claim a subtraction equal to the amount of itemized deductions calculated under section 290.0122, subdivision 1, in lieu of the subtraction for the standard deduction in paragraph (a).\nThe dependent exemption under section 290.0121, subdivision 1, paragraph (a), is a subtraction.\nTo the extent included in federal adjusted gross income, compensation received from a pension or other retirement pay from the federal government for service in the military, as computed under United States Code, title 10, sections 1401 to 1414, 1447 to 1455, and 12733, is a subtraction. The subtraction is limited to individuals who do not claim the credit under section 290.0677.\nThe amount of expenses not allowed for federal income tax purposes due to claiming the railroad track maintenance credit under section 45G(a) of the Internal Revenue Code is a subtraction.\n(a) The amount equal to the contributions made during the taxable year to a qualified account is a subtraction.\n(b) The definitions under section 290.0684 apply for the purposes of this subdivision.\n(c) The subtraction under this subdivision must not exceed $3,000 for married couples filing joint returns and $1,500 for all other filers, and is limited to individuals who do not claim the credit under section 290.0684.\n(a) The qualified student loan discharge of a taxpayer is a subtraction.\n(b) For the purposes of this subdivision, \"qualified student loan discharge\" means a discharge of indebtedness eligible for the exclusion from gross income under section 9675 of Public Law 117-2. A discharge of indebtedness that occurred after December 31, 2025, but otherwise qualifies for the exclusion under that section is a qualified student loan discharge.\n(c) \"Qualified student loan discharge\" includes but is not limited to a discharge of indebtedness under:\n(1) the income-based repayment plan under United States Code, title 20, section 1098e;\n(2) the income contingent repayment plan established under United States Code, title 20, section 1087e, subsection (e);\n(3) the PAYE program or REPAYE program established by the Department of Education under administrative regulations; and\n(4) section 136A.1791.\n(a) For purposes of this subdivision, the terms defined in section 462D.02 have the meanings given in that section.\n(b) The earnings on a first-time home buyer savings account allowed by section 462D.06, subdivision 1, is a subtraction.\n(a) A taxpayer is allowed a subtraction equal to the greater of the simplified subtraction allowed under paragraph (b) or the alternate subtraction determined under paragraph (e).\n(b) A taxpayer's simplified subtraction equals the amount of taxable social security benefits, as reduced under paragraphs (c) and (d).\n(c) For a taxpayer other than a married taxpayer filing a separate return with adjusted gross income above the phaseout threshold, the simplified subtraction is reduced by ten percent for each $4,000 of adjusted gross income, or fraction thereof, in excess of the phaseout threshold. The phaseout threshold equals:\n(1) $100,000 for a married taxpayer filing a joint return or surviving spouse;\n(2) $78,000 for a single or head of household taxpayer; and\n(3) for a married taxpayer filing a separate return, half the amount for a married taxpayer filing a joint return.\n(d) For a married taxpayer filing a separate return, the simplified subtraction is reduced by ten percent for each $2,000 of adjusted gross income, or fraction thereof, in excess of the phaseout threshold.\n(e) A taxpayer's alternate subtraction equals the lesser of taxable Social Security benefits or a maximum subtraction subject to the limits under paragraphs (f), (g), and (h).\n(f) For married taxpayers filing a joint return and surviving spouses, the maximum subtraction under paragraph (c) equals $5,840. The maximum subtraction is reduced by 20 percent of provisional income over $88,630. In no case is the subtraction less than zero.\n(g) For single or head-of-household taxpayers, the maximum subtraction under paragraph (c) equals $4,560. The maximum subtraction is reduced by 20 percent of provisional income over $69,250. In no case is the subtraction less than zero.\n(h) For married taxpayers filing separate returns, the maximum subtraction under paragraph (c) equals one-half the maximum subtraction for joint returns under paragraph (f). The maximum subtraction is reduced by 20 percent of provisional income over one-half the threshold amount specified in paragraph (d). In no case is the subtraction less than zero.\n(i) For purposes of this subdivision, \"provisional income\" means modified adjusted gross income as defined in section 86(b)(2) of the Internal Revenue Code, plus one-half of the taxable Social Security benefits received during the taxable year, and \"Social Security benefits\" has the meaning given in section 86(d)(1) of the Internal Revenue Code.\n(j) The commissioner shall adjust the phaseout threshold amounts in paragraphs (c) and (d) as provided in section 270C.22. The statutory year is taxable year 2023. The maximum subtraction and threshold amounts as adjusted must be rounded to the nearest $10 amount. If the amount ends in $5, the amount is rounded up to the nearest $10 amount.\nThe amount of deferred foreign income under section 965 of the Internal Revenue Code included in federal adjusted gross income or federal taxable income, is a subtraction.\nMS 2022 [Repealed, 2023 c 64 art 1 s 53]\nThe amount of expenses of a license holder, as defined under section 342.01, subdivision 48, related to the business of cannabis or hemp and not allowed for federal income tax purposes under section 280E of the Internal Revenue Code is a subtraction.\n(a) A taxpayer is allowed a subtraction equal to the amount of mileage reimbursement paid by a charitable organization to the taxpayer for work as a volunteer driver. The subtraction is limited to amounts paid by the organization that:\n(1) are in excess of the mileage rate for use of an automobile in rendering gratuitous services to a charitable organization under section 170(i) of the Internal Revenue Code; and\n(2) do not exceed the standard mileage rate for businesses established under Code of Federal Regulations, title 26, section 1.274-5(j)(2).\n(b) For the purposes of this section, \"charitable organization\" means an organization eligible for a charitable contribution under section 170(c) of the Internal Revenue Code.\n(a) For each taxable year an addition is required under section 290.0131, subdivision 19, the amount of the addition, less the sum of all amounts subtracted under this paragraph in all prior taxable years, that does not exceed the limitation on business interest in section 163(j) of the Internal Revenue Code of 1986, as amended through December 15, 2022, notwithstanding the special rule in section 163(j)(10) of the Internal Revenue Code, is a subtraction. Any excess is a delayed business interest carryforward, the entire amount of which must be carried to the earliest taxable year. No subtraction is allowed under this paragraph for taxable years beginning after December 31, 2022.\n(b) For each of the five taxable years beginning after December 31, 2022, there is allowed a subtraction equal to one-fifth of the sum of all carryforward amounts that remain after the expiration of paragraph (a).\n(c) Entities that are part of a combined reporting group under the unitary rules of section 290.17, subdivision 4, must compute deductions and additions as required under section 290.34, subdivision 5.\nThe amount of the sum of each addition required in section 290.0131, subdivision 20, for each taxable year, except as otherwise provided, less the sum of all amounts subtracted under this subdivision in all prior taxable years, that does not exceed 80 percent of federal taxable income as defined in section 290.01, subdivision 19, paragraph (b), determined without regard to this subdivision, is a subtraction. Any excess is a delayed net operating loss deduction carryforward, the entire amount of which must be carried to the earliest taxable year. No subtraction under this subdivision is allowed after 20 taxable years from the taxable year in which an operating loss arises. The sum of the additions required under section 290.0131, subdivision 20, paragraph (a), are aggregated and assigned to the taxable year immediately succeeding the taxable year in which the operating loss arises, for purposes of determining the subtraction allowed under this subdivision in that succeeding taxable year and the amount carried forward.\n[Never effective, 2023 c 64 art 2 s 8]\n(a) The amount of qualified public pension income is a subtraction. The subtraction in this section is limited to:\n(1) $25,000 for a married taxpayer filing a joint return or surviving spouse; or\n(2) $12,500 for all other filers.\n(b) For a taxpayer with adjusted gross income above the phaseout threshold, the subtraction is reduced by ten percent for each $2,000 of adjusted gross income, or fraction thereof, in excess of the threshold. The phaseout threshold equals:\n(1) $100,000 for a married taxpayer filing a joint return or surviving spouse;\n(2) $78,000 for a single or head of household taxpayer; or\n(3) for a married taxpayer filing a separate return, half the amount for a married taxpayer filing a joint return.\n(c) For the purposes of this section, \"qualified public pension income\" means any amount received:\n(1) by a former basic member or the survivor of a former basic member, as an annuity or survivor benefit, from a pension plan governed by chapter 353, 353E, 354, or 354A, provided that the annuity or benefit is based on service for which the member or survivor is not also receiving Social Security benefits;\n(2) as an annuity or survivor benefit from the legislators plan under chapter 3A, the State Patrol retirement plan under chapter 352B, or the public employees police and fire plan under sections 353.63 to 353.666, provided that the annuity or benefit is based on service for which the member or survivor is not also receiving Social Security benefits;\n(3) from any retirement system administered by the federal government that is based on service for which the recipient or the recipient's survivor is not also receiving Social Security benefits; or\n(4) from a public retirement system of or created by another state or any of its political subdivisions, or the District of Columbia, if the income tax laws of the other state or district permit a similar deduction or exemption or a reciprocal deduction or exemption of a retirement or pension benefit received from a public retirement system of or created by this state or any political subdivision of this state.\n(d) The commissioner must annually adjust the subtraction limits in paragraph (a) and the phaseout thresholds in paragraph (b), as provided in section 270C.22. The statutory year is taxable year 2023.\nThe amount of damages received under a sexual harassment or abuse claim that is not excluded from gross income under section 104(a)(2) of the Internal Revenue Code because the damages are not received on account of personal physical injuries or physical sickness is a subtraction.",
	"repealed": false
}