{
	"id": "260C.203",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.203",
	"title": "260C.203 ADMINISTRATIVE OR COURT REVIEW OF PLACEMENTS.",
	"text": "(a) Unless the court is conducting the reviews required under section 260C.202, there shall be an administrative review of the out-of-home placement plan of each child placed in foster care no later than 180 days after the initial placement of the child in foster care and at least every six months thereafter if the child is not returned to the home of the parent or parents within that time. The out-of-home placement plan must be monitored and updated by the responsible social services agency at each administrative review. The administrative review shall be conducted by the responsible social services agency using a panel of appropriate persons at least one of whom is not responsible for the case management of, or the delivery of services to, either the child or the parents who are the subject of the review. The administrative review shall be open to participation by the parent or guardian of the child and the child, as appropriate.\n(b) As an alternative to the administrative review required in paragraph (a), the court may, as part of any hearing required under the Minnesota Rules of Juvenile Protection Procedure, conduct a hearing to monitor and update the out-of-home placement plan pursuant to the procedure and standard in section 260C.201, subdivision 6, paragraph (d). The party requesting review of the out-of-home placement plan shall give parties to the proceeding notice of the request to review and update the out-of-home placement plan. A court review conducted pursuant to section 260C.141, subdivision 2; 260C.193; 260C.201, subdivision 1; 260C.202; 260C.204; 260C.317; or 260D.06 shall satisfy the requirement for the review so long as the other requirements of this section are met.\n(c) As appropriate to the stage of the proceedings and relevant court orders, the responsible social services agency or the court shall review:\n(1) the safety, permanency needs, and well-being of the child;\n(2) the continuing necessity for and appropriateness of the placement, including whether the placement is consistent with the child's best interests and other placement considerations, including relative and sibling placement considerations under section 260C.212, subdivision 2;\n(3) the extent of compliance with the out-of-home placement plan required under section 260C.212, subdivisions 1 and 1a, including services and resources that the agency has provided to the child and child's parents, services and resources that other agencies and individuals have provided to the child and child's parents, and whether the out-of-home placement plan is individualized to the needs of the child and child's parents;\n(4) the extent of progress that has been made toward alleviating or mitigating the causes necessitating placement in foster care;\n(5) the projected date by which the child may be returned to and safely maintained in the home or placed permanently away from the care of the parent or parents or guardian; and\n(6) the appropriateness of the services provided to the child.\n(d) When a child is age 14 or older:\n(1) in addition to any administrative review conducted by the responsible social services agency, at the in-court review required under section 260C.317, subdivision 3, clause (3), or 260C.515, subdivision 5 or 6, the court shall review the independent living plan required under section 260C.212, subdivision 1, paragraph (c), clause (12), and the provision of services to the child related to the well-being of the child as the child prepares to leave foster care. The review shall include the actual plans related to each item in the plan necessary to the child's future safety and well-being when the child is no longer in foster care; and\n(2) consistent with the requirements of the independent living plan, the court shall review progress toward or accomplishment of the following goals:\n(i) the child has obtained a high school diploma or its equivalent;\n(ii) the child has completed a driver's education course or has demonstrated the ability to use public transportation in the child's community;\n(iii) the child is employed or enrolled in postsecondary education;\n(iv) the child has applied for and obtained postsecondary education financial aid for which the child is eligible;\n(v) the child has health care coverage and health care providers to meet the child's physical and mental health needs;\n(vi) the child has applied for and obtained disability income assistance for which the child is eligible;\n(vii) the child has obtained affordable housing with necessary supports, which does not include a homeless shelter;\n(viii) the child has saved sufficient funds to pay for the first month's rent and a damage deposit;\n(ix) the child has an alternative affordable housing plan, which does not include a homeless shelter, if the original housing plan is unworkable;\n(x) the child, if male, has registered for the Selective Service; and\n(xi) the child has a permanent connection to a caring adult.",
	"repealed": false
}