{
	"id": "116.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.80",
	"title": "116.80 TRANSPORTING INFECTIOUS WASTE.",
	"text": "(a) A generator may not transfer infectious waste to a commercial transporter unless the transporter is registered with the commissioner.\n(b) A transporter may not deliver infectious waste to a facility prohibited to accept the waste.\n(c) A person who is registered to transport infectious waste may not refuse waste generated from a facility that is properly packaged and labeled.\n(a) A commercial transporter in charge of a business that transports infectious waste must prepare a management plan for the infectious waste handled by the commercial transporter.\n(b) The management plan must describe, to the extent the information is applicable to the commercial transporter:\n(1) the type of infectious waste that the commercial transporter handles;\n(2) the transportation procedures for the infectious waste that will be followed;\n(3) the disposal facilities that will be used for the infectious waste;\n(4) the steps that will be taken to minimize the exposure of employees to infectious agents throughout the process of transporting and disposing of infectious waste; and\n(5) the name of the individual responsible for the transportation and management of the infectious waste.\n(c) The management plan must be kept at the commercial transporter's principal place of business.\n(d) Management plans must be accompanied by a statement of the quantity of infectious waste transported during the previous two-year period. Quantities shall be reported in pounds.\n(e) A management plan must be updated and resubmitted at least once every two years.\n(f) The commissioner shall review the plans and may require a plan to be modified within 180 days after the plan is submitted if the commissioner determines that the plan is not consistent with state or federal law or that the plan is not adequate to minimize exposure of persons to the waste.\n(a) A commercial transporter must register with the commissioner.\n(b) To register, a commercial transporter must submit a copy of the management plan to the commissioner of the Pollution Control Agency with a fee of $225. The fee must be deposited in the state treasury and credited to the general fund.\n(c) The registration is valid for two years.\n(d) The commissioner shall issue a registration card with a unique registration number to a person who has submitted a transporter's management plan unless the commissioner finds that registrant has outstanding unresolved violations of this section or a history of serious violations of chapter 115, 115A, 115B, or 116. The registration card must include the date the card expires.\nA person may not transport infectious waste into the state for decontamination, storage, incineration, or disposal without complying with sections 116.76 to 116.82.",
	"repealed": false
}