{
	"id": "515B.2-113",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-113",
	"title": "515B.2-113 ALTERATION OF UNITS.",
	"text": "(a) Subject to the provisions of the declaration and applicable law, a unit owner may, at the unit owner's expense, make any improvements or alterations to the unit, provided: (i) that they do not impair the structural integrity or mechanical systems, affect the common elements, or impair the support of any portion of the common interest community; (ii) that prior arrangements are made with the association to ensure that other unit owners are not disturbed; (iii) that the common elements are not damaged; and (iv) that the common elements and other units are protected against mechanics' liens.\n(b) Subject to the provisions of applicable law, a unit owner of a unit that is used as a dwelling, whether primary, secondary, or seasonal, may, at the unit owner's expense, make improvements or alterations to the unit as necessary for the full enjoyment of the unit by any person residing in the unit who has a disability, as provided in the Fair Housing Amendments Act, United States Code, title 42, section 3601, et seq., and the Minnesota Human Rights Act, chapter 363A, and any amendments to those acts. This subsection applies to all common interest communities subject to this chapter, chapter 515, or 515A, notwithstanding any contrary provision of section 515B.1-102.\n(c) The declaration, bylaws, rules, and regulations, or agreements with the association may not prohibit the improvements or alterations referred to in subsection (b), but may reasonably regulate the type, style, and quality of the improvements or alterations, as they relate to health, safety, and architectural standards. In addition, improvements or alterations made pursuant to subsection (b) must comply with subsection (a)(i), (ii), (iii), and (iv).\n(d) The unit owner's rights under this section may not be waived.\n(e) Subsection (b) does not apply to restrictions on improvements or alterations imposed by statute, rule, or ordinance.\n(f) Subject to the provisions of the declaration and applicable law, a unit owner may, at the unit owner's expense, after acquiring title to an adjoining unit or an adjoining part of an adjoining unit, with the prior written approval of the association and first mortgagees of the affected units, remove or alter any intervening partition or create apertures therein, even if the partition is part of the common elements, if those acts do not impair the structural integrity or mechanical systems or lessen the support of any portion of the common interest community. The adjoining unit owners shall have the exclusive license to use the space occupied by the removed partition, but the use shall not create an easement or vested right. Removal of partitions or creation of apertures under this subsection is not an alteration of boundaries. The association may require that the owner or owners of units affected replace or restore any removed partition, that the unit owner comply with subsection (a)(i), (ii) and (iii), and that the unit owner pay all fees and costs incurred by the association in connection with the alteration.",
	"repealed": false
}