{
	"id": "256D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.07",
	"title": "256D.07 TIME OF PAYMENT OF ASSISTANCE.",
	"text": "An applicant for general assistance shall be deemed eligible if the application and the verification of the statement on that application demonstrate that the applicant is within the eligibility criteria established by sections 256D.01 to 256D.21 and any applicable rules of the commissioner. Any person requesting general assistance shall be permitted by the county agency to make an application for assistance as soon as administratively possible and in no event later than the fourth day following the date on which assistance is first requested, and no county agency shall require that a person requesting assistance appear at the offices of the county agency more than once prior to the date on which the person is permitted to make the application. Applications must be submitted according to section 256P.04, subdivision 1a. On the date that general assistance is first requested, the county agency shall inquire and determine whether the person requesting assistance is in immediate need of food, shelter, clothing, assistance for necessary transportation, or other emergency assistance pursuant to section 256D.06, subdivision 2. A person in need of emergency assistance shall be granted emergency assistance immediately, and necessary emergency assistance shall continue for up to 30 days following the date of application. A determination of an applicant's eligibility for general assistance shall be made by the county agency as soon as the required verifications are received by the county agency and in no event later than 30 days following the date that the application is made. Any verifications required of the applicant shall be reasonable, and the commissioner shall by rule establish reasonable verifications. General assistance shall be granted to an eligible applicant without the necessity of first securing action by the board of the county agency. The first month's grant must be computed to cover the time period starting with the date of application or from the date that the applicant meets all eligibility factors, whichever occurs later.\nIf upon verification and due investigation it appears that the applicant provided false information and the false information materially affected the applicant's eligibility for general assistance or the amount of the applicant's general assistance grant, the county agency may refer the matter to the county attorney. The county attorney may commence a criminal prosecution or a civil action for the recovery of any general assistance wrongfully received, or both.",
	"repealed": false
}