{
	"id": "116J.8748",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8748",
	"title": "116J.8748 MINNESOTA JOB CREATION FUND.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Agreement\" or \"business subsidy agreement\" means a business subsidy agreement under section 116J.994 that must include, but is not limited to: specification of the duration of the agreement, job goals and a timeline for achieving those goals over the duration of the agreement, construction and other investment goals and a timeline for achieving those goals over the duration of the agreement, and the value of benefits the firm may receive following achievement of capital investment and employment goals. The local government and business must report to the commissioner on the business performance using the forms developed by the commissioner.\n(c) \"Business\" means an individual, corporation, partnership, limited liability company, association, or other entity.\n(d) \"Capital investment\" means money that is expended for the purpose of building or improving real fixed property where employees under paragraphs (g) and (h) are or will be employed and also includes construction materials, services, and supplies, and the purchase and installation of equipment and machinery as provided under subdivision 4, paragraph (b), clause (5).\n(e) \"Commissioner\" means the commissioner of employment and economic development.\n(f) \"Minnesota job creation fund business\" means a business that is designated by the commissioner under subdivision 3.\n(g) \"Minority person\" means a person belonging to a racial or ethnic minority as defined in Code of Federal Regulations, title 49, section 23.5.\n(h) \"New full-time equivalent employee\" means an employee who:\n(1) begins work at a Minnesota job creation fund business facility noted in a business subsidy agreement and following the designation as a job creation fund business; and\n(2) has expected work hours of at least 2,080 hours annually or the equivalent of annualized expected hours of work equal to 2,080 hours of one or more employees.\n(i) \"Persons with disabilities\" means an individual with a disability, as defined under the Americans with Disabilities Act, United States Code, title 42, section 12102.\n(j) \"Retained job equivalent \" means a full-time equivalent position:\n(1) that existed at the facility prior to the designation as a job creation fund business; and\n(2) has expected work hours of at least 2,080 hours annually or the equivalent of annualized expected hours of work equal to 2,080 hours of one or more employees.\n(k) \"Veteran\" means a veteran as defined in section 197.447.\n(l) \"Wages\" has the meaning given in section 290.92, subdivision 1, clause (1).\n(a) In order to qualify for designation as a Minnesota job creation fund business under subdivision 3, a business must submit an application to the local government entity where the facility is or will be located.\n(b) A local government must submit the business application along with other application materials to the commissioner for approval.\n(c) The applications required under paragraphs (a) and (b) must be in the form and be made under the procedures specified by the commissioner.\n(a) To receive designation as a Minnesota job creation fund business, a business must satisfy all of the following conditions:\n(1) the business is or will be engaged in, within Minnesota, one of the following as its primary business activity:\n(i) manufacturing;\n(ii) warehousing;\n(iii) distribution;\n(iv) information technology;\n(v) finance;\n(vi) insurance; or\n(vii) professional or technical services;\n(2) the business must not be primarily engaged in lobbying; gambling; entertainment; professional sports; political consulting; leisure; hospitality; or professional services provided by attorneys, accountants, business consultants, physicians, or health care consultants, or primarily engaged in making retail sales to purchasers who are physically present at the business's location;\n(3) the business must enter into a binding construction and job creation business subsidy agreement with the commissioner to expend directly, or ensure expenditure by or in partnership with a third party constructing or managing the project, at least $500,000 in capital investment in a capital investment project that includes a new, expanded, or remodeled facility within one year following designation as a Minnesota job creation fund business or $250,000 if the project is located outside the metropolitan area as defined in section 200.02, subdivision 24, or if 51 percent of the business is cumulatively owned by minorities, veterans, women, or persons with a disability; and:\n(i) create at least ten new full-time equivalent employee positions within two years of the benefit date following the designation as a Minnesota job creation fund business or five new full-time equivalent employee positions within two years of the benefit date if the project is located outside the metropolitan area as defined in section 200.02, subdivision 24, or if 51 percent of the business is cumulatively owned by minorities, veterans, women, or persons with a disability; or\n(ii) expend at least $25,000,000, which may include the installation and purchase of machinery and equipment, in capital investment and retain at least 100 full-time equivalent employees for projects located in the metropolitan area as defined in section 200.02, subdivision 24, or expend at least $10,000,000, which may include the installation and purchase of machinery and equipment, in capital investment and retain at least 50 full-time equivalent employees for projects located outside the metropolitan area;\n(4) positions or employees moved or relocated from another Minnesota location of the Minnesota job creation fund business must not be included in any calculation or determination of job creation or new positions under this paragraph; and\n(5) a Minnesota job creation fund business must not terminate, lay off, or reduce the working hours of an employee for the purpose of hiring an individual to satisfy job creation goals under this subdivision.\n(b) Prior to approving the proposed designation of a business under this subdivision, the commissioner shall consider the following:\n(1) the economic outlook of the industry in which the business engages;\n(2) the projected sales of the business that will be generated from outside the state of Minnesota;\n(3) how the business will build on existing regional, national, and international strengths to diversify the state's economy;\n(4) whether the business activity would occur without financial assistance;\n(5) whether the business is unable to expand at an existing Minnesota operation due to facility or land limitations;\n(6) whether the business has viable location options outside Minnesota;\n(7) the effect of financial assistance on industry competitors in Minnesota;\n(8) financial contributions to the project made by local governments; and\n(9) any other criteria the commissioner deems necessary.\n(c) Upon receiving notification of local approval under subdivision 2, the commissioner shall review the determination by the local government and consider the conditions listed in paragraphs (a) and (b) to determine whether it is in the best interests of the state and local area to designate a business as a Minnesota job creation fund business.\n(d) If the commissioner designates a business as a Minnesota job creation fund business, the business subsidy agreement shall include the performance outcome commitments and the expected financial value of any Minnesota job creation fund benefits.\n(e) The commissioner may amend an agreement once, upon request of a local government on behalf of a business, only if the performance is expected to exceed thresholds stated in the original agreement.\n(f) A business may apply to be designated as a Minnesota job creation fund business at the same location more than once only if all goals under a previous Minnesota job creation fund agreement have been met and the agreement is completed.\n(a) The commissioner may certify a Minnesota job creation fund business as eligible to receive a specific value of benefit under paragraphs (b) and (c) when the business has achieved its job creation and capital investment goals noted in its agreement under subdivision 3.\n(b) A qualified Minnesota job creation fund business may be certified eligible for the benefits in this paragraph for up to five years for projects located in the metropolitan area as defined in section 200.02, subdivision 24, and seven years for projects located outside the metropolitan area, as determined by the commissioner when considering the best interests of the state and local area. Notwithstanding section 16B.98, subdivision 5, paragraph (a), clause (3), or 16B.98, subdivision 5, paragraph (b), grant agreements for projects located outside the metropolitan area may be for up to seven years in length. The eligibility for the following benefits begins the date the commissioner certifies the business as a qualified Minnesota job creation fund business under this subdivision:\n(1) up to five percent rebate for projects located in the metropolitan area as defined in section 200.02, subdivision 24, and 7.5 percent for projects located outside the metropolitan area, on capital investment on qualifying purchases as provided in subdivision 5 with the total rebate for a project not to exceed $500,000;\n(2) an award of up to $500,000 based on full-time job creation and wages paid as provided in subdivision 6 with the total award not to exceed $500,000;\n(3) up to $1,000,000 in capital investment rebates and $1,000,000 in job creation awards are allowable for projects that have at least $25,000,000 in capital investment and 100 new full-time equivalent employees in the metropolitan area as defined in section 200.02, subdivision 24, or at least $10,000,000 in capital investment and 50 new full-time equivalent employees for projects located outside the metropolitan area;\n(4) up to $1,000,000 in capital investment rebates and up to $1,000,000 in job creation awards are allowable for projects that have at least $25,000,000 in capital investment, which may include the installation and purchase of machinery and equipment, and 100 retained full-time equivalent employees for projects located in the metropolitan area as defined in section 200.02, subdivision 24, or at least $10,000,000 in capital investment, which may include the installation and purchase of machinery and equipment, and 50 retained full-time equivalent employees for projects located outside the metropolitan area; and\n(5) for clauses (3) and (4) only, the capital investment expenditure requirements may include the installation and purchases of machinery and equipment. These expenditures are not eligible for the capital investment rebate provided under subdivision 5.\n(c) The job creation award may be provided in multiple years as long as the qualified Minnesota job creation fund business continues to meet the job creation goals provided for in its agreement under subdivision 3 and the total award does not exceed $500,000 except as provided under paragraph (b), clauses (3) and (4). Under paragraph (b), clause (4), a job creation award of $2,000 per full-time equivalent job retained may be provided one time if the qualified Minnesota job creation fund business meets the minimum capital investment and retained employee requirement as provided in paragraph (b), clause (4), for at least two years.\n(d) No rebates or award may be provided until the Minnesota job creation fund business or a third party constructing or managing the project has at least $500,000 in capital investment in the project and at least ten full-time equivalent jobs have been created and maintained for at least one year or the retained employees, as provided in paragraph (b), clause (4), remain for at least one year. The agreement may require additional performance outcomes that need to be achieved before rebates and awards are provided. If fewer retained jobs are maintained, but still above the minimum under this subdivision, the capital investment award shall be reduced on a proportionate basis.\n(e) The forms needed to be submitted to document performance by the Minnesota job creation fund business must be in the form and be made under the procedures specified by the commissioner. The forms shall include documentation and certification by the business that it is in compliance with the business subsidy agreement, sections 116J.871 and 116L.66, and other provisions as specified by the commissioner.\n(f) Minnesota job creation fund businesses must pay each new full-time equivalent employee added pursuant to the agreement total compensation, including benefits not mandated by law, that on an annualized basis is equal to at least 110 percent of the federal poverty level for a family of four.\n(g) A Minnesota job creation fund business must demonstrate reasonable progress on capital investment expenditures within six months following designation as a Minnesota job creation fund business to ensure that the capital investment goal in the agreement under subdivision 1 will be met. Businesses not making reasonable progress will not be eligible for benefits under the submitted application and will need to work with the local government unit to resubmit a new application and request to be a Minnesota job creation fund business. Notwithstanding the goals noted in its agreement under subdivision 1, this action shall not be considered a default of the business subsidy agreement.\n(a) A qualified Minnesota job creation fund business is eligible for a rebate on the purchase and use of construction materials, services, and supplies used for or consumed in the construction project as described in the goals under the agreement provided under subdivision 1, paragraph (b).\n(b) The rebate under this subdivision applies regardless of whether the purchases are made by the qualified Minnesota job creation fund business or a contractor hired to perform work or provide services at the qualified Minnesota job creation fund business location.\n(c) Minnesota job creation fund businesses seeking the rebate for capital investment provided under subdivision 4 must submit forms and applications to the Department of Employment and Economic Development as prescribed by the commissioner of each department.\n(a) A qualified Minnesota job creation fund business is eligible for an annual award for each new full-time equivalent job created and maintained under subdivision 4, paragraph (b), clauses (2) and (3), by the business using the following schedule: $1,000 for each job position paying annual wages at least $26,000 but less than $35,000; $2,000 for each job position paying at least $35,000 but less than $45,000; $3,000 for each job position paying at least $45,000 but less than $55,000; and $4,000 for each job position paying at least $55,000; and as noted in the goals under the agreement provided under subdivision 1. These awards are increased by $1,000 if the business is located outside the metropolitan area as defined in section 200.02, subdivision 24, or if 51 percent of the business is cumulatively owned by minorities, veterans, women, or persons with a disability.\n(b) A qualified Minnesota job creation fund business is eligible for a onetime $2,000 award for each full-time equivalent job retained and maintained under subdivision 4, paragraph (b), clause (4), provided that each retained job pays total compensation, including benefits not mandated by law, that on an annualized basis is equal to at least 150 percent of the federal poverty level for a family of four.\n(c) The job creation award schedule must be adjusted annually using the percentage increase in the federal poverty level for a family of four.\n(d) Minnesota job creation fund businesses seeking an award credit provided under subdivision 4 must submit forms and applications to the Department of Employment and Economic Development as prescribed by the commissioner.\nThe commissioner may transfer up to $2,000,000 of a fiscal year appropriation between the Minnesota job creation fund program and the redevelopment grant program to meet business demand.\n(a) If the commissioner's policies, procedures, or other statements are rules, as defined in section 14.02, subdivision 4, the requirements in either paragraph (b) or (c) apply, as applicable.\n(b) Effective upon enactment until January 1, 2015:\n(1) the commissioner shall publish notice of proposed rules in the State Register after complying with section 14.07, subdivision 2;\n(2) interested parties have 21 days to comment on the proposed rules. The commissioner must consider comments it receives. After the commissioner has considered all comments and has complied with section 14.07, subdivision 2, the commissioner shall publish notice of the final rule in the State Register;\n(3) if the adopted rules are the same as the proposed rules, the notice shall state that the rules have been adopted as proposed and shall cite the prior publication. If the adopted rules differ from the proposed rules, the portions of the adopted rules that differ from the proposed rules shall be included in the notice of adoption, together with a citation to the prior State Register that contained the notice of the proposed rules; and\n(4) rules published in the State Register before January 1, 2014, take effect upon publication of the notice. Rules published in the State Register on and after January 1, 2014, take effect 30 days after publication of the notice.\n(c) Beginning January 1, 2015, the commissioner may adopt rules to implement any provisions in this section using the expedited rulemaking process in section 14.389.\n(d) The notice of proposed rules required in paragraph (b) must provide information as to where the public may obtain a copy of the rules. The commissioner shall post the proposed rules on the department website at the same time the notice is published in the State Register.",
	"repealed": false
}