{
	"id": "84D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.11",
	"title": "84D.11 PERMITS.",
	"text": "The commissioner may issue a permit for the propagation, possession, importation, purchase, or transport of a prohibited invasive species for the purposes of disposal, decontamination, control, research, or education.\nThe commissioner may issue a permit to departmental divisions for tagging bighead, black, grass, or silver carp for research or control. Under the permit, the carp may be released into the water body from which the carp was captured.\nThe commissioner may issue a permit for the introduction of a regulated invasive species.\n(a) The commissioner may issue a permit to allow the harvest of bait:\n(1) from waters that are listed as infested waters, except those listed because they contain prohibited invasive species of fish or certifiable diseases of fish as defined in section 17.4982, subdivision 6; and\n(2) from infested waters as allowed under section 97C.341, paragraph (c).\nThe permit shall include conditions necessary to avoid spreading aquatic invasive species.\n(b) Before receiving a permit, or working for a permittee, a person annually must satisfactorily complete aquatic invasive species-related training provided by the commissioner.\nThe commissioner may issue a permit under this section or an authorization under other licenses or permits pursuant to sections 97C.801, 97C.811, and 103G.271 to allow the transport of water in containers or water-related equipment specifically designed and used for hauling water.\nThe commissioner may issue a permit to allow the transport of aquatic macrophytes to locations specified in the permit for purposes of research, education, and decontaminating equipment.\nThe commissioner may issue special permits for the activities in this section. A special permit may be issued in the form of a general permit to a governmental subdivision or to the general public to conduct one or more activities under a single permit.\nThe commissioner may issue a permit under this section only if the commissioner determines that the permitted activity would not pose an unreasonable risk of harm to natural resources or their use in the state. The commissioner may deny, issue with conditions, modify, or revoke a permit under this section as necessary to ensure that the proposed activity will not pose an unreasonable risk of harm to natural resources or their use in the state.\nA permit decision may be appealed as a contested case under chapter 14.",
	"repealed": false
}