{
	"id": "3.9741",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.9741",
	"title": "3.9741 COST OF CERTAIN AUDITS.",
	"text": "Upon the audit of the financial accounts and affairs of a commission under section 473.595, 473.604, or 473.703, the affected Metropolitan Commission is liable to the state for the total cost and expenses of the audit, including the salaries paid to the examiners while actually engaged in making the examination. The legislative auditor may bill the Metropolitan Commission either monthly or at the completion of the audit. All collections received for the audits must be deposited in the general fund.\nThe legislative auditor may enter into an interagency agreement with the Board of Trustees of the Minnesota State Colleges and Universities to conduct financial audits, in addition to audits conducted under section 3.972, subdivision 2. All payments received for audits requested by the board shall be deposited in the special revenue fund and appropriated to the legislative auditor to pay audit expenses.\nThe outdoor heritage fund, the clean water fund, the parks and trails fund, and the arts and cultural heritage fund must each reimburse the general fund, in the manner prescribed in section 16A.127, for costs incurred by the legislative auditor in examining financial activities relating to each fund.\nUpon the audit of the financial accounts and affairs of the Minnesota Sports Facilities Authority, the authority is liable to the state for the total cost and expenses of the audit, including the salaries paid to the examiners while actually engaged in making the examination. The legislative auditor may bill the authority either monthly or at the completion of the audit. All collections received for the audits must be deposited in the general fund.\nThe data security account is created in the special revenue fund. Receipts credited to the account are annually appropriated to the legislative auditor for the purpose of oversight relating to security of data stored and transmitted by state systems, including to:\n(1) review and audit the audit reports of subscribers and requesters submitted under section 168.327, subdivision 6, including but not limited to assessing compliance with section 171.12, subdivision 7b, paragraph (d), and producing findings and opinions; and\n(2) review and audit driver records subscription services and bulk data practices of the Department of Public Safety, including identifying any deficiencies and making recommendations to the commissioner.",
	"repealed": false
}