{
	"id": "61A.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.72",
	"title": "61A.72 STANDARDS FOR BASIC ILLUSTRATIONS.",
	"text": "A basic illustration must conform with the following requirements:\n(1) the illustration must be labeled with the date on which it was prepared;\n(2) each page, including any explanatory notes or pages, must be numbered and show its relationship to the total number of pages in the illustration (e.g., the fourth page of a seven-page illustration must be labeled \"page 4 of 7 pages\");\n(3) the assumed dates of payment receipt and benefit payout within a policy year must be clearly identified;\n(4) if the age of the proposed insured is shown as a component of the tabular detail, it must be issue age plus the number of years the policy is assumed to have been in force;\n(5) the assumed payments on which the illustrated benefits and values are based must be identified as premium outlay or contract premium, as applicable. For policies that do not require a specific contract premium, the illustrated payments must be identified as premium outlay;\n(6) guaranteed death benefits and values available upon surrender, if any, for the illustrated premium outlay or contract premium must be shown and clearly labeled guaranteed;\n(7) if the illustration shows any nonguaranteed elements, they cannot be based on a scale more favorable to the policy owner than the insurer's illustrated scale at any duration. These elements must be clearly labeled nonguaranteed;\n(8) the guaranteed elements, if any, must be shown before corresponding nonguaranteed elements and must be specifically referred to on any page of an illustration that shows or describes only the nonguaranteed elements (e.g., \"see page one for guaranteed elements\");\n(9) the account or accumulation value of a policy, if shown, must be identified by the name this value is given in the policy being illustrated and shown in close proximity to the corresponding value available upon surrender;\n(10) the value available upon surrender must be identified by the name this value is given in the policy being illustrated and must be the amount available to the policy owner in a lump sum after deduction of surrender charges, policy loans, and policy loan interest, as applicable;\n(11) illustrations may show policy benefits and values in graphic or chart form in addition to the tabular form;\n(12) any illustration of nonguaranteed elements shall be accompanied by a statement indicating that:\n(i) the benefits and values are not guaranteed;\n(ii) the assumptions on which they are based are subject to change by the insurer; and\n(iii) actual results may be more or less favorable;\n(13) if the illustration shows that the premium payer may have the option to allow policy charges to be paid using nonguaranteed values, the illustration must clearly disclose that a charge continues to be required and that, depending on actual results, the premium payer may need to continue or resume premium outlays. Similar disclosure must be made for premium outlay of lesser amounts or shorter durations than the contract premium. If a contract premium is due, the premium outlay display must not be left blank or show zero unless accompanied by an asterisk or similar mark to draw attention to the fact that the policy is not paid up; and\n(14) if the applicant plans to use dividends or policy values, guaranteed or nonguaranteed, to pay all or a portion of the contract premium or policy charges, or for any other purpose, the illustration may reflect those plans and the impact on future policy benefits and values.\nA basic illustration must include the following:\n(1) a brief description of the policy being illustrated, including a statement that it is a life insurance policy;\n(2) a brief description of the premium outlay or contract premium, as applicable, for the policy. For a policy that does not require payment of a specific contract premium, the illustration shall show the premium outlay that must be paid to guarantee coverage for the term of the contract, subject to maximum premiums allowable to qualify as a life insurance policy under the applicable provisions of the Internal Revenue Code;\n(3) a brief description of any policy features, riders, or options, guaranteed or nonguaranteed, shown in the basic illustration and the impact they may have on the benefits and values of the policy;\n(4) identification and a brief definition of column headings and key terms used in the illustration; and\n(5) a statement containing in substance the following: \"This illustration assumes that the currently illustrated nonguaranteed elements will continue unchanged for all years shown. This is not likely to occur, and actual results may be more or less favorable than those shown.\"\n(a) Following the narrative summary, a basic illustration must include a numeric summary of the death benefits and values and the premium outlay and contract premium, as applicable. For a policy that provides for a contract premium, the guaranteed death benefits and values must be based on the contract premium. This summary must be shown for at least policy years five, ten, and 20 and at age 70, if applicable, on the three bases shown in clauses (1) to (3). For multiple life policies the summary must show policy years five, ten, 20, and 30:\n(1) policy guarantees;\n(2) insurer's illustrated scale; and\n(3) insurer's illustrated scale used but with the nonguaranteed elements reduced as follows:\n(i) dividends at 50 percent of the dividends contained in the illustrated scale used;\n(ii) nonguaranteed credited interest at rates that are the average of the guaranteed rates and the rates contained in the illustrated scale used; and\n(iii) all nonguaranteed charges, including but not limited to term insurance charges, mortality, and expense charges at rates that are the average of the guaranteed rates and the rates contained in the illustrated scale used.\n(b) In addition, if coverage would cease prior to policy maturity or age 100, the year in which coverage ceases must be identified for each of the three bases.\n(a) Statements substantially similar to paragraphs (b) and (c) must be included on the same page as the numeric summary and signed by the applicant or the policy owner in the case of an illustration provided at time of delivery, as required in sections 61A.70 to 61A.745.\n(b) A statement to be signed and dated by the applicant or policy owner reading as follows: \"I have received a copy of this illustration and understand that any nonguaranteed elements illustrated are subject to change and could be either higher or lower. The agent has told me they are not guaranteed.\"\n(c) A statement to be signed and dated by the insurance producer or other authorized representative of the insurer reading as follows: \"I certify that this illustration has been presented to the applicant and that I have explained that any nonguaranteed elements illustrated are subject to change. I have made no statements that are inconsistent with the illustration.\"\n(a) A basic illustration must include the following for at least each policy year from one to ten and for every fifth policy year thereafter ending at age 100, policy maturity or final expiration; and except for term insurance beyond the 20th year, for any year in which the premium outlay and contract premium, if applicable, is subject to change:\n(1) the premium outlay and mode the applicant plans to pay and the contract premium, as applicable;\n(2) the corresponding guaranteed death benefit, as provided in the policy; and\n(3) the corresponding guaranteed value available upon surrender, as provided in the policy.\n(b) For a policy that provides for a contract premium, the guaranteed death benefit and value available upon surrender must correspond to the contract premium.\n(c) Nonguaranteed elements may be shown if described in the contract. In the case of an illustration for a policy on which the insurer intends to credit terminal dividends, they may be shown if the insurer's current practice is to pay terminal dividends. If any nonguaranteed elements are shown, they must be shown at the same durations as the corresponding guaranteed elements, if any. If no guaranteed benefit or value is available at any duration for which a nonguaranteed benefit or value is shown, a zero must be displayed in the guaranteed column.",
	"repealed": false
}