{
	"id": "16D.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.16",
	"title": "16D.16 SETOFFS.",
	"text": "Unless prohibited by other law, the state agency utilizes a more specific setoff statute, or the state payments are subject to a more specific setoff statute, the commissioner or a state agency may automatically deduct the amount of a debt owed to the state from any state payment due to the debtor. Tax refunds, earned income tax credit, child care credit, funds exempt under section 550.37, or funds owed to an individual who is receiving assistance under the provisions of chapter 256 are not subject to setoff under this section. If a debtor has entered into a written payment plan with respect to payment of a specified debt, the right of setoff may not be used to satisfy that debt. Notwithstanding section 181.79, the state may deduct from the wages due or earned by a state employee to collect a debt, subject to the limitations in section 571.922.\nBefore setoff, the commissioner or state agency shall mail written notice by certified mail to the debtor, addressed to the debtor's last known address, that the commissioner or state agency intends to set off a debt owed to the state by the debtor against future payments due the debtor from the state. For debts owed to the state that have not been reduced to judgment, if no administrative appeal process or a hearing by an impartial decision maker on the validity or accuracy of the debt has yet been made available to the debtor, before setoff for a prejudgment debt, the notice to the debtor must advise that the debtor has a right to make a written request for a contested case hearing on the validity of the debt or the right to setoff. The debtor has 30 days from the date of that notice to make a written request for a contested case hearing to contest the validity of the debt or the right to setoff. The debtor's request must state the debtor's reasons for contesting the debt or the right to setoff. If the commissioner or state agency desires to pursue the right to setoff following receipt of the debtor's request for a hearing, the commissioner or state agency shall schedule a contested case hearing within 30 days of the receipt of the request for the hearing. If the commissioner or state agency decides not to pursue the right to setoff, the debtor must be notified of that decision.",
	"repealed": false
}