{
	"id": "144.1507",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1507",
	"title": "144.1507 PRIMARY CARE RESIDENCY TRAINING GRANT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eligible program\" means a program that meets the following criteria:\n(1) is located in Minnesota;\n(2) trains medical residents in the specialties of family medicine, general internal medicine, general pediatrics, psychiatry, geriatrics, or general surgery in rural residency training programs or in community-based ambulatory care centers that primarily serve the underserved; and\n(3) is accredited by the Accreditation Council for Graduate Medical Education or presents a credible plan to obtain accreditation.\n(c) \"Rural residency training program\" means a residency program that provides an initial year of training in an accredited residency program in Minnesota. The subsequent years of the residency program are based in rural communities, utilizing local clinics and community hospitals, with specialty rotations in nearby regional medical centers.\n(d) \"Community-based ambulatory care centers\" means federally qualified health centers, community mental health centers, rural health clinics, health centers operated by the Indian Health Service, an Indian Tribe or Tribal organization, or an urban American Indian organization or an entity receiving funds under Title X of the Public Health Service Act.\n(e) \"Eligible project\" means a project to establish and maintain a rural residency training program.\n(a) The commissioner of health shall award rural residency training program grants to eligible programs to plan, implement, and sustain rural residency training programs. A rural residency training program grant shall not exceed $250,000 per year for up to three years for planning and development, and $225,000 per resident per year for each year thereafter to sustain the program.\n(b) Funds may be spent to cover the costs of:\n(1) planning related to establishing accredited rural residency training programs;\n(2) obtaining accreditation by the Accreditation Council for Graduate Medical Education or another national body that accredits rural residency training programs;\n(3) establishing new rural residency training programs;\n(4) recruitment, training, and retention of new residents and faculty related to the new rural residency training program;\n(5) travel and lodging for new residents;\n(6) faculty, new resident, and preceptor salaries related to new rural residency training programs;\n(7) training site improvements, fees, equipment, and supplies required for new rural residency training programs; and\n(8) supporting clinical education in which trainees are part of a primary care team model.\nEligible programs seeking a grant shall apply to the commissioner. Applications must include the number of new primary care rural residency training program slots planned, under development or under contract; a description of the training program, including location of the established residency program and rural training sites; a description of the project, including all costs associated with the project; all sources of funds for the project; detailed uses of all funds for the project; the results expected; proof of eligibility for federal graduate medical education funding, if applicable; and a plan to seek the funding. The applicant must describe achievable objectives, a timetable, and the roles and capabilities of responsible individuals in the organization.\nThe commissioner shall review each application to determine if the residency program application is complete, if the proposed rural residency program and residency slots are eligible for a grant, and if the program is eligible for federal graduate medical education funding, and when the funding is available. If eligible programs are not eligible for federal graduate medical education funding, the commissioner may award continuation funding to the eligible program beyond the initial grant period. The commissioner shall award grants to support training programs in family medicine, general internal medicine, general pediatrics, psychiatry, geriatrics, general surgery, and other primary care focus areas.\nDuring the grant period, the commissioner may require and collect from grantees any information necessary to evaluate the program. Notwithstanding section 16A.28, subdivision 6, encumbrances for grants under this section issued by June 30 of each year may be certified for a period of up to five years beyond the year in which the funds were originally appropriated.",
	"repealed": false
}