{
	"id": "193.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.145",
	"title": "193.145 FUNDS FOR CONSTRUCTION OF ARMORY; TAX LEVY.",
	"text": "[Repealed, 1996 c 310 s 1]\nA county or municipality, as defined in section 471.345, subdivision 1, in which an armory has been constructed or is to be constructed hereunder may by resolution of its governing body irrevocably provide for levying and collecting annually for a specified period, not exceeding 40 years, a tax on the taxable property in the county or municipality.\nThe proceeds of the levy shall be paid to the corporation for the purposes herein prescribed. The county or municipality may make the levies and payments and bind itself thereto by resolution of its governing body. The provisions of the resolution may be made conditional upon the giving of an agreement by the adjutant general as authorized in subdivision 4. The obligations of the county or municipality to levy, collect, and pay over the taxes shall not be deemed to constitute an indebtedness of the county or municipality within the meaning of any provision of law or of its charter limiting its total or net indebtedness, and such taxes may be levied and collected without regard to any charter provision limiting the amount or rate of taxes which such county or municipality is otherwise authorized to levy.\n[Repealed, 1987 c 384 art 2 s 113]\nWhether or not bonds are issued, the adjutant general is hereby authorized to pay to such corporation, out of any money which may from time to time be appropriated to and for the military department and not appropriated or set apart for any other specific purpose, the sum of not less than $3,000 per year for each unit of the National Guard quartered in such armory when only one such unit is so quartered, and the sum of not less than $2,000 per year for each additional unit when more than one such unit is so quartered, and may bind the Office of the Adjutant General, both currently and in the future, by agreement to such corporation to make such payments in a specific amount or amounts out of such appropriations for a period of not more than 40 years.\nUpon completion of each new armory such corporation shall lease the same to the state through the adjutant general, until such armory and site shall be conveyed to the state as hereinafter provided. Such lease shall be made upon such terms and conditions as shall secure to the state the full and complete use of such armory, for armory and military purposes so far as may be required for the headquarters, organizations, and units of the National Guard stationed in such municipality, and upon such other terms and conditions not inconsistent therewith as may be agreed upon; provided, that, except for such use of such property for armory and military purposes which will be secured to the state as aforesaid, such lease shall be subject to any encumbrance placed upon the property to secure the payment of any bonds issued as herein provided. No further consideration for such lease shall be required than the payments to be made by the state as provided by subdivision 4. Otherwise, and so far as it is not inconsistent with the terms and conditions of such lease to the state and so far as will not interfere with the use by the state of such property for armory or military purposes, such corporation may lease, rent, or otherwise make use of such new armory building or any part thereof for such purposes and upon such terms as such corporation may deem proper, and may use the rents and profits therefrom for the purposes herein provided.",
	"repealed": false
}