{
	"id": "60A.768",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.768",
	"title": "60A.768 SPECIFIC STANDARDS FOR MORBIDITY, INTEREST, AND MORTALITY.",
	"text": "A. Minimum morbidity standards for valuation of specified individual contract health insurance benefits are as follows:\n(1) Disability Income Benefits Due to Accident or Sickness.\n(a) Contract Reserves:\nContracts issued on or after January 1, 2004:\nThe 1985 Commissioners Individual Disability Tables A (85CIDA); or\nThe 1985 Commissioners Individual Disability Tables B (85CIDB).\nEach insurer shall elect, with respect to all individual contracts issued in any one statement year, whether it will use Tables A or Tables B as the minimum standard. The insurer may, however, elect to use the other tables with respect to any subsequent statement year.\n(b) Claim Reserves:\nFor claims incurred on or after January 1, 2004:\nThe 1985 Commissioners Individual Disability Table A (85CIDA) with claim termination rates multiplied by the following adjustment factors:\n*The adjusted termination rates derived from the application of the adjustment factors to the DTS Valuation Table termination rates shown in exhibits 3a, 3b, 3c, 4, and 5 (Transactions of the Society of Actuaries (TSA) XXXVII, pages 457-463) is displayed. The adjustment factors for age, elimination period, class, sex, and cause displayed in exhibits 3a, 3b, 3c, and 4 should be applied to the adjusted termination rates shown in this table.\n**Applicable DTS Valuation Table duration rate from exhibits 3c and 4 (TSA XXXVII, pages 462-463).\nThe 85CIDA table so adjusted for the computation of claim reserves shall be known as 85CIDC (The 1985 Commissioners Individual Disability Table C).\n(2) Hospital Benefits, Surgical Benefits, and Maternity Benefits (Scheduled benefits or fixed time period benefits only).\n(a) Contract Reserves.\nContracts issued on or after January 1, 1982:\nThe 1974 Medical Expense Tables, Table A, Transactions of the Society of Actuaries, Volume XXX, page 63. Refer to the paper (in the same volume, page 9) to which this table is appended, including its discussions, for methods of adjustment for benefits not directly valued in Table A: \"Development of the 1974 Medical Expense Benefits,\" Houghton and Wolf.\n(b) Claim Reserves:\nNo specific standard. See (6).\n(3) Cancer Expense Benefits (Scheduled benefits or fixed time period benefits only).\n(a) Contract Reserves:\nContracts issued on or after January 1, 2004:\nThe 1985 NAIC Cancer Claim Cost Tables.\n(b) Claim Reserves:\nNo specific standard. See (6).\n(4) Accidental Death Benefits.\n(a) Contract Reserves:\nContracts issued on or after January 1, 2004:\nThe 1959 Accidental Death Benefits Table.\n(b) Claim Reserves:\nActual amount incurred.\n(5) Single Premium Credit Disability.\n(a) Contract Reserves:\n(i) For contracts issued on or after January 1, 2004:\n(I) For plans having less than a 30-day elimination period, the 1985 Commissioners Individual Disability Table A (85CIDA) with claim incidence rates increased by 12 percent.\n(ii)(II) For plans having a 30-day and greater elimination period, the 85CIDA for a 14-day elimination period with the adjustment in item (I).\n(b) Claim Reserves:\nClaim reserves are to be determined as provided in section 60A.763.\n(6) Other Individual Contract Benefits.\n(a) Contract Reserves:\nFor all other individual contract benefits, morbidity assumptions are to be determined as provided in section 60A.765.\n(b) Claim Reserves:\nFor all benefits other than disability, claim reserves are to be determined as provided in section 60A.763.\nB. Minimum morbidity standards for valuation of specified group contract health insurance benefits are as follows:\n(1) Disability Income Benefits Due to Accident or Sickness.\n(a) Contract Reserves:\nContracts issued on or after January 1, 2004:\nThe 1987 Commissioners Group Disability Income Table (87CGDT).\n(b) Claim Reserves:\nFor claims incurred on or after January 1, 2004:\nThe 1987 Commissioners Group Disability Income Table (87CGDT);\n(2) Single Premium Credit Disability\n(a) Contract Reserves:\n(i) For contracts issued on or after January 1, 2004:\n(I) For plans having less than a 30-day elimination period, the 1985 Commissioners Individual Disability Table A (85CIDA) with claim incidence rates increased by 12 percent.\n(ii)(II) For plans having a 30-day and greater elimination period, the 85CIDA for a 14-day elimination period with the adjustment in item (I).\n(b) Claim Reserves:\nClaim reserves are to be determined as provided in section 60A.763.\n(3) Other Group Contract Benefits.\n(a) Contract Reserves:\nFor all other group contract benefits, morbidity assumptions are to be determined as provided in section 60A.765.\n(b) Claim Reserves:\nFor all benefits other than disability, claim reserves are to be determined as provided in section 60A.763.\nA. For contract reserves the maximum interest rate is the maximum rate permitted by law in the valuation of whole life insurance issued on the same date as the health insurance contract.\nB. For claim reserves on policies that require contract reserves, the maximum interest rate is the maximum rate permitted by law in the valuation of whole life insurance issued on the same date as the claim incurred date.\nC. For claim reserves on policies not requiring contract reserves, the maximum interest rate is the maximum rate permitted by law in the valuation of single premium immediate annuities issued on the same date as the claim incurred date, reduced by 100 basis points.\nA. For individual long-term care insurance policies or group long-term care insurance certificates issued on or after January 1, 2004, the mortality basis used must be the 1983 Group Annuity Mortality Table without projection.\nB. Other mortality tables adopted by the NAIC and adopted by the commissioner may be used in the calculation of the minimum reserves if appropriate for the type of benefits and if approved by the commissioner. The request for approval must include the proposed mortality table and the reason that the standard specified in subsection A is inappropriate.\nC. For single premium credit insurance using the 85CIDA table, no separate mortality must be assumed.",
	"repealed": false
}