{
	"id": "174.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.47",
	"title": "174.47 ELECTRIC VEHICLE INFRASTRUCTURE PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of transportation.\n(c) \"Program\" means the electric vehicle infrastructure program established in this section.\n(d) \"Project\" includes but is not limited to planning, predesign, design, preliminary and final engineering, environmental analysis, property acquisition, construction, and maintenance.\nThe commissioner must establish a statewide electric vehicle infrastructure program for the purpose of implementing the National Electric Vehicle Infrastructure Formula Program and successor programs to maximize the use of federal funds available to the state.\nThe commissioner may enter into an agreement with any private or public entity to provide financial assistance for, or engage in the planning, designing, developing, hosting, constructing, equipping, operating, or maintaining of, electric vehicle infrastructure, including but not limited to environmental studies, preliminary engineering, final design, construction, and developing financial and operating plans.\n(a) The commissioner must require that electric vehicle infrastructure funded under the program is constructed, installed, and maintained in conformance with the requirements under Code of Federal Regulations, title 23, section 680.106, paragraph (j), or successor requirements.\n(b) An electric vehicle infrastructure project that receives funds under the program is subject to the requirement of paying the prevailing wage rate as defined in section 177.42, and the requirements and enforcement provisions in sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\n(a) Every even-numbered year by February 1, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance regarding the electric vehicle infrastructure program. At a minimum, the report must include:\n(1) an itemization of federal funds spent for the program, including the purpose of the expenditure and the recipient of the expenditure;\n(2) an itemization of state funds spent for the program, including the purpose of the expenditure and the recipient of the expenditure;\n(3) the amount of money, from any source, that was used for department staff related to the program;\n(4) any changes to the plan that were made since the previous report was submitted;\n(5) the locations of electric vehicle infrastructure created with the program, including the type of infrastructure and whether the infrastructure is on public or private property;\n(6) a description of how projects were selected; and\n(7) a description of how the commissioner is ensuring electric vehicle infrastructure is regionally balanced.\n(b) The commissioner is not required to submit a report pursuant to this subdivision if, since the previous report was submitted, no money has been spent pursuant to this section.",
	"repealed": false
}