{
	"id": "137.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.095",
	"title": "137.095 EVIDENCE IN SUPPORT OF APPROPRIATION.",
	"text": "Prior to the introduction of a bill proposing to appropriate money to the Board of Regents of the University of Minnesota to benefit the University of Minnesota's health sciences schools and colleges, the proponents of the bill are requested to submit a written report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education and health and human services policy and finance setting out the information described in subdivision 2. The University of Minnesota's health sciences schools and colleges are medicine, nursing, public health, pharmacy, dentistry, and veterinary medicine.\n(a) The report requested under this section must include the following information as specifically as possible:\n(1) the dollar amount requested;\n(2) how the requested dollar amount was calculated;\n(3) the necessity for the appropriation's purpose to be funded by public funds;\n(4) University of Minnesota budgeting considerations and decisions impacting the necessity analysis required by clause (3);\n(5) all goals, outcomes, and purposes of the appropriation;\n(6) performance measures as defined by the University of Minnesota that the University of Minnesota will utilize to ensure the funds are dedicated to the successful achievement of the identified goals, outcomes, and purposes; and\n(7) the extent to which the appropriation advances recruitment from, and training for and retention of, health professionals from and in greater Minnesota and from underserved communities in metropolitan areas.\n(b) This subdivision only applies when the Board of Regents of the University of Minnesota approves a legislative funding request for the University of Minnesota's health sciences schools and colleges.\nA report submitted under this section must include, in addition to the information listed in subdivision 2, a certification, by the University of Minnesota Vice President and Budget Director, that:\n(1) the appropriation will not be used to cover academic health clinical revenue deficits;\n(2) the goals, outcomes, and purposes of the appropriation are aligned with state goals for population health improvement; and\n(3) the appropriation is aligned with the University of Minnesota's strategic plan for its health sciences schools and colleges, including but not limited to shared goals and strategies for the health professional schools.\nThe chair of a standing committee in either house of the legislature may request and obtain the reports submitted pursuant to this section from the chair of a legislative committee with jurisdiction over higher education or health and human services policy and finance.",
	"repealed": false
}