{
	"id": "352.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.85",
	"title": "352.85 MILITARY AFFAIRS PERSONNEL.",
	"text": "Any person who is employed by the Department of Military Affairs other than as a full-time firefighter, who is covered by the general employee retirement plan of the system as provided in section 352.01, subdivision 23, who is ordered to active duty under section 190.08, subdivision 3, who elects this special retirement coverage under subdivision 4, who is required to retire from federal military status at an age earlier than normal retirement age by applicable federal laws or regulations, and who terminates employment as a state employee upon attaining that mandatory retirement age is entitled, upon application, to a retirement annuity computed in accordance with section 352.115, subdivisions 2 and 3, without any reduction for early retirement under section 352.116, subdivision 1 or 1a.\nAn employee described in subdivision 1, who is less than the applicable federal military status mandatory retirement age and who becomes disabled and physically or mentally unfit to perform occupational duties due to injury, sickness, or other disability, and who is found disqualified for retention on active duty as a result of a physical examination required by applicable federal laws or regulations, is entitled upon application to disability benefits computed in the manner specified in section 352.113. Disability benefits are otherwise governed by section 352.113, except that the age for the termination of the disability benefit is the applicable federal military status mandatory retirement age.\nThe special retirement annuities and disability benefits authorized by this section shall be financed by an employee contribution from the covered Department of Military Affairs employee of 1.6 percent and an employer contribution from the Department of Military Affairs of 1.6 percent. These contributions are in addition to the contributions required by section 352.04, subdivisions 2 and 3. They must be made as provided in section 352.04, subdivisions 4, 5, and 6.\nTo be covered by this section, any employee of the Department of Military Affairs, described in subdivision 1, must file a notice with the executive director of the system on a form prescribed by the executive director stating that the employee elects to be covered. Notice must be filed within 90 days of employment. Elected coverage is effective retroactively as of the first day of employment. Amounts that would have been deducted from the employee's salary starting with the first day of employment but were not deducted because the employee had not yet filed the election must be deducted from the employee's future salary in accordance with a schedule of deductions determined by the executive director and the Department of Military Affairs. Elections are irrevocable during any period of covered employment. A failure to file a timely notice is deemed a waiver of coverage by this section.\nNothing in this section applies to the adjutant general.\n[Repealed, 1991 c 269 art 3 s 21]",
	"repealed": false
}