{
	"id": "48.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.055",
	"title": "48.055 ISSUANCE OF PREFERRED STOCK, CONDITIONS.",
	"text": "Any state bank may issue preferred stock of one or more classes, with or without voting rights, with the approval of the commissioner of commerce and without change of its certificate of incorporation, when its board of directors is so authorized by a majority vote of its stockholders, at a general or special meeting thereof called for such purpose. Provided, however, that in no event shall the amount of preferred stock exceed 50 percent of the total common stock and surplus of such issuing bank.\nSuch preferred stock may be issued to any person, firm, or corporation, and the holders thereof shall have such rights as are set forth under the terms of issue of such preferred stock. No issue of preferred stock shall be valid until the capital stock shall have been fully paid in, and no dividend shall be paid on the common stock of a bank until all terms of the issue of such preferred stock shall have been satisfied.\nThe terms of issue of such preferred stock shall set its rank or priority as between other stock issue, provided that such preferred stock shall be subordinated to all claims of depositors or other creditors in case of the insolvency of the issuing bank. Such preferred stock shall in no case be subject to any assessment, nor shall otherwise be liable for the obligations of the issuing bank. Before any such preferred stock is retired or paid by the issuing bank, it must first obtain the approval of the commissioner of commerce.\nAt the end of each dividend period, after deducting all necessary expenses, losses, amounts receivable more than one year overdue and not well secured, interest, and taxes due or levied, all of the remaining net profits for the period shall be set aside as a surplus fund, if the surplus fund of such bank is not then equal to one-fifth of the capital stock. If the surplus fund is more than one-fifth of the capital stock, ten percent of the remaining net profits for the period shall be set aside as a surplus fund until it equals 50 percent of the total capital stock. After these provisions are complied with, the bank may, without prior approval of the commissioner, pay dividends as provided under the terms of issue of such preferred stock. Dividends on preferred stock may be paid out of the undivided profit account without regard to earnings in the last concluded year, if the surplus equals 50 percent of the total capital stock and the undivided profit account would not be thereby reduced to less than 25 percent of the total capital stock.\nAny preferred stock issued by a state bank shall be part of its capital stock structure, and the terms \"capital stock\" or \"capital\" in any laws of this state pertaining to state banks shall be deemed to also include and apply to preferred stock.\nThe commissioner is authorized to issue such rules and orders as may be necessary to administer and carry out the provisions and purposes of this section.",
	"repealed": false
}