{
	"id": "299C.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.76",
	"title": "299C.76 BACKGROUND CHECK; ACCESS TO FEDERAL TAX INFORMATION.",
	"text": "(a) For the purposes of this section, the following definitions apply.\n(b) \"Federal tax information\" means federal tax returns and return information or information derived or created from federal tax returns, in possession of or control by the requesting agency, that is covered by the safeguarding provisions of section 6103(p)(4) of the Internal Revenue Code.\n(c) \"IRS Publication 1075\" means Internal Revenue Service Publication 1075 that provides guidance and requirements for the protection and confidentiality of federal tax information as required in section 6103(p)(4) of the Internal Revenue Code.\n(d) \"National criminal history record information\" means the Federal Bureau of Investigation identification records as defined in Code of Federal Regulations, title 28, section 20.3(d).\n(e) \"Requesting agency\" means the Department of Revenue, Department of Employment and Economic Development, Department of Children, Youth, and Families, board of directors of MNsure, Department of Information Technology Services, attorney general, and counties.\nAs required by IRS Publication 1075, a requesting agency shall require fingerprints for a national criminal history record information check from the following individuals who have or will have access to federal tax information:\n(1) a current or prospective permanent or temporary employee of the requesting agency;\n(2) an independent contractor or vendor of the requesting agency; or\n(3) an employee of an independent contractor or vendor of the requesting agency.\nAn individual subject to this section must provide fingerprints and a written statement of understanding that the fingerprints will be used for a background check to the requesting agency. The requesting agency must submit the fingerprints and written statement of understanding, along with the processing fees, to the superintendent of the Bureau of Criminal Apprehension. The fingerprints must only be used for the purposes described in this section.\n(a) After the superintendent of the Bureau of Criminal Apprehension notifies requesting agencies that the United States Attorney General has approved the request for submission under Public Law 92-544, a requesting agency may submit information under subdivision 3.\n(b) Upon receipt of the information under subdivision 3, the superintendent of the Bureau of Criminal Apprehension must:\n(1) perform a state criminal history record information search;\n(2) exchange the fingerprints to the Federal Bureau of Investigation to facilitate a search of the national criminal history record information;\n(3) compile the results of the state and national criminal history record information searches; and\n(4) provide the results to the requesting agency.\n(a) All data collected, created, received, maintained, or disseminated by the requesting agency under this section is classified as private data on individuals as defined in section 13.02, subdivision 12.\n(b) Notwithstanding any law to the contrary, a requesting agency must not further disseminate the results received under subdivision 4.",
	"repealed": false
}