{
	"id": "245A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.14",
	"title": "245A.14 SPECIAL CONDITIONS FOR NONRESIDENTIAL PROGRAMS.",
	"text": "A licensed nonresidential program with a licensed capacity of 12 or fewer persons shall be considered a permitted single-family residential use of property for the purposes of zoning and other land use regulations.\nExcept as otherwise provided in subdivision 1 or in a town, municipal, or county regulation, a licensed nonresidential program with a licensed capacity of 13 to 16 persons shall be considered a permitted multifamily residential use of property for purposes of zoning. A town, municipal, or county zoning authority may require a conditional use or special use permit in order to assure proper maintenance and operation of the program. Conditions imposed on the nonresidential program must not be more restrictive than those imposed on other conditional uses or special uses of residential property in the same zones unless the additional conditions are necessary to protect the health and safety of the persons being served by the nonresidential program. Nothing in this chapter shall be construed to exclude or prohibit nonresidential programs from single-family zones if otherwise permitted by local zoning regulations.\n[Renumbered 142B.41, subd 3]\n[Renumbered 142B.41, subd 4]\n[Renumbered 142B.41, subd 5]\n[Repealed, 1992 c 513 art 9 s 44]\n[Renumbered 142B.41, subd 6]\n[Repealed, 2007 c 112 s 59]\n[Renumbered 142B.41, subd 7]\n[Repealed, 2007 c 112 s 59]\n[Repealed, 2007 c 112 s 59]\n[Renumbered 142B.41, subd 8]\n[Renumbered 142B.41, subd 9]\n[Repealed, 2007 c 112 s 59]\n[Repealed, 2007 c 112 s 59]\n(a) An adult day services program licensed under this chapter and according to Minnesota Rules, parts 9555.5105 to 9555.6265, must maintain documentation of actual attendance for each adult day service recipient for which the license holder is reimbursed by a governmental program. The records must be accessible to the commissioner during the program's hours of operation, they must be completed on the actual day of attendance, and they must include:\n(1) the first, middle, and last name of the recipient;\n(2) the time of day that the recipient was dropped off; and\n(3) the time of day that the recipient was picked up.\n(b) Adult day services programs licensed under this chapter that are designated for remote adult day services must maintain documentation of actual participation for each adult day service recipient for whom the license holder is reimbursed by a governmental program. The records must be accessible to the commissioner during the program's hours of operation, must be completed on the actual day service is provided, and must include the:\n(1) first, middle, and last name of the recipient;\n(2) time of day the remote services started;\n(3) time of day that the remote services ended; and\n(4) means by which the remote services were provided, through audio remote services or through audio and video remote services.\n[Renumbered 142B.41, subd 11]\n[Renumbered 142B.41, subd 12]\n[Renumbered 142B.41, subd 13]",
	"repealed": false
}