{
	"id": "244.1951",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.1951",
	"title": "244.1951 DETENTION AND RELEASE; INTERMEDIATE SANCTIONS; SUPERVISION CONTACTS.",
	"text": "(a) If necessary to enforce discipline or to prevent an individual on probation from escaping or absconding from supervision, a probation agency has the authority to issue a written order directing any peace officer or any probation officer in the state serving the district and juvenile courts to detain and bring the individual before the court or the commissioner, whichever is appropriate, for disposition.\n(b) If an individual on probation commits a violation under section 609.14, subdivision 1a, paragraph (a), the probation agency must have a reasonable belief before issuing the order that:\n(1) the order is necessary to prevent the person from escaping or absconding from supervision; or\n(2) the continued presence of the person in the community presents the potential to cause further harm to the public or self.\n(c) An order under this subdivision is sufficient authority for the peace officer or probation officer to detain the person for no more than 72 hours, excluding Saturdays, Sundays, and holidays, pending a hearing before the court or the commissioner.\n(a) A probation agency has the authority to issue a written order directing any peace officer or any probation officer serving the district and juvenile courts in the state to release a person detained under subdivision 1 within 72 hours, excluding Saturdays, Sundays, and holidays, without an appearance before the court or the commissioner.\n(b) An order under this subdivision is sufficient authority for the peace officer or probation officer to release the detained person.\n(a) A probation agency has the authority to issue a written order directing any peace officer or any probation officer serving the district and juvenile courts in the state to detain any person on court-ordered pretrial release who absconds from pretrial release or fails to abide by the conditions of pretrial release.\n(b) An order issued under this subdivision is sufficient authority for the peace officer or probation officer to detain the person.\n(a) Unless the district court directs otherwise, a probation officer may require a person committed to the officer's care by the court to perform community work service for violating a court-imposed condition of probation. Community work service may be imposed to deter behaviors that place the public at risk or to aid the person's rehabilitation, or both.\n(b) Community work service may be imposed as follows:\n(1) a probation officer may impose up to eight hours of community work service for each violation and up to a total of 24 hours per person per 12-month period, beginning on the date on which community work service is first imposed; and\n(2) the officer's probation agency may authorize an additional 40 hours of community work service, for a total of 64 hours per person per 12-month period, beginning with the date on which community work service is first imposed.\n(c) If community work service is imposed, a probation officer must provide written notice to the person in their care that states:\n(1) the condition of probation that has been violated;\n(2) the number of hours of community work service imposed for the violation; and\n(3) the total number of hours of community work service imposed to date in the 12-month period.\n(d) A person on probation supervision may challenge the imposition of community work service by filing a petition in district court within five days of receiving written notice that community work service is being imposed. If the person challenges the imposition of community work service, the state bears the burden of showing, by a preponderance of the evidence, that imposing community work service is reasonable under the circumstances.\n(e) For purposes of this subdivision, \"community work service\" includes sentencing to service.\nSupervision contacts or appointments may be conducted over videoconference technology in accordance with the probation agency's established policy.",
	"repealed": false
}