{
	"id": "282.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.08",
	"title": "282.08 APPORTIONMENT OF PROCEEDS TO TAXING DISTRICTS.",
	"text": "The net proceeds from the sale or rental of any parcel of forfeited land, or from the sale of products from the forfeited land, must be apportioned by the county auditor to the taxing districts interested in the land, as follows:\n(1) the portion required to pay any amounts included in the appraised value under section 282.01, subdivision 3, as representing increased value due to any public improvement made after forfeiture of the parcel to the state, but not exceeding the amount certified by the appropriate governmental authority must be apportioned to the governmental subdivision entitled to it;\n(2) the portion required to pay any amount included in the appraised value under section 282.019, subdivision 5, representing increased value due to response actions taken after forfeiture of the parcel to the state, but not exceeding the amount of expenses certified by the Pollution Control Agency or the commissioner of agriculture, must be apportioned to the agency or the commissioner of agriculture and deposited in the fund from which the expenses were paid;\n(3) the portion of the remainder required to discharge any special assessment chargeable against the parcel for drainage or other purpose whether due or deferred at the time of forfeiture, must be apportioned to the governmental subdivision entitled to it; and\n(4) any balance must be apportioned as follows:\n(i) The county board may annually by resolution set aside no more than 30 percent of the receipts remaining to be used for forest development on tax-forfeited land and dedicated memorial forests, to be expended under the supervision of the county board. It must be expended only on projects improving the health and management of the forest resource.\n(ii) The county board may annually by resolution set aside no more than 20 percent of the receipts remaining to be used for the acquisition and maintenance of county parks or recreational areas as defined in sections 398.31 to 398.36, to be expended under the supervision of the county board.\n(iii) Any balance remaining must be apportioned as follows: county, 40 percent; town or city, 20 percent; and school district, 40 percent, provided, however, that in unorganized territory that portion which would have accrued to the township must be administered by the county board of commissioners.",
	"repealed": false
}