{
	"id": "169.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.13",
	"title": "169.13 RECKLESS OR CARELESS DRIVING.",
	"text": "(a) A person who drives a motor vehicle or light rail transit vehicle while aware of and consciously disregarding a substantial and unjustifiable risk that the driving may result in harm to another or another's property is guilty of reckless driving. The risk must be of such a nature and degree that disregard of it constitutes a significant deviation from the standard of conduct that a reasonable person would observe in the situation.\n(b) A person shall not race any vehicle upon any street or highway of this state. Any person who willfully compares or contests relative speeds by operating one or more vehicles is guilty of racing, which constitutes reckless driving, whether or not the speed contested or compared is in excess of the maximum speed prescribed by law.\n(c) A person who violates paragraph (a) or (b) is guilty of a misdemeanor. A person who violates paragraph (a) or (b) and causes great bodily harm or death to another is guilty of a gross misdemeanor.\n(d) For purposes of this section, \"great bodily harm\" has the meaning given in section 609.02, subdivision 8.\n(a) Any person who operates or halts any vehicle upon any street or highway carelessly or heedlessly in disregard of the rights of others, or in a manner that endangers or is likely to endanger any property or any person, including the driver or passengers of the vehicle, is guilty of a misdemeanor.\n(b) Any person who operates or halts a light rail transit vehicle carelessly or heedlessly in disregard of the rights of others, or in a manner that endangers or is likely to endanger any property or any person, including the operator or passengers on the light rail transit vehicle, is guilty of a misdemeanor.\n(a) The provisions of this section apply, but are not limited in application, to any person who drives any vehicle in the manner prohibited by this section:\n(1) upon the ice of any lake, stream, or river, including but not limited to the ice of any boundary water; or\n(2) in a parking lot ordinarily used by or available to the public though not as a matter of right, and a driveway connecting the parking lot with a street or highway.\n(b) This section does not apply to:\n(1) an authorized emergency vehicle, when responding to an emergency call or when in pursuit of an actual or suspected violator;\n(2) the emergency operation of any vehicle when avoiding imminent danger; or\n(3) any raceway, racing facility, or other public event sanctioned by the appropriate governmental authority.\n(c) Nothing in this section or section 609.035 or 609.04 shall limit the power of the state to prosecute or punish a person for conduct that constitutes any other crime under any other law of this state.",
	"repealed": false
}