{
	"id": "626.8453",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8453",
	"title": "626.8453 QUALIFIED FEDERAL LAW ENFORCEMENT OFFICERS; SPECIAL STATE AND FEDERAL TASK FORCES; PEACE OFFICER AUTHORITY.",
	"text": "The terms defined in this subdivision apply to this section.\n(a) \"Duly authorized executive officer\" means the law enforcement officer headquartered in Minnesota who is in charge of the activities of a federal law enforcement agency in this state.\n(b) \"Memorandum of understanding\" is a written agreement between the governing bodies of the participating units of local government and the commissioners of the state agencies authorized to have a law enforcement agency as defined by section 626.84, subdivision 1, paragraph (f), the sheriffs of the participating counties, and the duly authorized executive officers of the participating federal law enforcement agencies that specifies the mission of the parties, the agreement's purpose, the exchange of powers, required training, the duration of the agreement, and other rights and responsibilities of the parties.\n(c) \"Qualified federal law enforcement officer\" means an employee of the United States charged with the enforcement of the criminal laws of the United States who has successfully completed professionally recognized peace officer preemployment education which the board has found comparable to Minnesota peace officer preemployment education.\n(d) \"Special purpose task force\" is a coalition of city, county, state, and federal law enforcement officers directed to accomplish specific state and federal law enforcement objectives.\nA qualified federal law enforcement officer assigned to a special purpose task force created under a memorandum of understanding that has been filed with the board who is acting within the scope of the memorandum of understanding shall possess the authority of the peace officers participating in the special purpose task force under the memorandum of understanding.\nThis section is not intended to limit the existing authority possessed by federal law enforcement officers.",
	"repealed": false
}