{
	"id": "62A.154",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.154",
	"title": "62A.154 BENEFITS FOR DES RELATED CONDITIONS.",
	"text": "For the purposes of this section, the terms defined in this section have the meanings given them.\n(a) \"Covered person\" means a natural person who is covered under a policy.\n(b) \"Insurer\" means an insurer providing health, medical, hospitalization, or accident and sickness insurance regulated under this chapter, a nonprofit health services plan corporation regulated under chapter 62C, a health maintenance organization regulated under chapter 62D or a fraternal benefit society regulated under chapter 64B.\n(c) \"Policy\" means a policy or plan of health, medical, hospitalization or accident and sickness insurance, a health maintenance contract, or a health benefit certificate provided by an insurer which provides coverage of, or reimbursement for, hospital, medical, or surgical expenses on a group or individual basis, but does not include a policy designed primarily to provide coverage payable on a per diem, fixed indemnity or nonexpense incurred basis, or a policy that provides only accident coverage.\nNo policy shall be issued or renewed in this state after August 1, 1981 if it provides an exclusion, reduction, or other limitation as to coverage, deductible, coinsurance or co-payment applicable solely to conditions attributable to diethylstilbestrol or exposure to diethylstilbestrol, unless the covered person has been diagnosed as having diethylstilbestrol-related cancer prior to the date on which coverage for that person begins. In the absence of credible evidence of a higher morbidity rate due to exposure to diethylstilbestrol, no insurer shall surcharge or in any other manner increase the premium. If there is credible evidence of a higher morbidity rate due to exposure to diethylstilbestrol, no insurer shall surcharge or in any other manner increase the premium without the prior approval of the commissioner.\nNo insurer shall refuse to issue or renew a policy, or to provide coverage under a policy, in this state after August 1, 1981 solely because of conditions attributable to diethylstilbestrol or exposure to diethylstilbestrol, unless the covered person has been diagnosed as having diethylstilbestrol-related cancer prior to the date on which an initial premium payment is received by the insurer.",
	"repealed": false
}