{
	"id": "116C.724",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.724",
	"title": "116C.724 DRILLING PERMITS; ACCESS TO TEST DATA; PUBLIC MEETINGS; NEGOTIATIONS.",
	"text": "[Repealed, 1Sp1985 c 13 s 245]\nA permit shall be obtained from the Environmental Quality Board, in accordance with chapter 14, for any geologic and hydrologic drilling related to disposal. Conditions of obtaining and retaining the permit must be specified by rule and must include:\n(1) compliance with state drilling and drill hole restoration rules as an exploratory boring under chapter 103I;\n(2) proof that access to the test site has been obtained by a negotiated agreement or other legal process;\n(3) payment by the permittee of a fee covering the costs of processing and monitoring drilling activities;\n(4) unrestricted access by the commissioner of health, the commissioner of natural resources, the commissioner of the Pollution Control Agency, the director of the Minnesota Geological Survey, the agent of a community health board as authorized under section 145A.04, and their employees and agents to the drilling sites to inspect and monitor the drill holes, drilling operations, and abandoned sites, and to sample air and water that may be affected by drilling;\n(5) submission of splits or portions of a core sample, requested by the commissioner of natural resources or director of the Minnesota Geological Survey, except that the commissioner or director may accept certified data on the sample in lieu of a sample if certain samples are required in their entirety by the permittee; and\n(6) that a sample submitted may become property of the state.\n(a) A person who conducts geologic, hydrologic, or geophysical testing or studies shall provide unrestricted access to both raw and interpretive data to the chair and the director of the Minnesota Geological Survey or their designated representatives. The raw and interpretive data includes core samples, well logs, water samples and chemical analyses, survey charts and graphs, and predecisional reports. Studies and data shall be made available within 30 days of a formal request by the chair.\n(b) A person proposing to investigate shall hold at least one public meeting before a required permit is issued, and during the investigation at least once every three months, during the investigation within the potentially impacted area. The meetings shall provide the public with current information on the progress of the investigation. The person investigating shall respond in writing to the Environmental Quality Board about concerns and issues raised at the public meetings.\n(c) Before a person engages in negotiations regarding property interests in land or water, or permitting activities, the person shall notify the chair in writing. Copies of terms and agreements shall also be provided to the chair.",
	"repealed": false
}