{
	"id": "204D.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.25",
	"title": "204D.25 SPECIAL ELECTION BALLOTS.",
	"text": "Except as provided in subdivision 2, the county auditor must prepare separate ballots for a special primary and special election as required by sections 204D.17 to 204D.27. The ballots must be headed \"Special Primary Ballot\" or \"Special Election Ballot\" as the case may be, followed by the date of the special primary or special election. Immediately below the title of each office to be filled must be printed the words \"To fill vacancy in term expiring ..........,\" with the date of expiration of the term and any other information that is necessary to distinguish the office from any other office to be voted upon at the same election. For a special primary or special election, the instructions to voters may use the singular form of the word when referring to candidates and offices when only one office is to be filled at the special election. Otherwise the form of the ballots must comply as far as practicable with the laws relating to ballots for state primaries and state general elections. The county auditor must post a sample of each ballot in the auditor's office as soon as prepared and not later than four days before the special primary or special election. Publication of the notice to voters pursuant to section 204D.16 for a special primary or special election is not required.\nThe county auditor shall place the names of the candidates to fill the vacancy upon the regular ballots used for like offices at the state primary or state general election, designating the office to be filled in the same manner as provided in subdivision 1 for separate special primary or special election ballots if:\n(a) the candidates at the special election are to be voted for on the day of the state general election or are to be nominated on the day of the state primary; and\n(b) the ballots for the state general election or state primary have not been printed when the names of the candidates to be elected or nominated to fill a vacancy have been finally determined.",
	"repealed": false
}