{
	"id": "43A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.11",
	"title": "43A.11 VETERAN'S PREFERENCE.",
	"text": "Recognizing that training and experience in the military services of the government and loyalty and sacrifice for the government are qualifications of merit which cannot be readily assessed by examination, a veteran's preference shall be available pursuant to this section to a veteran as defined in section 197.447.\n[Repealed, 2005 c 95 s 1; 2005 c 156 art 4 s 12]\n[Repealed, 2004 c 207 s 31]\n[Repealed, 2004 c 207 s 31]\nFor the purpose of the preference to be used in securing appointment from an applicant pool, \"disabled veteran\" means a person who has a compensable service connected disability as adjudicated by the United States Veterans Administration, or by the retirement board of one of the several branches of the armed forces, which disability is existing at the time preference is claimed.\nA preference available pursuant to this section may be used by the surviving spouse of a deceased veteran and by the spouse of a disabled veteran who because of the disability is unable to qualify.\nApplicants who meet the minimum qualifications for a vacant position and claim disabled veteran's preference shall be listed in the applicant pool ahead of all other applicants. Applicants who meet the minimum qualifications for a vacant position and claim nondisabled veteran's preference shall be listed in the applicant pool after those claiming disabled veteran's preference and ahead of nonveterans. Each recently separated veteran who meets minimum qualifications for a vacant position and has claimed a veterans or disabled veterans preference must be considered for the position. The top five recently separated veterans must be granted an interview for the position by the hiring authority.\nThe term \"recently separated veteran\" means a veteran, as defined in section 197.447, who has served in active military service, at any time on or after September 11, 2001, and who has been honorably discharged from active service, as shown by the person's form DD-214.\nThe commissioner or an appointing authority, when notifying applicants that they have been accepted into the state's selection process, shall notify applicants that they may elect to use veteran's preference.\nIf the appointing authority rejects a member of the finalist pool who has claimed veteran's preference, the appointing authority shall notify the finalist in writing of the reasons for the rejection.",
	"repealed": false
}