{
	"id": "281.174",
	"url": "https://www.revisor.mn.gov/statutes/cite/281.174",
	"title": "281.174 FIVE-WEEK REDEMPTION PERIOD FOR CERTAIN VACANT PROPERTIES.",
	"text": "This section applies to property located within a city if at any time after the tax sale as provided in section 280.01 has occurred but before notice of expiration of time for redemption has been given, a court order is entered reducing to five weeks the redemption period on property under subdivision 2 during which the owner, the owner's personal representatives and assigns, or any other person holding an interest in the property, may redeem that property in accordance with the provisions of this chapter.\nOnly property that meets all of the following criteria is subject to the five-week redemption period as provided in this section:\n(1) the property is located in a targeted neighborhood revitalization program under section 469.201;\n(2) no structures are located on the land;\n(3) the property is classified under section 273.13 as residential; and\n(4) a residential structure existed on the land within the last five years.\nAny city, county, housing and redevelopment authority, port authority, or economic development authority in which the property is located may commence an action in district court to reduce the period otherwise allowed for redemption under this chapter from the date of the requested order. The action must be commenced by the filing of a complaint, naming as defendants the record fee owners or the owner's personal representative, or the owner's heirs as determined by a court of competent jurisdiction, contract for deed purchasers, mortgagees, assigns of any of the above, the taxpayers as shown on the records of the county auditor, the Internal Revenue Service of the United States and the revenue department of the state of Minnesota if tax liens against the owners or contract for deed purchasers have been recorded or filed, and any other person the plaintiff determines should be made a party. The action shall be filed in district court for the county in which the property is located. The complaint must identify the property by legal description. The complaint must allege (1) that the property is vacant, (2) that the tax judgment sale under section 280.01 has been made, and (3) notice of expiration of the time for redemption has not been given.\nThe complaint must request an order reducing the redemption period to five weeks. When the complaint has been filed, the court shall issue a summons commanding the person or persons named in the complaint to appear before the court on a day and at a place stated in the summons. The appearance date shall be not less than 15 nor more than 25 days from the date of the issuing of the summons, except that, when the United States of America is a party, the date shall be set in accordance with applicable federal law. A copy of the filed complaint must be attached to the summons.\nThe summons and complaint may be served by any person not named a party to the action. The summons and complaint must be served at least seven days before the appearance date, in the manner provided for service of a summons and complaint in a civil action in the district court, and posted in a conspicuous place on the property. If a defendant cannot be found in the state, then upon an affidavit to that effect being filed with the court, the summons and complaint may be served by sending a copy by certified mail to the defendant's last known address, if any, at least ten days before the appearance date. Summons by certified mail is complete upon mailing. If personal or certified mail service cannot be made on a defendant, then the plaintiff or plaintiff's attorney may file an affidavit to that effect with the court and service by posting the summons and complaint on the premises is sufficient as to that defendant.\nAt the hearing on the summons and complaint, the court shall enter an order reducing the redemption period to five weeks from the date of the order, if evidence is presented supporting the allegations in the complaint and no appearance is made to oppose the relief sought. An affidavit from any person having personal knowledge about the property may be filed stating facts supporting any allegations in the complaint. In the absence of affidavits or written statements, or if rebuttal evidence is offered by the defendant or a party lawfully claiming an interest through the defendant, the court may consider any competent evidence, including oral testimony, concerning any allegations in the complaint. An order entered under this section must contain a legal description of the property.\nWithin ten days after the order is entered, a certified copy of the order must be filed by the moving party with the office of the county recorder or registrar of titles and with the auditor for the county in which the property is located. Failure to file the order within ten days shall not invalidate the proceedings.\nIf the property is not redeemed within five weeks of the date of entry of the order the county auditor, without further notice, shall execute a certificate as provided for in section 281.23, subdivision 9.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]",
	"repealed": false
}