{
	"id": "299L.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/299L.03",
	"title": "299L.03 POWERS OF DIRECTOR.",
	"text": "In conducting any inspection authorized under this chapter or chapter 240, 349, or 349A, the division employees have free and open access to all parts of the regulated business premises, and may conduct the inspection at any reasonable time without notice and without a search warrant. For purposes of this subdivision, \"regulated business premises\" means premises where:\n(1) lawful gambling is conducted by an organization licensed under chapter 349 or by an organization exempt from licensing under section 349.166;\n(2) gambling equipment is manufactured, sold, distributed, or serviced by a manufacturer or distributor licensed under chapter 349;\n(3) records required to be maintained under chapter 240, 297E, 349, or 349A are prepared or retained;\n(4) lottery tickets are sold by a lottery retailer under chapter 349A;\n(5) races are conducted by a person licensed under chapter 240; or\n(6) gambling devices are manufactured, distributed, or tested, including places of storage under section 299L.07.\nIn conducting an audit or inspection authorized under this chapter or chapter 240, 349, or 349A the director may inspect any book, record, or other document the licensee, retailer, or vendor is required to keep.\nThe director may issue subpoenas to compel the attendance of witnesses and the production of documents, books, records, and other evidence relating to any investigation or audit the director is authorized to conduct.\nThe director has access to all criminal history data compiled by the Bureau of Criminal Apprehension on any person licensed or under contract with the State Lottery, Racing Commission, or the Gambling Control Board, or any applicant for licensing or a person who has submitted a bid on a lottery contractor or any employee and finalist for employment with the State Lottery.\nThe director may designate certain division employees who are authorized to arrest or investigate any person who is suspected of violating any provision of chapter 240, 349, or 349A, or is suspected of committing any crime involving gambling, and to conduct searches and seizures to enforce any of those laws. Any employee authorized by this subdivision to make an arrest must be licensed under sections 626.84 to 626.863.\n(a) If anyone not licensed under chapter 349 sells gambling equipment at a business establishment, the director may, in addition to any other provisions of chapter 349:\n(1) assess a civil penalty of not more than $300 for each violation against each person participating in the sales and assess a civil penalty of not more than $1,000 for each violation against the owner or owners of the business establishment; or\n(2) if the subject violation is the second or subsequent violation of this subdivision at the same business establishment within any 24-month period, assess a civil penalty of not more than $300 for each violation against each person participating in such sales, and assess a civil penalty of not more than $5,000 for each violation against the owner or owners of the business establishment.\n(b) The assessment of a civil penalty under this section does not preclude a recommendation by the director at any time deemed appropriate to a licensing authority for revocation, suspension, or denial of a license controlled by the licensing authority.\n(c) Within ten days of an assessment under this subdivision, the person assessed the penalty must pay the assessment or request that a hearing be held under chapter 14. If a hearing is requested, the hearing must be scheduled within 20 days of the request, and the recommendations of the administrative law judge must be issued within five working days of the close of the hearing. The director's final determination must be issued within five working days of the issuance of the recommendations of the administrative law judge.\nNothing in this chapter limits the authority of the division to exercise any other power specified under chapter 240, 340A, 349, or 349A.\nThe commissioner may adopt rules under chapter 14 to carry out the commissioner's duties under this chapter.\nMS 1991 [Repealed, 1990 c 590 art 1 s 48]\nThe director may require that any: (1) licensee under sections 349.11 to 349.23, (2) employee of such a licensee, or (3) shareholder or officer of such a licensee be fingerprinted by the director, or otherwise submit to fingerprinting in a form and manner acceptable to the director.\n(a) Data provided to the director, by a governmental entity located outside Minnesota for use in an authorized investigation, audit, or background check, has the same data access classification or restrictions on access, for the purposes of chapter 13, that it had in the entity providing it. If the classification or restriction on access in the entity providing the data is less restrictive than the Minnesota data classification, the Minnesota classification applies.\n(b) Data classified as not public by this section are only discoverable as follows:\n(1) the data are subject to discovery in a legal proceeding; and\n(2) the data are discoverable in a civil or administrative proceeding if the subject matter of the proceeding is a final agency decision adverse to the party seeking discovery of the data.\n(a) When it appears to the director that any person has engaged in or is about to engage in any act or practice constituting a violation of this chapter, or any rule or order issued under this chapter, the director may issue and cause to be served on the person an order requiring the person to cease and desist from violations of this chapter, or any rule or order issued under this chapter. The order must give reasonable notice of the rights of the person to request a hearing and must state the reason for the entry of the order. Unless otherwise agreed between the parties, a hearing must be held not later than seven days after receiving the request for a hearing. Within 20 days of receiving the administrative law judge's report and subsequent exceptions and argument, the director shall issue an order vacating the cease and desist order, modifying the order, or making it permanent, as the facts require. If no hearing is requested within 30 days of service of the order, the order becomes final and remains in effect until modified or vacated by the commissioner. All hearings under this subdivision must be conducted in accordance with sections 14.57 to 14.69 of the Administrative Procedure Act. If the person to whom a cease and desist order has been issued under this subdivision fails to appear at a hearing after being notified of the hearing, the person is deemed in default and the proceeding may be determined against the person on consideration of the cease and desist order, the allegations of which are deemed to be true.\n(b) When it appears to the director that any person has engaged in or is about to engage in any act or practice constituting a violation of this chapter, or any rule adopted or subpoena or order issued under this chapter, the director may bring an action in the district court in the appropriate county to enjoin the acts or practices and to enforce compliance with this chapter or any rule, subpoena, or order issued or adopted under this chapter, and may refer the matter to the attorney general. On a proper showing, the court shall grant a permanent or temporary injunction, restraining order, or writ of mandamus. The court may not require the director to post a bond.",
	"repealed": false
}