{
	"id": "13.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.08",
	"title": "13.08 CIVIL REMEDIES.",
	"text": "Notwithstanding section 466.03, a responsible authority or government entity which violates any provision of this chapter is liable to a person or representative of a decedent who suffers any damage as a result of the violation, and the person damaged or a representative in the case of private data on decedents or confidential data on decedents may bring an action against the responsible authority or government entity to cover any damages sustained, plus costs and reasonable attorney fees. In the case of a willful violation, the government entity shall, in addition, be liable to exemplary damages of not less than $1,000, nor more than $15,000 for each violation. The state is deemed to have waived any immunity to a cause of action brought under this chapter.\nA responsible authority or government entity which violates or proposes to violate this chapter may be enjoined by the district court. The court may make any order or judgment as may be necessary to prevent the use or employment by any person of any practices which violate this chapter.\nAn action filed pursuant to this section may be commenced in the county in which the individual alleging damage or seeking relief resides, or in the county wherein the political subdivision exists, or, in the case of the state, any county.\n(a) Actions to compel compliance may be brought either under this subdivision or section 13.085. For actions under this subdivision, in addition to the remedies provided in subdivisions 1 to 3 or any other law, any aggrieved person seeking to enforce the person's rights under this chapter or obtain access to data may bring an action in district court to compel compliance with this chapter and may recover costs and disbursements, including reasonable attorney's fees, as determined by the court. If the court determines that an action brought under this subdivision is frivolous and without merit and a basis in fact, it may award reasonable costs and attorney fees to the responsible authority. If the court issues an order to compel compliance under this subdivision, the court may impose a civil penalty of up to $1,000 against the government entity. This penalty is payable to the state general fund and is in addition to damages under subdivision 1. The matter shall be heard as soon as possible. In an action involving a request for government data under section 13.03 or 13.04, the court may inspect in camera the government data in dispute, but shall conduct its hearing in public and in a manner that protects the security of data classified as not public. If the court issues an order to compel compliance under this subdivision, the court shall forward a copy of the order to the commissioner of administration.\n(b) In determining whether to assess a civil penalty under this subdivision, the court or other tribunal shall consider whether the government entity has substantially complied with general data practices under this chapter, including but not limited to, whether the government entity has:\n(1) designated a responsible authority under section 13.02, subdivision 16;\n(2) designated a data practices compliance official under section 13.05, subdivision 13;\n(3) prepared the data inventory that names the responsible authority and describes the records and data on individuals that are maintained by the government entity under section 13.025, subdivision 1;\n(4) developed public access procedures under section 13.03, subdivision 2; procedures to guarantee the rights of data subjects under section 13.025, subdivision 3; and procedures to ensure that data on individuals are accurate and complete and to safeguard the data's security under section 13.05, subdivision 5;\n(5) acted in conformity with an opinion issued under section 13.072 that was sought by a government entity or another person; or\n(6) provided ongoing training to government entity personnel who respond to requests under this chapter.\n(c) The court shall award reasonable attorney fees to a prevailing plaintiff who has brought an action under this subdivision if the government entity that is the defendant in the action was also the subject of a written opinion issued under section 13.072 and the court finds that the opinion is directly related to the cause of action being litigated and that the government entity did not act in conformity with the opinion.\nA government entity or person that releases not public data pursuant to an order under section 13.03, subdivision 6, is immune from civil and criminal liability.\nNo cause of action may arise as a result of the release of data contained in a termination or personnel settlement agreement if the data were not public data as defined in section 13.02, at the time the agreement was executed but become public data under a law enacted after execution.",
	"repealed": false
}