{
	"id": "326B.184",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.184",
	"title": "326B.184 FEES FOR LICENSURE AND PERMIT.",
	"text": "No person may construct, install, alter, repair, or remove an elevator without first filing an application for a permit with the department or a municipality authorized by subdivision 4 to inspect elevators. A permit issued by the department is valid for work commenced within 12 months of application and completed within two years of application. Where no work is commenced within 12 months of application, an applicant may cancel the permit and request a refund of inspection fees.\n(a) The department permit and inspection fees to construct, install, alter, repair, or remove an elevator are as follows:\n(1) the permit fee is $100;\n(2) the inspection fee is 0.015 of the total cost of the permitted work for labor and materials, including related electrical and mechanical equipment. The inspection fee covers two inspections. The inspection fee for additional inspections is $80 per hour;\n(3) when inspections scheduled by the permit submitter are not able to be completed because the work is not complete, a fee equal to two hours at the hourly rate of $80 must be paid by the permit submitter; and\n(4) when the owner or permit holder requests inspections be performed outside of normal work hours or on weekends or holidays, an hourly rate of $120 in addition to the inspection fee must be paid.\n(b) The department fees for inspection of existing elevators when requested by the elevator owner or as a result of an accident resulting in personal injury are at an hourly rate of $80 during normal work hours or $120 outside of normal work hours or on weekends or holidays, with a one-hour minimum.\n(a) No person may operate an elevator without first obtaining an annual operating permit from the department or a municipality authorized by subdivision 4 to issue annual operating permits. A $100 annual operating permit fee must be paid to the department for each annual operating permit issued by the department, except that the original annual operating permit must be included in the permit fee for the initial installation of the elevator. Annual operating permits must be issued at 12-month intervals from the date of the initial annual operating permit. For each subsequent year, an owner must be granted an annual operating permit for the elevator upon the owner's or owner's agent's submission of a form prescribed by the commissioner and payment of the $100 fee. Each form must include the location of the elevator, the results of any periodic test required by the code, and any other criteria established by rule. An annual operating permit may be revoked by the commissioner upon an audit of the periodic testing results submitted with the application or a failure to comply with elevator code requirements, inspections, or any other law related to elevators. Except for an initial operating permit fee, elevators in residential dwellings, hand-powered manlifts and electric endless belt manlifts, and vertical reciprocating conveyors are not subject to a subsequent operating permit fee.\n(b) All elevators are subject to periodic inspections by the department or a municipality authorized by subdivision 4 to perform periodic inspections, except that hand-powered manlifts and electric endless belt manlifts are exempt from periodic inspections. Periodic inspections by the department shall be performed at the following intervals:\n(1) a special purpose personnel elevator is subject to inspection not more than once every five years;\n(2) an elevator located within a house of worship that does not have attached school facilities is subject to inspection not more than once every three years; and\n(3) all other elevators are subject to inspection not more than once each year.\nThe commissioner may establish criteria for the qualifications of elevator contractors and issue licenses based upon proof of the applicant's qualifications.\nA municipality may conduct a system of elevator inspection in conformity with this chapter, State Building Code requirements, and adopted rules that includes the inspection of elevator installation, repair, alteration, and removal, construction, routine and periodic inspection and testing of existing elevators, and the issuance of annual operating permits. The municipality shall employ inspectors meeting the minimum requirements established by Minnesota Rules to perform the inspections and to witness the tests. A municipality may establish and retain its own fees for inspection of elevators and related devices in its jurisdiction. A municipality may establish and retain its own fees for issuance of annual operating permits for elevators in its jurisdiction. A municipality may not adopt standards that do not conform to the uniform standards prescribed by the department.\nIf the commissioner determines that a municipality is not properly administering and enforcing the law, rules, and codes, the commissioner shall have the inspection, administration, and enforcement undertaken by a qualified inspector employed by the department.",
	"repealed": false
}