{
	"id": "3.8845",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8845",
	"title": "3.8845 LEGISLATIVE COMMISSION ON HOUSING AFFORDABILITY.",
	"text": "(a) The Legislative Commission on Housing Affordability consists of:\n(1) two senators appointed by the senate majority leader;\n(2) two senators appointed by the senate minority leader;\n(3) two representatives appointed by the speaker of the house; and\n(4) two representatives appointed by the minority leader of the house of representatives.\n(b) Each appointing authority must make appointments by January 31 of the regular legislative session in the odd-numbered year.\nThe ranking senator from the majority party appointed to the commission must convene the first meeting of a biennium by February 15 in the odd-numbered year.\nMembers of the commission serve for terms beginning upon appointment and ending at the beginning of the regular legislative session in the next odd-numbered year. The appropriate appointing authority must fill a vacancy for a seat of a current legislator for the remainder of the unexpired term.\nThe commission must elect a chair and may elect other officers as it determines are necessary at the first meeting of the commission in an odd-numbered year. The chair alternates between a member of the senate and a member of the house of representatives at the start of the regular legislative session in each odd-numbered year.\nThe Legislative Coordinating Commission must provide administrative and research assistance to the commission.\nThe commission shall:\n(1) define housing affordability and study issues relating to housing affordability and the construction, preservation, and rehabilitation of owner-occupied and rental housing, including subsidized housing, existing and future government regulations impacting housing affordability, market forces impacting housing affordability, and access to homeownership;\n(2) review and provide the legislature with research and analysis of emerging issues affecting housing affordability and homeownership access, including but not limited to construction work force, innovation, building practices, and building material costs;\n(3) review and provide the legislature with research and analysis of policies to reduce the homeownership equity gap; and\n(4) review and make recommendations on legislative and rulemaking proposals positively impacting personal housing affordability, access to homeownership, and other related barriers to homeownership, especially with regard to first-time home buyers and economically disadvantaged buyers and renters.\nThis section expires June 30, 2023.",
	"repealed": false
}