{
	"id": "260C.209",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.209",
	"title": "260C.209 BACKGROUND CHECKS.",
	"text": "The responsible social services agency may have access to the criminal history and history of child and adult maltreatment on the following individuals:\n(1) a noncustodial parent or nonadjudicated parent who is being assessed for purposes of providing day-to-day care of a child temporarily or permanently under section 260C.219 and any member of the parent's household who is over the age of 13 when there is a reasonable cause to believe that the parent or household member over age 13 has a criminal history or a history of maltreatment of a child or vulnerable adult that would endanger the child's health, safety, or welfare;\n(2) an individual and any member of the individual's household who is over the age of 13 when:\n(i) the individual is being considered for relative placement under section 260C.221;\n(ii) the background study is required under section 259.53, subdivision 2; or\n(iii) a petition to transfer permanent legal and physical custody to the relative has been filed according to section 260C.515, subdivision 4, paragraph (d), and the relative is not pursuing Northstar kinship assistance eligibility for the child under chapter 256N; and\n(3) a parent, following an out-of-home placement, when the responsible social services agency has reasonable cause to believe that the parent has been convicted of a crime directly related to the parent's capacity to maintain the child's health, safety, or welfare or the parent is the subject of an open investigation of, or has been the subject of a substantiated allegation of, child or vulnerable-adult maltreatment within the past ten years.\n\"Reasonable cause\" means that the agency has received information or a report from the subject or a third person that creates an articulable suspicion that the individual has a history that may pose a risk to the health, safety, or welfare of the child. The information or report must be specific to the potential subject of the background check and must not be based on the race, religion, ethnic background, age, class, or lifestyle of the potential subject.\n(a) When accessing information under subdivision 1, the agency shall require the individual being assessed to provide sufficient information to ensure an accurate assessment under this section, including:\n(1) the individual's first, middle, and last name and all other names by which the individual has been known;\n(2) home address, zip code, city, county, and state of residence for the past five years;\n(3) sex;\n(4) date of birth; and\n(5) driver's license number or state identification number.\n(b) When notified by the responsible social services agency that it is accessing information under subdivision 1, the Bureau of Criminal Apprehension, commissioners of health and human services, law enforcement, and county agencies must provide the responsible social services agency or county attorney with the following information on the individual being assessed: criminal history data, local law enforcement data about the household, reports about the maltreatment of adults substantiated under section 626.557, and reports of maltreatment of minors substantiated under chapter 260E.\nIn cases involving the emergency relative placement of children under section 142B.06, the social services agency or county attorney may request a name-based check of the National Criminal Records Repository. In those cases, fingerprints of the individual being checked must be forwarded to the Bureau of Criminal Apprehension for submission to the Federal Bureau of Investigation within 15 calendar days of the name-based check. If the subject of the name-based check does not provide fingerprints upon request, the child or children must be removed from the home.\n[Repealed, 2009 c 163 art 1 s 9]\nThe responsible social services agency may obtain household members' criminal history and the history of maltreatment of a child or adult and use the history to assess whether putting the child in the household would endanger the child's health, safety, or welfare and to assess the suitability of a relative prior to an emergency placement. This assessment does not substitute for the background study required under chapter 245C and does not supersede requirements related to emergency placement under section 142B.06.",
	"repealed": false
}