{
	"id": "169.999",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.999",
	"title": "169.999 ADMINISTRATIVE CITATIONS FOR CERTAIN TRAFFIC OFFENSES.",
	"text": "(a) Except for peace officers employed by the state patrol, prior to a peace officer issuing an administrative citation under this section, the governing body for the local unit of government that employs the peace officer must pass a resolution that:\n(1) authorizes issuance of administrative citations;\n(2) obligates the local unit of government to provide a neutral third party to hear and rule on challenges to administrative citations; and\n(3) bars peace officers from issuing administrative citations in violation of this section.\n(b) A peace officer may issue an administrative citation to a vehicle operator who:\n(1) violates section 169.14, and the violation consists of a speed under ten miles per hour in excess of the lawful speed limit;\n(2) fails to obey a stop line in violation of section 169.30; or\n(3) operates a vehicle that is in violation of sections 169.46 to 169.68 and 169.69 to 169.75.\n(c) The authority to issue an administrative citation is exclusively limited to those offenses listed in this subdivision.\n(d) A peace officer who issues an administrative citation for the infraction of speeding under ten miles per hour over the speed limit must use the actual speed a violator's vehicle was traveling at the time of the infraction and may not reduce the recorded speed for purposes of qualifying the offense for an administrative citation. An administrative citation issued for speeding must list the actual speed the vehicle was traveling at the time of the infraction.\n(e) A local unit of government shall notify the commissioner of public safety after it passes a resolution described in paragraph (a).\nThe authority to issue an administrative citation is reserved exclusively to licensed peace officers. An officer may not be required by ordinance or otherwise to issue a citation under this section instead of a criminal citation.\nThere must be a uniform administrative citation issued throughout the state by licensed peace officers for violations of this section. No other citation is authorized for violations of this section. The commissioner of public safety shall prescribe the detailed form of the uniform administrative citation and shall revise the uniform administrative citation on such subsequent occasions as necessary and proper. The uniform administrative citation must include notification that the person has the right to contest the citation.\n(a) A peace officer who issues an administrative citation must inform the vehicle operator that the person has the right to contest the citation.\n(b) Except as provided in paragraph (c), the local unit of government that employs the peace officer who issues an administrative citation must provide a civil process for a person to contest the administrative citation. The person must be allowed to challenge the citation before a neutral third party. A local unit of government may employ a person to hear and rule on challenges to administrative citations or contract with another local unit of government or a private entity to provide the service.\n(c) The state patrol may contract with local units of government or private entities to collect administrative fines and to provide a neutral third party to hear and rule on challenges to administrative citations. An administrative citation issued by a state patrol trooper must clearly state how and where a violator can challenge the citation.\n(a) A person who commits an administrative violation under subdivision 1 must pay a fine of $60.\n(b) Except as provided in paragraph (c), two-thirds of a fine collected under this section must be credited to the general revenue fund of the local unit of government that employs the peace officer who issued the citation and one-third must be transferred to the commissioner of management and budget to be deposited in the state general fund. A local unit of government receiving fine proceeds under this section must use at least one-half of the funds for law enforcement purposes. The funds must be used to supplement but not supplant any existing law enforcement funding.\n(c) For fines collected under this section from administrative citations issued by state patrol troopers, one-third must be credited to the general fund of the local unit of government or entity that collects the fine and provides a hearing officer and two-thirds must be transferred to the commissioner of management and budget to be deposited in the state general fund.\nAn administrative citation may not be issued under this section to (1) the holder of a commercial driver's license, or (2) the driver of a commercial vehicle in which the administrative violation was committed.\nA violation under this section may not be recorded by the Department of Public Safety on the violator's driving record and does not constitute grounds for revocation or suspension of the violator's driver's license.\n(a) A county, statutory or home rule city, or town that employs peace officers who issue administrative citations and that collects administrative fines under this section must include that information and the amount collected as separate categories in any financial report, summary, or audit.\n(b) The state auditor shall annually report to the commissioner of public safety information concerning administrative fines collected by local units of government under this section. Upon request, the commissioner of public safety shall report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over criminal justice policy and funding summarizing the reports the commissioner received under this paragraph.\nThe authority to issue an administrative citation is exclusively limited to those offenses listed in subdivision 1. Notwithstanding any contrary charter provision or ordinance, no statutory or home rule charter city, county, or town may impose administrative penalties to enforce any other provision of this chapter.",
	"repealed": false
}