{
	"id": "345.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/345.41",
	"title": "345.41 REPORT OF ABANDONED PROPERTY.",
	"text": "(a) Every person holding funds or other property, tangible or intangible, presumed abandoned under sections 345.31 to 345.60 shall report annually to the commissioner with respect to the property as hereinafter provided.\n(b) The report shall be verified and shall include:\n(1) a description of the property, including whether the property is interest-bearing, and, if so, the rate of interest;\n(2) except with respect to traveler's checks and money orders, the name, if known, and last known address, if any, of each person appearing from the records of the holder to be the owner of any property of the value of $100 or more presumed abandoned under sections 345.31 to 345.60;\n(3) in case of unclaimed funds of life insurance corporations, the full name of the policyholder, insured or annuitant and that person's last known address according to the life insurance corporation's records;\n(4) the nature and identifying number, if any, or description of the property and the amount appearing from the records to be due, except that items of value under $100 each may be reported in aggregate;\n(5) the date when the property became payable, demandable or returnable, and the date of the last transaction with the owner with respect to the property; and\n(6) other information which the commissioner prescribes by rule as necessary for the administration of sections 345.31 to 345.60.\n(c) If the person holding property presumed abandoned is a successor to other persons who previously held the property for the owner, or if the holder has changed a name while holding the property, the holder shall file with the report all prior known names and addresses of each holder of the property.\n(d) The report shall be filed before November 1 of each year as of June 30 next preceding, but the report of life insurance corporations shall be filed before October 1 of each year as of December 31 next preceding. The commissioner may postpone the reporting date upon written request by any person required to file a report.\n(e) Not more than 120 days before filing the report required by this section, the holder in possession of property abandoned and subject to custody as unclaimed property under this chapter shall send written notice to the presumed owner at that owner's last known address informing the owner that the holder is in possession of property subject to this chapter and advising the owner of the steps necessary to prevent abandonment if:\n(1) the holder has in its records an address for the presumed owner that the holder's records do not disclose to be inaccurate;\n(2) the claim of the apparent owner is not barred by the statute of limitations; and\n(3) the property has a value of $100 or more.\n(f) Verification, if made by a partnership, shall be executed by a partner; if made by an unincorporated association or private corporation, by an officer, and if made by a public corporation, by its chief fiscal officer.\n(g) Holders of property described in section 345.32 shall not impose any charges against property which is described in section 345.32, clause (a), (b) or (c).\n(h) Any person who has possession of property which the person has reason to believe will be reportable in the future as unclaimed property may, with the permission of the commissioner, report and deliver such property prior to the date required for reporting in accordance with this section.\n(i) Before the last day of each calendar year, the commissioner of revenue shall report to the commissioner as unclaimed property under this section any uncashed checks or warrants for overpayments of taxes that were issued more than two years preceding the date of the report.",
	"repealed": false
}