{
	"id": "289A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.11",
	"title": "289A.11 FILING REQUIREMENTS FOR SALES AND USE TAX RETURNS.",
	"text": "(a) Except as provided in section 289A.18, subdivision 4, for the month in which taxes imposed by chapter 297A are payable, or for which a return is due, a return for the preceding reporting period must be filed with the commissioner. The commissioner shall prescribe the content, format, and manner of the returns pursuant to section 270C.30. A person making sales at retail at two or more places of business may file a consolidated return subject to rules prescribed by the commissioner. In computing the dollar amount of items on the return, the amounts are rounded off to the nearest whole dollar, disregarding amounts less than 50 cents and increasing amounts of 50 cents to 99 cents to the next highest dollar.\n(b) Notwithstanding this subdivision, a person who is not required to hold a sales tax permit under chapter 297A and who makes annual purchases, for use in a trade or business, of less than $18,500, or a person who is not required to hold a sales tax permit and who makes purchases for personal use, that are subject to the use tax imposed by section 297A.63, may file an annual use tax return. The commissioner shall prescribe the content, format, and manner of the return pursuant to section 270C.30. If a person who qualifies for an annual use tax reporting period is required to obtain a sales tax permit or makes use tax purchases, for use in a trade or business, in excess of $18,500 during the calendar year, the reporting period must be considered ended at the end of the month in which the permit is applied for or the purchase in excess of $18,500 is made and a return must be filed for the preceding reporting period.\n(c) Notwithstanding paragraphs (a) and (b), a person prohibited by the person's religious beliefs from using electronics shall be allowed to file by mail, without any additional fees. The filer must notify the commissioner of revenue of the intent to file by mail on a form prescribed by the commissioner. A return filed under this paragraph must be postmarked no later than the day the return is due in order to be considered filed on a timely basis.\n[Repealed, 2008 c 277 art 1 s 98]\nFor purposes of the sales tax, a return must be filed by a retailer who is required to hold a permit. For the purposes of the use tax, a return must be filed by a retailer required to collect the tax and by a person buying any items, the storage, use or other consumption of which is subject to the use tax, who has not paid the use tax to a retailer required to collect the tax. The returns must be signed by the person filing the return or by the person's agent duly authorized in writing.",
	"repealed": false
}