{
	"id": "145.1621",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.1621",
	"title": "145.1621 DISPOSITION OF ABORTED OR MISCARRIED FETUSES.",
	"text": "The purpose of this section is to protect the public health and welfare by providing for the dignified and sanitary disposition of the remains of aborted or miscarried human fetuses in a uniform manner and to declare violations of this section to be a public nuisance.\nFor the purposes of this section, the term \"remains of a human fetus\" means the remains of the dead offspring of a human being that has reached a stage of development so that there are cartilaginous structures, fetal or skeletal parts after an abortion or miscarriage, whether or not the remains have been obtained by induced, spontaneous, or accidental means.\nRemains of a human fetus resulting from an abortion or miscarriage, induced or occurring accidentally or spontaneously at a hospital, clinic, or medical facility must be deposited or disposed of in this state only at the place and in the manner provided by this section or, if not possible, as directed by the commissioner of health.\nHospitals, clinics, and medical facilities in which abortions are induced or occur spontaneously or accidentally and laboratories to which the remains of human fetuses are delivered must provide for the disposal of the remains by cremation, interment by burial, or in a manner directed by the commissioner of health. The hospital, clinic, medical facility, or laboratory may complete laboratory tests necessary for the health of the woman or her future offspring or for purposes of a criminal investigation or determination of parentage prior to disposing of the remains.\nFailure to comply with this section constitutes a public nuisance. A person, firm, or corporation failing to comply with this section is guilty of a misdemeanor.\nTo comply with this section, a religious service or ceremony is not required as part of the disposition of the remains of a human fetus, and no discussion of the method of disposition is required with the woman obtaining an induced abortion.",
	"repealed": false
}