{
	"id": "298.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.221",
	"title": "298.221 RECEIPTS FROM CONTRACTS; APPROPRIATION.",
	"text": "(a) Except as provided in paragraph (c), all money paid to the state of Minnesota pursuant to the terms of any contract entered into by the state under authority of section 298.22 and any fees which may, in the discretion of the commissioner of Iron Range resources and rehabilitation, be charged in connection with any project pursuant to that section as amended, shall be deposited in the state treasury to the credit of the Iron Range resources and rehabilitation account in the special revenue fund and are hereby appropriated for the purposes of section 298.22.\n(b) Notwithstanding section 16A.013, merchandise may be accepted by the commissioner of the Iron Range resources and rehabilitation for payment of advertising contracts if the commissioner determines that the merchandise can be used for special event prizes or mementos at facilities operated by the commissioner. Nothing in this paragraph authorizes the commissioner or a member of the advisory board to receive merchandise for personal use.\n(c) All fees charged by the commissioner in connection with public use of the state-owned ski and golf facilities at the Giants Ridge Recreation Area and all other revenues derived by the commissioner from the operation or lease of those facilities and from the lease, sale, or other disposition of undeveloped lands at the Giants Ridge Recreation Area must be deposited into an Iron Range resources and rehabilitation account that is created within the state enterprise fund. All funds deposited in the enterprise fund account are appropriated to the commissioner, and may only be used, after consultation with the advisory board, as follows:\n(1) to pay costs associated with the construction, equipping, operation, repair, or improvement of the Giants Ridge Recreation Area facilities or lands;\n(2) to pay principal, interest and associated bond issuance, reserve, and servicing costs associated with the financing of the facilities; and\n(3) to pay the costs of any other project authorized under section 298.22.",
	"repealed": false
}