{
	"id": "256B.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.095",
	"title": "256B.095 QUALITY ASSURANCE SYSTEM ESTABLISHED.",
	"text": "(a) Effective July 1, 1998, a quality assurance system for persons with developmental disabilities, which includes an alternative quality assurance licensing system for programs, is established in Dodge, Fillmore, Freeborn, Goodhue, Houston, Mower, Olmsted, Rice, Steele, Wabasha, and Winona Counties for the purpose of improving the quality of services provided to persons with developmental disabilities. A county, at its option, may choose to have all programs for persons with developmental disabilities located within the county licensed under chapter 245A using standards determined under the alternative quality assurance licensing system or may continue regulation of these programs under the licensing system operated by the commissioner.\n(b) Effective July 1, 2003, a county not listed in paragraph (a) may apply to participate in the quality assurance system established under paragraph (a). The commission established under section 256B.0951 may, at its option, allow additional counties to participate in the system.\n(c) Effective July 1, 2003, any county or group of counties not listed in paragraph (a) may establish a quality assurance system under this section. A new system established under this section shall have the same rights and duties as the system established under paragraph (a). A new system shall be governed by a commission under section 256B.0951. The commissioner shall appoint the initial commission members based on recommendations from advocates, families, service providers, and counties in the geographic area included in the new system. Counties that choose to participate in a new system shall have the duties assigned under section 256B.0952. The new system shall establish a quality assurance process under section 256B.0953. The provisions of section 256B.0954 shall apply to a new system established under this paragraph. The commissioner shall delegate authority to a new system established under this paragraph according to section 256B.0955.\n(d) Effective July 1, 2007, the quality assurance system may be expanded to include programs for persons with disabilities and older adults.\n(e) Effective July 1, 2013, a provider of service located in a county listed in paragraph (a) that is a non-opted-in county may opt in to the quality assurance system provided the county where services are provided indicates its agreement with a county with a delegation agreement with the Department of Human Services.",
	"repealed": false
}