{
	"id": "62J.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.301",
	"title": "62J.301 RESEARCH AND DATA INITIATIVES.",
	"text": "(a) For purposes of sections 62J.2930 to 62J.42, the following definitions apply:\n(b) \"Health outcomes data\" means data used in research designed to identify and analyze the outcomes and costs of alternative interventions for a given clinical condition, in order to determine the most appropriate and cost-effective means to prevent, diagnose, treat, or manage the condition, or in order to develop and test methods for reducing inappropriate or unnecessary variations in the type and frequency of interventions.\n(c) \"Encounter level data\" means data related to the utilization of health care services by, and the provision of health care services to individual patients, enrollees, or insureds, including claims data, abstracts of medical records, and data from patient interviews and patient surveys.\nThe commissioner of health shall conduct data and research initiatives in order to monitor and improve the efficiency and effectiveness of health care in Minnesota.\nThe commissioner shall:\n(1) collect and maintain data which enable population-based monitoring and trending of the access, utilization, quality, and cost of health care services within Minnesota;\n(2) collect and maintain data for the purpose of estimating total Minnesota health care expenditures and trends;\n(3) collect and maintain data for the purposes of setting cost containment goals under section 62J.04, and measuring cost containment goal compliance;\n(4) conduct applied research using existing and new data and promote applications based on existing research;\n(5) develop and implement data collection procedures to ensure a high level of cooperation from health care providers and health plan companies, as defined in section 62Q.01, subdivision 4;\n(6) work closely with health plan companies and health care providers to promote improvements in health care efficiency and effectiveness; and\n(7) participate as a partner or sponsor of private sector initiatives that promote publicly disseminated applied research on health care delivery, outcomes, costs, quality, and management.\n(a) The data collected may include health outcomes data, patient functional status, and health status. The data collected may include information necessary to measure and make adjustments for differences in the severity of patient condition across different health care providers, and may include data obtained directly from the patient or from patient medical records, as provided in section 62J.321, subdivision 1.\n(b) The commissioner may:\n(1) collect the encounter level data required for the research and data initiatives of sections 62J.301 to 62J.42, using, to the greatest extent possible, standardized forms and procedures; and\n(2) process the data collected to ensure validity, consistency, accuracy, and completeness, and as appropriate, merge data collected from different sources.\n(c) For purposes of estimating total health care spending and forecasting rates of growth in health care spending, the commissioner may collect from health care providers data on patient revenues and health care spending during a time period specified by the commissioner. The commissioner may also collect data on health care revenues and spending from group purchasers of health care. Health care providers and group purchasers doing business in the state shall provide the data requested by the commissioner at the times and in the form specified by the commissioner. Professional licensing boards and state agencies responsible for licensing, registering, or regulating providers and group purchasers shall cooperate fully with the commissioner in achieving compliance with the reporting requirements.\nNothing in this chapter shall be construed to limit the powers granted to the commissioner of health under chapter 62D, 62N, 144, or 144A.",
	"repealed": false
}