{
	"id": "62A.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.021",
	"title": "62A.021 HEALTH CARE POLICY RATES.",
	"text": "(a) Notwithstanding section 62A.02, subdivision 3, relating to loss ratios, and except as otherwise authorized by section 62A.02, subdivision 3a, for individual policies or certificates, health care policies or certificates shall not be delivered or issued for delivery to an individual or to a small employer as defined in section 62L.02, unless the policies or certificates can be expected, as estimated for the entire period for which rates are computed to provide coverage, to return to Minnesota policyholders and certificate holders in the form of aggregate benefits not including anticipated refunds or credits, provided under the policies or certificates, (1) at least 75 percent of the aggregate amount of premiums earned in the case of policies issued in the small employer market, as defined in section 62L.02, subdivision 27, calculated on an aggregate basis; and (2) at least 65 percent of the aggregate amount of premiums earned in the case of each policy form or certificate form issued in the individual market; calculated on the basis of incurred claims experience or incurred health care expenses where coverage is provided by a health maintenance organization on a service rather than reimbursement basis and earned premiums for the period and according to accepted actuarial principles and practices. Assessments by the reinsurance association created in chapter 62L and all types of taxes, surcharges, or assessments created by Laws 1992, chapter 549, or created on or after April 23, 1992, are included in the calculation of incurred claims experience or incurred health care expenses. The applicable percentage for policies and certificates issued in the small employer market, as defined in section 62L.02, increases by one percentage point on July 1 of each year, beginning on July 1, 1994, until an 82 percent loss ratio is reached on July 1, 2000. The applicable percentage for policy forms and certificate forms issued in the individual market increases by one percentage point on July 1 of each year, beginning on July 1, 1994, until a 72 percent loss ratio is reached on July 1, 2000. A health carrier that enters a market after July 1, 1993, does not start at the beginning of the phase-in schedule and must instead comply with the loss ratio requirements applicable to other health carriers in that market for each time period. Premiums earned and claims incurred in markets other than the small employer and individual markets are not relevant for purposes of this section.\n(b) All filings of rates and rating schedules shall demonstrate that actual expected claims in relation to premiums comply with the requirements of this section when combined with actual experience to date. Filings of rate revisions shall also demonstrate that the anticipated loss ratio over the entire future period for which the revised rates are computed to provide coverage can be expected to meet the appropriate loss ratio standards, and aggregate loss ratio from inception of the policy form or certificate form shall equal or exceed the appropriate loss ratio standards.\n(c) A health carrier that issues health care policies and certificates to individuals or to small employers, as defined in section 62L.02, in this state shall file annually its rates, rating schedule, and supporting documentation including ratios of incurred losses to earned premiums by policy form or certificate form duration for approval by the commissioner according to the filing requirements and procedures prescribed by the commissioner. The supporting documentation shall also demonstrate in accordance with actuarial standards of practice using reasonable assumptions that the appropriate loss ratio standards can be expected to be met over the entire period for which rates are computed. The demonstration shall exclude active life reserves. If the data submitted does not confirm that the health carrier has satisfied the loss ratio requirements of this section, the commissioner shall notify the health carrier in writing of the deficiency. The health carrier shall have 30 days from the date of the commissioner's notice to file amended rates that comply with this section. If the health carrier fails to file amended rates within the prescribed time, the commissioner shall order that the health carrier's filed rates for the nonconforming policy form or certificate form be reduced to an amount that would have resulted in a loss ratio that complied with this section had it been in effect for the reporting period of the supplement. The health carrier's failure to file amended rates within the specified time or the issuance of the commissioner's order amending the rates does not preclude the health carrier from filing an amendment of its rates at a later time. The commissioner shall annually make the submitted data available to the public at a cost not to exceed the cost of copying. The data must be compiled in a form useful for consumers who wish to compare premium charges and loss ratios.\n(d) Each sale of a policy or certificate that does not comply with the loss ratio requirements of this section is an unfair or deceptive act or practice in the business of insurance and is subject to the penalties in sections 72A.17 to 72A.32.\n(e)(1) For purposes of this section, health care policies issued as a result of solicitations of individuals through the mail or mass media advertising, including both print and broadcast advertising, shall be treated as individual policies.\n(2) For purposes of this section, (i) \"health care policy\" or \"health care certificate\" is a health plan as defined in section 62A.011; and (ii) \"health carrier\" has the meaning given in section 62A.011 and includes all health carriers delivering or issuing for delivery health care policies or certificates in this state or offering these policies or certificates to residents of this state.\n(f) The loss ratio phase-in as described in paragraph (a) does not apply to individual policies and small employer policies issued by a health plan company that is assessed less than three percent of the total annual amount assessed by the Minnesota Comprehensive Health Association. These policies must meet a 68 percent loss ratio for individual policies, a 71 percent loss ratio for small employer policies with fewer than ten employees, and a 75 percent loss ratio for all other small employer policies.\n(g) Notwithstanding paragraphs (a) and (f), the loss ratio shall be 60 percent for a health plan as defined in section 62A.011, offered by an insurance company licensed under chapter 60A that is assessed less than ten percent of the total annual amount assessed by the Minnesota Comprehensive Health Association. For purposes of the percentage calculation of the association's assessments, an insurance company's assessments include those of its affiliates.\n(h) The commissioners of commerce and health shall each annually issue a public report listing, by health plan company, the actual loss ratios experienced in the individual and small employer markets in this state by the health plan companies that the commissioners respectively regulate. The commissioners shall coordinate release of these reports so as to release them as a joint report or as separate reports issued the same day. The report or reports shall be released no later than June 1 for loss ratios experienced for the preceding calendar year. Health plan companies shall provide to the commissioners any information requested by the commissioners for purposes of this paragraph.\nThe commissioner has the authority to audit any health carrier to assure compliance with this section. Health carriers shall retain at their principal place of business information necessary for the commissioner to perform compliance audits.\n(a) Each health care policy form or health care certificate form for which subdivision 1 requires compliance with a loss ratio requirement shall prominently display the disclosure provided in paragraph (b) on its declarations sheet if it has one and, if not, on its front page. The disclosure must also be prominently displayed in any marketing materials used in connection with it.\n(b) The disclosure must be in the following format:\nNotice: This disclosure is required by Minnesota law. This policy or certificate is expected to return on average (fill in anticipated loss ratio approved by the commissioner) percent of your premium dollar for health care. The lowest percentage permitted by state law for this policy or certificate is (fill in applicable minimum loss ratio).\n(c) This subdivision applies to policies and certificates issued on or after January 1, 1998.",
	"repealed": false
}