{
	"id": "290.0135",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0135",
	"title": "290.0135 BASIS MODIFICATIONS AFFECTING GAIN OR LOSS ON DISPOSITION OF PROPERTY.",
	"text": "(a) For individuals, estates, and trusts, the basis of property is its adjusted basis for federal income tax purposes except as set forth in paragraphs (e) and (f). For corporations, the basis of property is its adjusted basis for federal income tax purposes, without regard to the time when the property became subject to tax under this chapter or to whether out-of-state losses or items of tax preference with respect to the property were not deductible under this chapter, except that the modifications to the basis for federal income tax purposes set forth in paragraphs (b) to (i) are allowed to corporations, and the resulting modifications to federal taxable income must be made in the year in which gain or loss on the sale or other disposition of property is recognized.\n(b) The basis of property shall not be reduced to reflect federal investment tax credit.\n(c) For property acquired before January 1, 1933, the basis for computing a gain is the fair market value of the property as of that date. The basis for determining a loss is the cost of the property to the taxpayer less any depreciation, amortization, or depletion, actually sustained before that date. If the adjusted cost exceeds the fair market value of the property, then the basis is the adjusted cost regardless of whether there is a gain or loss.\n(d) The basis is reduced by the allowance for amortization of bond premium if an election to amortize was made pursuant to Minnesota Statutes 1986, section 290.09, subdivision 13, and the allowance could have been deducted by the taxpayer under this chapter during the period of the taxpayer's ownership of the property.\n(e) For assets placed in service before January 1, 1987, corporations, partnerships, or individuals engaged in the business of mining ores other than iron ore or taconite concentrates subject to the occupation tax under chapter 298 must use the occupation tax basis of property used in that business.\n(f) For assets placed in service before January 1, 1990, corporations, partnerships, or individuals engaged in the business of mining iron ore or taconite concentrates subject to the occupation tax under chapter 298 must use the occupation tax basis of property used in that business.\n(g) In applying the provisions of sections 301(c)(3)(B), 312(f) and (g), and 316(a)(1) of the Internal Revenue Code, the dates December 31, 1932, and January 1, 1933, shall be substituted for February 28, 1913, and March 1, 1913, respectively.\n(h) In applying the provisions of section 362(a) and (c) of the Internal Revenue Code, the date December 31, 1956, shall be substituted for June 22, 1954.\n(i) The basis of property shall be increased by the amount of intangible drilling costs not previously allowed due to differences between this chapter and the Internal Revenue Code.\n(j) The adjusted basis of any corporate partner's interest in a partnership is the same as the adjusted basis for federal income tax purposes modified as required to reflect the basis modifications set forth in paragraphs (b) to (i). The adjusted basis of a partnership in which the partner is an individual, estate, or trust is the same as the adjusted basis for federal income tax purposes modified as required to reflect the basis modifications set forth in paragraphs (e) and (f).\n(k) The modifications contained in paragraphs (b) to (i) also apply to the basis of property that is determined by reference to the basis of the same property in the hands of a different taxpayer or by reference to the basis of different property.",
	"repealed": false
}