{
	"id": "144.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.605",
	"title": "144.605 DESIGNATING TRAUMA HOSPITALS.",
	"text": "Unless it has been designated a trauma hospital by the commissioner, no hospital shall use the term trauma center or trauma hospital in its name or its advertising or shall otherwise indicate it has trauma treatment capabilities.\nThe commissioner shall designate six levels of trauma hospitals. A hospital that voluntarily meets the criteria for a particular level of trauma hospital shall apply to the commissioner for designation and, upon the commissioner's verifying the hospital meets the criteria, be designated a trauma hospital at the appropriate level for a three-year period. Prior to the expiration of the three-year designation, a hospital seeking to remain part of the voluntary system must apply for and successfully complete a reverification process, be awaiting the site visit for the reverification, or be awaiting the results of the site visit. The commissioner may extend a hospital's existing designation for up to 18 months on a provisional basis if the hospital has applied for reverification in a timely manner but has not yet completed the reverification process within the expiration of the three-year designation and the extension is in the best interest of trauma system patient safety. To be granted a provisional extension, the hospital must be:\n(1) scheduled and awaiting the site visit for reverification;\n(2) awaiting the results of the site visit; or\n(3) responding to and correcting identified deficiencies identified in the site visit.\nThe commissioner shall grant the appropriate level I, II, or III trauma hospital or level I or II pediatric trauma hospital designation to a hospital that successfully completes and passes the American College of Surgeons (ACS) verification standards at the hospital's cost, submits verification documentation to the Trauma Advisory Council, and formally notifies the Trauma Advisory Council of ACS verification.\n(a) The commissioner shall grant the appropriate level III trauma hospital designation to a hospital that is not ACS verified but that successfully completes the designation process under paragraph (b).\n(b) The hospital must complete and submit a self-reported survey and application to the Trauma Advisory Council for review, verifying that the hospital meets the criteria as a level III trauma hospital. When the Trauma Advisory Council is satisfied the application is complete, the commissioner shall arrange a site review visit. Upon successful completion of the site review, the review team shall make written recommendations to the Trauma Advisory Council. If approved by the Trauma Advisory Council, a letter of recommendation shall be sent to the commissioner for final approval and designation.\n(a) The commissioner shall grant the appropriate level IV trauma hospital designation to a hospital that successfully completes the designation process under paragraph (b).\n(b) The hospital must complete and submit a self-reported survey and application to the Trauma Advisory Council for review, verifying that the hospital meets the criteria as a level IV trauma hospital. When the Trauma Advisory Council is satisfied the application is complete, the commissioner shall arrange a site review visit. Upon successful completion of the site review, the review team shall make written recommendations to the Trauma Advisory Council. If approved by the Trauma Advisory Council, a letter of recommendation shall be sent to the commissioner for final approval and designation.\nChanges in a trauma hospital's ability to meet the criteria for the hospital's level of designation must be self-reported to the Trauma Advisory Council and to other regional hospitals and local emergency medical services providers and authorities. If the hospital cannot correct its ability to meet the criteria for its level within six months, the hospital may apply for redesignation at a different level.\nA trauma hospital may apply for a higher trauma hospital designation one time during the hospital's three-year designation by completing the designation process for that level of trauma hospital.\nThe commissioner may refuse to designate or redesignate or may revoke a previously issued trauma hospital designation if a hospital does not meet the criteria of the statewide trauma plan, in the interests of patient safety, or if a hospital denies or refuses a reasonable request by the commissioner or the commissioner's designee to verify information by correspondence or an on-site visit.\nData on patients in information and reports related to the designation and redesignation of trauma hospitals pursuant to subdivisions 3 to 5 are private data on individuals, as defined in section 13.02, subdivision 12.\nPursuant to subdivisions 4, paragraph (b), and 5, paragraph (b), the commissioner of administration may waive provisions of chapter 16C for the purposes of approving contracts for independent clinical teams.",
	"repealed": false
}