{
	"id": "173.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.17",
	"title": "173.17 REMOVAL OF ADVERTISING DEVICE; COMPENSATION.",
	"text": "(a) It is hereby declared that where in order to carry out the provisions of this chapter it is necessary that property rights be acquired, such acquisition is for a public purpose and is necessary for a highway purpose. The commissioner of transportation is authorized to acquire by purchase, gift or condemnation all advertising devices and all property rights pertaining thereto which are prohibited under the provisions of this chapter, and any rules promulgated pursuant thereto, provided that such advertising devices were in lawful existence on June 8, 1971. In any such acquisition, purchase or condemnation, just compensation shall be paid for:\n(1) the taking from the owner of such sign, display or device of all right, title, leasehold and interest in such sign, display or device; and\n(2) the taking from the owner of the real property on which such advertising device is located immediately prior to its removal or relocation, the right to erect and maintain thereon advertising devices, and full compensation therefor, including severance damage and damage to the remainder of the outdoor advertising plant regardless of whether it is located on property contiguous to or a part of that on which such sign is located, shall be included in the amounts paid to the respective owners. Provided, however, that no compensation shall be paid for severance damage and damage to the remainder of the outdoor advertising plant unless federal laws, or rules and regulations promulgated by the United States Department of Transportation provide for federal participation in the cost of such severance damage and damage to the remainder of the outdoor advertising plant.\n(b) Compensation required herein shall be paid to the person or persons entitled thereto. Notwithstanding any other provisions of Laws 1971, chapter 883, no advertising device shall be required to be removed or relocated unless and until the commissioner of transportation shall tender payment to the owner of the advertising device and the owner of real property upon which the same is located, in cash or check drawn on the state treasury, of 100 percent of the amount of just compensation required herein, as determined by the commissioner of transportation; provided that the acceptance of said tendered amount by the person or persons to be compensated shall be without prejudice to further rights to have just compensation finally determined in accordance with the provisions of Laws 1971, chapter 883, and to receive any greater or additional amount under chapter 117.\n(c) Notwithstanding any other provision of this chapter, including section 173.20, no advertising device which was lawfully erected shall be removed until all rights in the property, personal or real, have been acquired by purchase, gift, or eminent domain proceedings under chapter 117, whether or not the advertising device is removed pursuant to this chapter or any other statute, ordinance, or regulation of any political subdivision of the state or local zoning authority.",
	"repealed": false
}