{
	"id": "123B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.11",
	"title": "123B.11 IMPREST CASH FUNDS.",
	"text": "The board may establish one or more imprest funds for the payment in cash of any proper claim against the district which it is impractical to pay in any other manner, except that no claim for salary or personal expenses of a district officer or employee shall be paid from such funds. The board must appoint a custodian of each such fund who shall be responsible for its safekeeping and disbursement according to law. Money for the operation of such fund shall be secured by a transfer from the general fund. A claim itemizing all the various demands for which disbursements have been made from the fund must be presented to the board at the next board meeting after the disbursements have been made. The board must act upon it as in the case of other claims and an order shall be issued to the custodian for the amount allowed. The custodian shall use the proceeds of the order to replenish the fund. If the board fails to approve the claim in full for any sufficient reason, the custodian shall be personally responsible for the difference.\nThe board may authorize an imprest fund for the purpose of advancing money to officers or employees to pay the actual and necessary expenses of such officer or employee in attending meetings outside of the district. The board must appoint a custodian of such fund who shall be responsible for its safekeeping and disbursement according to law. At the first regular meeting of the board after such meeting, the custodian shall submit an itemized claim for the actual and necessary expenses incurred and paid. The board must act upon it as in the case of other claims and an order shall be issued to the custodian for the amount allowed. The custodian shall use the proceeds of the order to repay the amount advanced from the fund and make final settlement with the officer or employee. As an alternative the board may authorize travel advances if control is maintained by use of a travel advance account, the balance of which is supported by names of employees to whom money has been advanced.",
	"repealed": false
}