{
	"id": "41B.043",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.043",
	"title": "41B.043 AGRICULTURAL IMPROVEMENT LOAN PROGRAM.",
	"text": "The authority may establish, adopt rules for, and implement an agricultural improvement loan program to finance agricultural improvements.\n[Repealed, 2007 c 45 art 1 s 66]\nThe authority may participate in an agricultural improvement loan with an eligible lender to a farmer who meets the requirements of section 41B.03, subdivision 1, clauses (1) and (2), and who is actively engaged in farming. Participation is limited to 45 percent of the principal amount of the loan or $500,000, whichever is less. The interest rates and repayment terms of the authority's participation interest may be different than the interest rates and repayment terms of the lender's retained portion of the loan.\nEach loan participation must be secured by a mortgage on real property and such other security as the authority may require.\nA prospective borrower applying for a loan participation through an eligible lender may refinance an existing debt in order to repair or replace farm driveways, drainage ditches and tile lines, grassed waterways, or agricultural buildings damaged due to snow, flooding, or other weather-related causes.\nThe authority may impose a reasonable nonrefundable application fee for each application submitted for a participation issued under the agricultural improvement loan program. The application fee is initially $50. The authority may review the fees annually and make adjustments as necessary. The fees must be deposited in the state treasury and credited to the Rural Finance Authority administrative account established in section 41B.03.\nThe interest rate per annum on the agricultural improvement participation must be the rate of interest determined by the authority to be necessary to provide for the timely payment of principal and interest when due on bonds or other obligations of the authority issued under chapter 41B to provide financing for participations made under the agricultural improvement loan program, and to provide for reasonable and necessary costs of issuing, carrying, administering, and securing the bonds or notes and to pay the costs incurred and to be incurred by the authority in the implementation of the agricultural improvement loan program.\nA prospective borrower for an agricultural improvement loan in which the authority holds an interest must have a total net worth, including assets and liabilities of the borrower's spouse and dependents, of less than $800,000 in 2017 and an amount in subsequent years which is adjusted for inflation by multiplying that amount by the cumulative inflation rate as determined by the United States All-Items Consumer Price Index.",
	"repealed": false
}