{
	"id": "549.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.405",
	"title": "549.405 APPOINTMENT OF ATTORNEY ADVISER.",
	"text": "The court is authorized and may, in its discretion, appoint an attorney to make an independent assessment and advise the court whether the proposed transfer is in the best interest of the payee, taking into consideration the payee's dependents, if any. The attorney may consult with a certified public accountant, actuary, or other licensed professional adviser, if necessary. All costs and reasonable fees for the appointed attorney shall be borne by the transferee, not to exceed $2,000. The fee shall be deposited with and disbursed to the attorney adviser by the court.\nThe court shall appoint an attorney in any case involving:\n(1) a proposed transfer of a minor's structured settlement payments rights by a parent, conservator, or guardian where the attorney must advise the court on whether the proposed transfer is of direct benefit to the minor; or\n(2) a proposed transfer of structured settlement payment rights involving a payee if it appears to the court that the payee may suffer from a mental or cognitive impairment.\n(a) The transferee shall file a motion for the appointment of an attorney prior to a hearing on the proposed transfer if the transferee:\n(1) is aware that the underlying structured settlement arose from a case in which a finding was made in a court record of a mental or cognitive impairment on the part of the payee; or\n(2) is aware of any other case in which a finding was made in a court record of a mental or cognitive impairment on the part of the payee.\n(b) In conjunction with the motion, the transferee shall provide to the court, either in-camera or as directed by the court in a way to protect the privacy of the payee, any such findings known to the transferee that describe the nature, extent, or consequences of the payee's mental or cognitive impairment.\nThe attorney appointed by the court must report to the court the attorney's assessment and advice at the hearing required under section 549.40, subdivision 2, or at another time as directed by the court.\nNothing in sections 549.30 to 549.41 affects the applicability of sections 524.5-101 to 524.5-903 or the rights and protections of persons subject to guardianship or conservatorship under those sections.",
	"repealed": false
}