{
	"id": "518A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.65",
	"title": "518A.65 DRIVER'S LICENSE SUSPENSION.",
	"text": "(a) Upon motion of an obligee, which has been properly served on the obligor and upon which there has been an opportunity for hearing, if a court finds that the obligor has been or may be issued a driver's license by the commissioner of public safety and the obligor is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority, the court may order the commissioner of public safety to suspend the obligor's driver's license. The court may consider the circumstances in paragraph (i) to determine whether driver's license suspension is an appropriate remedy that is likely to induce the payment of child support. The court may consider whether driver's license suspension would have a direct harmful effect on the obligor or joint children that would make driver's license suspension an inappropriate remedy. The public authority may not administratively reinstate a driver's license suspended by the court unless specifically authorized to do so in the court order. This paragraph expires December 31, 2025.\n(b) This paragraph is effective January 1, 2026. Upon the motion of an obligee that has been properly served on the obligor and for which there has been an opportunity for a hearing, if a court finds that the obligor has a valid driver's license issued by the commissioner of public safety and the obligor is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority, the court may order the commissioner of public safety to suspend the obligor's driver's license. The court may consider the circumstances in paragraph (i) to determine whether driver's license suspension is an appropriate remedy that is likely to induce the payment of child support. The court may consider whether driver's license suspension would have a direct harmful effect on the obligor or joint children that would make driver's license suspension an inappropriate remedy. The public authority may not administratively reinstate a driver's license suspended by the court unless specifically authorized to do so in the court order.\n(c) The court's order must be stayed for 90 days in order to allow the obligor to execute a written payment agreement pursuant to section 518A.69. The payment agreement must be approved by either the court or the public authority responsible for child support enforcement. If the obligor has not executed or is not in compliance with a written payment agreement pursuant to section 518A.69 after the 90 days expires, the court's order becomes effective and the commissioner of public safety shall suspend the obligor's driver's license. The remedy under this section is in addition to any other enforcement remedy available to the court. An obligee may not bring a motion under this paragraph within 12 months of a denial of a previous motion under this paragraph.\n(d) If a public authority responsible for child support enforcement determines that the obligor has been or may be issued a driver's license by the commissioner of public safety; the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority, the public authority shall direct the commissioner of public safety to suspend the obligor's driver's license unless exercising administrative discretion under paragraph (i). The remedy under this section is in addition to any other enforcement remedy available to the public authority. This paragraph expires December 31, 2025.\n(e) This paragraph is effective January 1, 2026. If a public authority responsible for child support enforcement determines that:\n(1) the obligor has a valid driver's license issued by the commissioner of public safety;\n(2) the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments;\n(3) the obligor is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority; and\n(4) the obligor's mailing address is known to the public authority;\nthen the public authority shall direct the commissioner of public safety to suspend the obligor's driver's license unless exercising administrative discretion under paragraph (i). The remedy under this section is in addition to any other enforcement remedy available to the public authority.\n(f) At least 90 days prior to notifying the commissioner of public safety according to paragraph (d), the public authority must mail a written notice to the obligor at the obligor's last known address, that it intends to seek suspension of the obligor's driver's license and that the obligor must request a hearing within 30 days in order to contest the suspension. If the obligor makes a written request for a hearing within 30 days of the date of the notice, a court hearing must be held. Notwithstanding any law to the contrary, the obligor must be served with 14 days' notice in writing specifying the time and place of the hearing and the allegations against the obligor. The notice must include information that apprises the obligor of the requirement to develop a written payment agreement that is approved by a court, a child support magistrate, or the public authority responsible for child support enforcement regarding child support, maintenance, and any arrearages in order to avoid license suspension. The notice may be served personally or by mail. If the public authority does not receive a request for a hearing within 30 days of the date of the notice, and the obligor does not execute a written payment agreement pursuant to section 518A.69 that is approved by the public authority within 90 days of the date of the notice, the public authority shall direct the commissioner of public safety to suspend the obligor's driver's license under paragraph (d).\n(g) At a hearing requested by the obligor under paragraph (f), and on finding that the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments, the district court or child support magistrate shall order the commissioner of public safety to suspend the obligor's driver's license or operating privileges unless:\n(1) the court or child support magistrate determines that the obligor has executed and is in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority; or\n(2) the court, in its discretion, determines that driver's license suspension is unlikely to induce the payment of child support or would have direct harmful effects on the obligor or joint child that make driver's license suspension an inappropriate remedy. The court may consider the circumstances in paragraph (i) in exercising the court's discretion.\n(h) An obligor whose driver's license or operating privileges are suspended may:\n(1) provide proof to the public authority responsible for child support enforcement that the obligor is in compliance with all written payment agreements pursuant to section 518A.69;\n(2) bring a motion for reinstatement of the driver's license. At the hearing, if the court or child support magistrate orders reinstatement of the driver's license, the court or child support magistrate must establish a written payment agreement pursuant to section 518A.69; or\n(3) seek a limited license under section 171.30. A limited license issued to an obligor under section 171.30 expires 90 days after the date it is issued.\nWithin 15 days of the receipt of that proof or a court order, the public authority shall inform the commissioner of public safety that the obligor's driver's license or operating privileges should no longer be suspended.\n(i) Prior to notifying the commissioner of public safety that an obligor's driver's license should be suspended or after an obligor's driving privileges have been suspended, the public authority responsible for child support enforcement may use administrative authority to end the suspension process or inform the commissioner of public safety that the obligor's driving privileges should no longer be suspended under any of the following circumstances:\n(1) the full amount of court-ordered payments have been received for at least one month;\n(2) an income withholding notice has been sent to an employer or payor of money;\n(3) payments less than the full court-ordered amount have been received and the circumstances of the obligor demonstrate the obligor's substantial intent to comply with the order;\n(4) the obligor receives public assistance;\n(5) the case is being reviewed by the public authority for downward modification due to changes in the obligor's financial circumstances or a party has filed a motion to modify the child support order;\n(6) the obligor no longer lives in the state and the child support case is in the process of interstate enforcement;\n(7) the obligor is currently incarcerated for one week or more or is receiving in-patient treatment for physical health, mental health, chemical dependency, or other treatment. This clause applies for six months after the obligor is no longer incarcerated or receiving in-patient treatment;\n(8) the obligor is temporarily or permanently disabled and unable to pay child support;\n(9) the obligor has presented evidence to the public authority that the obligor needs driving privileges to maintain or obtain the obligor's employment;\n(10) the obligor has not had a meaningful opportunity to pay toward arrears; or\n(11) other circumstances of the obligor indicate that a temporary condition exists for which the suspension of the obligor's driver's license for the nonpayment of child support is not appropriate. When considering whether the suspension of the obligor's driver's license is appropriate, the public authority must assess: (i) whether the suspension of the obligor's driver's license is likely to induce the payment of child support; and (ii) whether the suspension of the obligor's driver's license would have direct harmful effects on the obligor or joint children that make driver's license suspension an inappropriate remedy.\nThe presence of circumstances in this paragraph does not prevent the public authority from proceeding with a suspension of the obligor's driver's license.\n(j) In addition to the criteria established under this section for the suspension of an obligor's driver's license, a court, a child support magistrate, or the public authority may direct the commissioner of public safety to suspend the license of a party who has failed, after receiving notice, to comply with a subpoena relating to a paternity or child support proceeding. Notice to an obligor of intent to suspend must be served by first class mail at the obligor's last known address. The notice must inform the obligor of the right to request a hearing. If the obligor makes a written request within ten days of the date of the hearing, a hearing must be held. At the hearing, the only issues to be considered are mistake of fact and whether the obligor received the subpoena.\n(k) The license of an obligor who fails to remain in compliance with an approved written payment agreement may be suspended. Prior to suspending a license for noncompliance with an approved written payment agreement, the public authority must mail to the obligor's last known address a written notice that (1) the public authority intends to seek suspension of the obligor's driver's license under this paragraph, and (2) the obligor must request a hearing, within 30 days of the date of the notice, to contest the suspension. If, within 30 days of the date of the notice, the public authority does not receive a written request for a hearing and the obligor does not comply with an approved written payment agreement, the public authority must direct the Department of Public Safety to suspend the obligor's license under paragraph (d). If the obligor makes a written request for a hearing within 30 days of the date of the notice, a court hearing must be held. Notwithstanding any law to the contrary, the obligor must be served with 14 days' notice in writing specifying the time and place of the hearing and the allegations against the obligor. The notice may be served personally or by mail at the obligor's last known address. If the obligor appears at the hearing and the court determines that the obligor has failed to comply with an approved written payment agreement, the court or public authority shall notify the Department of Public Safety to suspend the obligor's license under paragraph (d). If the obligor fails to appear at the hearing, the court or public authority must notify the Department of Public Safety to suspend the obligor's license under paragraph (d).",
	"repealed": false
}