{
	"id": "115A.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.64",
	"title": "115A.64 PROCEDURE FOR ESTABLISHING AND ALTERING.",
	"text": "Waste districts shall be established and their powers and boundaries defined or altered by the commissioner only after petition requesting the action jointly submitted by the governing bodies of petitioners comprising at least one-half of the counties partly or wholly within the district. A petition for alteration shall include a resolution by the board of directors of the district approving the alteration.\n(a) A petition requesting establishment or alteration of a waste district must contain the information the commissioner may require, including at least the following:\n(1) the name of the proposed district;\n(2) a description of the territory and political subdivisions within and the boundaries of the proposed district or alteration thereto, along with a map showing the district or alteration;\n(3) resolutions of support for the district, as proposed to the commissioner, from the governing body of each of the petitioning counties;\n(4) a statement of the reason, necessity, and purpose for the district, plus a general description of the solid waste management improvements and facilities contemplated for the district showing how its activities will accomplish the purpose of the district and the purposes for waste resource districts stated in sections 115A.62 to 115A.72;\n(5) articles of incorporation stating:\n(i) the powers of the district consistent with sections 115A.62 to 115A.72, including a statement of powers proposed pursuant to sections 115A.70, 115A.71, and 115A.715; and\n(ii) provisions for representation and election of the board of directors of the district.\n(b) After the petition has been filed, no petitioner may withdraw from it except with the written consent of all other petitioners for the district.\nAt least 60 days before submitting the petition to the commissioner, the petitioners shall publish notice of the petition in newspapers of general circulation in the proposed district and shall cause a copy of the petition to be served upon the agency, the governing body of each political subdivision which is wholly or partly within the proposed district or is affected by the proposed alteration and each regional development commission affected by the proposed district or alteration. Each entity receiving service shall have 60 days within which to comment to the petitioners on the petition and the proposed district or alteration. Proof of service, along with any comments received, shall be attached to the petition when it is submitted to the commissioner.\nUpon receipt of the petition, the commissioner shall determine whether the petition conforms in form and substance to the requirements of law and rule. If the petition does not conform to the requirements, the commissioner shall return it immediately to the petitioners with a statement describing the deficiencies and the amendments necessary to rectify them. If the petition does conform to the requirements, and if comments have been received objecting to the establishment or alteration of the district as proposed, the commissioner shall request the Office of Administrative Hearings to conduct a hearing on the petition. The hearing shall be conducted in the proposed district in the manner provided in chapter 14 for contested cases. If no comments have been received objecting to the establishment of the district as proposed, the commissioner may proceed to grant or deny the petition without the necessity of conducting a contested case hearing. If the petition conforms to the requirements of law and rule, the commissioner shall also immediately submit the petition to the solid waste and the technical advisory councils for review and recommendation and shall prepare a report containing recommendations on the disposition of the petition. The commissioner's report shall contain at least the commissioner's findings and conclusions on whether the proposed boundaries, purposes, powers, and management plans of the district or alteration thereto serve the purposes of waste resource districts, are appropriately related to the waste generation, collection, processing, and disposal patterns in the area, and are generally consistent with the purposes of the agency's regulatory program.\nNo petition submitted by the requisite number of counties shall be void or dismissed on account of defects exposed in the hearing documents or report. The commissioner shall permit the petition to be amended in form and substance to conform to the facts by correcting any errors in the description of the territory or any other defects.\nAfter considering the reports of the administrative law judge, if a contested case hearing has been held, and the recommendations of the advisory councils, the commissioner shall make a final decision on the petition. If the commissioner finds and determines that the establishment or alteration of a district as proposed in the petition would not be in the public interest and would not serve the purposes of sections 115A.62 to 115A.72, the commissioner shall give notice to the petitioners of intent to deny the petition. If a contested case hearing has not been held, the petitioners may request a hearing within 30 days of the notice of intent to deny the petition. The request shall be granted. Following the hearing and the report of the administrative law judge, the commissioner shall make a final decision on the petition and mail a copy of the decision to the governing body of each affected political subdivision. If the commissioner finds and determines that the establishment or alteration of a district as proposed in the petition would be in the public interest and would serve the purposes of sections 115A.62 to 115A.72, the commissioner shall, by order, establish the district, define its boundaries, and give it a corporate name by which, in all proceedings, it shall thereafter be known. The order shall include articles of incorporation stating the powers of the district and the location of its registered office. Upon the filing of a certified copy of the order of the commissioner with the secretary of state, the district shall become a political subdivision of the state and a public corporation, with the authority, power, and duties prescribed in sections 115A.62 to 115A.72 and the order of the commissioner. At the time of filing, a copy of the order shall be mailed by the commissioner to the governing body of each political subdivision wholly or partly within the district or affected by the alteration of the district.",
	"repealed": false
}