{
	"id": "142G.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.58",
	"title": "142G.58 POSTSECONDARY EDUCATION AS APPROVED WORK ACTIVITY.",
	"text": "(a) In order for a postsecondary education or training program to be an approved work activity as defined in section 142G.50, subdivision 11, paragraph (a), clause (6), it must be a program lasting four years or less, and the participant must meet the requirements of subdivisions 2, 3, and 4.\n(b) Participants with a high school diploma, commissioner of education-selected high school equivalency certification, or an adult high school diploma must be informed of the opportunity to participate in postsecondary education or training while in the Minnesota family investment program.\n(a) Participants who are interested in participating in postsecondary education or training as part of their employment plan must discuss their education plans with their job counselor. Job counselors will work with participants to evaluate the options by:\n(1) advising whether there are suitable employment opportunities that require the specific education or training in the area in which the participant resides or is willing to reside;\n(2) assisting the participant in exploring whether the participant can meet the requirements for admission into the program; and\n(3) discussing the participant's strengths and challenges based on the participant's MFIP assessment, previous education, training, and work history.\n(b) The requirements of this subdivision do not apply to participants who are in:\n(1) a recognized career pathway program that leads to stackable credentials;\n(2) a training program lasting 12 weeks or fewer; or\n(3) the final year of a multiyear postsecondary education or training program.\nIn order for a postsecondary education or training program to be an approved activity in a participant's employment plan, the participant must maintain satisfactory progress in the program. \"Satisfactory progress\" in an education or training program means (1) the participant remains in good standing while the participant is enrolled in the program, as defined by the education or training institution, or (2) the participant makes satisfactory progress as the term is defined in the participant's employment plan.\nUpon completion of an approved education or training program, a participant who does not meet the participation requirements in section 142G.51, subdivision 1, through unsubsidized employment must participate in job search. If, after three months of job search, the participant does not find a full-time job consistent with the employment goal, the participant must accept any offer of full-time suitable employment, or meet with the job counselor to revise the employment plan to include additional work activities necessary to meet hourly requirements.",
	"repealed": false
}