{
	"id": "325F.781",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.781",
	"title": "325F.781 REQUIREMENTS; TOBACCO PRODUCT DELIVERY SALES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given, unless the language or context clearly provides otherwise.\n(b) \"Consumer\" means an individual who purchases, receives, or possesses tobacco products for personal consumption and not for resale.\n(c) \"Delivery sale\" means:\n(1) a sale of tobacco products to a consumer in this state when:\n(i) the purchaser submits the order for the sale by means of a telephonic or other method of voice transmission, the mail or any other delivery service, or the Internet or other online service; or\n(ii) the tobacco products are delivered by use of the mail or other delivery service; or\n(2) a sale of tobacco products that satisfies the criteria in clause (1), item (i), regardless of whether the seller is located inside or outside of the state.\nA sale of tobacco products to an individual in this state must be treated as a sale to a consumer, unless the individual is licensed as a distributor or retailer of tobacco products.\n(d) \"Delivery service\" means a person, including the United States Postal Service, that is engaged in the commercial delivery of letters, packages, or other containers.\n(e) \"Distributor\" means a person, whether located inside or outside of this state, other than a retailer, who sells or distributes tobacco products in the state. Distributor does not include a tobacco products manufacturer, export warehouse proprietor, or importer with a valid permit under United States Code, title 26, section 5712 (1997), if the person sells or distributes tobacco products in this state only to distributors who hold valid and current licenses under the laws of a state, or to an export warehouse proprietor or another manufacturer. Distributor does not include a common or contract carrier that is transporting tobacco products under a proper bill of lading or freight bill that states the quantity, source, and destination of tobacco products, or a person who ships tobacco products through this state by common or contract carrier under a bill of lading or freight bill.\n(f) \"Retailer\" means a person, whether located inside or outside this state, who sells or distributes tobacco products to a consumer in this state.\n(g) \"Tobacco products\" means cigarettes and tobacco products as defined in section 297F.01.\n(a) This subdivision applies to acceptance of an order for a delivery sale of tobacco products.\n(b) When accepting the first order for a delivery sale from a consumer, the tobacco retailer shall obtain the following information from the person placing the order:\n(1) a copy of a valid government-issued document that provides the person's name, current address, photograph, and date of birth; and\n(2) an original written statement signed by the person documenting that the person:\n(i) is of legal age to purchase tobacco products in the state;\n(ii) has made a choice whether to receive mailings from a tobacco retailer;\n(iii) understands that providing false information may be a violation of law; and\n(iv) understands that it is a violation of law to purchase tobacco products for subsequent resale or for delivery to persons who are under the legal age to purchase tobacco products.\n(c) If an order is made as a result of advertisement over the Internet, the tobacco retailer shall request the email address of the purchaser and shall receive payment by credit card or check prior to shipping.\n(d) Prior to shipping the tobacco products, the tobacco retailer shall verify the information provided under paragraph (b) against a commercially available database. Any such database or databases may also include age and identity information from other government or validated commercial sources, if that additional information is regularly used by government and businesses for the purpose of identity verification and authentication, and if the additional information is used only to supplement and not to replace the government-issued identification data in the age and identity verification process.\n(a) This subdivision applies to a tobacco retailer shipping tobacco products pursuant to a delivery sale.\n(b) The tobacco retailer shall clearly mark the outside of the package of tobacco products to be shipped \"tobacco products - adult signature required\" and to show the name of the tobacco retailer.\n(c) The tobacco retailer shall utilize a delivery service that imposes the following requirements:\n(1) an adult must sign for the delivery; and\n(2) the person signing for the delivery must show valid government-issued identification that contains a photograph of the person signing for the delivery and indicates that the person signing for the delivery is of legal age to purchase tobacco products and resides at the delivery address.\n(d) The retailer must provide delivery instructions that clearly indicate the requirements of this subdivision and must declare that state law requires compliance with the requirements.\n(e) No criminal penalty may be imposed on a person for a violation of this section other than a violation described in paragraph (f) or (g). Whenever it appears to the commissioner that any person has engaged in any act or practice constituting a violation of this section, and the violation is not within two years of any previous violation of this section, the commissioner shall issue and cause to be served upon the person an order requiring the person to cease and desist from violating this section. The order must give reasonable notice of the rights of the person to request a hearing and must state the reason for the entry of the order. Unless otherwise agreed between the parties, a hearing shall be held not later than seven days after the request for the hearing is received by the commissioner after which and within 20 days after the receipt of the administrative law judge's report and subsequent exceptions and argument, the commissioner shall issue an order vacating the cease and desist order, modifying it, or making it permanent as the facts require. If no hearing is requested within 30 days of the service of the order, the order becomes final and remains in effect until modified or vacated by the commissioner. All hearings shall be conducted in accordance with the provisions of chapter 14. If the person to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person shall be deemed in default, and the proceeding may be determined against the person upon consideration of the cease and desist order, the allegations of which may be deemed to be true.\n(f) Any person who violates this section within two years of a violation for which a cease and desist order was issued under paragraph (e), is guilty of a misdemeanor.\n(g) Any person who commits a third or subsequent violation of this section, including a violation for which a cease and desist order was issued under paragraph (c), within any subsequent two-year period is guilty of a gross misdemeanor.\nThis section may not be construed as imposing liability upon any common carrier, or officers or employees of the common carrier, when acting within the scope of business of the common carrier.\nPrior to making delivery sales, an out-of-state retailer must register with the commissioner of revenue as required under section 297F.031.\n(a) A retailer making delivery sales must file all returns and reports, collect and pay all taxes, and maintain all records required under chapter 297F.\n(b) In addition to any penalties under chapter 297F, a retailer making delivery sales who fails to pay any tax due under chapter 297F shall pay, in addition to any other penalty, a penalty of 50 percent of the tax due but unpaid.\nAll state laws that apply to in-state tobacco product retailers shall apply to Internet and mail-order sellers that sell into this state.\nAny tobacco product sold or attempted to be sold in a delivery sale that does not meet the requirements of this section is deemed to be contraband and is subject to forfeiture in the same manner as and in accordance with the provisions of section 297F.21.\nA tobacco retailer or distributor who violates this section or rules adopted under this section is subject to the following fines:\n(1) for the first violation, a fine of not more than $1,000; and\n(2) for the second and any subsequent violation, a fine of not more than $5,000.\nThe attorney general may bring an action to enforce this section and may seek injunctive relief, including a preliminary or final injunction, and fines, penalties, and equitable relief and may seek to prevent or restrain actions in violation of this section by any person or any person controlling such person. In addition, a violation of this section is a violation of the Unlawful Trade Practices Act, sections 325D.09 to 325D.16.",
	"repealed": false
}