{
	"id": "260C.193",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.193",
	"title": "260C.193 DISPOSITIONS; GENERAL PROVISIONS.",
	"text": "Whenever the court finds that the minor is not within the jurisdiction of the court or that the facts alleged in the petition have not been proved, it shall dismiss the petition.\nBefore making a disposition in a case, terminating parental rights, or appointing a guardian for a child, the court may consider any report or recommendation made by the responsible social services agency, probation officer, licensed child-placing agency, foster parent, guardian ad litem, tribal representative, the child's health or mental health care provider, or other authorized advocate for the child or child's family, a school district concerning the effect on student transportation of placing a child in a school district in which the child is not a resident, or any other information deemed material by the court.\n(a) The policy of the state is to ensure that the best interests of children in foster care, who experience a transfer of permanent legal and physical custody to a relative under section 260C.515, subdivision 4, or adoption under this chapter, are met by:\n(1) considering placement of a child with relatives in the order specified in section 260C.212, subdivision 2, paragraph (a); and\n(2) requiring individualized determinations under section 260C.212, subdivision 2, paragraph (b), of the needs of the child and of how the selected home will serve the needs of the child.\n(b) No later than three months after a child is ordered to be removed from the care of a parent in the hearing required under section 260C.202, the court shall review and enter findings regarding whether the responsible social services agency:\n(1) exercised due diligence to identify, search for, notify, and engage relatives as required under section 260C.221; and\n(2) made a placement consistent with section 260C.212, subdivision 2, that is based on an individualized determination of the child's needs to select a home that meets the needs of the child.\n(c) If the court finds that the agency has not exercised due diligence as required under section 260C.221, the court shall order the agency to make reasonable efforts. If there is a relative who qualifies to be licensed to provide family foster care under chapter 142B, the court may order the child to be placed with the relative consistent with the child's best interests.\n(d) If the agency's efforts under section 260C.221 are found by the court to be sufficient, the court shall order the agency to continue to appropriately engage relatives who responded to the notice under section 260C.221 in placement and case planning decisions and to appropriately engage relatives who subsequently come to the agency's attention. A court's finding that the agency has made reasonable efforts under this paragraph does not relieve the agency of the duty to continue notifying relatives who come to the agency's attention and engaging and considering relatives who respond to the notice under section 260C.221 in child placement and case planning decisions.\n(e) If the child's birth parent explicitly requests that a specific relative not be considered for placement of the child, the court shall honor that request if it is consistent with the best interests of the child and consistent with the requirements of section 260C.221. The court shall not waive relative search, notice, and consideration requirements, unless section 260C.139 applies. If the child's birth parent expresses a preference for placing the child in a foster or adoptive home of the same or a similar religious background as that of the birth parent or parents, the court shall order placement of the child with an individual who meets the birth parent's religious preference.\n(f) Placement of a child must not be delayed or denied based on race, color, or national origin of the foster parent or the child.\n(g) Whenever possible, siblings requiring foster care placement shall be placed together unless it is determined not to be in the best interests of one or more of the siblings after weighing the benefits of separate placement against the benefits of sibling connections for each sibling. The agency shall consider section 260C.008 when making this determination. If siblings were not placed together according to section 260C.212, subdivision 2, paragraph (d), the responsible social services agency shall report to the court the efforts made to place the siblings together and why the efforts were not successful. If the court is not satisfied that the agency has made reasonable efforts to place siblings together, the court must order the agency to make further reasonable efforts. If siblings are not placed together, the court shall order the responsible social services agency to implement the plan for visitation among siblings required as part of the out-of-home placement plan under section 260C.212.\n(h) This subdivision does not affect the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923, and the Minnesota Indian Family Preservation Act, sections 260.751 to 260.835.\nWhenever a child is placed in a residential program located outside of this state pursuant to a disposition order issued under section 260C.201, the juvenile court administrator shall report the following information to the state court administrator:\n(1) the fact that the placement is out of state;\n(2) the type of placement; and\n(3) the reason for the placement.\nWhen the court orders an out-of-home placement disposition for a child, the court shall state in its disposition order the intended outcome of the placement.\n(a) Jurisdiction over a child in foster care pursuant to section 260C.451 shall continue to age 21 for the purpose of conducting the reviews required under section 260C.203, 260C.317, subdivision 3, or 260C.515, subdivision 5 or 6. Jurisdiction over a child in foster care pursuant to section 260C.451 shall not be terminated without giving the child notice of any motion or proposed order to dismiss jurisdiction and an opportunity to be heard on the appropriateness of the dismissal. When a child in foster care pursuant to section 260C.451 asks to leave foster care or actually leaves foster care, the court may terminate its jurisdiction.\n(b) The court may terminate jurisdiction on its own motion or the motion of any interested party upon a determination that jurisdiction is no longer necessary to protect the child's best interests except when:\n(1) a court order is necessary for a child to be in foster care; or\n(2) continued review under section 260C.203, 260C.317, subdivision 3, or 260C.515, subdivision 5 or 6, is required for a child in foster care under section 260C.451.\n(c) Unless terminated by the court, and except as otherwise provided in this subdivision, the jurisdiction of the court shall continue until the child becomes 18 years of age. The court may continue jurisdiction over an individual and all other parties to the proceeding to the individual's 19th birthday when continuing jurisdiction is in the individual's best interest in order to:\n(1) protect the safety or health of the individual;\n(2) accomplish additional planning for independent living or for the transition out of foster care; or\n(3) support the individual's completion of high school or a high school equivalency program.",
	"repealed": false
}