{
	"id": "182.651",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.651",
	"title": "182.651 DEFINITIONS.",
	"text": "For the purpose of this chapter, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of labor and industry or a duly designated representative.\n\"Board\" means the Occupational Safety and Health Review Board established pursuant to section 182.664.\n\"Council\" means the Occupational Safety and Health Advisory Council.\n\"Department\" means the Department of Labor and Industry.\n\"Person\" means one or more individuals, partnerships, associations, corporations, business trusts, legal representatives, the state of Minnesota and its political subdivisions, or any group of persons.\n\"Employer\" means a person who employs one or more employees and includes any person who has the power to hire, fire, or transfer, or who acts in the interest of, or as a representative of, an employer and includes a corporation, partnership, association, group of persons, and the state and all of its political subdivisions.\n\"Federal standard\" means a standard, or modification thereof, adopted by a rule promulgated under section 6 of the federal Occupational Safety and Health Act of 1970 Public Law 91-596.\n\"Employee\" means any person suffered or permitted to work by an employer, including any person acting directly or indirectly in the interest of or as a representative of, an employer, and shall include state, county, town, city, school district, or governmental subdivision.\n\"Place of employment\" means any factory, plant, foundry, construction site, farm workplace, premises, vehicle or any other work environment where any employee is during the course of employment.\n\"Standard\" means an occupational safety and health standard promulgated by the commissioner which requires conditions, or the adoption or use of one or more practices, means, methods, operations or processes reasonably necessary or appropriate to provide safe and healthful employment and places of employment.\n\"Serious violation\" means a violation of any standard, rule, or order other than a de minimis violation which is the proximate cause of the death of an employee. It also means a violation of any standard, rule, or order which creates a substantial probability that death or serious physical harm could result from a condition which exists, or from one or more practices, means, methods, operations, or processes which have been adopted or are in use, in such a place of employment, unless the employer did not, and could not with the exercise of reasonable diligence, know of the presence of the violation.\n\"Act\" means the Minnesota Occupational Safety and Health Act of 1973.\n(a) \"Hazardous substance\" means a chemical or substance, or mixture of chemicals and substances, which:\n(1) is regulated by the federal Occupational Safety and Health Administration under the Code of Federal Regulations, title 29, part 1910, subpart Z; or\n(2) is either toxic or highly toxic; an irritant; corrosive; a strong oxidizer; a strong sensitizer; combustible; either flammable or extremely flammable; dangerously reactive; pyrophoric; pressure-generating; compressed gas; carcinogen; teratogen; mutagen; reproductive toxic agent; or that otherwise, according to generally accepted documented medical or scientific evidence, may cause substantial acute or chronic personal injury or illness during or as a direct result of any customary or reasonably foreseeable accidental or intentional exposure to the chemical or substance; or\n(3) is determined by the commissioner as a part of the standard for the chemical or substance or mixture of chemicals and substances to present a significant risk to worker health and safety or imminent danger of death or serious physical harm to an employee as a result of foreseeable use, handling, accidental spill, exposure, or contamination.\n(b) In determining whether a chemical or substance is hazardous under paragraph (a), clause (2) or (3), the commissioner shall, if appropriate, apply the criteria contained in the American National Standard Institute's American National Standard for the Precautionary Labeling of Hazardous Industrial Chemicals, Z129.1-1982, or any later revision of that standard. In addition the commissioner may consider the information contained in appendices which do not appear in the standard and any other available scientific evidence which substantially indicates a chemical or substance or mixture of chemicals and substances is hazardous.\n(c) Hazardous substance does not include a substance being developed or handled by a technically qualified individual in a research, medical research, medical diagnostic or medical educational laboratory or in a health care facility or in a clinic associated with the laboratory or health care facility, or in a pharmacy registered and licensed under chapter 151. This exemption applies only to technically qualified individuals and not to persons working in the same work area who are not technically qualified individuals.\n\"Harmful physical agent\" means a physical agent determined by the commissioner as a part of the standard for that agent to present a significant risk to worker health or safety or imminent danger of death or serious physical harm to an employee. This definition includes but is not limited to radiation, whether ionizing or nonionizing.\nHarmful physical agent does not include an agent being developed or utilized by a technically qualified individual in a research, medical research, medical diagnostic or medical educational laboratory or in a health care facility or in a clinic associated with the laboratory or health care facility, or in a pharmacy registered and licensed under chapter 151. The exemption in this clause does not include a physical agent utilized in a laboratory that primarily provides a quality control analysis for a manufacturing process. This exemption applies only to technically qualified individuals and not to persons working in the same work area who are not technically qualified individuals.\n(a) \"Technically qualified individual\" means a physician, dentist, pharmacist, or lead research individual, other than a student in one of these fields, who, because of professional or technical education, training, or experience, understands, at the time of exposure, the health risks and the necessary safety precautions associated with each hazardous substance, harmful physical agent, infectious agent, or mixture handled or utilized by the person.\n(b) The commissioner shall by rule adopt a standard which specifies the criteria to be considered in determining whether or not a person is a technically qualified individual under this subdivision.\nFor the purposes of this chapter, the determination of what is a hazardous substance or harmful physical agent is part of the occupational safety and health standard concerning that substance or agent adopted under section 182.655, subject only to the rulemaking procedure which the whole standard is subject to under section 182.655.\n(a) The following substances or mixtures are not hazardous substances if they are:\n(1) products intended for personal consumption by employees in the workplace;\n(2) consumer products packaged for distribution to, and used by, the general public, including any product used by an employer or the employer's employees in the same form, concentration, and manner as it is sold to consumers, and to the employer's knowledge, employee exposure is not significantly greater than the consumer exposure occurring during principal consumer use of the product;\n(3) any article, including but not limited to, an item of equipment or hardware, which contains a hazardous substance, if the substance is present in a solid form which does not create a health hazard as a result of being handled by an employee;\n(4) any hazardous substance that is bound and not released under normal conditions of work or in a reasonably foreseeable occurrence resulting from workplace operations;\n(5) products sold or used in retail food sale establishments and all other retail trade establishments, exclusive of processing and repair work areas;\n(6) \"intoxicating liquor\" as defined in section 340A.101, subdivision 14, or \"3.2 percent malt liquor\" as defined in section 340A.101, subdivision 19;\n(7) \"food\" as defined in the Federal Food, Drug, and Cosmetic Act, United States Code, title 27, section 321, et seq.; or\n(8) any waste material regulated pursuant to the federal Resource Conservation and Recovery Act, Public Law 94-580, but only with respect to any employer in a business which provides a service of collection, processing, or disposal of such waste.\n(b) The commissioner may, by inclusion in the standards adopted pursuant to section 182.655, determine whether any of the following may be excluded from the definitions of hazardous substance or harmful physical agent:\n(1) waste products labeled pursuant to the Resource Conservation and Recovery Act;\n(2) any substance received by an employee in a sealed package and subsequently sold or transferred in that package, if the seal remains intact while the substance is in the employer's workplace; or\n(3) any substance, mixture, or product if present in a physical state, volume, or concentration for which there is no valid and substantial evidence that a significant risk to human health may occur from exposure.\n\"Manufacturer\" means anyone who produces, synthesizes, extracts, or otherwise makes, processes, blends, packages or repackages a hazardous substance or harmful physical agent. The term manufacturer also includes anyone who imports into this state or distributes within this state a hazardous substance or harmful physical agent. Manufacturer does not include anyone whose primary business concerning the hazardous substance or harmful physical agent is in retail sales to the public.\n\"Infectious agent\" means a communicable bacterium, rickettsia, parasites, virus, or fungus determined by the commissioner by rule, with approval of the commissioner of health, which according to documented medical or scientific evidence causes substantial acute or chronic illness or permanent disability as a foreseeable and direct result of any routine exposure to the infectious agent. Infectious agent does not include an agent in or on the body of a patient before diagnosis.\n\"Affected employee\" means a current employee of a cited employer who is exposed within the scope of employment to the alleged hazard described in the citation.\n\"Authorized employee representative\" means a labor organization that has a collective bargaining relationship with the cited employer and that represents affected employees.\n\"Respondent\" means a person against whom a complaint has been issued or served.",
	"repealed": false
}