{
	"id": "137.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.54",
	"title": "137.54 CONDITIONS FOR PAYMENT TO UNIVERSITY.",
	"text": "(a) Before the commissioner may make the first payment to the board authorized in this section, the commissioner must certify that the board has received at least $110,750,000 in pledges, gifts, sponsorships, and other nonstate general fund revenue support for the construction of the stadium. On July 1 of each year after certification by the commissioner, but no earlier than July 1, 2007, and for so long thereafter as any bonds issued by the board for the construction of the stadium are outstanding, the state must transfer to the board up to $10,250,000 to reimburse the board for its stadium costs, provided that bonds issued to pay the state's share of such costs shall not exceed $137,250,000. Up to $10,250,000 is appropriated annually from the general fund for the purpose of this section. The appropriation of up to $10,250,000 per year may be made for no more than 25 years. The board must certify to the commissioner the amount of the annual payments of principal and interest required to service each series of bonds issued by the university for the construction of the stadium, and the actual amount of the state's annual payment to the university shall equal the amount required to service the bonds representing the state's share of such costs. Except to the extent of the annual appropriation described in this section, the state is not required to pay any part of the cost of designing or constructing the stadium.\n(b) The board may refund the bonds issued pursuant to paragraph (a) if refunding is determined by the board to be in the best interest of the university. Notwithstanding paragraph (a), the principal amount of bonds issued in a refunding shall not exceed the lesser of $104,385,000 or the amount necessary to defease the bonds outstanding immediately prior to refunding. The amount of the state's annual payment to the university for the refunded bonds shall be equal to the maximum annual appropriation of $10,250,000, notwithstanding the amount certified under paragraph (a).\n(c) The board shall allocate sufficient funds, including any interest expense, from the savings realized through refunding of the bonds pursuant to paragraph (b), to provide $10,000,000 for predesign and design of improved health education and clinical research facilities to meet the needs of the Medical School and Academic Health Center on the Twin Cities campus. The facilities shall be designed to support education and research that promote new innovative models of care which are patient-centered and team-based, and facilitate collaboration across the health professions. The education and research facilities will be collocated and designed to maximize collaboration and high-quality delivery of health care. The board may in its discretion, after the $10,000,000 allocation required by this paragraph, allocate to other university purposes payments from the state that exceed the amount necessary to service the refunded bonds, except for savings in 2029, 2030, and 2031, which shall cancel to the general fund.\n(d) The board must certify to the commissioner that the per-semester student fee contribution to the stadium will be at a fixed level coterminous with bonds issued by the board to meet the student share of the design construction of the stadium and that the student fee will not be increased to meet construction cost overruns.\n(e) Before the first payment is made under paragraph (a), the board must certify to the commissioner that a provision for affordable access for university students to the university sporting events held at the football stadium has been made.",
	"repealed": false
}