{
	"id": "390.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.11",
	"title": "390.11 INVESTIGATIONS.",
	"text": "All sudden or unexpected deaths and all deaths that may be due entirely or in part to any factor other than natural disease processes must be promptly reported to the coroner or medical examiner for evaluation. Sufficient information must be provided to the coroner or medical examiner. Reportable deaths include, but are not limited to:\n(1) unnatural deaths, including violent deaths arising from homicide, suicide, or accident;\n(2) deaths due to a fire or associated with burns or chemical, electrical, or radiation injury;\n(3) unexplained or unexpected perinatal and postpartum maternal deaths;\n(4) deaths under suspicious, unusual, or unexpected circumstances;\n(5) deaths of persons whose bodies are to be cremated or otherwise disposed of so that the bodies will later be unavailable for examination;\n(6) deaths of inmates of public institutions and persons in custody of law enforcement officers who have not been hospitalized primarily for organic disease;\n(7) deaths that occur during, in association with, or as the result of diagnostic, therapeutic, or anesthetic procedures;\n(8) deaths due to culpable neglect;\n(9) stillbirths of 20 weeks or longer gestation unattended by a physician;\n(10) sudden deaths of persons not affected by recognizable disease;\n(11) unexpected deaths of persons notwithstanding a history of underlying disease;\n(12) deaths in which a fracture of a major bone such as a femur, humerus, or tibia has occurred within the past six months;\n(13) deaths unattended by a physician occurring outside of a licensed health care facility or licensed residential hospice program;\n(14) deaths of persons not seen by their physician within 120 days of demise;\n(15) deaths of persons occurring in an emergency department;\n(16) stillbirths or deaths of newborn infants in which there has been maternal use of or exposure to unprescribed controlled substances including street drugs or in which there is history or evidence of maternal trauma;\n(17) unexpected deaths of children;\n(18) solid organ donors;\n(19) unidentified bodies;\n(20) skeletonized remains;\n(21) deaths occurring within 24 hours of arrival at a health care facility if death is unexpected;\n(22) deaths associated with the decedent's employment;\n(23) deaths of nonregistered hospice patients or patients in nonlicensed hospice programs; and\n(24) deaths attributable to acts of terrorism.\nThe coroner or medical examiner shall determine the extent of the coroner's or medical examiner's investigation, including whether additional investigation is needed by the coroner or medical examiner, jurisdiction is assumed, or an autopsy will be performed, subject to subdivision 2b.\nFor deaths occurring within a facility licensed by the Department of Corrections, the coroner or medical examiner shall ensure that a forensic pathologist who is certified by the American Board of Pathology reviews each death and performs an autopsy on all unnatural, unattended, or unexpected deaths and others as necessary.\nEach coroner and medical examiner shall establish a registration policy regarding hospice patients. If a hospice patient is determined to be properly preregistered, the coroner or medical examiner may treat the death as attended by a physician.\nSubject to subdivision 2b, the coroner or medical examiner may order an autopsy, at the coroner or medical examiner's sole discretion, in the case of any human death referred to in subdivision 1, when, in the judgment of the coroner or medical examiner the public interest would be served by an autopsy. The autopsy shall be performed without unnecessary delay. A report of the facts developed by the autopsy and findings of the person performing the autopsy shall be made promptly and filed in the office of the coroner or medical examiner. When further investigation is deemed advisable, a copy of the report shall be delivered to the county attorney. Every autopsy performed pursuant to this subdivision shall, whenever practical, be performed in the county morgue. Nothing herein shall require the coroner or medical examiner to order an autopsy upon the body of a deceased person if the person died of known or ascertainable causes or had been under the care of a licensed physician immediately prior to death or if the coroner or medical examiner determines the autopsy to be unnecessary.\nAutopsies performed pursuant to this subdivision may include the removal, retention, testing, or use of organs, parts of organs, fluids or tissues, at the discretion of the coroner or medical examiner, when removal, retention, testing, or use may be useful in determining or confirming the cause of death, mechanism of death, manner of death, identification of the deceased, presence of disease or injury, or preservation of evidence. Such tissue retained by the coroner or medical examiner pursuant to this subdivision shall be disposed of in accordance with standard biohazardous hospital or surgical material and does not require specific consent or notification of the legal next of kin. When removal, retention, testing, and use of organs, parts of organs, fluids, or tissues is deemed beneficial, and is done only for research or the advancement of medical knowledge and progress, written consent or documented oral consent shall be obtained from the legal next of kin, if any, of the deceased person prior to the removal, retention, testing, or use.\nThe coroner or medical examiner shall conduct an autopsy or require that one be performed in the case of a death reported to the coroner or medical examiner by the state fire marshal or a chief officer under section 299F.04, subdivision 5, and apparently caused by fire, and in which the decedent is pronounced dead outside of a hospital or in which identification of the decedent has not been confirmed. If the decedent has died in a hospital and identification is not in question, an autopsy may be performed or ordered by the coroner or medical examiner.\n(a) For purposes of this subdivision:\n(1) \"compelling state interest\" means that:\n(i) the autopsy is necessary to investigation of a suspicious death or suspected crime;\n(ii) the autopsy is necessary to prevent a potential public health threat and essential to ascertain the cause or manner of death;\n(iii) the autopsy is necessary to ascertain the cause or manner of death following an unexpected death, regardless of the decedent's underlying disease, in order to protect the public's health;\n(iv) the autopsy is necessary to obtain proper toxicologic or other specimens that may represent evidence of a crime and may deteriorate over time;\n(v) the death is an unexpected and unexplained death of a child;\n(vi) the death is associated with police action;\n(vii) the death is unnatural, unattended, or unexpected and occurred within a facility licensed by the Department of Corrections, a secure treatment facility, as defined in section 246.71, subdivision 5, or within a facility as defined in section 626.5572, subdivision 6, but excluding deaths that occurred in the home of the decedent or a caregiver of the decedent;\n(viii) the death is due to acute workplace injury;\n(ix) the death is caused by apparent electrocution;\n(x) the death is caused by unwitnessed or suspected drowning;\n(xi) the body is unidentified and the autopsy may aid in identification;\n(xii) the body is skeletonized but not subject to the provisions of section 307.08;\n(xiii) the death appears to be caused by fire or explosion; or\n(xiv) the need for an autopsy is otherwise established under paragraph (g);\n(2) \"religious beliefs\" means the recognized tenets, understandings, customs, or rites of any culture or recognized religion as they apply to activities described in section 149A.01, subdivision 3, paragraph (b);\n(3) \"religious grounds\" means that performance of an autopsy is contrary to the religious beliefs of the decedent or the decedent included a religious objection to an autopsy in the decedent's health care directive; and\n(4) \"representative of the decedent\" or \"representative\" means the person or persons with the right to control and duty of disposition of the body of the decedent under section 149A.80, subdivision 2.\n(b) The coroner or medical examiner shall, as soon as possible, but no more than 24 hours after the discovery of the decedent's body, exercise good faith efforts to give verbal or written notice to the representative of the decedent of the intended autopsy. This verbal or written notice must include providing written materials explaining the death investigation process or providing the representative the office's website address where this information is located. These written materials and website must include information regarding Minnesota's law concerning religious objections to autopsies. A record summarizing verbal communication with a representative must be maintained indefinitely in the coroner or medical examiner's records. If, despite a good faith effort, a representative of the decedent cannot be found within 24 hours of the discovery of the decedent's body, the autopsy may proceed without further delay.\n(c) If the representative of the decedent does not object to the autopsy on religious grounds, the autopsy may be performed without delay.\n(d) If the representative of the decedent objects to the autopsy on religious grounds, an autopsy must not be performed unless the coroner or medical examiner determines that there is a compelling state interest to perform the autopsy. The coroner or medical examiner may require a representative of the decedent or a person representing a class of representatives to present an affidavit stating the person's relationship to the decedent, any religious affiliation of the decedent, that the decedent had a religious objection to an autopsy and the basis for that belief, and that the person will assume responsibility for the lawful disposition of the body of the deceased.\n(e) If the coroner or medical examiner determines that a compelling state interest to perform an autopsy exists under paragraph (a), clause (1), items (i) to (xiii), the autopsy may proceed without further delay.\n(f) The district court may waive the waiting period under paragraph (b) upon ex parte motion if it determines that the delay may prejudice the accuracy of the autopsy or threaten public health.\n(g) If the coroner or medical examiner determines that there is a compelling state interest to perform an autopsy under circumstances not described in paragraph (a), clause (1), items (i) to (xiii), and the representative of the decedent objects based on religious grounds and submits written information to the coroner or medical examiner showing reason to believe that the autopsy is contrary to the religious beliefs of the decedent, the coroner or medical examiner may bring an action in district court for an order authorizing the autopsy. The action must be brought by notice of an order to show cause served on the representative of the decedent or, if the representative is not available, on another party if directed by the court. The proceeding must be determined summarily upon the petition and the oral or written evidence offered by the parties. The court shall grant the relief sought in the petition if it finds that the petitioner demonstrates by a preponderance of the evidence that the autopsy is necessary and that need outweighs the state's interest in observing the decedent's religious beliefs. If the petition is denied and no stay is granted by the court, the body must immediately be released in accordance with chapter 149A.\n(h) Autopsies performed after a religious objection under this subdivision must be the least intrusive procedure consistent with the state's compelling interest in performing the autopsy. This subdivision does not prohibit a coroner or medical examiner from obtaining voluntary permission from a representative of the decedent to conduct an examination and inquiry involving less intrusive means than an autopsy.\n(i) A coroner or medical examiner is not liable for the failure to perform an autopsy if an objection to the autopsy on religious grounds has been made under this subdivision.\n(j) In a court proceeding related to this subdivision, the petitioner may file data that are investigative data under section 13.83, subdivision 4, under seal with the court. The data must be examined by the court in camera. The investigative data filed with the court remain confidential consistent with the provisions of section 13.83, subdivision 4, except where disclosure is ordered as provided by section 13.83, subdivision 7.\n(k) Actions or determinations by the coroner or medical examiner under this subdivision are exempt from chapter 14.\nThe coroner or medical examiner may exhume any human body and perform an autopsy on it in the case of any human death referred to in subdivision 1 when the coroner or medical examiner judges that the public interest requires an autopsy. No exhumation shall be conducted unless the surviving legal next of kin consents to it, or the district court of the county where the body is located or buried orders it. Notice of such exhumation shall be given as directed by the district court. Application for an order may be made by the coroner, medical examiner, or county attorney of the county where the body is located or buried, and shall be granted upon a showing that the court deems appropriate.\nIf during an investigation the coroner or medical examiner believes the assistance of pathologists, toxicologists, laboratory technicians, or other medical, scientific, or forensic experts is necessary to determine or confirm the cause or manner of death, identification, time of death, or to address other issues requiring expert opinion, the coroner or medical examiner may obtain their assistance.\nAn inquest into a death may be held at the request of the medical examiner and the county attorney or the coroner and the county attorney. An inquest is optional and the coroner or medical examiner may investigate and certify a death without one. The coroner or medical examiner and county attorney may decide how to empanel the inquest. Inquest records will be made public, but the record and report of the inquest proceedings may not be used in evidence in any civil action arising out of the death for which an inquest was ordered. Whenever the decision is made to hold an inquest, the county attorney may issue subpoenas for witnesses and enforce their attendance. The persons served with subpoenas shall be allowed the same compensation and be subject to the same enforcement and penalties as provided by rule 22 of the Minnesota Rules of Criminal Procedure.\nThe coroner or medical examiner shall keep full and complete records, properly indexed, giving the name, if known, of every person whose death is investigated, the place where the body was found, the date, cause, and manner of death, and all other available information concerning the death that the coroner or medical examiner considers pertinent. These records of the coroner or medical examiner are the property of the county and subject to chapter 13. These records shall be kept at the coroner's or medical examiner's office, unless no storage space is available. They shall then be kept with official county records and only released in accordance with the Data Practices Act. Records shall be kept in accordance with section 15.17.\nDeaths of the types described in this section must be promptly reported for investigation to the coroner or medical examiner and, when appropriate, to the law enforcement agency with jurisdiction, by the law enforcement officer, attending physician, health care professional, mortician or funeral director, person in charge of the public institutions referred to in subdivision 1, or anyone who discovers a deceased person. In a case in which a crime may be involved, the coroner or medical examiner shall promptly notify the law enforcement agency with jurisdiction over a criminal investigation of the death.\nExcept for health data defined in section 13.3805, subdivision 1, paragraph (a), clause (2), health-related records or data on a decedent whose death is being investigated under this section shall be made promptly available to the coroner or medical examiner, upon the coroner's or medical examiner's written request, by any person, agency, entity, or organization having custody of, possession of, access to, or knowledge of the records or data. This provision includes records and data, whether recorded or unrecorded, including but not limited to, records and data, including medical imaging, concerning medical, surgical, psychiatric, psychological, substance use disorder, or any other consultation, diagnosis, or treatment. In cases involving a stillborn infant or the death of a fetus or infant less than one year of age, the prenatal records on the decedent's mother may also be subpoenaed by the coroner or medical examiner. The coroner or medical examiner shall pay the reasonable costs of copies of records or data so provided under this section. Data collected or created pursuant to this subdivision relating to any psychiatric, psychological, or mental health consultation with, diagnosis of, or treatment of the decedent whose death is being investigated shall remain confidential or protected nonpublic data, except that the coroner's or medical examiner's final summary report may contain a summary of, or references to, such data. Where records of a decedent become part of the medical examiner's or coroner's file, they are not subject to subpoena or a request for production directed to the medical examiner or coroner. Body fluids, slides, tissue, organ specimens, radiographs, monitor records, video or other recordings, and any other material or article of diagnostic value obtained from the decedent prior to death shall be made available to the coroner or medical examiner upon request. Notwithstanding the provisions of sections 13.384 and 595.02, the coroner or medical examiner shall have the power to subpoena any and all documents, records, including medical records, and papers deemed useful in the investigation of a death.\nRecords and reports, including those of autopsies performed, generated, and certified by the coroner or medical examiner shall be admissible as evidence in any court or grand jury proceeding. The admissibility of such evidence under this subdivision shall not include statements made by witnesses or other persons unless otherwise admissible.\nUpon notification of the death of any person as defined in this section, the coroner or medical examiner staff or their designee may proceed to the body, take charge of it, and arrange for transfer of it, when appropriate. This provision also applies to bones, body parts, and specimens that may be human remains. Discovery of such bones, body parts, and specimens must be promptly reported to the coroner or medical examiner. When necessary, the coroner or medical examiner staff, in coordination with the applicable law enforcement agency, may order that there be no interference with or compromise of the body or the scene of death. In the event a person is transported to an emergency vehicle or facility and pronounced dead, the scene of death shall include the original location of the decedent when first discovered to be ill, unresponsive, or stricken prior to removal by emergency medical personnel. Any person violating such an order is guilty of a gross misdemeanor. The coroner or medical examiner staff shall make inquiry regarding the cause and manner of death and, in cases that fall under the medical examiner's or coroner's jurisdiction, prepare written findings together with the report of death and its circumstances, which shall be filed in the office of the coroner or medical examiner.\nThe coroner or medical examiner shall deliver to the county attorney copies of reports or other information created by the coroner's or medical examiner's office in any cases of a potential criminal nature.\nIf a child under the age of two years dies suddenly and unexpectedly, the parents or guardian of the child shall be promptly notified of the availability of counseling services.\nMS 2004 [Repealed by amendment, 2006 c 260 art 8 s 9]\nIf the coroner or medical examiner is informed by a physician that a decedent is suspected of having had Alzheimer's disease, the coroner or medical examiner may authorize the removal of the brain for the purposes of section 145.131.",
	"repealed": false
}