{
	"id": "500.217",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.217",
	"title": "500.217 RESTRICTIONS ON CHILD CARE PROHIBITIONS.",
	"text": "(a) Except as otherwise provided in this section and notwithstanding any covenant, restriction, or condition contained in a deed, security instrument, homeowners association document, or any other instrument affecting the transfer, sale of, or an interest in real property, a private entity must not prohibit, unreasonably restrict, or refuse to permit the owner of a dwelling from providing child care under a family and group family child care provider license under chapter 245A, and Minnesota Rules, chapter 9502. A private entity must not impose a fee, assessment, or other cost upon the owner of a dwelling in connection with providing child care.\n(b) A private entity may require an owner or occupant who is seeking licensure or who is a license holder to indemnify, hold harmless, or defend the private entity against all claims, including costs and attorney fees, related to the operation of a family or group family child care program. The private entity may require each parent, guardian, or caretaker of the child being cared for in the program to sign a waiver of claims for liability, provided that the waiver is reasonable, consistent with industry standards, and does not require notarization.\n(c) The homeowners association is not required to amend the homeowners association documents to meet a licensing requirement, except when the homeowners association documents are inconsistent with the requirements of this section. Nothing in this section prevents an owner or occupant from using provided or legal remedies to amend the homeowners association documents or from requesting a variance from those requirements.\n(d) A license holder who is an owner occupant and all invitees are subject to the rules and regulations contained in the homeowners association documents of the private entity except where those rules and regulations conflict with this section.\n(e) For the purposes of this section, the following terms have the meanings given:\n(1) \"private entity\" means a homeowners association, community association, or other association that is subject to a homeowners association document; and\n(2) \"homeowners association document\" means a document containing the declaration, articles of incorporation, bylaws, or rules and regulations of a common interest community, as defined in section 515B.1-103, regardless of whether the common interest community is subject to chapter 515B, or a residential community that is not a common interest community.\n(f) This section only applies to:\n(1) a single-family detached dwelling whose owner is the sole owner of the entire building in which the dwelling is located and who is solely responsible for the maintenance, repair, replacement, and insurance of the entire building; or\n(2) a multifamily attached dwelling whose owner is the sole owner of the entire building in which the dwelling is located and who is solely responsible for the maintenance, repair, replacement, and insurance of the entire building.",
	"repealed": false
}