{
	"id": "88.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.22",
	"title": "88.22 WILDFIRE PREVENTION; RESTRICTIONS AND PENALTIES.",
	"text": "(a) Road closure. When the commissioner of natural resources shall determine that conditions conducive to wildfire hazards exist in the wildfire areas of the state and that the presence of persons in the wildlife areas tends to aggravate wildfire hazards, render forest trails impassable by driving thereon during wet seasons and hampers the effective enforcement of state timber trespass and game laws, the commissioner may by written order, close any road or trail leading into any land used for any conservation purposes, to all modes of travel except that considered essential such as residents traveling to and from their homes or in other cases to be determined by the authorized forest officers assigned to guard the area.\n(b) Burning ban. The commissioner may also, upon such determination, by written order, suspend the issuance of permits for open fires or prescribed burns, revoke or suspend the operation of a permit previously issued and, to the extent the commissioner deems necessary, prohibit the building of all or some kinds of open fires or prescribed burns in all or any part of a wildfire area regardless of whether a permit is otherwise required; and the commissioner also may, by written order, prohibit smoking except at places of habitation or automobiles or other enclosed vehicles properly equipped with an efficient ash tray.\n(a) The commissioner may close any public or private dumping area, by posting such area as closed to dumping, whenever the commissioner deems it necessary for the prevention of wildfires. Thereafter no person shall deposit refuse of any kind within or adjacent to such closed area, or along the road leading thereto.\n(b) The commissioner shall establish such minimum standards governing public and private dumping areas as the commissioner deems necessary for the prevention of wildfires.\nAny violations of this section is a misdemeanor.",
	"repealed": false
}