{
	"id": "84.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.025",
	"title": "84.025 CONTRACTS FOR PROFESSIONAL AND MAINTENANCE SERVICES.",
	"text": "[Repealed, 1969 c 1129 art 3 s 2]\n[Repealed, 1969 c 1129 art 3 s 2]\n[Repealed, 1969 c 1129 art 3 s 2]\n[Repealed, 1969 c 1129 art 3 s 2]\n[Repealed, 1969 c 1129 art 3 s 2]\n[Repealed, 1977 c 172 s 3]\nThe commissioner of natural resources may contract with the federal government, local governmental units, the University of Minnesota, and other educational institutions, and private persons as may be necessary in the performance of duties. Contracts made pursuant to this section for professional services shall not be subject to the provisions of chapter 16C, as they relate to competitive bidding.\nNotwithstanding any other law to the contrary, the commissioner of natural resources may negotiate contracts, with or without requiring the submission of bids therefor, for the providing of maintenance services for recreational facilities on land under the control of the commissioner of natural resources. The terms and conditions of such contracts shall be as agreed upon and shall be such as to promote and encourage the employment of needy, elderly persons.\n(a) The commissioner of natural resources may bill other governmental units, including tribal governments, and the various programs carried out by the commissioner for the costs of providing them with professional support services. Except as provided under section 89.421, receipts must be credited to a special account in the state treasury and are appropriated to the commissioner to pay the costs for which the billings were made.\n(b) The commissioner of natural resources shall submit to the commissioner of management and budget before the start of each fiscal year a work plan showing the estimated work to be done during the coming year, the estimated cost of doing the work, and the positions and fees that will be necessary. This account is exempted from statewide and agency indirect cost payments.\nThe commissioner shall give preference to engine models manufactured in the United States. All all-terrain vehicles purchased by the commissioner must be manufactured in the state of Minnesota.",
	"repealed": false
}