{
	"id": "490A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/490A.02",
	"title": "490A.02 JUDICIAL STANDARDS BOARD; POWERS.",
	"text": "A judge is disqualified from acting as a judge, without a loss of salary, while there is pending an indictment or any information charging the judge with a crime that is punishable as a felony under either Minnesota law or federal law, or while there is pending a recommendation to the supreme court by the Board on Judicial Standards for the judge's removal or retirement.\nOn receipt of a recommendation of the Board on Judicial Standards or on its own motion, the supreme court may suspend a judge from office without salary when the judge pleads guilty to or no contest to or is found guilty of a crime that is punishable as a felony under either Minnesota law or federal law or any other crime that involves moral turpitude. If the conviction is reversed, the suspension terminates and the judge must be paid a salary for the period of suspension. If the judge is suspended and the conviction becomes final, the supreme court shall remove the judge from office.\nOn receipt of a recommendation of the Board on Judicial Standards, the supreme court may retire a judge for a disability that the court determines seriously interferes with the performance of the judge's duties and is or is likely to become permanent, and censure or remove a judge for an action or inaction that may constitute persistent failure to perform the judge's duties, incompetence in performing the judge's duties, habitual intemperance, or conduct prejudicial to the administration of justice that brings the judicial office into disrepute.\nThe board is specifically empowered to reopen any matter wherein any information or evidence was previously precluded by a statute of limitations or by a previously existing provision of time limitation.\n(a) A judge who is retired by the supreme court must be considered to have retired voluntarily.\n(b) This section and section 490A.01 must not affect the right of a judge who is suspended, retired, or removed hereunder from qualifying for any pension or other retirement benefits to which the judge would otherwise be entitled by law to receive.\nA judge removed by the supreme court is ineligible for any future service in a judicial office. The question of the right of a removed judge to practice law in this state must be referred to the proper authority for review.\nThe supreme court shall make rules to implement this section.",
	"repealed": false
}