{
	"id": "204B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.14",
	"title": "204B.14 ELECTION PRECINCTS.",
	"text": "The governing body of each municipality shall establish the boundaries of the election precincts in the municipality. The governing body of a county shall establish the boundaries of precincts in unorganized territory in the county. Except as provided in subdivision 3, a governing body may change the boundaries of any election precinct which it has established.\nIt is the intention of the legislature to complete congressional and legislative redistricting activities in time to permit counties and municipalities to begin the process of reestablishing precinct boundaries as soon as possible after the adoption of the congressional and legislative redistricting plans but in no case later than 25 weeks before the state primary election in the year ending in two.\n(a) The following shall constitute at least one election precinct:\n(1) each city ward; and\n(2) each town and each statutory city.\n(b) A single, accessible, combined polling place may be established no later than November 1 if a presidential nomination primary is scheduled to occur in the following year or May 1 of any other year:\n(1) for any city of the third or fourth class, any town, or any city having territory in more than one county, in which all the voters of the city or town shall cast their ballots;\n(2) for contiguous precincts in the same municipality;\n(3) for up to four contiguous municipalities located entirely outside the metropolitan area, as defined by section 200.02, subdivision 24, that are contained in the same county; or\n(4) for noncontiguous precincts located in one or more counties.\nSubject to the requirements of paragraph (c), a single, accessible, combined polling place may be established after May 1 of any year in the event of an emergency.\nA copy of the ordinance or resolution establishing a combined polling place must be filed with the county auditor within 30 days after approval by the governing body, and the county auditor must provide notice within ten days to the secretary of state, in a manner and including information prescribed by the secretary of state. A polling place combined under clause (3) must be approved by the governing body of each participating municipality. A polling place combined under clause (4) must be approved by the governing body of each participating municipality and the secretary of state and may be located outside any of the noncontiguous precincts. A municipality withdrawing from participation in a combined polling place must do so by filing a resolution of withdrawal with the county auditor no later than October 1 if a presidential nomination primary is scheduled to occur in the following year or April 1 of any other year, and the county auditor must provide notice within ten days to the secretary of state, in a manner and including information prescribed by the secretary of state.\nThe secretary of state shall provide a separate polling place roster for each precinct served by the combined polling place, except that in a precinct that uses electronic rosters the secretary of state shall provide separate data files for each precinct. A single set of election judges may be appointed to serve at a combined polling place. The number of election judges required must be based on the total number of persons voting at the last similar election in all precincts to be voting at the combined polling place. Separate ballot boxes must be provided for the ballots from each precinct. The results of the election must be reported separately for each precinct served by the combined polling place, except in a polling place established under clause (2) where one of the precincts has fewer than ten registered voters, in which case the results of that precinct must be reported in the manner specified by the secretary of state.\n(c) If a local elections official determines that an emergency situation preventing the safe, secure, and full operation of a polling place on election day has occurred or is imminent, the local elections official may combine two or more polling places for that election pursuant to this subdivision. To the extent possible, the polling places must be combined and the election conducted according to the requirements of paragraph (b), except that:\n(1) polling places may be combined after May 1 and until the polls close on election day;\n(2) any city or town, regardless of size or location, may establish a combined polling place under this paragraph;\n(3) the governing body is not required to adopt an ordinance or resolution to establish the combined polling place;\n(4) a polling place combined under paragraph (b), clause (3) or (4), must be approved by the local election official of each participating municipality;\n(5) the local elections official must immediately notify the county auditor and the secretary of state of the combination, including the reason for the emergency combination and the location of the combined polling place. As soon as possible, the local elections official must also post a notice stating the reason for the combination and the location of the combined polling place. The notice must also be posted on the governing board's website, if one exists. The local elections official must also notify the election judges and request that local media outlets publicly announce the reason for the combination and the location of the combined polling place; and\n(6) on election day, the local elections official must post a notice in large print in a conspicuous place at the polling place where the emergency occurred, if practical, stating the location of the combined polling place. The local election official must also post the notice, if practical, in a location visible by voters who vote from their motor vehicles as provided in section 204C.15, subdivision 2. If polling place hours are extended pursuant to section 204C.05, subdivision 2, paragraph (b), the posted notices required by this paragraph must include a statement that the polling place hours at the combined polling place will be extended until the specified time.\n(a) Notwithstanding other law or charter provisions to the contrary, during the period from January 1 in any year ending in zero to the time when the legislature has been redistricted in a year ending in one or two, no changes may be made in the boundaries of any election precinct except as provided in this subdivision.\n(b) If a city annexes an unincorporated area located in the same county as the city and adjacent to the corporate boundary, the annexed area may be included in an election precinct immediately adjacent to it.\n(c) A municipality or county may establish new election precincts lying entirely within the boundaries of any existing precinct and shall assign names to the new precincts which include the name of the former precinct.\n(d) Precinct boundaries in a city of the first class electing council members by wards may be reestablished within four weeks of the adoption of ward boundaries in a year ending in one, as provided in section 204B.135, subdivision 1. If precinct boundaries are reestablished in a year ending in one, the city council must designate polling places for each election precinct pursuant to section 204B.16, subdivision 1, within 30 days of establishing precinct boundaries. The polling place designations are effective for the year ending in one.\n(e) Precinct boundaries must be reestablished within 60 days of the time when the legislature has been redistricted, or at least 19 weeks before the state primary election in a year ending in two, whichever comes first. The governing body of each municipality and of each county with precincts in unorganized territory must designate polling places for each election precinct pursuant to section 204B.16, subdivision 1, within 30 days of establishing precinct boundaries or at least 19 weeks before the state primary election in a year ending in two, whichever comes first. The adoption of reestablished precinct boundaries and polling places becomes effective on the date of the state primary election in the year ending in two.\n(f) Precincts must be arranged so that no precinct lies in more than one legislative or congressional district.\nAny change in the boundary of an election precinct must be adopted at least ten weeks before the date of the next election and, for the state primary and general election or presidential nomination primary, no later than December 1 in the year prior to the year of the state general election. The precinct boundary change shall not take effect until notice of the change has been posted in the office of the municipal clerk or county auditor for at least 56 days.\nThe county auditor must publish a notice illustrating or describing the congressional, legislative, and county commissioner district boundaries in the county in one or more qualified newspapers in the county at least 14 days before the first day to file affidavits of candidacy for the state general election in the year ending in two.\nAlternate dates for adopting changes in precinct boundaries, posting notices of boundary changes, and notifying voters affected by boundary changes pursuant to this subdivision, and procedures for coordinating precinct boundary changes with reestablishing local government election district boundaries may be established in the manner provided in the rules of the secretary of state.\nA change in the boundary of an election precinct that has occurred as a result of a municipal boundary adjustment made under chapter 414 that is effective more than 21 days before a regularly scheduled election takes effect at the scheduled election.\nA change in the boundary of an election precinct that has occurred as a result of a municipal boundary adjustment made under chapter 414 that is effective less than 21 days before a regularly scheduled election takes effect the day after the scheduled election.\nIf a precinct boundary has been changed or an annexation has occurred affecting a precinct boundary, the municipal clerk shall immediately notify the county auditor and secretary of state. The municipal clerk shall file a corrected base map with the secretary of state and county auditor within 30 days after the boundary change was made or, in the case of an annexation, the later of: (1) 30 days after the approval of the annexation order; or (2) the effective date of the annexation order. Upon request, the county auditor shall provide a base map and precinct finder to the municipal clerk. The municipal clerk shall prepare a corrected precinct map and provide the corrected map to the county auditor, who shall correct the precinct finder in the statewide voter registration system and make the corrected map and precinct finder available for public inspection, and to the secretary of state, who shall update the precinct boundary database. The county auditor shall prepare and file precinct boundary maps for precincts in unorganized territories in the same manner as provided for precincts in municipalities. For every election held in the municipality the election judges shall be furnished precinct maps as provided in section 201.061, subdivision 6. If a municipality changes the boundary of an election precinct, or if an annexation affecting a precinct boundary occurs, the county auditor shall notify each school district with territory affected by the boundary change at least 30 days before the effective date of the change.\n[Repealed, 2015 c 70 art 1 s 63]\nNotwithstanding the provisions of section 410.21, or any other law, ordinance or charter to the contrary, the provisions of subdivisions 1 and 3 apply to all municipalities.\n[Repealed, 1994 c 607 s 7]",
	"repealed": false
}