{
	"id": "168A.1411",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.1411",
	"title": "168A.1411 MANUFACTURED HOME AFFIXED TO REAL PROPERTY OWNED BY COOPERATIVE.",
	"text": "(a) When a manufactured home is to be affixed or is affixed, as defined in section 273.125, subdivision 8, paragraph (b), to real property owned by a Minnesota nonprofit corporation or a Minnesota cooperative, the owner of the manufactured home may surrender the manufacturer's certificate of origin or certificate of title to the department for cancellation so that the manufactured home becomes an improvement to real property and is no longer titled as personal property. The department must not issue a certificate of title for a manufactured home under chapter 168A if the manufacturer's certificate of origin is or has been surrendered under this subdivision, except as provided in section 168A.142. Upon surrender of the manufacturer's certificate of origin or the certificate of title, the department must issue notice of surrender to the owner and upon recording an affidavit of affixation, which the county recorder or registrar of titles, as applicable, must accept, the manufactured home is deemed to be an improvement to real property. An affidavit of affixation by the owner of the manufactured home must include the following information:\n(1) the name, residence address, and mailing address of the owner or owners of the manufactured home;\n(2) the legal description of the real property in which the manufactured home is, or will be, located;\n(3) a copy of the surrendered manufacturer's certificate of origin or certificate of title and the notice of surrender;\n(4) a written statement from the county auditor or county treasurer of the county where the manufactured home is located stating that all property taxes payable in the current year, as provided under section 273.125, subdivision 8, paragraph (b), have been paid or are not applicable; and\n(5) the signature of the person who executes the affidavit, properly executed before a person authorized to authenticate an affidavit in this state.\n(b) A certified copy of the affidavit must be delivered to the county auditor of the county in which the real property to which the manufactured home was affixed is located.\n(c) The department is not liable for any errors, omissions, misstatements, or other deficiencies or inaccuracies in documents presented to the department under this section if the documents presented appear to satisfy the requirements of this section. The department has no obligation to investigate the accuracy of statements contained in the documents.\nAn affidavit of affixation must be in substantially the following form and must contain the following information:\nMANUFACTURED HOME AFFIDAVIT OF AFFIXATION IN A COOPERATIVE\nPURSUANT TO MINNESOTA STATUTES, SECTION 168A.1411\nHomeowner, being duly sworn, on his or her oath, states as follows:\n1. Homeowner owns the manufactured home (\"home\") described as follows:\n2. A copy of the surrendered manufacturer's certificate of origin or certificate of title is attached.\n3. A copy of the notice of surrender issued from the Minnesota Department of Public Safety Driver and Vehicle Services is attached.\n4. The home is or will be located at the following \"Property Address\":\n5. The legal description of the property address (\"land\") is as follows or as attached hereto:\n6. The owner of the land is a Minnesota nonprofit corporation or Minnesota cooperative that owns the land and whose membership entitles the homeowner to occupy a specific portion of the land.\n7. The home ....... is, or ....... will be promptly upon delivery, anchored to the land by attachment to a permanent foundation and connected to appropriate residential utilities (e.g., water, gas, electricity, sewer).\n8. The homeowner intends that the home be an immovable permanent improvement to the land, free of any personal property security interest.\n9. A copy of the written statement from the county auditor or county treasurer of the county in which the manufactured home is then located, stating that all property taxes payable in the current year (pursuant to Minnesota Statutes, section 273.125, subdivision 8, paragraph (b)), have been paid, or are not applicable, is attached.\n10. The home is intended to be assessed and taxed as an improvement to the land.\nSigned and sworn to (or affirmed) before me on ....... (date) by ....... (names of homeowner(s))\nThis instrument was drafted by, and when recorded return to:\nSubscribed and sworn to before me this ....... day of ......., .......\nNotary Stamp or Seal\n(optional)\nLender's Statement of Intent:\nThe undersigned (\"lender\") intends that the home be immovable and a permanent improvement to the land free of any personal property security interest.\nOn the ....... day of ....... in the year ....... before me, the undersigned, a Notary Public in and for said state, personally appeared\npersonally known to me or proved to me on the basis of satisfactory evidence to be the individual(s) whose name(s) is (are) subscribed to the within instrument and acknowledged to me that he/she/they executed the same in his/her/their capacity(ies), and that by his/her/their signature(s) on the instrument, the individual(s), or the person on behalf of which the individual(s) acted, executed the instrument.\nOfficial seal:\n[only if the owner of the land is a Minnesota nonprofit corporation or cooperative]:\nThe undersigned is the .............................. of .................................., a Minnesota [nonprofit corporation or cooperative], which owns the land described above. I hereby certify that the homeowner described above is a member of the [nonprofit corporation or cooperative] whose membership entitles the homeowner to occupy [insert legal description of the homeowner's lot or, if the corporation or cooperative has filed a scaled drawing as permitted by Minnesota Statutes, section 168A.1411, subdivision 5, Lot ................. shown on such scaled drawing].\nThe department may not cancel a certificate of title if, under this chapter, a security interest has been perfected on the manufactured home. If a security interest has been perfected, the department must notify the owner that each secured party must release or satisfy the security interest prior to proceeding with surrender of the manufacturer's certificate of origin or certificate of title to the department for cancellation. Permanent attachment to real property or the recording of an affidavit of affixation does not extinguish an otherwise valid security interest in or tax lien on the manufactured home, unless the requirements of subdivisions 1 to 3, including the release of any security interest, have been satisfied.\nWhen a perfected security interest exists, or will exist, on the manufactured home at the time the manufactured home is affixed to real property, and the owner has not satisfied the requirements of subdivision 1, the owner of the manufactured home, or its secured party, may record a notice with the county recorder, or with the registrar of titles, if the land is registered, stating that the manufactured home located on the property is encumbered by a perfected security interest and is not an improvement to real property. The notice must state the name and address of the secured party as set forth on the certificate of title, the legal description of the real property, and the name and address of the record fee owner of the real property on which the manufactured home is affixed. When the security interest is released or satisfied, the secured party must attach a copy of the release or satisfaction to a notice executed by the secured party containing the county recorder or registrar of titles document number of the notice of security interest. The notice of release or satisfaction must be recorded with the county recorder, or registrar of titles, if the land is registered. Neither the notice described in this subdivision nor the security interest on the certificate of title is deemed to be an encumbrance on the real property. The notices provided for in this subdivision need not be acknowledged.\n(a) If the portion of the land occupied by the homeowner has not been subdivided, the nonprofit or cooperative owner shall have prepared and recorded against the land a scaled drawing prepared by a licensed professional land surveyor who shall certify that:\n(1) the scaled drawing accurately depicts all information required by this subdivision; and\n(2) the work was undertaken by, or reviewed and approved by, the certifying land surveyor.\n(b) The scaled drawing shall show:\n(1) the dimensions and location of all existing material structural improvements and roadways;\n(2) the extent of any encroachments by or upon any portion of the land;\n(3) the location and dimensions of all recorded easements within the land burdening any portion of the land;\n(4) the distance and direction between noncontiguous parcels of real estate;\n(5) the location and dimensions of the front, rear, and side boundaries of each lot that a member of the cooperative or nonprofit corporation has a right to occupy and that lot's unique lot number; and\n(6) the legal description of the land.",
	"repealed": false
}