{
	"id": "469.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.051",
	"title": "469.051 OFFICERS; DUTIES; ORGANIZATIONAL MATTERS.",
	"text": "A port authority may adopt bylaws and rules of procedure and shall adopt an official seal.\nA port authority shall annually elect a president or chair, a vice-president or vice-chair, a treasurer, a secretary, and an assistant treasurer. A commissioner may not serve as president or chair and vice-president or vice-chair at the same time. The other offices may be held by one commissioner. The offices of secretary and assistant treasurer need not be held by a commissioner.\nThe officers have the usual duties and powers of their offices. They may be given other duties and powers by the port authority.\nThe treasurer:\n(1) shall receive and is responsible for port authority money;\n(2) is responsible for the acts of the assistant treasurer;\n(3) shall disburse port authority money by check or electronic procedures;\n(4) shall keep an account of the source of all receipts, and the nature, purpose and authority of all disbursements; and\n(5) shall file the authority's detailed financial statement with its secretary at least once a year at times set by the authority.\nThe assistant treasurer has the powers and duties of the treasurer if the treasurer is absent or disabled.\nThe treasurer shall give bond to the state conditioned for the faithful discharge of official duties. The bond must be approved as to form and surety by the authority and filed with its secretary. The bond must be for twice the amount of money likely to be on hand at any one time, as determined at least annually by the authority except that the bond must not exceed $300,000.\nPort authority money is public money.\nA port authority check must be signed by the treasurer and by one other officer named by the authority in a resolution. The check must state the name of the payee and the nature of the claim that the check is issued for.\nThe port authority's detailed financial statement must show all receipts and disbursements, their nature, the money on hand, the purposes to which the money on hand is to be applied, the authority's credits and assets, and its outstanding liabilities. The authority shall examine the statement together with the treasurer's vouchers. If the authority finds the statement and vouchers correct, it shall approve them by resolution and enter the resolution in its records.",
	"repealed": false
}