{
	"id": "203B.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.21",
	"title": "203B.21 BALLOTS AND ENVELOPES.",
	"text": "Absentee ballots under sections 203B.16 to 203B.27 shall conform to the requirements of the Minnesota Election Law, except that modifications in the size or form of ballots or envelopes may be made if necessary to satisfy the requirements of the United States postal service. The return envelope must be designed in one of the following ways:\n(1) it must be of sufficient size to contain a signature envelope and when the return envelope is sealed, it conceals the signature, identification, and other information; or\n(2) it must be the signature envelope and provide an additional flap that when sealed, conceals the signature, identification, and other information.\nThe flap or the return envelope must be perforated to permit election officials to inspect the returned certificate for completeness or to ascertain other information at any time after receiving the returned ballot without opening the signature envelope.\nBallots and instructions for marking them, ballot envelopes, and return envelopes shall be sent by first class mail to addresses within the continental United States and by air mail to addresses outside the continental United States. The ballot envelope and return envelope shall be marked \"Official Ballot,\" and shall contain sufficient postage to assure proper return delivery. The return envelope shall be addressed to comply with any method for return of absentee ballots as authorized under section 203B.08, subdivision 2. The requirements of this subdivision do not apply to ballots and related materials provided under section 203B.225.\nOn the back of the signature envelope a certificate shall appear with space for:\n(1) the voter's address of present or former residence in Minnesota;\n(2) the voter's current email address, if the voter has one;\n(3) a statement indicating the category described in section 203B.16 to which the voter belongs;\n(4) a statement that the voter has not cast and will not cast another absentee ballot in the same election or elections;\n(5) a statement that the voter personally marked the ballots without showing them to anyone, or if physically unable to mark them, that the voter directed another individual to mark them; and\n(6) the same voter's passport number, Minnesota driver's license or state identification card number, or the last four digits of the voter's Social Security number as provided on the absentee ballot application; if the voter does not have access to any of these documents, the voter may attest to the truthfulness of the contents of the certificate under penalty of perjury.\nThe certificate shall also contain a signed oath in the form required by section 705 of the Help America Vote Act, Public Law 107-252, which must read:\n\"I swear or affirm, under penalty of perjury, that:\nI am a member of the uniformed services or merchant marine on active duty or an eligible spouse or dependent of such a member; a United States citizen temporarily residing outside the United States; or other United States citizen residing outside the United States; and I am a United States citizen, at least 18 years of age (or will be by the date of the election), and I am eligible to vote in the requested jurisdiction; I have not been convicted of a felony, or other disqualifying offense, or been adjudicated mentally incompetent, or, if so, my voting rights have been reinstated; and I am not registering, requesting a ballot, or voting in any other jurisdiction in the United States except the jurisdiction cited in this voting form. In voting, I have marked and sealed my ballot in private and have not allowed any person to observe the marking of the ballot, except for those authorized to assist voters under state or federal law. I have not been influenced.\nThe information on this form is true, accurate, and complete to the best of my knowledge. I understand that a material misstatement of fact in completion of this document may constitute grounds for a conviction for perjury.\"\nNo envelope, return envelope, or instruction to voters shall contain the name of an individual who appears as a candidate on any enclosed ballot.",
	"repealed": false
}