{
	"id": "237.078",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.078",
	"title": "237.078 INFORMAL REVIEW AND RESOLUTION OF DISPUTES.",
	"text": "(a) A telecommunications service provider that is unable to resolve a dispute with another telecommunications service provider concerning a matter subject to commission jurisdiction may file a petition for an informal review of the dispute by the department.\n(b) The petitioner must provide a copy of the petition to the other telecommunications service provider involved in the dispute. Upon receipt of a request for informal review, the department must notify the telecommunications service providers within three days of the procedures to be followed under the informal review process.\n(c) The respondent telecommunications service provider must answer the allegations stated in the petition within five business days of receipt of the petition. The answer must advise the petitioner and the department of the respondent's proposed resolution to the dispute, or provide a timetable to complete an investigation and propose a resolution.\n(d) The petitioner must file a response to the respondent's answer within five business days to inform the respondent and department whether the proposed resolution or proposed timetable is acceptable. If the respondent's resolution is deemed acceptable, the petitioner must notify the department and the respondent that the department may suspend or terminate the informal review process. If the resolution proposed by the respondent is not acceptable, the petitioner must state how the proposal should be modified in order to be acceptable. If the respondent's answer proposes a timetable to complete any investigation and offer a resolution that the petitioner deems unacceptable, the petitioner must identify any harm that may occur as a result of the proposed timetable.\n(e) If a dispute remains after the answer and response are filed, the department must make reasonable efforts to gather any additional facts and investigate alternatives to resolve the dispute within 20 calendar days of the date of its receipt of the petitioner's response. The petitioning and respondent telecommunications service providers must provide any documents, data, or other information requested by the department and needed to evaluate the dispute within five business days of the department's request, or as expeditiously as possible if the information requested cannot be provided within the five business days. The department must work with the telecommunications service providers to explore alternatives and provide guidance regarding how the department believes the matter should be resolved. The department may dismiss a petition for informal review if the department finds the complaint to be without merit. A dismissal by the department under this paragraph does not prejudice the petitioning telecommunications service provider from filing a formal complaint with the Public Utilities Commission under section 237.081.\n(f) The department may petition the commission to review a dispute or complaint in any case the department deems appropriate.\n(g) While a dispute is subject to an informal review by the department under this section, a telecommunications service provider is prohibited from terminating telecommunications service, subject to the right to terminate service as otherwise permitted by law.",
	"repealed": false
}