{
	"id": "582.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.032",
	"title": "582.032 FIVE-WEEK REDEMPTION PERIOD; CERTAIN ABANDONED PROPERTIES.",
	"text": "This section applies to mortgages executed after December 31, 1989, under which there has been a default in the payment of money existing for at least 60 days as of the date of the filing of the complaint or motion provided for in this section. This section applies only when the mortgaged premises are:\n(1) ten acres or less in size;\n(2) improved with a residential dwelling consisting of less than five units which is neither a model home nor a dwelling under construction; and\n(3) not property used in agricultural production.\nThis section applies to foreclosures by action under chapter 581 and to foreclosures by advertisement under chapter 580.\nNotwithstanding section 580.23 or 581.10, if at any time before the foreclosure sale but not more than 30 days before the first publication of the notice of sale, a court order is entered reducing the mortgagor's redemption period to five weeks under subdivision 7, after the mortgaged premises have been sold as provided in chapter 580 or 581, the mortgagor, and the mortgagor's personal representatives or assigns, within five weeks after the sale under chapter 580, or within five weeks after the date of the order confirming the sale under chapter 581, may redeem the mortgaged premises as provided in section 580.23, subdivision 1, or 581.10, as applicable.\nNotwithstanding section 580.23 or 581.10, if at any time after the foreclosure sale, a court order is entered reducing the mortgagor's redemption period under subdivision 7, the period during which the mortgagor, the mortgagor's personal representatives and assigns, may redeem the mortgaged premises in accordance with the provisions of section 580.23, subdivision 1, or section 581.10, as applicable, is reduced so as to expire five weeks from the date the order is entered. Within ten days after the order is entered, a certified copy of the order must be filed with the office of the county recorder or registrar of titles for the county in which the mortgaged premises are located, and a copy of the order must be posted in a conspicuous place on the mortgaged premises. Within ten days of the order's entry, a copy of the order must be sent by certified mail to any party holding a lien or interest of record junior to the foreclosed mortgage who has filed with the county recorder or registrar of titles a certificate identifying the lienholder and the lien claimed, stating the lienholder's address and the legal description of the property covered by the lien, and requesting notice of any postforeclosure sale reduction of the mortgagor's redemption period for any superior lien. Affidavits of posting and mailing to evidence the same are prima facie evidence of the facts stated therein and are entitled to recordation along with the certified copy of the order.\nIn a foreclosure by advertisement, the party foreclosing a mortgage or holding the sheriff's certificate of sale or the political subdivision in which the mortgaged premises are located may initiate a proceeding in district court to reduce the mortgagor's redemption period under this section. The proceeding must be initiated by the filing of a complaint, naming the mortgagor, or the mortgagor's personal representatives or assigns of record, as defendant, in district court for the county in which the mortgaged premises are located. If the proceeding is initiated by a political subdivision, the party foreclosing the mortgage or holding the sheriff's certificate of sale must also be named as a defendant, and the summons and complaint shall be delivered by certified mail to the foreclosing attorney. If the proceeding is commenced after the foreclosure sale, the holders of junior liens and interests entitled to notice under subdivision 3 must also be named as defendants. The complaint must identify the mortgaged premises by legal description and must identify the mortgage by the names of the mortgagor and mortgagee, and any assignee of the mortgagee; the date of its making; and pertinent recording information. The complaint must allege that the mortgaged premises are:\n(1) ten acres or less in size;\n(2) improved with a residential dwelling consisting of less than five units, which is not a model home or a dwelling under construction;\n(3) not property used in agricultural production; and\n(4) abandoned.\nThe complaint must request an order reducing the mortgagor's redemption period to five weeks. When the complaint has been filed, the court shall issue a summons commanding the person or persons named in the complaint to appear before the court on a day and at a place stated in the summons. The appearance date shall be not less than 15 nor more than 25 days from the date of the issuing of the summons. A copy of the filed complaint must be attached to the summons.\nIn a foreclosure by action, the plaintiff or the holder of the sheriff's certificate may make a motion to reduce the mortgagor's redemption period under this section. The political subdivision in which the mortgaged premises are located may intervene in the action and make a motion to reduce the redemption period. The motion must conform generally to the pleading requirements provided in subdivision 4. For purposes of the motion, the court has continuing jurisdiction over the parties and the mortgaged premises through the expiration of the redemption period. When the motion has been filed, the court shall issue an order to show cause commanding the parties it considers appropriate to appear before the court on a day and at a place stated in the order. The appearance date may not be less than 15 nor more than 25 days after the date of the order to show cause. A copy of the motion must be attached to the order to show cause.\nThe summons or order to show cause may be served by any person not named a party to the action. The summons or order to show cause must be served at least seven days before the appearance date, in the manner provided for service of a summons in a civil action in the district court. If the defendant cannot be found in the county, the summons or order to show cause may be served by sending a copy by certified mail to the defendant's last known address, if any, at least ten days before the appearance date. The summons or order to show cause must be posted in a conspicuous place on the mortgaged premises not less than seven days before the appearance date. If personal or certified mail service cannot be made on a defendant, then the plaintiff or plaintiff's attorney may file an affidavit to that effect with the court and service by posting the summons or order to show cause on the mortgaged premises is sufficient as to that defendant.\nAt the hearing on the summons and complaint or order to show cause, the court shall enter an order reducing the mortgagor's redemption period as provided in subdivision 2 or 3, as applicable, if evidence is presented supporting the allegations in the complaint or motion and no appearance is made to oppose the relief sought. An affidavit by the sheriff or a deputy sheriff of the county in which the mortgaged premises are located, or of a building inspector, zoning administrator, housing official, or other municipal or county official having jurisdiction over the mortgaged premises, stating that the mortgaged premises are not actually occupied and further setting forth any of the following supporting facts, is prima facie evidence of abandonment:\n(1) windows or entrances to the premises are boarded up or closed off, or multiple window panes are broken and unrepaired;\n(2) doors to the premises are smashed through, broken off, unhinged, or continuously unlocked;\n(3) gas, electric, or water service to the premises has been terminated;\n(4) rubbish, trash, or debris has accumulated on the mortgaged premises;\n(5) the police or sheriff's office has received at least two reports of trespassers on the premises, or of vandalism or other illegal acts being committed on the premises; or\n(6) the premises are deteriorating and are either below or are in imminent danger of falling below minimum community standards for public safety and sanitation.\nAn affidavit of the party foreclosing the mortgage or holding the sheriff's certificate, or one of their agents or contractors, stating any of the above supporting facts, and that the affiant has changed locks on the mortgaged premises under section 582.031 and that for a period of ten days no party having a legal possessory right has requested entrance to the premises, is also prima facie evidence of abandonment. Either affidavit described above, or an affidavit from any other person having knowledge, may state facts supporting any other allegations in the complaint or motion and is prima facie evidence of the same. Written statements of the mortgagor, the mortgagor's personal representatives or assigns, including documents of conveyance, which indicate a clear intent to abandon the premises, are conclusive evidence of abandonment. In the absence of affidavits or written statements, or if rebuttal evidence is offered by the defendant or a party lawfully claiming through the defendant, the court may consider any competent evidence, including oral testimony, concerning any allegation in the complaint or motion. A defendant's failure to appear at the hearing after service of process in compliance with subdivision 6 is conclusive evidence of abandonment by the defendant, subject to vacation under Rule 60.02 of the Minnesota Rules of Civil Procedure. An order entered under this section must contain a legal description of the mortgaged premises.\nA certified copy of an order reducing a mortgagor's redemption period entered under this section may be recorded in the office of the county recorder or registrar of titles for the county in which the mortgaged premises are located.\nUpon motion of a political subdivision that initiated a proceeding under subdivision 4 or intervened under subdivision 5, if an order is entered to reduce the redemption period to five weeks, the court shall award costs and disbursements to the political subdivision. The party foreclosing the mortgage or holding the sheriff's certificate of sale is liable for an award under this subdivision but may recover these amounts upon reinstatement or redemption as provided in section 580.30, subdivision 1, or 582.03, subdivision 1.",
	"repealed": false
}