{
	"id": "116.481",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.481",
	"title": "116.481 MONITORING.",
	"text": "(a) By September 1, 1996, all aboveground tanks of 2,000 gallons or more used for storage and subsequent resale of petroleum products must be equipped with:\n(1) a gauge in working order that shows the current level of product in the tank; or\n(2) an audible or visual alarm which alerts the person delivering fuel into the tank that the tank is within 100 gallons of capacity.\n(b) In lieu of the equipment specified in paragraph (a), the owner or operator of a tank may use a manual method of measurement which accurately determines the amount of product in the tank and the amount of capacity available to be used. This information must be readily available to anyone delivering fuel into the tank prior to delivery. Documentation that a tank has the available capacity for the amount of product to be delivered must be transmitted to the person making the delivery.\n(a) By December 1, 1995, all aboveground tanks governed by this section must be numbered and labeled as to the tank contents, total capacity, and capacity in volume increments of 500 gallons or less.\n(b) Piping connected to the tank must be labeled with the product carried at the point of delivery and at the tank inlet. Manifolded delivery points must have all valves labeled as to product distribution.\n(a) All tanks at a facility shall be shown on a site diagram which is permanently mounted in an area accessible to delivery personnel. The diagram shall show the number, capacity, and contents of tanks and the location of piping, valves, storm sewers, and other information necessary for emergency response, including the facility owner's or operator's telephone number.\n(b) Prior to delivering product into an underground or aboveground tank, delivery personnel shall:\n(1) consult the site diagram, where applicable, for proper delivery points, tank and piping locations, and valve settings;\n(2) visually inspect the tank, piping, and valve settings to determine that the product being delivered will flow only into the appropriate tank; and\n(3) determine, using equipment and information available at the site, that the available capacity of the tank is sufficient to hold the amount being delivered.\n(c) Delivery personnel must remain in attendance during delivery.\nA tank may not be filled from a transport vehicle compartment containing more than the available capacity of the tank, unless the hose of the transport vehicle is equipped with a manually operated shutoff nozzle.\nAboveground and underground tanks located at refineries, pipeline terminals, and river terminals are exempt from this section.",
	"repealed": false
}