{
	"id": "86B.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.501",
	"title": "86B.501 PERSONAL FLOTATION AND LIFESAVING DEVICES.",
	"text": "(a) Watercraft and waterfowl boats using the waters of this state must be equipped with the number and type of personal flotation or lifesaving devices prescribed by the commissioner.\n(b) The commissioner may not:\n(1) require sailboards to be equipped with personal flotation or lifesaving devices; or\n(2) require persons on sailboards to wear personal flotation or lifesaving devices or have them readily available.\nThe owner of a business that rents, leases, or hires out watercraft must provide a personal flotation or lifesaving device of the type required by this section for each person on board the watercraft.\n(a) No person may operate a watercraft under way with a child under ten years of age aboard unless the child is:\n(1) wearing an appropriate personal flotation device approved under subdivision 1; or\n(2) below the top deck or in an enclosed cabin.\n(b) Paragraph (a) does not apply to commercial watercraft where the child is a passenger and the operator is licensed by the state of Minnesota or the United States Coast Guard to carry passengers for hire. Paragraph (a) also does not apply if the watercraft is anchored for the purpose of swimming or diving.\n(c) A first violation of this subdivision prior to May 1, 2006, shall not result in a penalty, but is punishable only by a safety warning.\n(d) Any violation other than a violation addressed in paragraph (c) is to be considered a petty misdemeanor.\nNotwithstanding subdivision 1, a member of a rowing team that is sanctioned by an academic or nonprofit entity is not required to wear or possess, and no local ordinance or rule may require a member of a rowing team to wear or possess, a personal flotation device in a racing shell if a chase boat carrying the devices prescribed under subdivision 1 accompanies the racing shell. The requirement for a chase boat does not apply on waters where it is preempted by federal regulations.",
	"repealed": false
}