{
	"id": "82.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.82",
	"title": "82.82 DENIAL, SUSPENSION AND REVOCATION OF LICENSES.",
	"text": "The commissioner may by order deny, suspend or revoke any license or may censure a licensee if the commissioner finds (1) that the order is in the public interest, and (2) that the applicant or licensee or, in the case of a broker, any officer, director, partner, employee or agent or any person occupying a similar status or performing similar functions, or any person directly or indirectly controlling the broker or closing agent or controlled by the broker or closing agent:\n(a) has filed an application for a license which is incomplete in any material respect or contains any statement which, in light of the circumstances under which it is made, is false or misleading with respect to any material fact;\n(b) has engaged in a fraudulent, deceptive, or dishonest practice;\n(c) is permanently or temporarily enjoined by any court of competent jurisdiction from engaging in or continuing any conduct or practice involving any aspect of the real estate business;\n(d) has failed to reasonably supervise brokers, salespersons, or closing agents so as to cause injury or harm to the public;\n(e) has violated or failed to comply with any provision of this chapter or any rule or order under this chapter;\n(f) has, in the conduct of the licensee's affairs under the license, been shown to be incompetent, untrustworthy, or financially irresponsible;\n(g) has acted on behalf of any party to a transaction, where the licensee has a conflict of interest that may affect the licensee's ability to represent that party, without the knowledge and consent of the party; or\n(h) has, while performing residential mortgage activities regulated under chapter 58 violated any provision of chapter 58.\nThe license of a salesperson is not effective during any period for which the license of the broker on whose behalf the salesperson is acting is suspended or revoked. The salesperson may apply for transfer to some other licensed broker by complying with section 82.63, subdivisions 6 and 10.\nThe commissioner may promulgate rules further specifying and defining those actions and omissions which constitute fraudulent, deceptive, or dishonest practices, and establishing standards of conduct for real estate brokers, salespeople, or closing agents.\nThe commissioner shall not coerce or attempt to coerce a licensee to enter into any monetary settlement with a consumer in connection with any complaint investigation. The commissioner may consider the totality of the circumstances, including any efforts by the licensee to mitigate any losses by a consumer, in determining the appropriateness or severity of administrative sanction.\nThe commissioner shall issue an order requiring a licensee or applicant for a license to show cause why the license should not be revoked or suspended, or the licensee censured, or the application denied. The order shall be calculated to give reasonable notice of the time and place for hearing thereon, and shall state the specific statute or rule that has been violated for the entry of the order. The commissioner may by order summarily suspend a license pending final determination of any order to show cause. If a license is suspended pending final determination of an order to show cause, a hearing on the merits shall be held within 30 days of the issuance of the order of suspension. All hearings shall be conducted in accordance with the provisions of chapter 14. After the hearing, the commissioner shall enter an order making such disposition of the matter as the facts require. If the licensee or applicant fails to appear at a hearing after having been duly notified of it, such person shall be deemed in default, and the proceeding may be determined against the licensee or applicant upon consideration of the order to show cause, the allegations of which may be deemed to be true.\nThe commissioner may delegate to an administrative law judge the authority to conduct a hearing. The examiner shall make proposed findings of fact and submit them to the commissioner. The examiner shall have the same power as the commissioner to compel the attendance of witnesses, to examine them under oath, to require the production of books, papers and other evidence, and to issue subpoenas and cause the same to be served and executed in any part of the state.\nOrders of the commissioner shall be subject to judicial review pursuant to chapter 14.\nThe commissioner may promulgate rules of procedure concerning all hearings and other proceedings conducted pursuant to this chapter.\n(a) In addition to the provisions of subdivision 1, the commissioner may not issue or renew a license if the commissioner of revenue notifies the commissioner and the licensee or applicant for a license that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The commissioner may issue or renew the license only if (1) the commissioner of revenue issues a tax clearance certificate and (2) the commissioner of revenue or the licensee or applicant forwards a copy of the clearance to the commissioner. The commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes.\n(2) \"Delinquent taxes\" do not include a tax liability if (i) an administrative or court action that contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\n(c) In lieu of the notice and hearing requirements of subdivisions 5, 6, 7, and 8 when a licensee or applicant is required to obtain a clearance certificate under this subdivision, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in paragraph (a). The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the licensee or applicant. The notice may be served personally or by mail.\n(d) The commissioner shall require all licensees or applicants to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the commissioner must provide to the commissioner of revenue a list of all licensees and applicants, including the name and address, Social Security number, and business identification number. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.\nIf the commissioner finds that any licensee or applicant is no longer in existence or has ceased to do business as a broker or salesperson or is subject to an adjudication of mental incompetence or to the control of a committee, conservator, or guardian, or cannot be located after reasonable search, the commissioner may by order revoke the license or deny the application.",
	"repealed": false
}