{
	"id": "259.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.47",
	"title": "259.47 DIRECT ADOPTIVE PLACEMENT.",
	"text": "The intent of the provisions governing direct adoptive placement is to safeguard the best interests of the child by providing services and protections to the child, birth parents, and adoptive parents which are consistent with those available through an agency placement.\nIn a direct adoptive placement, an adoption study and report under section 259.41 must be completed and filed with the court as required by subdivision 3.\n(a) Before a child is placed in a prospective adoptive home by a birth parent or legal guardian, other than an agency, the placement must be approved by the district court in the county where the prospective adoptive parent resides. An order under this subdivision or subdivision 6 shall state that the prospective adoptive parent's right to custody of the child is subject to the birth parent's right to custody until the consents to the child's adoption become irrevocable. At the time of placement, prospective adoptive parents must have for the child qualifying existing coverage as defined in section 62L.02, subdivision 24, or other similar comprehensive health care coverage. The preadoptive custody order must include any agreement reached between the prospective adoptive parent and the birth parent regarding authority to make decisions after placement for medical care of the child and responsibility for payment for medical care not provided by the adoptive parent's existing health care coverage. The prospective adoptive parent must meet the residence requirements of section 259.22, subdivision 1, and must file with the court an affidavit of intent to remain a resident of the state for at least three months after the child is placed in the prospective adoptive home. The prospective adoptive parent shall file with the court a notice of intent to file an adoption petition and submit a written motion seeking an order granting temporary preadoptive custody. The notice and motion required under this subdivision may be considered by the court ex parte, without a hearing. The prospective adoptive parent shall serve a copy of the notice and motion upon any parent whose consent is required under section 259.24 or who is named in the affidavit required under paragraph (b) if that person's mailing address is known. The motion may be filed up to 60 days before the placement is to be made and must include:\n(1) the adoption study required under section 259.41;\n(2) affidavits from the birth parents indicating their support of the motion, or, if there is no affidavit from the birth father, an affidavit from the birth mother under paragraph (b);\n(3) an itemized statement of expenses that have been paid and an estimate of expenses that will be paid by the prospective adoptive parents to the birth parents, any agency, attorney, or other party in connection with the prospective adoption;\n(4) the name of counsel for each party, if any;\n(5) a statement that the birth parents:\n(i) have provided the social and medical history required under section 259.43 to the prospective adoptive parent;\n(ii) have received the written statement of their legal rights and responsibilities under section 259.39; and\n(iii) have been notified of their right to receive counseling under subdivision 4; and\n(6) the name of the agency chosen by the adoptive parent to supervise the adoptive placement and complete the postplacement assessment required by section 259.53, subdivision 2.\nThe court shall review the expense statement submitted under this subdivision to determine whether payments made or to be made by the prospective adoptive parent are lawful and in accordance with section 259.55, subdivision 1.\n(b) If the birth mother submits the affidavit required in paragraph (a), clause (2), but the birth father fails to do so, the birth mother must submit an additional affidavit that describes her good faith efforts or efforts made on her behalf to identify and locate the birth father for purposes of securing his consent. In the following circumstances the birth mother may instead submit an affidavit stating on which ground she is exempt from making efforts to identify and locate the father:\n(1) the child was conceived as the result of incest or rape;\n(2) efforts to locate the father by the affiant or anyone acting on the affiant's behalf could reasonably result in physical harm to the birth mother or child; or\n(3) efforts to locate the father by the affiant or anyone acting on the affiant's behalf could reasonably result in severe emotional distress of the birth mother or child.\nA court shall consider the motion for temporary preadoptive custody within 30 days of receiving the motion or by the anticipated placement date stated in the motion, whichever comes sooner.\nIn a direct adoptive placement the prospective adoptive parent must notify the birth parent that the birth parent has a right to receive counseling about adoption issues at the expense of the prospective adoptive parent. The prospective adoptive parent must bear the cost of counseling upon the request of a birth parent at any time between conception of child and six months after the birth of the child or the placement in the adoptive home, whichever is later. The prospective adoptive parent shall not be responsible for the cost of more than 35 hours of counseling under this subdivision. A birth parent may waive the right to receive counseling under this subdivision.\nUpon the request of a birth parent, separate legal counsel must be made available to the birth parent at the expense of the prospective adoptive parent for legal services provided in a direct adoptive placement. The prospective adoptive parent shall only be required to provide legal counsel for one birth parent unless the birth parents elect joint legal representation. The right to legal counsel under this subdivision shall continue until consents become irrevocable, but not longer than 70 days after placement. If consents have not been executed within 60 days of placement, the right to counsel under this subdivision shall end at that time. A birth parent may waive this right only by a written waiver signed and submitted to the court at the time consents are executed under subdivision 7. Representation of a birth parent and a prospective adoptive parent by the same attorney is prohibited.\n(a) A court may issue an emergency order granting temporary preadoptive custody of a child to a prospective adoptive parent for up to 14 days.\nThe prospective adoptive parent shall submit a written motion to the court. The motion must be supported by:\n(1) affidavits from the prospective adoptive parents and birth parents indicating that an emergency order is needed because of the unexpected premature birth of the child or other specifically described extraordinary circumstances which prevented the completion of the requirements of subdivision 3;\n(2) the information required by subdivision 3, paragraph (a), clauses (2) and (5), items (ii) and (iii); and\n(3) either:\n(i) a completed adoption study report which meets the requirements of section 259.41; or\n(ii) the affidavits allowed by section 259.41, subdivision 3, paragraph (c).\nThe court shall issue the emergency order if it concludes from the record submitted that the emergency order will not compromise the health or safety of the child.\n(b) An order granting or denying the motion shall be issued under this section within 24 hours of the time it is brought. Notwithstanding section 259.23, any judge of district court may consider a motion brought under this subdivision. An order granting the motion shall direct that an adoption study be commenced immediately, if that has not occurred, and that the agency conducting the study shall supervise the emergency placement.\n(c) An emergency order under this subdivision expires 14 days after it is issued. If the requirements of subdivision 3 are completed and a preadoptive custody motion is filed on or before the expiration of the emergency order, placement may continue until the court rules on the motion. The court shall consider the preadoptive custody motion within seven days of filing.\nNot sooner than 72 hours after the birth of a child and not later than 60 days after the child's placement in a prospective adoptive home under this section, a person whose consent is required under section 259.24 shall execute a consent. A birth parent, whose consent is required under section 259.24 and who has chosen not to receive counseling through a licensed agency or a licensed social services professional trained in adoption issues, shall appear before a judge or judicial officer to sign the written consent to the child's adoption by the prospective adoptive parent who has temporary preadoptive custody of the child. Notwithstanding where the prospective adoptive parent resides, the consent hearing may be held in any county in this state where the birth parent is found. If a consent hearing is held in a county other than where the prospective adoptive parent resides, the court shall forward the executed consent to the district court in the county where the prospective adoptive parent resides. If a birth parent has chosen to receive counseling through a licensed agency or a licensed social services professional trained in adoption issues, the birth parent may choose to execute a written consent under section 259.24, subdivision 5. A person whose consent is required under section 259.24, subdivision 2, may choose to execute consent at a judicial hearing as described in this section or under the procedures in section 259.24, subdivision 5.\nThe consent becomes irrevocable on the tenth working day after it is given, except that if the consent was obtained by fraud, proceedings to determine the existence of fraud shall be governed by section 259.24, subdivision 6a. Until the consent becomes irrevocable, the child shall be returned to the birth parent upon request.\nThe written consent under this subdivision must state that:\n(1) the birth parent has had the opportunity to consult with independent legal counsel at the expense of the prospective adoptive parent, unless the birth parent knowingly waived the opportunity;\n(2) the birth parent was notified of the right to receive counseling at the expense of the prospective adoptive parent and has chosen to exercise or waive that right; and\n(3) the birth parent was informed that if the birth parent withdraws consent, the prospective adoptive parent cannot require the birth parent to reimburse any costs the prospective adoptive parent has incurred in connection with the adoption, including payments made to or on behalf of the birth parent.\nIf a birth parent has chosen to have legal counsel, the attorney must be present at the execution of consents. If a birth parent waives counsel, the written waiver must be filed with the consent under this subdivision.\nThe consent signed under this subdivision must be on a form prepared by the commissioner and made available to agencies and court administrators for public distribution.\nWith the exception of cases where a person receives notice under section 259.24, subdivision 2a, if a birth parent whose consent is required under section 259.24 does not execute a consent by the end of the period specified in section 259.24, subdivision 2a, the agency which is supervising the placement shall notify the court and the court shall issue an order regarding continued placement of the child. The court shall order the local social services agency to determine whether to commence proceedings for termination of parental rights on grounds of abandonment as defined in section 260C.301. The court may disregard the six- and 12-month requirements of section 260C.301, in finding abandonment if the birth parent has failed to execute a consent within the time required under this section and has made no effort to obtain custody of the child.\n[Repealed, 1997 c 177 s 24]\nIn any adoption completed according to a direct adoptive placement under this section, a record, consisting of the adoption study report and updates required by section 259.41; the birth parent history required by section 259.43; the original birth record; and the hospital discharge form, must be permanently maintained by the agency which supervised the placement. The birth parents, adoptive parents, or their representatives shall provide copies of these documents to the agency upon request. Notwithstanding the provisions of section 259.61, an agency shall, upon request, be given any court records needed to provide postadoption services according to section 259.83 at the request of adoptive parents, birth parents, or adopted individuals age 19 or older.\nIt is a gross misdemeanor for a person, not being the commissioner or an agency, knowingly to engage in placement activities as defined in section 259.21, subdivision 9, without being licensed by the commissioner under chapter 142B, except as authorized by section 142B.05, subdivision 2.\nThis offense shall be prosecuted by the county attorney.",
	"repealed": false
}