{
	"id": "18H.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.09",
	"title": "18H.09 NURSERY STOCK CERTIFICATION REQUIREMENTS.",
	"text": "(a) All nursery stock growing at sites identified by live plant dealers and submitted for inspection must be inspected by the commissioner within the previous 12 months prior to sale and found apparently free from plant pests. The commissioner may waive a site inspection under the following conditions:\n(1) the nursery stock is not going to be sold within 12 months;\n(2) the nursery stock will not be moved out of Minnesota; and\n(3) the nursery site or stock is not subject to certification requirements associated with a state or federally regulated or quarantined plant pest.\nAll nursery stock originating from out of state and offered for sale in Minnesota must have been inspected by the appropriate state or federal agency during the previous 12 months and found free from significantly dangerous or potentially damaging plant pests. A nursery stock certificate is valid from January 1 to December 31.\n(b) Nursery stock must be accessible to the commissioner for inspection during regular business hours. Weeds or other growth that hinder a proper inspection are grounds to suspend or withhold a certificate or require a reinspection for which a fee may be charged.\n(c) Inspection reports issued to live plant dealers must contain a list of the plant pests found at the time of inspection. Withdrawal-from-distribution or other orders are considered part of the inspection reports. A withdrawal-from-distribution or other order must contain a list of plants withdrawn from distribution and the location of the plants.\n(d) The commissioner may mark sections withdrawn from distribution or subject to other special circumstances. These marks must remain in place until the commissioner removes the marks or grants written permission to the grower to remove the marks.\n(e) Inspection reports issued to live plant dealers must outline the violations involved and corrective actions to be taken including withdrawal-from-distribution orders which would specify nursery stock that could not be distributed from a certain area.\n(f) Optional inspections of plants may be conducted by the commissioner upon request by any entity desiring an inspection. A fee as provided in section 18H.07 must be charged for such an inspection.",
	"repealed": false
}