{
	"id": "60H.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/60H.02",
	"title": "60H.02 DEFINITIONS.",
	"text": "The terms defined in this section apply to this chapter.\n\"Actuary\" means a person who is a member in good standing of the American Academy of Actuaries.\n\"Insurer\" means a person, firm, association, or corporation duly licensed in this state as an insurance company.\n(a) \"Managing general agent\" means a person, firm, association or corporation who: (1) manages all or part of the insurance business of an insurer, including the management of a separate division, department, or underwriting office, and (2) acts as an agent for the insurer whether known as a managing general agent, manager, or other similar term, who, with or without the authority, either separately or together with affiliates, produces, directly or indirectly, and underwrites an amount of gross direct written premium equal to or more than five percent of the policyholder surplus as reported in the last annual statement of the insurer in any one quarter or year, together with one or more of the following activities related to the business produced: (i) adjusts or pays claims in excess of an amount determined by the commissioner, or (ii) negotiates reinsurance on behalf of the insurer.\n(b) Notwithstanding paragraph (a), the following persons shall not be considered as managing general agents for the purposes of this chapter:\n(1) an employee of the insurer;\n(2) a United States manager of the United States branch of an alien insurer;\n(3) an underwriting manager who, pursuant to contract, manages all or a part of the insurance or reinsurance operation of the insurer, is under common control with the insurer, subject to the Insurance Holding Company Act, chapter 60D, and whose compensation is not based on the volume of premiums written; or\n(4) an attorney in fact authorized by and acting for the subscribers of a reciprocal insurer or interinsurance exchange under powers of attorney.\n\"Underwrite\" means the authority to accept or reject risk on behalf of the insurer.",
	"repealed": false
}