{
	"id": "360.915",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.915",
	"title": "360.915 METEOROLOGICAL TOWERS.",
	"text": "(a) For purposes of this section, \"stand-alone meteorological tower\" means a structure, whether self-standing or supported by guy wires and ground anchors, that:\n(1) is designed with accessory facilities on which antenna, sensor, camera, meteorological, or other equipment is able to be mounted;\n(2) has a height of at least 50 feet and not more than 200 feet; and\n(3) has a diameter of ten feet or less at the aboveground base, excluding concrete footing.\n(b) A stand-alone meteorological tower does not include a structure that is:\n(1) affixed or adjacent to a building, including a house, barn, or utility station;\n(2) an electric transmission or distribution line;\n(3) a streetlight erected or maintained by a governmental entity;\n(4) a wind energy conversion system, as defined in section 216F.01, subdivision 4, that has rotor blades with a length of more than six feet;\n(5) a facility registered with the Federal Communications Commission or any structure with the primary purpose of supporting telecommunications equipment, including microwave relay facilities and towers erected for the purpose of providing commercial mobile radio service or commercial mobile data service, as the terms are defined in Code of Federal Regulations, title 47, section 20.3; or\n(6) a utility pole located in the public right-of-way.\nThe requirements of this section do not apply to a stand-alone meteorological tower that is located:\n(1) within the curtilage of a farmstead; or\n(2) in a statutory or home rule charter city or town.\nA stand-alone meteorological tower must:\n(1) be painted in equal-width bands of solid color over its entire length, alternating between aviation orange and white so that orange is at the top of the tower and at the base of the tower;\n(2) have at least two spherical markers attached to each of the highest or outside guy wires that are:\n(i) painted solid aviation orange; and\n(ii) placed so that one is within 15 feet of the upper anchor point of the guy wire;\n(3) have a high-visibility sleeve on each guy wire, which must extend at least seven feet from the lower anchor point of each guy wire; and\n(4) have a flashing red light placed at the top of the tower that is compatible with a night vision imaging system, as determined by the commissioner.\n(a) At least 30 days prior to erecting a stand-alone meteorological tower, the tower owner must provide notice to the commissioner in the manner specified by the commissioner. The notice must identify:\n(1) the tower owner's name and contact information;\n(2) the name and contact information of any tower owner's representative;\n(3) the height above ground level of the tower, including its base;\n(4) the elevation of the tower site; and\n(5) global positioning system coordinates of the center of the tower.\n(b) The tower owner must notify the commissioner within 15 days of any change in any information provided under paragraph (a).\n(c) The tower owner must notify the commissioner within 30 days after removal of a stand-alone meteorological tower.\nMS 2022 [Repealed, 2023 c 68 art 4 s 129]\nThe commissioner must maintain records on stand-alone meteorological towers under this section and must provide information on stand-alone meteorological tower locations on the department's website.\nThe owner of a stand-alone meteorological tower who violates the requirements under subdivision 3 or 4, paragraph (a), is guilty of a misdemeanor.\nThe owner of a stand-alone meteorological tower erected prior to August 1, 2020, must meet the requirements of this section within one year of August 1, 2020.",
	"repealed": false
}