{
	"id": "115A.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.38",
	"title": "115A.38 RECONCILIATION PROCEDURES.",
	"text": "At least 30 days before making a final decision under section 115A.37 in a review brought pursuant to section 115A.33, paragraph (a), clause (4), the chair of the board may report to the legislative commission describing permit conditions or requirements being considered that are not within the existing authority of the agency or the board or that would require legislation or public financial assistance. In any such report, the chair of the board may request intervention in the review pursuant to subdivisions 2 and 3.\nIf the legislative commission determines that intervention might be warranted under the terms of subdivision 1, the commission may suspend the review process for up to 60 days to allow a preintervention assessment. The preintervention assessment shall be conducted by an independent, impartial, and qualified public intervenor appointed by the commission with the advice and consent of the parties to the dispute. The intervenor shall report to the commission. The report shall include:\n(1) an assessment of whether the dispute is ripe for mediation and whether the parties are willing to mediate;\n(2) an assessment of whether, within the terms of subdivision 1, substantive issues exist which cannot be resolved effectively through normal administrative and judicial procedures;\n(3) a preliminary definition of the facts and issues in dispute and actions and decisions being considered;\n(4) a description of the diverse parties having a legitimate and direct interest in the outcome of the dispute.\nFollowing the report of the intervenor, the legislative commission may suspend the review process for an additional period not to exceed 90 days for an intervention proceeding. The intervenor shall be in charge of the intervention proceeding and may call for such participation and establish such procedures as the intervenor deems necessary and appropriate to facilitate agreement. The intervenor shall keep the chair of the legislative commission informed on the progress of the intervention proceeding, particularly with respect to agreements or proposed agreements which may require action or decisions not within the authority of the agency or board, legislative action, or public financial assistance. The intervenor shall make recommendations to the commission respecting any such agreements or proposed agreements. The commission may make recommendations to the intervenor respecting any such agreement or proposed agreement. If the commission approves of an agreement, or a decision based upon an agreement, which requires action or decisions not within the authority of the agency or board, legislative action, or public financial assistance, the commission shall cause the matter and recommendations to be submitted to the legislature for consideration.",
	"repealed": false
}