{
	"id": "299K.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/299K.07",
	"title": "299K.07 NOTIFICATION TO EMERGENCY MANAGEMENT CENTER.",
	"text": "(a) The notification of the commission required under the federal act must be made to the state Emergency Management Center. The owner or operator of a facility shall immediately notify the state Emergency Management Center of the release of a reportable quantity of the following materials:\n(1) a hazardous substance on the list established under United States Code, title 42, section 9602; or\n(2) an extremely hazardous substance on the list established under United States Code, title 42, section 11002.\n(b) This section does not apply to a release that results in exposure to persons solely within the site or sites on which a facility is located or to a release specifically authorized by state law.\n(c) A person who is required to report to or notify a state agency of a discharge, release, or incident under section 221.0341, this chapter, chapter 18B, 18C, 18D, 115, 115A, 115B, 115C, 115D, 116, or 299J, or any other statute, administrative rule, or federal regulation may satisfy the requirement to report by notifying the Emergency Management Center established in this section. The commissioner of the Department of Public Safety shall ensure that the center is staffed with adequate personnel to answer all calls 24 hours a day and that those staff are adequately trained to efficiently notify all appropriate state and federal agencies with jurisdiction over the discharge or release, and provide emergency responder information. No state agency may adopt a rule or guideline that requires a person who notifies the Emergency Management Center to also notify that agency. The commissioner of each affected state agency shall include the telephone number of the Emergency Management Center in all files, permits, correspondence, educational publications, and other communications with the public and other persons, and shall designate personnel to coordinate receipt of reports or notifications with Emergency Management Center personnel.",
	"repealed": false
}