{
	"id": "16C.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.34",
	"title": "16C.34 CONSTRUCTION MANAGER AT RISK.",
	"text": "(a) Every user agency, except the Capitol Area Architectural and Planning Board, shall submit a written request for proposals for a construction manager at risk for its project to the commissioner. The written request for proposals must include a description of the project, the estimated cost of completing the project, a description of any special requirements or unique features of the proposed project, and other information which will assist the commissioner in carrying out its duties and responsibilities set forth in this section.\n(b) The commissioner may include in the request for qualifications criteria a requirement that the proposer include the overhead and fee that the construction manager at risk proposes to charge for its services.\n(c) A request for qualifications shall be prepared for each construction manager at risk contract as provided in this section. The request for qualifications shall contain, at a minimum, the following elements:\n(1) the identity of the agency for which the project will be built and that will award the construction manager at risk contract;\n(2) procedures for submitting qualifications, the criteria and subcriteria for evaluation of qualifications and the relative weight for each criteria and subcriteria, and the procedures for making awards in an open, competitive, and objective manner, and according to the stated criteria and subcriteria, including a reference to the requirements of this section;\n(3) the terms and conditions for the contract;\n(4) the qualifications that the construction manager at risk shall be desired to have;\n(5) a schedule for commencement and completion of the project;\n(6) any applicable budget limits for the project;\n(7) requirements for insurance, statutorily required performance and payment bonds;\n(8) identification and location of any other information in the possession or control of the agency that the user agency determines is material, which may include surveys, soils reports, drawings or models of existing structures, environmental studies, photographs, or references to public records; and\n(9) criteria shall not impose unnecessary conditions beyond reasonable requirements to ensure maximum participation of construction managers at risk. The criteria shall not consider the collective bargaining status of the construction manager at risk.\n(d) Notice of requests for qualifications must be advertised in a manner designated by the commissioner.\n(a) In a construction manager at risk selection process, the following shall apply:\n(b)(1) Upon receipt of a written request from a user agency for a construction manager at risk for its project, the commissioner shall create a selection committee composed of a minimum of three persons, at least one of whom has construction industry expertise; (2) the selection committee shall establish procedures for determining the appropriate content of each request for qualifications, the weighted criteria and subcriteria to be used to score the proposals of the construction managers at risk, and shall establish procedures for evaluating qualifications in an open, competitive, and objective manner; and (3) the commissioner shall issue a request for qualifications that includes the information as described in subdivision 1.\n(c) In accordance with the criteria and procedures set forth in the request for qualifications, the selection committee shall evaluate the construction manager at risk's experience as a constructor, including, but not limited to, capacity of key personnel, technical competence, capability to perform, the past performance of the construction manager at risk and its employees, its safety record and compliance with state and federal law, availability to and familiarity with the project locale, and other appropriate facts submitted by the construction manager at risk in response to the request for qualifications. The commissioner must receive at least three proposals from construction managers or the commissioner may either (1) solicit new proposals; (2) request the selection committee to revise the request for qualifications and thereafter solicit new proposals using the revised request for qualifications; (3) select another allowed procurement method; or (4) reject all proposals.\n(d)(1) The selection committee shall review the proposers' qualifications and create a short list of three to five proposals of construction managers at risk; (2) the commissioner shall issue a request for proposal requiring fee and expense proposals and other information as desired from the short-listed construction managers at risk; (3) the selection committee shall conduct formal interviews with the short-listed construction managers at risk but shall not disclose any proprietary or confidential information contained in one proposal to another proposer; and (4) the selection committee shall recommend the construction manager at risk achieving the highest score on the evaluation criteria as described in subdivision 1, paragraph (b).\n(e) The board shall select the primary designer as described in section 16B.33 or in the case of the commissioner, section 16C.08 or 16C.087.\n(a) The commissioner shall conduct contract negotiations with the recommended construction manager at risk.\n(b) If the construction manager at risk selected for the project declines the appointment or is unable to reach agreement with the commissioner concerning the fee or terms of the contract, the commissioner shall, within 60 days after the first selection, request the selection committee to make another recommendation.\n(c) If the selection committee fails to make a second recommendation and forward it to the commissioner within 60 days of the commissioner's request for a second recommendation, the commissioner may select a construction manager at risk without the recommendation of the selection committee.\n(d) The primary designer selected by the board shall develop various design documents for review and approval by the commissioner.\n(e) The construction manager at risk shall competitively bid all trade contract work for the project from a list of qualified firms, subject to availability of such qualified firms for the specific work. The list of qualified firms shall be based upon an open, competitive, and objective prequalification process in which the selection criteria includes the firm's experience as a constructor, including capacity of key personnel, technical competence, capability to perform, the past performance of the firm and its employees, including its safety record and compliance with state and federal law, availability to and familiarity with the project locale, and other considerations as defined by the construction manager at risk and the commissioner. The construction manager at risk and the commissioner shall jointly determine the composition of the list of qualified firms. The criteria shall not impose unnecessary conditions beyond reasonable requirements to ensure maximum participation of qualified contractors. With the commissioner's approval or request, the construction manager at risk may also submit bids for trade contract work.\n(f) The construction manager at risk and the commissioner shall enter into a guaranteed maximum price contract for the project.",
	"repealed": false
}