{
	"id": "82.735",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.735",
	"title": "82.735 BROKER PRICE OPINION; REQUIREMENTS; DUTIES OF LICENSEE; REGULATIONS.",
	"text": "A person licensed under this chapter or chapter 82B may prepare and provide a broker price opinion and a broker may charge and collect a fee for it if the license of that licensee is active and in good standing.\nNotwithstanding any provision of the laws of this state to the contrary, a person licensed under this chapter or chapter 82B may prepare a broker price opinion for:\n(1) an existing or potential seller for the purposes of listing and selling a parcel of real property;\n(2) an existing or potential buyer of a parcel of real property;\n(3) a third party making decisions or performing due diligence related to the potential listing, offering, sale, exchange, option, lease, or acquisition price of a parcel of real property when prepared as required by subdivision 3; or\n(4) an existing or potential lienholder or other third party for any purpose other than as the primary basis to determine the value of a piece of property for the purpose of a loan origination of a residential mortgage loan secured by such piece of property, when done in conjunction with the purchase of a consumer's principal dwelling, when prepared as required by subdivision 3.\n(a) Unless the party requesting the opinion requires a specific report, a broker price opinion prepared for a party under subdivision 2, clause (3) or (4), must be in writing and contain the following:\n(1) a statement of the intended purpose of the broker price opinion;\n(2) a brief description of the subject property and property interest to be priced;\n(3) the basis of reasoning used to reach the opinion on the price, including the applicable market data;\n(4) any assumptions or limiting conditions;\n(5) a disclosure of any existing or contemplated interest of the broker or salesperson issuing the opinion;\n(6) the name of the broker or salesperson issuing the price opinion;\n(7) the name of the real estate brokerage that the broker or salesperson is acting on behalf of;\n(8) the date of the price opinion; and\n(9) a disclaimer stating, \"This opinion is not an appraisal of the market value of the property, and may not be used in lieu of an appraisal. If an appraisal is desired, the services of a licensed or certified appraiser must be obtained.\"\n(b) A copy of the broker price opinion report required under this subdivision together with any supporting materials and documents used in its preparation shall be retained as required under section 82.72, subdivisions 3 and 4.\n(c) A licensee may produce or transmit a broker price opinion report electronically to any person entitled to receive it.",
	"repealed": false
}