{
	"id": "13C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/13C.10",
	"title": "13C.10 PROTECTED PERSONS SECURITY FREEZE.",
	"text": "(a) For purposes of this section, the terms defined in paragraphs (b) through (g) have the meanings given.\n(b) \"Protected person\" means an individual who is under the age of 16 at the time a request for the placement of a security freeze is made.\n(c) \"Record\" means a compilation of information that:\n(1) identifies a protected person;\n(2) is created by a consumer reporting agency solely for the purpose of complying with this section; and\n(3) may not be created or used to consider the protected person's credit worthiness, credit standing, credit capacity, character, general reputation, personal characteristics, or mode of living for any purpose listed in United States Code, title 15, section 1681(b).\n(d) \"Representative\" means a person who provides to a consumer reporting agency sufficient proof of authority to act on behalf of a protected person.\n(e) \"Security freeze for a protected person\" means:\n(1) if a consumer reporting agency does not have a file pertaining to a protected person, a restriction that:\n(i) is placed on the protected person's record in accordance with this section; and\n(ii) prohibits the consumer reporting agency from releasing the protected person's record except as provided in this section; or\n(2) if a consumer reporting agency has a file pertaining to the protected person, a restriction that:\n(i) is placed on the protected person's consumer report in accordance with this section; and\n(ii) prohibits the consumer reporting agency from releasing the protected person's consumer report or any information derived from the protected person's consumer report except as provided in this section.\n(f) \"Sufficient proof of authority\" means documentation that shows a representative has authority to act on behalf of a protected person. Sufficient proof of authority includes:\n(1) an order issued by a court of law;\n(2) a lawfully executed and valid power of attorney; or\n(3) a written, notarized statement signed by a representative that expressly describes the authority of the representative to act on behalf of a protected person.\n(g) \"Sufficient proof of identification\" means information or documentation that identifies a protected person or a representative of a protected person. Sufficient proof of identification includes:\n(1) a Social Security number or a copy of a Social Security card issued by the Social Security Administration;\n(2) a certified or official copy of a birth certificate issued by the entity authorized to issue the birth certificate;\n(3) a copy of a driver's license, an identification card, or any other government-issued identification; or\n(4) a copy of a bill, including a bill for telephone, sewer, septic tank, water, electric, oil, or natural gas services, that shows a name and home address.\nIn general:\n(1) a consumer reporting agency shall place a security freeze for a protected person if:\n(i) the consumer reporting agency receives a request from the protected person's representative for the placement of the security freeze under this section; and\n(ii) the protected person's representative:\n(A) submits the request to the consumer reporting agency at the address or other point of contact and in the manner specified by the consumer reporting agency;\n(B) provides to the consumer reporting agency sufficient proof of identification of the protected person and the representative; and\n(C) provides to the consumer reporting agency sufficient proof of authority to act on behalf of the protected person; and\n(2) if a consumer reporting agency does not have a file pertaining to a protected person when the consumer reporting agency receives a request under clause (1), the consumer reporting agency shall create a record for the protected person.\nWithin 30 days after receiving a request, a consumer reporting agency shall place a security freeze for the protected person, provided that if the consumer reporting agency has a file pertaining to the protected person when a request is received, the consumer reporting agency shall place a security freeze within three business days after receiving the request.\nUnless a security freeze for a protected person is removed in accordance with subdivision 6 or 9, a consumer reporting agency may not release the protected person's consumer report, any information derived from the protected person's consumer report, or any record created for the protected person.\nA security freeze for a protected person placed under subdivision 2 remains in effect until:\n(1) the protected person or the protected person's representative requests the consumer reporting agency to remove the security freeze for a protected person in accordance with subdivision 6; or\n(2) the security freeze for a protected person is removed in accordance with subdivision 9.\nIf a protected person or a protected person's representative wishes to remove a security freeze for a protected person, the protected person or the protected person's representative shall:\n(1) submit a request for the removal of the security freeze to the consumer reporting agency at the address or other point of contact and in the manner specified by the consumer reporting agency;\n(2) provide to the consumer reporting agency:\n(i) in the case of a request by the protected person:\n(A) proof that the sufficient proof of authority for the protected person's representative to act on behalf of the protected person is no longer valid; and\n(B) sufficient proof of identification of the protected person; or\n(ii) in the case of a request by the representative of a protected person:\n(A) sufficient proof of identification of the protected person and the representative; and\n(B) sufficient proof of authority to act on behalf of the protected person.\nWithin 30 days after receiving a request that meets the requirements of subdivision 6, the consumer reporting agency shall remove the security freeze for the protected person.\nA consumer reporting agency may not charge a fee for placement or removal of a security freeze for a protected person.\nA consumer reporting agency may remove a security freeze for a protected person or delete a record of a protected person if the security freeze was placed or the record was created based on a material misrepresentation of fact by the protected person or the protected person's representative.\nA consumer reporting agency's sole liability is for actual damages as a result of a violation of this section.\nThis section does not apply to:\n(1) a person or entity described in section 13C.016, subdivision 6, clause (3), (5), (6), or (7);\n(2) a person or entity described in sections 13C.018 to 13C.019; or\n(3) a person or entity that maintains a database used solely for the following:\n(i) criminal record information;\n(ii) personal loss history information;\n(iii) fraud prevention or detection;\n(iv) employment screening; or\n(v) tenant screening.",
	"repealed": false
}