{
	"id": "160.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.292",
	"title": "160.292 INFORMATION SIGNS FOR SPECIFIC SERVICES; DEFINITIONS.",
	"text": "For the purposes of sections 160.292 to 160.296, the terms defined in this section have the meanings given them.\n[Renumbered subd 22]\n[Renumbered subd 23]\n[Renumbered subd 24]\n[Renumbered subd 16]\n[Renumbered subd 18]\n[Renumbered subd 15]\n[Renumbered subd 19]\n[Renumbered subd 17]\n[Renumbered subd 14]\n[Renumbered subds 20,21,25]\n[Renumbered subd 13]\n\"Business panel\" means a separately attached sign panel that shows, either individually or in combination, the brand, symbol, trademark, or logo of the business service.\n\"Gasoline service station\" or \"retail motor fuel business\" means a business that provides vehicle services including fuel and oil; provides restroom facilities and drinking water; provides staff for continuous operation at least 12 hours per day, seven days per week; and provides public access to a telephone.\n\"Local road\" means any nontrunk highway.\n\"Motel\" has the meaning given to the word \"hotel\" in section 157.15.\n\"Nonfreeway trunk highway\" means all (1) roadways that are not designated freeways and that have crossing traffic at grade intersections and (2) bypasses of outstate municipalities that have interchanges at intersections of trunk highways with local roads or with other trunk highways.\n\"Recreational camping area\" has the meaning given it in section 327.14, subdivision 8.\n\"Resort\" has the meaning given it in section 157.15.\n\"Restaurant\" has the meaning given it in section 157.15.\n\"Rural agricultural business\" includes but is not limited to (1) a grain-handling facility, (2) a business providing care and well-being to animals, and (3) the sale of feed or seed.\n\"Specific service\" means restaurants; rural agricultural or tourist-oriented businesses; places of worship; gasoline service stations and other retail motor fuel businesses; and motels, resorts, or recreational camping areas that provide sleeping accommodations for the traveling public.\n\"Specific service sign\" means a rectangular sign panel displaying the name or optional business panel, or both, of a rural agricultural or tourist-oriented business, place of worship, motel, restaurant, resort, recreational camping area, or gasoline service station or other retail motor fuel business and, where appropriate, the direction to and distance to the rural agricultural or tourist-oriented business, place of worship, recreational camping area, motel, restaurant, resort, or gasoline service station or other retail motor fuel business.\n\"Specific service sign assembly\" means a combination of specific service sign panels to be placed within the right-of-way on appropriate approaches to an intersection or interchange.\n\"Specific service sign cluster\" means a grouping of specific service sign assemblies on appropriate approaches to an intersection or interchange.\n(a) \"Tourist-oriented business\" means a business, service, or activity that receives the major portion of its income or visitors during the normal business season from motorists not residing in the immediate area of the business or activity.\n(b) \"Tourist-oriented business\" includes, but is not limited to (1) a greenhouse or nursery, (2) a bait and tackle shop, (3) a marina, and (4) a gift or antique shop.",
	"repealed": false
}