{
	"id": "626.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.18",
	"title": "626.18 SEARCH WARRANTS RELATING TO ELECTRONIC COMMUNICATION SERVICES AND REMOTE COMPUTING SERVICES.",
	"text": "The definitions in this subdivision apply to this section.\n(a) The terms \"electronic communication services\" and \"remote computing services\" shall be construed in accordance with United States Code, title 18, sections 2701 to 2711, as amended through March 1, 2001. This section does not apply to corporations that do not provide those services to the general public.\n(b) An \"adverse result\" occurs when notification of the existence of a search warrant results in:\n(1) danger to the life or physical safety of an individual;\n(2) a flight from prosecution;\n(3) the destruction of or tampering with evidence;\n(4) the intimidation of potential witnesses; or\n(5) serious jeopardy to an investigation or undue delay of a trial.\n(c) \"Applicant\" means a peace officer as defined in section 626.05, to whom a search warrant is issued pursuant to this chapter.\n(d) \"Minnesota corporation\" refers to any corporation or other entity that is subject to section 5.25, excluding foreign corporations.\n(e) A \"foreign corporation\" is considered to be doing business in Minnesota if it makes a contract or engages in a terms of service agreement with a resident of Minnesota to be performed in whole or in part by either party in Minnesota. The making of the contract or terms of service agreement is considered to be the agreement of the foreign corporation that any administrative subpoena or search warrant properly served on it has the same legal force and effect as if served personally on it within the state of Minnesota.\n(f) \"Properly served\" means that a search warrant has been delivered by hand, or in a manner reasonably allowing for proof of delivery if delivered by United States mail, overnight delivery service, or facsimile to a person or entity listed in section 5.25 or covered by this statute.\n(a) The following provisions shall apply to any search warrant issued under this chapter allowing a search for records that are in the actual or constructive possession of a foreign corporation that provides electronic communication services or remote computing services to the general public, where those records would reveal the identity of the customers using those services; data stored by, or on behalf of, the customer; the customer's usage of those services; the recipient or destination of communications sent to or from those customers; or the content of those communications.\n(b) When properly served with a search warrant issued by the Minnesota court, a foreign corporation subject to this section shall provide to the applicant all records sought pursuant to that warrant within eight business days of receipt, including those records maintained or located outside this state.\n(c) Where the applicant makes a showing and the judge finds that failure to produce records within less than eight business days would cause an adverse result, the warrant may require production of records within less than eight business days. A court may reasonably extend the time required for production of the records upon finding that the foreign corporation has shown good cause for that extension and that an extension of time would not cause an adverse result.\n(d) A foreign corporation seeking to quash the warrant must seek relief from the court that issued the warrant within the time required for production of records under this section. The issuing court shall hear and decide that motion no later than eight court days after the motion is filed.\n(e) The foreign corporation shall verify the authenticity of records that it produces by providing a written affidavit or statement to that effect.\nA Minnesota corporation that provides electronic communication services or remote computing services to the general public, when served with a warrant issued by another state to produce records that would reveal the identity of the customers using those services; data stored by, or on behalf of, the customer; the customer's usage of those services; the recipient or destination of communications sent to or from those customers; or the content of those communications, shall produce those records as if that warrant had been issued by a Minnesota court.\nNo cause of action shall lie against any foreign or Minnesota corporation subject to this section, its officers, employees, agents, or other specified persons for providing records, information, facilities, or assistance in accordance with the terms of a warrant issued pursuant to this chapter.",
	"repealed": false
}