{
	"id": "136A.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.87",
	"title": "136A.87 PLANNING INFORMATION FOR POSTSECONDARY EDUCATION.",
	"text": "(a) The office shall make available to all residents beginning in 7th grade through adulthood information about planning and preparing for postsecondary opportunities. Information must be provided to all 7th grade students and their parents annually by September 30 about planning for their postsecondary education. The office may also provide information to high school students and their parents, to adults, and to out-of-school youth.\n(b) The office shall gather and share information with students and parents about the dual credit acceptance policies of each Minnesota public and private college and university. The office shall gather and share information related to the acceptance policies for concurrent enrollment courses, postsecondary enrollment options courses, advanced placement courses, and international baccalaureate courses. This information must be shared on the office's website and included in the information under paragraph (a).\n(c) The information provided under paragraph (a) may include the following:\n(1) the need to start planning early;\n(2) the availability of assistance in educational planning from educational institutions and other organizations;\n(3) suggestions for studying effectively during high school;\n(4) high school courses necessary to be adequately prepared for postsecondary education;\n(5) encouragement to involve parents actively in planning for all phases of education;\n(6) information about postsecondary education and training opportunities existing in the state, their respective missions and expectations for students, their preparation requirements, admission requirements, and student placement;\n(7) ways to evaluate and select postsecondary institutions;\n(8) the process of transferring credits among Minnesota postsecondary institutions and systems;\n(9) the costs of postsecondary education and the availability of financial assistance in meeting these costs, including specific information about the Minnesota Promise;\n(10) the interrelationship of assistance from student financial aid, public assistance, and job training programs;\n(11) financial planning for postsecondary education; and\n(12) postsecondary education options for students with intellectual and developmental disabilities.",
	"repealed": false
}