{
	"id": "137.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.50",
	"title": "137.50 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 137.51 to 137.60.\n\"Commissioner\" means the commissioner of management and budget.\n\"Stadium\" means an athletic stadium suitable for intercollegiate National Collegiate Athletic Association (NCAA) Division I football games and related infrastructure improvements constructed on the University of Minnesota's east bank campus in the city of Minneapolis.\n\"Board\" means the Board of Regents of the University of Minnesota.\n\"Commission\" means the Metropolitan Sports Facilities Commission.\n\"University land\" means approximately 2,840 acres owned by the University of Minnesota as of May 25, 2006, lying within the area legally described as approximately the Southerly 3/4 of the Southwest 1/4 of Section 1 (comprising 120 acres), approximately the Southeast 1/4 of Section 2 (comprising 160 acres), the East 1/2 of Section 10, Section 11, the West 1/2 of Section 12, Section 13, and Section 14, all in Township 114 North, Range 19 West, Dakota County, Minnesota.\n\"Permitted university uses\" means university educational, research, outreach, scientific, and agricultural uses including, undiminished, all of the uses present as of May 25, 2006, of the university land, all of the uses of university real property that adjoins the university land present as of May 25, 2006, any uses related to the foregoing uses, and the making of improvements incidental to those uses, provided that an improvement must be agreed to in writing by the university and the commissioner of natural resources.\n\"Other permitted uses\" means agricultural, outdoor recreation uses including those named in section 86A.03, subdivision 3, open space management uses, outdoor recreation-based uses consistent with those of the parks and open space system created pursuant to chapter 473, wildlife management areas, aquatic management areas, scientific and natural areas, and the making of improvements incidental to those uses, provided the improvements have been agreed to in writing by the university and the commissioner of natural resources.\n\"Prohibited uses\" means use of the university land for residential, commercial, or industrial uses, except to the extent those uses are otherwise permitted by Laws 2006, chapter 247, or are permitted as of May 25, 2006, under university leases, easements, or use agreements, or are utility uses within defined corridors.",
	"repealed": false
}