{
	"id": "475.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.521",
	"title": "475.521 CAPITAL IMPROVEMENT BONDS.",
	"text": "For purposes of this section, the following terms have the meanings given.\n(a) \"Bonds\" mean an obligation defined under section 475.51.\n(b) \"Capital improvement\" means acquisition or betterment of public lands, buildings or other improvements for the purpose of a city hall, town hall, library, public safety facility, and public works facility. An improvement must have an expected useful life of five years or more to qualify. Capital improvement does not include light rail transit or any activity related to it, or a park, road, bridge, administrative building other than a city or town hall, or land for any of those facilities. For purposes of this section, \"capital improvement\" includes expenditures for purposes described in this paragraph that have been incurred by a municipality before approval of a capital improvement plan, if such expenditures are included in a capital improvement plan approved on or before the date of the public hearing under subdivision 2 regarding issuance of bonds for such expenditures.\n(c) \"Municipality\" means a home rule charter or statutory city or a town.\n(a) Bonds issued by a municipality to finance capital improvements under an approved capital improvements plan are not subject to the election requirements of section 475.58. The bonds must be approved by an affirmative vote of three-fifths of the members of a five-member governing body. In the case of a governing body having more or less than five members, the bonds must be approved by a vote of at least two-thirds of the members of the governing body.\n(b) Before the issuance of bonds qualifying under this section, the municipality must publish a notice of its intention to issue the bonds and the date and time of the hearing to obtain public comment on the matter. The notice must be published in the official newspaper of the municipality or in a newspaper of general circulation in the municipality. Additionally, the notice may be posted on the official website, if any, of the municipality. The notice must be published at least 14 but not more than 28 days before the date of the hearing.\n(c) A municipality may issue the bonds only after obtaining the approval of a majority of the voters voting on the question of issuing the obligations, if a petition requesting a vote on the issuance is signed by voters equal to five percent of the votes cast in the municipality in the last municipal general election and is filed with the clerk within 30 days after the public hearing. If the municipality elects not to submit the question to the voters, the municipality shall not propose the issuance of bonds under this section for the same purpose and in the same amount for a period of 365 days from the date of receipt of the petition. If the question of issuing the bonds is submitted and not approved by the voters, the provisions of section 475.58, subdivision 1a, shall apply.\n(a) A municipality may adopt a capital improvement plan. The plan must cover at least a five-year period beginning with the date of its adoption. The plan must set forth the estimated schedule, timing, and details of specific capital improvements by year, together with the estimated cost, the need for the improvement, and sources of revenue to pay for the improvement. In preparing the capital improvement plan, the governing body must consider for each project and for the overall plan:\n(1) the condition of the municipality's existing infrastructure, including the projected need for repair or replacement;\n(2) the likely demand for the improvement;\n(3) the estimated cost of the improvement;\n(4) the available public resources;\n(5) the level of overlapping debt in the municipality;\n(6) the relative benefits and costs of alternative uses of the funds;\n(7) operating costs of the proposed improvements; and\n(8) alternatives for providing services most efficiently through shared facilities with other municipalities or local government units.\n(b) The capital improvement plan and annual amendments to it must be approved by the governing body after public hearing.\nA municipality may not issue bonds under this section if the maximum amount of principal and interest to become due in any year on all the outstanding bonds issued under this section, including the bonds to be issued, will equal or exceed 0.16 percent of the estimated market value of property in the municipality. Calculation of the limit must be made using the estimated market value for the taxes payable year in which the obligations are issued and sold. In the case of a municipality with a population of 2,500 or more, the bonds are subject to the net debt limits under section 475.53. In the case of a shared facility in which more than one municipality participates, upon compliance by each participating municipality with the requirements of subdivision 2, the limitations in this subdivision and the net debt represented by the bonds shall be allocated to each participating municipality in proportion to its required financial contribution to the financing of the shared facility, as set forth in the joint powers agreement relating to the shared facility. This section does not limit the authority to issue bonds under any other special or general law.\nBonds to finance capital improvements qualifying under this section must be issued under the issuance authority in this chapter and the provisions of this chapter apply, except as otherwise specifically provided in this section.",
	"repealed": false
}