{
	"id": "174.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.22",
	"title": "174.22 DEFINITIONS.",
	"text": "For the purposes of sections 174.21 to 174.27 the following terms have the meanings given them.\n\"Commuter van\" means a motor vehicle used in a ride-sharing arrangement and used principally to provide prearranged transportation of persons for a fee to or from their place of employment or to or from a transit stop authorized by a local transit authority:\n(1) when the vehicle is operated by a person who does not drive the vehicle for that person's principal occupation but is driving it only to or from that person's principal place of employment or to or from a transit stop authorized by a local transit authority; or\n(2) when the vehicle is operated for personal use at other times by an authorized driver.\n\"Complementary paratransit service (ADA)\" means public transportation service provided on a regular basis where fixed route public transportation service exists and is designed exclusively or primarily to serve individuals who are elderly or disabled and unable to use regular means of public transportation.\n[Renumbered subd 1a]\n[Renumbered subd 2c]\n\"Elderly and disabled service\" means transportation service provided on a regular basis in small urbanized or large urbanized areas and designed exclusively or primarily to serve individuals who are elderly or disabled and unable to use regular means of public transportation.\n[Renumbered subd 2e]\n\"Large urbanized area service\" means a public transportation service operated in areas located outside the metropolitan area with a population greater than 200,000 that is designated by the United States Census Bureau. Large urbanized area service does not include complementary paratransit service (ADA), as defined in subdivision 1a.\n\"Metropolitan area\" has the meaning given it in section 473.121.\n\"Metropolitan Council\" means the council established by section 473.123.\n[Repealed, 1994 c 628 art 3 s 209]\nMS 2022 [Repealed, 2024 c 104 art 2 s 16]\n\"Paratransit\" means the transportation of passengers by motor vehicle or other means of conveyance by persons operating on a regular and continuing basis and the transportation or delivery of packages in conjunction with an operation having the transportation of passengers as its primary and predominant purpose and activity, but excluding regular route transit. \"Paratransit\" includes transportation by car pool and commuter van, point deviation and route deviation services, shared-ride taxi service, dial-a-ride service, and other similar services.\n\"Public transportation\" means regular, continuing shared-ride surface transportation services that are open to the general public or open to a segment of the general public defined by age, disability, or low income. Public transportation does not include:\n(1) intercity passenger rail transportation provided by the entity described in United States Code, title 49, section 243, or a successor entity;\n(2) intercity bus service;\n(3) charter bus service;\n(4) school bus service;\n(5) sightseeing service;\n(6) courtesy shuttle service for patrons of one or more specific establishments; or\n(7) intraterminal or intrafacility shuttle services.\n\"Regular route transit\" means transportation of passengers for hire by a motor vehicle or other means of conveyance by any person operating on a regular and continuing basis as a common carrier on fixed routes and schedules. \"Regular route transit\" does not include transportation of children to or from school or of passengers between a common carrier terminal station and a hotel or motel, transportation by common carrier railroad or common carrier railroads or by taxi, transportation furnished by a person solely for that person's employees or customers, or paratransit.\n[Repealed, 1Sp2001 c 8 art 2 s 76]\n[Renumbered subd 15]\n[Renumbered subd 14]\n\"Rural area service\" means a public transportation service operated in rural areas that have not been designated in the most recent decennial census as an urbanized area by the United States Census Bureau.\n[Renumbered subd 2b]\n\"Small urbanized area service\" means a public transportation service operated in areas located outside the metropolitan area with a population of at least 50,000 but less than 200,000 that is designated by the United States Census Bureau. Small urbanized area service does not include complementary paratransit service (ADA), as defined in subdivision 1a.\n\"State sources of funds\" means funding for the public transportation participation program appropriated from (1) the general fund, and (2) the greater Minnesota transit account.\nMS 2022 [Repealed, 2024 c 104 art 2 s 16]",
	"repealed": false
}