{
	"id": "103F.369",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.369",
	"title": "103F.369 PLAN IMPLEMENTATION.",
	"text": "The plan shall be implemented by the board as provided in this section and section 103F.373.\nThe standards set forth in the plan are the minimum standards which may be adopted by the board and by the counties for the protection and enhancement of the natural, scientific, historical, recreational and cultural values of the Mississippi River and related shoreland areas subject to the plan. Except for forest management, fish and wildlife habitat improvement, a veterans cemetery that complies with subdivision 5, and open space recreational uses as defined in the plan, state or county lands within the boundaries established by the plan may not be offered for public sale or lease. The board with the agreement, expressed by resolution adopted after public hearing, of the county boards of Clearwater, Hubbard, Beltrami, Cass, Itasca, Aitkin, Crow Wing, and Morrison Counties may amend the plan in any way that does not reduce the minimum standards set forth in the plan.\nThe board shall develop and establish a schedule for implementation and common administration of the plan by the counties. The schedule shall be binding upon the counties subject to approval by the governing bodies of the respective counties.\nThe counties shall adopt land use ordinances consistent with the plan.\nA veterans cemetery may be located within the boundaries established by the plan if a site plan approved by the county zoning authority addresses each of the following items:\n(1) the name of the cemetery;\n(2) a legal description of the property affected;\n(3) names and addresses of applicant, owner, surveyor, and designer of the plan;\n(4) graphic scale;\n(5) an arrow depicting north on the plan;\n(6) date of preparation of the plan;\n(7) total acreage of property;\n(8) square footage for each proposed site;\n(9) existing soil conditions, depth of water table, and topographic contours;\n(10) roads and proposed roads showing right-of-way widths;\n(11) proposed location and type of on-site sanitary treatment facilities and domestic water supply;\n(12) accessory facilities, existing or to be constructed, by type and location;\n(13) all streams, creeks, ponds, wetlands, and swamps;\n(14) burial only on site with no embalming or other related activities on site;\n(15) no placement of graves or accessory facilities within the designated floodplain; and\n(16) each burial must be in a vault or an appropriate liner as determined by the board.",
	"repealed": false
}