{
	"id": "17.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.102",
	"title": "17.102 MINNESOTA GROWN LABEL.",
	"text": "(a) The commissioner shall establish a \"Minnesota grown\" logo or labeling statement for use in identifying agricultural products that are grown, raised, processed, or manufactured in this state. The commissioner may develop labeling statements that apply to specific marketing or promotional needs. One version of a labeling statement must identify food products certified as organically grown in this state. The Minnesota grown logo or labeling statement may be used on products only if 80 percent or more of the agricultural product is produced in this state.\n(b) The Minnesota grown logo or labeling statement may not be used without a license from the commissioner except that wholesalers and retailers may use the Minnesota grown logo and labeling statement for displaying and advertising products that qualify for use of the Minnesota grown logo or labeling statement.\nThe logo or labeling statement does not supersede or replace any federal label or grade standard that is required by law.\nA person may not use the Minnesota grown logo or labeling without an annual license from the commissioner. The commissioner shall issue licenses for a fee of $20.\nThe Minnesota grown account is established as an account in the agricultural fund. License fee receipts and penalties collected under this section must be deposited in the agricultural fund and credited to the Minnesota grown account. The money in the account is continuously appropriated to the commissioner for the direct costs of implementing the Minnesota grown program.\nThe Minnesota grown account shall consist of license fees, penalties, advertising revenue, revenue from the development and sale of promotional materials, gifts, and appropriations.\nAppropriations from the Minnesota grown account may be expended only to the extent that they are matched with contributions to the account from private sources on a basis of at least $1 of private contributions to each $4 of state money. For the purposes of this subdivision, \"private contributions\" includes, but is not limited to, license fees, penalties, advertising revenue, revenue from the development and sale of promotional materials, and gifts.\nA person who is required to have a license and uses the Minnesota grown logo or labeling without a license after being notified by the commissioner that a license is required is subject to a civil penalty up to $1,000.\nThe commissioner shall promulgate rules authorizing and licensing the use of the logo or labeling statement.",
	"repealed": false
}