{
	"id": "147A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.15",
	"title": "147A.15 IMMUNITY.",
	"text": "Any person, health care facility, business, or organization is immune from civil liability or criminal prosecution for submitting a report to the board pursuant to this chapter or for otherwise reporting to the board violations or alleged violations of this chapter. All such reports are confidential and absolutely privileged communications.\n(a) Members of the board, persons employed by the board, and consultants retained by the board for the purpose of investigation of violations or the preparation and management of charges of violations of this chapter on behalf of the board are immune from civil liability and criminal prosecution for any actions, transactions, or publications in the execution of, or relating to, their duties under this chapter.\n(b) Members of the board and persons employed by the board or engaged in maintaining records and making reports regarding adverse health care events are immune from civil liability and criminal prosecution for any actions, transactions, or publications in the execution of or relating to their duties under section 147A.155.\n(c) For purposes of this section, a member of the board or a consultant described in paragraph (a) is considered a state employee under section 3.736, subdivision 9.\nA physician assistant who is the subject of an investigation by or on behalf of the board shall cooperate fully with the investigation. Cooperation includes responding fully and promptly to any question raised by or on behalf of the board relating to the subject of the investigation and providing copies of patient medical records, as reasonably requested by the board, to assist the board in its investigation. The board shall pay for copies requested. If the board does not have a written consent from a patient permitting access to the patient's records, the physician assistant shall delete any data in the record which identifies the patient before providing it to the board. The board shall maintain any records obtained pursuant to this section as investigative data pursuant to chapter 13.",
	"repealed": false
}