{
	"id": "62L.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.12",
	"title": "62L.12 PROHIBITED PRACTICES.",
	"text": "A health carrier operating in the small employer market shall not knowingly offer, issue, or renew an individual health plan to an eligible employee of a small employer that meets the minimum participation and contribution requirements under section 62L.03, subdivision 3, except as authorized under subdivision 2.\n(a) A health carrier may renew individual conversion policies to eligible employees otherwise eligible for conversion coverage under section 62D.104 as a result of leaving a health maintenance organization's service area.\n(b) A health carrier may renew individual conversion policies to eligible employees otherwise eligible for conversion coverage as a result of the expiration of any continuation of group coverage required under sections 62A.146, 62A.17, 62A.21, 62C.142, 62D.101, and 62D.105.\n(c) A health carrier may renew conversion policies to eligible employees.\n(d) A health carrier may sell, issue, or renew individual continuation policies to eligible employees as required.\n(e) A health carrier may sell, issue, or renew individual health plans if the coverage is appropriate due to an unexpired preexisting condition limitation or exclusion applicable to the person under the employer's group health plan or due to the person's need for health care services not covered under the employer's group health plan.\n(f) A health carrier may sell, issue, or renew an individual health plan, if the individual has elected to buy the individual health plan not as part of a general plan to substitute individual health plans for a group health plan nor as a result of any violation of subdivision 3 or 4.\n(g) A health carrier may sell, issue, or renew an individual health plan if coverage provided by the employer is determined to be unaffordable under the provisions of the Affordable Care Act as defined in section 62A.011, subdivision 1a.\n(h) Nothing in this subdivision relieves a health carrier of any obligation to provide continuation or conversion coverage otherwise required under federal or state law.\n(i) Nothing in this chapter restricts the offer, sale, issuance, or renewal of coverage issued as a supplement to Medicare under sections 62A.3099 to 62A.44, or policies or contracts that supplement Medicare issued by health maintenance organizations, or those contracts governed by sections 1833, 1851 to 1859, 1860D, or 1876 of the federal Social Security Act, United States Code, title 42, section 1395 et seq., as amended.\n(j) Nothing in this chapter restricts the offer, sale, issuance, or renewal of individual health plans necessary to comply with a court order.\n(k) A health carrier may offer, issue, sell, or renew an individual health plan to persons eligible for an employer group health plan, if the individual health plan is a high deductible health plan for use in connection with an existing health savings account, in compliance with the Internal Revenue Code, section 223. In that situation, the same or a different health carrier may offer, issue, sell, or renew a group health plan to cover the other eligible employees in the group.\n(l) A health carrier may offer, sell, issue, or renew an individual health plan to one or more employees of a small employer if the individual health plan is marketed directly to all employees of the small employer and the small employer does not contribute directly or indirectly to the premiums or facilitate the administration of the individual health plan. The requirement to market an individual health plan to all employees does not require the health carrier to offer or issue an individual health plan to any employee. For purposes of this paragraph, an employer is not contributing to the premiums or facilitating the administration of the individual health plan if the employer does not contribute to the premium and merely collects the premiums from an employee's wages or salary through payroll deductions and submits payment for the premiums of one or more employees in a lump sum to the health carrier. Except for coverage under section 62A.65, subdivision 5, paragraph (b), at the request of an employee, the health carrier may bill the employer for the premiums payable by the employee, provided that the employer is not liable for payment except from payroll deductions for that purpose. If an employer is submitting payments under this paragraph, the health carrier shall provide a cancellation notice directly to the primary insured at least ten days prior to termination of coverage for nonpayment of premium. Individual coverage under this paragraph may be offered only if the small employer has not provided coverage under section 62L.03 to the employees within the past 12 months.\n(m) A health carrier may offer, sell, issue, or renew an individual health plan to one or more employees of a small employer if the small employer, eligible employee, and individual health plan are in compliance with the 21st Century Cures Act, Public Law 114-255, section 18001.\nAn agent licensed under chapter 60K or section 62C.17 who knowingly and willfully breaks apart a small group for the purpose of selling individual health plans to eligible employees and dependents of a small employer that meets the participation and contribution requirements of section 62L.03, subdivision 3, is guilty of an unfair trade practice and subject to disciplinary action, including the revocation or suspension of license, under section 60K.43 or 62C.17. The action must be by order and subject to the notice, hearing, and appeal procedures specified in section 60K.43. The action of the commissioner is subject to judicial review as provided under chapter 14. This section does not apply to any action performed by an agent that would be permitted for a health carrier under subdivision 2.\nA small employer shall not encourage or direct an employee or applicant to:\n(1) refrain from filing an application for health coverage when other similarly situated employees may file an application for health coverage;\n(2) file an application for health coverage during initial eligibility for coverage, the acceptance of which is contingent on health status, when other similarly situated employees may apply for health coverage, the acceptance of which is not contingent on health status;\n(3) seek coverage from another health carrier, including, but not limited to, MCHA; or\n(4) cause coverage to be issued on different terms because of the health status or claims experience of that person or the person's dependents.\nA health carrier shall not condition the offer, sale, issuance, or renewal of a health benefit plan on the purchase by a small employer of other insurance products offered by the health carrier or a subsidiary or affiliate of the health carrier, including, but not limited to, life, disability, property, and general liability insurance. This prohibition does not apply to insurance products offered as a supplement to a health maintenance organization plan, including, but not limited to, supplemental benefit plans under section 62D.05, subdivision 6.",
	"repealed": false
}