{
	"id": "115A.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.54",
	"title": "115A.54 WASTE MANAGEMENT CAPITAL ASSISTANCE PROJECTS.",
	"text": "The legislature finds that acquiring, establishing, and improving facilities that conduct waste reduction, reuse, recycling, composting source-separated compostable materials or yard waste, resource recovery, and waste processing and transfer stations serving such facilities is needed to reduce and manage properly the solid waste generated in the state and to conserve and protect the natural resources in the state and the health, safety, and welfare of its citizens; that opportunities to acquire, establish, and improve the facilities and transfer stations are not being fully realized by individual political subdivisions or by agreements among subdivisions; and that therefore it is necessary to provide capital assistance to stimulate and encourage the acquisition, establishment, and improvement of the facilities and transfer stations.\nThe commissioner shall provide technical and financial assistance to acquire, establish, and improve the facilities and transfer stations from revenues derived from issuing bonds authorized by section 115A.58. Facilities for incinerating solid waste without resource recovery are not eligible for assistance. Money appropriated for the purposes of the program may be distributed as grants or loans. An individual project may receive assistance totaling up to 100 percent of the capital cost of the project and grants up to 75 percent of the capital cost of the project. No grant or loan shall be disbursed to any recipient until the commissioner has determined the total estimated capital cost of the project and ascertained that financing of the cost is assured by funds provided by the state, by an agency of the federal government within the amount of funds then appropriated to that agency and allocated by it to projects within the state, by any person, or by the appropriation of proceeds of bonds or other funds of the recipient to a fund for constructing the project.\n(a) The commissioner shall provide technical and financial assistance to acquire, establish, and improve solid waste management projects as provided in this subdivision and section 115A.52. Money appropriated for the purposes of this subdivision must be distributed as grants.\n(b) Except as provided in paragraph (c) or (d), a project may receive grant assistance up to 25 percent of the capital cost of the project or $5,000,000, whichever is less, except that projects constructed as a result of intercounty cooperative agreements may receive the lesser of:\n(1) grant assistance up to 25 percent of the capital cost of the project; or\n(2) $5,000,000 times the number of participating counties.\n(c) A recycling project, a project to compost source-separated compostable material or yard waste, or a project to manage household hazardous waste may receive grant assistance up to 50 percent of the capital cost of the project or $5,000,000, whichever is less, except that projects completed as a result of intercounty cooperative agreements may receive the lesser of:\n(1) grant assistance up to 50 percent of the capital cost of the project; or\n(2) $5,000,000 times the number of participating counties.\n(d) The following projects may also receive grant assistance in the amounts specified in paragraph (c):\n(1) a project to improve control of or reduce air emissions at an existing resource recovery facility; and\n(2) a project to substantially increase the recovery of materials or energy, substantially reduce the amount or toxicity of waste processing residuals, or expand the capacity of an existing resource recovery facility to meet the resource recovery needs of an expanded region if each county from which waste is or would be received has achieved a recycling rate in excess of the goals in section 115A.551, and is implementing aggressive waste reduction and household hazardous waste management programs.\n(e) A waste reduction project or reuse project may receive grant assistance up to 75 percent of the capital cost of the project or $5,000,000, whichever is less, except that projects completed as a result of intercounty cooperative agreements may receive the lesser of:\n(1) grant assistance up to 75 percent of the capital cost of the project; or\n(2) $5,000,000 times the number of participating counties.\n(f) Notwithstanding paragraph (g), the commissioner may award grants for transfer stations that will initially transfer waste to landfills if the transfer stations are part of a planned resource recovery project, the county where the planned resource recovery facility will be located has a comprehensive solid waste management plan approved by the commissioner, and the solid waste management plan proposes the development of the resource recovery facility. If the proposed resource recovery facility is not in place and operating within 16 years of the date of the grant award, the recipient shall repay the grant amount to the state.\n(g) Projects without waste reduction, reuse, recycling, composting source-separated compostable material or yard waste, or resource recovery are not eligible for assistance. Solid waste disposal facilities and equipment are not eligible for assistance.\n(h) In addition to any assistance received under paragraph (b), (c), (d), or (e), a project may receive grant assistance for the cost of tests necessary to determine the appropriate pollution control equipment for the project or the environmental effects of the use of any product or material produced by the project.\n(i) In addition to the application requirements of section 115A.51, an application for a project serving eligible jurisdictions in only a single county must demonstrate that cooperation with jurisdictions in other counties to develop the project is not needed or not feasible. Each application must also demonstrate that the project is not financially prudent without the state assistance, because of the applicant's financial capacity and the problems inherent in the waste management situation in the area, particularly transportation distances and limited waste supply and markets for resources recovered.\n(j) For the purposes of this subdivision, \"project\" means acquisition, establishment, or improvement of a facility that conducts waste reduction, reuse, recycling, composting source-separated compostable materials or yard waste, resource recovery, or waste processing, together with any transfer stations, transmission facilities, and other related and appurtenant facilities primarily serving the facility.\n(k) The commissioner shall adopt rules for the program.\n(l) Notwithstanding anything in this subdivision to the contrary, a project to construct a new solid waste transfer station that has an enforceable commitment of at least ten years, or of sufficient length to retire bonds sold for the facility, to serve an existing resource recovery facility may receive grant assistance up to 75 percent of the capital cost of the project if addition of the transfer station will increase substantially the geographical area served by the resource recovery facility and the ability of the resource recovery facility to operate more efficiently on a regional basis and the facility meets the criteria in paragraph (d), clause (2). A transfer station eligible for assistance under this paragraph is not eligible for assistance under any other paragraph of this subdivision.\nNo grant or loan for any project shall be disbursed until the governing body of the recipient has made an irrevocable undertaking, by resolution, to use all funds made available exclusively for the capital cost of the project and to pay any additional amount by which the cost of the project exceeds the estimate by appropriation to the construction fund of additional funds or proceeds of additional bonds of the recipient. The resolution shall also indicate that any subsequent withdrawal of allocated or additional funds of the recipient will impair the obligation of contract between the state of Minnesota, the recipient, and the bondholders. The resolution shall pledge payment to the debt service account of all revenues of the project to the extent that they exceed costs and shall also obligate the recipient to levy a tax sufficient to make timely payments under the loan agreement, if a deficiency occurs in the amount of user charges, taxes, special assessments, or other money pledged for payment under the loan agreement. Each loan made to a recipient shall be secured by resolutions adopted by the commissioner of the Pollution Control Agency and the governing body of the recipient, obligating the recipient to repay the loan to the commissioner of management and budget in annual installments including both principal and interest. Installments shall be in an amount sufficient to pay the principal amount within the period required by the commissioner of the Pollution Control Agency. The interest on the loan shall be calculated on the declining balance at a rate not less than the average annual interest rate on the state bonds of the issue from which proceeds of the loan were made. The resolution shall obligate the recipient to provide money for the repayment from user charges, taxes, special assessments or any other funds available to it.\nNotwithstanding the provisions of section 16A.695, the commissioner may terminate the obligations of a grant or loan recipient under this section, if the commissioner finds that the recipient has made a good faith effort to exhaust all options in trying to comply with the terms and conditions of the grant or loan. In lieu of declaring a default on a grant or a loan under this section, the commissioner may identify additional measures a recipient should take in order to meet the good faith test required for terminating the recipient's obligations under this section.",
	"repealed": false
}