{
	"id": "524.6-207",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.6-207",
	"title": "524.6-207 RIGHTS OF CREDITORS.",
	"text": "No multiple-party account will be effective against an estate of a deceased party to transfer to a survivor sums needed to pay debts, taxes, and expenses of administration, including statutory allowances to the surviving spouse, minor children and dependent children or against the state or a county agency with a claim authorized by section 256B.15, if other assets of the estate are insufficient, to the extent the deceased party is the source of the funds or beneficial owner. A surviving party or P.O.D. payee who receives payment from a multiple-party account after the death of a deceased party shall be liable to account to the deceased party's personal representative or the state or a county agency with a claim authorized by section 256B.15 for amounts the decedent owned beneficially immediately before death to the extent necessary to discharge any such claims and charges remaining unpaid after the application of the assets of the decedent's estate. No proceeding to assert this liability shall be commenced by the personal representative unless the personal representative has received a written demand by a surviving spouse, a creditor or one acting for a minor dependent child of the decedent, and no proceeding shall be commenced later than two years following the death of the decedent. Sums recovered by the personal representative shall be administered as part of the decedent's estate. This section shall not affect the right of a financial institution to make payment on multiple-party accounts according to the terms thereof, or make it liable to the estate of a deceased party unless, before payment, the institution has been served with process in a proceeding by the personal representative or the state or a county agency with a claim authorized by section 256B.15, or has been presented by the state or a county agency with a claim authorized by section 256B.15 with an affidavit pursuant to section 524.3-1201. Upon being presented with such an affidavit, the financial institution shall make payment of the multiple-party account to the affiant in an amount equal to the lesser of the claim stated in the affidavit or the extent to which the affidavit identifies the decedent as the source of funds or beneficial owner of the account.",
	"repealed": false
}