{
	"id": "383B.1582",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.1582",
	"title": "383B.1582 RFP FOR DESIGN-BUILD.",
	"text": "During phase two, the county shall issue an RFP to the design-builders on the short list. The RFP must include:\n(1) the scope of work, including (i) performance and technical requirements, (ii) conceptual design, (iii) minimum specifications, and (iv) functional and operational elements for the delivery of the completed project, which must be prepared by a design professional qualified to prepare the necessary documents;\n(2) a description of the qualifications required of the design-builder;\n(3) a description of the selection criteria, including the weight or relative order, or both, of each criterion;\n(4) copies of the contract documents that the successful proposer will be expected to sign;\n(5) the maximum time allowable for design and construction;\n(6) the county's estimated cost for design and construction;\n(7) the requirement that a submitted proposal be segmented into two parts, a technical proposal and a price proposal;\n(8) the requirement that each proposal be in a separately sealed, clearly identified package and include the date and time of the submittal deadline;\n(9) the requirement that the technical proposal include a critical path method; bar schedule of the work to be performed, or similar schematic; design plans and specifications; technical reports; calculations; permit requirements; applicable development fees; and other data requested in the RFP;\n(10) the requirement that the price proposal contain all design, construction, engineering, inspection, and construction-related costs, and all other costs of any kind of the proposed project;\n(11) the date, time, and location of the public opening of the sealed price proposals;\n(12) a statement that \"past performance\" or \"experience\" does not include the exercise or assertion of a person's legal rights; and\n(13) other information relevant to the project.",
	"repealed": false
}