{
	"id": "147E.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/147E.25",
	"title": "147E.25 CONTINUING EDUCATION REQUIREMENT.",
	"text": "(a) A registrant applying for registration renewal must complete a minimum of 25 contact hours of board-approved continuing education in the year preceding registration renewal, with the exception of the registrant's first incomplete year, and attest to completion of continuing education requirements by reporting to the board.\n(b) Of the 25 contact hours of continuing education requirement in paragraph (a), at least five hours of continuing education must be in pharmacotherapeutics.\nThe board shall approve continuing education programs that have been approved for continuing education credit by the American Association of Naturopathic Physicians or any of its constituent state associations, the American Chiropractic Association or any of its constituent state associations, the American Osteopathic Association Bureau of Professional Education, the American Pharmacists Association or any of its constituent state associations, or an organization approved by the Accreditation Council for Continuing Medical Education.\nThe board shall also approve continuing education programs that do not meet the requirements of subdivision 2 but meet the following criteria:\n(1) the program content directly relates to the practice of naturopathic medicine;\n(2) each member of the program faculty is knowledgeable in the subject matter as demonstrated by a degree from an accredited education program, verifiable experience in the field of naturopathic medicine, special training in the subject matter, or experience teaching in the subject area;\n(3) the program lasts at least 50 minutes per contact hour;\n(4) there are specific, measurable, written objectives, consistent with the program, describing the expected outcomes for the participants; and\n(5) the program sponsor has a mechanism to verify participation and maintains attendance records for three years.\nA registrant may not apply contact hours acquired in one one-year reporting period to a future continuing education reporting period.\nThe board shall periodically select a random sample of registrants and require those registrants to supply the board with evidence of having completed the continuing education to which they attested. Documentation may come directly from the registrants from state or national organizations that maintain continuing education records.\nContinuing education program topics may include, but are not limited to, naturopathic medical theory and techniques including diagnostic techniques, nutrition, botanical medicine, homeopathic medicine, physical medicine, lifestyle modification counseling, anatomy, physiology, biochemistry, pharmacology, pharmacognosy, microbiology, medical ethics, psychology, history of medicine, and medical terminology or coding.\n(a) A registrant may apply no more than five hours of practice management to a one-year reporting period.\n(b) A registrant may apply no more than 15 hours to any single subject area.\nThe board may exempt any person holding a registration under this chapter from the requirements of subdivision 1 upon application showing evidence satisfactory to the board of inability to comply with the requirements because of physical or mental condition or because of other unusual or extenuating circumstances. However, no person may be exempted from the requirements of subdivision 1 more than once in any five-year period.",
	"repealed": false
}