{
	"id": "169.4502",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.4502",
	"title": "169.4502 ADDITIONAL MINNESOTA SCHOOL BUS CHASSIS STANDARDS.",
	"text": "The bus chassis standards contained in this section are required in addition to those required by section 169.4501. When a Minnesota standard contained in this section conflicts with a national standard adopted in section 169.4501, the Minnesota standard contained in this section is controlling.\nThe braking system must meet federal motor vehicle safety standards in effect at the time of manufacture.\nA chassis manufacturer shall certify that the product meets Minnesota standards. All buses with a certified manufacturing date prior to April 1, 1977, shall not be recertified as a school bus after January 1, 1996.\nFenders may be painted black. The hood may be painted nonreflective black or nonreflective yellow. The grill may be manufacturer's standard color or chrome.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n[Repealed, 2004 c 294 art 2 s 34]\nInstallation of a trailer hitch is permitted. A hitch shall be flush mounted.\n[Repealed, 2004 c 294 art 2 s 34]\nA bus shall be equipped with a horn in good working order and capable of emitting sound audible under normal conditions from a distance of not less than 200 feet.\nThe use of multipiece rims or tube-type tires is not permitted on school buses manufactured after October 31, 2004. Radial and bias-ply tires shall not be used on the same axle. Front tire tread depth shall not be less than 4/32 inch in any major tire tread groove. Rear tire tread shall not be less than 2/32 inch. Tires must be measured in three locations around the tire, in two adjoining grooves. No recapped tires shall be used on the front wheels. Recapped tires are permitted on the rear wheels.\nThe transmission shifting pattern must be permanently displayed in the driver's full view.\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 2007 c 146 art 8 s 15]",
	"repealed": false
}