{
	"id": "97A.433",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.433",
	"title": "97A.433 ELK LICENSES.",
	"text": "The commissioner shall include in a rule setting the dates for an elk season:\n(1) the number of licenses to be issued; and\n(2) the size of an elk-hunting party, not to exceed two persons.\nPersons eligible for an elk license shall be determined under this section and commissioner's rule. A person is eligible for an elk license only if the person:\n(1) is a resident; and\n(2) has never been issued an elk license.\nAn application for an elk license must be on a form provided by the commissioner and accompanied by a $4 nonrefundable application fee per person. A person may not make more than one application for each season. If a person makes more than one application, the person is ineligible for a license for that season after determination by the commissioner, without a hearing.\n(a) The commissioner may conduct a separate selection for up to 20 percent of the elk licenses to be issued for an area. Only owners of, and tenants living on, at least 160 acres of agricultural or grazing land in the area, and their family members, are eligible for the separate selection. Persons that are unsuccessful in a separate selection must be included in the selection for the remaining licenses. Persons who obtain an elk license in a separate selection may sell their license to any Minnesota resident eligible to hunt big game for no more than the original cost of the license.\n(b) The commissioner may by rule establish criteria for determining eligible family members under this subdivision.\nThe commissioner must conduct a separate selection for 20 percent of the elk licenses to be issued each year. Only individuals who have applied at least ten times for an elk license and who have never received a license are eligible for this separate selection. A person who is unsuccessful in a separate selection under this subdivision must be included in the selection for the remaining licenses.",
	"repealed": false
}