{
	"id": "145.9273",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9273",
	"title": "145.9273 TESTING FOR LEAD IN DRINKING WATER IN CHILD CARE SETTINGS.",
	"text": "(a) By July 1, 2024, licensed or certified child care providers must develop a plan to accurately and efficiently test for the presence of lead in drinking water in child care facilities following either the Department of Health's document \"Reducing Lead in Drinking Water: A Technical Guidance for Minnesota's School and Child Care Facilities\" or the Environmental Protection Agency's \"3Ts: Training, Testing, Taking Action\" guidance materials.\n(b) For purposes of this section, \"licensed or certified child care provider\" means a child care center licensed under Minnesota Rules, chapter 9503, or a certified license-exempt child care center under chapter 142C.\nThe plan under subdivision 1 must include testing every building serving children and all water fixtures used for consumption of water, including water used in food preparation. All taps must be tested at least once every five years. A licensed or certified child care provider must begin testing in buildings by July 1, 2024, and complete testing in all buildings that serve students within five years.\nThe plan under subdivision 1 must include steps to remediate if lead is present in drinking water. A licensed or certified child care provider that finds lead at concentrations at or exceeding five parts per billion at a specific location providing water to children within its facilities must take action to reduce lead exposure following guidance and verify the success of remediation by retesting the location for lead. Remediation actions are actions that reduce lead levels from the drinking water fixture as demonstrated by testing. This includes using certified filters, implementing and documenting a building-wide flushing program, and replacing or removing fixtures with elevated lead levels.\n(a) A licensed or certified child care provider that tested its buildings for the presence of lead shall make the results of the testing and any remediation steps taken available to parents and staff and notify them of the availability of results. Reporting shall occur no later than 30 days from receipt of results and annually thereafter.\n(b) Beginning July 1, 2024, a licensed or certified child care provider must report the provider's test results and remediation activities to the commissioner of health annually on or before July 1 of each year.",
	"repealed": false
}