{
	"id": "97B.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.106",
	"title": "97B.106 CROSSBOW PERMITS FOR HUNTING AND FISHING.",
	"text": "(a) The commissioner may issue a special permit, without a fee, to take big game, small game, native rough fish, or common carp with a crossbow to a person that is unable to hunt or take native rough fish or common carp by archery because of a permanent or temporary physical disability. A crossbow permit issued under this section also allows the permittee to use a bow with a mechanical device that draws, releases, or holds the bow at full draw as provided in section 97B.035, subdivision 1, paragraph (a).\n(b) To qualify for a crossbow permit under this section, a temporary disability must render the person unable to hunt or fish by archery for a minimum of two years after application for the permit is made. The permanent or temporary disability must be established by medical evidence, and the inability to hunt or fish by archery for the required period of time must be verified in writing by (1) a licensed physician, licensed advanced practice registered nurse, or licensed physician assistant; or (2) a licensed chiropractor. A person who has received a special permit under this section because of a permanent disability is eligible for subsequent special permits without providing medical evidence and verification of the disability.\n(c) The person must obtain the appropriate license.\n(a) A crossbow used for hunting under the provisions of this section must:\n(1) be fired from the shoulder;\n(2) deliver at least 42 foot-pounds of energy at a distance of ten feet;\n(3) have a working safety; and\n(4) be used with arrows or bolts at least ten inches long.\n(b) An arrow or bolt used to take big game or turkey under the provisions of this section must meet the legal arrowhead requirements in section 97B.211, subdivision 2.\n(c) An arrow or bolt used to take native rough fish or common carp with a crossbow under the provisions of this section must be tethered or controlled by an attached line.",
	"repealed": false
}