{
	"id": "16B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.04",
	"title": "16B.04 AUTHORITY.",
	"text": "Subject to chapter 14, the commissioner may adopt, amend, and rescind rules relating to any purpose, responsibility, or authorization in this chapter. Rules adopted must comply with any provisions in this chapter which specify or restrict the adoption of particular rules.\nSubject to other provisions of this chapter, the commissioner is authorized to:\n(1) supervise, control, review, and approve all state contracts and purchasing;\n(2) provide agencies with supplies and equipment;\n(3) investigate and study the management and organization of agencies, and reorganize them when necessary to ensure their effective and efficient operation;\n(4) manage and control state property, real and personal;\n(5) maintain and operate all state buildings, as described in section 16B.24, subdivision 1;\n(6) supervise, control, review, and approve all capital improvements to state buildings and the Capitol building and grounds;\n(7) provide central mail facilities;\n(8) oversee publication of official documents and provide for their sale;\n(9) manage and operate parking facilities for state employees and an enterprise fleet for travel on state business;\n(10) provide rental space within the Capitol complex for a private day care center for children of state employees. The commissioner shall contract for services as provided in this chapter;\n(11) settle state employee workers' compensation claims;\n(12) purchase, accept, transfer, warehouse, sell, distribute, or dispose of surplus property in accordance with state and federal rules and regulations. The commissioner may charge a fee to cover any expenses incurred in connection with any of these acts; and\n(13) provide and manage a central distribution center for federal and state surplus personal property, as defined in section 16B.2975, and may provide and manage a warehouse facility.\nThe governor, unless otherwise provided by law, may delegate to the commissioner the administration of programs and projects of the Office of the Governor directed by either state or federal law, or which may be made available to the state under a grant of funds either public or private. Unless specifically prohibited by law, the governor may delegate to the commissioner general supervision of any program or activity of any agency the head of which is either appointed by the governor or by a gubernatorially appointed board. The provisions of this subdivision shall not be construed as authority to transfer programs or activities, or part of them, from one department to another.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste of public money;\n(2) use innovative fiscal and human resource practices;\n(3) coordinate the department's activities with other governmental agencies;\n(4) use technology to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature changes in law necessary to carry out the mission and improve the performance of the department.",
	"repealed": false
}