{
	"id": "524.3-916",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-916",
	"title": "524.3-916 APPORTIONMENT OF ESTATE TAXES AND GENERATION-SKIPPING TAX.",
	"text": "(a) For purposes of this section:\n(1) \"estate\" means the gross estate of a decedent as determined for the purpose of federal estate tax or the estate tax payable to this state;\n(2) \"decedent's generation-skipping transfers\" means all generation-skipping transfers as determined for purposes of the federal generation-skipping tax which occur by reason of the decedent's death which relate to property which is included in the decedent's estate;\n(3) \"person\" means any individual, partnership, association, joint stock company, corporation, limited liability company, government, political subdivision, governmental agency, or local governmental agency;\n(4) \"person interested in the estate\" means any person entitled to receive, or who has received, from a decedent or by reason of the death of a decedent any property or interest therein included in the decedent's estate. It includes a personal representative, guardian, conservator, trustee, and custodian;\n(5) \"state\" means any state, territory, or possession of the United States, the District of Columbia, and the Commonwealth of Puerto Rico;\n(6) \"estate tax\" means the federal estate tax and the state estate tax determined by the commissioner of revenue pursuant to chapter 291 and interest and penalties imposed in addition to the tax;\n(7) \"decedent's generation-skipping tax\" means the federal generation-skipping tax imposed on the decedent's generation-skipping transfers and interest and penalties imposed in addition to the tax;\n(8) \"fiduciary\" means personal representative or trustee.\n(b) Any tax occasioned by a decedent's death shall be apportioned as set forth in clauses (1) to (4).\n(1) Estate taxes shall be apportioned among all persons interested in the estate in the proportion that the value of the interest of each person interested in the estate bears to the total value of the interests of all persons interested in the estate. The values used in determining the tax shall be used in apportioning the tax.\n(2) Notwithstanding the general rule set forth in clause (1), if property is included in the decedent's gross estate pursuant to section 2044 of the Internal Revenue Code of 1986, as amended, or any similar provision of any state estate tax law, the difference between the total estate tax payable by the decedent's estate and the amount of estate tax that would have been payable by the decedent's estate if the property had not been included in the decedent's gross estate shall be apportioned ratably among the holders of interests in the property. The values used in determining the tax shall be used in apportioning the tax. The balance of the tax, if any, shall be apportioned as provided in clause (1).\n(3) The decedent's generation-skipping tax shall be apportioned as provided by federal law. To the extent not provided by federal law, the decedent's generation-skipping tax shall be apportioned among all persons receiving the decedent's generation-skipping transfers whose tax apportionment is not provided by federal law in the proportion that the value of the transfer to each person bears to the total value of all such transfers.\n(4) If the decedent's will or other written instrument directs a method of apportionment of estate tax or of the decedent's generation-skipping tax different from the methods described in this section, the method described in the will or other written instrument shall control; provided, however, that:\n(i) unless the decedent's will or other written instrument specifically indicates an intent to waive any right of recovery under section 2207A of the Internal Revenue Code of 1986, as amended, estate taxes on property described in clause (2) must be apportioned under the method described in clause (2); and\n(ii) unless the decedent's will or other written instrument specifically indicates an intent to waive any right of recovery under section 2207B of the Internal Revenue Code of 1986, as amended, estate taxes on property included in the decedent's estate under section 2036 of the Internal Revenue Code of 1986, as amended, must be apportioned under the method described in clause (1).\n(c)(1) The court in which venue lies for the administration of the estate of a decedent, on petition for the purpose may determine the apportionment of the estate tax or of the decedent's generation-skipping tax.\n(2) If the court finds that it is inequitable to apportion interest and penalties in the manner provided in subsection (b), because of special circumstances, it may direct apportionment thereof in the manner it finds equitable.\n(3) If the court finds that the assessment of penalties and interest assessed in relation to the estate tax or the decedent's generation-skipping tax is due to delay caused by the negligence of the fiduciary, the court may charge the fiduciary with the amount of the assessed penalties and interest.\n(4) In any action to recover from any person interested in the estate the amount of the estate tax or of the decedent's generation-skipping tax apportioned to the person in accordance with this section the determination of the court in respect thereto shall be prima facie correct.\n(d)(1) The personal representative or other person in possession of the property of the decedent required to pay the estate tax or the decedent's generation-skipping tax may withhold from any property distributable to any person interested in the estate, upon its distribution, the amount of any taxes attributable to the person's interest. If the property in possession of the personal representative or other person required to pay any taxes and distributable to any person interested in the estate is insufficient to satisfy the proportionate amount of the taxes determined to be due from the person, the personal representative or other person required to pay any taxes may recover the deficiency from the person interested in the estate. If the property is not in the possession of the personal representative or the other person required to pay any taxes, the personal representative or the other person required to pay any taxes may recover from any person interested in the estate the amount of any taxes apportioned to the person in accordance with this section.\n(2) If property held by the personal representative or other person in possession of the property of the decedent required to pay the estate tax or the decedent's generation-skipping tax is distributed prior to final apportionment of the estate tax or the decedent's generation-skipping tax, the distributee shall provide a bond or other security for the apportionment liability in the form and amount prescribed by the personal representative or other person, as the case may be.\n(e)(1) In making an apportionment, allowances shall be made for any exemptions granted, any classification made of persons interested in the estate and for any deductions and credits allowed by the law imposing the tax.\n(2) Any exemption or deduction allowed by reason of the relationship of any person to the decedent, by reason of the purposes of the gift, or by allocation to the gift (either by election by the fiduciary or by operation of federal law), inures to the benefit of the person bearing such relationship or receiving the gift; but if an interest is subject to a prior present interest which is not allowable as a deduction, the tax apportionable against the present interest shall be paid from principal.\n(3) Any deduction for property previously taxed and any credit for gift taxes or death taxes of a foreign country paid by the decedent or the decedent's estate inures to the proportionate benefit of all persons liable to apportionment.\n(4) Any credit for inheritance, succession or estate taxes or taxes in the nature thereof applicable to property or interests includable in the estate, inures to the benefit of the persons or interests chargeable with the payment thereof to the extent proportionately that the credit reduces the tax.\n(5) To the extent that property passing to or in trust for a surviving spouse or any charitable, public or similar gift or devise is not an allowable deduction for purposes of the estate tax solely by reason of an estate tax imposed upon and deductible from the property, the property is not included in the computation provided for in subsection (b)(1) hereof, and to that extent no apportionment is made against the property. The sentence immediately preceding does not apply to any case if the result would be to deprive the estate of a deduction otherwise allowable under section 2053(d) of the Internal Revenue Code of 1986, as amended, of the United States, relating to deduction for state death taxes on transfers for public, charitable, or religious uses.\n(f) No interest in income and no estate for years or for life or other temporary interest in any property or fund is subject to apportionment as between the temporary interest and the remainder. The estate tax on the temporary interest and the estate tax, if any, on the remainder is chargeable against the corpus of the property or funds subject to the temporary interest and remainder. The decedent's generation-skipping tax is chargeable against the property which constitutes the decedent's generation-skipping transfer.\n(g) Neither the personal representative nor other person required to pay the tax is under any duty to institute any action to recover from any person interested in the estate the amount of the estate tax or of the decedent's generation-skipping tax apportioned to the person until the final determination of the tax. A personal representative or other person required to pay the estate tax or decedent's generation-skipping tax who institutes the action within a reasonable time after final determination of the tax is not subject to any liability or surcharge because any portion of the tax apportioned to any person interested in the estate was collectible at a time following the death of the decedent but thereafter became uncollectible. If the personal representative or other person required to pay the estate tax or decedent's generation-skipping tax cannot collect from any person interested in the estate the amount of the tax apportioned to the person, the amount not recoverable shall be equitably apportioned among the other persons interested in the estate who are subject to apportionment of the tax involved.\n(h) A personal representative acting in another state or a person required to pay the estate tax or decedent's generation-skipping tax domiciled in another state may institute an action in the courts of this state and may recover a proportionate amount of the federal estate tax, of an estate tax payable to another state or of a death duty due by a decedent's estate to another state, or of the decedent's generation-skipping tax, from a person interested in the estate who is either domiciled in this state or who owns property in this state subject to attachment or execution. For the purposes of the action the determination of apportionment by the court having jurisdiction of the administration of the decedent's estate in the other state is prima facie correct.",
	"repealed": false
}