{
	"id": "97A.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.137",
	"title": "97A.137 HUNTING, FISHING, AND TRESPASSING IN WILDLIFE MANAGEMENT AREAS.",
	"text": "Wildlife management areas are open to hunting and fishing unless closed by rule of the commissioner or by posting under subdivision 2.\nThe commissioner may, by posting in accordance with section 97B.001, subdivision 4, designate areas within wildlife management areas that are closed to entry for the purpose of providing areas where disturbance of wildlife can be minimized. A person may not enter an area posted under this subdivision except as authorized by rule or a permit issued by the commissioner.\nThe commissioner may provide an accommodation by issuing a special permit, without a fee, authorizing a person with a disability to use an other power-driven mobility device, as defined under Code of Federal Regulations, title 28, section 35.104, or a motor boat in wildlife management areas. To qualify for a permit under this subdivision, the person must provide credible assurance to the commissioner that the device or motor boat is used because of a disability.\n(a) Wildlife management areas that are established according to section 86A.05, subdivision 8; designated under section 97A.133 or 97A.145; and 160 contiguous acres or larger are exempt from local ordinances that limit the taking of game and fish or vegetation management in the unit as authorized by state law.\n(b) Wildlife management areas that are established according to section 86A.05, subdivision 8; designated under section 97A.133 or 97A.145; and at least 40 contiguous acres and less than 160 contiguous acres are exempt from local ordinances that:\n(1) restrict trapping;\n(2) restrict the discharge of archery equipment;\n(3) restrict the discharge of shotguns with shot sizes of F or .22 inch diameter or smaller shot;\n(4) restrict noise;\n(5) require dogs on a leash; or\n(6) would in any manner restrict the management of vegetation in the unit as authorized by state law.\n(a) Prior to the Saturday on or nearest September 16, a portable stand may be left overnight in a wildlife management area by a person with a valid bear license who is hunting within 100 yards of a bear bait site that is legally tagged and registered as prescribed under section 97B.425. Any person leaving a portable stand overnight under this subdivision must affix a tag with: (1) the person's name and address; (2) the licensee's driver's license number; or (3) the \"MDNR#\" license identification number issued to the licensee. The tag must be affixed to the stand in a manner that it can be read from the ground.\n(b) From November 1 through December 31, a portable stand may be left overnight by a person possessing a license to take deer in a wildlife management area located in whole or in part north and west of a line described as follows:\nState Trunk Highway 1 from the west boundary of the state to State Trunk Highway 89; then north along State Trunk Highway 89 to Fourtown; then north on County State-Aid Highway 44, Beltrami County, to County Road 704, Beltrami County; then north on County Road 704 to Dick's Parkway State Forest Road; then north on Dick's Parkway to County State-Aid Highway 5, Roseau County; then north on County State-Aid Highway 5 to Warroad; then north on State Trunk Highway 11 to State Trunk Highway 313; then north on State Trunk Highway 313 to the north boundary of the state.\nA person leaving a portable stand overnight under this paragraph must affix a tag with: (1) the person's name and address; (2) the licensee's driver's license number; or (3) the \"MDNR#\" license identification number issued to the licensee. The tag must be affixed to the stand so that it can be read from the ground and must be made of a material sufficient to withstand weather conditions. A person leaving a portable stand overnight in a wildlife management area under this paragraph may not leave more than two portable stands in any one wildlife management area. Unoccupied portable stands left overnight under this paragraph may be used by any member of the public.\n(a) The commissioner may grant a permit to cross state lands within wildlife management areas for temporary right-of-way access to federal, county-managed, or privately owned lands for resource management purposes. A permit for crossing state lands within wildlife management areas is revocable at any time subject to conditions identified in the permit.\n(b) The commissioner may grant a permit to a private landowner or leaseholder to cross state lands within wildlife management areas by motorized vehicle for temporary right-of-way access to a permit applicant's land, when it is the only reasonable access and is consistent with the maintenance and management of wildlife lands.",
	"repealed": false
}