{
	"id": "256B.058",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.058",
	"title": "256B.058 TREATMENT OF INCOME OF INSTITUTIONALIZED SPOUSE.",
	"text": "The income described in subdivisions 2 and 3 shall be deducted from an institutionalized spouse's monthly income and is not considered available for payment of the monthly costs of an institutionalized spouse after the institutionalized spouse has been determined eligible for medical assistance.\n(a) For an institutionalized spouse, monthly income may be allocated to the community spouse as a monthly income allowance for the community spouse. Beginning with the first full calendar month the institutionalized spouse is in the institution, the monthly income allowance is not considered available to the institutionalized spouse for monthly payment of costs of care in the institution as long as the income is made available to the community spouse.\n(b) The monthly income allowance is the amount by which the community spouse's monthly maintenance needs allowance under paragraphs (c) and (d) exceeds the amount of monthly income otherwise available to the community spouse.\n(c) The community spouse's monthly maintenance needs allowance is the lesser of $1,500 or 122 percent of the monthly federal poverty guideline for a family of two plus an excess shelter allowance. The excess shelter allowance is for the amount of shelter expenses that exceed 30 percent of 122 percent of the federal poverty guideline for a family of two. Shelter expenses are the community spouse's expenses for rent, mortgage payments including principal and interest, taxes, insurance, required maintenance charges for a cooperative or condominium that is the community spouse's principal residence, and the standard utility allowance under section 5 of the federal Food and Nutrition Act of 2008. If the community spouse has a required maintenance charge for a cooperative or condominium, the standard utility allowance must be reduced by the amount of utility expenses included in the required maintenance charge.\nIf the community or institutionalized spouse establishes that the community spouse needs income greater than the monthly maintenance needs allowance determined in this paragraph due to exceptional circumstances resulting in significant financial duress, the monthly maintenance needs allowance may be increased to an amount that provides needed additional income.\n(d) The percentage of the federal poverty guideline used to determine the monthly maintenance needs allowance in paragraph (c) is increased to 133 percent on July 1, 1991, and to 150 percent on July 1, 1992. Adjustments in the income limits due to annual changes in the federal poverty guidelines shall be implemented the first day of July following publication of the annual changes. The $1,500 maximum must be adjusted January 1, 1990, and every January 1 after that by the same percentage increase in the Consumer Price Index for all urban consumers (all items; United States city average) between the two previous Septembers.\n(e) If a court has entered an order against an institutionalized spouse for monthly income for support of the community spouse, the community spouse's monthly income allowance under this subdivision shall not be less than the amount of the monthly income ordered.\n(a) A family allowance determined under paragraph (b) is not considered available to the institutionalized spouse for monthly payment of costs of care in the institution.\n(b) The family allowance is equal to one-third of the amount by which 122 percent of the monthly federal poverty guideline for a family of two exceeds the monthly income for that family member.\n(c) For purposes of this subdivision, the term family member only includes a minor or dependent child as defined in the Internal Revenue Code, dependent parent, or dependent sibling of the institutionalized or community spouse if the sibling resides with the community spouse.\n(d) The percentage of the federal poverty guideline used to determine the family allowance in paragraph (b) is increased to 133 percent on July 1, 1991, and to 150 percent on July 1, 1992. Adjustments in the income limits due to annual changes in the federal poverty guidelines shall be implemented the first day of July following publication of the annual changes.\n(a) No income of the community spouse will be considered available to an eligible institutionalized spouse, beginning the first full calendar month of institutionalization, except as provided in this subdivision.\n(b) In determining the income of an institutionalized spouse or community spouse, after the institutionalized spouse has been determined eligible for medical assistance, the following rules apply.\n(1) For income that is not from a trust, availability is determined according to items (i) to (v), unless the instrument providing the income otherwise specifically provides:\n(i) if payment is made solely in the name of one spouse, the income is considered available only to that spouse;\n(ii) if payment is made in the names of both spouses, one-half of the income is considered available to each;\n(iii) if payment is made in the names of one or both spouses together with one or more other persons, the income is considered available to each spouse according to the spouse's interest, or one-half of the joint interest is considered available to each spouse if each spouse's interest is not specified;\n(iv) if there is no instrument that establishes ownership, one-half of the income is considered available to each spouse; and\n(v) either spouse may rebut the determination of availability of income by showing by a preponderance of the evidence that ownership interests are different than provided above.\n(2) For income from a trust, income is considered available to each spouse as provided in the trust. If the trust does not specify an amount available to either or both spouses, availability will be determined according to items (i) to (iii):\n(i) if payment of income is made only to one spouse, the income is considered available only to that spouse;\n(ii) if payment of income is made to both spouses, one-half is considered available to each; and\n(iii) if payment is made to either or both spouses and one or more other persons, the income is considered available to each spouse in proportion to each spouse's interest, or if no such interest is specified, one-half of the joint interest is considered available to each spouse.",
	"repealed": false
}