{
	"id": "256L.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.04",
	"title": "256L.04 ELIGIBLE PERSONS.",
	"text": "Families with children with family income above 133 percent of the federal poverty guidelines and equal to or less than 200 percent of the federal poverty guidelines for the applicable family size shall be eligible for MinnesotaCare according to this section. All other provisions of sections 256L.01 to 256L.18 shall apply unless otherwise specified. Children under age 19 with family income at or below 200 percent of the federal poverty guidelines and who are ineligible for medical assistance by sole reason of the application of federal household composition rules for medical assistance are eligible for MinnesotaCare.\nIndividuals and families applying for MinnesotaCare coverage must provide a Social Security number if required by Code of Federal Regulations, title 45, section 155.310 (a)(3).\n[Repealed, 2013 c 108 art 1 s 68]\nTo be eligible for MinnesotaCare, a person must meet the eligibility requirements of this section. A person eligible for MinnesotaCare shall not be considered a qualified individual under section 1312 of the Affordable Care Act, and is not eligible for enrollment in a qualified health plan offered through MNsure under chapter 62V.\nIndividuals and families may cooperate with the state agency to identify potentially liable third-party payers and assist the state in obtaining third-party payments. \"Cooperation\" includes, but is not limited to, complying with the notice requirements in section 256B.056, subdivision 9, identifying any third party who may be liable for care and services provided under MinnesotaCare to the enrollee, providing relevant information to assist the state in pursuing a potentially liable third party, and completing forms necessary to recover third-party payments.\n[Repealed, 2016 c 189 art 19 s 31]\n[Repealed, 1998 c 407 art 5 s 48]\n[Repealed, 1998 c 407 art 5 s 48]\n[Repealed, 1998 c 407 art 5 s 48]\n[Repealed, 1998 c 407 art 5 s 48]\nThe definition of eligible persons includes all individuals and families with no children who have incomes that are above 133 percent and equal to or less than 200 percent of the federal poverty guidelines for the applicable family size.\nAdults whose income is greater than the limits established under this section may not enroll in the MinnesotaCare program.\nThe commissioner shall adjust the income limits under this section annually on January 1 as provided in Code of Federal Regulations, title 26, section 1.36B-1(h).\n[Repealed, 2016 c 189 art 19 s 31]\n[Repealed, 2013 c 107 art 4 s 22; 2013 c 108 art 1 s 68]\n(a) Eligibility for MinnesotaCare is available to citizens or nationals of the United States; lawfully present noncitizens as defined in Code of Federal Regulations, title 45, section 155.20; and undocumented noncitizens. For purposes of this subdivision, an undocumented noncitizen is an individual who resides in the United States without the approval or acquiescence of the United States Citizenship and Immigration Services. Families with children who are citizens or nationals of the United States must cooperate in obtaining satisfactory documentary evidence of citizenship or nationality according to the requirements of the federal Deficit Reduction Act of 2005, Public Law 109-171.\n(b) Notwithstanding subdivisions 1 and 7, eligible persons include families and individuals who are ineligible for medical assistance by reason of immigration status and who have incomes equal to or less than 200 percent of federal poverty guidelines, except that these persons may be eligible for emergency medical assistance under section 256B.06, subdivision 4.\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 1Sp2005 c 4 art 8 s 88]\nAn applicant or enrollee residing in a correctional or detention facility is not eligible for MinnesotaCare, unless the applicant or enrollee is awaiting disposition of charges.\nMS 2018 [Repealed, 2020 c 115 art 3 s 40]\n(a) Individuals eligible for medical assistance under chapter 256B are not eligible for MinnesotaCare under this section.\n(b) The commissioner shall coordinate eligibility and coverage to ensure that individuals transitioning between medical assistance and MinnesotaCare have seamless eligibility and access to health care services.",
	"repealed": false
}