{
	"id": "162.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.02",
	"title": "162.02 COUNTY STATE-AID HIGHWAY SYSTEM.",
	"text": "There is created a county state-aid highway system which must be established, located, constructed, reconstructed, improved, and maintained as public highways by the counties under rules not inconsistent with this section made and promulgated by the commissioner as provided in this chapter. The counties are vested with the rights, title, easements, and their appurtenances, held by or vested in any of the towns or municipal subdivisions or dedicated to the public use prior to the time a road or portion of a road is taken over by the county as a county state-aid highway.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23; 2014 c 286 art 4 s 2]\nMS 2012 [Repealed, 2014 c 286 art 4 s 2]\n(a) The commissioner may grant variances from the rules and from the engineering standards developed pursuant to section 162.021 or 162.07, subdivision 2. A political subdivision in which a county state-aid highway is located or is proposed to be located may submit a written request to the commissioner for a variance for that highway. The commissioner shall comply with section 174.75, subdivision 5, in evaluating a variance request related to a complete streets project.\n(b) The commissioner may grant or deny the variance within 30 days of receiving the variance request. If the variance is denied, the political subdivision may request, within 30 days of receiving notice of denial, and shall be granted a contested case hearing.\n(c) For purposes of this subdivision, \"political subdivision\" includes (1) an agency of a political subdivision which has jurisdiction over parks, and (2) a regional park authority.\nWhen reviewing data and information for the development of safety improvements for trunk highways and state-aid projects, the commissioner of transportation may consider, among other things, the Insurance Institute for Highway Safety's findings in addition to standards contained in Department of Transportation manuals, American Association of State Highway and Transportation Officials manual on design of highways and streets, and other applicable federal publications.\nThe county boards of the several counties shall by resolution and subject to the concurrence of the commissioner locate and establish a system of county state-aid highways in accordance with the rules made and promulgated by the commissioner. It shall be the duty of the commissioner to review each system considering the availability of funds and the desirability of each system in relation to an integrated and coordinated system of highways. After review the commissioner shall by written order approve each system or any part thereof which in the commissioner's judgment is feasible and desirable. A certified copy of the order shall be filed with the county engineer.\nThe county state-aid highway system must not include a segment of a county highway that is designated as a pedestrian mall under chapter 430.\nThe several county boards shall have power to acquire by purchase, gift, or condemnation in accordance with the provisions of chapter 117, and acts supplemental thereto, lands and properties necessary for the establishment, location, relocation, construction, reconstruction, improvement, and maintenance of the county state-aid highway system or as in section 163.12, subdivisions 1 to 10 inclusive.\nThe system shall include all roads and extensions thereof which were designated on June 30, 1957, as state-aid roads, and which were on June 30, 1957, under the jurisdiction of the counties, and shall include all roads which were designated on June 30, 1957, as state-aid parkways; provided, that with the consent and approval of the commissioner, any roads made a part of the county state-aid highway system by the provision of this subdivision may be abandoned, changed, or revoked by the county board having jurisdiction over such roads.\nThe county board of any county may establish and locate any county state-aid highway on new location where there is no existing road, or it may establish and locate the highway upon or over any established road or street or a specified portion thereof within its limits. Except as provided in subdivision 8a, no county state-aid highway shall be established or located within the corporate limits of any city without the approval of the governing body of the city, except that when a county state-aid highway is relocated the approval of the plans by the governing body shall be deemed to be a transfer of the previous location of the highway to the jurisdiction of the city. The approval shall be in the manner and form required by the commissioner.\nNotwithstanding Laws 1997, chapter 238, section 3, a county must follow the procedures established in this chapter for the establishment and designation of a county state-aid highway.\nExcept as provided in subdivision 8a, no portion of the county state-aid highway system lying within the corporate limits of any city shall be constructed, reconstructed, or improved nor the grade thereof changed without the prior approval of the plans by the governing body of such city and the approval shall be in the manner and form required by the commissioner.\nIf a city has failed to approve establishment, construction, reconstruction, or improvement of a county state-aid highway within its corporate limits under subdivision 7 or 8, the county board may, by resolution, request the commissioner to appoint a dispute resolution board consisting of one county commissioner, one county engineer, one city council member or city mayor, one city engineer, and one representative of the Department of Transportation. The board shall review the proposed change and make a recommendation to the commissioner. Notwithstanding any other law, the commissioner may approve the establishment, construction, reconstruction, or improvement of a county state-aid highway recommended by the board.\nWhen it shall be made to appear to the commissioner that the county board of any county has refused to locate and establish a county state-aid highway which in the opinion of the commissioner is necessary to provide an integrated and coordinated highway system, the commissioner may, until the county state-aid highway is located and established, withhold from the county so much of the county's share of the county state-aid highway fund as the commissioner deems advisable.\nCounty state-aid highways may be abandoned, changed, or revoked by joint action of the county board and the commissioner. If a county state-aid highway is established or located within the limits of a city, it shall not be abandoned, changed, or revoked without the concurrence of the governing body of such city; provided, that any county state-aid highway established or located within a city may be abandoned, or revoked without concurrence if the city refuses or neglects for a period of one year after submittal to approve plans for the construction of such highway which plans conform to the construction standards provided in the commissioner's rules.\nThe county state-aid highway system is hereby increased in extent by the addition thereto of the mileage of all trunk highways reverted or turned back to the jurisdiction of the counties pursuant to law on and after July 1, 1965.\nFormer municipal state-aid streets located in a city that previously received money from the municipal state-aid street fund but whose population fell below 5,000 under the 1980 or 1990 federal census must be included in the county state-aid highway system, subject to the approval of the governing bodies of the city and the county. An action taken by a county board approving the inclusion of a former municipal state-aid street in the county state-aid highway system must also include a resolution taking over the street as a county highway under section 163.11. The county state-aid highway system is increased in extent by the addition of the mileage of municipal state-aid streets reverting or turned over to the jurisdiction of the counties under this subdivision.",
	"repealed": false
}