{
	"id": "504B.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.181",
	"title": "504B.181 LANDLORD OR AGENT DISCLOSURE.",
	"text": "There shall be disclosed to the residential tenant either in the rental agreement or otherwise in writing prior to commencement of the tenancy the name and address of:\n(1) the person authorized to manage the premises; and\n(2) the landlord of the premises or an agent authorized by the landlord to accept service of process and receive and give receipt for notices and demands.\n(a) A printed or typewritten notice containing the information which must be disclosed under subdivision 1 shall be placed in a conspicuous place on the premises. This subdivision is complied with if notices posted in compliance with other statutes or ordinances contain the information required by this section.\n(b) Unless the landlord is required to post a notice by section 471.9995, the landlord shall also place a notice in a conspicuous place on the property that states that a copy of the statement required by section 504B.275 is available from the attorney general to any residential tenant upon request.\nIf subdivisions 1 and 2 have not been complied with and a person desiring to make service of process upon or give a notice or demand to the landlord does not know the name and address of the landlord or the landlord's agent, as that term is used in subdivision 1, then a caretaker or manager of the premises or an individual to whom rental payments for the premises are made shall be deemed to be an agent authorized to accept service of process and receive and give receipt for notices and demands on behalf of the landlord. In case of service of process upon or receipt of notice or demand by a person who is deemed to be an agent pursuant to this subdivision, this person shall give the process, notice, or demand, or a copy thereof, to the landlord personally or shall send it by certified mail, return receipt requested, to the landlord at the landlord's last known address.\nExcept as otherwise provided in this subdivision, no action to recover rent or possession of the premises shall be maintained unless the information required by this section has been disclosed to the tenant in the manner provided in this section, or unless the information required by this section is known by or has been disclosed to the tenant at least 30 days prior to the initiation of such action. Failure by the landlord to post a notice required by subdivision 2, paragraph (b), or section 471.9995 shall not prevent any action to recover rent or possession of the premises.\nAny residential tenant who moves from or subleases the premises without giving the landlord at least 30 days written notice shall void any provision of this section as to that tenant.\nThis section extends to and is enforceable against any successor landlord or individual to whom rental payments for the premises are made.",
	"repealed": false
}