{
	"id": "473H.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.10",
	"title": "473H.10 AD VALOREM PROPERTY TAXES.",
	"text": "Real property within an agricultural preserve shall be valued and assessed pursuant to chapter 273, except as provided in this section.\nAll land classified agricultural and in agricultural use, exclusive of buildings, shall be valued solely with reference to its appropriate agricultural classification and value, notwithstanding sections 272.03, subdivision 8, and 273.11. In determining the value for ad valorem tax purposes the assessor shall not consider any added values resulting from nonagricultural factors.\n(a) After having determined the market value of all land valued according to subdivision 2, the assessor shall compute the net tax capacity of those properties by applying the appropriate classification rates. When computing the rate of tax pursuant to section 275.08, the county auditor shall include the net tax capacity of land as provided in this paragraph.\n(b) The county auditor shall compute the tax on lands valued according to subdivision 2 and nonresidential buildings by multiplying the net tax capacity times the total local tax rate for all purposes as provided in paragraph (a).\n(c) The county auditor shall then compute the tax on lands valued according to subdivision 2 and nonresidential buildings by multiplying the net tax capacity times the total local tax rate for all purposes as provided in paragraph (a), subtracting $1.50 per acre of land in the preserve.\n(d) The county auditor shall then compute the maximum ad valorem property tax on lands valued according to subdivision 2 and nonresidential buildings by multiplying the net tax capacity times 105 percent of the previous year's statewide average local tax rate levied on property located within townships for all purposes.\n(e) The tax due and payable by the owner of preserve land valued according to subdivision 2 and nonresidential buildings will be the amount determined in paragraph (c) or (d), whichever is less. The state shall reimburse the taxing jurisdictions for the amount of the difference between the net tax determined under this paragraph and the gross tax in paragraph (b). Residential buildings shall continue to be valued and classified according to the provisions of sections 273.11 and 273.13, as they would be in the absence of this section, and the tax on those buildings shall not be subject to the limitation contained in this paragraph.\nThe county may transfer money from the county conservation account created in section 40A.152 to the county revenue fund to reimburse the fund for the tax lost as a result of this subdivision or to pay taxing jurisdictions within the county for the tax lost. The county auditor shall certify to the commissioner of revenue on or before June 1 the total amount of tax lost to the county and taxing jurisdictions located within the county as a result of this subdivision and the extent that the tax lost exceeds funds available in the county conservation account. Payment shall be made by the state on December 26 to each of the affected taxing jurisdictions, other than school districts, in the same proportion that the ad valorem tax is distributed if the county conservation account is insufficient to make the reimbursement. There is annually appropriated from the Minnesota conservation fund under section 40A.151 to the commissioner of revenue an amount sufficient to make the reimbursement provided in this subdivision. If the amount available in the Minnesota conservation fund is insufficient, the balance that is needed is appropriated from the general fund.",
	"repealed": false
}