{
	"id": "626A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.01",
	"title": "626A.01 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the meanings given them.\n\"Person\" means any individual, partnership, corporation, joint stock company, trust, or association, including but not limited to, the subscriber to the telephone or telegraph service involved and any law enforcement officer.\n\"Wire communication\" means any aural transfer made in whole or in part through the use of facilities for the transmission of communications by the aid of wire, cable, or other like connection between the point of origin and the point of reception, including the use of such connection in a switching station. \"Wire communication\" includes any electronic storage of the communication.\n\"Oral communication\" means any oral communication uttered by a person exhibiting an expectation that such communication is not subject to interception under circumstances justifying such expectation, but the term does not include any electronic communication.\n\"Intercept\" means the aural or other acquisition of the contents of any wire, electronic, or oral communication through the use of any electronic, mechanical, or other device.\n\"Electronic, mechanical, or other device\" means any device or apparatus which can be used to intercept a wire, electronic, or oral communication other than:\n(1) any telephone or telegraph instrument, equipment or facility, or any component thereof, (i) furnished to the subscriber or user by a provider or wire or electronic communications service in the ordinary course of its business and being used by the subscriber or user in the ordinary course of its business or furnished by a subscriber or user for connection to the facilities of service and used in the ordinary course of its business; or (ii) being used by a communications common carrier in the ordinary course of its business, or by an investigative or law enforcement officer in the ordinary course of duties;\n(2) a hearing aid or similar device being used to correct subnormal hearing to not better than normal;\n(3) that which is specifically designed to only record conversations to which the operator of the device is a party;\n(4) that which is used in the normal course of broadcasting by radio or television; or\n(5) that which is otherwise commonly used for a purpose or purposes other than overhearing or recording conversations.\nIn determining whether a device which is alleged to be an electronic, mechanical, or other device is, in fact, such a device there shall be taken into account, among other things, the size, appearance, directivity, range, sensitivity, frequency, power, or intensity, and the representations of the maker or manufacturer as to its performance and use.\n\"Investigative or law enforcement officer\" means any officer of the United States or of a state or political subdivision thereof, or a University of Minnesota peace officer who is empowered by law to conduct investigations of or to make arrests for offenses enumerated in this chapter, or any attorney authorized by law to prosecute or participate in the prosecution of such offenses.\n\"Contents,\" when used with respect to any wire, electronic, or oral communication, includes any information concerning the substance, purport, or meaning of that communication.\n\"Aggrieved person\" means a person who was a party to any intercepted wire, electronic, or oral communication or a person against whom the interception was directed.\n\"Manufacturer\" means any person who is engaged in the business of manufacturing electronic, mechanical or other devices, or who otherwise produces any such device for sale or distribution.\n\"Dealer\" means any person not a manufacturer who is engaged in the business of selling electronic, mechanical or other devices. The term \"dealer\" shall include wholesalers, retailers and dealers in used intercepting devices.\n\"Bureau\" means the Bureau of Criminal Apprehension.\n\"Communications common carrier\" means any individual, partnership, corporation, or association which provides telephone or telegraph service to subscribers or users pursuant to tariffs on file with the Minnesota Public Utilities Commission or the Federal Communications Commission.\n\"Electronic communication\" means transfer of signs, signals, writing, images, sounds, data, or intelligence of any nature transmitted in whole or in part by a wire, radio, electromagnetic, photoelectronic, or photooptical system but does not include:\n(1) a wire or oral communication;\n(2) a communication made through a tone-only paging device; or\n(3) a communication from a tracking device, defined as an electronic or mechanical device which permits the tracking of the movement of a person or object.\n\"User\" means a person or entity who:\n(1) uses an electronic communication service; and\n(2) is duly authorized by the provider of the service to engage in the use.\n\"Electronic communications system\" means a wire, radio, electromagnetic, photooptical, or photoelectronic facility for the transmission of electronic communications, and a computer facility or related electronic equipment for the electronic storage of communications.\n\"Electronic communication service\" means a service that provides to users of the service the ability to send or receive wire or electronic communications.\n\"Readily accessible to the general public\" means, with respect to a radio communication, that the communication is not:\n(1) scrambled or encrypted;\n(2) transmitted using modulation techniques whose essential parameters have been withheld from the public with the intention of preserving the privacy of the communication;\n(3) carried on a subcarrier or other signal subsidiary to a radio transmission;\n(4) transmitted over a communication system provided by a common carrier, unless the communication is a tone-only paging system communication; or\n(5) transmitted on frequencies allocated under part 25, subpart D, E, or F of part 74, or part 94 of title 47 of the Code of Federal Regulations, unless in the case of a communication transmitted on a frequency allocated under part 74 of title 47 of the Code of Federal Regulations that is not exclusively allocated to broadcast auxiliary services, the communication is a two-way voice communication by radio.\n\"Electronic storage\" means:\n(1) a temporary, intermediate storage of a wire or electronic communication incidental to the electronic transmission of the communication; and\n(2) a storage of communication described in clause (1) by an electronic communication service for purposes of backup protection of the communication.\n\"Aural transfer\" means a transfer containing the human voice at any point between and including the point of origin and the point of reception.",
	"repealed": false
}