{
	"id": "116J.391",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.391",
	"title": "116J.391 COORDINATION OF BROADBAND INFRASTRUCTURE DEVELOPMENT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Broadband\" or \"broadband service\" has the meaning given in section 116J.39, subdivision 1, paragraph (b).\n(c) \"Broadband conduit\" means a conduit, pipe, innerduct, or microduct for fiber optic or other cables that support broadband and wireless facilities for broadband service.\n(d) \"Local unit of government\" has the meaning given in section 116G.03, subdivision 3.\n(e) \"Office\" means the Office of Broadband Development established in section 116J.39.\n(a) The office shall, in collaboration with the Department of Transportation and private entities, encourage and coordinate \"dig once\" efforts for the planning, relocation, installation, or improvement of broadband conduit within the right-of-way in conjunction with any current or planned construction, including, but not limited to, trunk highways and bridges. To the extent necessary, the office shall, in collaboration with the Department of Transportation, evaluate engineering and design standards, procedures and criteria for contracts or lease agreements with private entities, and pricing requirements, and provide for allocation of risk, costs, and any revenue generated.\n(b) The office shall, in collaboration with other state departments and agencies as the office deems necessary, develop a strategy to facilitate the timely and efficient deployment of broadband conduit or other broadband facilities on state-owned lands and buildings.\n(c) To the extent practicable, the office shall encourage and assist local units of government to adopt and implement policies similar to those under paragraphs (a) and (b) for construction or other improvements to county state-aid highways, municipal state-aid roads, and any other rights-of-way under the local unit of government's jurisdiction, and to other lands or buildings owned by the local unit of government.\n(d) Special consideration must be paid to projects under this subdivision that will likely improve access to broadband by rural or underserved communities.\nAs part of its annual report under section 116J.39, subdivision 5, the office shall report on activities taken under this section, including, but not limited to, the number of current and planned projects using the \"dig once\" approach, any gains in broadband speed or access associated with the project, and any costs or cost savings to the state, private entity, or end user of broadband services.\nNothing in this section shall be construed to create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the state of Minnesota; its departments, agencies, or entities; its officers, employees, or agents; or any other person.",
	"repealed": false
}