{
	"id": "317A.811",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.811",
	"title": "317A.811 NOTICE TO ATTORNEY GENERAL; WAITING PERIOD.",
	"text": "(a) Except as provided in subdivision 6, the following corporations shall notify the attorney general of their intent to dissolve, merge, consolidate, or convert, or to transfer all or substantially all of their assets:\n(1) a corporation that holds assets for a charitable purpose as defined in section 501B.35, subdivision 2;\n(2) a corporation that is exempt under section 501(c)(3) of the Internal Revenue Code of 1986, or any successor section; or\n(3) effective July 1, 2025, a nonprofit health coverage entity as defined in section 145D.30.\n(b) The notice must include:\n(1) the purpose of the corporation that is giving the notice;\n(2) a list of assets owned or held by the corporation for charitable purposes;\n(3) a description of restricted assets and purposes for which the assets were received;\n(4) a description of debts, obligations, and liabilities of the corporation;\n(5) a description of tangible assets being converted to cash and the manner in which they will be sold;\n(6) anticipated expenses of the transaction, including attorney fees;\n(7) a list of persons to whom assets will be transferred, if known, or the name of the converted organization;\n(8) the purposes of persons receiving the assets or of the converted organization; and\n(9) the terms, conditions, or restrictions, if any, to be imposed on the transferred or converted assets.\nThe notice must be signed on behalf of the corporation by an authorized person.\nSubject to subdivision 3, a corporation described in subdivision 1 may not transfer or convey assets as part of a dissolution, merger, consolidation, or transfer of assets under section 317A.661, and it may not convert until 45 days after it has given written notice to the attorney general, unless the attorney general waives all or part of the waiting period.\nThe attorney general may extend the waiting period under subdivision 2 for one additional 30-day period by notifying the corporation in writing of the extension. The attorney general shall notify the secretary of state if the waiting period is extended.\nWhen all or substantially all of the assets of a corporation described in subdivision 1 have been transferred or conveyed following expiration or waiver of the waiting period, the board shall deliver to the attorney general a list of persons to whom the assets were transferred or conveyed. The list must include the addresses of each person who received assets and show what assets the person received.\nFailure of the attorney general to take an action with respect to a transaction under this section does not constitute approval of the transaction and does not prevent the attorney general from taking other action.\nSubdivisions 1 to 4 do not apply to a merger with, consolidation into, conversion into, or transfer of assets to an organization exempt under section 501(c)(3) of the Internal Revenue Code of 1986, or any successor section. A corporation that is exempt under this subdivision shall send a copy of the certificate of merger, certificate of consolidation and incorporation, or certificate of conversion to the attorney general.",
	"repealed": false
}