{
	"id": "216B.029",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.029",
	"title": "216B.029 STANDARDS FOR DISTRIBUTION UTILITIES.",
	"text": "(a) The commission and each cooperative electric association and municipal utility shall adopt standards for safety, reliability, and service quality for distribution utilities. Standards for cooperative electric associations and municipal utilities should be as consistent as possible with the commission standards.\n(b) Reliability standards must be based on the system average interruption frequency index, system average interruption duration index, and customer average interruption duration index measurement indices. Service quality standards must specify, if technically and administratively feasible:\n(1) average call center response time;\n(2) customer disconnection rate;\n(3) meter-reading frequency;\n(4) complaint resolution response time;\n(5) service extension request response time;\n(6) recording of service and circuit interrupter data;\n(7) summary reporting;\n(8) historical reliability performance reporting;\n(9) notices of interruptions of bulk power supply facilities and other interruptions of power; and\n(10) customer complaints.\n(c) Minimum performance standards developed under this section must treat similarly situated distribution systems similarly and recognize differing characteristics of system design and hardware.\n(d) Electric distribution utilities shall comply with all applicable governmental and industry standards required for the safety, design, construction, and operation of electric distribution facilities, including section 326B.35.\nFor the purpose of this section, the terms defined in this subdivision have the meanings given them.\n(a) The \"system average interruption frequency index\" is the average number of interruptions per customer per year. It is determined by dividing the total annual number of customer interruptions by the average number of customers served during the year.\n(b) The \"system average interruption duration index\" is the average customer-minutes of interruption per customer. It is determined by dividing the annual sum of customer-minutes of interruption by the average number of customers served during the year.\n(c) The \"customer average interruption duration index\" is the average customer-minutes of interruption per customer interruption. It approximates the average length of time required to complete service restoration. It is determined by dividing the annual sum of all customer-minutes of interruption durations by the annual number of customer interruptions.",
	"repealed": false
}