{
	"id": "609.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.66",
	"title": "609.66 DANGEROUS WEAPONS.",
	"text": "(a) Whoever does any of the following is guilty of a crime and may be sentenced as provided in paragraph (b):\n(1) recklessly handles or uses a gun or other dangerous weapon or explosive so as to endanger the safety of another; or\n(2) intentionally points a gun of any kind, capable of injuring or killing a human being and whether loaded or unloaded, at or toward another; or\n(3) manufactures or sells for any unlawful purpose any weapon known as a slungshot or sand club; or\n(4) manufactures, transfers, or possesses metal knuckles or a switch blade knife opening automatically; or\n(5) possesses any other dangerous article or substance for the purpose of being used unlawfully as a weapon against another; or\n(6) outside of a municipality and without the parent's or guardian's consent, furnishes a child under 14 years of age, or as a parent or guardian permits the child to handle or use, outside of the parent's or guardian's presence, a firearm or airgun of any kind, or any ammunition or explosive.\nPossession of written evidence of prior consent signed by the minor's parent or guardian is a complete defense to a charge under clause (6).\n(b) A person convicted under paragraph (a) may be sentenced as follows:\n(1) if the act was committed in a public housing zone, as defined in section 152.01, subdivision 19, a school zone, as defined in section 152.01, subdivision 14a, or a park zone, as defined in section 152.01, subdivision 12a, to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both; or\n(2) otherwise, including where the act was committed on residential premises within a zone described in clause (1) if the offender was at the time an owner, tenant, or invitee for a lawful purpose with respect to those residential premises, to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both.\n(a) Whoever does any of the following is guilty of a felony and may be sentenced as provided in paragraph (b):\n(1) sells or has in possession a suppressor that is not lawfully possessed under federal law;\n(2) intentionally discharges a firearm under circumstances that endanger the safety of another; or\n(3) recklessly discharges a firearm within a municipality.\n(b) A person convicted under paragraph (a) may be sentenced as follows:\n(1) if the act was a violation of paragraph (a), clause (2), or if the act was a violation of paragraph (a), clause (1) or (3), and was committed in a public housing zone, as defined in section 152.01, subdivision 19, a school zone, as defined in section 152.01, subdivision 14a, or a park zone, as defined in section 152.01, subdivision 12a, to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both; or\n(2) otherwise, to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both.\n(c) As used in this subdivision, \"suppressor\" means any device for silencing, muffling, or diminishing the report of a portable firearm, including any combination of parts, designed or redesigned, and intended for use in assembling or fabricating a firearm silencer or firearm muffler, and any part intended only for use in such assembly or fabrication.\nWhoever, in any municipality of this state, furnishes a minor under 18 years of age with a firearm, airgun, ammunition, or explosive without the prior consent of the minor's parent or guardian or of the police department of the municipality is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both. Possession of written evidence of prior consent signed by the minor's parent or guardian is a complete defense to a charge under this subdivision.\nWhoever recklessly furnishes a person with a dangerous weapon in conscious disregard of a known substantial risk that the object will be possessed or used in furtherance of a felony crime of violence is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(a) Except as provided under paragraphs (d) and (f), whoever possesses, stores, or keeps a dangerous weapon while knowingly on school property is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) Whoever uses or brandishes a replica firearm or a BB gun while knowingly on school property is guilty of a gross misdemeanor.\n(c) Whoever possesses, stores, or keeps a replica firearm or a BB gun while knowingly on school property is guilty of a misdemeanor.\n(d) Notwithstanding paragraph (a), (b), or (c), it is a misdemeanor for a person authorized to carry a firearm under the provisions of a permit or otherwise to carry a firearm on or about the person's clothes or person in a location the person knows is school property. Notwithstanding section 609.531, a firearm carried in violation of this paragraph is not subject to forfeiture.\n(e) As used in this subdivision:\n(1) \"BB gun\" means a device that fires or ejects a shot measuring .18 of an inch or less in diameter;\n(2) \"dangerous weapon\" has the meaning given it in section 609.02, subdivision 6;\n(3) \"replica firearm\" has the meaning given it in section 609.713; and\n(4) \"school property\" means:\n(i) a public or private elementary, middle, or secondary school building and its improved grounds, whether leased or owned by the school;\n(ii) a child care center licensed under chapter 142B during the period children are present and participating in a child care program;\n(iii) the area within a school bus when that bus is being used by a school to transport one or more elementary, middle, or secondary school students to and from school-related activities, including curricular, cocurricular, noncurricular, extracurricular, and supplementary activities; and\n(iv) that portion of a building or facility under the temporary, exclusive control of a public or private school, a school district, or an association of such entities where conspicuous signs are prominently posted at each entrance that give actual notice to persons of the school-related use.\n(f) This subdivision does not apply to:\n(1) active licensed peace officers;\n(2) military personnel or students participating in military training, who are on-duty, performing official duties;\n(3) persons authorized to carry a pistol under section 624.714 while in a motor vehicle or outside of a motor vehicle to directly place a firearm in, or retrieve it from, the trunk or rear area of the vehicle;\n(4) persons who keep or store in a motor vehicle pistols in accordance with section 624.714 or 624.715 or other firearms in accordance with section 97B.045;\n(5) firearm safety or marksmanship courses or activities conducted on school property;\n(6) possession of dangerous weapons, BB guns, or replica firearms by a ceremonial color guard;\n(7) a gun or knife show held on school property;\n(8) possession of dangerous weapons, BB guns, or replica firearms with written permission of the principal or other person having general control and supervision of the school or the director of a child care center; or\n(9) persons who are on unimproved property owned or leased by a child care center, school, or school district unless the person knows that a student is currently present on the land for a school-related activity.\n(g) Notwithstanding section 471.634, a school district or other entity composed exclusively of school districts may not regulate firearms, ammunition, or their respective components, when possessed or carried by nonstudents or nonemployees, in a manner that is inconsistent with this subdivision.\n(a) A person is guilty of a felony who, while in or having just exited from a motor vehicle, recklessly discharges a firearm at or toward:\n(1) an unoccupied motor vehicle or building;\n(2) an occupied motor vehicle or building; or\n(3) a person.\n(b) A person convicted under paragraph (a), clause (1), may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $6,000, or both. A person convicted under paragraph (a), clause (2) or (3), may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(c) For purposes of this subdivision, \"motor vehicle\" has the meaning given in section 609.52, subdivision 1, and \"building\" has the meaning given in section 609.581, subdivision 2.\nA person, other than a federally licensed firearms dealer, who transfers a pistol or semiautomatic military-style assault weapon to another without complying with the transfer requirements of section 624.7132, is guilty of a gross misdemeanor if the transferee possesses or uses the weapon within one year after the transfer in furtherance of a felony crime of violence, and if:\n(1) the transferee was prohibited from possessing the weapon under section 624.713 at the time of the transfer; or\n(2) it was reasonably foreseeable at the time of the transfer that the transferee was likely to use or possess the weapon in furtherance of a felony crime of violence.\n(a) A person who commits either of the following acts is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both:\n(1) possesses a dangerous weapon, ammunition, or explosives within any courthouse complex; or\n(2) possesses a dangerous weapon, ammunition, or explosives in any state building within the Capitol Area described in chapter 15B, other than the National Guard Armory.\n(b) Unless a person is otherwise prohibited or restricted by other law to possess a dangerous weapon, this subdivision does not apply to:\n(1) licensed peace officers or military personnel who are performing official duties;\n(2) persons who carry pistols according to the terms of a permit issued under section 624.714 and who so notify the sheriff or the commissioner of public safety, as appropriate;\n(3) persons who possess dangerous weapons for the purpose of display as demonstrative evidence during testimony at a trial or hearing or exhibition in compliance with advance notice and safety guidelines set by the sheriff or the commissioner of public safety; or\n(4) persons who possess dangerous weapons in a courthouse complex with the express consent of the county sheriff or who possess dangerous weapons in a state building with the express consent of the commissioner of public safety.\n(c) For purposes of this subdivision, the issuance of a permit to carry under section 624.714 constitutes notification of the commissioner of public safety as required under paragraph (b), clause (2).\n[Repealed, 2015 c 65 art 3 s 38]\nNothing in this section prohibits the possession of the articles mentioned by museums or collectors of art or for other lawful purposes of public exhibition.",
	"repealed": false
}