{
	"id": "284.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/284.28",
	"title": "284.28 TAX-FORFEITED LANDS; LIMITATIONS ON ADVERSE CLAIMS.",
	"text": "(a) The title of the state, or its successors in interest, to land forfeited for delinquent taxes shall not be held invalid in any action or proceeding by reason of any failure, omission, error or defect in the proceedings respecting the taxation of the land or forfeiture thereof, including without limitation:\n(i) substantial or prejudicial defects, including both nonjurisdictional and jurisdictional defects, in the tax forfeiture proceedings;\n(ii) cases where the land was exempt from taxation;\n(iii) cases where the taxes upon which the alleged forfeiture was based were in fact paid prior to forfeiture; and\n(iv) prejudice to the interests of persons under disability referred to in subdivision 4, except within the limitation periods provided in this section. It is the policy of the state of Minnesota that except as otherwise provided in this section the failures, omissions, errors or defects shall not fetter the marketability of real estate.\n(b) All provisions of law related to the title of the state or its successors in interest, shall be liberally construed in favor of the state, its officers, agents and its successors in interest. The burden of proving that the title of the state, or its successors in interest, is invalid shall rest upon the party asserting the invalidity.\nExcept as provided in subdivision 5, no cause of action or defense shall be asserted or maintained upon any claim adverse to the state, or its successors in interest, including but not limited to any claim based upon any failure, omission, error, or defect described in subdivision 1, respecting any lands claimed to have been forfeited to the state for taxes, unless such cause of action or defense is asserted in an action commenced within one year after the filing of the county auditor's certificate of forfeiture, as provided by section 281.23, subdivision 9, and acts supplementary thereto, or by any other law hereafter enacted providing for the filing and recording of such certificates.\nExcept as provided in subdivision 5, no cause of action or defense, claiming that any auditor's certificate of sale or state assignment certificate arising from the nonpayment of taxes on a parcel of land is invalid shall be asserted or maintained upon any claim adverse to the holder of the certificate or the holder's successors in interest, or to the state or its successors in interest, including but not limited to any claim based upon any failure, omission, error, or defect described in subdivision 1, respecting any such land, unless such cause of action or defense is asserted in an action commenced within one year after the filing of proof of service of the auditor's notice of expiration of the time for redemption, as provided by section 281.21, and acts supplementary thereto, or by any other law hereafter enacted providing for notice of expiration of time for redemption and the filing thereof.\nExcept as provided in subdivision 5, no person under disability to sue during the one year periods provided by subdivisions 2 and 3 by reason of absence, infancy, mental illness resulting in commitment pursuant to chapter 253B, or any other disability shall have a right to assert any cause of action or defense adverse to the title of the state, or its successors in interest, in any proceeding at law or in equity for opening, vacating, setting aside or invalidating the forfeiture, the auditor's certificate of sale or the state assignment certificate. Persons under the disability to sue shall have the right to commence an action for recovery of damages out of the general fund after the disability is removed in accordance with subdivision 10.\nIn cases where the lands are and ever since the time of filing the auditor's certificate of forfeiture under section 281.23, subdivision 9, or filing of service of notice of expiration of redemption under section 281.21, have been in the actual, open, continuous, and exclusive possession of the owner, or the owner's successors in interest, claiming adversely to the state or its successors in interest, the period of limitations as to such owner, or the owner's successors in interest, shall be\n(i) the time of the possession, or\n(ii) the period of limitations provided in subdivisions 2 and 3, whichever period is greater.\nAny claimant failing to commence an action or assert a defense within the time prescribed by subdivisions 2 and 3 shall be conclusively presumed to have abandoned all right, title, and interest in the lands described in the county auditor's certificate of forfeiture or notice of expiration of redemption, which certificate of forfeiture when filed under section 281.23, subdivision 9, or notice of expiration of redemption when filed under section 281.21, shall constitute notice of the forfeiture of the lands affected to all persons having or claiming an interest therein. If no action or defense is asserted and notice of lis pendens recorded within the time prescribed by subdivisions 2 and 3, a certificate of sale or state assignment certificate recorded with the county recorder has the force and effect of a patent after the expiration of the period prescribed by subdivision 1, subject to the rights of persons described in subdivision 5 and any rights set forth in the certificate of sale or state assignment certificate.\nExcept as provided in subdivision 11, the time prescribed by subdivisions 2 and 3 shall not commence to run until June 15, 1977, as to any county auditor's certificate of forfeiture or notice of expiration of the time for redemption filed prior to June 15, 1977.\nAny claimant who by reason of any material failure, omission, error or defect of any public officer or employee in the performance of the officer's or employee's duties under the laws relating to the taxation of land or forfeiture thereof is unjustly deprived of any land or of any interest therein, may institute an action in the district court to recover compensation for such unjust deprivation out of the general fund provided in subdivision 8.\nAt the time of sale of a parcel of tax-forfeited land, the county auditor shall charge and collect in full an amount equal to three percent of the total sale price of land. Before filing a notice of expiration of time for redemption, in cases where an auditor's certificate of sale or a state assignment certificate has been issued, the county auditor shall charge and collect in full from the holder of the certificate an amount equal to three percent of the appraised value of the property for tax purposes. The amounts so collected by the auditor shall be deposited in the state treasury and credited to the general fund.\nIn determining compensation for the unjust deprivation suffered by the claimant, which may include severance damages sustained if the claimant owns adjoining land, the court shall take into account delinquent taxes, penalties, costs, and interest which would have been due and owing if the claimant had redeemed the land.\nNo claimant shall recover the value of improvements made to the land by other persons or the increment in value of land that occurs after the claimant has actual notice of the forfeiture proceeding. All claims ordered by the district court to be paid shall be obligations of the state and shall be paid out of the general fund from legislative appropriations, the collection of money by county auditors or from any other sources as provided by law.\nThere is appropriated from the general fund to the commissioner of management and budget amounts sufficient to pay the amount by which any claims ordered to be paid under this subdivision.\nIn any action brought to recover loss or damage from the general fund, the commissioner of management and budget, in that official capacity, shall be named as defendant. The attorney general or, at the attorney general's request, the county attorney of the county in which the land or a major part of it lies, shall defend the commissioner of management and budget in all such actions.\nAny action or proceeding pursuant to this section to recover damages shall be commenced within ten years after the expiration of the periods within which claims may be asserted pursuant to subdivisions 2 and 3, and not afterwards. If, within this ten-year period the person entitled to bring such action or proceeding is under legal disability, such person, or anyone claiming under the person, may commence such action or proceeding within the period expiring two years after such disability is removed or within the ten-year period, whichever period is greater.\nLaws 1977, chapter 265 shall not affect any right already barred on June 15, 1977.\nThe period of limitations provided in subdivisions 2 and 3 shall not apply to any action or proceeding pending on June 15, 1977.\nExcept as may be necessary to give effect to the provisions of Laws 1977, chapter 265, this section is supplementary to and not exclusive of other laws dealing with the same subject matter.",
	"repealed": false
}