{
	"id": "58B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.03",
	"title": "58B.03 LICENSING OF STUDENT LOAN SERVICERS.",
	"text": "No person shall directly or indirectly act as a student loan servicer without first obtaining a license from the commissioner.\nThe following persons are exempt from the requirements of this chapter:\n(1) a financial institution;\n(2) a person servicing student loans made with the person's own funds, if no more than three student loans are made in any 12-month period;\n(3) an agency, instrumentality, or political subdivision of this state that makes, services, or guarantees student loans;\n(4) a person acting in a fiduciary capacity, such as a trustee or receiver, as a result of a specific order issued by a court of competent jurisdiction;\n(5) the University of Minnesota; or\n(6) a person exempted by order of the commissioner.\n(a) Any person seeking to act within the state as a student loan servicer must apply for a license in a form and manner specified by the commissioner. At a minimum, the application must include:\n(1) a financial statement prepared by a certified public accountant or a public accountant;\n(2) the history of criminal convictions, excluding traffic violations, for persons in control of the applicant;\n(3) any information requested by the commissioner related to the history of criminal convictions disclosed under clause (2);\n(4) a nonrefundable license fee established by the commissioner; and\n(5) a nonrefundable investigation fee established by the commissioner.\n(b) The commissioner may conduct a state and national criminal history records check of the applicant and of each person in control or employee of the applicant.\n(a) Upon receipt of a complete application for an initial license and the payment of fees for a license and investigation, the commissioner must investigate the financial condition and responsibility, character, financial and business experience, and general fitness of the applicant. The commissioner may issue a license if the commissioner finds:\n(1) the applicant's financial condition is sound;\n(2) the applicant's business will be conducted honestly, fairly, equitably, carefully, and efficiently within the purposes and intent of this chapter;\n(3) each person in control of the applicant is in all respects properly qualified and of good character;\n(4) no person, on behalf of the applicant, has knowingly made any incorrect statement of a material fact in the application or in any report or statement made pursuant to this section;\n(5) no person, on behalf of the applicant, has knowingly omitted any information required by the commissioner from an application, report, or statement made pursuant to this section;\n(6) the applicant has paid the fees required under this section; and\n(7) the application has met other similar requirements as determined by the commissioner.\n(b) A license issued under this chapter is not transferable or assignable.\nAn applicant or student loan servicer must notify the commissioner in writing of any change in the information provided in the initial application for a license or the most recent renewal application for a license. The notification must be received no later than ten business days after the date of an event that results in the information becoming inaccurate.\nLicenses issued under this chapter expire on December 31 of each year and are renewable on January 1.\n(a) A person is exempt from the application procedures under subdivision 3 if the commissioner determines that the person is servicing student loans in this state pursuant to a contract awarded by the United States Secretary of Education under United States Code, title 20, section 1087f. Documentation of eligibility for this exemption shall be in a form and manner determined by the commissioner.\n(b) A person determined to be eligible for the exemption under paragraph (a) shall, upon payment of the fees under subdivision 3, be issued a license and deemed to meet all of the requirements of subdivision 4.\n(a) A person issued a license under subdivision 7 must provide the commissioner with written notice no less than seven days after the date the person's contract under United States Code, title 20, section 1087f, expires, is revoked, or is terminated.\n(b) A person issued a license under subdivision 7 has 30 days from the date the notification under paragraph (a) is provided to complete the requirements of subdivision 3. If a person does not meet the requirements of subdivision 3 within this time period, the commissioner shall immediately suspend the person's license under this chapter.\nSection 58A.04, subdivision 2, applies to this chapter.\n(a) Beginning March 15, 2025, a student loan lender that secures, makes, or extends student loans in Minnesota must report to the commissioner on the form the commissioner provides:\n(1) a list of all schools attended by borrowers who received a student loan from the student loan lender and resided within Minnesota at the time of the transaction and whose debt is still outstanding, including student loans used to refinance an existing debt;\n(2) the total outstanding dollar amount owed by borrowers residing in Minnesota who received student loans from the student loan lender;\n(3) the total number of student loans owed by borrowers residing in Minnesota who received student loans from the student loan lender;\n(4) the total outstanding dollar amount and number of student loans owed by borrowers who reside in Minnesota, associated with each school identified under clause (1);\n(5) the total dollar amount of student loans provided by the student loan lender to borrowers who resided in Minnesota in the prior calendar year;\n(6) the total outstanding dollar amount and number of student loans owed by borrowers who resided in Minnesota, associated with each school identified under clause (1), that were provided in the prior calendar year;\n(7) the rate of default for borrowers residing in Minnesota who obtained student loans from the student loan lender, if applicable;\n(8) the rate of default for borrowers residing in Minnesota who obtained student loans from the student loan lender associated with each school identified under clause (1), if applicable;\n(9) the range of initial interest rates for student loans provided by the student loan lender to borrowers who resided in Minnesota in the prior calendar year;\n(10) the total number of borrowers who received student loans identified under clause (9), and the percentage of borrowers who received each rate identified under clause (9);\n(11) the total dollar amount and number of student loans provided in the prior calendar year by the student loan lender to borrowers who resided in Minnesota at the time of the transaction and had a cosigner for the student loans;\n(12) the total dollar amount and number of student loans provided by the student loan lender to borrowers residing in Minnesota used to refinance a prior student loan or federal student loan in the prior calendar year;\n(13) the total dollar amount and number of student loans for which the student loan lender had sued to collect from a borrower residing in Minnesota in the prior calendar year;\n(14) a copy of any model promissory note, agreement, contract, or other instrument used by the student loan lender in the previous year to substantiate that a borrower owes a new debt to the student loan lender; and\n(15) any other information considered necessary by the commissioner to assess the total size and status of the student loan market and well-being of borrowers in Minnesota.\n(b) In addition to annual reports, the commissioner may require additional regular or special reports as the commissioner deems necessary to properly supervise student loan lenders under this chapter.\n(c) The commissioner of commerce must share data collected under this subdivision with the commissioner of higher education.\n(a) Beginning March 15, 2025, a student loan servicer that services student loans in Minnesota must report to the commissioner on the form the commissioner provides. The report must include:\n(1) a list of any outstanding student loans owed by borrowers who reside in Minnesota that are serviced by the student loan servicer;\n(2) the total outstanding dollar amount and number of student loans that are serviced by the student loan servicer and owed by borrowers who reside in Minnesota;\n(3) the total dollar amount and number of student loans owed by borrowers who resided in Minnesota that were serviced by the student loan servicer in the prior calendar year;\n(4) the rate of default for student loans owed by borrowers who reside in Minnesota that are serviced by the student loan servicer, if applicable;\n(5) the range of interest rates for student loans serviced by the student loan servicers to borrowers who resided in Minnesota in the prior calendar year;\n(6) the total outstanding dollar amount and number of student loans that were serviced by the student loan servicer and owed by borrowers residing in Minnesota to refinance a prior student loan or federal student loan; and\n(7) any other information considered necessary by the commissioner to assess the total size and status of the student loan market and well-being of borrowers in Minnesota.\n(b) In addition to annual reports, the commissioner may require additional regular or special reports as the commissioner deems necessary to properly supervise student loan servicers under this chapter.\n(c) The commissioner of commerce must share data collected under this subdivision with the commissioner of higher education.",
	"repealed": false
}