{
	"id": "246.721",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.721",
	"title": "246.721 PROTOCOL FOR EXPOSURE TO BLOOD-BORNE PATHOGENS.",
	"text": "(a) A state-operated treatment program shall follow applicable Occupational Safety and Health Administration guidelines under Code of Federal Regulations, title 29, part 1910.1030, for blood-borne pathogens.\n(b) Every state-operated treatment program shall adopt and follow a postexposure protocol for employees at a state-operated treatment program who have experienced a significant exposure. The postexposure protocol must adhere to the most current recommendations of the United States Public Health Service and include, at a minimum, the following:\n(1) a process for employees to report an exposure in a timely fashion;\n(2) a process for an infectious disease specialist, or a licensed physician, advanced practice registered nurse, or physician assistant who is knowledgeable about the most current recommendations of the United States Public Health Service in consultation with an infectious disease specialist, (i) to determine whether a significant exposure to one or more blood-borne pathogens has occurred, and (ii) to provide, under the direction of a licensed physician, advanced practice registered nurse, or physician assistant, a recommendation or recommendations for follow-up treatment appropriate to the particular blood-borne pathogen or pathogens for which a significant exposure has been determined;\n(3) if there has been a significant exposure, a process to determine whether the patient has a blood-borne pathogen through disclosure of test results, or through blood collection and testing as required by sections 246.71 to 246.722;\n(4) a process for providing appropriate counseling prior to and following testing for a blood-borne pathogen regarding the likelihood of blood-borne pathogen transmission and follow-up recommendations according to the most current recommendations of the United States Public Health Service for testing and treatment;\n(5) a process for providing appropriate counseling under clause (4) to the employee of a state-operated treatment program and to the patient; and\n(6) compliance with applicable state and federal laws relating to data practices, confidentiality, informed consent, and the patient bill of rights.",
	"repealed": false
}