{
	"id": "341.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.30",
	"title": "341.30 LICENSURE REQUIREMENTS.",
	"text": "All referees, judges, promoters, trainers, timekeepers, ringside physicians, combatants, and seconds are required to be licensed by the commissioner. The commissioner shall not permit any of these persons to participate in any matter with any combative sport contest unless the commissioner has first issued the person a license.\nBefore participating in the holding, promoting, or conducting of any combative sport contest, a corporation, partnership, limited liability company, or other business entity organized and existing under law shall obtain a license from the commissioner and must be authorized to do business under the laws of this state.\nThe commissioner may require referees, judges, promoters, and combatants to furnish fingerprints and background information under commissioner rules before licensure. The commissioner shall charge a fee for receiving fingerprints and background information in an amount determined by the commissioner. The commissioner may require referees, judges, promoters, and combatants to furnish fingerprints and background information before license renewal. The fee may include a reasonable charge for expenses incurred by the commissioner or the Department of Public Safety. For this purpose, the commissioner and the Department of Public Safety may enter into an interagency agreement.\n(a) Before the commissioner issues a promoter's license to an individual, corporation, or other business entity, the applicant shall complete a licensing application on the Office of Combative Sports website or on forms prescribed by the commissioner and shall:\n(1) show on the licensing application the owner or owners of the applicant entity and the percentage of interest held by each owner holding a 25 percent or more interest in the applicant;\n(2) provide the commissioner with a copy of the latest financial statement of the applicant;\n(3) provide proof, where applicable, of authorization to do business in the state of Minnesota; and\n(4) deposit with the commissioner a surety bond in an amount set by the commissioner, which must not be less than $10,000. The bond shall be executed in favor of this state and shall be conditioned on the faithful performance by the promoter of the promoter's obligations under this chapter and the rules adopted under it.\n(b) Before the commissioner issues a license to a combatant, the applicant shall:\n(1) submit to the commissioner the results of current medical examinations on forms prescribed by the commissioner that state that the combatant is cleared to participate in a combative sport contest. The applicant must undergo and submit the results of the following medical examinations, which do not exempt a combatant from the requirements in section 341.33:\n(i) a physical examination performed by a licensed medical doctor, doctor of osteopathic medicine, advance practice nurse practitioner, or a physician assistant. Physical examinations are valid for one year from the date of the exam;\n(ii) an ophthalmological examination performed by an ophthalmologist or optometrist that includes dilation designed to detect any retinal defects or other damage or a condition of the eye that could be aggravated by combative sports. Ophthalmological examinations are valid for one year from the date of the exam;\n(iii) blood work results for HBsAg (Hepatitis B surface antigen), HCV (Hepatitis C antibody), and HIV. Blood work results are good for one year from the date blood was drawn. The commissioner shall not issue a license to an applicant submitting positive test results for HBsAg, HCV, or HIV; and\n(iv) other appropriate neurological or physical examinations before any contest, if the commissioner determines that the examination is desirable to protect the health of the combatant;\n(2) complete a licensing application on the Office of Combative Sports website or on forms prescribed by the commissioner; and\n(3) provide proof that the applicant is 18 years of age. Acceptable proof is a photo driver's license, state photo identification card, passport, or birth certificate combined with additional photo identification.\n(c) Before the commissioner issues an amateur combatant license to an individual, the applicant must submit proof of qualifications that includes at a minimum: (1) an applicant's prior bout history and evidence showing that the applicant has completed at least six months of training in a combative sport; or (2) a letter of recommendation from a coach or trainer.\n(d) Before the commissioner issues a professional combatant license to an individual, the applicant must submit proof of qualifications that includes an applicant's prior bout history showing the applicant has competed in at least four sanctioned combative sports contests. If the applicant has not competed in at least four sanctioned combative sports contests, the commissioner may still grant the applicant a license if the applicant provides evidence demonstrating that the applicant has sufficient skills and experience in combative sports or martial arts to compete as a professional combatant.\n(e) Before the commissioner issues a license to a referee, judge, or timekeeper, the applicant must submit proof of qualifications that may include certified training from the Association of Boxing Commissions, licensure with other regulatory bodies, professional references, or a log of bouts worked.\n(f) Before the commissioner issues a license to a ringside physician, the applicant must submit proof that they are licensed to practice medicine in the state of Minnesota and in good standing.",
	"repealed": false
}