{
	"id": "144.6535",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6535",
	"title": "144.6535 VARIANCE OR WAIVER.",
	"text": "A hospital may request that the commissioner grant a variance or waiver from the provisions of section 144.55, subdivision 3, paragraph (b). A request for a variance or waiver must be submitted to the commissioner in writing. Each request must contain:\n(1) the specific requirement for which the variance or waiver is requested;\n(2) the reasons for the request;\n(3) the alternative measures that will be taken if a variance or waiver is granted;\n(4) the length of time for which the variance or waiver is requested; and\n(5) other relevant information deemed necessary by the commissioner to properly evaluate the request for the variance or waiver.\nThe decision to grant or deny a variance or waiver must be based on the commissioner's evaluation of the following criteria:\n(1) whether the variance or waiver will adversely affect the health, treatment, comfort, safety, or well-being of a patient;\n(2) whether the alternative measures to be taken, if any, are equivalent to or superior to those prescribed in section 144.55, subdivision 3, paragraph (b); and\n(3) whether compliance with the requirements would impose an undue burden upon the applicant.\nThe commissioner must notify the applicant in writing of the decision. If a variance or waiver is granted, the notification must specify the period of time for which the variance or waiver is effective and the alternative measures or conditions, if any, to be met by the applicant.\n(a) Alternative measures or conditions attached to a variance or waiver have the same force and effect as the requirement under section 144.55, subdivision 3, paragraph (b), and are subject to the issuance of correction orders and penalty assessments in accordance with section 144.55.\n(b) Fines for a violation of this section shall be in the same amount as that specified for the particular requirement for which the variance or waiver was requested.\nA request for renewal of a variance or waiver must be submitted in writing at least 45 days before its expiration date. Renewal requests must contain the information specified in subdivision 1. A variance or waiver must be renewed by the commissioner if the applicant continues to satisfy the criteria in subdivision 2 and the alternative measures or conditions, if any, specified under subdivision 3 and demonstrates compliance with the alternative measures or conditions imposed at the time the original variance or waiver was granted.\nThe commissioner must deny, revoke, or refuse to renew a variance or waiver if it is determined that the criteria in subdivision 2 or the alternative measures or conditions, if any, specified under subdivision 3 are not met. The applicant must be notified in writing of the reasons for the decision and informed of the right to appeal the decision.\nAn applicant may contest the denial, revocation, or refusal to renew a variance or waiver by requesting a contested case hearing under chapter 14. The applicant must submit, within 15 days of the receipt of the commissioner's decision, a written request for a hearing. The request for hearing must set forth in detail the reasons why the applicant contends the decision of the commissioner should be reversed or modified. At the hearing, the applicant has the burden of proving that it satisfied the criteria specified in subdivision 2 or the alternative measures or conditions, if any, specified under subdivision 3, except in a proceeding challenging the revocation of a variance or waiver.",
	"repealed": false
}