{
	"id": "8.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/8.33",
	"title": "8.33 REPRESENTATION OF CONSUMER AND SMALL BUSINESS INTEREST IN PUBLIC UTILITY MATTERS.",
	"text": "For the purposes of this section, the following terms have the meanings given them:\n(1) \"Public utility\" means a publicly or privately owned entity engaged in supplying utility services to residential utility consumers in this state or to another public utility for ultimate distribution to residential utility consumers in this state and whose rates or charges are subject to approval by the Public Utilities Commission or an agency of the federal government. No municipal or cooperative utility shall be considered a \"public utility\" for the purposes of this clause.\n(2) \"Residential and small business utility consumer\" or \"consumer\" means a person or small business that uses utility services at the person's residence or business location in this state and who is billed by or pays a public utility for these services. Small business has the meaning given it in section 645.445.\n(3) \"Utility services\" means electricity, natural gas, or telephone services distributed to residential utility consumers by a public utility.\nThe attorney general is responsible for representing and furthering the interests of residential and small business utility consumers through participation in matters before the Public Utilities Commission involving utility rates and adequacy of utility services to residential or small business utility consumers. The attorney general shall expend a reasonable portion of effort among all three kinds of utility services and shall identify and promote the needs of each class of residential and small business consumers with respect to each of the utility services. When participating in telecommunication matters that affect deployment of the infrastructure, the attorney general may apply the goals of:\n(1) achieving economically efficient investment in:\n(i) higher speed telecommunication services; and\n(ii) greater capacity for voice, video, and data transmission; and\n(2) just and reasonable rates.\nSubject to the limitations of subdivision 2, the attorney general may intervene as of right or participate as an interested party in matters pending before the Public Utilities Commission which affect the distribution by a public utility of utility services to residential or small business utility consumers. The right of the attorney general to participate or intervene does not affect the obligation of the Public Utilities Commission to protect the public interest.\nThe Public Utilities Commission shall give reasonable notice to the attorney general of any matter scheduled to come before the commission affecting a public utility's rates or adequacy of services to residential or small business utility consumers. Rules of the commission governing procedures before the commission apply to the attorney general and the attorney general's employees or representatives. The attorney general has the same rights and privileges accorded other intervenors or participants in matters pending before the commission.\nThe attorney general has an interest sufficient to maintain, intervene as of right in, or otherwise participate in any civil action in the courts of this state for the review or enforcement of any Public Utilities Commission action which affects a public utility's rates or adequacy of service to residential or small business utility consumers.\nThe attorney general shall represent and further the interests of residential and small business utility consumers through participation as an intervenor or interested party in federal proceedings relating to the regulation of: (a) wholesale rates for energy delivered through interstate facilities; or (b) fuel used in generation of electricity or the manufacture of gas. The attorney general may maintain, intervene in, or otherwise participate in civil actions relating to the federal proceedings.\nThe power granted by this section is in addition to powers otherwise provided by law to the attorney general.",
	"repealed": false
}