{
	"id": "342.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.03",
	"title": "342.03 CANNABIS ADVISORY COUNCIL.",
	"text": "The Cannabis Advisory Council is created consisting of the following members:\n(1) the director of the Office of Cannabis Management or a designee;\n(2) the commissioner of employment and economic development or a designee;\n(3) the commissioner of revenue or a designee;\n(4) the commissioner of health or a designee;\n(5) the commissioner of human services or a designee;\n(6) the commissioner of public safety or a designee;\n(7) the commissioner of human rights or a designee;\n(8) the commissioner of labor or a designee;\n(9) the commissioner of agriculture or a designee;\n(10) the commissioner of the Pollution Control Agency or a designee;\n(11) the superintendent of the Bureau of Criminal Apprehension or a designee;\n(12) the colonel of the State Patrol or a designee;\n(13) the director of the Office of Traffic Safety in the Department of Public Safety or a designee;\n(14) a representative from the League of Minnesota Cities appointed by the league;\n(15) a representative from the Association of Minnesota Counties appointed by the association;\n(16) an expert in minority business development appointed by the governor;\n(17) an expert in economic development strategies for under-resourced communities appointed by the governor;\n(18) an expert in farming or representing the interests of farmers appointed by the governor;\n(19) an expert representing the interests of cannabis workers appointed by the governor;\n(20) an expert representing the interests of employers appointed by the governor;\n(21) an expert in municipal law enforcement with advanced training in impairment detection and evaluation appointed by the governor;\n(22) an expert in social welfare or social justice appointed by the governor;\n(23) an expert in criminal justice reform to mitigate the disproportionate impact of drug prosecutions on communities of color appointed by the governor;\n(24) an expert in prevention, treatment, and recovery related to substance use disorders appointed by the governor;\n(25) an expert in minority business ownership appointed by the governor;\n(26) an expert in women-owned businesses appointed by the governor;\n(27) an expert in cannabis retailing appointed by the governor;\n(28) an expert in cannabis product manufacturing appointed by the governor;\n(29) an expert in laboratory sciences and toxicology appointed by the governor;\n(30) an expert in providing legal services to cannabis businesses appointed by the governor;\n(31) an expert in cannabis cultivation appointed by the governor;\n(32) an expert in pediatric medicine appointed by the governor;\n(33) an expert in adult medicine appointed by the governor;\n(34) an expert in clinical pharmacy appointed by the governor;\n(35) three patient advocates, one who is a patient enrolled in the medical cannabis program; one who is a parent or caregiver of a patient in the medical cannabis program; and one patient with experience in the mental health system or substance use disorder treatment system appointed by the governor;\n(36) two licensed mental health professionals appointed by the governor;\n(37) a veteran appointed by the governor;\n(38) one member of each of the following federally recognized Tribes, designated by the elected Tribal president or chairperson of the governing bodies of:\n(i) the Fond du Lac Band;\n(ii) the Grand Portage Band;\n(iii) the Mille Lacs Band;\n(iv) the White Earth Band;\n(v) the Bois Forte Band;\n(vi) the Leech Lake Band;\n(vii) the Red Lake Nation;\n(viii) the Upper Sioux Community;\n(ix) the Lower Sioux Indian Community;\n(x) the Shakopee Mdewakanton Sioux Community; and\n(xi) the Prairie Island Indian Community;\n(39) a representative from the Local Public Health Association of Minnesota appointed by the association; and\n(40) one youth from outside the seven-county metropolitan area as defined in section 473.121, subdivision 4, and one youth from the seven-county metropolitan area who are both appointed by the governor. The youths must have been disproportionately affected by cannabis or cannabis use or have an immediate family member who was negatively affected by cannabis use. The youths must be between the ages of 18 and 24 years old.\nThe membership terms, compensation, removal of members appointed by the governor, and filling of vacancies of members are provided in section 15.059. Notwithstanding section 15.059, subdivision 6, the advisory council shall not expire.\n(a) The director of the Office of Cannabis Management or the director's designee must chair the Cannabis Advisory Council. The advisory council must elect a vice-chair and may elect other officers as necessary.\n(b) The advisory council shall meet quarterly or upon the call of the chair.\n(c) Meetings of the advisory council are subject to chapter 13D.\n(a) The duties of the advisory council shall include:\n(1) reviewing national cannabis policy;\n(2) examining the effectiveness of state cannabis policy;\n(3) reviewing developments in the cannabis industry and hemp consumer industry;\n(4) reviewing developments in the study of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products;\n(5) taking public testimony;\n(6) considering the impact of legalized adult-use cannabis on the rate of cannabis use by minors; and\n(7) making recommendations to the Office of Cannabis Management.\n(b) At its discretion, the advisory council may examine other related issues consistent with this section.",
	"repealed": false
}