{
	"id": "151.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.212",
	"title": "151.212 LABEL OF PRESCRIPTION DRUG CONTAINERS.",
	"text": "Drugs dispensed pursuant to a prescription shall bear a label permanently affixed to the immediate container in which the drug is dispensed and which is received by the purchaser. The label shall bear the name of the manufacturer or distributor of the finished dosage form of the drug and all other information required by law and by rules of the board.\n(a) In addition to the requirements of subdivision 1, when the use of any drug containing a controlled substance, as defined in chapter 152, or any other drug determined by the board, either alone or in conjunction with alcoholic beverages, may impair the ability of the user to operate a motor vehicle, the board shall require by rule that notice be prominently set forth on the label or container. Rules promulgated by the board shall specify exemptions from this requirement when there is evidence that the user will not operate a motor vehicle while using the drug.\n(b) In addition to the requirements of subdivision 1, whenever a prescription drug containing an opiate is dispensed to a patient for outpatient use, the pharmacy or practitioner dispensing the drug must prominently display on the label or container a notice that states \"Caution: Opioid. Risk of overdose and addiction.\"\nDrugs dispensed, sold, or distributed in any manner pursuant to the order of a licensed veterinarian shall bear a label permanently affixed to the container in which the drug is dispensed and which is received by the purchaser. The label shall bear the name of the manufacturer or distributor of the finished dosage form of the drug and all other information required by law and the rules of the board.\n(a) A pharmacy must:\n(1) make reasonable efforts to inform the public that an accessible prescription drug container label is available at no additional cost, upon request of the patient or the patient's representative, to any patient who has difficulty seeing or reading standard printed labels on prescription drug containers; and\n(2) if the pharmacy knows that the patient has difficulty seeing or reading standard printed labels on prescription drug containers, inform a patient that an accessible prescription drug container label is available at no additional cost upon request of the patient or the patient's representative.\n(b) Subject to paragraph (e), if a patient requests an accessible container label, the pharmacy must provide the patient with a prescription drug container label in large print, Braille, or may provide any other method included in the best practices for access to prescription drug labeling information by the United States Access Board, or its successor organization, depending on the need and preference of the patient. The pharmacy must make reasonable efforts to ensure patient safety and access during the time it takes to provide the requested method of accessibility.\n(c) The accessible container label must:\n(1) be affixed on the container in compliance with section 151.212, subdivision 1;\n(2) last for at least the duration of the prescription;\n(3) contain the information required under subdivisions 1 and 2;\n(4) be available in a timely manner relative to the industry standard time required to produce the accessible container label; and\n(5) conform with the best practices established by the United States Access Board, or its successor organization, for large print and Braille accessible container labels.\n(d) By January 1, 2025, the commissioner of health must publish a list of pharmacies that have informed the commissioner that the pharmacy has the technological capacity to provide an accessible container label to a patient in the timely manner required by paragraph (c), clause (4). The commissioner must update this list on a quarterly basis until January 1, 2026.\n(e) Until January 1, 2026, if the pharmacy does not have the technological capacity to provide an accessible container label to a patient in the timely manner required by paragraph (c), clause (4), the pharmacy is not required to provide an accessible container label to a patient requesting such a label, but the pharmacy must inform the patient of the list of pharmacies with such capacity required pursuant to paragraph (d), if such list is published.\n(f) On and after January 1, 2026, all pharmacies must be able to provide an accessible container label in the timely manner required by paragraph (c), clause (4).\n(g) This subdivision does not apply to prescription drugs dispensed and administered by a correctional institution.",
	"repealed": false
}