{
	"id": "44.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/44.08",
	"title": "44.08 PERMANENT EMPLOYEES, DISMISSAL, SUSPENSION.",
	"text": "No permanent employee in the classified service shall be dismissed or suspended without pay for more than 30 days, except for just cause, which shall not be religious, racial, or political. No such action shall be taken except after the employee has been given notice of the action in writing. A copy of the notice shall be transmitted to the board. Upon written request made by the employee within 15 days after receipt of such notice, the appointing authority shall file the charges of inefficiency or misconduct on which the dismissal or suspension is based with the employee concerned and with the secretary of the board and a hearing shall be held by the board thereon after 10 days' written notice to the employee of the time and place of the hearing. Action of the appointing authority shall be final if no such written request is made within 15 days after receipt of the notice of dismissal or suspension.\nThe hearing on the charges shall be open to the public and each member of the board shall have the power to issue subpoenas, to administer oaths, and to compel the attendance and testimony of witnesses and the production of books and papers relevant to the investigation. The board shall require by subpoena the attendance of any witness requested by the employee who can be found in the county. The board may make complaint to the district court of disobedience of its subpoenas or orders and the court shall prescribe notice to the person accused and require obedience to the board's subpoena and order and punish disobedience as a contempt of court. Witnesses shall be entitled to the same fees and mileage as for attendance upon the district court, except that any officer, agent, or employee of the municipality who receives compensation shall not be entitled to fees or mileage.\nIf, after the hearing, the board finds that the charges are sustained, the dismissal or suspension shall be final unless an appeal to the courts is taken under section 44.09. If the board finds that the charges are not sustained, the employee, if suspended pending investigation, shall be immediately reinstated and shall be paid all back pay due for the period of suspension; if not suspended, the employee shall be continued in the position as though the action had not been brought, subject to the right of the appointing authority to appeal as provided in section 44.09.\nFindings hereunder and orders sustaining disciplinary actions or compelling reinstatement shall be in writing and shall be filed within three days after the completion of the hearing among the records of the secretary of the board. The secretary shall give written notice of the decision to any employee concerned and to the appointing authority.",
	"repealed": false
}