{
	"id": "290.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.091",
	"title": "290.091 ALTERNATIVE MINIMUM TAX ON PREFERENCE ITEMS.",
	"text": "In addition to all other taxes imposed by this chapter a tax is imposed on individuals, estates, and trusts equal to the excess (if any) of\n(a) an amount equal to 6.75 percent of alternative minimum taxable income after subtracting the exemption amount, over\n(b) the regular tax for the taxable year.\nFor purposes of the tax imposed by this section, the following terms have the meanings given.\n(a) \"Alternative minimum taxable income\" means the sum of the following for the taxable year:\n(1) the taxpayer's federal alternative minimum taxable income as defined in section 55(b)(1)(D) of the Internal Revenue Code;\n(2) the taxpayer's itemized deductions allowed in computing federal alternative minimum taxable income, but excluding:\n(i) the charitable contribution deduction under section 170 of the Internal Revenue Code;\n(ii) the medical expense deduction;\n(iii) the casualty, theft, and disaster loss deduction; and\n(iv) the impairment-related work expenses of a person with a disability;\n(3) for depletion allowances computed under section 613A(c) of the Internal Revenue Code, with respect to each property (as defined in section 614 of the Internal Revenue Code), to the extent not included in federal alternative minimum taxable income, the excess of the deduction for depletion allowable under section 611 of the Internal Revenue Code for the taxable year over the adjusted basis of the property at the end of the taxable year (determined without regard to the depletion deduction for the taxable year);\n(4) to the extent not included in federal alternative minimum taxable income, the amount of the tax preference for intangible drilling cost under section 57(a)(2) of the Internal Revenue Code determined without regard to subparagraph (E);\n(5) to the extent not included in federal alternative minimum taxable income, the amount of interest income as provided by section 290.0131, subdivision 2;\n(6) the amount of addition required by section 290.0131, subdivisions 9, 10, and 16;\n(7) the deduction allowed under section 199A of the Internal Revenue Code, to the extent not included in the addition required under clause (6); and\n(8) to the extent not included in federal alternative minimum taxable income, the amount of foreign-derived intangible income deducted under section 250 of the Internal Revenue Code;\nless the sum of the amounts determined under the following:\n(i) interest income as defined in section 290.0132, subdivision 2;\n(ii) an overpayment of state income tax as provided by section 290.0132, subdivision 3, to the extent included in federal alternative minimum taxable income;\n(iii) the amount of investment interest paid or accrued within the taxable year on indebtedness to the extent that the amount does not exceed net investment income, as defined in section 163(d)(4) of the Internal Revenue Code. Interest does not include amounts deducted in computing federal adjusted gross income;\n(iv) amounts subtracted from federal taxable or adjusted gross income as provided by section 290.0132, subdivisions 7, 9 to 15, 17, 21, 24, 26 to 29, 31, 34, and 35;\n(v) the amount of the net operating loss allowed under section 290.095, subdivision 11, paragraph (c); and\n(vi) the amount allowable as a Minnesota itemized deduction under section 290.0122, subdivision 7.\nIn the case of an estate or trust, alternative minimum taxable income must be computed as provided in section 59(c) of the Internal Revenue Code, except alternative minimum taxable income must be increased by the addition in section 290.0131, subdivision 16.\n(b) \"Investment interest\" means investment interest as defined in section 163(d)(3) of the Internal Revenue Code.\n(c) \"Net minimum tax\" means the minimum tax imposed by this section.\n(d) \"Regular tax\" means the tax that would be imposed under this chapter (without regard to this section, section 290.033, and section 290.032), reduced by the sum of the nonrefundable credits allowed under this chapter.\n(e) \"Tentative minimum tax\" equals 6.75 percent of alternative minimum taxable income after subtracting the exemption amount determined under subdivision 3.\n(a) For purposes of computing the alternative minimum tax, the exemption amount is $77,590 for married couples filing joint returns, $38,800 for married individuals filing separate returns, estates, and trusts, and $58,190 for unmarried individuals.\n(b) The exemption amount determined under this subdivision is subject to the phase out under section 55(d)(2) of the Internal Revenue Code, except that alternative minimum taxable income as determined under this section must be substituted in the computation of the phase out, and section 55(d)(4) of the Internal Revenue Code does not apply.\n(c) The commissioner shall annually adjust the amounts in paragraph (a) as provided in section 270C.22. The statutory year is taxable year 2019.\n(a) An individual who is not a Minnesota resident for the entire year must compute alternative minimum tax liability using a regular tax liability determined under section 290.06, subdivision 2c, paragraph (e), without regard to the provision for allocation to Minnesota. The resulting alternative minimum tax liability must be multiplied by the fraction defined in section 290.06, subdivision 2c, paragraph (e).\n(b) In the case of an estate or trust, the alternative minimum tax liability must be computed by multiplying alternative minimum taxable income and the exemption amount by a fraction, the numerator of which is the amount of the taxpayer's alternative minimum taxable income allocated to this state pursuant to the provisions of sections 290.17 to 290.20, and the denominator of which is the taxpayer's total alternative minimum taxable income.\nThe tax benefit rule contained in section 59(g) of the Internal Revenue Code applies to the computation of the tax under this section only to the extent that it determines if there is an item of tax preference for purposes of subdivision 2, clause (a)(1).\n(a) A credit is allowed against the tax imposed by this chapter on individuals, trusts, and estates equal to the minimum tax credit for the taxable year. The minimum tax credit equals the adjusted net minimum tax for taxable years beginning after December 31, 1988, reduced by the minimum tax credits allowed in a prior taxable year. The credit may not exceed the excess (if any) for the taxable year of\n(1) the regular tax, over\n(2) the greater of (i) the tentative alternative minimum tax, or (ii) zero.\n(b) The adjusted net minimum tax for a taxable year equals the lesser of the net minimum tax or the excess (if any) of\n(1) the tentative minimum tax, over\n(2) 6.75 percent of the sum of\n(i) adjusted gross income as defined in section 62 of the Internal Revenue Code,\n(ii) interest income as defined in section 290.0131, subdivision 2,\n(iii) interest on specified private activity bonds, as defined in section 57(a)(5) of the Internal Revenue Code, to the extent not included under clause (ii),\n(iv) depletion as defined in section 57(a)(1), determined without regard to the last sentence of paragraph (1), of the Internal Revenue Code, less\n(v) the deductions allowed in computing alternative minimum taxable income provided in subdivision 2, paragraph (a), clause (2) of the first series of clauses and clauses (1), (2), and (3) of the second series of clauses, and\n(vi) the exemption amount determined under subdivision 3.\nIn the case of an individual who is not a Minnesota resident for the entire year, adjusted net minimum tax must be multiplied by the fraction defined in section 290.06, subdivision 2c, paragraph (e). In the case of a trust or estate, adjusted net minimum tax must be multiplied by the fraction defined under subdivision 4, paragraph (b).",
	"repealed": false
}