{
	"id": "270C.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.59",
	"title": "270C.59 LIABILITY OF THIRD PARTIES PAYING OR PROVIDING FOR WAGES.",
	"text": "(a) For purposes of section 290.92, if a lender, surety, or other person, who is not an employer with respect to an employee or group of employees, pays wages directly to such an employee or group of employees, employed by one or more employers, or to an agent on behalf of such employee or employees, such lender, surety, or other person shall be liable to the commissioner in a sum equal to the taxes required to be deducted and withheld from such wages by such employer.\n(b) If a lender, surety, or other person supplies funds to or for the account of an employer for the specific purpose of paying wages of the employees of such employer, with actual notice or knowledge that such employer does not intend to or will not be able to make timely payment or deposit of the amounts of tax required by section 290.92 to be deducted and withheld by such employer from such wages, such lender, surety, or other person shall be liable personally to the commissioner in a sum equal to the taxes which are not paid over to the commissioner by such employer with respect to such wages.\n(c) For purposes of this section, a person shall be deemed for purposes of a particular transaction to have actual notice or knowledge of any fact from the time such fact is brought to the attention of the individual conducting such transaction, and in any event from the time such fact would have been brought to such individual's attention if the person had exercised due diligence. A person exercises due diligence by maintaining reasonable routines for communicating significant information to the person conducting the transaction and there is reasonable compliance with the routines. Due diligence does not require an individual acting for the person to communicate information unless such communication is part of the individual's regular duties or unless the individual has reason to know of the transaction and that the transaction would be materially affected by the information.\n(d) Any amounts paid to the commissioner pursuant to this section shall be credited to the liability of the employer.",
	"repealed": false
}