{
	"id": "176.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.421",
	"title": "176.421 APPEALS TO WORKERS' COMPENSATION COURT OF APPEALS.",
	"text": "When a petition has been heard before a compensation judge, within 30 days after a party in interest has been served with notice of an award or disallowance of compensation, or other order affecting the merits of the case, the party may appeal to the Workers' Compensation Court of Appeals on any of the following grounds:\n(1) the order does not conform with this chapter; or\n(2) the compensation judge committed an error of law; or\n(3) the findings of fact and order were clearly erroneous and unsupported by substantial evidence in view of the entire record as submitted; or\n(4) the findings of fact and order were procured by fraud, or coercion, or other improper conduct of a party in interest.\nWhere a party shows cause within the 30-day period referred to in subdivision 1, the Workers' Compensation Court of Appeals may extend the time for taking the appeal for not more than 30 additional days.\nThe appellant or the appellant's attorney shall prepare and sign a written notice of appeal specifying:\n(1) the order appealed from;\n(2) that appellant appeals from the order to the Workers' Compensation Court of Appeals;\n(3) the particular finding of fact or conclusion of law which the appellant claims was unsupported by substantial evidence in view of the entire record as submitted or procured by fraud, coercion, or other improper conduct; and\n(4) any other ground upon which the appeal is taken.\nAn appeal initiates the preparation of a typewritten transcript of the entire record unless the appeal is solely from an award of attorney's fees or an award of costs and disbursements or unless otherwise ordered by the court of appeals. On appeals from an award of attorney's fees or an award of costs and disbursements, the appellant must specifically delineate in the notice of appeal the portions of the record to be transcribed in order for the court of appeals to consider the appeal.\nThe respondent may cross-appeal within the 30-day period for taking an appeal, or within 15 days after service of the notice of appeal on that respondent, whichever is later.\nWithin the 30-day period for taking an appeal, the appellant shall:\n(1) serve a copy of the notice of appeal on each adverse party; and\n(2) pursuant to section 176.285, file the original notice of appeal, with proof of service by admission or affidavit, with the chief administrative law judge and file a copy with the commissioner.\nIn order to defray the cost of the preparation of the record of the proceedings appealed from, each appellant and cross-appellant shall pay to the commissioner of management and budget, Office of Administrative Hearings account the sum of $25. The filing fee must be received by the Office of Administrative Hearings within ten business days after the end of the appeal period. If the filing fee is not received within ten days after the appeal period, the appeal is not timely filed.\nThe first party to file an appeal is liable for the original cost of preparation of the transcript. Cross-appellants or any other persons requesting a copy of the transcript are liable for the cost of the copy. The chief administrative law judge may require payment for transcription costs to be made in advance of the transcript preparation. The cost of a transcript prepared by a nongovernmental source shall be paid directly to that source and shall not exceed the cost that the source would be able to charge the state for the same service.\nUpon a showing of cause, the chief administrative law judge may direct that a transcript be prepared without expense to the party requesting its preparation, in which case the cost of the transcript shall be paid by the Office of Administrative Hearings.\nAll fees received by the Office of Administrative Hearings for the preparation of the record for submission to the Workers' Compensation Court of Appeals or for the cost of transcripts prepared by the office shall be deposited in the Office of Administrative Hearings account in the state treasury and shall be used solely for the purpose of keeping the record of hearings conducted under this chapter and the preparation of transcripts of those hearings.\nWhen the notice of appeal has been filed with the chief administrative law judge and the fee for the preparation of the record has been paid, the chief administrative law judge shall immediately order the preparation of a typewritten transcript of that part of the hearing delineated in the notice. The official reporter or other person designated by the chief administrative law judge who transcribes the proceedings shall certify to their correctness.\nIf the transcript is prepared by a person who is not an employee of the Office of Administrative Hearings, upon completion of the transcript, the original shall be filed with the chief administrative law judge.\nWhen the transcript has been completed and is on file with the chief administrative law judge, the chief judge shall certify the record to the Workers' Compensation Court of Appeals and notify the commissioner of the certification.\nOn an appeal taken under this section, the Workers' Compensation Court of Appeals' review is limited to the issues raised by the parties in the notice of appeal or by a cross-appeal. In these cases, on those issues raised by the appeal, the Workers' Compensation Court of Appeals may:\n(1) grant an oral argument based on the record before the compensation judge;\n(2) examine the record;\n(3) substitute for the findings of fact made by the compensation judge findings based on the total evidence;\n(4) sustain, reverse, make or modify an award or disallowance of compensation or other order based on the facts, findings, and law; and\n(5) remand or make other appropriate order.\nThe court shall issue a decision in each case within 90 days after certification of the record to the court by the chief administrative law judge, the filing of a cross-appeal, oral argument, or a final submission of briefs or memoranda by the parties, whichever is latest. For cases submitted without oral argument, a decision shall be issued within 90 days after assignment of the case to the judges. The chief judge may waive the 90-day limitation for any proceeding before the court for good cause shown. No part of the salary of a Workers' Compensation Court of Appeals judge may be paid unless the judge, upon accepting the payment, certifies that decisions in cases in which the judge has participated have been issued within the time limits prescribed by this subdivision.\nAt the office's own expense, the office shall make a complete record of all formal proceedings before the office.\nThe office shall furnish a transcript of these proceedings to any person who requests it and who pays a reasonable charge which shall be set by the office. Upon a showing of cause, the chief administrative law judge may direct that a transcript be prepared without expense to the person requesting the transcript, in which case the cost of the transcript shall be paid by the office. Transcript fees received under this subdivision shall be paid to the Workers' Compensation Division account in the state treasury and shall be annually appropriated to the division for the sole purpose of providing a record and transcripts as provided in this subdivision. This subdivision does not apply to any administrative conference or other proceeding before the commissioner which may be heard de novo in another proceeding including but not limited to proceedings under section 176.106 or 176.239.",
	"repealed": false
}