{
	"id": "169.346",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.346",
	"title": "169.346 DISABILITY PARKING AREAS; CRITERIA, ENFORCEMENT.",
	"text": "A person shall not:\n(1) park a motor vehicle in or obstruct access to a parking space or associated access aisle designated and reserved for the physically disabled, on either private or public property;\n(2) park a motor vehicle in or obstruct access to an area designated by a local governmental unit as a transfer zone for disabled persons;\n(3) alter a certificate;\n(4) exercise the parking privilege provided in section 169.345, unless:\n(i) that person is a physically disabled person as defined in section 169.345, subdivision 2, or the person is transporting or parking a motor vehicle for a physically disabled person; and\n(ii) the motor vehicle visibly displays one of the following: a disability plate issued under section 168.021, a certificate issued under section 169.345, a permit valid for 30 days issued under section 168.021 or 169.345, or an equivalent certificate, insignia, or plate issued by another state, a foreign country, or one of its political subdivisions; or\n(5) park a motor vehicle in an area used as a regular route transit stopping point where a transit vehicle that is accessible to the physically disabled regularly stops and a sign that bears the international symbol of access in white on blue is posted. A sign posted under this clause may display other information relating to the regular route transit service. For purposes of this clause, an area used as a regular route transit stopping point consists of the 80 feet immediately preceding the sign described in this clause.\nIn the event the designated disability parking spaces are either occupied or unavailable, a vehicle bearing a valid disability parking certificate issued under section 169.345 or license plates for physically disabled persons under section 168.021 may park at an angle and occupy two standard parking spaces.\n(a) Parking spaces reserved for physically disabled persons must be designated and identified by the posting of signs incorporating the international symbol of access in white on blue and indicating that violators are subject to a fine of up to $200. These parking spaces are reserved for disabled persons with motor vehicles displaying the required certificate, plates, permit valid for 30 days, or insignia.\n(b) For purposes of this subdivision, a parking space that is clearly identified as reserved for physically disabled persons by a permanently posted sign that does not meet all design standards, is considered designated and reserved for physically disabled persons. A sign posted for the purpose of this section must be visible from inside a motor vehicle parked in the space, be kept clear of snow or other obstructions which block its visibility, and be nonmovable.\n(c) By August 1, 2024, the Minnesota Council on Disability must select and propose a statewide uniform disability parking space sign that is consistent with the Americans with Disabilities Act. The selected and proposed sign must not display any variation of the word \"handicapped.\" As part of selecting and proposing a statewide uniform disability parking space sign, the Minnesota Council on Disability may encourage owners or managers of property to replace existing disability parking space signs at the owner's earliest opportunity once the sign is made available for distribution.\n(d) Beginning on August 1, 2025, an applicable owner or manager of property on which a disability parking sign may be located must install and display the new uniform disability parking sign required in paragraph (c) at:\n(1) newly created on-site parking facilities; and\n(2) existing on-site parking facilities when the manager or owner replaces existing disability parking space signs.\nThe owner or manager of the property on which the designated parking space is located must ensure that the parking space and associated access aisle are kept free of obstruction. If the owner or manager does not have the parking space properly posted or knowingly allows the parking space or access aisle to be blocked by plowed snow, merchandise, or similar obstructions, the owner or manager is guilty of a misdemeanor and subject to a fine of up to $500.\nA person who violates subdivision 1 is guilty of a misdemeanor and must be fined not less than $100 and not more than $200. This subdivision must be enforced in the same manner as parking ordinances or regulations in the governmental subdivision in which the violation occurs. Law enforcement officers may tag motor vehicles parked on either private or public property in violation of subdivision 1. Parking enforcement employees or agents of statutory or home rule charter cities or towns may tag or otherwise issue citations for motor vehicles parked on public property in violation of subdivision 1. If a holder of a disability certificate or disability plates allows a person who is not otherwise eligible to use the certificate or plates, then the holder is not eligible to be issued or to use a disability certificate or plates for 12 months after the date of violation. Except when the permit or certificate is expired by, or is otherwise invalid for, more than 90 days, a physically disabled person, or a person parking a motor vehicle for a disabled person, who is charged with violating subdivision 1 because the person parked in a parking space for physically disabled persons without the required certificate, license plates, or permit must not be convicted if the person (1) produces in court or before the court appearance the required certificate, permit, or evidence that the person has been issued plates under section 168.021, (2) surrenders the expired permit or certificate, and (3) demonstrates entitlement to the certificate, plates, or permit at the time of arrest or tagging. To be valid, the certificate or permit must show that it is owned by the same person that owned the expired certificate or permit displayed at the time the tag was issued. The registered vehicle owner is subject to the provisions of this subdivision.\nA statutory or home rule charter city may, by ordinance, establish a program to enforce the parking restrictions of this section or any similar local ordinance, relating to parking spaces for the physically disabled, by using citizen volunteers to issue citations to violators. The ordinance shall contain a process for training program participants in the requirements of the law, the method of issuing citations, and other related matters. Program participants who satisfy the training requirements of the ordinance are authorized to issue citations for violations of this section and are exempt from any other training or licensure requirements imposed on law enforcement officers by chapter 626.\nA statutory or home rule charter city may enact an ordinance establishing a permit program for long-term disability parking. If a city enacts the ordinance, a permit program for long-term disability parking must establish as a minimum:\n(1) a limitation on disability parking of a maximum of four hours during the hours of enforcement, on one-hour, 90-minute, and two-hour parking meters;\n(2) a requirement for city parking lots and ramps to provide a 50 percent discount on monthly fees for contracted parkers with disabilities or a 50 percent reduction in the hourly rate for parkers with disabilities, with appropriate vehicle identification, who park in designated disability parking spaces; and\n(3) issuance of a special needs permit to an employed person with severe disability for an all-day, on-street parking permit that will accommodate the person's access needs.",
	"repealed": false
}