{
	"id": "337.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/337.05",
	"title": "337.05 AGREEMENTS TO INSURE.",
	"text": "(a) Except as otherwise provided in paragraph (b), sections 337.01 to 337.05 do not affect the validity of agreements whereby a promisor agrees to provide specific insurance coverage for the benefit of others.\n(b) A provision that requires a party to provide insurance coverage to one or more other parties, including third parties, for the negligence or intentional acts or omissions of any of those other parties, including third parties, is against public policy and is void and unenforceable.\n(c) Paragraph (b) does not affect the validity of a provision that requires a party to provide or obtain workers' compensation insurance, construction performance or payment bonds, builder's risk policies, owner or contractor-controlled insurance programs or policies, or project-specific insurance for claims arising out of the promisor's negligent acts or omissions or the negligent acts or omissions of the promisor's independent contractors, agents, employees, or delegatees.\n(d) Paragraph (b) does not affect the validity of a provision that requires the promisor to provide or obtain insurance coverage for the promisee's vicarious liability, or liability imposed by warranty, arising out of the acts or omissions of the promisor.\n(e) Paragraph (b) does not apply to building and construction contracts for work within 50 feet of public or private railroads, or railroads regulated by the Federal Railroad Administration.\nIf:\n(a) a promisor agrees to provide specific types and limits of insurance; and\n(b) a claim arises within the scope of the specified insurance; and\n(c) the promisor did not obtain and keep in force the specified insurance;\nthen, as to that claim and regardless of section 337.02, the promisee shall have indemnification from the promisor to the same extent as the specified insurance.\nThe indemnification stated in subdivision 2 is not available if:\n(a) the specified insurance was not reasonably available in the market; and\n(b) the promisor so informed the other party to the agreement to insure before signing the agreement, or signed the agreement subject to a written exception as to the nonavailable insurance.\nIf:\n(1) a promisor agrees to provide specific types and limits of insurance; and\n(2) a claim arises within the scope of the specified insurance; and\n(3) the insurance provided by the promisor includes a self-insured retention or a deductible amount;\nthen, as to that claim and regardless of section 337.02, the promisee shall have indemnification from the promisor to the full extent of the deductible amount or self-insured retention.\nA promisor's obligation to provide specified insurance is not waived by either or both of the following:\n(1) a promisee's failure to require or insist upon certificates or other evidence of insurance;\n(2) a promisee's acceptance of a certificate or other evidence of insurance that shows a variance from the specified coverage.",
	"repealed": false
}