{
	"id": "373.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.041",
	"title": "373.041 POLICE-OPERATED BROADCASTING STATIONS.",
	"text": "A county may establish, construct, equip and maintain a radio broadcasting station, with land-fixed repeater stations and two-way communication mobile units as necessary, to be used for public safety purposes under the direction of the sheriff. The county may acquire land by gift, purchase or condemnation for use as a site or sites for the station or stations. The county shall exercise its powers under this subdivision in conformance with any statewide plan for a coordinated system of radio communications adopted by the Department of Public Safety after consultation with the professional communications officers representing law enforcement agencies involved in the plan. The Department of Public Safety shall adopt rules to implement the statewide plan.\nA county owning and maintaining a broadcasting station under subdivision 1 may, subject to the rules and regulations of the Federal Communications Commission, extend its facilities to any city located in the county, and to any adjoining county and any city in an adjoining county, upon application of its governing body to the county board requesting radio communication and service. All mobile radio equipment and apparatus for two-way communication used for the extended service shall be owned, maintained and serviced by the county owning the broadcasting station. Charges for the service extended to counties and municipalities shall be made on a cost-sharing basis.\nAll money received as charges for the service rendered under subdivision 2 shall be kept in an account designated the \"Sheriff Radio and Maintenance Account,\" shall not be transferred or apportioned to any other fund or account, and shall be used for no other purpose than the purchase of radio equipment and maintenance of radio equipment and apparatus.\nThe sheriff of the county owning the radio facilities shall broadcast all police dispatches and reports submitted which, in the opinion of the sheriff, have a reasonable relation to or connection with the apprehension of criminals, the prevention of crime and the maintenance of peace and order throughout the area serviced by the broadcasting station or stations.",
	"repealed": false
}