{
	"id": "473.399",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.399",
	"title": "473.399 TRANSIT WAYS; LIGHT RAIL TRANSIT AND COMMUTER RAIL IN THE METROPOLITAN AREA.",
	"text": "(a) The council must identify in its transportation policy plan those heavily traveled corridors where development of a transitway may be feasible and cost-effective. Modes of providing service in a transitway may include bus rapid transit, light rail transit, commuter rail, or other available systems or technologies that improve transit service.\n(b) After the completion of environmental studies and receipt of input from the governing body of each statutory and home rule charter city, county, and town in which a transitway is proposed to be constructed, the council must designate the locally preferred alternative transit mode with respect to the corridor.\n(c) The council shall ensure that any light rail transit facilities that are designated as the locally preferred alternative and that are to be constructed in the metropolitan area will be acquired, developed, owned, and capable of operation in an efficient, cost-effective, and coordinated manner in coordination with buses and other transportation modes and facilities.\n(d) Construction of light rail transit facilities in a particular transit corridor may not commence unless and until that mode is designated as the locally preferred alternative for that corridor by the council.\nThe commissioner of transportation and the Metropolitan Council shall ensure that light rail transit and commuter rail facilities are planned, designed, and implemented: (1) to move commuters and transit users into and out of, as well as within, the metropolitan area, and (2) to ensure that rail transit lines will interface with each other and other transportation facilities and services so as to provide a unified, integrated, and efficient multimodal transportation system.\nMS 1992 [Repealed, 1993 c 353 s 20]\nMS 1992 [Repealed, 1993 c 353 s 20]\nMS 2008 [Repealed, 2009 c 93 art 1 s 47]\nThe Metropolitan Council shall maintain in a centralized location on an Internet website, for each light rail transit line operated by the council and for each year of operation of the line:\n(1) financial data, including revenue by source and operating and capital expenses; and\n(2) ridership information, including ridership and passenger miles.",
	"repealed": false
}