{
	"id": "66A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.02",
	"title": "66A.02 APPLICABILITY OF BUSINESS CORPORATION STATUTES.",
	"text": "Chapter 302A shall apply to domestic mutual insurance companies except to the extent inconsistent with any provisions in this chapter or sections 60A.07, 66A.32, and 66A.33, or otherwise in conflict with any provisions in chapters 60A to 79A. Provisions of chapter 302A relating to share certificates, classes of shares, share values, or any other provisions relevant only to stock companies do not apply to mutual insurance companies.\nFor purposes of sections 66A.01 to 66A.07 and 66A.21, unless the context clearly suggests otherwise, \"domestic mutual insurance company\" is deemed to include domestic mutual insurance holding companies organized under section 66A.40 and \"member\" is deemed to include members of a domestic mutual insurance holding company as specified in section 66A.40, subdivision 1, paragraph (b). For purposes of section 60A.07, subdivisions 1, 1a, 1c, 1d, and 1e, a domestic mutual insurance holding company is deemed to be an insurance corporation.\nFor purposes of applying chapter 302A to domestic mutual insurance companies, members of a domestic mutual insurance company must be treated in the same manner as shareholders of a stock corporation, except as otherwise provided in this chapter. Every member of the mutual insurance company shall be deemed to hold one share of the company for purposes of applying provisions of chapter 302A relating to voting. Mutual insurance companies are not included in the definitions of \"closely held corporation,\" \"publicly held corporation,\" or \"issuing public corporation.\" The term \"distribution\" does not include dividends paid on participating policies issued by the mutual insurance company or any reorganized insurance company subsidiary in the case of a mutual insurance holding company.\nThe following provisions of chapter 302A do not apply to domestic mutual insurance companies: sections 302A.011, subdivisions 2, 6, 6a, 7, 10, 20, 21, 25, 26, 27, 28, 29, 31, 32, and 37 to 59; 302A.105; 302A.137; 302A.161, subdivision 19; 302A.201, subdivision 2; 302A.401 to 302A.429; 302A.433, subdivisions 1, paragraphs (a), (b), (c), and (e), and 2; 302A.437, subdivision 2; 302A.443; 302A.445, subdivisions 3 to 6; 302A.449, subdivision 7; 302A.453 to 302A.457; 302A.461; 302A.463; 302A.471 to 302A.473; 302A.553; 302A.601 to 302A.651; 302A.671 to 302A.675; 302A.682 to 302A.691; and 302A.701 to 302A.791. Those clauses of section 302A.111 that refer to any of the sections previously referenced in this subdivision do not apply to domestic mutual insurance companies. The following sections of chapter 302A are modified in their application to domestic mutual insurance companies in the manner indicated:\n(1) with regard to section 302A.133, the articles may be amended pursuant to section 302A.171 by the incorporators or by the board before the issuance of any policies by the company;\n(2) with regard to section 302A.135, subdivision 2, a resolution proposing an amendment to the certificate of authority must be filed with the corporate secretary no less than 30 days before the meeting to consider the proposed amendment;\n(3) with regard to section 302A.161, subdivision 19 of that section does not apply, except this must not be construed to limit the power of a mutual insurance company from issuing securities other than stock;\n(4) with regard to section 302A.201, the references in subdivision 1 of that section to \"subdivision 2\" and \"section 302A.457 \" do not apply;\n(5) with regard to section 302A.203, the board shall consist of no less than five directors;\n(6) with regard to section 302A.215, subdivisions 2 and 3 of that section only apply if the corporation's certificate of incorporation provides cumulative voting;\n(7) with regard to section 302A.433, subdivision 1 of that section, special meetings of the members may be called for any purpose or purposes at any time by a person or persons authorized in the articles or bylaws to call special meetings, and with regard to subdivision 3 of that section, special meetings must be held on the date and at the time and place fixed by a person or persons authorized by the articles or bylaws to call a meeting; and\n(8) with regard to section 302A.435, if the company complies substantially and in good faith with the notice requirements of section 302A.435, the company's failure to give any member or members the required notice does not impair the validity of any action taken at the members' meeting.",
	"repealed": false
}