{
	"id": "144E.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.31",
	"title": "144E.31 CORRECTION ORDER AND FINES.",
	"text": "(a) If the director finds that a licensee or education program has failed to comply with an applicable law or rule and the violation does not imminently endanger the public's health or safety, the director may issue a correction order to the licensee or education program.\n(b) The correction order shall state:\n(1) the conditions that constitute a violation of the law or rule;\n(2) the specific law or rule violated; and\n(3) the time allowed to correct the violation.\n(a) If the licensee or education program believes that the contents of the director's correction order are in error, the licensee or education program may ask the director to reconsider the parts of the correction order that are alleged to be in error.\n(b) The request for reconsideration must:\n(1) be in writing;\n(2) be delivered by certified mail;\n(3) specify the parts of the correction order that are alleged to be in error;\n(4) explain why they are in error; and\n(5) include documentation to support the allegation of error.\n(c) A request for reconsideration does not stay any provision or requirement of the correction order. The director's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\n(a) The director may order a fine concurrently with the issuance of a correction order, or after the licensee or education program has not corrected the violation within the time specified in the correction order.\n(b) A licensee or education program that is ordered to pay a fine shall be notified of the order by certified mail. The notice shall be mailed to the address shown on the application or the last known address of the licensee or education program. The notice shall state the reasons the fine was ordered and shall inform the licensee or training program of the right to a contested case hearing under chapter 14.\n(c) A licensee or education program may appeal the order to pay a fine by notifying the director by certified mail within 15 calendar days after receiving the order. A timely appeal shall stay payment of the fine until the director issues a final order.\n(d) A licensee or education program shall pay the fine assessed on or before the payment date specified in the director's order. If a licensee or education program fails to fully comply with the order, the director shall suspend the license or cancel approval until there is full compliance with the order.\n(e) Fines shall be assessed as follows:\n(1) $150 for violation of section 144E.123;\n(2) $400 for violation of sections 144E.06, 144E.07, 144E.101, 144E.103, 144E.121, 144E.125, 144E.265, 144E.285, and 144E.305;\n(3) $750 for violation of rules adopted under section 144E.16, subdivision 4, clause (8); and\n(4) $50 for violation of all other sections under this chapter or rules adopted under this chapter that are not specifically enumerated in clauses (1) to (3).\n(f) Fines collected by the director shall be deposited as nondedicated receipts in the general fund.\nThis section does not prohibit the director from suspending, revoking, placing conditions on, or refusing to renew a licensee's license or an education program's approval in addition to ordering a fine.",
	"repealed": false
}