{
	"id": "136A.1789",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1789",
	"title": "136A.1789 AVIATION DEGREE LOAN FORGIVENESS PROGRAM.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Qualified aircraft technician\" means an individual who (1) has earned an associate's or bachelor's degree preparing individuals to obtain an aviation mechanic's certificate from the Federal Aviation Administration from a postsecondary institution located in Minnesota, and (2) has obtained an aviation mechanic's certificate from the Federal Aviation Administration.\n(c) \"Qualified education loan\" means a government, commercial, or foundation loan used by an individual for actual costs paid for tuition and reasonable educational and living expenses related to the postsecondary education of the qualified aircraft technician or qualified pilot.\n(d) \"Qualified pilot\" means an individual who (1) has earned an associate's or bachelor's degree preparing individuals to obtain an airline transport pilot certificate from a postsecondary institution located in Minnesota, and (2) is in the process of obtaining or has obtained an airline transport pilot certificate.\n(a) An aviation degree loan forgiveness program account is established in the special revenue fund to provide qualified pilots and qualified aircraft technicians with financial assistance in repaying qualified education loans. The commissioner must use money from the account to establish and administer the aviation degree loan forgiveness program.\n(b) Money in the aviation degree loan forgiveness program account is appropriated to the commissioner for purposes of this section, does not cancel, and is available until expended.\n(a) To be eligible to participate in the loan forgiveness program under this section, an individual must:\n(1) be a qualified pilot or qualified aircraft technician;\n(2) have qualified education loans;\n(3) reside in Minnesota; and\n(4) submit an application to the commissioner in the form and manner prescribed by the commissioner.\n(b) An applicant selected to participate must sign a contract to agree to serve a five-year full-time service obligation according to subdivision 4. To complete the service obligation, the applicant must work full time in Minnesota as a qualified pilot or qualified aircraft technician. A participant must complete one year of service under this paragraph for each year the participant receives an award under this section.\n(a) Before receiving loan repayment disbursements and as requested, a participant must verify to the commissioner that the participant is employed in a position that fulfills the service obligation as required under subdivision 3, paragraph (b).\n(b) If a participant does not fulfill the required service obligation, the commissioner must collect from the participant the total amount paid to the participant under the loan forgiveness program plus interest at a rate established according to section 270C.40. The commissioner must deposit the money collected in the aviation degree loan forgiveness account. The commissioner must allow waivers of all or part of the money owed the commissioner as a result of a nonfulfillment penalty if emergency circumstances prevented fulfillment of the minimum service commitment.\n(a) The commissioner may select eligible applicants each year for participation in the aviation degree loan forgiveness program, within the limits of available funding. Applicants are responsible for securing their own qualified education loans.\n(b) For each year that the participant meets the eligibility requirements under subdivision 3, the commissioner must make annual disbursements directly to:\n(1) a selected qualified pilot of $5,000 or the balance of the participant's qualified education loans, whichever is less; and\n(2) a selected qualified aircraft technician of $3,000 or the balance of the participant's qualified education loans, whichever is less.\n(c) An individual may receive disbursements under this section for a maximum of five years.\n(d) The participant must provide the commissioner with verification that the full amount of the loan repayment disbursement received by the participant has been applied toward the designated qualified education loan. After each disbursement, verification must be received by the commissioner and approved before the next repayment disbursement is made.\n(e) If the participant receives a disbursement in the participant's fifth year of eligibility, the participant must provide the commissioner with verification that the full amount of the participant's final loan repayment disbursement was applied toward the designated qualified education loan. If a participant does not provide the verification as required under this paragraph within 12 months of receipt of the final disbursement, the commissioner must collect from the participant the total amount paid to the participant under the loan forgiveness program plus interest at a rate established according to section 270C.40. The commissioner must deposit the money collected in the aviation degree loan forgiveness program account.\nThe commissioner may adopt rules to implement this section.",
	"repealed": false
}