{
	"id": "309.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.52",
	"title": "309.52 STATEMENT REQUIREMENT.",
	"text": "No charitable organization, except as otherwise provided in section 309.515, shall solicit contributions from persons in this state by any means whatsoever unless, prior to any solicitation, there shall be on file with the attorney general upon forms provided by the attorney general, a registration statement containing, without limitation, the following information:\n(a) Legally established name.\n(b) Name or names under which it solicits contributions.\n(c) Form of organization.\n(d) Date and place of organization.\n(e) Address of principal office in this state, or, if none, the name and address of the person having custody of books and records within this state.\n(f) Names and addresses of, and total annual compensation paid to, officers, directors, trustees, and chief executive officer.\n(g) Federal and state tax exempt status.\n(h) Denial at any time by any governmental agency or court of the right to solicit contributions.\n(i) Date on which accounting year of the charitable organization ends.\n(j) General purposes for which organized.\n(k) General purposes for which contributions to be solicited will be used.\n(l) Methods by which solicitation will be made.\n(m) Copies of contracts between charitable organization and professional fundraisers relating to financial compensation or profit to be derived by the professional fundraisers. Where any such contract is executed after filing of the registration statement, a copy thereof shall be filed within seven days of the date of execution.\n(n) Board, group or individual having final discretion as to the distribution and use of contributions received.\n(o) The amount of total contributions received during the accounting year last ended.\n(p) Such other information as the attorney general may by rule or order require to promote fairness of the solicitation and to assure full and fair disclosure of all material information to the attorney general.\nA charitable organization whose total contributions received during any accounting year are in excess of $25,000, exclusive of the direct cost of prizes given to the public by the charitable organization in connection with lawful gambling conducted in compliance with chapter 349, shall file a registration statement with the attorney general within 30 days after the date on which the organization's total contributions exceeded $25,000, exclusive of the direct cost of prizes given to the public by the charitable organization in connection with lawful gambling conducted in compliance with chapter 349. The registration shall exist unless revoked by a court of competent jurisdiction, or the attorney general, or as provided in subdivision 7. This subdivision shall not apply to a charitable organization which had filed a registration statement pursuant to this section for the accounting year last ended or to organizations described in section 309.515, subdivision 1.\nThe registration statement filed by a charitable organization shall include a registration fee of $25 and a financial statement of the organization's operation for its most recent 12 months period immediately preceding the filing of the first registration statement.\nThe registration statement shall be executed by any two duly constituted officers of the charitable organization who shall acknowledge that it was executed pursuant to resolution of the board of directors or trustees, or if there be no such board, then by its managing group which has approved the content of the registration statement, and shall certify that the board of directors or trustees, or if there be no such board, its managing group, have assumed, and will continue to assume responsibility for determining matters of policy and have supervised, and will continue to supervise the finances of the charitable organization.\nWhere any chapter, branch, area office or similar affiliate of a charitable organization is supervised and controlled by a parent organization located within or outside the state, the affiliate may file a registration statement on behalf of the parent organization in addition to or as part of its own registration statement, or the parent organization may file a registration statement on behalf of the affiliate in addition to or as part of its own registration statement.\n[Repealed, 1978 c 601 s 29]\n[Repealed, 1978 c 601 s 29]\nIn no event shall the registration of a charitable organization continue in effect after the date such organization should have filed, but has failed to file an annual report, including the payment of all required fees, in accordance with the requirements of section 309.53, and such organization, if in default under such section, shall not be eligible to file a new registration statement until it shall have filed the required annual report with the attorney general.\n[Repealed, 1978 c 601 s 29]\nA charitable organization that is organized and operated primarily for the purpose of offering and paying rewards for information leading to the apprehension or conviction of criminal suspects and that satisfies subdivision 10 shall not be required to include in its registration statement the information described in subdivision 1, clauses (f) and (o), or the financial statement described in subdivision 2, and notwithstanding subdivision 3, its registration statement may be executed by the mayor, city manager, or chief of police of the municipality, if any, with which the organization is primarily associated.\nSubdivision 9 applies to an organization whose financial statement described in subdivision 2 has been audited and reported on by a certified public accountant and made available with the accountant's report for inspection by its members and by the mayor, city manager, or chief of police of the municipality, if any, with which the organization is primarily associated, and whose registration statement contains a certificate of compliance with this subdivision.",
	"repealed": false
}