{
	"id": "16C.144",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.144",
	"title": "16C.144 GUARANTEED ENERGY-SAVINGS PROGRAM.",
	"text": "(a) The following definitions apply to this section.\n(b) \"Utility\" means electricity, natural gas, or other energy resource, water, and wastewater.\n(c) \"Utility cost savings\" means the difference between the utility costs after installation of the utility cost-savings measures pursuant to the guaranteed energy-savings agreement and the baseline utility costs after baseline adjustments have been made.\n(d) \"Baseline\" means the preagreement utilities, operations, and maintenance costs.\n(e) \"Utility cost-savings measure\" means a measure that produces utility cost savings or operation and maintenance cost savings.\n(f) \"Operation and maintenance cost savings\" means a measurable difference between operation and maintenance costs after the installation of the utility cost-savings measures pursuant to the guaranteed energy-savings agreement and the baseline operation and maintenance costs after inflation adjustments have been made. Operation and maintenance costs savings shall not include savings from in-house staff labor.\n(g) \"Guaranteed energy-savings agreement\" means an agreement for the installation of one or more utility cost-savings measures that includes the qualified provider's guarantee as required under subdivision 2.\n(h) \"Baseline adjustments\" means adjusting the utility cost-savings baselines annually for changes in the following variables:\n(1) utility rates;\n(2) number of days in the utility billing cycle;\n(3) square footage of the facility;\n(4) operational schedule of the facility;\n(5) facility temperature set points;\n(6) weather; and\n(7) amount of equipment or lighting utilized in the facility.\n(i) \"Inflation adjustment\" means adjusting the operation and maintenance cost-savings baseline annually for inflation.\n(j) \"Project financing\" means any type of financing including but not limited to lease, lease purchase, installment agreements, or bonds issued by an entity, other than the state, with authority to issue bonds, obligating the state to make regular payments to satisfy the costs of the utility cost-savings measures until the final payment.\n(k) \"Qualified provider\" means a person or business experienced in the design, implementation, and installation of utility cost-savings measures.\n(l) \"Engineering report\" means a report prepared by a professional engineer licensed by the state of Minnesota summarizing estimates of all costs of installations, modifications, or remodeling, including costs of design, engineering, installation, maintenance, repairs, and estimates of the amounts by which utility and operation and maintenance costs will be reduced.\n(m) \"Capital cost avoidance\" means money expended by a state agency to pay for utility cost-savings measures with a guaranteed savings agreement so long as the measures that are being implemented to achieve the utility, operation, and maintenance cost savings are a significant portion of an overall project as determined by the commissioner.\n(n) \"Guaranteed energy-savings program guidelines\" means policies, procedures, and requirements of guaranteed savings agreements established by the Department of Administration.\nThe commissioner may enter into a guaranteed energy-savings agreement with a qualified provider if:\n(1) the qualified provider is selected through a competitive process in accordance with the guaranteed energy-savings program guidelines within the Department of Administration;\n(2) the qualified provider agrees to submit an engineering report prior to the execution of the guaranteed energy-savings agreement. The cost of the engineering report may be considered as part of the implementation costs if the commissioner enters into a guaranteed energy-savings agreement with the provider;\n(3) the term of the guaranteed energy-savings agreement shall not exceed 25 years from the date of final installation;\n(4) the commissioner finds that the amount the state would spend, less the amount contributed for capital cost avoidance, on the utility cost-savings measures recommended in the engineering report will not exceed the amount to be saved in utility operation and maintenance costs over 25 years from the date of implementation of utility cost-savings measures;\n(5) the qualified provider provides a written guarantee that the annual utility, operation, and maintenance cost savings during the term of the guaranteed energy-savings agreement will meet or exceed the annual payments due under the project financing. The qualified provider shall reimburse the state for any shortfall of guaranteed utility, operation, and maintenance cost savings; and\n(6) the qualified provider gives a sufficient bond in accordance with section 574.26 to the commissioner for the faithful implementation and installation of the utility cost-savings measures.\nThe commissioner may enter into project financing with any party for the implementation of utility cost-savings measures in accordance with the guaranteed energy-savings agreement. The term of the project financing shall not exceed 25 years from the date of final installation. The project financing is assignable in accordance with terms approved by the commissioner of management and budget.\nThe affected state agency may contribute funds for capital cost avoidance for guaranteed energy-savings agreements. Use of capital cost avoidance is subject to the guaranteed energy-savings program guidelines within the Department of Administration.\nFor each guaranteed energy-savings agreement entered into, the commissioner of administration shall contract with an independent third party to evaluate the cost-effectiveness of each utility cost-savings measure implemented to ensure that such measures were the least-cost measures available. For the purposes of this section, \"independent third party\" means an entity not affiliated with the qualified provider, that is not involved in creating or providing conservation project services to that provider, and that has expertise (or access to expertise) in energy-savings practices.\n[Repealed by amendment, 2005 c 156 art 2 s 24]",
	"repealed": false
}