{
	"id": "18J.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/18J.04",
	"title": "18J.04 INSPECTION, SAMPLING, ANALYSIS.",
	"text": "The commissioner, upon presentation of official department credentials, must be granted immediate access at reasonable times to sites where a person manufactures, distributes, uses, handles, disposes of, stores, or transports seeds, plants, grain, household goods, general merchandise, produce, or other living or nonliving products or other objects regulated under chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules.\n(a) The commissioner may enter sites for:\n(1) inspection of inventory and equipment for the manufacture, storage, handling, distribution, disposal, or any other process regulated under chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules;\n(2) sampling of sites, seeds, plants, products, grain, household goods, general merchandise, produce, or other living or nonliving objects that are manufactured, stored, distributed, handled, or disposed of at those sites and regulated under chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules;\n(3) inspection of records related to the manufacture, distribution, storage, handling, or disposal of seeds, plants, products, grain, household goods, general merchandise, produce, or other living or nonliving objects regulated under chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules;\n(4) investigating compliance with chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules; or\n(5) other purposes necessary to implement chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules.\n(b) The commissioner may enter any public or private premises during or after regular business hours without notice of inspection when a suspected violation of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules may threaten public health or the environment.\n(a) The commissioner shall provide the owner, operator, or agent in charge with a receipt describing any samples obtained. If requested, the commissioner shall split any samples obtained and provide them to the owner, operator, or agent in charge. If an analysis is made of the samples, a copy of the results of the analysis must be furnished to the owner, operator, or agent in charge within 30 days after an analysis has been performed. If an analysis is not performed, the commissioner must notify the owner, operator, or agent in charge within 30 days of the decision not to perform the analysis.\n(b) The sampling and analysis must be done according to methods provided for under applicable provisions of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules. In cases not covered by those sections and methods or in cases where methods are available in which improved applicability has been demonstrated the commissioner may adopt appropriate methods from other sources.\n(a) A person who believes that a violation of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules has occurred may request an inspection by giving notice to the commissioner of the violation. The notice must be in writing, state with reasonable particularity the grounds for the notice, and be signed by the person making the request.\n(b) If after receiving a notice of violation the commissioner reasonably believes that a violation has occurred, the commissioner shall make a special inspection in accordance with the provisions of this section as soon as practicable, to determine if a violation has occurred.\n(c) An inspection conducted pursuant to a notice under this subdivision may cover an entire site and is not limited to the portion of the site specified in the notice. If the commissioner determines that reasonable grounds to believe that a violation occurred do not exist, the commissioner must notify the person making the request in writing of the determination.\nAfter a refusal, or an anticipated refusal based on a prior refusal, to allow entrance on a prior occasion by an owner, operator, or agent in charge to allow entry as specified in this section, the commissioner may apply for an order in the district court in the county where a site is located, that compels a person with authority to allow the commissioner to enter and inspect the site.\n(a) The cost of reinspection and reinvestigation may be assessed by the commissioner if the person subject to an order of the commissioner does not comply with the order in a reasonable time as provided in the order.\n(b) The commissioner may enter an order for recovery of the inspection and investigation costs.\n(a) In making inspections under this chapter, the commissioner may administer oaths, certify official acts, issue subpoenas to take and cause to be taken depositions of witnesses, and compel the attendance of witnesses and production of papers, books, documents, records, and testimony.\n(b) If a person fails to comply with a subpoena, or a witness refuses to produce evidence or to testify to a matter about which the person may be lawfully questioned, the district court shall, on application of the commissioner, compel obedience proceedings for contempt, as in the case of disobedience of the requirements of a subpoena issued by the court or a refusal to testify in court.",
	"repealed": false
}