{
	"id": "148.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.89",
	"title": "148.89 DEFINITIONS.",
	"text": "For the purposes of sections 148.88 to 148.98, the following terms have the meanings given them.\n\"Board of Psychology\" or \"board\" means the board established under section 148.90.\n\"Client\" means a direct recipient of psychological services within the context of a professional relationship that may include a child, adolescent, adult, couple, family, group, organization, community, or other entity. The client may be the person requesting the psychological services or the direct recipient of the services.\n\"Credentialed\" means having a license, certificate, charter, registration, or similar authority to practice in an occupation regulated by a governmental board or agency.\n\"Designated supervisor\" means a qualified individual who is identified and assigned by the primary supervisor to provide additional supervision and training to an individual who is obtaining required predegree supervised professional experience or postdegree supervised psychological employment.\n\"Direct services\" means the delivery of preventive, diagnostic, assessment, or therapeutic intervention services where the primary purpose is to benefit a client who is the direct recipient of the service.\n\"Full-time employment\" means a minimum of 35 clock hours per week.\n\"Independent practice\" means the practice of psychology without supervision.\n\"Jurisdiction\" means the United States, United States territories, or Canadian provinces or territories.\n\"Licensee\" means a person who is licensed by the board.\n\"Provider\" or \"provider of services\" means any individual who is regulated by the board.\n\"Primary supervisor\" means a psychologist licensed in Minnesota or other qualified individual who provides the principal supervision to an individual who is obtaining required predegree supervised professional experience or postdegree supervised psychological employment.\n\"Practice of psychology\" means the observation, description, evaluation, interpretation, prediction, or modification of human behavior by the application of psychological principles, methods, or procedures for the purpose of preventing, eliminating, evaluating, assessing, or predicting symptomatic, maladaptive, or undesired behavior; applying psychological principles in legal settings; and enhancing interpersonal relationships, work, life and developmental adjustment, personal and organizational effectiveness, behavioral health, and mental health. The practice of psychology includes, but is not limited to, the following services, regardless of whether the provider receives payment for the services:\n(1) psychological research and teaching of psychology subject to the exemptions in section 148.9075;\n(2) psychological testing and the evaluation or assessment of personal characteristics, such as intelligence, personality, cognitive, physical and emotional abilities, skills, interests, aptitudes, and neuropsychological functioning;\n(3) counseling, psychoanalysis, psychotherapy, hypnosis, biofeedback, and behavior analysis and therapy;\n(4) diagnosis, treatment, and management of mental or emotional disorders or disabilities, substance use disorders, disorders of habit or conduct, and the psychological aspects of physical illness, accident, injury, or disability;\n(5) psychoeducational evaluation, therapy, and remediation;\n(6) consultation with physicians, other health care professionals, and clients regarding available treatment options, including medication, with respect to the provision of care for a specific client;\n(7) provision of direct services to individuals or groups for the purpose of enhancing individual and organizational effectiveness, using psychological principles, methods, and procedures to assess and evaluate individuals on personal characteristics for individual development or behavior change or for making decisions about the individual; and\n(8) supervision and consultation related to any of the services described in this subdivision.\n[Repealed, 1996 c 424 s 24]\n[Repealed, 1996 c 424 s 24]\n[Repealed, 1996 c 424 s 24]\n\"Telesupervision\" means the clinical supervision of psychological services through a synchronous audio and video format where the supervisor is not physically in the same facility as the supervisee.",
	"repealed": false
}