{
	"id": "354B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.23",
	"title": "354B.23 CONTRIBUTIONS.",
	"text": "(a) Except for a participant described under paragraph (b), the member contribution rate for participants in the individual retirement account plan is equal to the coordinated employee contribution rate in section 354.42, subdivision 2.\n(b) The member contribution rate is the rate described in paragraph (c) for a participant in the individual retirement account plan who:\n(1) achieved tenure or its equivalent at a Minnesota state college or university before July 1, 2018; or\n(2) is an employee in an eligible unclassified administrative position, is not a faculty member, and first contributed to the individual retirement account plan before July 1, 2018.\n(c) The member contribution rate for a participant described in paragraph (b) is the following percentage of salary:\nAfter June 30, 2024, the member contribution rate is the rate specified in paragraph (a).\nMember contributions must be made by payroll deduction during each pay period.\nThe employer contribution rate on behalf of participants in the individual retirement account plan is 8.75 percent of salary.\nThe employer contribution must be made by the employing unit of a plan participant during each pay period. The employer contribution must be made from the available revenue sources of the employing unit.\n(a) If the employing unit that employs a plan participant fails to deduct the member contribution from the participant's salary and a period of less than 60 days from the date on which the deduction should have been made has elapsed, the employing unit must obtain the omitted member deduction by an additional payroll deduction during the pay period next following the discovery of the omission.\n(b) If the employing unit of a plan participant fails to deduct the member contribution from the participant's salary and that omission continues for at least 60 days from the date on which the deduction should have been made, the employing unit must pay the amount representing the omitted member contribution, and the full required employer contribution, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually. The contributions and any interest must be made within one year of the date on which the omission was discovered.\nWhen contributions to the plan exceed limits imposed by federal law or regulation, the excess employee contributions must be returned to the employee and the excess employer contributions must be reallocated in accordance with section 415 of the federal Internal Revenue Code, as amended, and the applicable federal regulations and revenue rulings.\n(a) Notwithstanding any provisions of chapter 354 to the contrary, a former member of the Teachers Retirement Association who has less than three years of allowable service credit under section 354.05, subdivision 13, and who is a member of the individual retirement account plan may elect to transfer to the plan an amount equal to the refund that the person could have received under section 354.49, subdivision 2, if the person had been eligible to receive a refund.\n(b) The transfer must be made from the Teachers Retirement Association directly to the individual retirement account plan and credited to the appropriate account.\n(c) No amount under this subdivision may be paid directly to the former Teachers Retirement Association member.\n(d) The election of this transfer must be made on a form prescribed by the executive director of the Teachers Retirement Association, after consultation with the plan administrator.",
	"repealed": false
}