{
	"id": "62Q.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.33",
	"title": "62Q.33 LOCAL GOVERNMENT PUBLIC HEALTH FUNCTIONS.",
	"text": "The legislature finds that the local government public health functions of community assessment, policy development, and assurance of service delivery are essential elements in consumer protection and in achieving the objectives of health care reform in Minnesota. The legislature further finds that the site-based and population-based services provided by state and local health departments are a critical strategy for the long-term containment of health care costs. The legislature further finds that without adequate resources, the local government public health system will lack the capacity to fulfill these functions in a manner consistent with the needs of a reformed health care delivery system.\nThe commissioner of health, in consultation with the State Community Health Services Advisory Committee and the commissioner of human services, and representatives of local health departments, county government, a municipal government acting as a community health board, area Indian health services, health care providers, and citizens concerned about public health, shall coordinate the process for defining implementation and financing responsibilities of the local government core public health functions. The commissioner shall submit recommendations and an initial and final report on local government core public health functions according to the timeline established in subdivision 5.\n(a) The report required by subdivision 2 must describe the local government core public health functions of: assessment of community health needs; goal-determination, public policy, and program development for addressing these needs; and assurance of service availability and accessibility to meet community health goals and needs. The report must further describe activities for implementation of these functions that are the continuing responsibility of the local government public health system, taking into account the ongoing reform of the health care delivery system.\n(b) The activities to be defined in terms of the local government core public health functions include, but are not limited to:\n(1) consumer protection and advocacy;\n(2) targeted outreach and linkage to personal services;\n(3) health status monitoring and disease surveillance;\n(4) investigation and control of diseases and injuries;\n(5) protection of the environment, work places, housing, food, and water;\n(6) laboratory services to support disease control and environmental protection;\n(7) health education and information;\n(8) community mobilization for health-related issues;\n(9) training and education of public health professionals;\n(10) public health leadership and administration;\n(11) emergency medical services;\n(12) violence prevention; and\n(13) other activities that have the potential to improve the health of the population or special needs populations and reduce the need for or cost of health care services.\nThe recommendations required by subdivision 2 shall include:\n(1) a definition of minimum outcomes for implementing core public health functions, including a local ombudsperson under the assurance of services function;\n(2) the identification of counties and applicable cities with public health programs that need additional assistance to meet the minimum outcomes;\n(3) a budget for supporting all functions needed to achieve the minimum outcomes, including the local ombudsperson assurance of services function;\n(4) an analysis of the costs and benefits expected from achieving the minimum outcomes;\n(5) strategies for improving local government public health functions throughout the state to meet the minimum outcomes including: (i) funding distribution for local government public health functions necessary to meet the minimum outcomes; and (ii) strategies for the financing of personal health care services through the health plan companies and identifying appropriate mechanisms for the delivery of these services; and\n(6) a recommended level of dedicated funding for local government public health functions in terms of a percentage of total health service expenditures by the state or in terms of a per capita basis, including methods of allocating the dedicated funds to local government. Funding recommendations must be broad-based and must consider all financial resources.\n(a) MS 2000 [Obsolete]\n(b) By January 15, 1997, and by January 15 of each odd-numbered year thereafter, the commissioner shall present to the legislature an updated report and recommendations.",
	"repealed": false
}