{
	"id": "504B.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.285",
	"title": "504B.285 EVICTION ACTIONS; GROUNDS; RETALIATION DEFENSE; COMBINED ALLEGATIONS.",
	"text": "(a) The person entitled to the premises may recover possession by eviction when:\n(1) any person holds over real property:\n(i) after a sale of the property on an execution or judgment;\n(ii) after the expiration of the time for redemption on foreclosure of a mortgage, or after termination of contract to convey the property; or\n(iii) after the expiration of the time for redemption on a real estate tax judgment sale;\n(2) any person holds over real property after termination of the time for which it is demised or leased to that person or to the persons under whom that person holds possession, contrary to the conditions or covenants of the lease or agreement under which that person holds, or after any rent becomes due according to the terms of such lease or agreement; or\n(3) any tenant at will holds over after the termination of the tenancy by notice to quit.\n(b) A landlord may not commence an eviction action against a tenant or authorized occupant solely on the basis that the tenant or authorized occupant has been the victim of any of the acts listed in section 504B.206, subdivision 1, paragraph (a). A landlord may not commence an eviction action against a residential tenant who has terminated a lease as provided in section 504B.206. Nothing in this paragraph should be construed to prohibit an eviction action based on a breach of the lease or where a tenant has provided the written notice under section 504B.206, subdivision 1, but failed to vacate on or before the date provided in that notice. A landlord violating this paragraph is liable to the tenant for reasonable attorney fees and costs incurred by the tenant for obtaining an expungement as provided under section 484.014, subdivision 3.\n(a) With respect to residential real property or a dwelling where the person holding the residential real property or dwelling after the expiration of the time for redemption on foreclosure of a mortgage was a tenant during the redemption period under a lease of any duration, and the lease began after the date the mortgage was executed, but prior to the expiration of the time for redemption, the immediate successor in interest must provide at least 90 days' written notice to vacate, given no sooner than the date of the expiration of the time for redemption, and effective no sooner than 90 days after the date of the expiration of the time for redemption, provided that the tenant pays the rent and abides by all terms of the lease.\n(b) With respect to residential real property or a dwelling where the term of a bona fide lease extends more than 90 days beyond the date of the expiration of the time for redemption, the immediate successor in interest must allow the tenant to occupy the premises until the end of the remaining term of the lease, and provide at least 90 days' written notice to vacate, effective no sooner than the date the lease expires, provided that the tenant pays the rent and abides by all terms of the lease, except if the immediate successor in interest or an immediate subsequent bona fide purchaser will occupy the unit as the primary residence, the immediate successor in interest must provide at least 90 days' written notice to vacate, given no sooner than the date of the expiration of the time for redemption, effective no sooner than 90 days after the date of the expiration of the time for redemption, provided that the tenant pays the rent and abides by all terms of the lease.\nFor purposes of this section, a \"bona fide lease\" means:\n(1) the mortgagor or the child, spouse, or parent of the mortgagor is not the tenant;\n(2) the lease or tenancy was the result of an arm's-length transaction; and\n(3) the lease or tenancy requires the receipt of rent that is not substantially less than fair market rent for the property or the unit's rent is reduced or subsidized by a federal, state, or local subsidy.\n(c) With respect to residential real property or a dwelling involving a tenancy subject to section 8 of the United States Housing Act of 1937, as amended, where the term of the lease extends more than 90 days beyond the date of the expiration of the time for redemption, the immediate successor in interest must allow the tenant to occupy the premises until the end of the remaining term of the lease and provide at least 90 days' written notice to vacate, effective no sooner than the date the lease expires, provided that the tenant pays the rent and abides by all terms of the lease, except if the immediate successor in interest will occupy the unit as the primary residence, the immediate successor in interest must provide at least 90 days' written notice to vacate, given no sooner than the date of the expiration of the time for redemption, effective no sooner than 90 days after the date of the expiration of the time for redemption, provided that the tenant pays the rent and abides by all terms of the lease.\nThe person entitled to the premises may recover possession by eviction when any person holds over real property after termination of contract to convey the property, provided that if the person holding the real property after the expiration of the time for termination was a tenant during the termination period under a lease of any duration and the lease began after the date the contract for deed was executed but prior to the expiration of the time for termination, and the person has received:\n(1) at least two months' written notice to vacate no sooner than one month after the expiration of the time for termination, provided that the tenant pays the rent and abides by all terms of the lease; or\n(2) at least two months' written notice to vacate no later than the date of the expiration of the time for termination, which notice shall also state that the sender will hold the tenant harmless for breaching the lease by vacating the premises if the contract is reinstated.\nMS 2012 [Repealed, 2013 c 100 s 6]\nIt is a defense to an action for recovery of premises following the alleged termination of a tenancy by notice to quit for the defendant to prove by a fair preponderance of the evidence that:\n(1) the alleged termination was intended in whole or part as a penalty for the defendant's good faith attempt to secure or enforce rights under a lease or contract, oral or written, under the laws of the state or any of its governmental subdivisions, or of the United States; or\n(2) the alleged termination was intended in whole or part as a penalty for the defendant's good faith report to a governmental authority of the plaintiff's violation of a health, safety, housing, or building code or ordinance.\nIf the notice to quit was served within 90 days of the date of an act of the tenant coming within the terms of clause (1) or (2) the burden of proving that the notice to quit was not served in whole or part for a retaliatory purpose shall rest with the plaintiff.\nIn any proceeding for the recovery of premises upon the ground of nonpayment of rent, it is a defense if the tenant establishes by a preponderance of the evidence that the plaintiff increased the tenant's rent or decreased the services as a penalty in whole or part for any lawful act of the tenant as described in subdivision 2, providing that the tenant tender to the court or to the plaintiff the amount of rent due and payable under the tenant's original obligation.\n(a) Nothing contained in subdivisions 2 and 3 limits the right of the landlord pursuant to the provisions of subdivision 1 to terminate a tenancy for a violation by the tenant of a lawful, material provision of a lease or contract, whether written or oral, or to hold the tenant liable for damage to the premises caused by the tenant or a person acting under the tenant's direction or control.\n(b) If a landlord files an eviction action for failure to pay for utility service in a shared-metered building, the court:\n(1) if the tenant has filed a complaint involving natural gas or electricity utility service with the Public Utilities Commission under section 216B.024, must stay the action until the commission has made a final determination and must not require the defendant to pay any amount of money into court, post a bond, make a payment directly to a landlord, or by any other means post security for any purpose prior to final disposition of the complaint pursuant to section 216B.172, subdivisions 3 and 4. If the action proceeds following the final disposition of complaint, the court must not require the tenant to post any amount of money into court, post a bond, make a payment directly to a landlord, or by any other means post security for utility charges;\n(2) if the tenant has not filed a complaint involving natural gas or electric utility service with the Public Utilities Commission under section 216B.024 or the eviction action is for nonpayment of water and sewer utility charges, and the tenant meets the requirements for a court fee waiver under section 563.01, must not require the tenant to post any amount of money into court, post a bond, make a payment directly to a landlord, or by any other means post security for utility charges; and\n(3) if the tenant has not filed a complaint involving natural gas or electric utility service with the Public Utilities Commission under section 216B.024, and the tenant does not meet the requirements for a court fee waiver under section 563.01, may, in the court's discretion, require the tenant to pay an amount of money or post security as the court deems appropriate for prospective utility charges only.\n(c) A court must not require a tenant to post rent as a condition of a tenant asserting an affirmative claim or defense, or a counterclaim related to landlord utility billings or practices.\n(d) For the purposes of this section:\n(1) \"shared-metered residential building\" has the meaning given in section 504B.216, subdivision 1, paragraph (e); and\n(2) \"utility service\" has the meaning given in section 504B.216, subdivision 1, paragraph (i).\n(a) An action for recovery of the premises may combine the allegation of nonpayment of rent and the allegation of material violation of the lease, which shall be heard as alternative grounds.\n(b) If the landlord does not prevail in proving material violation of the lease, and the landlord has also alleged that rent is due, the tenant shall be permitted to present defenses to the court that the rent is not owing. The tenant shall be given up to seven days of additional time to pay any rent determined by the court to be due.",
	"repealed": false
}