{
	"id": "270C.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.13",
	"title": "270C.13 TAX INCIDENCE REPORTS.",
	"text": "(a) The commissioner shall report to the legislature on the overall incidence of the income tax, sales and excise taxes, and property tax.\n(b) The commissioner must submit the report:\n(1) by March 1, 2021; and\n(2) by March 1, 2024, and each even-numbered year thereafter.\n(c) The report shall present information on the distribution of the tax burden as follows: (1) for the overall income distribution, using a systemwide incidence measure such as the Suits index or other appropriate measures of equality and inequality; (2) by income classes, including at a minimum deciles of the income distribution; and (3) by other appropriate taxpayer characteristics.\n(d) The commissioner may request information from any state officer or agency to assist in carrying out this section. The state officer or agency shall provide the data requested to the extent permitted by law.\nAt the request of the chair of the house of representatives Tax Committee or the senate Committee on Taxes and Tax Laws, the commissioner shall prepare an incidence impact analysis of a bill or a proposal to change the tax system which increases, decreases, or redistributes taxes by more than $20,000,000. To the extent data is available on the changes in the distribution of the tax burden that are affected by the bill or proposal, the analysis shall report on the incidence effects that would result if the bill were enacted. The report may present information using systemwide measures, such as Suits or other similar indexes, by income classes, taxpayer characteristics, or other relevant categories. The report may include analyses of the effect of the bill or proposal on representative taxpayers. The analysis must include a statement of the incidence assumptions that were used in computing the burdens.\nThe incidence analyses shall use the broadest measure of economic income for which reliable data is available.",
	"repealed": false
}