{
	"id": "51A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.20",
	"title": "51A.20 RESERVE ACCOUNTS; SURPLUS AND UNDIVIDED PROFITS.",
	"text": "Every association shall set up and maintain the reserves required by, and may set up and maintain additional reserves permitted by, sections 51A.01 to 51A.57. On or before the closing date of each accounting period, after payment of or provision for all expenses, each association shall transfer to a separate reserve account, which shall be set up and maintained for the sole purpose of absorbing losses (termed in sections 51A.01 to 51A.57 \"general reserve\"), an amount equal to at least ten percent of its net income or, in the case of an association which at the close of the period has assets in excess of $20,000,000 or which has done business as a savings association in this state for more than 20 years, the greater of ten percent of its net income or an amount equal to the difference between four percent of its assets, excluding liquid assets, at the end of the period and the amount of its general reserve at the beginning of the period, until the general reserve is equal to at least ten percent of the savings liability. Upon advance written application of an association, the commissioner has sole discretionary authority to approve the transfer to the general reserve of a lesser amount for the period; provided, that the reduction shall not be greater than that of federal regulations. In the event that any credit to the general reserve is made following July 1, 1969, in excess of the minimum requirement, the dollar amount of any excess may be carried over as a credit toward the minimum requirement of any subsequent period. If and whenever the general reserve is not equal to at least ten percent of its savings liability, credits, as above provided, shall again be made to the general reserve until it shall again be equal to at least ten percent of its savings liability. The board of directors may make additional transfers to surplus or other reserve accounts. Interest receivable on all loans shall be accrued monthly and an evaluation account shall be maintained equivalent to all accrued and uncollected interest. On or before each closing date, after payment or provision for all expenses and appropriate transfers to reserves, the remainder of net income for the period shall be credited to the undivided profits account.\nAt the end of each dividend period, after deducting all necessary expenses and losses, all of the remaining net profits for the period shall be set aside as a surplus fund provided the surplus fund of the association is not equal to at least 25 percent of outstanding capital stock. If the surplus fund is equal to or exceeds 25 percent of outstanding capital stock, ten percent of the remaining net profits for the period shall be set aside as a surplus fund until it equals 50 percent of the capital stock. The directors may then declare a dividend of so much of the remainder as they may deem expedient, subject to the commissioner's approval.",
	"repealed": false
}