{
	"id": "270B.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.12",
	"title": "270B.12 DISCLOSURE TO STATE, FEDERAL, AND COUNTY AUTHORITIES.",
	"text": "Returns and return information may be open to inspection by or disclosure to the Internal Revenue Service, the Multistate Tax Commission, or to any state agency, body, or commission, or its legal representatives, that is charged under the laws of that state with the responsibility for administration of state tax laws. Inspection or disclosure is permitted to the extent that the state agency, body, or commission gives similar rights of inspection or disclosure to officials of this state. The commissioner may enter into an agreement with the Internal Revenue Service or another state agency, body, or commission outlining procedures to implement the exchange of information under this section, but an agreement may provide for the disclosure of data only to the extent allowed under this section. Inspection or disclosure is allowed only for the purpose of and to the extent necessary for the administration of tax laws.\nSales or use tax returns and return information are open to inspection by or disclosure to the taxing officials of any local unit of government of the state of Minnesota that has a local sales or use tax, for the purpose of and to the extent necessary for the administration of the local sales or use tax.\nInspections and disclosures permitted under subdivisions 1, 2, and 10 are allowed only upon written request in a form prescribed by the commissioner and may be made only to the representatives of the agency, body, or commission named in the written request as the individuals who are to inspect or receive the returns or return information on behalf of the agency, body, or commission.\nThe commissioner may disclose return information to the Department of Public Safety for the purpose of and to the extent necessary to administer sections 270C.725 and 403.16 to 403.162.\nThe commissioner may disclose return information to the Office of Cannabis Management for the purpose of and to the extent necessary to administer section 270C.726.\nDisclosure of returns and return information received by the commissioner from the Internal Revenue Service or another state or received by the Internal Revenue Service or another state from the commissioner is governed by the law applicable to the Internal Revenue Service or state that more stringently protects the information from disclosure.\nReturns and return information shall be open to inspection by or disclosure to an employee or agent of the Department of Revenue and the attorney general only for the purpose of and to the extent necessary to administer tax laws.\n(a) The commissioner of revenue may disclose to the director of the State Lottery the amount of delinquent state taxes, or debt as defined in section 270A.03, subdivision 5, of a winner of a lottery prize of $600 or more, to the extent necessary to administer section 349A.08, subdivision 8.\n(b) The commissioner of revenue may disclose to the director of the State Lottery that a retailer owes $500 or more in delinquent taxes as defined in section 270C.72, to the extent necessary to administer section 349A.06, subdivision 2.\nThe commissioner may disclose names and Social Security or individual taxpayer identification numbers of individuals who have applied for both homestead classification under section 273.13 and a renter's credit under section 290.0693 for the purpose of and to the extent necessary to administer section 290A.25.\n(a) If, as a result of an audit, the commissioner determines that a person is a Minnesota nonresident or part-year resident for income tax purposes, the commissioner may disclose the person's name, address, and Social Security number to the assessor of any political subdivision in the state, when there is reason to believe that the person may have claimed or received homestead property tax benefits for a corresponding assessment year in regard to property apparently located in the assessor's jurisdiction.\n(b) To the extent permitted by section 273.124, subdivision 1, paragraph (a), the Department of Revenue may verify to a county assessor whether an individual who is requesting or receiving a homestead classification has filed a Minnesota income tax return as a resident for the most recent taxable year for which the information is available.\nSales and use tax returns and return information are open to inspection by or disclosure to the taxing officials of any Indian tribal government in Minnesota for the purpose of and to the extent necessary for the administration of any tax agreement entered into between the state and the Indian tribal government pursuant to section 270C.19, subdivision 2. Prior to inspection or disclosure, the Indian tribal government must establish procedures for safeguarding the information.\n[Repealed, 1997 c 231 art 2 s 70]\nThe commissioner may disclose to a county auditor and treasurer, and to their designated agents or employees, the annual deferral amounts and the cumulative deferral and interest as determined by the commissioner under chapter 290B for each parcel of homestead property in the county that is enrolled in the senior citizen property tax deferral program under chapter 290B.\nThe commissioner may disclose to a county assessor, and to the assessor's designated agents or employees, a listing of parcels of property qualifying for the class 1b property tax classification under section 273.13, subdivision 22, and the names and addresses of qualified applicants.\nThe commissioner may disclose return information to the secretary of revenue of the state of Wisconsin for the purpose of conducting a joint individual income tax reciprocity study.",
	"repealed": false
}