{
	"id": "103E.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.615",
	"title": "103E.615 ENFORCING ASSESSMENTS.",
	"text": "Assessments filed for benefits to a municipality are a liability of the municipality and are due and payable with interest in installments on November 1 of each year as provided in section 103E.611. If the installments and interest are not paid on or before November 1, the amount due with interest added as provided in section 103E.611 must be extended by the county auditor against all property in the municipality that is liable to taxation. A levy must be made and the amount due must be paid and collected in the same manner and time as other taxes.\nIf a public road benefited is a county or state-aid road, the assessment filed is against the county and must be paid out of the road and bridge fund of the county.\nAn assessment against the state for benefits to trunk highways is chargeable to and payable out of the trunk highway fund. The commissioner of transportation shall pay assessments from the trunk highway fund after receipt of a certified copy of the assessment against the state for benefits to a trunk highway.\nIf a town is assessed for benefits to a town road in a drainage project proceeding under this chapter and the town road is later vacated by the town board under section 164.07, the town board may petition the drainage authority to cancel the assessment. The drainage authority may cancel the assessment if it finds that the town road for which benefits are assessed has been vacated under section 164.07.\nState property, including rural credit property, is assessable for benefits received. The assessment must be paid by the state from funds appropriated and available for drainage assessments after the state officer having jurisdiction over the assessed property certifies the assessment to the commissioner of management and budget.\n[Repealed, 1994 c 561 s 28]\nProperty owned by a railroad or other utility corporation benefited by a drainage project is liable for the assessments of benefits on the property as other taxable property. From the date the drainage lien is recorded, the amount of the assessment with interest is a lien against all property of the corporation within the county. Upon default the assessment may be collected by civil action or the drainage lien may be foreclosed by action in the same manner as provided by law for the foreclosure of mortgage liens. The county where the drainage lien is filed has the right of action against the corporation to enforce and collect the assessment.",
	"repealed": false
}