{
	"id": "60A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.21",
	"title": "60A.21 UNAUTHORIZED INSURERS PROCESS ACT.",
	"text": "The purpose of the Unauthorized Insurers Process Act is to subject certain insurers to the jurisdiction of courts of this state in suits by or on behalf of insureds or beneficiaries under insurance contracts.\nThe legislature declares that it is a subject of concern that many residents of this state hold policies of insurance issued or delivered in this state by insurers while not authorized to do business in this state, thus presenting to such residents the often insuperable obstacle of resorting to distant forums for the purpose of asserting legal rights under such policies. In furtherance of such state interest the legislature herein provides a method of substituted service of process upon such insurers and declares that in so doing it exercises its power to protect its residents and to define for the purpose of this statute what constitutes doing business in this state and also exercises powers and privileges available to the state by virtue of Public Law 15, 79th Congress of the United States, chapter 20, 1st Session, section 340, which declares that the business of insurance and every person engaged therein shall be subject to the laws of the several states.\n(1) Any of the following acts in this state effected by mail or otherwise by an unauthorized foreign or alien insurer: (a) the issuance or delivery of contracts of insurance to residents of this state or to corporations authorized to do business therein; (b) the solicitation of applications for such contracts; (c) the collection of premiums, membership fees, assessments, or other considerations for such contracts; or (d) any other transaction of insurance business, is equivalent to and shall constitute an appointment by such insurer of the commissioner of commerce and the commissioner's successor or successors in office to be its true and lawful attorney upon whom may be served all lawful process in any action, suit, or proceeding instituted by or on behalf of an insured or beneficiary arising out of any such contract of insurance and any such act shall be signification of its agreement that such service of process is of the same legal force and validity as personal service of process in this state upon such insurer.\n(2) Such service of process shall be made in compliance with section 45.028, subdivision 2.\n(3) Service of process in any such action, suit, or proceeding shall in addition to the manner provided in clause (2) of this subdivision be valid if served upon any person within this state who, in this state on behalf of such insurer, is: (a) soliciting insurance, or (b) making, issuing, or delivering any contract of insurance, or (c) collecting or receiving any premium, membership fee, assessment, or other consideration for insurance; and if a copy of such process is sent within ten days thereafter by certified mail by the plaintiff or plaintiff's attorney to the defendant at the last known principal place of business of the defendant and the defendant's receipt, or the receipt issued by the post office with which the letter is certified showing the name of the sender of the letter and the name and address of the person to whom the letter is addressed, and the affidavit of the plaintiff or plaintiff's attorney showing a compliance herewith are filed with the administrator of the court in which such action is pending on or before the date the defendant is required to appear or within such further time as the court may allow.\n(4) No plaintiff or complainant shall be entitled to a judgment by default under this subdivision until the expiration of 30 days from the date of the filing of the affidavit of compliance.\n(5) Nothing in this subdivision contained shall limit or abridge the right to serve any process, notice, or demand upon any insurer in any other manner now or hereafter permitted by law.\n(6) The provisions of this section shall not apply to surplus line insurance lawfully effectuated under Minnesota law, or to reinsurance, nor to any action or proceeding against an unauthorized insurer arising out of:\n(a) wet marine and transportation insurance;\n(b) insurance on or with respect to subjects located, resident, or to be performed wholly outside this state, or on or with respect to vehicles or aircraft owned and principally garaged outside this state;\n(c) insurance on property or operations of railroads engaged in interstate commerce; or\n(d) insurance on aircraft or cargo of such aircraft, or against liability, other than employer's liability, arising out of the ownership, maintenance, or use of such aircraft, where the policy or contract contains a provision designating the commissioner as its attorney for the acceptance of service of lawful process in any action or proceeding instituted by or on behalf of an insured or beneficiary arising out of any such policy, or where the insurer enters a general appearance in any such action.\n(1) Before any unauthorized foreign or alien insurer shall file or cause to be filed any pleading in any action, suit, or proceeding instituted against it such unauthorized insurer shall: (a) Deposit with the administrator of the court in which such action, suit, or proceeding is pending cash or securities or file with such administrator a bond with good and sufficient sureties to be approved by the court in an amount to be fixed by the court sufficient to secure the payment of any final judgment which may be rendered in such action; or (b) procure a certificate of authority to transact the business of insurance in this state.\n(2) The court in any action, suit, or proceeding in which service is made in the manner provided in clauses (2) or (3) of subdivision 2 hereof, may, in its discretion, order such postponement as may be necessary to afford the defendant reasonable opportunity to comply with the provisions of clause (1) of this subdivision and to defend such action.\n(3) Nothing in clause (1) is to be construed to prevent an unauthorized foreign or alien insurer from filing a motion to quash a writ or to set aside service thereof made in the manner provided in clauses (2) and (3) of subdivision 2 hereof on the ground either (a) that such unauthorized insurer has not done any of the acts enumerated in clause (1) of subdivision 2 hereof, or (b) that the person on whom service was made pursuant to clause (3) of subdivision 2 hereof, was not doing any of the acts therein enumerated.\nIn any action hereunder against an unauthorized foreign or alien insurer upon a contract of insurance issued or delivered in this state to a resident thereof or to a corporation authorized to do business therein, if the insurer has failed for 30 days after demand prior to the commencement of the action to make payment in accordance with the terms of the contract and it appears to the court that such refusal was vexatious and without reasonable cause, the court may allow to the plaintiff a reasonable attorney fee and include such fee in any judgment that may be rendered in such action. Failure of an insurer to defend any such action shall be deemed prima facie evidence that its failure to make payment was vexatious and without reasonable cause.\nIf any provision of this section or the application thereof to any person or circumstances is held invalid such invalidity shall not affect other provisions or applications of the act which can be given effect without the invalid provision or application and to this end the provisions of this section are declared to be severable.\nThis section may be cited as the \"Unauthorized Insurers Process Act.\"",
	"repealed": false
}