{
	"id": "50.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/50.245",
	"title": "50.245 BRANCHES; ACQUISITIONS.",
	"text": "A savings bank may establish any number of detached facilities as may be approved by the commissioner of commerce pursuant to sections 47.51 to 47.57. The savings bank shall not change the location of a detached facility without prior written approval of the commissioner of commerce. A savings bank may establish a loan production office, without restriction as to geographical location, upon written notice to the commissioner of commerce.\nThe authorization contained in subdivision 1 is in addition to the authority granted savings banks in section 47.52. A savings bank chartered in this state, whether or not the subsidiary of a savings bank holding company, has the same authority as a bank to conduct interstate mergers affecting interstate branching under section 49.411. The merger may be between banks and with other banks or savings banks.\nA savings bank chartered in this state and a savings bank holding company with its principal offices in this state may acquire control of a financial institution chartered in any other state or a financial institution holding company with principal offices in any other state. A savings bank chartered in any other state and a savings bank holding company with principal offices in any other state may acquire control of a savings bank chartered in this state or a savings bank holding company with principal offices in this state.\nProcedural requirements contained in sections 48.90 to 48.99 apply to interstate acquisitions by savings banks and savings bank holding companies.\nFor the purpose of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Financial institution\" means a bank, savings bank, savings association, or trust company, whether chartered under the laws of this state, another state or territory, or under the laws of the United States.\n(b) \"Loan production office\" means a place of business at which a savings bank provides lending if the loans are approved at the main office or detached facility of the savings bank, but at which a savings bank may not accept deposits except through a remote service unit.\n(c) \"Remote service unit\" means an electronic financial terminal as defined in section 47.61.\n[Repealed by amendment, 1997 c 157 s 34]",
	"repealed": false
}