{
	"id": "349.2127",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.2127",
	"title": "349.2127 PROHIBITIONS.",
	"text": "A person is guilty of a felony who, with intent to defraud the state, makes, alters, forges, or counterfeits any license or stamp provided for in this chapter, or has in possession any forged, spurious, or altered stamps, with the intent, or with the result of, depriving the state of the tax imposed by chapter 297E.\n(a) A person is guilty of a crime who sells, offers for sale, or possesses a pull-tab or tipboard deal, paddle ticket cards, or raffle board not stamped or bar coded in accordance with the provisions of this chapter or chapter 297E. A violation of this paragraph is a gross misdemeanor if it involves ten or fewer pull-tab or tipboard deals or raffle boards. A violation of this paragraph is a felony if it involves more than ten pull-tab or tipboard deals or raffle boards, or a combination of more than ten deals of pull-tabs and tipboards or raffle boards.\n(b) A person, other than a licensed manufacturer, a licensed distributor, or an organization licensed or exempt or excluded from licensing under this chapter, is guilty of a crime who sells, offers to sell, or possesses gambling equipment. A violation of this paragraph is a gross misdemeanor if it involves ten or fewer pull-tab or tipboard deals or raffle boards. A violation of this paragraph is a felony if it involves more than ten pull-tab or tipboard deals or raffle boards, or a combination of more than ten deals of pull-tabs and tipboards or raffle boards.\n(c) A person is guilty of a crime who alters, modifies, or counterfeits pull-tabs, tipboards, tipboard tickets, or raffle boards or possesses altered, modified, or counterfeit pull-tabs, tipboards, tipboard tickets, or raffle boards. A violation of this paragraph is a gross misdemeanor if the total face value for all such pull-tabs, tipboards, tipboard tickets or raffle boards does not exceed $200. A violation of this paragraph is a felony if the total face value exceeds $200. For purposes of this paragraph, the face value of all pull-tabs, tipboards, and tipboard tickets or raffle boards altered, modified, or counterfeited within a six-month period may be aggregated and the defendant charged accordingly.\n(d) A person, other than a licensed distributor or licensed manufacturer, is guilty of a crime who possesses a pull-tab or tipboard deal or raffle board for which the person, upon demand of a licensed peace officer or authorized agent of the commissioner of revenue or director of alcohol and gambling enforcement, does not immediately produce for inspection the invoice or a true and correct copy of the invoice for the acquisition of the deal or board from a licensed distributor. A violation of this paragraph is a gross misdemeanor if it involves ten or fewer pull-tab or tipboard deals or raffle boards. A violation of this paragraph is a felony if it involves more than ten pull-tab or tipboard deals or raffle boards, or a combination of more than ten deals of pull-tabs and tipboards or raffle boards. This paragraph does not apply to pull-tab and tipboard deals or raffle boards being transported in interstate commerce between locations outside this state.\nA person is guilty of a felony who:\n(1) knowingly submits materially false information in any license application or other document or communication submitted to the board;\n(2) knowingly places materially false information on a pull-tab or tipboard deal or raffle board invoice or a copy of the invoice; or\n(3) knowingly presents to a licensed peace officer or authorized agent of the commissioner of revenue or director of alcohol and gambling enforcement a pull-tab or tipboard deal or raffle board invoice, or a copy of the invoice, that contains materially false information.\nA person is guilty of a gross misdemeanor who transports into, causes to be transported into, receives, carries, moves from place to place, or causes to be moved from place to place in this state, any paddle ticket cards, deals of pull-tabs or tipboards, or raffle boards not stamped or bar coded in accordance with this chapter or chapter 297E except in the course of interstate commerce between locations outside this state. A person is guilty of a felony who violates this subdivision with respect to more than ten pull-tab or tipboard deals or raffle boards, or a combination of more than ten deals of pull-tabs and tipboards.\n(a) An employee of an organization may not provide any information to a player that would provide an unfair advantage to the player related to the potential winnings of any lawful gambling activity.\n(b) An employee may not provide, and a person may not receive, with expectation of pecuniary gain to either, any information that would provide an unfair advantage to the recipient of the information related to the potential winnings of any lawful gambling activity. A person who violates this paragraph is guilty of a gross misdemeanor. A person who violates this paragraph within five years after a previous conviction under this paragraph is guilty of a felony.\n(c) For purposes of this subdivision, \"employee\" includes a volunteer.\n(a) A person who knowingly or with reason to know makes an unlawful expenditure of gross profits from lawful gambling is guilty of a crime and may be sentenced as provided in this subdivision.\n(b) If the unlawful expenditure is of $200 or less, the penalty in section 349.22, subdivision 1, applies.\n(c) If the unlawful expenditure is of more than $200 but not more than $2,500, the person is guilty of a gross misdemeanor.\n(d) If the unlawful expenditure is of more than $2,500, the person is guilty of a felony.\n(e) For purposes of this subdivision, expenditures made within a six-month period may be aggregated and the defendant charged accordingly.\nAn organization may not accept checks or debit cards in payment for the purchase of any gambling equipment or for the chance to participate in any form of lawful gambling except a raffle. If an organization accepts a check or debit card, the payment of which is subsequently dishonored, the organization shall reimburse its gambling account for the amount of the dishonored payment within 30 days of receiving notice of the dishonor. This subdivision does not apply to gaming activities conducted pursuant to the Indian Gaming Regulatory Act, United States Code, title 25, section 2701 et seq.\nMS 2008 [Repealed, 2009 c 124 s 60]\nFor purposes of this section \"tipboard\" includes tipboards as defined in section 349.12, subdivision 34, and any board, placard or other device marked off in a grid or columns, in which each section contains a hidden number or numbers, or other symbol, which determines the winning chances.",
	"repealed": false
}