{
	"id": "60A.715",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.715",
	"title": "60A.715 REQUIRED CONTRACT PROVISIONS; REINSURANCE INTERMEDIARY-BROKERS.",
	"text": "Transactions between an RB and the insurer it represents in this capacity shall only be entered into pursuant to a written authorization, specifying the responsibilities of each party. The authorization must, at a minimum, provide that:\n(1) the insurer may terminate the RB's authority at any time;\n(2) the RB will render accounts to the insurer accurately detailing all material transactions, including information necessary to support all commissions, charges, and other fees received by, or owing to the RB, and remit all funds due to the ceding insurer or the assuming reinsurer within 30 days of the month of receipt;\n(3) all funds collected for the ceding insurer's or the assuming reinsurer's account will be held by the RB in a fiduciary capacity:\n(i) in a bank that is a qualified United States financial institution; or\n(ii) in direct obligations of, or obligations guaranteed or insured by, the United States, its agencies, or its instrumentalities, excluding mortgage-backed securities, or in obligations described in section 60A.11, subdivision 17, paragraphs (a) and (b).\nInvestments made under item (ii) must be traded on a national securities exchange, and shall be restricted to the following: direct obligations of the United States government or an agency of the United States government, municipal bonds or corporate bonds or notes with credit ratings of at least AA by Standard & Poors or equivalent ratings from a comparable rating service, or commercial paper with a short-term rating of at least A-1 by Standard & Poors or an equivalent rating from a comparable rating service, but in no event shall the obligations be rated other than in the highest category established by the Securities Valuation Office of the National Association of Insurance Commissioners. The RB shall invest fiduciary funds under item (ii) only if authorized in writing by the ceding insurer or assuming reinsurer in whose account the funds are held, shall secure the investments with security acceptable to the ceding insurer or assuming reinsurer on whose account the funds are held, and shall be responsible for any losses on investments made pursuant to item (ii).\nAt least 50 percent of the funds invested under clause (3), based on the prior 30 days' average balance, must be invested in instruments that mature in no more than 120 days. In no case shall an investment mature in greater than three years from the date of purchase. Investments made pursuant to clause (3) should emphasize safety, liquidity, and diversification. The RB is required to structure those investments so that funds are available to remit on a timely basis to the ceding insurer or the assuming reinsurer in accordance with clause (2);\n(4) the RB will comply with section 60A.72;\n(5) the RB will comply with the written standards established by the insurer for the cession or retrocession of all risks; and\n(6) the RB will disclose to the insurer any relationship with any reinsurer to which business will be ceded or retroceded.",
	"repealed": false
}