{
	"id": "60A.033",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.033",
	"title": "60A.033 SCHEDULING CONFERENCE AND ORDER.",
	"text": "This section applies to examinations limited to market analysis, as defined in section 60A.031, subdivision 4, paragraph (f).\nWithin 30 days of issuing an examination order under section 60A.031, the commissioner must hold a scheduling conference with the insurance company.\n[Repealed, 2022 c 93 art 2 s 43]\nAt the scheduling conference, the commissioner must provide the insurance company with the following:\n(1) the justification for the examination and the regulatory issues the examination will address;\n(2) the information that must be produced by the insurance company and the timing for its production in accordance with the requirements of subdivision 6;\n(3) the estimated length of the examination, subject to the requirements of subdivision 9;\n(4) whether contract examiners will be used;\n(5) a budget for the exam including:\n(i) the daily or hourly rates for the examiners that will be involved in the examination;\n(ii) the estimated travel, lodging, meal, and other expenses of the examiners; and\n(iii) the estimated administrative and supply costs directly associated with the examination; and\n(6) an explanation of the invoicing process and the process for resolving billing disputes.\nWithin 15 days following the scheduling conference or as otherwise agreed to by the commissioner and the insurance company, the commissioner must issue a scheduling order that includes the information required by subdivision 4, based on the discussion at the scheduling conference. The commissioner and insurance company must follow the terms of the scheduling order. To amend a scheduling order there must be a supplemental scheduling conference that complies with subdivision 4 and a supplemental scheduling order that complies with this subdivision, unless otherwise agreed upon by the commissioner and the insurance company.\n(a) Any information requested from an insurance company by the commissioner must:\n(1) be limited to matters relevant to the issues the examination will address;\n(2) provide the insurance company with a reasonable period of time to respond to the request, but not less than 30 days from the receipt of the request; and\n(3) be reasonable in relation to the burden or expense of gathering the requested information and the needs of the examination.\n(b) In making an information request, the commissioner must consider whether the information being requested is obtainable from some other source that is more convenient, less burdensome, or less expensive for the insurance company.\n(c) An insurance company can extend the time period by which a response to an information request from the commissioner is due by up to 30 days upon giving notice of the extension to the commissioner. The commissioner may extend any time period by which information is due relating to an examination.\n(a) Unless required to preserve evidence, the commissioner, department, and examiners:\n(1) may not appear at an insurance company's place of business unannounced to conduct the examination; or\n(2) may not be present at an insurance company's place of business outside of normal hours without the insurance company's written consent.\n(b) If a statement is taken by the commissioner from a person under oath, the person must first be informed of the following:\n(1) the scope of the proposed statement;\n(2) whether the person is the subject of an examination; and\n(3) that the person may be represented by legal counsel during the taking of the statement.\n(c) If a statement is taken by the commissioner from a person under oath and the statement is recorded, the person must be provided with a transcript or recording of the statement within 30 days of requesting it from the commissioner.\nAll bills for examination costs being charged to an insurance company pursuant to subdivision 5 or section 60A.031, subdivision 3, paragraph (c), must:\n(1) be itemized and, with respect to examiner billings, contain activity detail on a quarterly hourly basis by an individual examiner and disclose the applicable hourly billing rates, together with per-charge detail for related travel or other expenses; and\n(2) provide a due date no less than 60 days from receipt of the bill.\nAn examination under section 60A.031 must not exceed 18 months from the date the commissioner receives the insurance company's first submission pursuant to a scheduling order, unless:\n(1) the commissioner determines that there has been a material lack of cooperation by the insurance company and advises the company in writing of the specific instances demonstrating a lack of cooperation;\n(2) the examination is a multistate examination; or\n(3) the commissioner determines that additional time is necessary to complete the examination and the commissioner notifies the insurance company in writing of the reasons why the examination requires additional time.\n(a) An insurance company aggrieved by any decision or action of the commissioner under this section as it relates to market analysis may, within 21 days after that decision or action, make a written request to the commissioner for a hearing to determine whether the decision or action complies with the requirements of this section. The commissioner shall hear the party or parties within 21 days after receipt of the request and shall give not less than ten days' written notice of the time and place of the hearing. Within 15 days after the hearing, the commissioner shall affirm, reverse, or modify the previous action and specify the reasons for that decision or action in writing. The effective date of the commissioner's action or decision may be suspended or postponed pending the completion of the hearing before the commissioner.\n(b) Nothing contained in this section requires the observance at any hearing of formal rules of pleading or evidence.\n(c) An order or decision of the commissioner is a final decision subject to appeal in accordance with chapter 14.\n(d) Time used to complete a hearing and appeal under this section must not be counted toward the time frame for completion of an examination under subdivision 9.\n(a) The commissioner must make an attempt to informally resolve any alleged violations of law identified during the examination or investigation. An attempt to informally resolve a violation may consist of a consent order, nonpublic letter of reprimand, or other informal resolution or disposition.\n(b) The terms of a consent order or other informal disposition that prescribes compliance requirements must be consistent with the requirements of Minnesota law.\nEach year by February 1, the commissioner must report the following information to the chairs and ranking minority members of the house of representatives and senate committees having jurisdiction over commerce:\n(1) a listing of the number of pending market conduct exams and the year the exams were commenced;\n(2) the number of exams closed during the prior year and the current total of costs charged to the companies for each exam;\n(3) whether the exam is being conducted, in whole or in part, by third-party examiners; and\n(4) other information that the chairs or ranking minority members may reasonably request, subject to the limitations of section 60A.031, subdivision 4, paragraph (f).",
	"repealed": false
}