{
	"id": "82.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.63",
	"title": "82.63 LICENSING; OTHER REQUIREMENTS.",
	"text": "The commissioner shall issue a license as a real estate broker or real estate salesperson to any person who qualifies for the license under the terms of this chapter.\nAn individual who holds a broker's license in the broker's own name or for or on behalf of a business entity must be issued an additional broker's license only upon demonstrating:\n(1) that the additional license is necessary in order to serve a legitimate business purpose;\n(2) that the broker will be capable of supervising all salespersons over whom the broker will have supervisory responsibility or, in the alternative, that the broker will have no supervisory responsibilities under the additional license; and\n(3) that the broker:\n(i) has at least 51 percent ownership interest in each business entity for or on whose behalf the broker holds or will hold a broker's license; or\n(ii) is an elected or appointed officer, signing partner, or managing member of both the business entity for which or on whose behalf the broker already holds a license, and an affiliated business entity for which or on whose behalf the broker is applying for an additional license.\nFor the purpose of this section and sections 82.58, subdivisions 1 to 4; 82.62, subdivisions 1 to 4; 82.65; and 82.82, subdivision 2, \"affiliated business entity\" means a business entity that is majority-owned by the same persons as the business entity for which or on whose behalf the broker is already licensed to act.\nFor the purposes of this section and sections 82.58, subdivisions 1 to 4; 82.62, subdivisions 1 to 4; 82.65; and 82.82, subdivision 2, a legitimate business purpose includes engaging in a different and specialized area of real estate or maintaining an existing business name.\nEach broker shall be responsible for the acts of any and all of the broker's sales people and closing agents while acting as agents on the broker's behalf. Each officer of a limited liability company or corporation or partner in a partnership or limited liability partnership licensed as a broker shall have the same responsibility under this chapter as a corporate or partnership broker with regard to the acts of the salespeople and closing agents acting on behalf of the limited liability company, corporation, partnership, or limited liability partnership.\nA salesperson must be licensed to act on behalf of a licensed broker and may not be licensed to act on behalf of more than one broker in this state during the same period of time.\nA license renewed pursuant to this chapter is valid for a period of 24 months. A new license issued during a 24-month licensing period will expire on June 30 of the expiration year assigned to the license.\nWhen a salesperson terminates activity on behalf of a broker, the salesperson's license shall be ineffective. Within ten days of the termination the broker shall notify the commissioner in the form prescribed by the commissioner. The salesperson may apply for transfer of the license to active status with another broker at any time during the remainder of the license period. If an application for transfer is not made within the license period, the commissioner shall require that an application for a new license be filed.\n[Repealed, 2014 c 222 art 1 s 58]\n[Repealed, 2014 c 222 art 1 s 58]\n[Repealed, 2014 c 222 art 1 s 58]\n[Repealed, 2014 c 222 art 1 s 58]\nA nonresident of Minnesota may be licensed as a real estate broker, real estate salesperson, or a real estate closing agent upon compliance with all provisions of this chapter.\nIn the event of death, incapacity, or loss of license of a broker, the commissioner may issue a 45-day temporary permit to an individual who has had a minimum of three years actual experience as a licensed real estate salesperson and who is otherwise reasonably qualified to act as a broker. Upon application prior to its expiration, the 45-day temporary permit shall be renewed once by the commissioner if the applicant demonstrates that he or she has made a good faith effort to obtain a broker's license within the preceding 45 days and an extension of time will not harm the public interest.\nOnly those salespersons licensed to the deceased or incapacitated broker at the time of death or incapacity may conduct business for or on behalf of the person to whom the temporary broker's license was issued.\nThe commissioner shall have the authority to issue a limited real estate broker's license authorizing the following limited activities:\n(1) the licensee to engage in transactions as principal only; or\n(2) the licensee to engage in negotiations of mortgage loans, other than residential mortgage loans, as described in section 82.55, subdivision 19, clause (b).\nThe license may be issued only after receipt of the application described in section 82.58, subdivision 2, and payment of the fee prescribed by section 82.57, subdivision 1. A salesperson may not be licensed to act on behalf of an individual holding a limited broker's license. A responsible person of a business entity licensed as a limited broker may act on behalf of that business entity without being subject to the licensing requirements.\nNotwithstanding the provisions of subdivision 5 and section 82.62, subdivisions 3 and 4, the commissioner may institute a system by rule pursuant to chapter 14 to provide three-year licenses from the date of issuance for any license prescribed by this section and sections 82.58, subdivisions 1 to 4; 82.62, subdivisions 1 to 4; 82.65; and 82.82, subdivision 2.\nA licensee or license applicant may at any time file with the commissioner a request to withdraw from the status of licensee or to withdraw a pending license application. Withdrawal from the status of licensee or withdrawal of the license application becomes effective 30 days after receipt of a request to withdraw or within a shorter period the commissioner determines unless a revocation, suspension, or denial proceeding is pending when the request to withdraw is filed or a proceeding to revoke, suspend, deny, or to impose conditions upon the withdrawal is instituted within 30 days after the request to withdraw is filed. If a proceeding is pending or instituted, withdrawal becomes effective at the time and upon the conditions the commissioner determines by order. If no proceeding is pending or instituted and withdrawal automatically becomes effective, the commissioner may institute a revocation or suspension proceeding within one year after withdrawal became effective and enter a revocation or suspension order as of the last date on which the license was in effect.",
	"repealed": false
}