{
	"id": "181.214",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.214",
	"title": "181.214 DUTIES OF THE BOARD; TRAINING FOR NURSING HOME WORKERS.",
	"text": "The board shall certify worker organizations that it finds are qualified to provide training to nursing home workers according to this section. The board shall by rule establish certification criteria that a worker organization must meet in order to be certified and provide a process for renewal of certification upon the board's review of the worker organization's compliance with this section. In adopting rules to establish certification criteria under this subdivision, the board may use the authority in section 14.389. The criteria must ensure that a worker organization, if certified, is able to provide:\n(1) effective, interactive training on the information required by this section; and\n(2) follow-up written materials and responses to inquiries from nursing home workers in the languages in which nursing home workers are proficient.\n(a) The board shall establish requirements for the curriculum for the nursing home worker training required by this section. A curriculum must at least provide the following information to nursing home workers:\n(1) the applicable compensation and working conditions in the minimum standards or local minimum standards established by the board;\n(2) the antiretaliation protections established in section 181.216;\n(3) information on how to enforce sections 181.211 to 181.217 and on how to report violations of sections 181.211 to 181.217 or of standards established by the board, including contact information for the Department of Labor and Industry, the board, and any local enforcement agencies, and information on the remedies available for violations;\n(4) the purposes and functions of the board and information on upcoming hearings, investigations, or other opportunities for nursing home workers to become involved in board proceedings;\n(5) other rights, duties, and obligations under sections 181.211 to 181.217;\n(6) any updates or changes to the information provided according to clauses (1) to (5) since the most recent training session;\n(7) any other information the board deems appropriate to facilitate compliance with sections 181.211 to 181.217; and\n(8) information on labor standards in other applicable local, state, and federal laws, rules, and ordinances regarding nursing home working conditions or nursing home worker health and safety.\n(b) Before establishing initial curriculum requirements, the board must hold at least one public hearing to solicit input on the requirements.\nA certified worker organization is not required to cover all of the topics listed in subdivision 2 in a single training session. A curriculum used by a certified worker organization may provide instruction on each topic listed in subdivision 2 over the course of up to three training sessions.\nThe board must review the adequacy of its curriculum requirements at least annually and must revise the requirements as appropriate to meet the purposes of sections 181.211 to 181.217. As part of each annual review of the curriculum requirements, the board must hold at least one public hearing to solicit input on the requirements.\nA certified worker organization:\n(1) must use a curriculum for its training sessions that meets requirements established by the board;\n(2) must provide trainings that are interactive and conducted in the languages in which the attending nursing home workers are proficient;\n(3) must, at the end of each training session, provide attending nursing home workers with follow-up written or electronic materials on the topics covered in the training session, in order to fully inform nursing home workers of their rights and opportunities under sections 181.211 to 181.217;\n(4) must make itself reasonably available to respond to inquiries from nursing home workers during and after training sessions; and\n(5) may conduct surveys of nursing home workers who attend a training session to assess the effectiveness of the training session and industry compliance with sections 181.211 to 181.217 and other applicable laws, rules, and ordinances governing nursing home working conditions or worker health and safety.\n(a) A nursing home employer must submit written documentation to the board to certify that every two years each of its nursing home workers completes one hour of training that meets the requirements of this section and is provided by a certified worker organization. A nursing home employer may, but is not required to, host training sessions on the premises of the nursing home.\n(b) If requested by a certified worker organization, a nursing home employer must, after a training session provided by the certified worker organization, provide the certified worker organization with the names and contact information of the nursing home workers who attended the training session, unless a nursing home worker opts out according to paragraph (c).\n(c) A nursing home worker may opt out of having the worker's nursing home employer provide the worker's name and contact information to a certified worker organization that provided a training session attended by the worker by submitting a written statement to that effect to the nursing home employer.\nA nursing home employer must compensate its nursing home workers at their regular hourly rate of wages and benefits for each hour of training completed as required by this section and reimburse any reasonable travel expenses associated with attending training sessions not held on the premises of the nursing home.",
	"repealed": false
}