{
	"id": "148E.010",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.010",
	"title": "148E.010 DEFINITIONS.",
	"text": "For the purpose of this chapter, the terms in this section have the meanings given.\n\"Applicant\" means a person who submits an application to the board for a new license, a license renewal, a change in license, an inactive license, reactivation of a license, or a voluntary termination.\n\"Application\" means an application to the board for a new license, a license renewal, a change in license, an inactive license, reactivation of a license, or voluntary termination.\n\"Baccalaureate degree\" means a bachelor's degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates.\n\"Board\" means the Board of Social Work created under section 148E.025.\n\"Client\" means an individual, couple, family, group, community, or organization that receives or has received social work services as described in subdivision 11.\n\"Client system\" means the client and those in the client's environment who are potentially influential in contributing to a resolution of the client's issues.\n\"Clinical practice\" means applying professional social work knowledge, skills, and values in the differential diagnosis and treatment of psychosocial function, disability, or impairment, including addictions and emotional, mental, and behavioral disorders. Treatment includes a plan based on a differential diagnosis. Treatment may include, but is not limited to, the provision of psychotherapy to individuals, couples, families, and groups across the life span. Clinical social workers may also provide the services described in subdivision 11.\n\"Clinical supervision\" means supervision as defined in subdivision 18 of a social worker engaged in clinical practice as defined in subdivision 6.\n\"Direct clinical client contact\" means in-person or electronic media interaction with a client, including client systems and service providers, related to the client's mental and emotional functioning, differential diagnosis, and treatment, in subdivision 6.\n\"Clock hour\" means 60 minutes of learning.\n\"Continuing education\" means education and training to maintain, improve, or enhance competent social work practice.\n\"Continuing education independent learning\" means a licensee's individual study, including but not limited to online activities without live interaction, research for publication, presentations, or professional development.\n\"Continuing education social work ethics\" means:\n(1) the history and evolution of values and ethics in social work, including cultural awareness and social diversity;\n(2) ethics theories;\n(3) professional standards of social work practice, as specified in the ethical codes of the National Association of Social Workers, the Association of Canadian Social Workers, the Clinical Social Work Federation, and the Council on Social Work Education;\n(4) the legal requirements and other considerations for each jurisdiction that registers, certifies, or licenses social workers; or\n(5) the ethical decision-making process.\n\"Cultural responsiveness\" means increasing the knowledge, understanding, self-awareness, and practice skills that enable a social worker to serve clients from diverse socioeconomic and cultural backgrounds including:\n(1) understanding culture, its functions, and strengths that exist in varied cultures;\n(2) understanding clients' cultures and differences among and between cultural groups;\n(3) understanding the nature of social diversity and oppression; and\n(4) understanding cultural humility.\n\"Graduate degree\" means a master's degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body designated by the board; or a doctorate in social work from an accredited university.\n\"Intern\" means a student in field placement working under the supervision of a social worker to fulfill the requirements of a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates.\n\"Person-in-environment perspective\" means viewing human behavior, development, and function in the context of one or more of the following: the environment, social functioning, mental health, and physical health.\n(a) \"Practice of social work\" means working to maintain, restore, or improve behavioral, cognitive, emotional, mental, or social functioning of clients, in a manner that applies accepted professional social work knowledge, skills, and values, including the person-in-environment perspective, by providing in person or through telephone, video conferencing, or electronic means one or more of the social work services described in paragraph (b), clauses (1) to (3). Social work services may address conditions that impair or limit behavioral, cognitive, emotional, mental, or social functioning. Such conditions include, but are not limited to, the following: abuse and neglect of children or vulnerable adults, addictions, developmental disorders, disabilities, discrimination, illness, injuries, poverty, and trauma. Practice of social work also means providing social work services in a position for which the educational basis is the individual's degree in social work described in subdivision 13.\n(b) Social work services include:\n(1) providing assessment and intervention through direct contact with clients, developing a plan based on information from an assessment, and providing services which include, but are not limited to, assessment, case management, client-centered advocacy, client education, consultation, counseling, crisis intervention, and referral;\n(2) providing for the direct or indirect benefit of clients through administrative, educational, policy, or research services including, but not limited to:\n(i) advocating for policies, programs, or services to improve the well-being of clients;\n(ii) conducting research related to social work services;\n(iii) developing and administering programs which provide social work services;\n(iv) engaging in community organization to address social problems and macrocosm issues through planned collective action;\n(v) supervising individuals who provide social work services to clients;\n(vi) supervising social workers in order to comply with the supervised practice requirements specified in sections 148E.100 to 148E.125; and\n(vii) teaching professional social work knowledge, skills, and values to students; and\n(3) engaging in clinical practice as defined in subdivision 6.\n\"Professional name\" means the name a licensed social worker uses in making representations of the social worker's professional status to the public and which has been designated to the board in writing according to section 148E.090.\n\"Professional social work knowledge, skills, and values\" means the knowledge, skills, and values taught in programs accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body designated by the board; or a doctorate in social work from an accredited university. Professional social work knowledge, skills, and values include, but are not limited to, principles of person-in-environment and the values, principles, and standards described in the Code of Ethics of the National Association of Social Workers.\n\"Sexual conduct\" means any physical contact or conduct that may be reasonably interpreted as sexual, or any oral, written, electronic, or other communication that suggests engaging in physical contact or conduct that may be reasonably interpreted as sexual.\n\"Social worker\" means an individual who:\n(1) is licensed as a social worker; or\n(2) has obtained a social work degree from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body designated by the board and engages in the practice of social work.\n\"Student\" means an individual who is currently enrolled in a program that has been accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates and who studies professional social work knowledge, skills, and values.\n\"Supervisee\" means an individual who receives evaluation and supervision or direction of the supervisee's social work practice through supervision in order to comply with sections 148E.100 to 148E.125 by an individual who meets the requirements under section 148E.120.\n\"Supervision\" means a professional relationship between a supervisor and a supervisee in which the supervisor evaluates and directs the supervisee's social work practice. A supervisor's role is to promote a supervisee's continued development of the supervisee's knowledge, skills, and abilities to practice social work in an ethical and competent manner.\n\"Supervisor\" means an individual who meets the requirements of section 148E.120 to provide evaluation and direction through supervision as described in subdivision 18 in order to comply with sections 148E.100 to 148E.125.\n\"Underrepresented community\" means a group that is not represented in the majority with respect to race, ethnicity, national origin, sexual orientation, gender identity, or physical ability.",
	"repealed": false
}