{
	"id": "462C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.12",
	"title": "462C.12 MINNEAPOLIS/ST. PAUL HOUSING FINANCE BOARD; POWERS; JURISDICTION.",
	"text": "The establishment of the Minneapolis/St. Paul Housing Finance Board in accordance with a joint powers agreement entered into between the Minneapolis Community Development Agency and the Housing and Redevelopment Authority of the city of St. Paul, and accepted by the cities of Minneapolis and St. Paul under section 471.59, is ratified and approved.\nThe board is granted the following powers:\n(a) The board may issue obligations and other forms of indebtedness under this section, subject to the terms and conditions set forth in the joint powers agreement, as may be from time to time amended.\n(b) The board is authorized to exercise the powers conferred upon the cities of Minneapolis and St. Paul and their designated housing and redevelopment authorities, or the powers of an agency exercising the powers of a housing and redevelopment authority by this chapter and chapter 462 and any other general or special law of the state of Minnesota relating to housing or housing finance. The powers which may be exercised by the board include, without limitation, the power to undertake and implement projects, developments, or programs, the power to issue and sell obligations and other forms of indebtedness payable exclusively from the revenues of the programs, projects, or developments undertaken by the board, or any of the powers the Minnesota Housing Finance Agency may exercise under chapter 462A, provided that the obligations and other forms of indebtedness may be sold upon terms and conditions as the board may from time to time determine. The board may exercise the powers conferred by this section only with respect to projects, programs, or developments within the corporate limits of the cities of Minneapolis and St. Paul, except as may be otherwise provided in a joint powers agreement entered into under section 471.59 between the board and any other city, housing and redevelopment authority, port authority or economic development authority established under sections 469.090 to 469.108 in the state of Minnesota.\nNotwithstanding any other provision of law, the territorial jurisdiction of the board shall extend to all of the area within the corporate limits of the cities of Minneapolis and St. Paul and shall for the purposes of any particular project, development, or program undertaken in whole or part for any other city include all of the area within the corporate limits of the city. For the purposes of any provision of law intended to apply within a particular jurisdiction, the provision shall be construed to apply to the entire area within the corporate limits of the cities of Minneapolis and St. Paul, together with the entire area within the corporate limits of any other city with which the board has entered into a joint powers agreement and on whose behalf a project, development, or program is undertaken or implemented, or on whose behalf obligations or other forms of indebtedness are issued by the board.\nThe powers granted by this section are in addition and supplemental to the powers granted by section 471.59, or the law under which a project, development, or program is undertaken or implemented by the board, or under which the board issues obligations or other forms of indebtedness.",
	"repealed": false
}