{
	"id": "273.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.135",
	"title": "273.135 HOMESTEAD PROPERTY TAX RELIEF.",
	"text": "The property tax to be paid in respect to property taxable within a tax relief area as defined in section 273.134, paragraph (b), on homestead property, as otherwise determined by law and regardless of the market value of the property, and on nonhomestead portions of property classified as both homestead and nonhomestead property as provided in section 273.124, subdivision 11, for all purposes shall be reduced in the amount prescribed by subdivision 2, subject to the limitations contained therein.\nThe amount of the reduction authorized by subdivision 1 shall be:\n(a) In the case of property located within a municipality as defined under section 273.134, paragraph (a), 66 percent of the tax, provided that the reduction shall not exceed the maximum amounts specified in paragraph (c).\n(b) In the case of property located within the boundaries of a school district which qualifies as a tax relief area under section 273.134, paragraph (b), but which is outside the boundaries of a municipality which meets the qualifications prescribed in section 273.134, paragraph (a), 57 percent of the tax, provided that the reduction shall not exceed the maximum amounts specified in paragraph (c).\n(c) The maximum reduction of the tax is $515 on property described in paragraph (a) and paragraph (b).\nMS 1988 [Repealed, 1Sp1989 c 1 art 3 s 34]\nNot later than December 1 of each year, each county auditor having jurisdiction over one or more tax relief areas shall certify to the commissioner of revenue an estimate of the total amount of the reduction, determined under subdivision 2, in taxes payable the next succeeding year with respect to all tax relief areas in the county.\nMS 1980 [Repealed, 1Sp1981 c 1 art 10 s 30]\nFor the purposes of this section, the amount of property tax to be paid shall be determined after the allowance of any reduction prescribed by section 273.13, and the reduction prescribed by this section shall be in addition to that prescribed by section 273.13.",
	"repealed": false
}