{
	"id": "103C.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.311",
	"title": "103C.311 SUPERVISOR DISTRICTS.",
	"text": "(a) The district board shall, with the approval of the state board, divide a district into supervisor districts for purposes of nomination for election. At each election after the division, one or more supervisors shall be nominated from each supervisor district. A supervisor must be a resident of the supervisor district to be elected.\n(b) If the boundary of a soil and water conservation district has been substantially changed by a division of the district, the district shall be divided into supervisor districts for nomination purposes.\n(c) Except for consolidation under section 103C.211, this subdivision does not disqualify a supervisor during the term for which the supervisor was elected or nominated for election. Supervisors nominated from the supervisor districts shall be included on the ballot for election from the entire area included in the soil and water conservation district.\n(d) A certified copy of the minutes or the resolution of the supervisors establishing supervisor districts must be promptly filed by the chair of the district board with the county auditor of the counties where the district is located and with the state board.\n(a) A district board in the seven-county metropolitan area shall by resolution provide that supervisors will be elected by supervisor districts as provided in this subdivision.\n(b) A district board outside of the seven-county metropolitan area, with the approval of the state board, may by resolution provide that supervisors will be elected by supervisor districts as provided in this subdivision.\n(c) The supervisor districts must be composed of precincts established by county and municipal governing bodies under section 204B.14. The districts must be compact, include only contiguous territory, and be substantially equal in population. The districts must be numbered in a regular series. The districts must be drawn by the county board of the county containing the largest area of the soil and water conservation district, in consultation with the district board and with the approval of the state board. The boundaries of the districts must be redrawn after each decennial federal census as provided in section 204B.135. A certified copy of the resolution establishing supervisor districts must be filed by the chair of the district board with the county auditor of the counties where the soil and water conservation district is located, with the state board, and with the secretary of state, and the filings must occur within 80 days of the time when the legislature has been redistricted or at least 15 weeks before the state primary election in a year ending in two, whichever comes first.\n(d) Each supervisor district is entitled to elect one supervisor. A supervisor must be a resident of the district from which elected.\n(e) The district board shall provide staggered terms for supervisors elected by district. After each redistricting, there shall be a new election of supervisors in all the districts at the next general election, except that if the change made in the boundaries of a district is less than five percent of the average population of all the districts, the supervisor in office at the time of the redistricting shall serve for the full term for which elected. The district board shall determine by lot the seats to be filled for a two-year term, a four-year term, and a six-year term.",
	"repealed": false
}