{
	"id": "256S.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.21",
	"title": "256S.21 RATE SETTING; APPLICATION; EVALUATION.",
	"text": "The rate methodologies in sections 256S.2101 to 256S.215 apply to:\n(1) elderly waiver, elderly waiver customized living, and elderly waiver foster care under this chapter;\n(2) alternative care under section 256B.0913;\n(3) essential community supports under section 256B.0922; and\n(4) community access for disability inclusion customized living and brain injury customized living under section 256B.49.\n[See Note.]\n(a) Beginning January 1, 2024, and every two years thereafter, the commissioner, in consultation with stakeholders, shall use all available data and resources to evaluate the following rate setting elements:\n(1) the base wage index;\n(2) the factors and supervision wage components; and\n(3) the formulas to calculate adjusted base wages and rates.\n(b) Beginning January 15, 2026, and every two years thereafter, the commissioner shall report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health and human services finance and policy with a full report on the information and data gathered under paragraph (a).\n[See Note.]\n(a) As determined by the commissioner, in consultation with stakeholders, a provider enrolled to provide services with rates determined under this chapter must submit requested cost data to the commissioner to support evaluation of the rate methodologies in this chapter. Requested cost data may include but are not limited to:\n(1) worker wage costs;\n(2) benefits paid;\n(3) supervisor wage costs;\n(4) executive wage costs;\n(5) vacation, sick, and training time paid;\n(6) taxes, workers' compensation, and unemployment insurance costs paid;\n(7) administrative costs paid;\n(8) program costs paid;\n(9) transportation costs paid;\n(10) vacancy rates; and\n(11) other data relating to costs required to provide services requested by the commissioner.\n(b) At least once in any five-year period, a provider must submit cost data for a fiscal year that ended not more than 18 months prior to the submission date. The commissioner shall provide each provider a 90-day notice prior to the provider's submission due date. If by 30 days after the required submission date a provider fails to submit required reporting data, the commissioner shall provide notice to the provider, and if by 60 days after the required submission date a provider has not provided the required data, the commissioner shall provide a second notice. The commissioner shall temporarily suspend payments to the provider if cost data is not received 90 days after the required submission date. Withheld payments must be made once data is received by the commissioner.\n(c) The commissioner shall coordinate the cost reporting activities required under this section with the cost reporting activities directed under section 256B.4914, subdivision 10a.\n(d) The commissioner shall analyze cost documentation in paragraph (a) and, in consultation with stakeholders, may submit recommendations on rate methodologies in this chapter, including ways to monitor and enforce the spending requirements directed in section 256S.2101, subdivision 3, through the reports directed by subdivision 2.",
	"repealed": false
}