{
	"id": "205.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.84",
	"title": "205.84 REDISTRICTING; CITIES WITH WARDS.",
	"text": "(a) In a city electing council members by wards, wards shall be as equal in population as practicable and each ward shall be composed of compact, contiguous territory. Each council member shall be a resident of the ward for which elected, but, except as otherwise provided by paragraph (b), a change in ward boundaries does not disqualify a council member from serving for the remainder of a term.\n(b) Notwithstanding any home rule charter provision to the contrary, in a city of the first class where council members are elected by ward to serve for four years to terms that are not staggered, if the population of any ward changes by five percent or more, all council members must be elected to new terms at the first municipal general election after ward boundaries are redefined under subdivision 2; provided, however, that if no municipal general election would otherwise occur in the year ending in \"2\" or the year ending in \"3,\" a municipal general election must be held in one of those years.\nAfter the official certification of the federal decennial or special census, the governing body of the city shall either confirm the existing ward boundaries as conforming to the standards of subdivision 1 or redefine ward boundaries to conform to those standards as provided in section 204B.135, subdivision 1. If the governing body of the city fails to take either action within the time required, no further compensation shall be paid to the mayor or council member until the wards of the city are either reconfirmed or redefined as required by this section. An ordinance establishing new ward boundaries pursuant to section 204B.135, subdivision 1, becomes effective on the date of the state primary election in the year ending in two, except that new ward boundaries established by a municipality in a year ending in one are effective on the date of the municipal primary election in the year ending in one.\nThe governing body of a city electing more than one council member in each ward may adopt an orderly transition schedule to biennial November elections in which only one council member in each ward is elected in any municipal general election.",
	"repealed": false
}