{
	"id": "325H.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/325H.03",
	"title": "325H.03 STANDARDS FOR TANNING EQUIPMENT.",
	"text": "(a) The tanning facility owner or operator must use only tanning equipment manufactured according to Code of Federal Regulations, title 21, part 1040.20. The exact nature of compliance must be based on the standards in effect at the time of manufacture as shown on the device identification label required by Code of Federal Regulations, title 21, part 1010.3.\n(b) Each assembly of tanning equipment must be designated for use by only one consumer at a time and must be equipped with a timer that complies with Code of Federal Regulations, title 21, part 1040.20(c)(2). The maximum timer interval may not exceed the manufacturer's maximum recommended exposure time. No timer interval may have an error exceeding plus or minus ten percent of the maximum timer interval for the product.\n(c) Tanning equipment must meet the National Fire Protection Association National Electrical Code.\n(d) Tanning equipment must include physical barriers to protect consumers from injury induced by touching or breaking the lamps.\n(e) The tanning facility owner or operator shall replace defective or damaged lamps, bulbs, or filters with a type intended for use in the affected tanning equipment as specified on the product label and having the same spectral distribution.\n(f) The tanning facility owner or operator shall replace ultraviolet lamps and bulbs, which are not otherwise defective or damaged, at a frequency or after a duration of use as may be recommended by the manufacturer of the lamps and bulbs.\n(g) The tanning facility owner or operator shall maintain a record of when the bulbs or lamps in each tanning booth or bed were replaced according to paragraphs (e) and (f).\n(h) Tanning equipment must have a control that enables the user to manually terminate radiation without pulling the electrical plug or coming in contact with the ultraviolet lamp.\n(i) The tanning facility operator shall instruct each user on: (1) the proper position to maintain relative to the tanning lamps; (2) the position of the safety railing, where applicable; (3) the manual switching device to terminate radiation; and (4) maximum time of exposure.\n(j) The tanning facility operator shall inspect the facility to ensure that the floors are dry before each individual's use, except that, in an apartment or a condominium, the operator may check the facility periodically.\n(k) The tanning facility operator shall monitor the use of the facility to ensure that the interior temperature does not exceed 100 degrees Fahrenheit.\n(l) The tanning facility operator shall comply with sanitizing procedures specified by the manufacturer of the tanning equipment between users.\nIn addition to the requirements in subdivision 1, tanning booths designed for stand-up use must comply with the following additional requirements:\n(1) booths must have physical barriers or other means, such as handrails or floor markings, to indicate the proper exposure distance between ultraviolet lamps and the consumer's skin;\n(2) booths must be constructed with sufficient strength and rigidity to withstand the stress of use and the impact of a falling individual;\n(3) access to booths must be of rigid construction; and\n(4) booths must be equipped with handrails and nonslip floors.",
	"repealed": false
}