{
	"id": "315.365",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.365",
	"title": "315.365 MERGER OF RELIGIOUS CORPORATIONS.",
	"text": "If two or more dioceses, synods, parishes, churches, congregations, or other religious bodies of the same denomination unite, reunite, merge, or consolidate and if, before doing so, each body has created a corporation under Minnesota law to hold and administer its properties or properties in trust for the benefit of the body or its component parts, these property corporations may merge and consolidate one with another or into a new property corporation organized for similar purposes by the new religious body. Authority for the property corporation merger and consolidation must first be given at an annual meeting of the new body or at a special meeting called for that purpose in accordance with the constitution, canon law, or other lawful provision for its governance.\nTo accomplish the merger and consolidation, the property corporations must execute an agreement containing:\n(1) the names of the property corporations who are parties to it;\n(2) the name and location of the principal office of the surviving corporation with which the property corporations are to be merged and consolidated;\n(3) the persons who constitute the governing board of the surviving corporation until their successors are elected and qualified;\n(4) the general purposes of the surviving corporation and the general description of the area to be served by it;\n(5) the date of adoption of the authorization for the merger and consolidation by the meeting of the united, reunited, merged, or consolidated religious body to which the merging or consolidating property corporations pertain; and\n(6) other provisions appropriate for the certificate of incorporation of property corporations of this character formed under Minnesota law.\nThe agreement must be executed by the corporate officers of each property corporation that is party to it and must be accompanied by the certificate of the secretary or other recording officer of the new religious body. The certificate must certify that the body has adopted in accordance with its constitution, canon law, or other general provisions for the governance of its affairs, a resolution authorizing the merger and consolidation. The agreement must also be accompanied by a certificate of the secretary or other recording officer of each of the property corporations, certifying that the members and governing body of each property corporation have adopted resolutions directing the execution of the agreement.\nThe agreement, when executed and certified, must be filed for record with the county recorder of the county where the surviving corporation's principal place of business is to locate. It must also be recorded with the county recorder of each other county of this state where the principal place of business of any of the property corporations was located according to the property corporation's certificate of incorporation.\nThe merger and consolidation takes effect when the agreement and certificates are filed for record with the county recorder.\nWhen a merger and consolidation takes effect, the corporate identity of each party to it continues in the surviving corporation. The legal title to assets held or owned by any property corporation that is a party to the merger and consolidation vests in the surviving corporation. The surviving corporation is entitled to receive gifts, devises, bequests, legacies, or other transfers or assignments of money or property, real, personal, or mixed, made after the merger directly or in trust to or intended for any of the constituent property corporations. Except as provided in section 501B.31, no properties or assets and no income of properties or assets held or received by a party to the merger and consolidation or by the surviving corporation shall be diverted from the uses and purposes for which they were received and held by the property corporations or from the uses and purposes for which they were expressed and intended.\nExcept as otherwise provided in the agreement, the provisions of the certificate of incorporation of the surviving corporation continue in force as to the surviving corporation and corporations merged and consolidated with it.",
	"repealed": false
}