{
	"id": "507.0943",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.0943",
	"title": "507.0943 VALIDITY AND TIME OF RECORDING OF ELECTRONIC DOCUMENTS.",
	"text": "(a) If a law requires, as a condition for recording, that a document be an original, on paper or another tangible medium, or in writing, the requirement is satisfied by an electronic document satisfying sections 507.0941 to 507.0948. If a law requires or refers to something related to tangible media including, without limitation, book, certificate, floor plan, page, volume, or words derived from them, the requirement or reference is satisfied by an electronic document satisfying sections 507.0941 to 507.0948.\n(b) If a law requires, as a condition for recording, that a document contain original signatures, the requirement is satisfied by an electronic signature.\n(c) A requirement that a document or a signature associated with a document be attested, acknowledged, verified, witnessed, or made under oath is satisfied if the electronic signature of the person authorized to perform that act, and all other information required to be included, is attached to or logically associated with the document or signature. A physical or electronic image of a stamp, impression, or seal need not accompany an electronic signature.\n(d) Notwithstanding the time of its delivery, an electronic document that is delivered to a recorder's office in recordable form is recorded for purposes of this chapter at the earlier of (i) the time the electronic document is accepted for recording or (ii) the next close of the recorder's office hours following the time of delivery.\n(e) Notwithstanding the time of its delivery, an electronic document is registered as to a parcel of registered land for purposes of chapters 508 and 508A when the electronic document is memorialized or otherwise noted on the certificate of title for the parcel.\n(f) A law that authorizes or requires any act to be performed with respect to any document affecting real property that is to be filed in the office of the recorder or registrar shall be deemed satisfied if the act is performed electronically in accordance with the standards established by the Electronic Real Estate Recording Commission. By way of illustration, the acts referred to in this section include, without limitation, the following words as well as words derived from them: affix, apply, attest, bind, certify, conform, contain, copy, deliver, draw, duplicate, endorse, enter, file, form, hold, issue, leave, make, mark, mount, note, open, present, print, proffer, receive, recite, record, refer, register, seal, send, sign, stamp, state, store, subscribe, witness, and write.",
	"repealed": false
}