{
	"id": "245A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.25",
	"title": "245A.25 RESIDENTIAL PROGRAM CERTIFICATIONS FOR COMPLIANCE WITH THE FAMILY FIRST PREVENTION SERVICES ACT.",
	"text": "(a) This section establishes the requirements that a children's residential facility or child foster residence setting must meet to be certified for the purposes of Title IV-E funding requirements as:\n(1) a qualified residential treatment program;\n(2) a residential setting specializing in providing care and supportive services for youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation;\n(3) a residential setting specializing in providing prenatal, postpartum, or parenting support for youth; or\n(4) a supervised independent living setting for youth who are 18 years of age or older.\n(b) This section does not apply to a foster family setting in which the license holder resides in the foster home.\n(c) Children's residential facilities licensed as detention settings according to Minnesota Rules, parts 2960.0230 to 2960.0290, or secure programs according to Minnesota Rules, parts 2960.0300 to 2960.0420, may not be certified under this section.\n(d) For purposes of this section, \"license holder\" means an individual, organization, or government entity that was issued a children's residential facility or foster residence setting license by the commissioner of human services under this chapter or by the commissioner of corrections under chapter 241.\n(e) Certifications issued under this section for foster residence settings may only be issued by the commissioner of human services and are not delegated to county or private licensing agencies under section 245A.16.\n(a) By July 1, 2021, the commissioner of human services must offer certifications to license holders for the following types of programs:\n(1) qualified residential treatment programs;\n(2) residential settings specializing in providing care and supportive services for youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation;\n(3) residential settings specializing in providing prenatal, postpartum, or parenting support for youth; and\n(4) supervised independent living settings for youth who are 18 years of age or older.\n(b) An applicant or license holder must submit a request for certification under this section on a form and in a manner prescribed by the commissioner of human services. The decision of the commissioner of human services to grant or deny a certification request is final and not subject to appeal under chapter 14.\n(a) Programs certified under subdivision 4 or 5 must provide services to a person according to a trauma-informed model of care that meets the requirements of this subdivision, except that programs certified under subdivision 5 are not required to meet the requirements of paragraph (e).\n(b) For the purposes of this section, \"trauma-informed care\" means care that:\n(1) acknowledges the effects of trauma on a person receiving services and on the person's family;\n(2) modifies services to respond to the effects of trauma on the person receiving services;\n(3) emphasizes skill and strength-building rather than symptom management; and\n(4) focuses on the physical and psychological safety of the person receiving services and the person's family.\n(c) The license holder must have a process for identifying the signs and symptoms of trauma in a youth and must address the youth's needs related to trauma. This process must include:\n(1) screening for trauma by completing a trauma-specific screening tool with each youth upon the youth's admission or obtaining the results of a trauma-specific screening tool that was completed with the youth within 30 days prior to the youth's admission to the program; and\n(2) ensuring that trauma-based interventions targeting specific trauma-related symptoms are available to each youth when needed to assist the youth in obtaining services. For qualified residential treatment programs, this must include the provision of services in paragraph (e).\n(d) The license holder must develop and provide services to each youth according to the principles of trauma-informed care including:\n(1) recognizing the impact of trauma on a youth when determining the youth's service needs and providing services to the youth;\n(2) allowing each youth to participate in reviewing and developing the youth's individualized treatment or service plan;\n(3) providing services to each youth that are person-centered and culturally responsive; and\n(4) adjusting services for each youth to address additional needs of the youth.\n(e) In addition to the other requirements of this subdivision, qualified residential treatment programs must use a trauma-based treatment model that includes:\n(1) assessing each youth to determine if the youth needs trauma-specific treatment interventions;\n(2) identifying in each youth's treatment plan how the program will provide trauma-specific treatment interventions to the youth;\n(3) providing trauma-specific treatment interventions to a youth that target the youth's specific trauma-related symptoms; and\n(4) training all clinical staff of the program on trauma-specific treatment interventions.\n(f) At the license holder's program, the license holder must provide a physical, social, and emotional environment that:\n(1) promotes the physical and psychological safety of each youth;\n(2) avoids aspects that may be retraumatizing;\n(3) responds to trauma experienced by each youth and the youth's other needs; and\n(4) includes designated spaces that are available to each youth for engaging in sensory and self-soothing activities.\n(g) The license holder must base the program's policies and procedures on trauma-informed principles. In the program's policies and procedures, the license holder must:\n(1) describe how the program provides services according to a trauma-informed model of care;\n(2) describe how the program's environment fulfills the requirements of paragraph (f);\n(3) prohibit the use of aversive consequences for a youth's violation of program rules or any other reason;\n(4) describe the process for how the license holder incorporates trauma-informed principles and practices into the organizational culture of the license holder's program; and\n(5) if the program is certified to use restrictive procedures under Minnesota Rules, part 2960.0710, describe how the program uses restrictive procedures only when necessary for a youth in a manner that addresses the youth's history of trauma and avoids causing the youth additional trauma.\n(h) Prior to allowing a staff person to have direct contact, as defined in section 245C.02, subdivision 11, with a youth and annually thereafter, the license holder must train each staff person about:\n(1) concepts of trauma-informed care and how to provide services to each youth according to these concepts; and\n(2) impacts of each youth's culture, race, gender, and sexual orientation on the youth's behavioral health and traumatic experiences.\n(a) To be certified as a qualified residential treatment program, a license holder must meet:\n(1) the definition of a qualified residential treatment program in section 260C.007, subdivision 26d;\n(2) the requirements for providing trauma-informed care and using a trauma-based treatment model in subdivision 3; and\n(3) the requirements of this subdivision.\n(b) For each youth placed in the license holder's program, the license holder must collaborate with the responsible social services agency and other appropriate parties to implement the youth's out-of-home placement plan and the youth's short-term and long-term mental health and behavioral health goals in the assessment required by sections 260C.212, subdivision 1; 260C.704; and 260C.708.\n(c) A qualified residential treatment program must use a trauma-based treatment model that meets all of the requirements of subdivision 3 that is designed to address the needs, including clinical needs, of youth with serious emotional or behavioral disorders or disturbances. The license holder must develop, document, and review a treatment plan for each youth according to the requirements of Minnesota Rules, parts 2960.0180, subpart 2, item B; and 2960.0190, subpart 2.\n(d) The following types of staff must be on-site according to the program's treatment model and must be available 24 hours a day and seven days a week to provide care within the scope of their practice:\n(1) a registered nurse or licensed practical nurse licensed by the Minnesota Board of Nursing to practice professional nursing or practical nursing as defined in section 148.171, subdivisions 14 and 15; and\n(2) other licensed clinical staff to meet each youth's clinical needs.\n(e) A qualified residential treatment program must be accredited by one of the following independent, not-for-profit organizations:\n(1) the Commission on Accreditation of Rehabilitation Facilities (CARF);\n(2) the Joint Commission;\n(3) the Council on Accreditation (COA); or\n(4) another independent, not-for-profit accrediting organization approved by the Secretary of the United States Department of Health and Human Services.\n(f) The license holder must facilitate participation of a youth's family members in the youth's treatment program, consistent with the youth's best interests and according to the youth's out-of-home placement plan required by sections 260C.212, subdivision 1; and 260C.708.\n(g) The license holder must contact and facilitate outreach to each youth's family members, including the youth's siblings, and must document outreach to the youth's family members in the youth's file, including the contact method and each family member's contact information. In the youth's file, the license holder must record and maintain the contact information for all known biological family members and fictive kin of the youth.\n(h) The license holder must document in the youth's file how the program integrates family members into the treatment process for the youth, including after the youth's discharge from the program, and how the program maintains the youth's connections to the youth's siblings.\n(i) The program must provide discharge planning and family-based aftercare support to each youth for at least six months after the youth's discharge from the program. When providing aftercare to a youth, the program must have monthly contact with the youth and the youth's caregivers to promote the youth's engagement in aftercare services and to regularly evaluate the family's needs. The program's monthly contact with the youth may be face-to-face, by telephone, or virtual.\n(j) The license holder must maintain a service delivery plan that describes how the program provides services according to the requirements in paragraphs (b) to (i).\n(a) To be certified as a residential setting specializing in providing care and supportive services for youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation, a license holder must meet the requirements of this subdivision.\n(b) Settings certified according to this subdivision are exempt from the requirements of section 245A.04, subdivision 11, paragraph (b).\n(c) The program must use a trauma-informed model of care that meets all of the applicable requirements of subdivision 3, and that is designed to address the needs, including emotional and mental health needs, of youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation.\n(d) The program must provide high-quality care and supportive services for youth who have been or are at risk of becoming victims of sex trafficking or commercial sexual exploitation and must:\n(1) offer a safe setting to each youth designed to prevent ongoing and future trafficking of the youth;\n(2) provide equitable, culturally responsive, and individualized services to each youth;\n(3) assist each youth with accessing medical, mental health, legal, advocacy, and family services based on the youth's individual needs;\n(4) provide each youth with relevant educational, life skills, and employment supports based on the youth's individual needs;\n(5) offer a trafficking prevention education curriculum and provide support for each youth at risk of future sex trafficking or commercial sexual exploitation; and\n(6) engage with the discharge planning process for each youth and the youth's family.\n(e) The license holder must maintain a service delivery plan that describes how the program provides services according to the requirements in paragraphs (c) and (d).\n(f) The license holder must ensure that each staff person who has direct contact, as defined in section 245C.02, subdivision 11, with a youth served by the license holder's program completes a human trafficking training approved by the Department of Human Services' Children and Family Services Administration before the staff person has direct contact with a youth served by the program and annually thereafter. For programs certified prior to January 1, 2022, the license holder must ensure that each staff person at the license holder's program completes the initial training by January 1, 2022.\n(a) To be certified as a residential setting specializing in providing prenatal, postpartum, or parenting supports for youth, a license holder must meet the requirements of this subdivision.\n(b) The license holder must collaborate with the responsible social services agency and other appropriate parties to implement each youth's out-of-home placement plan required by section 260C.212, subdivision 1.\n(c) The license holder must specialize in providing prenatal, postpartum, or parenting supports for youth and must:\n(1) provide equitable, culturally responsive, and individualized services to each youth;\n(2) assist each youth with accessing postpartum services during the same period of time that a woman is considered pregnant for the purposes of medical assistance eligibility under section 256B.055, subdivision 6, including providing each youth with:\n(i) sexual and reproductive health services and education; and\n(ii) a postpartum mental health assessment and follow-up services; and\n(3) discharge planning that includes the youth and the youth's family.\n(d) On or before the date of a child's initial physical presence at the facility, the license holder must provide education to the child's parent related to safe bathing and reducing the risk of sudden unexpected infant death and abusive head trauma from shaking infants and young children. The license holder must use the educational material developed by the commissioner of human services to comply with this requirement. At a minimum, the education must address:\n(1) instruction that: (i) a child or infant should never be left unattended around water; (ii) a tub should be filled with only two to four inches of water for infants; and (iii) an infant should never be put into a tub when the water is running; and\n(2) the risk factors related to sudden unexpected infant death and abusive head trauma from shaking infants and young children and means of reducing the risks, including the safety precautions identified in section 142B.46 and the risks of co-sleeping.\nThe license holder must document the parent's receipt of the education and keep the documentation in the parent's file. The documentation must indicate whether the parent agrees to comply with the safeguards described in this paragraph. If the parent refuses to comply, program staff must provide additional education to the parent as described in the parental supervision plan. The parental supervision plan must include the intervention, frequency, and staff responsible for the duration of the parent's participation in the program or until the parent agrees to comply with the safeguards described in this paragraph.\n(e) On or before the date of a child's initial physical presence at the facility, the license holder must document the parent's capacity to meet the health and safety needs of the child while on the facility premises considering the following factors:\n(1) the parent's physical and mental health;\n(2) the parent being under the influence of drugs, alcohol, medications, or other chemicals;\n(3) the child's physical and mental health; and\n(4) any other information available to the license holder indicating that the parent may not be able to adequately care for the child.\n(f) The license holder must have written procedures specifying the actions that staff shall take if a parent is or becomes unable to adequately care for the parent's child.\n(g) If the parent refuses to comply with the safeguards described in paragraph (d) or is unable to adequately care for the child, the license holder must develop a parental supervision plan in conjunction with the parent. The plan must account for any factors in paragraph (e) that contribute to the parent's inability to adequately care for the child. The plan must be dated and signed by the staff person who completed the plan.\n(h) The license holder must have written procedures addressing whether the program permits a parent to arrange for supervision of the parent's child by another youth in the program. If permitted, the facility must have a procedure that requires staff approval of the supervision arrangement before the supervision by the nonparental youth occurs. The procedure for approval must include an assessment of the nonparental youth's capacity to assume the supervisory responsibilities using the criteria in paragraph (e). The license holder must document the license holder's approval of the supervisory arrangement and the assessment of the nonparental youth's capacity to supervise the child and must keep this documentation in the file of the parent whose child is being supervised by the nonparental youth.\n(i) The license holder must maintain a service delivery plan that describes how the program provides services according to paragraphs (b) to (h).\n(a) To be certified as a supervised independent living setting for youth who are 18 years of age or older, a license holder must meet the requirements of this subdivision.\n(b) A license holder must provide training, counseling, instruction, supervision, and assistance for independent living, according to the needs of the youth being served.\n(c) A license holder may provide services to assist the youth with locating housing, money management, meal preparation, shopping, health care, transportation, and any other support services necessary to meet the youth's needs and improve the youth's ability to conduct such tasks independently.\n(d) The service plan for the youth must contain an objective of independent living skills.\n(e) The license holder must maintain a service delivery plan that describes how the program provides services according to paragraphs (b) to (d).\n(a) For a program licensed by the commissioner of human services, the commissioner of human services may review a program's compliance with certification requirements by conducting an inspection, a licensing review, or an investigation of the program. The commissioner may issue a correction order to the license holder for a program's noncompliance with the certification requirements of this section. For a program licensed by the commissioner of human services, a license holder must make a request for reconsideration of a correction order according to section 245A.06, subdivision 2.\n(b) For a program licensed by the commissioner of children, youth, and families or the commissioner of corrections, the commissioner of human services may review the program's compliance with the requirements for a certification issued under this section biennially and may issue a correction order identifying the program's noncompliance with the requirements of this section. The correction order must state the following:\n(1) the conditions that constitute a violation of a law or rule;\n(2) the specific law or rule violated; and\n(3) the time allowed for the program to correct each violation.\n(c) For a program licensed by the commissioner of children, youth, and families or the commissioner of corrections, if a license holder believes that there are errors in the correction order of the commissioner of human services, the license holder may ask the Department of Human Services to reconsider the parts of the correction order that the license holder alleges are in error. To submit a request for reconsideration, the license holder must send a written request for reconsideration by United States mail to the commissioner of human services. The request for reconsideration must be postmarked within 20 calendar days of the date that the correction order was received by the license holder and must:\n(1) specify the parts of the correction order that are alleged to be in error;\n(2) explain why the parts of the correction order are in error; and\n(3) include documentation to support the allegation of error.\nA request for reconsideration does not stay any provisions or requirements of the correction order. The commissioner of human services' disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\n(d) Nothing in this subdivision prohibits the commissioner of human services from decertifying a license holder according to subdivision 9 prior to issuing a correction order.\n(a) The commissioner of human services may rescind a certification issued under this section if a license holder fails to comply with the certification requirements in this section.\n(b) The license holder may request reconsideration of a decertification by notifying the commissioner of human services by certified mail or personal service. The license holder must request reconsideration of a decertification in writing. If the license holder sends the request for reconsideration of a decertification by certified mail, the license holder must send the request by United States mail to the commissioner of human services and the request must be postmarked within 20 calendar days after the license holder received the notice of decertification. If the license holder requests reconsideration of a decertification by personal service, the request for reconsideration must be received by the commissioner of human services within 20 calendar days after the license holder received the notice of decertification. When submitting a request for reconsideration of a decertification, the license holder must submit a written argument or evidence in support of the request for reconsideration.\n(c) The commissioner of human services' disposition of a request for reconsideration is final and not subject to appeal under chapter 14.\nThe commissioner of human services may grant variances to the requirements in this section that do not affect a youth's health or safety or compliance with federal requirements for Title IV-E funding if the conditions in section 245A.04, subdivision 9, are met.",
	"repealed": false
}