{
	"id": "103B.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.311",
	"title": "103B.311 COUNTY WATER PLANNING AND MANAGEMENT.",
	"text": "Each county is encouraged to develop and implement a local water management plan. Each county that develops and implements a plan has the duty and authority to:\n(1) prepare and adopt a local water management plan that meets the requirements of this section and section 103B.315;\n(2) review water and related land resources plans and official controls submitted by local units of government to assure consistency with the local water management plan; and\n(3) exercise any and all powers necessary to assure implementation of local water management plans.\nThe county is responsible for preparing, adopting, and assuring implementation of the local water management plan, but may delegate all or part of the preparation of the plan to a local unit of government, a regional development commission, or a resource conservation and development committee. The county may not delegate authority for the exercise of eminent domain, taxation, or assessment to a local unit of government that does not possess those powers.\n(a) To assure the coordination of efforts of all local units of government within a county during the preparation and implementation of a local water management plan, each county intending to adopt a plan shall conduct meetings with other local units of government and may execute agreements with other local units of government establishing the responsibilities of each unit during the preparation and implementation of the local water management plan.\n(b) Each county intending to adopt a plan shall coordinate its planning program with contiguous counties. Before meeting with local units of government, a county board shall notify the county boards of each county contiguous to it that the county is about to begin preparing its local water management plan and is encouraged to request and hold a joint meeting with the contiguous county boards to consider the planning process.\n(a) A local water management plan must:\n(1) cover the entire area within a county;\n(2) address water problems in the context of watershed units and groundwater systems;\n(3) be based upon principles of sound hydrologic management of water, effective environmental protection, and efficient management;\n(4) be consistent with local water management plans prepared by counties and watershed management organizations wholly or partially within a single watershed unit or groundwater system; and\n(5) the local water management plan must specify the period covered by the local water management plan and must extend at least five years but no more than ten years from the date the board approves the local water management plan. Local water management plans that contain revision dates inconsistent with this section must comply with that date, provided it is not more than ten years beyond the date of board approval.\n(b) Existing water and related land resources plans, including plans related to agricultural land preservation programs developed pursuant to chapter 40A, must be fully utilized in preparing the local water management plan. Duplication of the existing plans is not required.\n[Repealed, 2003 c 128 art 1 s 176]\n[Repealed, 2003 c 128 art 1 s 176]\n[Repealed, 2003 c 128 art 1 s 176]",
	"repealed": false
}