{
	"id": "148.905",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.905",
	"title": "148.905 DUTIES OF THE BOARD.",
	"text": "The board shall:\n(1) adopt and enforce rules for licensing psychologists and for regulating their professional conduct;\n(2) adopt and enforce rules of conduct governing the practice of psychology;\n(3) adopt and implement rules for examinations which shall be held at least once a year to assess applicants' knowledge and skills. The examinations may be written or oral or both, and may be administered by the board or by institutions or individuals designated by the board. Before the adoption and implementation of a new national examination, the board must consider whether the examination:\n(i) demonstrates reasonable reliability and external validity;\n(ii) is normed on a reasonable representative and diverse national sample; and\n(iii) is intended to assess an applicant's education, training, and experience for the purpose of public protection;\n(4) issue licenses to individuals qualified under sections 148.907, 148.909, 148.915, and 148.916, according to the procedures for licensing in Minnesota Rules;\n(5) issue copies of the rules for licensing to all applicants;\n(6) establish and maintain annually a register of current licenses;\n(7) establish and collect fees for the issuance and renewal of licenses and other services by the board. Fees shall be set to defray the cost of administering the provisions of sections 148.88 to 148.98 including costs for applications, examinations, enforcement, materials, and the operations of the board;\n(8) educate the public on the requirements for licenses issued by the board and on the rules of conduct;\n(9) enable the public to file complaints against applicants or licensees who may have violated the Psychology Practice Act;\n(10) adopt and implement requirements for continuing education; and\n(11) establish or approve programs that qualify for professional psychology continuing educational credit. The board may hire consultants, agencies, or professional psychological associations to establish and approve continuing education courses.\nThe board may adopt rules necessary to define standards or to carry out the provisions of sections 148.88 to 148.98. Rules shall be adopted according to chapter 14.",
	"repealed": false
}