{
	"id": "256B.0951",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0951",
	"title": "256B.0951 QUALITY ASSURANCE COMMISSION.",
	"text": "The Quality Assurance Commission is established. The commission consists of at least 14 but not more than 21 members as follows: at least three but not more than five members representing advocacy organizations; at least three but not more than five members representing consumers, families, and their legal representatives; at least three but not more than five members representing service providers; at least three but not more than five members representing counties; and the commissioner of human services or the commissioner's designee. The first commission shall establish membership guidelines for the transition and recruitment of membership for the commission's ongoing existence. Members of the commission who do not receive a salary or wages from an employer for time spent on commission duties may receive a per diem payment when performing commission duties and functions. All members may be reimbursed for expenses related to commission activities.\n(a) The commission may hire staff to perform the duties assigned in this section.\n(b) The commission may charge fees for its services.\n(c) The commission may provide technical assistance to other counties, families, providers, and advocates interested in participating in a quality assurance system under section 256B.095, paragraph (b) or (c).\n(a) By October 1, 1997, the commission, in cooperation with the commissioners of human services and health, shall do the following: (1) approve an alternative quality assurance licensing system based on the evaluation of outcomes; (2) approve measurable outcomes in the areas of health and safety, consumer evaluation, education and training, providers, and systems that shall be evaluated during the alternative licensing process; and (3) establish variable licensure periods not to exceed three years based on outcomes achieved. For purposes of this subdivision, \"outcome\" means the behavior, action, or status of a person that can be observed or measured and can be reliably and validly determined.\n(b) By January 15, 1998, the commission shall approve, in cooperation with the commissioner of human services, a training program for members of the quality assurance teams established under section 256B.0952, subdivision 4.\n(c) The commission and the commissioner shall establish an ongoing review process for the alternative quality assurance licensing system. The review shall take into account the comprehensive nature of the alternative system, which is designed to evaluate the broad spectrum of licensed and unlicensed entities that provide services to clients.\n(d) The commission, in consultation with the commissioner, shall work cooperatively with other populations to expand the system to those populations and identify barriers to expansion. The commissioner shall report findings and recommendations to the legislature by December 15, 2004.\nThe commission may recommend to the commissioners of human services and health variances from the standards governing licensure of programs for persons with disabilities in order to improve the quality of services by implementing an alternative disabilities licensing system if the commission determines that the alternative licensing system does not adversely affect the health or safety of persons being served by the licensed program nor compromise the qualifications of staff to provide services.\nThe safety standards, rights, or procedural protections under sections 245.825; 245.91 to 245.97; 245A.09, subdivision 2, paragraph (c), clauses (2) and (5); 245A.12; 245A.13; 252.41, subdivision 9; 256B.092, subdivisions 1b, clause (7), and 10; and 626.557; and chapters 245C and 260E, and procedures for the monitoring of psychotropic medications shall not be varied under the alternative quality assurance licensing system. The commission may make recommendations to the commissioners of human services and health or to the legislature regarding alternatives to or modifications of the rules and procedures referenced in this subdivision.\n[Repealed, 1Sp2001 c 9 art 3 s 76]\nIf a federal waiver is approved under subdivision 8, the commissioner of health may exempt residents of intermediate care facilities for persons with developmental disabilities (ICFs/DD) who participate in the alternative quality assurance system established in section 256B.095 from the requirements of Minnesota Rules, chapter 4665.\nThe commissioner of human services shall seek a federal waiver to allow intermediate care facilities for persons with developmental disabilities (ICFs/DD) in region 10 of Minnesota to participate in the alternative licensing system. If it is necessary for purposes of participation in this alternative licensing system for a facility to be decertified as an ICF/DD facility according to the terms of the federal waiver, when the facility seeks recertification under the provisions of ICF/DD regulations at the end of the demonstration project, it will not be considered a new ICF/DD as defined under section 252.291 provided the licensed capacity of the facility did not increase during its participation in the alternative licensing system. The provisions of sections 252.28, 252.292, and 256B.5011 to 256B.5015 will remain applicable for counties in region 10 of Minnesota and the ICFs/DD located within those counties notwithstanding a county's participation in the alternative licensing system.\nThe commission, in consultation with the commissioner of human services, shall conduct an evaluation of the quality assurance system, and present a report to the commissioner by June 30, 2004.",
	"repealed": false
}