{
	"id": "103G.701",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.701",
	"title": "103G.701 STREAM MAINTENANCE PROGRAM.",
	"text": "The commissioner shall establish a stream maintenance program. The program must include grants-in-aid to participating counties.\nA county desiring to participate in the stream maintenance program must submit an application for the proposed work to the commissioner on forms provided by the commissioner. Unless waived by the commissioner, the county must submit the following information with its application:\n(1) a map of the county showing the stream and the specific reaches of the stream to be maintained;\n(2) photographs showing the nature and extent of the maintenance problem; and\n(3) a resolution by the county board of commissioners asking to participate in the program and agreeing to provide at least 25 percent of the cost of the maintenance project.\nAfter approving a stream maintenance project, the commissioner shall contract with the county for performance of work necessary to do the project. The contract may provide that the county share of the cost of the project is paid in the form of services provided by the county.\nThe commissioner may grant money for:\n(1) cutting and removal of brush and dead or downed trees; and\n(2) removal of large rocks and other debris such as concrete, asphalt, or scrap material.\n(a) The commissioner must apportion grant money according to the relative severity of the maintenance problem, the date of application for the grant, and the availability of funds.\n(b) A grant may not exceed 75 percent of the total cost of a stream maintenance project.\n(c) Money may not be disbursed for excavation, filling, or for work performed until an application for the project is filed with the commissioner.\n(d) The stream maintenance work must be performed by the county or under county supervision.\nA county may appropriate from its general revenue fund sufficient funds to match the grants-in-aid authorized in this section.",
	"repealed": false
}