{
	"id": "60A.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.127",
	"title": "60A.127 INDEPENDENT APPRAISALS OF CERTAIN PROPERTIES.",
	"text": "Each domestic insurer that does not obtain independent appraisals of all distressed, delinquent, and restructured mortgage loans and use such appraisals to determine the carrying values for its annual statement shall obtain independent appraisals of a random sample of those loans for which it did not obtain and use such appraisals. The independent appraisals must be obtained by the insurer no later than 60 days after the filing of the insurer's annual statement. The loans to be sampled do not include loans for which the insurer determined the carrying value on the basis of guarantees or other credit enhancements.\nThe commissioner may adopt rules specifying the percentage of distressed, delinquent, and restructured loans for which the insurer must obtain an independent appraisal. The percentage may vary between insurers or types of loans and may apply to the number of loans, the dollar value of loans, or both. The rules may also specify a procedure for determining how to identify the specific loans for which an appraisal is required. The commissioner may adopt under this subdivision only rules that would require sampling no less extensive than that required by subdivision 3.\n(a) Unless and until rules authorized by subdivision 2 are adopted, each domestic insurer must:\n(1) obtain an independent appraisal of five percent of its distressed, delinquent, or restructured loans required to be sampled under subdivision 1; and\n(2) establish a uniform system of assigning sequential numbers to its distressed, delinquent, or restructured loans based upon the date on which a loan first enters one of those categories, and then obtain an independent appraisal of every 20th loan required to be sampled under subdivision 1, beginning with the tenth loan or with the loan having another number that the commissioner may announce on or within five business days after the due date for filing of the annual statement.\n(b) A domestic insurer may use a sampling procedure different from that described in paragraph (a) with the prior approval of the commissioner. The commissioner may grant such approval only if the different procedure would result in a sampling that is at least as accurate and as extensive under the circumstances as the method required by paragraph (a).\nThe independent appraisals must be kept in the insurer's records and must be available to the commissioner upon request. Each insurer must file with the commissioner an annual report listing each mortgage loan for which the insurer obtained an independent appraisal under this section and showing for each of those loans the appraisal value, the carrying value determined by the insurer, and other information required by the commissioner. The report must be filed with the commissioner no later than 120 days after the filing of the annual report.\nIf the commissioner determines, on the basis of the report of independent appraisals required by subdivision 4, that the carrying values shown on the annual statement, determined by methods other than an independent appraisal, overstate the market value of the loans required to be sampled, the commissioner may require any of the following procedures:\n(1) independent appraisals of additional loans from the loans required to be sampled;\n(2) filing of a supplement to, or a revision of, the annual statement, showing revised carrying values for all or any appropriate portion of the loans required to be sampled; and\n(3) a second independent appraisal for any loan for which an independent appraisal was obtained under this section.\nThe insurer shall not obtain more than one-third of the independent appraisals required under this section from any one appraiser or from any one firm.\nThis section does not limit any powers otherwise available to the commissioner.",
	"repealed": false
}