{
	"id": "473.756",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.756",
	"title": "473.756 POWERS OF AUTHORITY.",
	"text": "The authority may sue and be sued. The authority is a public body and the ballpark and public infrastructure are public improvements within the meaning of chapter 562. The authority is a municipality within the meaning of chapter 466.\nThe authority may acquire from any public or private entity by lease, purchase, gift, or devise all necessary right, title, and interest in and to real property, air rights, and personal property deemed necessary to the purposes contemplated by Laws 2006, chapter 257.\nExcept as otherwise provided in Laws 2006, chapter 257, the authority is subject to chapters 13 and 13D.\nThe authority may equip, improve, operate, manage, maintain, and control the ballpark and related facilities constructed, remodeled, or acquired under Laws 2006, chapter 257, as smoke-free facilities, subject to the rights and obligations transferred to and assumed by the team or other user under the terms of a lease or use agreement, but in no case may a lease or use agreement permit smoking in the ballpark.\nThe authority may sell, lease, or otherwise dispose of any real or personal property acquired by it that is no longer required for accomplishment of its purposes. The property may be sold in accordance with the procedures provided by section 469.065, except subdivisions 6 and 7, to the extent the authority deems it to be practical and consistent with Laws 2006, chapter 257. Title to the ballpark shall not be transferred or sold prior to the effective date of enactment of any legislation approving such transfer or sale.\nThe authority may employ persons and contract for services necessary to carry out its functions, including the utilization of employees and consultants retained by other governmental entities. The authority shall enter into an agreement with the city of Minneapolis regarding traffic control for the ballpark.\nThe authority may accept monetary contributions, property, services, and grants or loans of money or other property from the United States, the state, any subdivision of the state, any agency of those entities, or any person for any of its purposes, and may enter into any agreement required in connection with them. The authority shall hold, use, and dispose of the money, property, or services according to the terms of the monetary contributions, grant, loan, or agreement.\nThe authority may conduct research studies and programs; collect and analyze data; prepare reports, maps, charts, and tables; and conduct all necessary hearings and investigations in connection with its functions.\nThe authority may lease, license, or enter into use agreements and may fix, alter, charge, and collect rentals, fees, and charges for the use, occupation, and availability of part or all of any premises, property, or facilities under its ownership, operation, or control for purposes that will provide athletic, educational, cultural, commercial, or other entertainment, instruction, or activity for the citizens of Minnesota and visitors. Any such use agreement may provide that the other contracting party has exclusive use of the premises at the times agreed upon, as well as the right to retain some or all revenues from ticket sales, suite licenses, concessions, advertising, naming rights, and other revenues derived from the ballpark. The lease or use agreement with a team shall provide for the payment by the team of operating and maintenance costs and expenses and provide other terms the authority and team agree to.\nThe authority may require any employee to obtain and file with it an individual bond or fidelity insurance policy. It may procure insurance in the amounts it considers necessary against liability of the authority or its officers and employees for personal injury or death and property damage or destruction, consistent with chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property.\nThe acquisition and betterment of a ballpark by the authority must be conducted pursuant to Laws 2006, chapter 257, and are not subject to sections 473.165 and 473.173. Section 116J.994, does not apply to any transactions of the county, the authority, or other governmental entity related to the ballpark or public infrastructure, or to any tenant or other users of them.\nThe authority may enter into a development agreement with the team, the county, or any other entity relating to the construction, financing, and use of the ballpark and related facilities and public infrastructure. The authority may contract for materials, supplies, and equipment in accordance with sections 471.345 and 473.754, except that the authority, with the consent of the county, may employ or contract with persons, firms, or corporations to perform one or more or all of the functions of architect, engineer, or construction manager with respect to all or any part of the ballpark and public infrastructure. Alternatively, at the request of the team and with the consent of the county, the authority shall authorize the team to provide for the design and construction of the ballpark and related public infrastructure, subject to terms of Laws 2006, chapter 257. The construction manager may enter into contracts with contractors for labor, materials, supplies, and equipment for the construction of the ballpark and related public infrastructure through the process of public bidding, except that the construction manager may, with the consent of the authority or the team:\n(1) narrow the listing of eligible bidders to those which the construction manager determines to possess sufficient expertise to perform the intended functions;\n(2) award contracts to the contractors that the construction manager determines provide the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c), which are not required to be the lowest responsible bidder; and\n(3) for work the construction manager determines to be critical to the completion schedule, award contracts on the basis of competitive proposals or perform work with its own forces without soliciting competitive bids if the construction manager provides evidence of competitive pricing.\nThe authority shall require that the construction manager certify, before the contract is signed, a fixed and stipulated construction price and completion date to the authority and post a performance bond in an amount at least equal to 100 percent of the certified price, to cover any costs which may be incurred in excess of the certified price, including but not limited to costs incurred by the authority or loss of revenues resulting from incomplete construction on the completion date. The authority may secure surety bonds as provided in section 574.26, securing payment of just claims in connection with all public work undertaken by it. Persons entitled to the protection of the bonds may enforce them as provided in sections 574.28 to 574.32, and shall not be entitled to a lien on any property of the authority under the provisions of sections 514.01 to 514.16. Contracts for construction and operation of the ballpark must include programs, including Youthbuild, to provide for participation by small local businesses and businesses owned by people of color, and the inclusion of women and people of color in the workforces of contractors and ballpark operators. The construction of the ballpark is a \"project\" as that term is defined in section 177.42, subdivision 2, and is subject to the prevailing wage law under sections 177.41 to 177.43.\nIn addition to the powers expressly granted in Laws 2006, chapter 257, the authority has all powers necessary or incidental thereto.\nThe authority must consider the ballpark implementation committee's recommendations as they relate to the design and construction of the ballpark, after the recommendations are considered by the city council as provided in section 473.758.",
	"repealed": false
}