{
	"id": "181.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.13",
	"title": "181.13 PENALTY FOR FAILURE TO PAY WAGES PROMPTLY.",
	"text": "(a) When any employer employing labor within this state discharges an employee, the wages or commissions actually earned and unpaid at the time of the discharge are immediately due and payable upon demand of the employee. Wages are actually earned and unpaid if the employee was not paid for all time worked at the employee's regular rate of pay or at the rate required by law, including any applicable statute, regulation, rule, ordinance, government resolution or policy, contract, or other legal authority, whichever rate of pay is greater. If the employee's earned wages and commissions are not paid within 24 hours after demand, whether the employment was by the day, hour, week, month, or piece or by commissions, the employer is in default. In addition to recovering the wages and commissions actually earned and unpaid, the discharged employee may charge and collect a penalty equal to the amount of the employee's average daily earnings at the employee's regular rate of pay or the rate required by law, whichever rate is greater, for each day up to 15 days, that the employer is in default, until full payment or other settlement, satisfactory to the discharged employee, is made. In the case of a public employer where approval of expenditures by a governing board is required, the 24-hour period for payment does not commence until the date of the first regular or special meeting of the governing board following discharge of the employee. An employee's demand for payment under this section must be in writing but need not state the precise amount of unpaid wages or commissions. An employee may directly seek and recover payment from an employer under this section even if the employee is not a party to a contract that requires the employer to pay the employee at the rate of pay demanded by the employee, so long as the contract or any applicable statute, regulation, rule, ordinance, government resolution or policy, or other legal authority requires payment to the employee at the particular rate of pay. The employee shall be able to directly seek payment at the highest rate of pay provided in the contract or applicable law, and any other related remedies as provided in this section.\n(b) The wages and commissions must be paid in the usual manner of payment unless the employee requests that the wages and commissions be sent through the mails. If, in accordance with a request by the employee, the employee's wages and commissions are sent to the employee through the mail, the wages and commissions are paid as of the date of their postmark.",
	"repealed": false
}