{
	"id": "375.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.055",
	"title": "375.055 COUNTY COMMISSIONERS' COMPENSATION.",
	"text": "(a) The county commissioners in all counties, except Hennepin and Ramsey, shall receive as compensation for services rendered by them for their respective counties, annual salaries and in addition may receive per diem payments and reimbursement for necessary expenses in performing the duties of the office as set by resolution of the county board. The salary and schedule of per diem payments shall not be effective until January 1 of the next year. The resolution shall contain a statement of the new salary on an annual basis. The board may establish a schedule of per diem payments for service by individual county commissioners on any board, committee, or commission of county government including committees of the board, or for the performance of services by individual county commissioners when required by law. In addition to its publication in the official newspaper of the county as part of the proceedings of the meeting of the county board, the resolution setting the salary and schedule of per diem payments shall be published in one other newspaper of the county, if there is one located in a different municipality in the county than the official newspaper. The salary of a county commissioner or the schedule of per diem payments shall not change except in accordance with this subdivision.\n(b) Notwithstanding paragraph (a), a resolution adopted by the county board to decrease commissioners' salaries or per diem payments may take effect at any time.\nMS 1965 [Repealed, 1967 c 716 s 5]\nMS 1974 [Repealed, 1975 c 301 s 16]\nExcept as otherwise herein provided, all acts or parts of acts, which relate to salaries of county commissioners, in any county having a population of less than 100,000 according to the 1960 federal census, are superseded as of January 1, 1969 insofar as they are inconsistent with this section.\nExcept as provided herein nothing in this section shall limit the right of a county commissioner to collect and retain any fees, per diem payment made pursuant to subdivision 1, or any mileage or expense allowance, or reimbursement of expenses in attending meetings or in the conduct of the business of a board, commission or committee of county government on which the commissioner serves, which the commissioner is now authorized by any other law to collect and retain in addition to the stated annual salary; or to participate in any group insurance program instituted by the county board for county officers and employees. Members of the county board shall not receive a per diem for service on the board of auditors, the board of equalization, or the canvassing board.\nThe salary heretofore paid any county commissioner under any existing law insofar as it is inconsistent with this section, which may be found to be unconstitutional or invalid for any reason by a court, is legalized and made valid.\nMS 1949 [Repealed, 1951 c 327 s 6]\nMS 1965 [Repealed, 1967 c 716 s 5]\nThe county board may reimburse a newly elected county commissioner for expenses incurred prior to assuming office for attendance at a training or education program which will familiarize the commissioner with official duties.",
	"repealed": false
}