{
	"id": "67A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/67A.40",
	"title": "67A.40 ORGANIZATION AND POWERS.",
	"text": "Not less than six duly licensed township mutual fire insurance companies may organize a mutual association for the purpose of reinsuring any part or all of any risk or risks, written by any of the member companies.\nThe incorporation of this association shall be effected by filing with the commissioner and with the secretary of state a certificate of incorporation duly executed and acknowledged by the companies forming the association, these companies having been first duly authorized, by resolution duly adopted at a regular annual meeting, or at a special meeting called for that purpose, which certificate shall state, in substance, such facts as are required to be stated in certificates of incorporation by the general corporation laws of this state and shall have first been approved by the commissioner.\nIn addition to the powers conferred by sections 67A.40 to 67A.44, every such association shall have the power to reinsure any part or all of any risk or risks assumed by it, and every such association shall have the corporate powers which are granted to corporations under the general corporation laws of this state. Any such association having a surplus of at least $300,000 may, at any regular meeting or at a special meeting called for that purpose, transform itself into a mutual insurance company by amending its articles of incorporation to provide for the doing of one or more of the kinds of business specified in section 60A.06, subdivision 1, clauses (1) to (14). Such transformed company shall be subject to the general corporation laws contained in chapter 302A, and subject to the conditions and restrictions as to the kinds of insurance which may be combined by a like stock insurance company and to all restrictions contained in the laws of this state with reference to general mutual insurance companies transacting the same kinds of business. The bylaws may also provide for voting rights to be based on one vote for each policyholder, plus one vote for each $100 of premium paid within 12 months prior to the meeting at which the votes are cast.\nThe corporate existence of any such association may be made perpetual by so providing in its articles of incorporation.\nThe directors of the association shall be chosen from the officers of its members.\nThe board of directors at its first meeting shall adopt bylaws, which shall be filed with the commissioner and shall not be effective until approved by the commissioner.",
	"repealed": false
}