{
	"id": "58B.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.011",
	"title": "58B.011 STUDENT LOAN ADVOCATE.",
	"text": "The commissioner of commerce must designate a student loan advocate within the Department of Commerce to provide timely assistance to borrowers and to effectuate this chapter.\nThe student loan advocate has the following duties:\n(1) receive, review, and attempt to resolve complaints from borrowers, including but not limited to attempts to resolve borrower complaints in collaboration with institutions of higher education, student loan servicers, and any other participants in student loan lending;\n(2) compile and analyze data on borrower complaints received under clause (1);\n(3) help borrowers understand the rights and responsibilities under the terms of student loans;\n(4) provide information to the public, state agencies, legislators, and relevant stakeholders regarding the problems and concerns of borrowers;\n(5) make recommendations to resolve the problems of borrowers;\n(6) analyze and monitor the development and implementation of federal, state, and local laws, regulations, and policies relating to borrowers, and recommend any changes deemed necessary;\n(7) review the complete student loan history for any borrower who has provided written consent to conduct the review;\n(8) increase public awareness that the advocate is available to assist in resolving the student loan servicing concerns of potential and actual borrowers, institutions of higher education, student loan servicers, and any other participant in student loan lending; and\n(9) take other actions as necessary to fulfill the duties of the advocate, as provided under this section.\nThe advocate must establish and maintain a borrower education course. The course must include educational presentations and materials regarding important topics in student loans, including but not limited to:\n(1) the meaning of important terminology used in student lending;\n(2) documentation requirements;\n(3) monthly payment obligations;\n(4) income-based repayment options;\n(5) the availability of state and federal loan forgiveness programs; and\n(6) disclosure requirements.\nBy January 15 of each odd-numbered year, the advocate must report to the legislative committees with primary jurisdiction over commerce and higher education. The report must describe the advocate's implementation of this section, the outcomes achieved by the advocate during the previous two years, and recommendations to improve the regulation of student loan servicers.",
	"repealed": false
}