{
	"id": "142E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.03",
	"title": "142E.03 DUTIES OF COUNTIES.",
	"text": "(a) Except as provided in paragraph (c), clause (4), the county shall verify the following at all initial child care applications using the universal application:\n(1) identity of adults;\n(2) presence of the minor child in the home, if questionable;\n(3) relationship of minor child to the parent, stepparent, legal guardian, eligible relative caretaker, or the spouses of any of the foregoing;\n(4) age;\n(5) immigration status, if related to eligibility;\n(6) Social Security number, if given;\n(7) counted income;\n(8) spousal support and child support payments made to persons outside the household;\n(9) residence; and\n(10) inconsistent information, if related to eligibility.\n(b) The county must mail a notice of approval or denial of assistance to the applicant within 30 calendar days after receiving the application. The county may extend the response time by 15 calendar days if the applicant is informed of the extension.\n(c) For an applicant who declares that the applicant is homeless and who meets the definition of homeless in section 142E.01, subdivision 16, the county must:\n(1) if information is needed to determine eligibility, send a request for information to the applicant within five working days after receiving the application;\n(2) if the applicant is eligible, send a notice of approval of assistance within five working days after receiving the application;\n(3) if the applicant is ineligible, send a notice of denial of assistance within 30 days after receiving the application. The county may extend the response time by 15 calendar days if the applicant is informed of the extension;\n(4) not require verifications required by paragraph (a) before issuing the notice of approval or denial; and\n(5) follow limits set by the commissioner for how frequently expedited application processing may be used for an applicant under this paragraph.\n(d) An applicant who declares that the applicant is homeless must submit proof of eligibility within three months of the date the application was received. If proof of eligibility is not submitted within three months, eligibility ends. A 15-day adverse action notice is required to end eligibility.\nThe county must request Social Security numbers from all applicants for child care assistance under this chapter. A county may not deny child care assistance solely on the basis of failure of an applicant to report a Social Security number.\n(a) Notwithstanding Minnesota Rules, part 3400.0180, item A, the county shall conduct a redetermination according to paragraphs (b) and (c).\n(b) The county shall use the redetermination form developed by the commissioner. The county must verify the factors listed in subdivision 1, paragraph (a), as part of the redetermination.\n(c) An applicant's eligibility must be redetermined no more frequently than every 12 months. The following criteria apply:\n(1) a family meets the eligibility redetermination requirements if a complete redetermination form and all required verifications are received within 30 days after the date the form was due;\n(2) if the 30th day after the date the form was due falls on a Saturday, Sunday, or holiday, the 30-day time period is extended to include the next day that is not a Saturday, Sunday, or holiday. Assistance shall be payable retroactively from the redetermination due date;\n(3) for a family where at least one parent is younger than 21 years of age, does not have a high school degree or commissioner of education-selected high school equivalency certification, and is a student in a school district or another similar program that provides or arranges for child care, parenting, social services, career and employment supports, and academic support to achieve high school graduation, the redetermination of eligibility may be deferred beyond 12 months, to the end of the student's school year; and\n(4) a family and the family's providers must be notified that the family's redetermination is due at least 45 days before the end of the family's 12-month eligibility period.\n(a) The county shall process a change in eligibility factors according to paragraphs (b) to (g).\n(b) A family is subject to the reporting requirements in section 256P.07, subdivision 6.\n(c) If a family reports a change or a change is known to the agency before the family's regularly scheduled redetermination, the county must act on the change. The commissioner shall establish standards for verifying a change.\n(d) A change in income occurs on the day the participant received the first payment reflecting the change in income.\n(e) During a family's 12-month eligibility period, if the family's income increases and remains at or below 85 percent of the state median income, adjusted for family size, there is no change to the family's eligibility. The county shall not request verification of the change. The co-payment fee shall not increase during the remaining portion of the family's 12-month eligibility period.\n(f) During a family's 12-month eligibility period, if the family's income increases and exceeds 85 percent of the state median income, adjusted for family size, the family is not eligible for child care assistance. The family must be given 15 calendar days to provide verification of the change. If the required verification is not returned or confirms ineligibility, the family's eligibility ends following a subsequent 15-day adverse action notice.\n(g) Notwithstanding Minnesota Rules, parts 3400.0040, subpart 3, and 3400.0170, subpart 1, if an applicant or participant reports that employment ended, the agency may accept a signed statement from the applicant or participant as verification that employment ended.\n[See Note.]\nAt the time of initial application and at redetermination, the county must provide written notice to the applicant or participant listing the activities that constitute child care fraud and the consequences of committing child care fraud. An applicant or participant shall acknowledge receipt of the child care fraud notice in writing.\nThe county board shall ensure that child care services available to eligible residents are well advertised and that everyone who receives or applies for MFIP assistance is informed of training and employment opportunities and programs, including child care assistance and child care resource and referral services.",
	"repealed": false
}