{
	"id": "62B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62B.06",
	"title": "62B.06 PROVISIONS OF POLICIES AND CERTIFICATES OF INSURANCE; DISCLOSURE TO DEBTORS.",
	"text": "All credit life insurance, credit accident and health insurance, and credit involuntary unemployment insurance shall be evidenced by an individual policy, memorandum copy, or in the case of group insurance by a certificate of insurance, which shall be delivered to the debtor.\nEach individual policy or group certificate of credit life insurance, credit accident and health insurance, or credit involuntary unemployment insurance, shall, in addition to other requirements of law, set forth the name and home office address of the insurer, the name or names of the debtor or in the case of a certificate under a group policy, the identity by name or otherwise of the debtor, the rate or amount of payment, if any, by the debtor separately for credit life insurance, credit accident and health insurance, and credit involuntary unemployment insurance, a description of the amount, term and coverage including any exceptions, limitations and restrictions, and shall state that the benefits shall be paid to the creditor to reduce or extinguish the unpaid indebtedness and, wherever the amount of insurance may exceed the unpaid indebtedness, that any such excess shall be payable to the debtor, if living, otherwise to a beneficiary, other than the creditor, named by the debtor, otherwise to the debtor's estate. No individual or group policy of credit accident and health insurance or credit involuntary unemployment insurance issued, amended, renewed, or delivered in this state on or after January 1, 1976 shall contain any provision offsetting, or in any other manner reducing any benefit under the policy by the amount of, or in proportion to, any increase in disability or other benefits received or receivable under the federal Social Security Act, as amended subsequent to the date of commencement of such benefit.\nThe individual policy or group certificate of insurance shall be delivered to the insured debtor at the time the indebtedness is incurred except as hereinafter provided.\nIf the individual policy or group certificate of insurance is not delivered to the debtor at the time the indebtedness is incurred, a copy of the application for the policy or a notice of proposed insurance, signed by the debtor and setting forth the name and home office address of the insurer, the name or names of the debtor, the premium or amount of payment by the debtor, if any, separately for credit life insurance, credit accident and health insurance, and credit involuntary unemployment insurance, the amount, term and a brief description of the coverage provided, shall be delivered to the debtor at the time the indebtedness is incurred. The copy of the application for, or notice of proposed insurance, shall also refer exclusively to insurance coverage, and shall be separate and apart from the loan, sale or other credit statement of account, instrument or agreement, unless the information required by this subdivision is prominently set forth therein. Upon acceptance of the insurance by the insurer and within 30 days of the date on which the indebtedness is incurred, the insurer shall cause the individual policy or group certificate of insurance to be delivered to the debtor. The application or notice of proposed insurance shall state that upon acceptance by the insurer, the insurance shall become effective as provided in section 62B.05. If an application for a policy or a notice of proposed insurance is not delivered at the time the indebtedness is incurred as required by this subdivision, the creditor shall assume all of the liabilities under such insurance until an insurer accepts the risk.\nIf the insurer named in either the application or notice of proposed insurance does not accept the risk, then the debtor shall receive a policy or certificate of insurance setting forth the name and home office address of the substituted insurer and the amount of the premium to be charged, and if the amount of premium is less than that set forth in the application or notice of proposed insurance an appropriate refund shall be made.",
	"repealed": false
}