{
	"id": "124D.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.65",
	"title": "124D.65 ENGLISH LEARNER (EL) PROGRAMS AID.",
	"text": "[Repealed, 1999 c 241 art 1 s 69]\n[Repealed, 1999 c 241 art 1 s 69]\n[Repealed, 1999 c 241 art 1 s 69; art 2 s 62]\n[Repealed, 1Sp2003 c 9 art 1 s 54]\n(a) For fiscal year 2024 through fiscal year 2026, a district's English learner programs revenue equals the sum of:\n(1) the product of (i) $1,228, and (ii) the greater of 20 or the adjusted average daily membership of eligible English learners enrolled in the district during the current fiscal year; and\n(2) $436 times the English learner pupil units under section 126C.05, subdivision 17.\n(b) For fiscal year 2027 and later, a district's English learner programs revenue equals the sum of:\n(1) the product of (i) $1,775, and (ii) the greater of 20 or the adjusted average daily membership of eligible English learners enrolled in the district during the current fiscal year; and\n(2) $630 times the English learner pupil units under section 126C.05, subdivision 17.\n(c) A pupil ceases to generate state English learner aid in the school year following the school year in which the pupil attains the state cutoff score on a commissioner-provided assessment that measures the pupil's emerging academic English.\n(a) For fiscal year 2027 and later, a district's English learner cross subsidy aid equals 25 percent of the district's English learner cross subsidy calculated under paragraph (b).\n(b) A district's English learner cross subsidy equals the greater of zero or the difference between the district's expenditures for qualifying English learner services for the second previous year and the district's English learner revenue under subdivision 5 for the second previous year. For the purposes of this subdivision, \"qualifying English learner services\" means the services necessary to implement the language instruction educational program for students identified as English learners under sections 124D.58 to 124D.65. Only expenditures that both address the English language development standards in Minnesota Rules, parts 3501.1200 and 3501.1210, which may include home language instruction, and are supplemental to the cost of core content instruction may be included as expenditures for qualifying English learner services. Expenditures do not include costs related to construction, indirect costs, core content instruction, or core administrative personnel.\nIn counting the number of English learners for purposes of this section, districts may include English learners who attend nonpublic schools in the district. A district which counts those pupils and receives aid pursuant to this section must offer those pupils the same programs on the same terms that it offers to English learners who attend the public school. A program provided for a nonpublic school pupil pursuant to this subdivision must be provided at a public school or a neutral site as defined in section 123B.41, subdivision 13. Nonpublic school pupils served by a district's educational program for English learners must be counted for average daily membership pursuant to sections 126C.01, subdivisions 6 to 8, and 126C.19, subdivisions 1 to 4.\nTo obtain aid for English learner programs, a district must submit information required by the department to implement this section.\nThe department must promptly inform each applicant district of the amount of revenue it will receive pursuant to this section.\nA district which applies for aid pursuant to this section must maintain records which support the information contained in all of its applications. The commissioner may audit these records upon request. A district which receives aid pursuant to this section must keep additional records in the manner prescribed by the commissioner to ensure that an educational program for English learners is implemented and operated in accordance with sections 124D.58 to 124D.64.\nA district providing a program for English learners must be eligible to receive moneys for these programs from other government agencies and from private sources when these moneys are available.\nFor the purposes of this section, English learners enrolled in a cooperative or intermediate school district unit shall be counted by the school district of residence, and the cooperative unit shall allocate its approved expenditures for English learner programs among participating school districts. English learner aid for services provided by a cooperative or intermediate school district shall be paid to the participating school districts.",
	"repealed": false
}