{
	"id": "18F.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/18F.07",
	"title": "18F.07 GENETICALLY ENGINEERED AGRICULTURALLY RELATED ORGANISM PERMIT.",
	"text": "A person may not conduct a release of a genetically engineered agriculturally related organism until a permit for the release has been obtained from the United States Department of Agriculture (USDA) or Environmental Protection Agency (EPA) unless the organism is exempt from regulation by the applicable agency under the Coordinated Framework. The commissioner may accept a USDA or an EPA permit or may review a USDA or an EPA permit and add additional requirements to ensure that the proposed release of a genetically engineered agriculturally related organism would not create a hazard to the agricultural, forest, or horticultural interests of this state or the state's general environmental quality.\n(a) If the commissioner reviews a USDA or an EPA permit, the commissioner may recommend terms and conditions, including but not limited to the period for the genetically engineered agriculturally related organism permit, the amount or number of genetically engineered agriculturally related organisms to be used, monitoring activities, department inspection schedules, reporting of experiment results, and experiment termination procedures. After a genetically engineered agriculturally related organism permit is issued, the commissioner must inform the permitting agency if the permit terms or conditions are being violated or are inadequate to avoid unreasonable adverse effects on the environment.\n(b) The commissioner may request that the USDA or EPA not issue a permit if the commissioner determines that the release of the genetically engineered agriculturally related organism would create a hazard to the agricultural, forest, or horticultural interests of this state or the state's general environmental quality.\n(c) The commissioner shall publish a notice of the proposed release at the earliest opportunity in the EQB Monitor and shall notify the chair of the county board and, if applicable, the Tribal council of any reservation where the organism will be released.\nA person shall file an application for a genetically engineered agriculturally related organism permit with the appropriate federal agency in the Coordinated Framework, unless exempted as set forth in section 18F.13.\nMS 2022 [Repealed by amendment, 2023 c 43 art 2 s 45]",
	"repealed": false
}