{
	"id": "116G.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/116G.06",
	"title": "116G.06 DESIGNATION.",
	"text": "(a) The board shall periodically study and assess the resources and development of the state and shall recommend to the governor those areas that should be designated as areas of critical concern in accordance with criteria established in section 116G.05. In its recommendations, the board shall specify the boundaries of the proposed area of critical concern, state the reasons why the particular area proposed is of critical concern to the state or region, the dangers that would result from uncontrolled or inappropriate development of the area and the advantages that would be achieved from the development of the area in a coordinated manner and shall recommend specific principles for guiding the development of the area.\n(b) Each regional development commission may from time to time recommend to the board areas wholly or partially within its jurisdiction that meet the criteria for areas of critical concern as defined in section 116G.05. Each regional development commission shall solicit from the local units of government within its jurisdiction suggestions as to areas to be recommended. A local unit of government in an area where no regional development commission has been established may from time to time recommend to the board areas wholly or partially within its jurisdiction that meet the criteria for areas of critical concern as defined in section 116G.05. The board shall provide the regional development commission or local unit of government with a written statement of its decision and the reasons therefor.\n(c) Prior to submitting any recommendations to the governor, under this subdivision, the board shall conduct a public hearing in the manner provided in chapter 14 on the proposed designation at a location convenient to those persons affected by such designation.\n(a) The governor may designate by written order all or part of the recommended areas as areas of critical concern and specify the boundaries thereof and shall notify all local units of government in which any part or parts of a designated area or areas of critical concern are located.\n(b) The order designating an area of critical concern shall (1) describe the boundaries of the area of critical concern, (2) indicate the reason that a particular area is of critical concern, (3) specify standards and guidelines to be followed in preparing and adopting plans and rules required in section 116G.07, and (4) indicate what development, if any, shall be permitted consistent with the policies of sections 116G.01 to 116G.14 pending the adoption of plans and rules.\n(c) The order designating an area of critical concern shall be effective for no longer than three years pending approval by the legislature or by the regional development commission, where one exists, of each development region in which a part of the area of critical concern is located. After a regional development commission has approved the designation of an area of critical concern, it shall not revoke or rescind its approval, except as necessary to update and reevaluate plans and regulations under section 116G.10.",
	"repealed": false
}