{
	"id": "340A.408",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.408",
	"title": "340A.408 RETAIL LICENSE FEES.",
	"text": "(a) The license fee for an on-sale and off-sale 3.2 percent malt liquor license is the fee set by the county or city issuing the license.\n(b) One-half of the license fee received by a county for a retail license to sell 3.2 percent malt liquor within any town in the county shall be paid to the town board where the business is located.\n(a) The license fee for a retail on-sale intoxicating liquor license is the fee set by the city or county issuing the license subject to the limitations imposed under this subdivision. The license fee is intended to cover the costs of issuing and inspecting and other directly related costs of enforcement.\n(b) The annual license fee for an on-sale intoxicating liquor license issued by a municipality to a club must be no greater than:\n(1) $300 for a club with under 200 members;\n(2) $500 for a club with between 201 and 500 members;\n(3) $650 for a club with between 501 and 1,000 members;\n(4) $800 for a club with between 1,001 and 2,000 members;\n(5) $1,000 for a club with between 2,001 and 4,000 members;\n(6) $2,000 for a club with between 4,001 and 6,000 members; or\n(7) $3,000 for a club with over 6,000 members.\n(c) The license fee for the issuance of a wine license may not exceed one-half of the license fee charged for an on-sale intoxicating liquor license, or $2,000, whichever is less.\n(d) The town board of a town in which an on-sale establishment has been licensed by a county may impose an additional license fee on each such establishment in an amount not to exceed 20 percent of the county license fee.\n(a) The annual license fee for an off-sale intoxicating liquor license issued by a city, when combined with any occupation tax imposed by the city, may not exceed the following limits:\n(1) $1,500 for cities of the first class;\n(2) $560 for cities over 10,000 population located outside of the seven-county metropolitan area other than cities of the first class;\n(3) $380 for cities over 10,000 population other than cities of the first class or cities described in clause (2);\n(4) $310 for cities of between 5,000 and 10,000 population; and\n(5) $240 for cities with less than 5,000 population.\n(b) The annual license fee for an off-sale intoxicating liquor license issued by a county or town shall not exceed $800.\n(c) The fee set by the jurisdiction issuing the license shall be reduced by $100 if the following conditions are met:\n(1) the licensee agrees to have a private vendor train all employees within 60 days of hire and annually thereafter in laws pertaining to the sale of alcohol, the rules for identification checks, and the responsibilities of establishments serving intoxicating liquors;\n(2) the licensee agrees to post a policy requiring identification checks for all persons appearing to be 30 years old or less; and\n(3) a cash award and incentive program is established by the licensee, to award employees who catch underage drinkers, and a penalty program is established to punish employees in the event of a failed compliance check.\n(d) Population for purposes of this subdivision shall be as determined by the state demographer.\nNo city, town, or county shall increase the fee for a liquor license governed by subdivision 1, 2, or 3, except after notice and hearing on the proposed increase. Notice of the proposed increase must be mailed to all affected licensees at least 30 days before the date set for the hearing. This subdivision supersedes any inconsistent provision of law or charter.\n(a) The annual license fee for licensing of Lake Superior, St. Croix River, and Mississippi River tour boats under section 340A.404, subdivision 8, shall be $1,500. The commissioner shall transmit one-half of this fee to the governing body of the city that is the home port of the tour boat or to the county in which the home port is located if the home port is outside a city.\n(b) The annual license fee for common carriers licensed under section 340A.407 is:\n(1) $50 for 3.2 percent malt liquor, and $20 for a duplicate license; and\n(2) $250 for intoxicating liquor, and $30 for a duplicate license.\nA pro rata share of an annual license fee for a retail license to sell intoxicating or 3.2 percent malt liquor, either on-sale or off-sale, may be refunded to the licensee or to the licensee's estate if:\n(1) the business ceases to operate because of destruction or damage;\n(2) the licensee dies;\n(3) the business ceases to be lawful for a reason other than a license revocation; or\n(4) the licensee ceases to carry on the licensed business under the license.",
	"repealed": false
}