{
	"id": "287.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/287.05",
	"title": "287.05 DETERMINATION OF TAX IN SPECIAL SITUATIONS.",
	"text": "(a) When a multistate mortgage is intended to secure only a portion of a debt amount recited or referred to in the mortgage, the mortgage may contain the following statement, or its equivalent, on the first page: \"Notwithstanding anything to the contrary herein, enforcement of this mortgage in Minnesota is limited to a debt amount of $....... under chapter 287 of Minnesota Statutes.\" In such case, the tax shall be imposed based only on the amount of debt so stated to be secured by real property located in this state; and, the effect of the mortgage, or any amendment or extension, as evidence in any court in this state, or as notice for any purpose in this state, shall be limited to the amount contained in the statement and for which the tax has been paid and additional amounts for accrued interest and advances not subject to tax under subdivision 4 or section 287.035.\n(b) All multistate mortgages not taxed under paragraph (a) shall be taxed under sections 287.01 to 287.13 as if the real property identified in the mortgage secures payment of that portion of the maximum debt amount referred to, or incorporated by reference, in the mortgage that is equal to a fraction the numerator of which is the value of the real property described in the mortgage that is located in this state and the denominator of which is the value of all the real property described in the mortgage.\n(a) When the real property identified in a mortgage is located entirely in this state and is intended to secure only a portion of a debt amount recited or referred to in the mortgage, the mortgage may contain the following statement, or its equivalent, on the first page: \"Notwithstanding anything to the contrary herein, enforcement of this mortgage is limited to a debt amount of $....... under chapter 287 of Minnesota Statutes.\" In such case, the tax shall be imposed based only on the amount of debt so stated to be secured by real property; and, the effect of the mortgage, or any amendment or extension, as evidence in any court in this state, or as notice for any purpose in this state, shall be limited to the amount contained in the statement and for which the tax has been paid and additional amounts for accrued interest and advances not subject to tax under subdivision 4 or section 287.035.\n(b) All mortgages that are not multistate mortgages and that are not taxed under paragraph (a) shall be taxed under sections 287.01 to 287.13 as if the real property identified in the mortgage secures payment of the maximum debt amount referred to, or incorporated by reference, in the mortgage.\n(a) Except for an amendment or a revision to a reverse mortgage as described under subdivision 6, any document that alters an existing mortgage by providing for an increase in the amount of debt secured by real property located in this state, or, in the case of a multistate mortgage described in subdivision 1, paragraph (b), an increase in the percentage of Minnesota real estate as compared to the total real estate that is encumbered by the mortgage, shall be taxed based upon the increase in the amount of the debt determined to be secured by real property located in this state under either subdivision 1 or 1a.\n(b) Except as provided in subdivision 3, any document that alters an existing mortgage to secure debt that was (i) advanced, (ii) repaid in whole or in part, and (iii) then readvanced in whole or in part, shall be taxed based upon the new amounts advanced, even if the maximum debt previously secured by the mortgage is not exceeded.\nWhen a mortgage, including a reverse mortgage, secures a revolving line of credit under which advances, payments, and readvances may be made from time to time, the tax imposed under section 287.035 must be paid on the maximum amount of the line of credit that may be secured at any one time, as expressed in the mortgage, regardless of the time or amount of advances, payments, or readvances.\nNo tax under section 287.035 shall be paid on the indeterminate amount that may be advanced by the mortgagee in protection of the mortgaged premises or the mortgage, including taxes, assessments, charges, claims, fines, impositions, and insurance premiums; the amounts due upon prior or superior mortgages and other prior or superior liens, encumbrances, and interests; and legal expenses and attorneys' fees.\nWhen a mortgage secures an indeterminate amount other than those described in subdivision 3, 4, or 6, no tax shall be paid at the time the mortgage is recorded, but the tax must be paid at the time of recording an affidavit or other document stating the amount and time of the actual advance.\nIf real property secures a reverse mortgage, the principal debt or obligation to which mortgage registry tax applies is the expected total disbursements or cash equivalent to be made under the terms of the loan. Interest accruing on the disbursements made is not subject to mortgage registry tax. In the case of periodic payments made for an indefinite length of time, the expected total disbursements must equal the product of the periodic payment amounts and the number of payments and, if applicable, the amount of cash distribution or its equivalent. The number of payments must be based upon the life expectancy assumption used in determining the payment amount. In the case of reverse mortgages made as part of the Housing and Community Development Act of 1987, section 255 of the National Housing Act, and administered by the Department of Housing and Urban Development (HUD), mortgage registry tax must not be assessed on Federal Housing Administration mortgage insurance premiums, monthly lender service fees, or payments to be distributed to the borrower by HUD.\nIf a mortgage is made to a mortgagee in trust to secure the payment of bonds or other obligations yet to be issued, a statement may be incorporated in the mortgage stating the amount of the obligations already issued or yet to be issued, and the tax to be paid on filing the mortgage for recording must be computed upon the amount so stated. The statement must be binding and conclusive upon all persons claiming through or under the mortgage, and no such obligation issued in excess of the aggregate so fixed is valid for any purpose unless the additional tax is paid and receipted by the proper county treasurer.\nAn amendment may contain the following statement, or its equivalent, on its first page: \"This is a mortgage amendment, as defined in Minnesota Statutes, section 287.01, subdivision 2, and as such it does not secure a new or an increased amount of debt.\" In such cases, the document will be treated as a mortgage amendment, as defined in section 287.01, subdivision 2, for all purposes and does not serve to secure a new or an increased amount of debt.\nIf a mortgage, or a document modifying a mortgage, contains more than one statement that purports to limit: the enforcement of the mortgage to a certain dollar amount; the tax imposed on the mortgage under this chapter; or the effect of a modifying document, including but not limited to the statements authorized in subdivisions 1, 1a, and 8, then the tax must be imposed based on the combined effect, if any, of all the statements.\nFor properties located in Hennepin and Ramsey Counties, the county may impose an additional mortgage registry tax as defined in sections 383A.80 and 383B.80.",
	"repealed": false
}