{
	"id": "473.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.661",
	"title": "473.661 BUDGET SPECIFYING AMOUNTS FOR SEPARATE ITEMS.",
	"text": "The commissioners shall, on or before the first day of July of each year, prepare a detailed budget of the needs of the corporation for the next fiscal year, specifying separately in said budget the amounts to be expended for acquisition of property, construction, payments on bonded indebtedness, if any, operation, noise mitigation, and maintenance, respectively, subject only to such changes as the commissioners may from time to time approve.\nThe commissioners shall on or before September 15 of each calendar year, certify to the county auditor of each county in the metropolitan area the total amount to be raised by the commissioners during the next calendar year through taxation, and each county auditor shall extend and assess against all property in the auditor's county which is then taxable by the corporation for the purpose for which the levy is made under the provisions of section 473.621, subdivision 5, that sum which bears the same proportion to the total amount as the net tax capacity of such taxable property bears to the net tax capacity of all property in the metropolitan area which is then taxable by the corporation for the purpose for which the levy is made. The county auditor shall extend, spread, and include the same with and as a part of the general taxes for state, county, and municipal purposes, to be collected and enforced therewith, together with penalties and interest and costs, and the county treasurer, upon collection of the same, shall transfer the same to the treasurer of the corporation.\nIn any budget certified by the commissioners under this section, the amount included for operation and maintenance shall not exceed an amount which, when extended against the property taxable therefor under section 473.621, subdivision 5, will require a levy at a rate of 0.00806 percent of estimated market value. Taxes levied by the corporation shall not affect the amount or rate of taxes which may be levied by any other local government unit within the metropolitan area under the provisions of any charter.\n(a) According to the schedule in paragraph (b), commission funds must be dedicated (1) to supplement the implementation of corrective land use management measures approved by the Federal Aviation Administration as part of the commission's Federal Aviation Regulations, part 150 noise compatibility program, and (2) for soundproofing and accompanying air conditioning of residences, schools, and other public buildings when there is a demonstrated need because of aircraft noise, regardless of the location of the building to be soundproofed.\n(b) The noise mitigation program described in paragraph (a) shall be funded by the commission from whatever source of funds according to the following schedule:\nIn 1993, an amount equal to 20 percent of the passenger facilities charges revenue amount budgeted by the commission for 1993;\nIn 1994, an amount equal to 20 percent of the passenger facilities charges revenue amount budgeted by the commission for 1994;\nIn 1995, an amount equal to 35 percent of the passenger facilities charges revenue amount budgeted by the commission for 1995; and\nIn 1996 and 1997, an amount equal to 40 percent of the passenger facilities charges revenue amount budgeted by the commission for 1996.\n(c) From 1996 to 2002, the commission shall spend no less than $185,000,000 from any source of funds for insulation and accompanying air conditioning of residences, schools, and other publicly owned buildings where there is a demonstrated need because of aircraft noise; and property acquisition, limited to residences, schools, and other publicly owned buildings, within the noise impacted area. In addition, the corporation shall insulate and air condition four schools in Minneapolis and two schools in Richfield that are located in the 1996 60 Ldn contour.\n(d) Before the commission constructs a new runway at Minneapolis-St. Paul International Airport, the commission shall determine the probable levels of noise that will result in various parts of the metropolitan area from the operation of aircraft on the new runway and shall develop a program to mitigate noise in those parts of the metropolitan area that are located outside the 1996 65 Ldn contour but will be located within the 65 Ldn contour as established after the new runway is in operation. Based upon this determination, the commission shall reserve in its annual budget, until noise mitigation measures are completed, an amount of money necessary to implement this noise mitigation program in the newly impacted areas.\n(e) The commission's capital improvement projects, program, and plan must reflect the requirements of this section. As part of the commission's report to the legislature under section 473.621, subdivision 1a, the commission must provide a description and the status of each noise mitigation project implemented under this section.\n(f) Within 180 days of submitting the commission's and the Metropolitan Council's report and recommendations on major airport planning to the legislature as required by Minnesota Statutes 2012, section 473.618, the commission, with the assistance of its sound abatement advisory committee, shall make a recommendation to the state Advisory Council on Metropolitan Airport Planning regarding proposed mitigation activities and appropriate funding levels for mitigation activities at Minneapolis-St. Paul International Airport and in the neighboring communities. The recommendation shall examine mitigation measures to the 60 Ldn level. The state Advisory Council on Metropolitan Airport Planning shall review the recommendation and comment to the legislature within 60 days after the recommendation is submitted to the council.",
	"repealed": false
}