{
	"id": "13B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/13B.07",
	"title": "13B.07 TAX DEBTOR DATA MATCHES.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Account\" means demand deposit account, checking account, negotiable order of withdrawal account, savings account, time deposit account, money market mutual fund account, or certificate of deposit account located in Minnesota.\n(b) \"Account information\" means the type of account, the account number, and whether the account is singly or jointly owned.\n(c) \"Commissioner\" means the commissioner of revenue.\n(d) \"Debtor\" means a person for whom a notice of lien has been filed by the commissioner as provided by section 270C.63, subdivision 2.\n(e) \"Financial institution\" means any of the following that do business in this state:\n(1) federal or state commercial banks and federal or state savings banks, including savings and loan associations and cooperative banks;\n(2) federal and state chartered credit unions;\n(3) safe deposit companies; or\n(4) money market mutual funds.\n(f) \"Person\" means a person as defined in section 270C.01, subdivision 6.\n(g) \"Service level agreement\" means an agreement entered into between the commissioner and a financial institution that defines terms and conditions by which the financial institution will provide data matches to the commissioner.\nThe commissioner shall establish a process for the comparison of account information data held by financial institutions with the Department of Revenue's database of debtors. The commissioner, in consultation with representatives from financial institutions, shall develop an implementation and administration plan for the data match system that attempts to minimize financial burdens on financial institutions for start-up and compliance costs and takes into consideration the financial institutions' existing data match systems. The commissioner shall inform the financial industry of the requirements of this section and the means by which financial institutions can comply no later than October 1, 2008, with the financial institutions receiving the first match requests no earlier than January 1, 2009. The commissioner may enter into service-level agreements with financial institutions.\nWithin 30 days of a request by the commissioner, a financial institution shall provide to the commissioner the name, address, personal identifying information, and account information for each debtor or account holder, in accordance with the method chosen in subdivision 4, who maintains an account at the financial institution. The commissioner may request from a financial institution the data concerning any debtor not more than once every three months.\nTo comply with the requirements of this section, a financial institution must elect, in a manner authorized by the commissioner, to either:\n(1) provide to the commissioner a list containing only the names and other necessary personal identifying information, including the debtor's address, Social Security number if an individual, and tax identification number if known, of all account holders for the commissioner to compare against its list of debtors for the purpose of identifying which debtors maintain an account at the financial institution; the names of the debtors who maintain an account at the institution shall then be transmitted to the financial institution which shall provide the commissioner with account information on those debtors; or\n(2) obtain an electronic list of debtors from the commissioner that includes each debtor's name, address, Social Security number if an individual, and tax identification number if known, and compare that data to the data maintained at the financial institution to identify which of the identified debtors maintains an account at the financial institution.\nA financial institution must provide the required data in encrypted form by secure electronic means or other means authorized by the commissioner.\n(a) With regard to account information on all account holders provided by a financial institution under subdivision 4, clause (1), the commissioner shall retain the reported information only until the account information is compared against the commissioner's debtor database. Notwithstanding section 138.17, all account information that does not pertain to a debtor listed in the commissioner's database must be immediately destroyed and no retention or publication of that data shall be made by the commissioner. All account information that pertains to a debtor listed in the commissioner's database must be incorporated into the commissioner's database. Access to that data is governed by chapters 13 and 270B. Notwithstanding section 16D.06, data collected pursuant to this section is available for the collection of delinquent taxes only and is not available for other debt collection activities undertaken by the state.\n(b) With regard to data on debtors provided by the commissioner to a financial institution under subdivision 4, clause (2), the financial institution shall retain the reported information only until the financial institution's database is compared against the commissioner's database. Data that does not pertain to an account holder at the financial institution must be immediately destroyed and no retention, publication, or any other use of that data shall be made by the financial institution.\nA financial institution may charge and collect a fee from the commissioner for providing account information to the commissioner. The commissioner may pay a financial institution up to $150 each quarter. The commissioner shall develop procedures for the financial institutions to charge and collect the fee. Payment of the fee is limited by the amount of the appropriation for this purpose. If the appropriation is insufficient, or if fund availability in the fourth quarter would allow payments for actual costs in excess of $150, the commissioner shall prorate the available funds among the financial institutions that have submitted a claim for the fee. No financial institution shall charge or collect a fee that exceeds its actual costs of complying with this section.\nThe commissioner shall send a written notice of noncompliance to a financial institution that fails to respond to a first written request for information under this section. The notice must be sent by certified mail and must explain the requirements of this section and advise the financial institution of the penalty for noncompliance. A financial institution that receives a second notice of noncompliance is subject to a civil penalty of $1,000 for its failure to comply. A financial institution that continues to fail to comply with this section is subject to a civil penalty of $5,000 for the third and each subsequent failure to comply. The penalties imposed under this subdivision are collected in the same manner as taxes. A financial institution that has been served with a notice of noncompliance and incurs a second or subsequent notice of noncompliance has the right to a contested case hearing under chapter 14. A financial institution has 20 days from the date of the service of the notice of noncompliance to file a request for a contested case hearing with the commissioner. The order of the administrative law judge constitutes the final decision in this case. A financial institution is considered to be in compliance with this section if it demonstrates that it is working in good faith to implement the data match program.\nA financial institution furnishing a report to the commissioner under this section is prohibited from disclosing to a debtor that the name of the debtor has been received from or furnished to the commissioner.\nA financial institution that provides or reasonably attempts to provide information to the commissioner in compliance with this section is not liable to any person for disclosing the information or for taking any other action in good faith as authorized by this section.",
	"repealed": false
}