{
	"id": "477A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.21",
	"title": "477A.21 RIPARIAN PROTECTION AID.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"buffer protection map\" has the meaning given under section 103F.48, subdivision 1; and\n(2) \"public watercourses\" means public waters and public drainage systems subject to riparian protection requirements under section 103F.48.\n(a) The Board of Water and Soil Resources must certify to the commissioner of revenue, on or before July 1 each year, which counties and watershed districts have affirmed their jurisdiction under section 103F.48 and the proportion of centerline miles of public watercourses, and miles of public drainage system ditches on the buffer protection map, within each county and each watershed district within the county with affirmed jurisdiction.\n(b) On or before July 1 each year, the commissioner of natural resources shall certify to the commissioner of revenue the statewide and countywide number of centerline miles of public watercourses and miles of public drainage system ditches on the buffer protection map.\n(a) A county that is certified under subdivision 2, or that portion of a county containing a watershed district certified under subdivision 2, is eligible to receive aid under this section to enforce and implement the riparian protection and water quality practices under section 103F.48. Each county's preliminary aid amount is equal to the proportion calculated under paragraph (b) multiplied by the appropriation received each year by the commissioner for purposes of payments under this section.\n(b) The commissioner must compute each county's proportion. A county's proportion is equal to the ratio of the sum in clause (1) to the sum in clause (2):\n(1) the sum of the total number of acres in the county classified as class 2a under section 273.13, subdivision 23, the countywide number of centerline miles of public watercourses on the buffer protection map, and the countywide number of miles of public drainage system ditches on the buffer protection map; and\n(2) the sum of the statewide total number of acres classified as class 2a under section 273.13, subdivision 23, the statewide total number of centerline miles of public watercourses on the buffer protection map, and the statewide total number of public drainage system miles on the buffer protection map.\n(c) Aid to a county must not be greater than $200,000 or less than $50,000. If the sum of the preliminary aids payable to counties under paragraph (a) is greater or less than the appropriation received by the commissioner, the commissioner of revenue must calculate the percentage of adjustment necessary so that the total of the aid under paragraph (a) equals the total amount received by the commissioner, subject to the minimum and maximum amounts specified in this paragraph. The minimum and maximum amounts under this paragraph must be adjusted by the ratio of the actual amount appropriated to $10,000,000.\n(d) If only a portion of a county is certified as eligible to receive aid under subdivision 2, the aid otherwise payable to that county under this section must be multiplied by a fraction, the numerator of which is the buffer protection map miles of the certified watershed districts contained within the county and the denominator of which is the total buffer protection map miles of the county.\n(e) Any aid that would otherwise be paid to a county or portion of a county that is not certified under subdivision 2 shall be paid to the Board of Water and Soil Resources for enforcing and implementing the riparian protection and water quality practices under section 103F.48.\nThe commissioner of revenue must compute the amount of riparian protection aid payable to each eligible county and to the Board of Water and Soil Resources under this section. On or before August 1 each year, the commissioner must certify the amount to be paid to each county and the Board of Water and Soil Resources in the following year, except that the payments for 2017 must be certified by July 15, 2017. The commissioner must pay riparian protection aid to counties and to the Board of Water and Soil Resources in the same manner and at the same time as aid payments under section 477A.015.",
	"repealed": false
}