{
	"id": "270B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.02",
	"title": "270B.02 CLASSIFICATION OF DATA.",
	"text": "Except as otherwise provided in this chapter, returns and return information are private data on individuals or nonpublic data as defined in section 13.02, subdivisions 9 and 12. Except as authorized by this chapter, the Department of Revenue, the commissioner, an officer or employee or former officer or employee of the Department of Revenue, a person engaged or retained by the department on an independent contract basis, or a person who, under sections 270B.05 to 270B.15, is permitted to inspect returns or return information may not disclose returns or return information.\nThe following are protected nonpublic data as defined in section 13.02, subdivision 13:\n(1) criteria for determining which computer processed returns are selected for audit;\n(2) criteria for determining which returns are selected for an in-depth audit;\n(3) criteria for determining which accounts receivable balances below a stated amount are written off or canceled; and\n(4) criteria or information used in determining which alleged criminal violations of any law administered by the commissioner are selected for criminal investigation.\n(a) Except as provided in paragraph (b), the name or existence of an informer, informer letters, and other data, in whatever form, given to the Department of Revenue by a person, other than the data subject, who informs that a specific person is not or may not be in compliance with tax laws, or nontax laws administered by the Department of Revenue, including laws not listed in section 270B.01, subdivision 8, are confidential data on individuals or protected nonpublic data as defined in section 13.02, subdivisions 3 and 13. This paragraph does not apply to laws relating to property taxes.\n(b) Data under paragraph (a) may be disclosed with the consent of the informer or upon a written finding by a court that the information provided by the informer was false and that there is evidence that the information was provided in bad faith. This subdivision does not alter disclosure responsibilities or obligations under the Rules of Criminal Procedure.\nInformation required to be filed by exempt individuals, corporations, organizations, estates, and trusts under section 290.05, subdivisions 1 and 4, or that relates to exempt status under section 290.05, subdivision 2, is public data on individuals or public data not on individuals, as defined in section 13.02, subdivisions 14 and 15. The commissioner may publish a list of organizations exempt from taxation under section 290.05, except that the name or address of any contributor to any organization that is or was exempt, or that has applied for tax exempt status, or any other information that could not be disclosed under section 6104 of the Internal Revenue Code of 1986, as amended through December 31, 1988, is classified as private data on individuals or nonpublic data as defined in section 13.02, subdivisions 9 and 12.\nNotwithstanding section 13.03, subdivision 7, returns and return information retain the classification designated under this chapter. Notwithstanding sections 13.03, subdivision 8, and 13.10, data classified under subdivision 3 and Department of Revenue data classified under this chapter as nonpublic data, protected nonpublic data, private data on individuals, or confidential data on individuals remain so classified.\nClient lists required under section 290.92, subdivision 30, are classified as private data on individuals or nonpublic data, as defined in section 13.02, subdivisions 9 and 12.",
	"repealed": false
}