{
	"id": "209.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/209.10",
	"title": "209.10 STATE LEGISLATIVE OFFICE.",
	"text": "In a legislative contest, the court administrator of district court, within three days of receipt of the notice of contest, shall submit one copy of it to the chief justice of the supreme court by certified mail. The court administrator shall also submit one copy of the answer, if any, to the chief justice by certified mail within three days of receipt.\nIn cases where an unfair campaign practice is alleged, within five days of receipt of a notice of contest, the chief justice shall submit to the parties a list of all the district judges in the state, except those involved in a trial that would interfere with serving as a judge in the election contest and those whose health precludes serving as judge in the election contest. Within two days after receiving the list of judges the parties shall meet together and, by alternating strikes they shall remove the names of all judges until only one remains. If no unfair campaign practice is alleged, the parties shall follow the same procedure using only the names of judges of the judicial district or districts covering the area served by the contested office. If the contestant does not proceed within the time provided for in this section, the action must be dismissed and the judge shall transmit a copy of the order for dismissal to the chief clerk of the house of representatives or the secretary of the senate, as appropriate.\nWithin 15 days after notice of contest has been filed, the judge shall convene the proceeding at an appropriate place within the county, or, if the district includes all or portions of more than one county, a county within the legislative district, and hear testimony of the parties under the ordinary rules of evidence for civil actions. The judge shall decide the contest, issue appropriate orders, and make written findings of fact and conclusions of law. Unless the matter is appealed to the supreme court, the judge, by the first day of the legislative session, shall transmit the findings, conclusions, orders, and records of the proceeding to the chief clerk of the house of representatives or the secretary of the senate, as appropriate.\nThe judge's decision may be appealed to the supreme court no later than ten days after its entry in the case of a general election contest or five days after its entry in the case of a primary contest. The record on appeal must be made, certified, and filed in the supreme court within 15 days after service of notice of appeal. The appellant shall file in the district court a bond of $500 for the payment of respondent's costs if appellant fails on appeal. The appeal from an election contest relating to the office of state senator or representative takes precedence over all other matters before the supreme court. A copy of the decision must be forwarded to the chief clerk of the house of representatives or the secretary of the senate, as appropriate.\nIn hearing a contest, the house of representatives or senate shall proceed as follows:\n(a) At the time appointed, the parties shall be called and, if they appear, their appearance shall be recorded.\n(b) If the presiding officer is a party, a speaker pro tem must be elected to preside.\n(c) The contestant shall submit evidence first, followed by the contestee, and the contestant shall open the argument and close the argument after the contestee has been heard.\n(d) The vote upon the contest must be viva voce, any member may offer reasons for an intended vote, and a majority of the votes given decides the issue. No party to the contest may vote upon any question relating thereto.\n(e) The clerk or secretary shall enter the proceedings in the journal.\nThis chapter does not limit the constitutional power of the house of representatives and the senate to judge the election returns and eligibility of their own members.",
	"repealed": false
}