{
	"id": "60A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.03",
	"title": "60A.03 COMMISSIONER OF COMMERCE.",
	"text": "The commissioner of commerce shall be appointed by the governor under the provisions of section 15.06. All of the commissioner's time shall be devoted to the duties of the office.\nThe commissioner shall have and exercise the power to enforce all the laws of this state relating to insurance, and shall enforce all the provisions of the laws of this state relating to insurance in the manner provided by the laws defining the powers and duties of the commissioner of commerce, or, in the absence of any law prescribing the procedure, by any reasonable procedure the commissioner prescribes.\n(1) Official staff. The commissioner may appoint a deputy or assistant commissioner of commerce to assist in the commissioner's duties, an actuary, a chief examiner, a statistician, and such assistants to these employees and such stenographic and clerical help as may be required for the proper conduct of the Department of Commerce.\n(2) Duties of departmental officials. In the absence or disability of the commissioner, the commissioner's duties shall be performed by the deputy or assistant commissioner of commerce. The actuary of the department shall, under the direction of the commissioner, make such valuation of life insurance policies as shall be necessary, from time to time, to the proper supervision of life insurance companies transacting business in this state, and shall perform such other actuarial duties, including the visitation and examination of insurance companies, as the commissioner may prescribe. The chief and assistant examiners shall, under the direction of the commissioner, devote their principal time to necessary or required examinations of insurance companies, and perform such other duties as the commissioner may prescribe. Other salaried employees of the Department of Commerce shall be under the direction of the commissioner and perform such duties, in connection with the Department of Commerce, as the commissioner may prescribe.\n(3) Consulting actuary, appointment and compensation. The commissioner may, when the commissioner shall deem it necessary, appoint any experienced and competent professional insurance actuary to personally make or conduct, or assist in making or conducting, an examination of any insurance company admitted, or applying for admission, to do business in this state, on condition that the commissioner shall have previously filed with the secretary of state a written declaration designating such person, by name and address, as a consulting actuary of the Department of Commerce. In this case, the commissioner shall fix a reasonable compensation for the actuary on a per diem basis for the actual time employed in making or conducting, or assisting to make or conduct, the examination, which compensation, together with the amount of the necessary expenses actually incurred by the actuary, including expenses of any necessary appraisal or clerical assistance, shall be charged to the company and paid by it to the actuary.\n(4) Appraiser, appointment and compensation. The commissioner, when deeming it necessary, may appoint any qualified person to make an appraisal of any or all of the assets of any such company. Such person shall be paid such reasonable fees for the appraisal as may be approved by the commissioner and shall also be paid necessary expenses actually incurred in connection with the services. Such compensation and expenses shall be paid by the company.\n[Repealed, 1969 c 7 s 2]\nWhen any visitation, examination, or appraisal is made by order of the commissioner, the company being examined, visited, or appraised, including, but not limited to, fraternals, township mutuals, reciprocal exchanges, nonprofit service plan corporations, health maintenance organizations, vendors of risk management services licensed under section 60A.23, or self-insurance plans or pools established under section 176.181 or 471.982, shall pay to the Department of Commerce the necessary expenses of the persons engaged in the examination, visit, appraisal, or desk audits of annual statements and records performed by the department other than on the company premises plus the per diem salary fees of the employees of the Department of Commerce who are conducting or participating in the examination, visitation, appraisal, or desk audit. The per diem salary fees may be based upon the approved examination fee schedules of the National Association of Insurance Commissioners or otherwise determined by the commissioner. All of these fees and expenses must be paid into the Department of Commerce revolving fund.\n(1) Revolving fund created. There is hereby created the Department of Commerce examination revolving fund for the purpose of carrying on the examination of foreign and domestic insurance companies.\n(2) Money in revolving fund. Such fund shall consist of the $7,500 appropriated therefor and the money transferred to it as herein provided, which are reappropriated to the commissioner of commerce for the purpose of this subdivision.\n(3) Fund to be kept in state treasury. Such fund shall be kept in the state treasury and shall be paid out in the manner prescribed by law for money therein.\n(4) Purposes for which fund may be expended. Such fund shall be used for the payment of per diem salaries and expenses of special examiners and appraisers, and the expenses of the commissioner of commerce, deputy commissioner of commerce, chief examiner, actuary other than a consulting actuary appointed under subdivision 3, clause (3) hereof, regular salaried examiners and other employees of the Department of Commerce when participating in examinations. Expenses include meals, lodging, laundry, transportation, and mileage. The salary of regular employees of the Division of Insurance shall not be paid out of this fund.\n(5) Collections to be deposited in fund. All money collected by the Division of Insurance from insurance companies for fees and expenses of examinations, shall be deposited in the insurance division examination revolving fund.\n(6) Payments from such fund. Upon authorization by the commissioner of commerce, the money due each examiner or employee engaged in an examination shall be paid from the insurance division examination revolving fund in the manner prescribed by law.\n(7) Excess over $25,000 canceled into general fund. The balance in such fund on June 30 of each year in excess of $25,000 shall be forthwith canceled into the general fund.\n[Repealed, 1969 c 707 s 1; 1969 c 1129 art 4 s 11]\n(1) Domestic insurers. The commissioner shall compute, yearly, the net value of all outstanding policies in every company authorized to insure lives in this state, calculated upon the basis stated in section 61A.25.\n(2) Foreign insurers. The commissioner may accept the valuation made by the insurance commissioner of the state under whose authority a life company was organized, when that valuation has been made on sound and recognized principles and on the legal basis provided in section 61A.25, or its equivalent, when furnished with a certificate of that commissioner setting forth that value on the last day of the preceding year. Every such life company which fails to promptly furnish this certificate shall, on demand, furnish the commissioner detailed lists of all its policies and securities, and shall be liable for all charges and expenses resulting therefrom.\nThe commissioner may not be required to divulge any information obtained in the course of the supervision of insurance companies, or the examination of insurance companies, including examination related correspondence and work papers, until the examination report is finally accepted and issued by the commissioner, and then only in the form of the final public report of examinations. Nothing contained in this subdivision prevents or shall be construed as prohibiting the commissioner from disclosing the content of this information to the insurance department of another state, the National Association of Insurance Commissioners, the National Association of Securities Dealers, or any national securities association registered under the Securities Exchange Act of 1934, if the recipient of the information agrees in writing to hold it as nonpublic data as defined in section 13.02, in a manner consistent with this subdivision. This subdivision does not apply to the extent the commissioner is required or permitted by law, or ordered by a court of law to testify or produce evidence in a civil or criminal proceeding. For purposes of this subdivision, a subpoena is not an order of a court of law.",
	"repealed": false
}