{
	"id": "257.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.75",
	"title": "257.75 RECOGNITION OF PARENTAGE.",
	"text": "The mother and father of a child born to a mother who was not married to the child's father nor to any other man when the child was conceived nor when the child was born may, in a writing signed by both of them before a notary public and filed with the state registrar of vital records, state and acknowledge under oath that they are the biological parents of the child and wish to be recognized as the biological parents. The recognition must be in the form prepared by the commissioner of children, youth, and families under subdivision 5, except that it may also include the joinder in recognition provisions under subdivision 1a. The requirement that the mother not be married when the child was conceived nor when the child was born does not apply if her spouse or former spouse joins in the recognition under subdivision 1a.\nA man who is a presumed father under section 257.55, subdivision 1, paragraph (a), may join in a recognition of parentage that recognizes that another man is the child's biological father. The man who is the presumed father under section 257.55, subdivision 1, paragraph (a), must sign an acknowledgment under oath before a notary public that he is renouncing the presumption under section 257.55, subdivision 1, paragraph (a), and recognizing that the father who is executing the recognition under subdivision 1 is the biological father of the child. A joinder in a recognition under this subdivision must be executed within one year after the child's birth and the joinder must be filed with the state registrar of vital records. The joinder must be on a form prepared by the commissioner of children, youth, and families. Failure to properly execute a joinder in a recognition does not affect the validity of the recognition under subdivision 1. A joinder without a corresponding recognition of parentage has no legal effect.\nA recognition may be revoked in a writing signed by the mother or father before a notary public and filed with the state registrar of vital records within the earlier of 60 days after the recognition is executed or the date of an administrative or judicial hearing relating to the child in which the revoking party is a party to the related action. A joinder in a recognition may be revoked in a writing signed by the man who executed the joinder and filed with the state registrar of vital records within 60 days after the joinder is executed. Upon receipt of a revocation of the recognition of parentage or joinder in a recognition, the state registrar of vital records shall forward a copy of the revocation to the nonrevoking parent, or, in the case of a joinder in a recognition, to the mother and father who executed the recognition.\n(a) Subject to subdivision 2 and section 257.55, subdivision 1, paragraph (g) or (h), the recognition has the force and effect of a judgment or order determining the existence of the parent and child relationship under section 257.66. If the conditions in section 257.55, subdivision 1, paragraph (g) or (h), exist, the recognition creates only a presumption of paternity for purposes of sections 257.51 to 257.74. Once a recognition has been properly executed and filed with the state registrar of vital records, if there are no competing presumptions of paternity, a judicial or administrative court may not allow further action to determine parentage regarding the signator of the recognition. An action to determine custody and parenting time may be commenced pursuant to chapter 518 without an adjudication of parentage. Until a temporary or permanent order is entered granting custody to another, the mother has sole custody.\n(b) Following commencement of an action to determine custody or parenting time under chapter 518, the court may, pursuant to section 518.131, grant temporary parenting time rights and temporary custody to either parent.\n(c) The recognition is:\n(1) a basis for bringing an action for the following:\n(i) to award temporary custody or parenting time pursuant to section 518.131;\n(ii) to award permanent custody or parenting time to either parent;\n(iii) establishing a child support obligation which may include up to the two years immediately preceding the commencement of the action;\n(iv) ordering a contribution by a parent under section 518A.82;\n(v) ordering a contribution to the reasonable expenses of the mother's pregnancy and confinement, as provided under section 257.66, subdivision 3; or\n(vi) ordering reimbursement for the costs of blood or genetic testing, as provided under section 257.69, subdivision 2;\n(2) determinative for all other purposes related to the existence of the parent and child relationship; and\n(3) entitled to full faith and credit in other jurisdictions.\n(a) An action to vacate a recognition of paternity may be brought by the mother, father, spouse or former spouse who executed a joinder, or the child. An action to vacate a recognition of parentage may be brought by the public authority. A mother, father, or spouse or former spouse who executed a joinder must bring the action within one year of the execution of the recognition or within six months after the person bringing the action obtains the results of blood or genetic tests that indicate that the man who executed the recognition is not the father of the child. A child must bring an action to vacate within six months after the child obtains the result of blood or genetic tests that indicate that the man who executed the recognition is not the father of the child, or within one year of reaching the age of majority, whichever is later. If the court finds a prima facie basis for vacating the recognition, the court shall order the child, mother, father, and spouse or former spouse who executed a joinder to submit to blood tests. If the court issues an order for the taking of blood tests, the court shall require the party seeking to vacate the recognition to make advance payment for the costs of the blood tests. If the party fails to pay for the costs of the blood tests, the court shall dismiss the action to vacate with prejudice. The court may also order the party seeking to vacate the recognition to pay the other party's reasonable attorney fees, costs, and disbursements. If the results of the blood tests establish that the man who executed the recognition is not the father, the court shall vacate the recognition. If a recognition is vacated, any joinder in the recognition under subdivision 1a is also vacated. The court shall terminate the obligation of a party to pay ongoing child support based on the recognition. A modification of child support based on a recognition may be made retroactive with respect to any period during which the moving party has pending a motion to vacate the recognition but only from the date of service of notice of the motion on the responding party.\n(b) The burden of proof in an action to vacate the recognition is on the moving party. The moving party must request the vacation on the basis of fraud, duress, or material mistake of fact. The legal responsibilities in existence at the time of an action to vacate, including child support obligations, may not be suspended during the proceeding, except for good cause shown.\n(a) The commissioner of children, youth, and families shall prepare a form for the recognition of parentage under this section. In preparing the form, the commissioner shall consult with the individuals specified in subdivision 6. The recognition form must be drafted so that the force and effect of the recognition, the alternatives to executing a recognition, the benefits and responsibilities of establishing paternity, and the limitations of the recognition of parentage for purposes of exercising and enforcing custody or parenting time are clear and understandable.\n(b) The form must include the following:\n(1) a notice regarding the finality of a recognition and the revocation procedure under subdivision 2;\n(2) a notice, in large print, that the recognition does not establish an enforceable right to legal custody, physical custody, or parenting time until such rights are awarded pursuant to a court action to establish custody and parenting time;\n(3) a notice stating that when a court awards custody and parenting time under chapter 518, there is no presumption for or against joint physical custody, except when domestic abuse, as defined in section 518B.01, subdivision 2, paragraph (a), has occurred between the parties;\n(4) a notice that the recognition of parentage is a basis for:\n(i) bringing a court action to award temporary or permanent custody or parenting time;\n(ii) establishing a child support obligation that may include the two years immediately preceding the commencement of the action;\n(iii) ordering a contribution by a parent under section 518A.82;\n(iv) ordering a contribution to the reasonable expenses of the mother's pregnancy and confinement, as provided under section 257.66, subdivision 3; and\n(v) ordering reimbursement for the costs of blood or genetic testing, as provided under section 257.69, subdivision 2; and\n(5) a provision for each parent to verify that the parent has read or viewed the educational materials prepared by the commissioner of children, youth, and families describing the recognition of paternity.\n(c) The individual providing the form to the parents for execution shall provide oral notice of the rights, responsibilities, and alternatives to executing the recognition. Notice may be provided in audio or video format, or by other similar means. Each parent must receive a copy of the recognition.\nThe commissioner of children, youth, and families shall prepare educational materials for new and prospective parents that describe the benefits and effects of establishing paternity. The materials must include a description and comparison of the procedures for establishment of paternity through a recognition of parentage under this section and an adjudication of paternity under sections 257.51 to 257.74. The commissioner shall consider the use of innovative audio or visual approaches to the presentation of the materials to facilitate understanding and presentation. In preparing the materials, the commissioner shall consult with child advocates and support workers, battered women's advocates and advocates for domestic abuse victims, social service providers, educators, attorneys, hospital representatives, and people who work with parents in making decisions related to paternity. The commissioner shall consult with representatives of communities of color. On and after January 1, 1994, the commissioner shall make the materials available without cost to hospitals, requesting agencies, and other persons for distribution to new parents.\nHospitals that provide obstetric services and the state registrar of vital records shall distribute the educational materials and recognition of parentage forms prepared by the commissioner of children, youth, and families to new parents, shall assist parents in understanding the recognition of parentage form, including following the provisions for notice under subdivision 5, shall provide notary services for parents who complete the recognition of parentage form, and shall timely file the completed recognition of parentage form with the Office of Vital Records unless otherwise instructed by the Office of Vital Records.\nIf the state registrar of vital records receives more than one recognition of parentage for the same child, the registrar shall notify both signatories on each recognition that the recognition is no longer final and that each man has only a presumption of paternity under section 257.55, subdivision 1.\nA recognition of parentage executed and filed in accordance with this section by a minor parent creates a presumption of paternity for the purposes of sections 257.51 to 257.74.",
	"repealed": false
}