{
	"id": "473.859",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.859",
	"title": "473.859 COMPREHENSIVE PLAN CONTENT.",
	"text": "The comprehensive plan shall contain objectives, policies, standards and programs to guide public and private land use, development, redevelopment and preservation for all lands and waters within the jurisdiction of the local governmental unit through 1990 and may extend through any year thereafter which is evenly divisible by five. Each plan shall specify expected industrial and commercial development, planned population distribution, and local public facility capacities upon which the plan is based. Each plan shall contain a discussion of the use of the public facilities specified in the metropolitan system statement and the effect of the plan on adjacent local governmental units and affected school districts. Existing plans and official controls may be used in whole or in part following modification, as necessary, to satisfy the requirements of sections 462.355, 473.175, and 473.851 to 473.871. Each plan may contain an intergovernmental coordination element that describes how its planned land uses and urban services affect other communities, adjacent local government units, the region, and the state, and that includes guidelines for joint planning and decision making with other communities, school districts, and other jurisdictions for siting public schools, building public facilities, and sharing public services.\nEach plan may contain an economic development element that identifies types of mixed use development, expansion facilities for businesses, and methods for developing a balanced and stable economic base.\nThe comprehensive plan may contain any additional matter which may be included in a comprehensive plan of the local governmental unit pursuant to the applicable planning statute.\n(a) A land use plan must include the water management plan required by section 103B.235, and shall designate the existing and proposed location, intensity and extent of use of land and water, including lakes, wetlands, rivers, streams, natural drainage courses, and adjoining land areas that affect water natural resources, for agricultural, residential, commercial, industrial and other public and private purposes, or any combination of such purposes.\n(b) A land use plan must contain a protection element, as appropriate, for historic sites, the matters listed in the water management plan required by section 103B.235, and an element for protection and development of access to direct sunlight for solar energy systems.\n(c) A land use plan must also include a housing element containing standards, plans and programs for providing adequate housing opportunities to meet existing and projected local and regional housing needs, including but not limited to the use of official controls and land use planning to promote the availability of land for the development of low and moderate income housing.\n(d) A land use plan must also include the local government's goals, intentions, and priorities concerning aggregate and other natural resources, transportation infrastructure, land use compatibility, habitat, agricultural preservation, and other planning priorities, considering information regarding supply from the Minnesota Geological Survey Information Circular No. 46.\n(e) A land use plan must also include an inventory and projections pertaining to greenhouse gas emissions and vehicle miles traveled that are generated from activity that occurs within the local government's jurisdiction. The inventory and projections must include the emission sources from transportation, land use, energy use, solid waste, and, where available and applicable, livestock and agriculture. The inventory and projections must include the estimated impact of strategies, including efficient land use and compact growth, that reduce or naturally sequester greenhouse gas emissions across sectors.\nSubdivision 2, paragraph (d), applies only to land use plans adopted or amended by the governing body in relation to aggregate or when the governing body is presented with a written application for adoption or amendment of a land use plan relating to aggregate, from a landowner after August 1, 2001, in the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\nA public facilities plan shall describe the character, location, timing, sequence, function, use and capacity of existing and future public facilities of the local governmental unit. A public facilities plan must be in at least such detail as may be necessary to establish existing or potential effects on or departures from metropolitan system plans and to protect metropolitan system plans. A public facilities plan shall contain at least the following parts:\n(1) a transportation plan describing, designating and scheduling the location, extent, function and capacity of existing and proposed local public and private transportation services and facilities;\n(2) a sewer policy plan describing, designating and scheduling the areas to be sewered by the public system, the existing and planned capacities of the public system, the standards and conditions under which the installation of private sewer systems will be permitted, and to the extent practicable, the areas not suitable for public or private systems because of public health, safety and welfare considerations;\n(3) a parks and open space plan describing, designating and scheduling the existing and proposed parks and recreation open spaces within the jurisdiction; and\n(4) a water supply plan as described in section 103G.291, subdivision 3.\nAn implementation program shall describe public programs, fiscal devices and other specific actions to be undertaken in stated sequence to implement the comprehensive plan and ensure conformity with metropolitan system plans. An implementation program must be in at least such detail as may be necessary to establish existing or potential effects on or departures from metropolitan system plans and to protect metropolitan system plans. An implementation program shall contain at least the following parts:\n(1) a description of official controls, addressing at least the matters of zoning, subdivision, water supply, and private sewer systems, and a schedule for the preparation, adoption, and administration of such controls;\n(2) a capital improvement program for transportation, sewers, parks, water supply, and open space facilities; and\n(3) a housing implementation program, including official controls to implement the housing element of the land use plan, which will provide sufficient existing and new housing to meet the local unit's share of the metropolitan area need for low and moderate income housing.\nThe comprehensive plans may designate, when appropriate, five-year urbanization areas and shall specify in the capital improvement program the timing and sequence of major local public facilities and in the implementation program official controls which will ensure that urbanization occurs only in urbanization areas and in accordance with the plan.\nThe comprehensive plans may designate, when appropriate, redevelopment areas and may, as appropriate, specify in the capital improvement program the timing and sequence of local public facilities and in the implementation program the fiscal devices or official controls that will ensure that redevelopment occurs in accordance with the plan.\nThe council shall prepare guidelines for the preparation of the water supply plans required in subdivision 3, clause (4). The plans must be submitted to the council as part of the decennial review required under section 473.864, subdivision 2. The council shall review the plans under section 473.175, subdivision 1, after submitting them to affected counties that have adopted groundwater plans under section 103B.255 for their review and comment.\nThe council must specify how climate mitigation and adaptation information required pursuant to subdivision 2 and section 473.145 must be incorporated into comprehensive plan content.",
	"repealed": false
}