{
	"id": "179A.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.54",
	"title": "179A.54 INDIVIDUAL PROVIDERS OF DIRECT SUPPORT SERVICES.",
	"text": "For the purposes of this section:\n(a) \"Direct support services\" has the meaning given to it under section 256B.0711, subdivision 1, paragraph (c).\n(b) \"Individual provider\" has the meaning given to it under section 256B.0711, subdivision 1, paragraph (d).\n(c) \"Participant\" has the meaning given to it under section 256B.0711, subdivision 1, paragraph (e).\n(d) \"Participant's representative\" has the meaning given to it under section 256B.0711, subdivision 1, paragraph (f).\nFor the purposes of the Public Employment Labor Relations Act, under chapter 179A, individual providers shall be considered, by virtue of this section, executive branch state employees employed by the commissioner of management and budget or the commissioner's representative. This section does not require the treatment of individual providers as public employees for any other purpose. Individual providers are not state employees for purposes of section 3.736. Chapter 179A shall apply to individual providers except as otherwise provided in this section. Notwithstanding section 179A.03, subdivision 14, paragraph (a), clause (5), chapter 179A shall apply to individual providers regardless of part-time or full-time employment status.\nIf an exclusive representative is certified pursuant to this section, the mutual rights and obligations of the state and an exclusive representative of individual providers to meet and negotiate regarding terms and conditions shall extend to the subjects covered under section 256B.0711, subdivision 4, paragraph (c), but shall not include those subjects reserved to participants or participants' representatives by subdivision 4.\nNo provision of any agreement reached between the state and any exclusive representative of individual providers, nor any arbitration award, shall interfere with the rights of participants or participants' representatives to select, hire, direct, supervise, and terminate the employment of their individual providers; to manage an individual service budget regarding the amounts and types of authorized goods or services received; or to receive direct support services from individual providers not referred to them through a state registry.\nThe commissioner of management and budget is authorized to enter into and implement agreements, including interest arbitration decisions, with the exclusive representative of individual providers as provided in section 179A.22, subdivision 4, except for terms and conditions requiring appropriations, changes to state law, or approval from the federal government which shall be contingent upon and executed following receipt of appropriations and state and federal approval.\nIndividual providers shall be subject to the prohibition on strikes applied to essential employees under section 179A.18.\nIndividual providers shall be subject to the interest arbitration procedures applied to essential employees under section 179A.16.\nThe only appropriate unit for individual providers shall be a statewide unit of all individual providers. The unit shall be treated as an appropriate unit under section 179A.10, subdivision 2. Individual providers who are related to their participant or their participant's representative shall not for such reason be excluded from the appropriate unit.\nBeginning September 1, 2013, upon a showing made to the commissioner of the Bureau of Mediation Services by any employee organization wishing to represent the appropriate unit of individual providers that at least 500 individual providers support such representation, the commissioner of the Bureau of Mediation Services shall provide to such organization within seven days the most recent list of individual providers compiled under section 256B.0711, subdivision 4, paragraph (f), and three subsequent monthly lists upon request. The commissioner of the Bureau of Mediation Services shall provide lists compiled under section 256B.0711, subdivision 4, paragraph (f), upon request, to any exclusive representative of individual providers. To facilitate operation of this section, the commissioner of human services shall provide all lists to the commissioner of the Bureau of Mediation Services, upon the request of the commissioner of the Bureau of Mediation Services. When the list is available to an employee organization under this subdivision, the list must be made publicly available.\nBeginning October 1, 2013, any employee organization wishing to represent the appropriate unit of individual providers may seek exclusive representative status pursuant to section 179A.12. Certification elections for individual providers shall be conducted by mail ballot, and such election shall be conducted upon an appropriate petition stating that among individual providers who have been paid for providing direct support services to participants within the previous 12 months, a number of individual providers equal to at least 30 percent of those eligible to vote wish to be represented by the petitioner. The individual providers eligible to vote in any such election shall be those individual providers on the monthly list of individual providers compiled under section 256B.0711, subdivision 4, paragraph (f), most recently preceding the filing of the election petition. Except as otherwise provided, elections under this section shall be conducted in accordance with section 179A.12.\n(a) The state and an exclusive representative certified pursuant to this section may establish a joint labor and management trust, referred to as the Home Care Orientation Trust, for the exclusive purpose of rendering voluntary orientation training to individual providers of direct support services who are represented by the exclusive representative.\n(b) Financial contributions by the state to the Home Care Orientation Trust must be made by the state pursuant to a collective bargaining agreement negotiated under this section. All such financial contributions by the state must be held in trust for the purpose of paying, from principal, from income, or from both, the costs associated with developing, delivering, and promoting voluntary orientation training for individual providers of direct support services working under a collective bargaining agreement and providing services through a covered program under section 256B.0711. The Home Care Orientation Trust must be administered, managed, and otherwise controlled jointly by a board of trustees composed of an equal number of trustees appointed by the state and trustees appointed by the exclusive representative under this section. The trust shall not be an agent of either the state or of the exclusive representative.\n(c) Trust administrative, management, legal, and financial services may be provided to the board of trustees by a third-party administrator, financial management institution, other appropriate entity, or any combination thereof, as designated by the board of trustees from time to time, and those services must be paid from the money held in trust and created by the state's financial contributions to the Home Care Orientation Trust.\n(d) The state is authorized to purchase liability insurance for members of the board of trustees appointed by the state.\n(e) Financial contributions to or participation in the management or administration of the Home Care Orientation Trust must not be considered an unfair labor practice under section 179A.13, or a violation of Minnesota law.",
	"repealed": false
}