{
	"id": "256D.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.35",
	"title": "256D.35 DEFINITIONS.",
	"text": "The terms defined in this section shall have the meanings given them. The definitions in this section apply to sections 256D.33 to 256D.54.\n[Repealed, 1989 c 282 art 5 s 133]\n\"Aged\" means having reached age 65 or reaching the age of 65 during the month of application.\n[Repealed, 1989 c 282 art 5 s 133]\n\"Assistance unit\" means the individual applicant or recipient or an eligible applicant married couple or recipient married couple who live together.\n[Repealed, 1989 c 282 art 5 s 133]\n\"Blind\" means the condition of a person whose central visual acuity does not exceed 20/200 in the better eye with correcting lenses, or, if visual acuity is greater than 20/200, the condition is accompanied by limitation in the fields of vision such that the widest diameter of the visual field subtends an angle no greater than 20 degrees. A person who receives Supplemental Security Income based on other visual disabilities may also be eligible for the Minnesota supplemental aid program.\n\"Commissioner\" means the commissioner of human services or a designee.\n\"Department\" means the Department of Human Services.\n\"County agency\" means the local social services agencies in the several counties of the state except that it may also include any multicounty local social services agencies where those have been established in accordance with law.\n[Repealed, 1989 c 282 art 5 s 133]\n\"Disability\" means disability as determined under the criteria used by the Title II program of the Social Security Act.\n\"Emergency\" means circumstances that demand immediate action to safeguard against threats to health or safety of an individual.\n\"Financially responsible relative\" means a spouse or a parent of a minor child.\n\"Good cause\" means a reason for taking an action or failing to take an action that is reasonable and justified when viewed in the context of surrounding circumstances.\n\"Homestead\" means a shelter in which the individual or the spouse with whom the individual lives has an ownership interest, and that is the principal residence of the individual, spouse, or the individual's minor child or child with a disability. The home may be either real or personal property, fixed or mobile, and located on land or water. The home includes all the land that appertains to it and buildings located on that land.\n\"Gross income\" means the total amount of earned and unearned money received in a month before any deductions or disregards are applied.\n\"In-kind income\" means income, benefits, or payments that are provided in a form other than money or liquid asset. In-kind income includes goods, produce, services, privileges, or payments on behalf of a person by a third party; except benefits of the recipient, such as those administered by the Social Security Administration, that are paid to a representative payee, and are spent on behalf of the applicant or recipient, are not in-kind income, but are considered available income of the applicant or recipient.\n\"Institution\" means a hospital, consistent with Code of Federal Regulations, title 42, section 440.10; regional treatment center inpatient services, consistent with section 246C.12; a nursing facility; and an intermediate care facility for persons with developmental disabilities.\n\"Lump sum\" means money received on an irregular or unexpected basis.\n\"Maintenance benefit\" means cash payments, other than Minnesota supplemental aid, provided under law or rule. Maintenance benefit includes workers' compensation, unemployment benefits, railroad retirement, veterans benefits, Supplemental Security Income, Social Security disability insurance, or other benefits identified by the county agency that provide periodic benefits that can be used to meet the basic needs of the assistance unit.\n[Repealed, 1995 c 207 art 5 s 40]\n\"Net income\" means monthly income remaining after allowable deductions and disregards are subtracted from gross income.\n\"Overpayment\" means an amount of Minnesota supplemental aid paid to a recipient that exceeds the amount to which the recipient is entitled for that month.\n\"Potential eligibility\" means a determination by a county agency that an assistance unit or a financially responsible relative appears to meet the eligibility requirements of another maintenance benefit program.\n\"Retirement, survivors, and disability insurance\" means benefits paid under the federal program for retired, disabled, and surviving spouses of retired or disabled individuals under Title II of the Social Security Act.\n\"Shelter costs\" means rent, manufactured home lot rentals; monthly principal, interest, insurance premiums, and property taxes due for mortgages or contract for deed costs; costs for utilities, including heating, cooling, electricity, water, and sewerage; garbage collection fees; and the basic service fee for one telephone.\n[Repealed, 1995 c 207 art 5 s 40]\n\"Supplemental Security Income\" means benefits paid under the federal program of Supplemental Security Income for the aged, blind, and disabled under Title XVI of the Social Security Act.",
	"repealed": false
}