{
	"id": "176.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.103",
	"title": "176.103 MEDICAL HEALTH CARE REVIEW.",
	"text": "It is the purpose of this section to provide for review of clinical health care providers who render services to injured employees. This review shall be achieved by establishing a quality control system within the Department of Labor and Industry.\nThe commissioner shall hire a medical consultant to assist in the administration of this section.\nThe medical consultant shall be a doctor of medicine licensed under the laws of Minnesota.\nThe medical consultant shall perform all duties assigned by the commissioner relating to the supervision of the total continuum of care of injured employees and shall also advise the department on matters on which the commissioner requests the consultant's advice or if the consultant deems it appropriate.\nThe commissioner shall monitor the medical and surgical treatment provided to injured employees, the services of other health care providers and shall also monitor hospital utilization as it relates to the treatment of injured employees. This monitoring shall include determinations concerning the appropriateness of the service, whether the treatment is necessary and effective, the proper cost of services, the quality of the treatment, the right of providers to receive payment under this chapter for services rendered or the right to receive payment under this chapter for future services. Insurers and self-insurers must assist the commissioner in this monitoring by reporting to the commissioner cases of suspected excessive, inappropriate, or unnecessary treatment. The commissioner in consultation with the Medical Services Review Board shall adopt rules defining standards of treatment including inappropriate, unnecessary, or excessive treatment and the sanctions to be imposed for inappropriate, unnecessary, or excessive treatment. The sanctions imposed may include, without limitation, a warning, a restriction on providing treatment, requiring preauthorization by the board for a plan of treatment, and suspension from receiving compensation for the provision of treatment under chapter 176. The commissioner's authority under this section also includes the authority to make determinations regarding any other activity involving the questions of utilization of medical services, and any other determination the commissioner deems necessary for the proper administration of this section, but does not include the authority to make the initial determination of primary liability, except as provided by section 176.305.\n[Repealed, 1995 c 231 art 2 s 110]\n(a) There is created a Medical Services Review Board composed of the commissioner or the commissioner's designee as an ex officio member and the following health care providers: two chiropractors, one physical therapist, one registered nurse, one occupational therapist, and six physicians representing different specialties which the commissioner determines are the most frequently utilized by injured employees. All health care provider members must maintain a license in the state of Minnesota to furnish medical or health services under their specific designation throughout their appointment period. The board shall also have one person representing hospitals, one person representing employees, and one person representing employers or insurers. The members shall be appointed by the commissioner and shall be governed by section 15.0575. Terms of the board's members may be renewed. The board may appoint from its members whatever subcommittees it deems appropriate. Notwithstanding section 15.059, this board does not expire unless the board no longer fulfills the purpose for which the board was established, the board has not met in the last 18 months, or the board does not comply with the registration requirements of section 15.0599, subdivision 3.\nThe commissioner may appoint alternates for one-year terms to serve as a member when a member is unavailable. The number of alternates shall not exceed one chiropractor, one physical therapist, one registered nurse, one hospital representative, three physicians, one employee representative, one employer or insurer representative, and one occupational therapist.\n(b) The board shall review clinical results for adequacy and recommend to the commissioner scales for disabilities and apportionment.\n(c) The board shall review and recommend to the commissioner rates for individual clinical procedures and aggregate costs. The board shall assist the commissioner in accomplishing public education.\n(d) In evaluating the clinical consequences of the services provided to an employee by a clinical health care provider, the board shall consider the following factors in the priority listed:\n(1) the clinical effectiveness of the treatment;\n(2) the clinical cost of the treatment; and\n(3) the length of time of treatment.\n(e) The board shall advise the commissioner on the adoption of rules regarding all aspects of medical care and services provided to injured employees.\n(f) The Medical Services Review Board may upon petition from the commissioner and after hearing, issue a warning, a penalty of $200 per violation, a restriction on providing treatment that requires preauthorization by the board, commissioner, or compensation judge for a plan of treatment, disqualify, or suspend a provider from receiving payment for services rendered under this chapter if a provider has violated any part of this chapter or rule adopted under this chapter, or where there has been a pattern of, or an egregious case of, inappropriate, unnecessary, or excessive treatment by a provider. Any penalties collected under this subdivision shall be payable to the commissioner for deposit in the assigned risk safety account. The hearings are initiated by the commissioner under the contested case procedures of chapter 14. The board shall make the final decision following receipt of the recommendation of the administrative law judge. The board's decision is appealable to the Workers' Compensation Court of Appeals in the manner provided by section 176.421.\n(g) The board may adopt rules of procedure. The rules may be joint rules with the rehabilitation review panel.\n(h) Except where the board is making a decision in a contested case matter under paragraph (b), the board may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the board participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the board can hear clearly all discussion and testimony and all votes of members of the board and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of the board is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(i) Each member of the board participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(j) If telephone or other electronic means are used to conduct a regular, special, or emergency meeting, the board, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The board or the Department of Labor and Industry may require the person making such a connection to pay for documented costs that the board or the Department of Labor and Industry incurs as a result of the additional connection.\n(k) If telephone or other electronic means are used to conduct a regular, special, or emergency meeting, the board shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and that a person may monitor the meeting electronically from a remote location. The timing and method of providing notice is governed by section 13D.04.\n[Repealed, 1987 c 332 s 117]",
	"repealed": false
}