{
	"id": "260C.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.212",
	"title": "260C.212 CHILDREN IN PLACEMENT.",
	"text": "(a) An out-of-home placement plan shall be prepared within 30 days after any child is placed in foster care by court order or a voluntary placement agreement between the responsible social services agency and the child's parent pursuant to section 260C.227 or chapter 260D.\n(b) An out-of-home placement plan means a written document individualized to the needs of the child and the child's parents or guardians that is prepared by the responsible social services agency jointly with the child's parents or guardians and in consultation with the child's guardian ad litem; the child's tribe, if the child is an Indian child; the child's foster parent or representative of the foster care facility; and, when appropriate, the child. When a child is age 14 or older, the child may include two other individuals on the team preparing the child's out-of-home placement plan. The child may select one member of the case planning team to be designated as the child's advisor and to advocate with respect to the application of the reasonable and prudent parenting standards. The responsible social services agency may reject an individual selected by the child if the agency has good cause to believe that the individual would not act in the best interest of the child. For a child in voluntary foster care for treatment under chapter 260D, preparation of the out-of-home placement plan shall additionally include the child's mental health treatment provider. For a child 18 years of age or older, the responsible social services agency shall involve the child and the child's parents as appropriate. As appropriate, the plan shall be:\n(1) submitted to the court for approval under section 260C.178, subdivision 7;\n(2) ordered by the court, either as presented or modified after hearing, under section 260C.178, subdivision 7, or 260C.201, subdivision 6; and\n(3) signed by the parent or parents or guardian of the child, the child's guardian ad litem, a representative of the child's tribe, the responsible social services agency, and, if possible, the child.\n(c) The out-of-home placement plan shall be explained by the responsible social services agency to all persons involved in the plan's implementation, including the child who has signed the plan, and shall set forth:\n(1) a description of the foster care home or facility selected, including how the out-of-home placement plan is designed to achieve a safe placement for the child in the least restrictive, most family-like setting available that is in close proximity to the home of the child's parents or guardians when the case plan goal is reunification; and how the placement is consistent with the best interests and special needs of the child according to the factors under subdivision 2, paragraph (b);\n(2) the specific reasons for the placement of the child in foster care, and when reunification is the plan, a description of the problems or conditions in the home of the parent or parents that necessitated removal of the child from home and the changes the parent or parents must make for the child to safely return home;\n(3) a description of the services offered and provided to prevent removal of the child from the home and to reunify the family including:\n(i) the specific actions to be taken by the parent or parents of the child to eliminate or correct the problems or conditions identified in clause (2), and the time period during which the actions are to be taken; and\n(ii) the reasonable efforts, or in the case of an Indian child, active efforts to be made to achieve a safe and stable home for the child including social and other supportive services to be provided or offered to the parent or parents or guardian of the child, the child, and the residential facility during the period the child is in the residential facility;\n(4) a description of any services or resources that were requested by the child or the child's parent, guardian, foster parent, or custodian since the date of the child's placement in the residential facility, and whether those services or resources were provided and if not, the basis for the denial of the services or resources;\n(5) the visitation plan for the parent or parents or guardian, other relatives as defined in section 260C.007, subdivision 26b or 27, and siblings of the child if the siblings are not placed together in foster care, and whether visitation is consistent with the best interest of the child, during the period the child is in foster care;\n(6) when a child cannot return to or be in the care of either parent, documentation of steps to finalize adoption as the permanency plan for the child through reasonable efforts to place the child for adoption pursuant to section 260C.605. At a minimum, the documentation must include consideration of whether adoption is in the best interests of the child and child-specific recruitment efforts such as a relative search, consideration of relatives for adoptive placement, and the use of state, regional, and national adoption exchanges to facilitate orderly and timely placements in and outside of the state. A copy of this documentation shall be provided to the court in the review required under section 260C.317, subdivision 3, paragraph (b);\n(7) when a child cannot return to or be in the care of either parent, documentation of steps to finalize the transfer of permanent legal and physical custody to a relative as the permanency plan for the child. This documentation must support the requirements of the kinship placement agreement under section 142A.605 and must include the reasonable efforts used to determine that it is not appropriate for the child to return home or be adopted, and reasons why permanent placement with a relative through a Northstar kinship assistance arrangement is in the child's best interest; how the child meets the eligibility requirements for Northstar kinship assistance payments; agency efforts to discuss adoption with the child's relative foster parent and reasons why the relative foster parent chose not to pursue adoption, if applicable; and agency efforts to discuss with the child's parent or parents the permanent transfer of permanent legal and physical custody or the reasons why these efforts were not made;\n(8) efforts to ensure the child's educational stability while in foster care for a child who attained the minimum age for compulsory school attendance under state law and is enrolled full time in elementary or secondary school, or instructed in elementary or secondary education at home, or instructed in an independent study elementary or secondary program, or incapable of attending school on a full-time basis due to a medical condition that is documented and supported by regularly updated information in the child's case plan. Educational stability efforts include:\n(i) efforts to ensure that the child remains in the same school in which the child was enrolled prior to placement or upon the child's move from one placement to another, including efforts to work with the local education authorities to ensure the child's educational stability and attendance; or\n(ii) if it is not in the child's best interest to remain in the same school that the child was enrolled in prior to placement or move from one placement to another, efforts to ensure immediate and appropriate enrollment for the child in a new school;\n(9) the educational records of the child including the most recent information available regarding:\n(i) the names and addresses of the child's educational providers;\n(ii) the child's grade level performance;\n(iii) the child's school record;\n(iv) a statement about how the child's placement in foster care takes into account proximity to the school in which the child is enrolled at the time of placement; and\n(v) any other relevant educational information;\n(10) the efforts by the responsible social services agency to ensure the oversight and continuity of health care services for the foster child, including:\n(i) the plan to schedule the child's initial health screens;\n(ii) how the child's known medical problems and identified needs from the screens, including any known communicable diseases, as defined in section 144.4172, subdivision 2, shall be monitored and treated while the child is in foster care;\n(iii) how the child's medical information shall be updated and shared, including the child's immunizations;\n(iv) who is responsible to coordinate and respond to the child's health care needs, including the role of the parent, the agency, and the foster parent;\n(v) who is responsible for oversight of the child's prescription medications;\n(vi) how physicians or other appropriate medical and nonmedical professionals shall be consulted and involved in assessing the health and well-being of the child and determine the appropriate medical treatment for the child; and\n(vii) the responsibility to ensure that the child has access to medical care through either medical insurance or medical assistance;\n(11) the health records of the child including information available regarding:\n(i) the names and addresses of the child's health care and dental care providers;\n(ii) a record of the child's immunizations;\n(iii) the child's known medical problems, including any known communicable diseases as defined in section 144.4172, subdivision 2;\n(iv) the child's medications; and\n(v) any other relevant health care information such as the child's eligibility for medical insurance or medical assistance;\n(12) an independent living plan for a child 14 years of age or older, developed in consultation with the child. The child may select one member of the case planning team to be designated as the child's advisor and to advocate with respect to the application of the reasonable and prudent parenting standards in subdivision 14. The plan should include, but not be limited to, the following objectives:\n(i) educational, vocational, or employment planning;\n(ii) health care planning and medical coverage;\n(iii) transportation including, where appropriate, assisting the child in obtaining a driver's license;\n(iv) money management, including the responsibility of the responsible social services agency to ensure that the child annually receives, at no cost to the child, a consumer report as defined under section 13C.001 and assistance in interpreting and resolving any inaccuracies in the report;\n(v) planning for housing;\n(vi) social and recreational skills;\n(vii) establishing and maintaining connections with the child's family and community; and\n(viii) regular opportunities to engage in age-appropriate or developmentally appropriate activities typical for the child's age group, taking into consideration the capacities of the individual child;\n(13) for a child in voluntary foster care for treatment under chapter 260D, diagnostic and assessment information, specific services relating to meeting the mental health care needs of the child, and treatment outcomes;\n(14) for a child 14 years of age or older, a signed acknowledgment that describes the child's rights regarding education, health care, visitation, safety and protection from exploitation, and court participation; receipt of the documents identified in section 260C.452; and receipt of an annual credit report. The acknowledgment shall state that the rights were explained in an age-appropriate manner to the child; and\n(15) for a child placed in a qualified residential treatment program, the plan must include the requirements in section 260C.708.\n(d) The parent or parents or guardian and the child each shall have the right to legal counsel in the preparation of the case plan and shall be informed of the right at the time of placement of the child. The child shall also have the right to a guardian ad litem. If unable to employ counsel from their own resources, the court shall appoint counsel upon the request of the parent or parents or the child or the child's legal guardian. The parent or parents may also receive assistance from any person or social services agency in preparation of the case plan.\n(e) Before an out-of-home placement plan is signed by the parent or parents or guardian of the child, the responsible social services agency must provide the parent or parents or guardian with a one- to two-page summary of the plan using a form developed by the commissioner. The out-of-home placement plan summary must clearly summarize the plan's contents under paragraph (c) and list the requirements and responsibilities for the parent or parents or guardian using plain language. The summary must be updated and provided to the parent or parents or guardian when the out-of-home placement plan is updated under subdivision 1a.\n(f) After the plan has been agreed upon by the parties involved or approved or ordered by the court, the foster parents shall be fully informed of the provisions of the case plan and shall be provided a copy of the plan.\n(g) Upon the child's discharge from foster care, the responsible social services agency must provide the child's parent, adoptive parent, or permanent legal and physical custodian, and the child, if the child is 14 years of age or older, with a current copy of the child's health and education record. If a child meets the conditions in subdivision 15, paragraph (b), the agency must also provide the child with the child's social and medical history. The responsible social services agency may give a copy of the child's health and education record and social and medical history to a child who is younger than 14 years of age, if it is appropriate and if subdivision 15, paragraph (b), applies.\n[See Note.]\n(a) Within 30 days of placing the child in foster care, the agency must file the child's initial out-of-home placement plan with the court. After filing the child's initial out-of-home placement plan, the agency shall update and file the child's out-of-home placement plan with the court as follows:\n(1) when the agency moves a child to a different foster care setting, the agency shall inform the court within 30 days of the child's placement change or court-ordered trial home visit. The agency must file the child's updated out-of-home placement plan with the court at the next required review hearing;\n(2) when the agency places a child in a qualified residential treatment program as defined in section 260C.007, subdivision 26d, or moves a child from one qualified residential treatment program to a different qualified residential treatment program, the agency must update the child's out-of-home placement plan within 60 days. To meet the requirements of section 260C.708, the agency must file the child's out-of-home placement plan along with the agency's report seeking the court's approval of the child's placement at a qualified residential treatment program under section 260C.71. After the court issues an order, the agency must update the child's out-of-home placement plan to document the court's approval or disapproval of the child's placement in a qualified residential treatment program;\n(3) when the agency places a child with the child's parent in a licensed residential family-based substance use disorder treatment program under section 260C.190, the agency must identify the treatment program where the child will be placed in the child's out-of-home placement plan prior to the child's placement. The agency must file the child's out-of-home placement plan with the court at the next required review hearing; and\n(4) under sections 260C.227 and 260C.521, the agency must update the child's out-of-home placement plan and file the child's out-of-home placement plan with the court.\n(b) When none of the items in paragraph (a) apply, the agency must update the child's out-of-home placement plan no later than 180 days after the child's initial placement and every six months thereafter, consistent with section 260C.203, paragraph (a).\n(a) The policy of the state of Minnesota is to ensure that the child's best interests are met by requiring an individualized determination of the needs of the child in consideration of paragraphs (a) to (f), and of how the selected placement will serve the current and future needs of the child being placed. The authorized child-placing agency shall place a child, released by court order or by voluntary release by the parent or parents, in a family foster home selected by considering placement with relatives in the following order:\n(1) with an individual who is related to the child by blood, marriage, or adoption, including the legal parent, guardian, or custodian of the child's sibling; or\n(2) with an individual who is an important friend of the child or of the child's parent or custodian, including an individual with whom the child has resided or had significant contact or who has a significant relationship to the child or the child's parent or custodian.\nFor an Indian child, the agency shall follow the order of placement preferences in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1915.\n(b) Among the factors the agency shall consider in determining the current and future needs of the child are the following:\n(1) the child's current functioning and behaviors;\n(2) the medical needs of the child;\n(3) the educational needs of the child;\n(4) the developmental needs of the child;\n(5) the child's history and past experience;\n(6) the child's religious and cultural needs;\n(7) the child's connection with a community, school, and faith community;\n(8) the child's interests and talents;\n(9) the child's current and long-term needs regarding relationships with parents, siblings, relatives, and other caretakers;\n(10) the reasonable preference of the child, if the court, or the child-placing agency in the case of a voluntary placement, deems the child to be of sufficient age to express preferences; and\n(11) for an Indian child, the best interests of an Indian child as defined in section 260.755, subdivision 2a.\nWhen placing a child in foster care or in a permanent placement based on an individualized determination of the child's needs, the agency must not use one factor in this paragraph to the exclusion of all others, and the agency shall consider that the factors in paragraph (b) may be interrelated.\n(c) Placement of a child cannot be delayed or denied based on race, color, or national origin of the foster parent or the child.\n(d) Siblings should be placed together for foster care and adoption at the earliest possible time unless it is documented that a joint placement would be contrary to the safety or well-being of any of the siblings or unless it is not possible after reasonable efforts by the responsible social services agency. In cases where siblings cannot be placed together, the agency is required to provide frequent visitation or other ongoing interaction between siblings unless the agency documents that the interaction would be contrary to the safety or well-being of any of the siblings.\n(e) The following requirements must be satisfied before the approval of a foster placement in a related or unrelated home: (1) a completed background study under section 245C.08; and (2) a completed review of the written home study required under section 260C.215, subdivision 4, clause (5), to assess the capacity of the prospective foster parent to ensure the placement will meet the needs of the individual child. For adoptive placements in a related or unrelated home, the home must meet the requirements of section 260C.611.\n(f) The agency must determine whether colocation with a parent who is receiving services in a licensed residential family-based substance use disorder treatment program is in the child's best interests according to paragraph (b) and include that determination in the child's case plan under subdivision 1. The agency may consider additional factors not identified in paragraph (b). The agency's determination must be documented in the child's case plan before the child is colocated with a parent.\n(g) The agency must establish a juvenile treatment screening team under section 260C.157 to determine whether it is necessary and appropriate to recommend placing a child in a qualified residential treatment program, as defined in section 260C.007, subdivision 26d.\n(h) A child in foster care must not be placed in an unlicensed emergency relative placement under section 142B.06 or licensed family foster home when the responsible social services agency is aware that a prospective foster parent, license applicant, license holder, or adult household member has a permanent disqualification under section 245C.15, subdivision 4a, paragraphs (a) and (b).\nIf a child has been placed in a residential facility pursuant to a court order under section 260C.178 or 260C.201, the social services agency responsible for the residential facility placement for the child may not change the child's placement unless the agency specifically documents that the current placement is unsuitable or another placement is in the best interests of the child. This subdivision does not apply if the new placement is in an adoptive home or other permanent placement.\nMS 2010 [Renumbered 260C.219]\n(a) Every child in foster care or on a trial home visit shall be visited by the child's caseworker or another person who has responsibility for visitation of the child on a monthly basis, with the majority of visits occurring in the child's residence. The responsible social services agency may designate another person responsible for monthly case visits. For the purposes of this section, the following definitions apply:\n(1) \"visit\" is defined as a face-to-face contact between a child and the child's caseworker;\n(2) \"visited on a monthly basis\" is defined as at least one visit per calendar month;\n(3) \"the child's caseworker\" is defined as the person who has responsibility for managing the child's foster care placement case as assigned by the responsible social services agency;\n(4) \"another person\" means the professional staff whom the responsible social services agency has assigned in the out-of-home placement plan or case plan. Another person must be professionally trained to assess the child's safety, permanency, well-being, and case progress. The agency may not designate the guardian ad litem, the child foster care provider, residential facility staff, or a qualified individual as defined in section 260C.007, subdivision26b, as another person; and\n(5) \"the child's residence\" is defined as the home where the child is residing, and can include the foster home, child care institution, or the home from which the child was removed if the child is on a trial home visit.\n(b) Caseworker visits shall be of sufficient substance and duration to address issues pertinent to case planning and service delivery to ensure the safety, permanency, and well-being of the child, including whether the child is enrolled and attending school as required by law.\n(c) Every effort shall be made by the responsible social services agency and professional staff to have the monthly visit with the child outside the presence of the child's parents, foster parents, or facility staff. There may be situations related to the child's needs when a caseworker visit cannot occur with the child alone. The reason the caseworker visit occurred in the presence of others must be documented in the case record and may include:\n(1) that the child exhibits intense emotion or behavior indicating that visiting without the presence of the parent, foster parent, or facility staff would be traumatic for the child;\n(2) that despite a caseworker's efforts, the child declines to visit with the caseworker outside the presence of the parent, foster parent, or facility staff; and\n(3) that the child has a specific developmental delay, physical limitation, incapacity, medical device, or significant medical need, such that the parent, foster parent, or facility staff is required to be present with the child during the visit.\nMS 2010 [Renumbered 260C.221]\nMS 2010 [Renumbered 260C.521, subd 4]\nMS 2010 [Renumbered 260C.203]\nMS 2010 [Renumbered 260C.227]\n[Repealed, 2008 c 361 art 6 s 59]\nThe commissioner of human services shall promulgate all rules necessary to carry out the provisions of Public Law 96-272 as regards the establishment of a state goal for the reduction of the number of children in residential facilities beyond 24 months.\nThe commissioner shall:\n(1) require that, as a condition of licensure, foster care providers attend training on understanding and validating the cultural heritage of all children in their care, and on the importance of the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923, and the Minnesota Indian Family Preservation Act, sections 260.751 to 260.835;\n(2) review and, where necessary, revise foster care rules to reflect sensitivity to cultural diversity and differing lifestyles. Specifically, the commissioner shall examine whether space and other requirements discriminate against single-parent, minority, or low-income families who may be able to provide quality foster care reflecting the values of their own respective cultures; and\n(3) relieve relative foster care providers of the requirements promulgated as a result of clauses (1) and (2) when the safety of the child is not jeopardized and as allowed under federal law.\nAny person whose claim for foster care payment pursuant to the placement of a child resulting from a child protection assessment under chapter 260E is denied or not acted upon with reasonable promptness may appeal the decision under section 142A.20, subdivision 3.\n(a) For purposes of this subdivision, \"missing child or youth\" means a child, as defined by section 260C.007, subdivision 4, who is under the legal custody of a responsible social services agency, as defined by section 260C.007, subdivision 22, and is absent from the foster care setting, including family foster home, residential facility or independent living setting, or home of the parent or guardian during a trial home visit, and cannot be located.\n(b) The responsible social services agency shall develop protocols to expeditiously locate any missing child or youth.\n(c) When the responsible social services agency learns that a child or youth is missing, the agency staff must immediately, but no later than 24 hours after receiving information:\n(1) report to the local law enforcement agency for entry into the National Crime Information Center (NCIC) database of the Federal Bureau of Investigation and to the National Center for Missing and Exploited Children and document having made this report. When making a report to local law enforcement and the National Center for Missing and Exploited Children, the agency must include, when reasonably possible:\n(i) a photo of the child or youth;\n(ii) a description of the child's or youth's physical features, such as height, weight, sex, ethnicity, race, hair color, and eye color; and\n(iii) endangerment information, such as the child's or youth's pregnancy status, prescriptions, medications, suicidal tendencies, vulnerability to being trafficked, and other health or risk factors; and\n(2) notify the court, parties to the case, parents and relatives who are not parties as the agency deems appropriate, and any Tribe who has legal responsibility or received notice under section 260.761, subdivision 2, but has not yet determined enrollment or eligibility status.\n(d) While the child or youth is missing, the responsible social services agency must:\n(1) implement protocols to expeditiously locate the child or youth;\n(2) maintain regular communication with law enforcement agencies and the National Center for Missing and Exploited Children in efforts to provide a safe recovery of the missing child or youth and document this communication;\n(3) share information pertaining to the child or youth's recovery, and circumstances related to recovery, with law enforcement agencies and the National Center for Missing and Exploited Children; and\n(4) not discharge a child or youth from foster care or close the social services case until diligent efforts have been exhausted to locate the child or youth and the court terminates the agency's jurisdiction.\n(e) When the child or youth is located, the responsible social services agency must:\n(1) notify all individuals and agencies that require notification in paragraph (c) of the child or youth's return;\n(2) interview the child or youth to determine and document, on a form approved by the commissioner of children, youth, and families, what the child or youth experienced while missing and the primary factors that contributed to the child's or youth's absence from care;\n(3) to the extent possible and appropriate, respond to the primary contributing factors in current and subsequent placements;\n(4) screen the child's or youth's reported experience to identify if the child or youth is a possible victim of human trafficking, as defined in section 260C.007, subdivision 34; and\n(5) if the child or youth is identified to have been a victim of human trafficking, report immediately, but no later than 24 hours, to local law enforcement.\n(f) With respect to any child or youth for whom the responsible social services agency has responsibility for placement, care, or supervision, the responsible social services agency shall:\n(1) identify and document any reasonable cause to believe that the child or youth is a human trafficking victim as defined in section 260C.007, subdivision 34, or a youth at risk of sex trafficking or commercial sexual exploitation as defined by the commissioner of children, youth, and families; and\n(2) provide access to appropriate services, which may include services under Safe Harbor, as described in section 145.4716, amending the child's or youth's out-of-home placement plan in subdivision 1, as necessary.\n[See Note.]\n(a) Responsible social services agencies and licensed child-placing agencies shall support a foster child's emotional and developmental growth by permitting the child to participate in activities or events that are generally accepted as suitable for children of the same chronological age or are developmentally appropriate for the child. \"Developmentally appropriate\" means based on a child's cognitive, emotional, physical, and behavioral capacities that are typical for an age or age group. Foster parents and residential facility staff are permitted to allow foster children to participate in extracurricular, social, or cultural activities that are typical for the child's age by applying reasonable and prudent parenting standards.\n(b) \"Reasonable and prudent parenting\" means the standards characterized by careful and sensible parenting decisions that maintain the child's health and safety, cultural, religious, and tribal values, and best interests while encouraging the child's emotional and developmental growth.\n(c) The commissioner shall provide guidance about the childhood activities and factors a foster parent and authorized residential facility staff must consider when applying the reasonable and prudent parenting standards. The factors must include the:\n(1) child's age, maturity, and developmental level;\n(2) risk of activity;\n(3) best interests of the child;\n(4) importance of the experience in the child's emotional and developmental growth;\n(5) importance of a family-like experience;\n(6) behavioral history of the child; and\n(7) wishes of the child's parent or legal guardian, as appropriate.\n(d) A residential facility licensed under Minnesota Rules, chapter 2960, must have at least one onsite staff person who is trained on the standards according to section 260C.215, subdivision 4, and authorized to apply the reasonable and prudent parenting standards to decisions involving the approval of a foster child's participation in age and developmentally appropriate extracurricular, social, or cultural activities. The onsite staff person referenced in this paragraph is not required to be available 24 hours per day.\n(e) The foster parent or designated staff at residential facilities demonstrating compliance with the reasonable and prudent parenting standards shall not incur civil liability if a foster child is harmed or injured because of participating in approved extracurricular, enrichment, cultural, and social activities.\n(a) The responsible social services agency must complete each child's social and medical history using forms developed by the commissioner. The responsible social services agency must work with each child's birth family, foster family, medical and treatment providers, and school to ensure that there is a detailed and up-to-date social and medical history of the child on forms provided by the commissioner.\n(b) If the child continues to be in placement out of the home of the parent or guardian from whom the child was removed, reasonable efforts by the responsible social services agency to complete the child's social and medical history must begin no later than the child's permanency progress review hearing required under section 260C.204 or six months after the child's placement in foster care, whichever occurs earlier.\n(c) In a child's social and medical history, the responsible social services agency must include background information and health history specific to the child, the child's birth parents, and the child's other birth relatives. Applicable background and health information about the child includes the child's current health condition, behavior, and demeanor; placement history; education history; sibling information; and birth, medical, dental, and immunization information. Redacted copies of pertinent records, assessments, and evaluations must be attached to the child's social and medical history. Applicable background information about the child's birth parents and other birth relatives includes general background information; education and employment history; physical health and mental health history; and reasons for the child's placement.",
	"repealed": false
}