{
	"id": "60C.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/60C.09",
	"title": "60C.09 COVERED CLAIMS.",
	"text": "A covered claim is any unpaid claim, including one for unearned premium, which:\n(a) arises out of and is within the coverage of an insurance policy issued by a member insurer if the insurer becomes an insolvent insurer after April 30, 1979;\n(b) arises out of a class of business which is not excepted from the scope of this chapter by section 60C.02; and\n(c) is made by:\n(i) a policyholder, or an insured beneficiary under a policy, who, at the time of the insured event, was a resident of this state; or\n(ii) a person designated in the policy as having an insurable interest in or related to property situated in this state at the time of the insured event; or\n(iii) an obligee or creditor under any surety bond, who, at the time of default by the principal debtor or obligor, was a resident of this state; or\n(iv) a third-party claimant under a liability policy or surety bond, if: (a) the insured or the third-party claimant was a resident of this state at the time of the insured event; (b) the claim is for bodily or personal injuries suffered in this state by a person who when injured was a resident of this state; or (c) the claim is for damages to real property situated in this state at the time of damage; or\n(v) an assignee of a person who except for the assignment might have claimed under item (i), (ii), or (iii).\nFor purposes of paragraph (c), item (ii), unit owners of units in a common interest community are considered as having an insurable interest.\nA covered claim also includes any unpaid claim which arises or exists within 30 days after the time of entry of a final order of liquidation with a finding of insolvency by a court of competent jurisdiction unless prior thereto the insured replaces the policy or causes its cancellation or the policy expires on its expiration date. A covered claim does not include claims filed with the guaranty fund after the final date set by the court for the filing of claims except for workers' compensation claims that have met the time limitations and other requirements of chapter 176.\nIn addition to subdivision 1, a covered claim does not include:\n(1) claims by an affiliate of the insurer;\n(2) claims due a reinsurer, insurer, insurance pool, or underwriting association, as subrogation recoveries, reinsurance recoveries, contribution, indemnification, or otherwise. This clause does not prevent a person from presenting the excluded claim to the insolvent insurer or its liquidator, but the claims shall not be asserted against another person, including the person to whom the benefits were paid or the insured of the insolvent insurer, except to the extent that the claim is outside the coverage of the policy issued by the insolvent insurer; and\n(3) any claims, resulting from insolvencies which occur after July 31, 1996, by an insured whose net worth exceeds $25,000,000 on December 31 of the year prior to the year in which the insurer becomes an insolvent insurer; provided that an insured's net worth on that date shall be deemed to include the aggregate net worth of the insured and all of its subsidiaries and affiliates as calculated on a consolidated basis;\n(4) any claims under a policy written by an insolvent insurer with a deductible or self-insured retention of $300,000 or more, nor that portion of a claim that is within an insured's deductible or self-insured retention;\n(5) claims that are a fine, penalty, interest, or punitive or exemplary damages.\nPayment of a covered claim, whether upon a single policy or multiple policies of insurance, is limited to no more than $300,000. In the case of claim for unearned premium by a single claimant, the entire claim up to $300,000 shall be allowed excluding retrospective or experience-rated insurance plans or premiums subject to adjustment after termination of the policy. The limitation on the amount of payment for a covered claim does not apply to claims for workers' compensation insurance. In no event is the association obligated to the policyholder or claimant in an amount in excess of the obligation of the insurer under the policy from which the claim arises. For insolvencies occurring on or after October 1, 1985, no deductible applies to claims eligible for payment under the assigned claims plan under sections 65B.63 to 65B.65.\nExcept in the case of a claim for benefits under workers' compensation coverage, any obligation of the association to or on behalf of an insured and its affiliates on covered claims ceases when $10,000,000 has been paid in the aggregate by the association and any one or more associations similar to the association of any other state or states, to or on behalf of that insured, its affiliates, and additional insureds on covered claims or allowed claims arising under the policy or policies of any one insolvent insurer.",
	"repealed": false
}