{
	"id": "268.194",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.194",
	"title": "268.194 UNEMPLOYMENT INSURANCE TRUST FUND.",
	"text": "There is established as a special state trust fund, separate and apart from all other public money or funds of this state, an unemployment insurance trust fund, that is administered by the commissioner exclusively for the payment of unemployment benefits. This trust fund consists of:\n(1) all taxes collected;\n(2) interest earned upon any money in the trust fund;\n(3) reimbursements paid by nonprofit organizations, and the state and political subdivisions;\n(4) tax rate buydown payments under section 268.051, subdivision 7;\n(5) money received as a loan from the federal unemployment trust fund in accordance with United States Code, title 42, section 1321, of the Social Security Act;\n(6) money received under a combined wage arrangement with the federal government or any other state;\n(7) money received from the federal government for unemployment benefits paid under a federal program;\n(8) money recovered on overpaid unemployment benefits;\n(9) all money credited to the account under this chapter;\n(10) all money credited to the account of Minnesota in the federal unemployment trust fund under United States Code, title 42, section 1103, of the Social Security Act, also known as the Reed Act; and\n(11) all money received for the trust fund from any other source.\n(a) The commissioner of management and budget is the treasurer and custodian of the trust fund, and must administer the trust fund in accordance with the directions of the commissioner. The commissioner of management and budget must maintain within the trust fund three separate accounts:\n(1) a clearing account;\n(2) an unemployment trust fund account; and\n(3) an unemployment benefit payment account.\nAll money payable to the trust fund, upon receipt by the commissioner, must be forwarded to the commissioner of management and budget who must immediately deposit the money in the clearing account. All money in the clearing account, after clearance, must be deposited to the credit of Minnesota's account in the federal unemployment trust fund. Tax refunds payable under section 268.057 may be paid from the clearing account or the unemployment benefit payment account.\n(b) The unemployment benefit payment account consists of all money requisitioned from Minnesota's account in the federal unemployment trust fund for the payment of unemployment benefits. Money in the clearing and unemployment benefit payment accounts may be deposited by the commissioner of management and budget, under the direction of the commissioner, in any depository bank that general funds of Minnesota may be deposited, but no public deposit insurance charge or premium may be paid out of the trust fund. Money in the clearing and unemployment benefit payment accounts must be maintained in separate accounts on the books of the depository bank. This money must be secured by the depository bank to the same extent and in the same manner as required by the general depository law of Minnesota.\n(a) Money requisitioned from Minnesota's account in the federal unemployment trust fund must be used exclusively for the payment of unemployment benefits and for tax refunds under section 268.057, except that money credited to Minnesota's account under United States Code, title 42, section 1103 of the Social Security Act, also known as the Reed Act, may be used for the payment of expenses of administration. The commissioner may requisition from the federal unemployment trust fund the amounts necessary for the payment of unemployment benefits and tax refunds for a reasonable future period. Upon receipt the commissioner of management and budget must deposit the money in the unemployment benefit payment account.\n(b) Expenditures of money in the unemployment benefit payment account and tax refunds from the clearing account are not subject to any provisions of law requiring specific appropriations or other formal release by state officers.\n[Renumbered subd 4]\nThe commissioner is authorized to make to other state or federal agencies and to receive from other state or federal agencies, reimbursements from or to the trust fund, in accordance with combined wage arrangements entered into under section 268.131.\nMoney received under a combined wage arrangement must be placed directly in the unemployment benefit payment account of the trust fund.\n(a) Money credited to the account of Minnesota in the federal unemployment trust fund under United States Code, title 42, section 1103, of the Social Security Act, also known as the Reed Act, may be requisitioned and used for (1) the payment of unemployment benefits, or (2) expenses incurred for the administration of the Minnesota unemployment insurance program according to a specific appropriation by the legislature. Any money used for the payment of unemployment benefits may be restored for appropriation and use for administrative expenses upon request of the governor to the United States Secretary of Labor.\n(b) Reed Act money may be used for expenses in the administration of the Minnesota unemployment insurance program provided that the expenses are incurred and the money is requisitioned after the enactment of an appropriation law that:\n(1) specifies the amounts and the purposes for which the money is appropriated;\n(2) limits the period within which the money may be obligated to a period ending not more than two years after the date of the enactment of the appropriation law; and\n(3) limits the amount that may be obligated to an amount that does not exceed the amount by which the aggregate of the amounts transferred to the account of Minnesota under the Reed Act exceeds the aggregate of the amounts used under this subdivision and charged against the amounts transferred to the account of Minnesota. For the purposes of this subdivision, amounts used for administration are chargeable against the transferred amounts at the time of the obligation.\n(c) Reed Act money requisitioned for the payment of expenses of administration remain a part of the trust fund. The commissioner must account for the use of this money in accordance with the standards established by the United States Secretary of Labor. If any money is not spent for the purpose for which it was appropriated, or, if it remains unspent at the end of the period specified by the law appropriating the money, it must be returned for credit to Minnesota's account in the federal unemployment trust fund.\n(a) The governor is authorized, if necessary, to borrow funds from the federal unemployment trust fund in accordance with United States Code, title 42, section 1321 of the Social Security Act in order to pay unemployment benefits.\n(b) Any amount transferred to the trust fund under the terms of any loan must be repayable as provided in United States Code, title 42, sections 1101(d)(1), 1103(b)(2), and 1322 of the Social Security Act.\n(c) Interest payable on any loan is paid in accordance with section 268.051, subdivision 8, paragraph (b).",
	"repealed": false
}