{
	"id": "253B.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.095",
	"title": "253B.095 RELEASE BEFORE COMMITMENT.",
	"text": "(a) After the hearing and before a commitment order has been issued, the court may release a proposed patient to the custody of an individual or agency upon conditions that guarantee the care and treatment of the patient.\n(b) A person against whom a criminal proceeding is pending may not be released.\n(c) A continuance for dismissal, with or without findings, may be granted for up to 90 days.\n(d) When the court stays an order for commitment for more than 14 days beyond the date of the initially scheduled hearing, the court shall issue an order that must include:\n(1) a written plan for services to which the proposed patient has agreed;\n(2) a finding that the proposed treatment is available and accessible to the patient and that public or private financial resources are available to pay for the proposed treatment;\n(3) conditions the patient must meet to avoid revocation of the stayed commitment order and imposition of the commitment order; and\n(4) a condition that the patient is prohibited from giving consent to participate in a clinical drug trial while the court order is in effect.\n(e) Notwithstanding paragraph (d), clause (4), during the period of a stay of commitment, the court may allow the patient to give consent to participate in a specific psychiatric clinical drug trial if the treating psychiatrist testifies or submits an affidavit that the patient may benefit from participating in the trial because, after providing other treatment options for a reasonable period of time, those options have been ineffective. The treating psychiatrist must not be the psychiatrist conducting the psychiatric clinical drug trial. The court must determine that, under the circumstances of the case, the patient is competent to choose to participate in the trial, that the patient is freely choosing to participate in the trial, that the compulsion of the stayed commitment is not being used to coerce the person to participate in the clinical trial, and that a reasonable person may choose to participate in the clinical trial.\n(f) A person receiving treatment under this section has all rights under this chapter.\nWhen a court releases a patient under this section, the court shall direct the case manager to report to the court at least once every 90 days and shall immediately report a substantial failure of a patient or provider to comply with the conditions of the release.\nThe maximum duration of a stayed order under this section is six months. The court may continue the order for a maximum of an additional 12 months if, after notice and hearing, under sections 253B.08 and 253B.09 the court finds that (1) the person continues to have a mental illness, developmental disability, or chemical dependency, and (2) an order is needed because the person is likely to attempt to physically harm self or others or fail to obtain necessary food, clothing, shelter, or medical care unless the person is under the supervision of a stayed commitment.\nAn order under this section may be modified upon agreement of the parties and approval of the court.\nThe court, on its own motion or upon the motion of any party that the patient has not complied with a material condition of release, and after notice and a hearing unless otherwise ordered by the court, may revoke any release and commit the proposed patient under this chapter.\n[Renumbered subd 4]\n[Renumbered subd 5]",
	"repealed": false
}