{
	"id": "473.325",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.325",
	"title": "473.325 SALES OF G.O. REFUNDING BONDS.",
	"text": "The Metropolitan Council may by resolution authorize the issuance of general obligation bonds of the council such that the amount outstanding and undischarged at any time shall not exceed $40,000,000, for which its full faith and credit and taxing powers shall be pledged, for the acquisition and betterment of regional recreation open space in accordance with sections 473.301 to 473.341. The Metropolitan Council may also issue general obligation bonds for the purpose of refunding outstanding obligations issued hereunder. The amount of refunding bonds that may be issued from time to time shall not be subject to the dollar limitation contained in this subdivision nor shall such refunding bonds be included in computing the amount of bonds that may be issued within such dollar limitation.\nThe Metropolitan Council shall sell and issue the bonds in the manner provided in chapter 475, and shall have the same powers and duties as a municipality issuing bonds under that law, except that the approval of a majority of the electors shall not be required and the net debt limitations shall not apply. The terms of each series of bonds shall be fixed so that the amount of principal and interest on all outstanding and undischarged bonds, together with the bonds proposed to be issued, due in any year shall not exceed 0.01209 percent of estimated market value of all taxable property in the metropolitan area as last finally equalized prior to a proposed issue. The bonds shall be secured in accordance with section 475.61, subdivision 1, and any taxes required for their payment shall be levied by the council, shall not affect the amount or rate of taxes which may be levied by the council for other purposes, shall be spread against all taxable property in the metropolitan area and shall not be subject to limitation as to rate or amount. Any taxes certified by the council to the county auditors for collection shall be reduced by the amount received by the council from the commissioner of management and budget or the federal government for the purpose of paying the principal and interest on bonds to which the levy relates. The council shall certify the fact and amount of all money so received to the county auditors, and the auditors shall reduce the levies previously made for the bonds in the manner and to the extent provided in section 475.61, subdivision 3.\nThe Metropolitan Council shall have the power, after the authorization of bonds pursuant to this section, to provide funds immediately required for the purposes of sections 473.301 to 473.341, by effecting temporary loans upon such terms as it shall by resolution determine, evidenced by notes due in not exceeding 24 months from the date thereof, payable to the order of the lender or to the bearer, to be repaid with interest from the proceeds of such bonds when issued and delivered to the purchaser thereof. Such temporary loans may be made without public advertisement.\nIn the event that the full faith and credit pledge of the Metropolitan Council for the payment of principal and interest on the bonds issued under this section is superseded and replaced by the full faith and credit pledge of the state of Minnesota, by binding and irrevocable legislation, such action shall extinguish the full faith and credit pledge theretofore made for all bonds and the interest thereon issued pursuant to this section.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]",
	"repealed": false
}