{
	"id": "48.512",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.512",
	"title": "48.512 PROCEDURES FOR OPENING CHECKING ACCOUNTS.",
	"text": "For the purpose of this section the following terms have the meanings given:\n(a) \"Financial intermediary\" means any person doing business in this state who offers transaction accounts to the public.\n(b) \"Transaction account\" means a deposit or account established and maintained by a natural person or persons under an individual or business name for personal, household, or business purposes, on which the depositor or account holder is permitted to make withdrawals by negotiable or transferable instruments, payment orders of withdrawal, or other similar device for the purpose of making payments or transfers to third persons or others, including demand deposits or accounts subject to check, draft, negotiable order of withdrawal, share draft, or other similar item. A transaction account does not include the deposit or account of a partnership having more than three partners, the personal representative of an estate, the trustee of a trust or a limited partnership.\nBefore opening or authorizing signatory power over a transaction account, a financial intermediary shall require one applicant to provide the following information on an application document signed by the applicant:\n(a) full name;\n(b) birth date;\n(c) address of residence;\n(d) address of current employment, if employed;\n(e) telephone numbers of residence and place of employment, if any;\n(f) Social Security number;\n(g) driver's license or identification card number issued pursuant to section 171.07. If the applicant does not have a driver's license or identification card, the applicant may provide an identification document number issued for identification purposes by any state, federal, or foreign government if the document includes the applicant's photograph, full name, birth date, and signature;\n(h) whether the applicant has had a transaction account at the same or another financial intermediary within 12 months immediately preceding the application, and if so, the name of the financial intermediary;\n(i) whether the applicant has had a transaction account closed by a financial intermediary without the applicant's consent within 12 months immediately preceding the application, and if so, the reason the account was closed; and\n(j) whether the applicant has been convicted of a criminal offense because of the use of a check or other similar item within 24 months immediately preceding the application.\nA financial intermediary may require an applicant to disclose additional information.\nAn applicant who makes a false material statement that the applicant does not believe to be true in an application document with respect to information required to be provided by this subdivision is guilty of perjury. The financial intermediary shall notify the applicant of the provisions of this paragraph.\n(a) Before opening or authorizing signatory power over a transaction account, the financial intermediary shall attempt to verify the information disclosed for subdivision 2, clause (i). Inquiries made to verify this information through persons in the business of providing such information must include an inquiry based on the applicant's identification number provided under subdivision 2, clause (g).\n(b) The financial intermediary may not open or authorize signatory power over a transaction account if (i) the applicant had a transaction account closed by a financial intermediary without consent because of issuance by the applicant of dishonored checks within 12 months immediately preceding the application, or (ii) the applicant has been convicted of a criminal offense because of the use of a check or other similar item within 24 months immediately preceding the application. This paragraph does not apply to programs designed to expand access to financial services to individuals who do not possess a transaction account.\n(c) If the transaction account is refused pursuant to this subdivision, the reasons for the refusal shall be given to the applicant in writing and the applicant shall be allowed to provide additional information.\nA financial intermediary shall not open or authorize signatory power over a transaction account if none of the applicants provides a driver's license, identification card, or identification document as required by subdivision 2. If the applicant provides a driver's license or identification card issued under section 171.07, the financial intermediary must confirm the identification number and name on that card through the records of the department of public safety. The financial intermediary need not confirm this information if the checking account applicant presents a driver's license impervious to alteration as is reasonably practicable in the design and quality of material and technology. The financial intermediary need not confirm this information if an employee of the financial intermediary has known the identity of the applicant for at least one year prior to the time of the application, and the employee provides a signed statement confirming that fact. When a minor is the applicant and the minor does not have a driver's license or identification card issued pursuant to section 171.07, the identification requirements of subdivision 2, clause (g), and this subdivision are satisfied if the minor's parent or guardian provides identification of that person's own that meets the identification requirement. The financial intermediary may waive the identification requirement if the applicant has had another type of account with the financial intermediary for at least one year immediately preceding the time of application.\nThe identification requirements of subdivision 4 do not apply to a transaction account that is accessible exclusively by debit card. A debit card activates a transaction account at a financial intermediary by means of an electronic information processing device and contemporaneously completes the debt to the account only on the condition that funds are available and confirmed.\nThe requirements of this section do not impose any liability on financial intermediaries offering transaction accounts or, except as provided in subdivisions 3 and 4, limit a financial intermediary's discretion as to whether to grant or deny an application subject to this section. This subdivision does not exempt a financial intermediary from civil penalties imposed under section 45.027.\n[Repealed, 1995 c 202 art 4 s 25]\n(a) The establishment of transaction account service charges and the amounts of the charges not otherwise limited or prescribed by law or rule is a business decision to be made by each financial intermediary according to sound business judgment and safe, sound financial institution operational standards. In establishing transaction account service charges, the financial intermediary may consider, but is not limited to considering:\n(1) costs incurred by the institution, plus a profit margin, in providing the service;\n(2) the deterrence of misuse by customers of financial institution services;\n(3) the establishment of the competitive position of the financial institution in accordance with the institution's marketing strategy; and\n(4) maintenance of the safety and soundness of the institution.\n(b) Transaction account service charges must be reasonable in relation to these considerations and should be arrived at by each financial intermediary on a competitive basis and not on the basis of any agreement, arrangement, undertaking, or discussion with other financial intermediaries or their officers.\n(c) A financial intermediary may not impose a service charge in excess of $10 for a dishonored check on any person other than the issuer of the check.\nA person providing printed checks for a transaction account shall print the month and year that the original order was received or the month and year that appears on the facsimile of the check from which the new checks are produced, unless the applicant has an existing account in good standing or a previous account in good standing within the past five years that was voluntarily closed. This subdivision no longer applies after the account has been open and in good standing for one year.\nThe commissioner of commerce may exercise the powers authorized under section 45.027 if the commissioner has reason to believe that a financial intermediary or drawer has failed to:\n(1) comply with the verification requirements of subdivision 2, 3, or 4; or\n(2) release information as required under section 609.535, subdivision 7.\nIn lieu of the identification rules in subdivision 2, a financial intermediary may choose to comply with the federal customer identification standards set forth in United States Code, title 31, section 5318, and its implementing regulation, Code of Federal Regulations, title 31, section 103.121, as amended from time to time.",
	"repealed": false
}