{
	"id": "162.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.081",
	"title": "162.081 TOWN ROAD ACCOUNT.",
	"text": "A town road account is created in the county state-aid highway fund.\nFunds in the town road account must be apportioned to each county so that each county receives the percentage that the total miles of town road in the county bears to the total miles of town roads in the state.\nUpon determining the amount of money to be apportioned to each county under section 162.07, the commissioner shall also determine the amounts in the town road account to be apportioned under subdivision 2. The apportionment under subdivision 2 must be included in the statement sent to the commissioner of management and budget and the county auditor and county engineer of each county under section 162.08, subdivision 2. The amounts so apportioned and allocated to each county from the town road account must be paid by the state to the treasurer of each county at the same time that payments are made under section 162.08, subdivision 2, provided that the amounts must be paid in a sufficient time to allow the county to distribute the amounts to each town by March 1, annually.\n(a) Money apportioned to a county from the town road account must be distributed to the treasurer of each town within the county, according to a distribution formula adopted by the county board. The formula must take into account each town's population and town road mileage, and other factors the county board deems advisable in the interests of achieving equity among the towns. Distribution of town road funds to each town treasurer must be made by March 1, annually, or within 30 days after receipt of payment from the commissioner. Distribution of funds to town treasurers in a county which has not adopted a distribution formula under this subdivision must be made according to a formula prescribed by the commissioner by rule.\n(b) Money distributed to a town under this subdivision may be expended by the town only for the construction, reconstruction, and gravel maintenance of town roads within the town, including debt service for bonds issued by the town in accordance with chapter 475, provided that the bonds are issued for a use allowable under this paragraph.",
	"repealed": false
}