{
	"id": "16A.642",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.642",
	"title": "16A.642 STATE BONDS: REPORTS; CANCELLATIONS.",
	"text": "(a) The commissioner of management and budget shall report to the chairs of the senate Committee on Finance and the house of representatives Committees on Ways and Means and Capital Investment by February 1 of each year on the following:\n(1) all laws authorizing the issuance of state bonds, bonds supported by a state appropriation, or appropriating general fund money for state or local government capital investment projects enacted more than four years before January 1 of that year; the projects authorized to be acquired and constructed for which less than 100 percent of the authorized total cost has been expended, encumbered, or otherwise obligated; the cost of contracts to be let in accordance with existing plans and specifications shall be considered expended for this report; and the amount of general fund money appropriated but not spent or otherwise obligated, and the amount of bonds not issued and bond proceeds held but not previously expended, encumbered, or otherwise obligated for these projects; and\n(2) all laws authorizing the issuance of state bonds, bonds supported by a state appropriation, or appropriating general fund money for state or local government capital programs or projects other than those described in clause (1), enacted more than four years before January 1 of that year; and the amount of general fund money appropriated but not spent or otherwise obligated, and the amount of bonds not issued and bond proceeds held but not previously expended, encumbered, or otherwise obligated for these programs and projects.\n(b) The commissioner shall also report on general fund appropriations for capital projects, bond authorizations or bond proceed balances that may be canceled because projects have been canceled, completed, or otherwise concluded, or because the purposes for which the money was appropriated or bonds were authorized or issued have been canceled, completed, or otherwise concluded. The general fund appropriations, bond authorizations or bond proceed balances that are unencumbered or otherwise not obligated that are reported by the commissioner under this subdivision are canceled, effective July 1 of the year of the report, unless specifically reauthorized by act of the legislature.\n(c) The reports required by this subdivision shall only contain bond authorizations supported by a state appropriation and their associated general fund appropriations for projects authorized or amended after December 31, 2013.\n(a) If the commissioner determines that the purposes for which general obligation bonds of the state or bonds supported by a state appropriation have been issued or for which general fund monies were appropriated are accomplished or abandoned, after consultation with the affected agencies, and there is a remaining authorization or appropriation for a specific project of $500 or less, the commissioner may cancel the remaining authorization or appropriation for that project. Bonds supported by a state appropriation shall only be canceled if they were authorized or amended after December 31, 2013.\n(b) If a premium received on the sale of bonds is credited to the bond proceeds fund, pursuant to section 16A.641, subdivision 7, paragraph (b), the corresponding bond authorization to which the premium is attributable must be reduced accordingly by the commissioner.\n(c) The commissioner must notify the chairs of the senate Finance Committee and the house of representatives Capital Investment Committee of any bond authorizations, including bond authorizations supported by a state appropriation, or general fund appropriations canceled under this subdivision.\nAll canceled bond proceeds shall be transferred to the state bond fund and used to pay or redeem bonds from which they were derived.\nAll canceled general fund appropriations for capital improvement projects under this section are canceled to the general fund.",
	"repealed": false
}