{
	"id": "67A.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/67A.231",
	"title": "67A.231 DEPOSIT OF FUNDS; INVESTMENT; LIMITATIONS.",
	"text": "The directors of any township mutual insurance company may authorize the treasurer to invest any of its funds and accumulations in:\n(a) Bonds, notes, mortgages, or other obligations guaranteed by the full faith and credit of the United States of America and those for which the credit of the United States is pledged to pay principal, interest or dividends, including United States agency and instrumentality bonds, debentures, or obligations;\n(b) Bonds, notes, evidence of indebtedness, or other public authority obligations guaranteed by this state;\n(c) Bonds, notes, evidence of the indebtedness or other obligations guaranteed by the full faith and credit of any county, municipality, school district, or other duly authorized political subdivision of this state;\n(d) Bonds or other interest bearing obligations, payable from revenues, provided that the bonds or other interest bearing obligations are at the time of purchase rated among the highest four quality categories used by a nationally recognized rating agency for rating the quality of similar bonds or other interest bearing obligations, and are not rated lower by any other such agency; or obligations of a United States agency or instrumentality that have been rated in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners. A company may not invest more than 20 percent of its admitted assets in the obligations of any one corporation. This is not applicable to bonds or other interest bearing obligations in default as to principal;\n(e) Investments in the obligations stated in paragraphs (a), (b), (c), and (d), may be made either directly or in the form of securities of, or other interests in, an investment company registered under the federal Investment Company Act of 1940. Investment company shares authorized pursuant to this subdivision shall not exceed 20 percent of the company's surplus. These obligations must be carried at the lower of cost or market on the annual statement filed with the commissioner and adjusted to market on an annual basis;\n(f) Loans upon improved and unencumbered real property in this state worth at least twice the amount loaned thereon, not including buildings, unless insured by property insurance policies payable to and held by the security holder;\n(g) Real estate, including land, buildings and fixtures, located in this state and used primarily as home office space for the insurance company;\n(h) Demand or time deposits or savings accounts in federally insured depositories located in any state to the extent that the deposit or investment is insured by the Federal Deposit Insurance Corporation or the National Credit Union Administration. An additional deposit not to exceed 50 percent of the township mutual insurance company's policyholder surplus may be located in these depositories if covered by private deposit insurance written by an insurer licensed by the Department of Commerce;\n(i) Guarantee fund certificates of a mutual insurer which reinsures the business of the township mutual insurance company. The commissioner may by rule limit the amount of guarantee fund certificates which the township mutual insurance company may purchase and this limit may be a function of the size of the township mutual insurance company;\n(j) Up to $1,500 in stock of an insurer which issues directors and officers liability insurance to township mutual insurance company directors and officers;\n(k) Up to $10,000 in shares of stock of the National Association of Mutual Insurance Companies bank, subject to the commissioner's approval; and\n(l) Overnight repurchase agreements with the depository that handles the company's primary accounts under paragraph (h). The repurchase agreements must be collateralized by securities that the company is otherwise authorized to invest in under this section. The securities must have an aggregate market value of at least 105 percent of the total amount invested under the repurchase agreement.",
	"repealed": false
}