{
	"id": "169.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.55",
	"title": "169.55 LIGHTS ON ALL VEHICLES.",
	"text": "At the times when lighted lamps on vehicles are required each vehicle including an animal-drawn vehicle and any vehicle specifically excepted in sections 169.47 to 169.79, with respect to equipment and not previously required to be equipped with lamps, must be equipped with one or more lighted lamps or lanterns projecting a white light visible from a distance of 500 feet to the front of the vehicle and with a lamp or lantern exhibiting a red light visible from a distance of 500 feet to the rear, except that reflectors meeting the maximum requirements of this chapter may be used in lieu of the lights required in this subdivision.\n(a) At the times when lighted lamps on vehicles are required:\n(1) every self-propelled implement of husbandry must be equipped with at least one lamp displaying a white light to the front, and at least one lamp displaying a red light to the rear;\n(2) every self-propelled implement of husbandry must also display two red reflectors visible to the rear;\n(3) every combination of a self-propelled and towed implement of husbandry must be equipped with at least one lamp mounted to indicate as nearly as practicable the extreme left projection of the combination and displaying a white or amber light to the front and a red or amber light to the rear of the self-propelled implement of husbandry; and\n(4) the last unit of every combination of implements of husbandry must display two red reflectors visible to the rear.\n(b) The reflectors must be of the type approved for use upon commercial vehicles. The reflectors must be mounted as close as practicable to the extreme edges of the implement of husbandry. The reflectors must be reflex reflectors that are visible at night from all distances within 600 feet to 100 feet when directly in front of lawful lower beams of headlamps.\nNo person may operate a self-propelled implement of husbandry manufactured after January 1, 1970, on a highway unless the implement of husbandry displays vehicular hazard warning lights visible to the front and rear in normal sunlight.",
	"repealed": false
}