{
	"id": "177.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.24",
	"title": "177.24 PAYMENT OF MINIMUM WAGES.",
	"text": "(a) Except as otherwise provided in sections 177.21 to 177.35, every employer must pay each employee wages at a rate of at least:\n(1) $8.00 per hour beginning August 1, 2014;\n(2) $9.00 per hour beginning August 1, 2015;\n(3) $9.50 per hour beginning August 1, 2016; and\n(4) the rate established under paragraph (c) beginning January 1, 2018.\n(b) Notwithstanding paragraph (a), during the first 90 consecutive days of employment, an employer may pay an employee under the age of 20 years a wage of at least:\n(1) $6.50 per hour beginning August 1, 2014;\n(2) $7.25 per hour beginning August 1, 2015;\n(3) $7.75 per hour beginning August 1, 2016; and\n(4) the rate established under paragraph (c) beginning January 1, 2018.\nNo employer may take any action to displace an employee, including a partial displacement through a reduction in hours, wages, or employment benefits, in order to hire an employee at the wage authorized in this paragraph.\n(c) No later than August 31 of each year, the commissioner shall determine the percentage increase in the rate of inflation, as measured by the implicit price deflator, national data for personal consumption expenditures as determined by the United States Department of Commerce, Bureau of Economic Analysis during the 12-month period immediately preceding that August or, if that data is unavailable, during the most recent 12-month period for which data is available. The minimum wage rates in paragraphs (a) and (b) are increased by the lesser of: (1) five percent, rounded to the nearest cent; or (2) the percentage calculated by the commissioner, rounded to the nearest cent. A minimum wage rate shall not be reduced under this paragraph. The new minimum wage rates determined under this paragraph take effect on the next January 1.\n[Expired]\nNo employer may directly or indirectly credit, apply, or utilize gratuities towards payment of the minimum wage set by this section or federal law.\nFor purposes of this chapter, any gratuity received by an employee or deposited in or about a place of business for personal services rendered by an employee is the sole property of the employee. No employer may require an employee to contribute or share a gratuity received by the employee with the employer or other employees or to contribute any or all of the gratuity to a fund or pool operated for the benefit of the employer or employees. This section does not prevent an employee from voluntarily sharing gratuities with other employees. The agreement to share gratuities must be made by the employees without employer coercion or participation, except that an employer may:\n(1) upon the request of employees, safeguard gratuities to be shared by employees and disburse shared gratuities to employees participating in the agreement;\n(2) report the amounts received as required for tax purposes; and\n(3) post a copy of this section for the information of employees.\nThe commissioner may require the employer to pay restitution in the amount of the gratuities diverted. If the records maintained by the employer do not provide sufficient information to determine the exact amount of gratuities diverted, the commissioner may make a determination of gratuities diverted based on available evidence and mediate a settlement with the employer.\n(a) Gratuities received by an employee through a debit, charge, credit card, or electronic payment shall be credited to that pay period in which they are received by the employee.\n(b) Where a gratuity is received by an employee through a debit, charge, credit card, or electronic payment, the full amount of gratuity indicated in the payment must be distributed to the employee no later than the next scheduled pay period.\nDeductions, direct or indirect, from wages or gratuities not authorized by this subdivision may only be taken as authorized by sections 177.28, subdivision 3, 181.06, and 181.79. Deductions, direct or indirect, for up to the full cost of the uniform or equipment as listed below, may not exceed $50 or, if a motor vehicle dealer licensed under section 168.27 furnishes uniforms or clothing described in clause (1) on an ongoing basis, may not exceed the lesser of 50 percent of the dealer's reasonable expense or $25 per month, including nonhome maintenance. No deductions, direct or indirect, may be made for the items listed below which when subtracted from wages would reduce the wages below the minimum wage:\n(1) purchased or rented uniforms or specially designed clothing required by the employer, by the nature of the employment, or by statute as a condition of employment, which is not generally appropriate for use except in that employment;\n(2) purchased or rented equipment used in employment, except tools of a trade, a motor vehicle, or any other equipment which may be used outside the employment;\n(3) consumable supplies required in the course of that employment;\n(4) travel expenses in the course of employment except those incurred in traveling to and from the employee's residence and place of employment.\nAn employer, at the termination of an employee's employment, must reimburse the full amount deducted, directly or indirectly, for any of the items listed in subdivision 4, except for a motor vehicle dealer's rental and maintenance deduction for uniforms or clothing. When reimbursement is made, the employer may require the employee to surrender any existing items for which the employer provided reimbursement.",
	"repealed": false
}