{
	"id": "518.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.17",
	"title": "518.17 CUSTODY AND SUPPORT OF CHILDREN ON JUDGMENT.",
	"text": "(a) In evaluating the best interests of the child for purposes of determining issues of custody and parenting time, the court must consider and evaluate all relevant factors, including:\n(1) a child's physical, emotional, cultural, spiritual, and other needs, and the effect of the proposed arrangements on the child's needs and development;\n(2) any special medical, mental health, developmental disability, or educational needs that the child may have that may require special parenting arrangements or access to recommended services;\n(3) the reasonable preference of the child, if the court deems the child to be of sufficient ability, age, and maturity to express an independent, reliable preference;\n(4) whether domestic abuse, as defined in section 518B.01, has occurred in the parents' or either parent's household or relationship; the nature and context of the domestic abuse; and the implications of the domestic abuse for parenting and for the child's safety, well-being, and developmental needs;\n(5) any physical, mental, or chemical health issue of a parent that affects the child's safety or developmental needs;\n(6) the history and nature of each parent's participation in providing care for the child;\n(7) the willingness and ability of each parent to provide ongoing care for the child; to meet the child's ongoing developmental, emotional, spiritual, and cultural needs; and to maintain consistency and follow through with parenting time;\n(8) the effect on the child's well-being and development of changes to home, school, and community;\n(9) the effect of the proposed arrangements on the ongoing relationships between the child and each parent, siblings, and other significant persons in the child's life;\n(10) the benefit to the child in maximizing parenting time with both parents and the detriment to the child in limiting parenting time with either parent;\n(11) except in cases in which domestic abuse as described in clause (4) has occurred, the disposition of each parent to support the child's relationship with the other parent and to encourage and permit frequent and continuing contact between the child and the other parent; and\n(12) the willingness and ability of parents to cooperate in the rearing of their child; to maximize sharing information and minimize exposure of the child to parental conflict; and to utilize methods for resolving disputes regarding any major decision concerning the life of the child.\n(b) Clauses (1) to (9) govern the application of the best interests of the child factors by the court:\n(1) The court must make detailed findings on each of the factors in paragraph (a) based on the evidence presented and explain how each factor led to its conclusions and to the determination of custody and parenting time. The court may not use one factor to the exclusion of all others, and the court shall consider that the factors may be interrelated.\n(2) The court shall consider that it is in the best interests of the child to promote the child's healthy growth and development through safe, stable, nurturing relationships between a child and both parents. In determining custody, the court must consider the best interests of the child and must not prefer one parent over the other solely on the basis of the gender of the parent.\n(3) The court shall consider both parents as having the capacity to develop and sustain nurturing relationships with their children unless there are substantial reasons to believe otherwise. In assessing whether parents are capable of sustaining nurturing relationships with their children, the court shall recognize that there are many ways that parents can respond to a child's needs with sensitivity and provide the child love and guidance, and these may differ between parents and among cultures.\n(4) The court shall not consider conduct of a party that does not affect the party's relationship with the child.\n(5) Disability alone, as defined in section 363A.03, of a proposed custodian or the child shall not be determinative of the custody of the child.\n(6) The court shall consider evidence of a violation of section 609.507 in determining the best interests of the child.\n(7) There is no presumption for or against joint physical custody, except as provided in clause (9).\n(8) Joint physical custody does not require an absolutely equal division of time.\n(9) The court shall use a rebuttable presumption that upon request of either or both parties, joint legal custody is in the best interests of the child. However, the court shall use a rebuttable presumption that joint legal custody or joint physical custody is not in the best interests of the child if domestic abuse, as defined in section 518B.01, has occurred between the parents. In determining whether the presumption is rebutted, the court shall consider the nature and context of the domestic abuse and the implications of the domestic abuse for parenting and for the child's safety, well-being, and developmental needs. Disagreement alone over whether to grant sole or joint custody does not constitute an inability of parents to cooperate in the rearing of their children as referenced in paragraph (a), clause (12).\n(c) In a proceeding involving the custodial responsibility of a service member's child, a court may not consider only a parent's past deployment or possible future deployment in determining the best interests of the child. For purposes of this paragraph, \"custodial responsibility\" has the meaning given in section 518E.102, paragraph (f).\n[Repealed, 2015 c 30 art 1 s 13]\n[Repealed, 2015 c 30 art 1 s 13]\n(a) A court shall not deny nor restrict a parent's parenting time or custody due to the parent's disability. A party raising disability as a basis for denying or restricting parenting time has the burden to prove by clear and convincing evidence that a parent's specific behaviors during parenting time would endanger the health or safety of the child. If the party meets the burden, a parent with a disability shall have the opportunity to demonstrate how implementing supportive services can alleviate any concerns. The court may require a parent with a disability to use supportive parenting services to facilitate parenting time.\n(b) If a court denies or limits the right of a parent with a disability to custody of a child or visitation with a child, the court shall make specific written findings stating the basis for the denial or limitation and why providing supportive parenting services is not a reasonable accommodation that could prevent denying or limiting the parent's custody or parenting time.\n(c) For purposes of this subdivision, \"disability\" and \"supportive parenting services\" have the meanings given in section 260C.141, subdivision 1a.\n(a) Upon adjudging the nullity of a marriage, or in a dissolution or separation proceeding, or in a child custody proceeding, the court shall make such further order as it deems just and proper concerning:\n(1) the legal custody of the minor children of the parties that shall be sole or joint;\n(2) their physical custody, parenting time, and residence; and\n(3) their support.\n(b) The court shall grant the rights listed in subdivision 3a to each of the parties, regardless of custodial designation, unless specific findings are made under section 518.68, subdivision 1. The court shall include in the custody order the notice under subdivision 3a.\n(c) The court may waive any of the rights under this section if it finds it is necessary to protect the welfare of a party or child.\n(d) If a court order or law prohibits contact by a party, the notifications and information required to be sent under subdivision 3a, clauses (1), (2), (3), (5), and (6), shall not be made by direct communication of the parties. Third-party communication shall be limited to the specific purposes delineated in this subdivision or subdivision 3a. Nothing in this subdivision or subdivision 3a shall modify, suspend, revoke, or terminate a court order or law that prohibits contact by a party.\n(e) If one of the parties is a program participant under chapter 5B, the other party shall send all information and notifications required under subdivision 3a, clauses (1), (2), (3), (5), and (6), to the participant's designated address. The program participant is exempted from the requirements of subdivision 3a.\n(f) Failure to notify or inform a party of rights under subdivision 3a does not form a basis for modification under section 518.18, paragraph (d), clause (iv), unless other grounds are alleged which would support a modification.\nThe required notice under subdivision 3 must be substantially as follows:\n\"NOTICE\nEACH PARTY IS GRANTED THE FOLLOWING RIGHTS:\n(1) right of access to, and to receive copies of, school, medical, dental, religious training, police reports, and other important records and information about the minor children;\n(2) right of access to information regarding health or dental insurance available to the minor children;\n(3) right to be informed by the other party as to the name and address of the school of attendance of the minor children;\n(4) right to be informed by school officials about the children's welfare, educational progress and status, and to attend school and parent-teacher conferences. The school is not required to hold a separate conference for each party, unless attending the same conference would result in violation of a court order prohibiting contact with a party;\n(5) right to be notified by the other party of an accident or serious illness of a minor child, including the name of the health care provider and the place of treatment;\n(6) right to be notified by the other party if the minor child is the victim of an alleged crime, including the name of the investigating law enforcement officer or agency. There is no duty to notify if the party to be notified is the alleged perpetrator; and\n(7) right to reasonable access and telephone or other electronic contact with the minor children.\"\n[Repealed, 1986 c 406 s 9]\n[Repealed, 1986 c 406 s 9]\nAn award of joint legal custody is not a reason for departure from the guidelines in section 518A.35.",
	"repealed": false
}