{
	"id": "123B.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.88",
	"title": "123B.88 INDEPENDENT SCHOOL DISTRICTS; TRANSPORTATION.",
	"text": "The board may provide for the transportation of pupils to and from school and for any other purpose. The board may also provide for the transportation of pupils to schools in other districts for grades and departments not maintained in the district, including high school, at the expense of the district, when funds are available therefor and if agreeable to the district to which it is proposed to transport the pupils, for the whole or a part of the school year, as it may deem advisable, and subject to its rules. In any district, the board must arrange for the attendance of all pupils living two miles or more from the school, except pupils whose transportation privileges have been voluntarily surrendered under subdivision 2, or whose privileges have been revoked under section 123B.91, subdivision 1, clause (5). The district may provide for the transportation of or the boarding and rooming of the pupils who may be more economically and conveniently provided for by that means. Arrangements for attendance may include a requirement that parents or guardians request transportation before it is provided. The board must provide necessary transportation consistent with section 123B.92, subdivision 1, paragraph (b), clause (4), for a child with a disability not yet enrolled in kindergarten for the provision of special instruction and services under sections 125A.03 to 125A.24, 125A.26 to 125A.48, and 125A.65. Special instruction and services for a child with a disability not yet enrolled in kindergarten include an individualized education program team placement in an early childhood program when that placement is necessary to address the child's level of functioning and needs. When transportation is provided, scheduling of routes, establishment of the location of bus stops, manner and method of transportation, control and discipline of school children, the determination of fees, and any other matter relating thereto must be within the sole discretion, control, and management of the board. The district may provide for the transportation of pupils or expend a reasonable amount for room and board of pupils whose attendance at school can more economically and conveniently be provided for by that means or who attend school in a building rented or leased by a district within the confines of an adjacent district.\nThe board may establish a full-service school zone by adopting a written resolution and may provide transportation for students attending a school in that full-service school zone. A full-service school zone may be established for a school that is located in an area with higher than average crime or other social and economic challenges and that provides education, health or human services, or other parental support in collaboration with a city, county, state, or nonprofit agency. The pupil transportation must be intended to stabilize enrollment and reduce mobility at the school located in a full-service school zone.\nThe parent or guardian of a student may voluntarily surrender the student's to and from school transportation privileges granted under subdivision 1.\nThe board may contract for the furnishing of authorized transportation under section 123B.52, and may purchase gasoline and furnish same to a contract carrier for use in the performance of a contract with the school district for transportation of school children to and from school.\n(a) A school board may establish a pupil transportation safety committee. The chair of the pupil transportation safety committee is the district's school transportation safety director. The school board shall appoint the other members of the pupil transportation safety committee. Membership may include parents, school bus drivers, representatives of school bus companies, local law enforcement officials, other school district staff, and representatives from other units of local government.\n(b) The duties of the pupil transportation safety committee include: (1) reviewing and recommending changes to the district's pupil transportation safety policy required under subdivision 1; and (2) developing a comprehensive plan for the safe transportation of students who face hazardous transportation conditions. The comprehensive hazardous transportation plan shall consider safety factors including the types of roads that students must cross, the speed of traffic on those roads, the age of the students, and any other factors as determined by the committee.\n(c) The pupil transportation safety committee must hold at least one public meeting before adopting its comprehensive plan for transporting students who face hazardous transportation conditions.\n(d) Any recommended changes to the district's pupil transportation safety policy and the comprehensive plan for hazardous transportation must be submitted to the school board.\nThe board may provide for the instruction of any resident pupil in another district when inadequate room, distance to school, unfavorable road conditions, or other facts or conditions make attendance in the pupil's own district unreasonably difficult or impractical, in which case such district shall pay to the district so attended the tuition agreed upon or charged, pursuant to section 123A.488, subdivision 2, and may provide transportation; provided, that such pupil shall continue to be a pupil of the district of residence for the payment of apportionment and other state aids.\nThe board may provide for the admission to the schools of the district, of nonresident pupils, and those above school age, and fix the rates of tuition for such pupils.\nFor the purposes of this subdivision, a \"nonresident pupil\" is a pupil who resides in one district, defined as the \"resident district\" and attends school in another district, defined as the \"nonresident district.\"\nIf requested, a nonresident district shall transport a nonresident pupil within its borders and may transport a nonresident pupil within the pupil's resident district. If a nonresident district decides to transport a nonresident pupil within the pupil's resident district, the nonresident district must notify the pupil's resident district of its decision, in writing, prior to providing transportation.\nIf high school pupils from a district within this state are being transported to a school in another state, the board of the district from which the pupils are being transported may provide free transportation and tuition for any or all of its elementary pupils to such school in another state and be entitled to state aid as provided by law.\nThe board may rent a bus owned by the district excluding a motor-coach bus to any person for any lawful purpose. Bus rental must not interfere with the transportation of pupils by the district. A lessee may use and operate the bus without payment of a motor vehicle tax. The lessee is liable for any claims for injuries and damages arising out of the use and operation of a bus leased from the district. Except as provided in subdivision 15, the lessee shall procure insurance at the lessee's expense protecting the board and the district against claims for injuries and damages arising out of the use and operation of the bus.\nNotwithstanding the provisions of section 221.021, any public school district or school bus contractor providing transportation services to a district on a regular basis in this state may operate school buses, excluding motor coach buses, for the purpose of providing transportation to nonpupils of the school district attending school events, as defined in section 123B.49, subdivision 3 or 4, provided that no carrier having a charter carrier permit has its principal office and place of business or bus garage within 12 miles of the principal office of the district. District owned buses and the operators thereof shall otherwise comply with the provisions of this section and the rules of the commissioner of public safety and shall be insured in at least the amounts stated in section 466.04, subdivision 1. In all cases the total cost of providing such services, as determined by sound accounting procedures, shall be paid by charges made against those using the buses.\nDistricts may use district owned or contractor operated school buses to provide transportation along regular school bus routes on a space available basis for any person. Such use of a bus must not interfere with the transportation of pupils to and from school or other authorized transportation of pupils. In all cases, the total additional cost of providing these services, as determined by sound accounting procedures, must be paid by charges made against those using these services or some third-party payor. In no case shall the additional cost of this transportation be paid by the district.\nThe provisions of section 65B.47, subdivision 4, shall be applicable to any person being transported pursuant to this subdivision.\nDistricts may provide bus transportation along regular school bus routes on a space available basis for part-time students enrolled in secondary classes pursuant to section 124D.02, subdivisions 2, 3, and 4. Such use of a bus must not interfere with the transportation of pupils to and from school or other authorized transportation of pupils. The total additional cost of providing these services, as determined by sound accounting procedures, shall be paid by charges made against those using the services or some third-party payor.\nDistricts may provide bus transportation along school bus routes when space is available for participants in early childhood family education programs and school readiness programs if these services do not result in an increase in the district's expenditures for transportation. The costs allocated to these services, as determined by generally accepted accounting principles, shall be considered part of the authorized cost for transportation for the purposes of section 123B.92.\nDistricts may provide between-building bus transportation along school bus routes when space is available, for pupils attending programs at an area learning center. The transportation is permitted between schools if it does not increase the district's expenditures for transportation. The cost of these services shall be considered part of the authorized cost for the purpose of section 123B.92.\nThe board may provide for the protection of pupils transported for school purposes or activities in district owned, operated, leased, or controlled motor vehicles against injuries or damages arising out of the operation of these vehicles. The board may purchase and pay for insurance from any funds available. An insurance contract covering this risk shall contain a waiver of the defense of governmental immunity. The payment of any insurance premiums by the district does not in itself make the district liable for any injuries or damages incurred by the transportation.\nIf a school board has obtained insurance pursuant to subdivision 14 or section 466.06, it may also obtain and pay for insurance coverage to indemnify a lessee and to protect the board and the district, in any amount not exceeding the limits of coverage provided for the insurance obtained pursuant to subdivision 14 or section 466.06 against claims for injuries and damages arising out of the use and operation of a district-owned bus while it is leased or rented to the lessee pursuant to subdivision 8. The rental charge shall include the cost of this additional insurance coverage. The procurement of this additional insurance coverage constitutes a waiver of the defense of governmental immunity to the extent of the additional coverage but has no effect on the liability of the board, the district, or its employees beyond the coverage so provided.\nThe board may provide and pay the premiums for the protection for school children, instructors and automobile owners, and any other agency cooperating in providing cars for districts where driver training courses are being offered, against public liability, property damage, collision, fire and theft, arising out of the operation of any vehicle used in the courses. Nothing herein shall make the district liable for injuries resulting from the actions of such persons.\nThe board may provide and pay the premiums for insurance against injuries resulting to its pupils while assigned to and acting on a school safety patrol. Such insurance may provide for the payment of either cash benefits to such injured pupil or for the payment of hospital and medical benefits to or for such injured pupil, or both. Nothing herein shall be construed to make the district liable for such injuries.\nThe board may enter into contracts for the removal of snow from roads used for regular bus routes transporting pupils to and from school either within or outside the district.\nThe board must contract with any licensed day training and habilitation program attended by a resident disabled person who fulfills the eligibility requirements of section 256B.092, to transport the resident disabled person to the program in return for payment by the program of the cost of the transportation, if transportation by the board is in the best interest of the disabled person and is not unreasonably burdensome to the district and if a less expensive, reasonable, alternative means of transporting the disabled person does not exist. If the board and the program are unable to agree to a contract, either the board or the program may appeal to the commissioner to resolve the conflict. All decisions of the commissioner shall be final and binding upon the board and the program.\nThe board may provide transportation for a pupil who is a custodial parent and that pupil's child between the pupil's home and a child care provider and between the provider and the school. The board must establish criteria for transportation it provides according to this subdivision.\nA district may provide bus transportation between home and school for pupils on days devoted to parent-teacher conferences, teacher's workshops, or other staff development opportunities. If approved by the commissioner as part of a program of educational improvement, the cost of providing this transportation, as determined by generally accepted accounting principles, must be considered part of the authorized cost for regular transportation for the purposes of section 123B.92. The commissioner shall approve inclusion of these costs in the regular transportation category only if the total number of instructional hours in the school year divided by the total number of days for which transportation is provided equals or exceeds the number of instructional hours per day prescribed in the rules of the Department of Education.\nDistricts may provide bus transportation along school bus routes when space is available, for pupils attending programs at a postsecondary institution under the postsecondary enrollment options program. Fees collected for this service under section 123B.36, subdivision 1, paragraph (13), shall be subtracted from the authorized cost for nonregular transportation for the purpose of section 123B.92. A school district may provide transportation for a pupil participating in an articulated program operated under an agreement between the school district and the postsecondary institution.",
	"repealed": false
}