{
	"id": "626.8473",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8473",
	"title": "626.8473 PORTABLE RECORDING SYSTEMS ADOPTION; WRITTEN POLICY REQUIRED.",
	"text": "As used in this section, \"portable recording system\" has the meaning provided in section 13.825, subdivision 1.\nA local law enforcement agency must provide an opportunity for public comment before it purchases or implements a portable recording system. At a minimum, the agency must accept public comments submitted electronically or by mail, and the governing body with jurisdiction over the budget of the law enforcement agency must provide an opportunity for public comment at a regularly scheduled meeting.\n(a) The chief officer of every state and local law enforcement agency that uses or proposes to use a portable recording system must establish and enforce a written policy governing its use. In developing and adopting the policy, the law enforcement agency must provide for public comment and input as provided in subdivision 2. Use of a portable recording system without adoption of a written policy meeting the requirements of this section is prohibited. The written policy must be posted on the agency's website, if the agency has a website.\n(b) At a minimum, the written policy must incorporate and require compliance with the following:\n(1) the requirements of section 13.825 and other data classifications, access procedures, retention policies, and data security safeguards that, at a minimum, meet the requirements of chapter 13 and other applicable law. The policy must prohibit altering, erasing, or destroying any recording made with a peace officer's portable recording system or data and metadata related to the recording prior to the expiration of the applicable retention period under section 13.825, subdivision 3, except that the full, unedited, and unredacted recording of a peace officer using deadly force must be maintained indefinitely;\n(2) mandate that a portable recording system be worn at or above the mid-line of the waist in a position that maximizes the recording system's capacity to record video footage of the officer's activities;\n(3) mandate that officers assigned a portable recording system wear and operate the system in compliance with the agency's policy adopted under this section while performing law enforcement activities under the command and control of another chief law enforcement officer or federal law enforcement official;\n(4) mandate that, notwithstanding any law to the contrary, when an individual dies as a result of a use of force by a peace officer, an involved officer's law enforcement agency must allow the following individuals, upon their request, to inspect all portable recording system data, redacted no more than what is required by law, documenting the incident within five days of the request, except as otherwise provided in this clause and clause (5):\n(i) the deceased individual's next of kin;\n(ii) the legal representative of the deceased individual's next of kin; and\n(iii) the other parent of the deceased individual's child.\nA law enforcement agency may deny a request if the agency determines that there is a compelling reason that inspection would interfere with an active investigation. If the agency denies access, the chief law enforcement officer must provide a prompt, written denial to the individual who requested the data with a short description of the compelling reason access was denied and must provide notice that relief may be sought from the district court pursuant to section 13.82, subdivision 7;\n(5) mandate that, when an individual dies as a result of a use of force by a peace officer, an involved officer's law enforcement agency shall release all portable recording system data, redacted no more than what is required by law, documenting the incident no later than 14 days after the incident, unless the chief law enforcement officer asserts in writing that the public classification would interfere with an ongoing investigation, in which case the data remain classified by section 13.82, subdivision 7;\n(6) procedures for testing the portable recording system to ensure adequate functioning;\n(7) procedures to address a system malfunction or failure, including requirements for documentation by the officer using the system at the time of a malfunction or failure;\n(8) circumstances under which recording is mandatory, prohibited, or at the discretion of the officer using the system;\n(9) circumstances under which a data subject must be given notice of a recording;\n(10) circumstances under which a recording may be ended while an investigation, response, or incident is ongoing;\n(11) procedures for the secure storage of portable recording system data and the creation of backup copies of the data; and\n(12) procedures to ensure compliance and address violations of the policy, which must include, at a minimum, supervisory or internal audits and reviews, and the employee discipline standards for unauthorized access to data contained in section 13.09.\n(c) The board has authority to inspect state and local law enforcement agency policies to ensure compliance with this section. The board may conduct this inspection based upon a complaint it receives about a particular agency or through a random selection process. The board may impose licensing sanctions and seek injunctive relief under section 214.11 for an agency's or licensee's failure to comply with this section.",
	"repealed": false
}