{
	"id": "84B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/84B.03",
	"title": "84B.03 DONATION OF STATE LANDS.",
	"text": "Notwithstanding the provisions of any other law to the contrary, the governor, after consulting with the commissioner of natural resources and, in regard to lands forfeited to the state for nonpayment of taxes and held in trust by the state for taxing districts, the commissioner of revenue, shall donate and convey to the United States of America the state's interest in all of the following lands lying within the boundaries of Voyageurs National Park, as described by section 102 of the act of Congress authorizing the establishment of the park: (1) trust fund lands; (2) lands forfeited to the state for nonpayment of taxes and held in trust by the state for taxing districts; and (3) other lands acquired or otherwise owned by the state. Each conveyance of these lands shall contain the following: (1) a provision that the lands shall revert to the state of Minnesota if (a) the secretary of the interior does not establish the park within five years after donation of all state-owned lands, or if (b) the lands so conveyed are no longer used for national park purposes; (2) a reservation to the state of all minerals and water power rights; (3) a provision that the conveyance is subject to the rights of any person having an interest in the land on the date of conveyance pursuant to state lease, license, or permit; and (4) to satisfy the provisions of section 301(c) of the act authorizing the establishment of Voyageurs National Park, each conveyance of these lands also shall contain the covenant required by that section to prohibit mining or water power development.\nFor the purpose of satisfying the public sale requirements of Minnesota Constitution, article XI, section 8, and other applicable provisions of Minnesota's Constitution, and in keeping with the decision of the Minnesota Supreme Court in the case of Independent School District of Virginia v. State, 124 Minn. 271, where the court held that condemnation satisfied the public sale requirement of the Minnesota Constitution, the commissioner of administration shall acquire, by condemnation, fee title to all trust fund lands lying within the boundaries of Voyageurs National Park. The commissioner of administration shall not condemn the interests of any person holding a lease, license, or permit from the state in the lands condemned. Before any parcel of trust fund land is donated to the United States, the commissioner of administration shall certify to the governor that the parcel has been condemned, the condemnation award has been paid, and the time to appeal from the award has expired.\nThe commissioner of administration shall also acquire fee title, free from any trust or other encumbrance, to all land lying within the boundaries of Voyageurs National Park, the title to which has vested or may vest in the state due to nonpayment of taxes and expiration of the period for redemption, after the giving of notice thereof as provided by law, and is held by the state pursuant to section 281.25, in trust for the respective taxing districts interested in the taxes, assessments, penalties, interest, and costs accrued against the land at the time of expiration of the period of redemption. The commissioner of administration, in cooperation with the commissioner of natural resources, shall appraise the land at its fair market value. Upon determining the value of the land, the commissioner of administration shall transfer to the appropriate county auditor, from money appropriated for this purpose, an amount of money equal to the appraised value of the land, whereupon fee title to the land, free from any trust or other encumbrance, shall vest in the state of Minnesota. When a county is not satisfied with the valuation determined by the commissioner of administration, it may appeal the matter to the District Court in Ramsey County. The appeal shall be conducted so far as possible in the manner provided for eminent domain proceedings by chapter 117. The county auditor shall apportion the money in the manner provided in section 282.08, for the apportionment of proceeds from the sale of tax-forfeited lands.\nIn furtherance of boundary adjustments to Voyageurs National Park authorized by Congress in Public Law 97-405, and notwithstanding any other law to the contrary, the governor, after consulting the commissioner of natural resources, shall donate and convey to the United States of America, for Voyageurs National Park, the state's interest in the following described lands:\n(1) Lot 7, Section 4, Township 68 North, Range 18 West;\n(2) the area of land commonly referred to as the Kabetogama Forestry Station, consisting of approximately 18.45 acres, and located in Section 21, Township 69 North, Range 21 West; and\n(3) land not exceeding 120 acres consisting of a strip of land through that portion of Section 1, Township 68 North, Range 20 West, which is roughly parallel to and 400 feet on each side of the unimproved road extending northward from a point of beginning at the Ash River Trail in the Southeast Quarter of the Southeast Quarter of Section 1 to a point of termination in the Northeast Quarter of the Northwest Quarter in Section 1.\nLands described in clause (1) shall be donated and conveyed only after $30,000 has been paid by the commissioner of natural resources to the city of Tower in return for a conveyance to the state of all right, title, and interest of the city of Tower in the land. Lands described in clauses (2) and (3) shall be donated and conveyed only after the lands have been condemned by the commissioner of natural resources in the manner required by subdivision 2, and the time to appeal from the condemnation award has expired. All conveyances required by this subdivision shall comply with subdivision 1, except for the provision required by clause (1)(a) of that subdivision.",
	"repealed": false
}