{
	"id": "299C.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.095",
	"title": "299C.095 SYSTEM FOR IDENTIFYING JUVENILE OFFENDERS.",
	"text": "(a) The bureau shall administer and maintain the computerized juvenile history record system based on sections 260B.171 and 260C.171 and other statutes requiring the reporting of data on juveniles. The data in the system are private data as defined in section 13.02, subdivision 12, but are accessible to criminal justice agencies as defined in section 13.02, subdivision 3a, to all trial courts and appellate courts, to a person who has access to the juvenile court records as provided in sections 260B.171 and 260C.171 or under court rule, to public defenders as provided in section 611.272, and to criminal justice agencies in other states in the conduct of their official duties.\n(b) Except for access authorized under paragraph (a), the bureau shall only disseminate a juvenile adjudication history record in connection with a background check required by statute or rule and performed on a licensee, license applicant, or employment applicant or performed under section 299C.62 or 624.713. If the background check is performed under section 299C.62, juvenile adjudication history disseminated under this paragraph is limited to offenses that would constitute a background check crime as defined in section 299C.61, subdivision 2. A consent for release of information from an individual who is the subject of a juvenile adjudication history is not effective and the bureau shall not release a juvenile adjudication history record and shall not release information in a manner that reveals the existence of the record. Data maintained under section 243.166, released in conjunction with a background check, regardless of the age of the offender at the time of the offense, does not constitute releasing information in a manner that reveals the existence of a juvenile adjudication history.\n(a) Notwithstanding section 138.17, the bureau shall retain juvenile history records for the time periods provided in this subdivision. Notwithstanding contrary provisions of paragraphs (b) to (e), all data in a juvenile history record must be retained for the longest time period applicable to any item in the individual juvenile history record. If, before data are destroyed under this subdivision, the subject of the data is convicted of a felony as an adult, the individual's juvenile history record must be retained for the same time period as an adult criminal history record.\n(b) Juvenile history data on a child who was arrested must be destroyed six months after the arrest if the child has not been referred to a diversion program and no petition has been filed against the child by that time.\n(c) Juvenile history data on a child against whom a delinquency petition was filed and subsequently dismissed must be destroyed upon receiving notice from the court that the petition was dismissed.\n(d) Juvenile history data on a child who was referred to a diversion program or against whom a delinquency petition has been filed and continued for dismissal must be destroyed when the child reaches age 21.\n(e) Juvenile history data on a child against whom a delinquency petition was filed and continued without adjudication, or a child who was found to have committed a felony or gross misdemeanor-level offense, must be destroyed when the child reaches age 28. If the offender commits a felony violation as an adult, the bureau shall retain the data for as long as the data would have been retained if the offender had been an adult at the time of the juvenile offense.\n(f) The bureau shall retain extended jurisdiction juvenile data on an individual received under section 260B.171, subdivision 2, paragraph (c), for as long as the data would have been retained if the offender had been an adult at the time of the offense.\n(g) Data retained on individuals under this subdivision are private data under section 13.02, except that extended jurisdiction juvenile data become public data under section 13.87, subdivision 2, when the juvenile court notifies the bureau that the individual's adult sentence has been executed under section 260B.130, subdivision 5.\n(h) A person who receives data on a juvenile under paragraphs (b) to (e) from the bureau shall destroy the data according to the schedule in this subdivision, unless the person has access to the data under other law. The bureau shall include a notice of the destruction schedule with all data it disseminates on juveniles.",
	"repealed": false
}