{
	"id": "341.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.345",
	"title": "341.345 CHALLENGING THE OUTCOME OF A COMBATIVE SPORT CONTEST.",
	"text": "(a) If a combatant disagrees with the outcome of a combative sport contest regulated by the Department of Labor and Industry in which the combatant participated, the combatant may challenge the outcome.\n(b) If a third party makes a challenge on behalf of a combatant, the third party must provide written confirmation that they are authorized to make the challenge on behalf of the combatant. The written confirmation must contain the combatant's signature and must be submitted with the challenge.\nA challenge must be submitted on a form prescribed by the commissioner, set forth all relevant facts and the basis for the challenge, and state what remedy is being sought. A combatant may submit photos, videos, documents, or any other evidence the combatant would like the commissioner to consider in connection to the challenge. A combatant may challenge the outcome of a contest only if it is alleged that:\n(1) the referee made an incorrect call or missed a rule violation that directly affected the outcome of the contest;\n(2) there was collusion amongst officials to affect the outcome of the contest; or\n(3) scores were miscalculated.\nA challenge must be submitted within ten days of the contest.\n(a) For purposes of this subdivision, the day of the contest shall not count toward the ten-day period. If the tenth day falls on a Saturday, Sunday, or legal holiday, then a combatant shall have until the next day that is not a Saturday, Sunday, or legal holiday to submit a challenge.\n(b) The challenge must be submitted to the commissioner at the address, fax number, or email address designated on the commissioner's website. The date on which a challenge is submitted by mail shall be the postmark date on the envelope in which the challenge is mailed. If the challenge is faxed or emailed, it must be received by the commissioner by 4:30 p.m. Central Time on the day the challenge is due.\nIf the requirements of subdivisions 1 to 3 are met, the commissioner shall send a complete copy of the challenge documents, along with any supporting materials submitted, to the opposing combatant by mail, fax, or email. The opposing combatant has 14 days from the date the commissioner sends the challenge and supporting materials to submit a response to the commissioner. Additional response time is not added when the commissioner sends the challenge to the opposing combatant by mail. The opposing combatant may submit photos, videos, documents, or any other evidence the opposing combatant would like the commissioner to consider in connection to the challenge. The response must be submitted to the commissioner at the address, fax number, or email address designated on the commissioner's website. The date on which a response is submitted by mail is the postmark date on the envelope in which the response is mailed. If the response is faxed or emailed, it must be received by the commissioner by 4:30 p.m. Central Time on the day the response is due.\nThe commissioner may, if the commissioner determines it would be helpful in resolving the issues raised in the challenge, send a complete copy of the challenge or response, along with any supporting materials submitted, to any licensed official involved in the combative sport contest at issue by mail, fax, or email and request the official's views on the issues raised in the challenge.\nThe commissioner shall issue an order on the challenge within 60 days after receiving the opposing combatant's response. If the opposing combatant does not submit a response, the commissioner shall issue an order on the challenge within 75 days after receiving the challenge.\nIf the requirements of subdivisions 1 to 3 are not met, the commissioner must not accept the challenge and may send correspondence to the person who submitted the challenge stating the reasons for nonacceptance of the challenge. A combatant has no further appeal rights if the combatant's challenge is not accepted by the commissioner.\nAfter the commissioner issues an order under subdivision 6, each combatant under section 326B.082, subdivision 8, has 30 days after service of the order to submit a request for hearing before an administrative law judge.",
	"repealed": false
}