{
	"id": "254A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/254A.02",
	"title": "254A.02 DEFINITIONS.",
	"text": "For the purposes of chapter 254A, unless the context clearly indicates otherwise, the terms defined in this section have the meanings given them.\n\"Approved treatment program\" means care and treatment services provided by any individual, organization or association to persons with a substance use disorder, which meets the standards established by the commissioner of human services.\n\"Comprehensive program\" means the range of services which are to be made available for the purpose of prevention, care and treatment of substance misuse and substance use disorder.\n[Repealed, 1Sp2017 c 6 art 8 s 77]\n\"Drug dependent person\" means any person incapable of self-management or management of personal affairs or unable to function physically or mentally in an effective manner because of the abuse of a drug, including alcohol.\n\"Facility\" means any treatment facility administered under an approved treatment program.\n\"Substance misuse\" means the use of any psychoactive or mood-altering substance, without compelling medical reason, in a manner that results in mental, emotional, or physical impairment and causes socially dysfunctional or socially disordering behavior and that results in psychological dependence or physiological addiction as a function of continued use. Substance misuse has the same meaning as drug abuse or abuse of drugs.\n[Repealed, 2007 c 147 art 11 s 27]\n\"Other drugs\" means any psychoactive substance other than alcohol.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63]\n[Repealed, 2007 c 147 art 11 s 27]\n\"State authority\" is a division established within the Department of Human Services for the purpose of relating the authority of state government in the area of substance misuse and substance use disorder to the substance misuse and substance use disorder-related activities within the state.\n\"Substance use disorder\" has the meaning given in the current Diagnostic and Statistical Manual of Mental Disorders.\n\"American Indian\" means a person who is a member of an Indian tribe. The commissioner shall use the definitions of \"Indian\" and \"Indian tribe\" and \"Indian organization\" provided in United States Code, title 25, section 450(b), as amended through December 31, 1992.\n[Repealed, 2007 c 147 art 11 s 27]\n\"Commissioner\" means the commissioner of human services.\n[Repealed, 2007 c 147 art 11 s 27]\n[Repealed, 2007 c 147 art 11 s 27]\n[Repealed, 2007 c 147 art 11 s 27]\n\"Purchase of service agreement\" means a contract between a contractor and service provider for the provision of services. The agreement shall specify the services to be provided, the method of delivery, the type of staff to be employed, and a method of evaluation of the services to be provided.",
	"repealed": false
}