{
	"id": "62A.3094",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3094",
	"title": "62A.3094 COVERAGE FOR AUTISM SPECTRUM DISORDERS.",
	"text": "(a) For purposes of this section, the terms defined in paragraphs (b) to (d) have the meanings given.\n(b) \"Autism spectrum disorders\" means the conditions as determined by criteria set forth in the most recent edition of the Diagnostic and Statistical Manual of Mental Disorders of the American Psychiatric Association.\n(c) \"Medically necessary care\" means health care services appropriate, in terms of type, frequency, level, setting, and duration, to the enrollee's condition, and diagnostic testing and preventative services. Medically necessary care must be consistent with generally accepted practice parameters as determined by physicians and licensed psychologists who typically manage patients who have autism spectrum disorders.\n(d) \"Mental health professional\" means a mental health professional who is qualified according to section 245I.04, subdivision 2, clause (1), (2), (3), (4), or (6), who has training and expertise in autism spectrum disorder and child development.\n[See Note.]\n(a) A health plan issued to a large employer, as defined in section 62Q.18, subdivision 1, must provide coverage for the diagnosis, evaluation, multidisciplinary assessment, and medically necessary care of children under 18 with autism spectrum disorders, including but not limited to the following:\n(1) early intensive behavioral and developmental therapy based in behavioral and developmental science, including, but not limited to, all types of applied behavior analysis, intensive early intervention behavior therapy, and intensive behavior intervention;\n(2) neurodevelopmental and behavioral health treatments and management;\n(3) speech therapy;\n(4) occupational therapy;\n(5) physical therapy; and\n(6) medications.\n(b) The diagnosis, evaluation, and assessment must include an assessment of the child's developmental skills, functional behavior, needs, and capacities.\n(c) The coverage required under this subdivision must include treatment that is in accordance with an individualized treatment plan prescribed by the enrollee's treating physician or mental health professional.\n(d) A health carrier may not refuse to renew or reissue, or otherwise terminate or restrict, coverage of an individual solely because the individual is diagnosed with an autism spectrum disorder.\n(e) A health carrier may request an updated treatment plan only once every six months, unless the health carrier and the treating physician or mental health professional agree that a more frequent review is necessary due to emerging circumstances.\n(f) An independent progress evaluation conducted by a mental health professional with expertise and training in autism spectrum disorder and child development must be completed to determine if progress toward function and generalizable gains, as determined in the treatment plan, is being made.\nNothing in this section limits the coverage required under section 62Q.47.\nThis section does not affect benefits available under the medical assistance and MinnesotaCare programs and does not limit, restrict, or otherwise reduce coverage under these programs.",
	"repealed": false
}