{
	"id": "256K.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.48",
	"title": "256K.48 TRANSITIONAL HOUSING PROGRAMS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Transitional housing\" means housing designed for independent living and provided to a homeless person or family at a rental rate of at least 25 percent of the family income for a period of up to 36 months. If a transitional housing program is associated with a licensed facility or shelter, it must be located in a separate facility or a specified section of the main facility where residents can be responsible for their own meals and other daily needs.\n(c) \"Support services\" means an assessment service that identifies the needs of individuals for independent living and arranges or provides for the appropriate educational, social, legal, advocacy, child care, employment, financial, health care, or information and referral services to meet these needs.\nA transitional housing program is established to be administered by the commissioner. The commissioner may make grants to eligible recipients or enter into agreements with community action agencies or other public or private nonprofit agencies to make grants to eligible recipients to initiate, maintain, or expand programs to provide transitional housing and support services for persons in need of transitional housing, which may include up to six months of follow-up support services for persons who complete transitional housing as they stabilize in permanent housing. The commissioner must ensure that money appropriated to implement this section is distributed as soon as practicable. The commissioner may make grants directly to eligible recipients. The commissioner may extend use of this program for persons needing assistance longer than 36 months.\nA housing and redevelopment authority established under section 469.003 or a community action agency recognized under section 142F.301 is eligible for assistance under the program. In addition, a partnership, joint venture, corporation, or association that meets the following requirements is also eligible:\n(1) it is established for a purpose not involving pecuniary gain to its members, partners, or shareholders;\n(2) it does not pay dividends or other pecuniary remuneration, directly or indirectly, to its members, partners, or shareholders; and\n(3) in the case of a private, nonprofit corporation, it is established under and in compliance with chapter 317A.\nAn eligible recipient may apply to the commissioner, or to a nonprofit agency designated by the commissioner, for a grant to initiate, maintain, or expand a program providing transitional housing and support services for persons in need of transitional housing. The application must include:\n(1) a proposal for the provision of transitional housing and support services, including program objectives, availability of adequate funding, appropriateness of the proposed program for the population to be served, and how the program will help individuals to move into permanent housing;\n(2) a proposed budget;\n(3) a plan for collection of required data and the method to be used for program evaluation; and\n(4) evidence of the participation in the development of the application of any agency or governmental body that will provide essential services or assistance to the program.\nCriteria for the award of grants must include:\n(1) evidence that the application meets all program requirements;\n(2) evidence of the need of the applicant for state assistance and of the need for the particular program;\n(3) indication of long-range plans for future funding if the need continues to exist for the service; and\n(4) assurance that grants are awarded to as wide a variety of programs as possible, with emphasis on programs that concentrate on long-term solutions to individual housing problems.\nAt least two programs funded must be located in the seven-county metropolitan area and at least one program must be located outside of the metropolitan area. The commissioner may fund programs designed primarily to serve families with children, single persons, and persons leaving a shelter for family abuse.\nGrant recipients must combine funds awarded under this section with other funds from public and private sources.\nIn order to collect uniform data to better measure the nature and extent of the need for transitional housing, grant recipients must collect and make available to the commissioner the following information:\n(1) the number of requests received for transitional housing, including the number of persons requiring assistance;\n(2) the number of persons for whom services are provided, listed by age;\n(3) reasons for seeking assistance;\n(4) length of stay;\n(5) reasons for leaving the housing program;\n(6) demand for support services;\n(7) follow-up information on status of persons assisted, including source of income and whether living independently, employed, or in treatment, unless the information is not available; and\n(8) source of income on entering the program, prior residence, race, and sex of persons assisted.\nPersonal history information and other information collected, used, or maintained by a grant recipient from which the identity of any individual receiving services may be determined is private data on individuals, as defined in section 13.02, subdivision 12, and the grant recipient must maintain the data in accordance with the provisions of chapter 13.\nThe requirements of sections 245A.01 to 245A.16 and chapter 245C do not apply to transitional housing and support services funded under this section unless the commissioner of human services determines that the program is primarily a residential program within the meaning of section 245A.02, subdivision 14.\nThe commissioner may waive requirements under this section for up to nine months after the disaster for grantees in areas where a federal disaster has been declared under United States Code, title 42, section 5121, et seq., or the governor has exercised authority under chapter 12. The commissioner shall notify the chairs of the senate Family and Early Childhood Education Budget Division, the senate Education Finance Committee, the house of representatives Family and Early Childhood Education Finance Division, the house of representatives Education Committee, and the house of representatives Ways and Means Committee ten days before the effective date of any waiver granted under this section.",
	"repealed": false
}