{
	"id": "124D.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.75",
	"title": "124D.75 LICENSES FOR AMERICAN INDIAN LANGUAGE AND CULTURE EDUCATION TEACHERS; EXEMPTIONS.",
	"text": "The Professional Educator Licensing and Standards Board, in consultation with the Tribal Nations Education Committee, must grant initial and continuing teaching licenses in American Indian language and culture education that bear the same duration as other initial and continuing licenses. The board must grant licenses to persons who present satisfactory evidence that they:\n(1) possess competence in an American Indian language or possess unique qualifications relative to or knowledge and understanding of American Indian history and culture; or\n(2) possess a bachelor's degree or other academic degree approved by the board or meet such requirements as to course of study and training as the board may prescribe, or possess such relevant experience as the board may prescribe.\nThis evidence may be presented by affidavits, tribal resolutions, or by such other methods as the board may prescribe. Individuals may present applications for licensure on their own behalf or these applications may be submitted by the superintendent or other authorized official of a school district, participating school, or an American Indian school.\nA person holding a general teaching license who presents the board with satisfactory evidence of competence in an American Indian language, or knowledge and understanding of American Indian history and culture may be licensed under this section.\nAll persons applying for a license under this section must submit to the board a resolution or letter of support signed by an American Indian tribal government. All persons holding a license under this section must have on file or file with the board a resolution or letter of support signed by a tribal government.\nTeachers employed in an American Indian language and culture education program pursuant to sections 124D.71 to 124D.82 shall not be employed to replace any presently employed teacher who otherwise would not be replaced.\nFor the purpose of licensing American Indian language and culture education teachers, the board may approve programs at colleges or universities designed for their training subject to the approval of the commissioner of education.\nAny person licensed under this section shall be eligible for employment by a school board or a participating school as a teacher in an American Indian education program in which the American Indian language or culture in which the person is licensed is taught. A school district or participating school may prescribe only those additional qualifications for teachers licensed under this section as are approved by the Professional Educator Licensing and Standards Board. Any school board or participating school upon request may be exempted from the licensure requirements of this section in the hiring of one or more American Indian language and culture education teachers for any school year in which compliance would, in the opinion of the Professional Educator Licensing and Standards Board, create a hardship in the securing of the teachers.\nAn American Indian language and culture education teacher serving under an exemption as provided in subdivision 6 shall be granted a license as soon as that teacher achieves the qualifications for the license. Not more than one year of service by an American Indian language and culture education teacher under an exemption shall be credited to the teacher for the purposes of section 122A.40 and not more than two years shall be credited for the purposes of section 122A.41; and the one or two years shall be deemed to precede immediately and be consecutive with the year in which a teacher becomes licensed.\nA teacher holding a license or exemption under this section shall be compensated according to a schedule which is at least equivalent to that applicable to teachers holding general licenses.\nIn hiring for all positions in these programs, school districts and participating schools shall give preference to and make affirmative efforts to seek, recruit, and employ persons who share the culture of the American Indian children who are enrolled in the program. The district or participating school must provide procedures for the involvement of the parent advisory committees in the recruitment, screening, and selection of applicants. This subdivision shall not be construed to limit the school board's authority to hire and discharge personnel.",
	"repealed": false
}