{
	"id": "477B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.02",
	"title": "477B.02 QUALIFYING FOR FIRE STATE AID.",
	"text": "A municipality or independent nonprofit firefighting corporation qualifies to receive fire state aid if all the requirements of this section are met.\n(a) An independent nonprofit firefighting corporation must be created under the nonprofit corporation act of this state operating for the exclusive purpose of firefighting, or the governing body of a municipality must officially establish a fire department.\n(b) The fire department must have provided firefighting services for at least one calendar year, and must have a current fire department identification number issued by the state fire marshal.\n(a) The fire department must:\n(1) be associated with a firefighters relief association that provides retirement benefits;\n(2) participate in the statewide volunteer firefighter plan;\n(3) have retirement coverage under the public employees police and fire retirement plan for the department's full-time firefighters, as defined in section 299N.03, subdivision 5, or the fire department's part-time firefighters, or the fire department's full-time firefighters and part-time firefighters; or\n(4) satisfy either clauses (1) and (3) or clauses (2) and (3).\n(b) For purposes of retirement benefits, a fire department may be associated with only one firefighters relief association or one account in the statewide firefighters retirement plan at one time.\n(c) Notwithstanding paragraph (a), a municipality without a relief association as described under section 424A.08, paragraph (a), may still qualify to receive fire state aid if all other requirements of this section are met.\nMS 2022 [Repealed, 2023 c 64 art 17 s 25]\nThe fire department must be dispatched by a public safety answering point as defined in section 403.02, subdivision 19.\n(a) Every municipality or independent nonprofit firefighting corporation must file with the commissioner (1) a copy of any duly executed and valid fire service contracts, (2) written notification of any fire service contract terminations, and (3) written notification of any dissolution of a fire department, within 60 days of contract execution or termination, or department dissolution.\n(b) If more than one fire department provides service to a municipality, the fire departments furnishing service must file an apportionment agreement with the commissioner.\n(c) When a municipality is a joint powers entity, it must file its joint powers agreement with the commissioner. If the joint powers agreement does not include sufficient information defining the fire department service area of the joint powers entity for the purposes of calculating fire state aid, the secretary must file a written statement with the commissioner defining the fire department service area.\n(d) When a municipality is a fire protection special taxing district, it must file its resolution establishing the fire protection special taxing district, and any agreements required for the establishment of the fire protection special taxing district, with the commissioner. If the resolution or agreement does not include sufficient information defining the fire department service area of the fire protection special taxing district, the secretary must file a written statement with the commissioner defining the fire department service area.\n(e) The commissioner shall prescribe the content, format, and manner of the notifications, apportionment agreements, and written statements under paragraphs (a) to (d), pursuant to section 270C.30, except that copies of fire service contracts, joint powers agreements, and resolutions establishing fire protection special taxing districts shall be filed in their existing form.\n(f) A document filed with the commissioner under this subdivision must be refiled any time it is updated within 60 days of the update. An apportionment agreement must be refiled only when a change in the averaged sum of the percentage of population and percentage of estimated market value serviced by a fire department subject to the apportionment agreement is at least one percent. The percentage amount must be rounded to the nearest whole percentage.\n(g) Upon the request of the commissioner, the county auditor must provide information that the commissioner requires to accurately apportion the estimated market value of a fire department service area for a fire department providing service to an unorganized territory located in the county.\nThe fire department must meet all other requirements that the commissioner establishes by rule.\nThe financial reporting requirements of section 424A.014 must be satisfied.\nOn or before February 1 each year, the executive director of the Public Employees Retirement Association must certify to the commissioner the fire departments that transferred retirement coverage to, or terminated participation in, the voluntary statewide volunteer firefighter retirement plan since the previous certification under this paragraph. This certification must include the number of active volunteer firefighters under section 477B.03, subdivision 5, paragraph (e).\nOn or before March 15 of each year, the municipal clerk or the secretary must certify to the commissioner the fire department service area as of December 31 of the previous year, and that the fire department meets the qualification requirements of this section. The municipal clerk or the secretary must provide the commissioner with documentation that the commissioner deems necessary for determining eligibility for fire state aid or for calculating and apportioning fire state aid under section 477B.03. The certification must be on a form prescribed by the commissioner and must include all other information that the commissioner requires. The municipal clerk or the secretary must send a copy of the certification filed under this subdivision to the fire chief within five business days of the date the certification was filed with the commissioner.\n(a) If the certification under subdivision 9 is not filed with the commissioner on or before March 1, the commissioner must notify the municipal clerk or the secretary that a penalty will be deducted from fire state aid certified for the current year if the certification is not filed on or before March 15.\n(b) If the commissioner rejects the certification by the municipal clerk or secretary under subdivision 9 for inaccurate or incomplete information, the municipal clerk or the secretary must file a corrective certification after taking corrective action as identified by the commissioner in the notice of rejection. The corrective certification must be filed within 30 days of the date on the notice of rejection or by March 15, whichever date is later.\n(c) A penalty applies to (1) a certification under subdivision 9 filed after March 15, and (2) a corrective certification under paragraph (b) filed after March 15 that is also filed more than 30 days after the date on the notice of rejection. The penalty is equal to the amount of fire state aid determined for the municipality or the independent nonprofit firefighting corporation for the current year, multiplied by ten percent for each week or fraction of a week that the certification or corrective certification is filed after March 15 or more than 30 days after the date on the notice of rejection. Aid amounts forfeited as a result of the penalty revert to the state general fund. Failure to receive the certification form is not a defense for a failure to file.\nThe commissioner must determine which municipalities and independent nonprofit firefighting corporations are qualified to receive fire state aid directly or are qualified to receive the benefit of fire state aid paid to the statewide volunteer firefighter plan based on compliance with the requirements of this section and the financial compliance report required under section 6.495, subdivision 3, if applicable. The commissioner may take into account any other relevant information that comes to the attention of the commissioner when making the determination.",
	"repealed": false
}