{
	"id": "80D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/80D.02",
	"title": "80D.02 DEFINITIONS.",
	"text": "As used in sections 80D.01 to 80D.16, the terms defined in this section have the meanings given them.\n\"Continuing care\" means the furnishing to an individual, other than an individual related by blood or marriage to the person furnishing the care, of board, lodging, and nursing service, medical service or other health-related service, regardless of whether or not the lodging and service are provided at the same location, pursuant to a written agreement effective for the life of the individual or for a period in excess of one year, which is conditioned upon the payment of an entrance fee in excess of $100 and the payment of regular periodic charges for the care provided.\n\"Life care\" means \"continuing care\" as defined in subdivision 2.\n[Repealed, 1981 c 135 s 14]\n\"Entrance fee\" means the total of any initial or deferred transfer to or for the benefit of a provider of a sum of money or other property made or promised to be made as full or partial consideration for acceptance or maintenance of a specified individual as a resident in a facility.\n\"Facility\" means the place in which a person undertakes to provide continuing care to an individual.\n\"Living unit\" means a room, apartment, cottage or other area within a facility set aside for the exclusive use or control of one or more identified individuals.\n\"Provider\" means a person undertaking to provide continuing care in a facility.\n\"Resident\" means an individual entitled to receive continuing care in a facility.\n\"Minimum deposit\" means a deposit equal to or greater than five percent of the entrance fee.\n\"Person\" means any individual, corporation, business trust, trust, partnership, unincorporated association, two or more of any of the foregoing having a joint or common interest or any legal or commercial entity.\n\"Affiliate of another person\" means any person directly or indirectly controlling, controlled by or under common control with such other person.\n\"Offer\" includes every inducement, solicitation or attempt to encourage a person to enter into a subscription or residency agreement.",
	"repealed": false
}