{
	"id": "260C.619",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.619",
	"title": "260C.619 COMMUNICATION AND CONTACT AGREEMENTS.",
	"text": "(a) An adopting parent and a relative or foster parent of the child may enter into an agreement regarding communication with or contact between the adopted child, adopting parent, and the relative or foster parent. An agreement may be entered between:\n(1) an adopting parent and a birth parent;\n(2) an adopting parent and any relative or foster parent with whom the child resided before being adopted; and\n(3) an adopting parent and the parent or legal custodian of a sibling of the child, if the sibling is a minor, or any adult sibling of the child.\n(b) An agreement regarding communication with or contact between the child, adoptive parents, and a relative or foster parent, is enforceable when the terms of the agreement are contained in a written court order. The order must be issued before or at the time of the granting of the decree of adoption. The order granting the communication, contact, or visitation shall be filed in the adoption file.\n(c) The court shall mail a certified copy of the order to the parties to the agreement or their representatives at the addresses provided by the parties to the agreement. Service shall be completed in a manner that maintains the confidentiality of confidential information.\n(d) The court shall not enter a proposed order unless the terms of the order have been approved in writing by the prospective adoptive parents, the birth relative, the foster parent, or the birth parent or legal custodian of the child's sibling who desires to be a party to the agreement, and the responsible social services agency.\n(e) An agreement under this section need not disclose the identity of the parties to be legally enforceable and when the identity of the parties to the agreement is not disclosed, data about the identities in the adoption file shall remain confidential.\n(f) The court shall not enter a proposed order unless the court finds that the communication or contact between the minor adoptee, the adoptive parents, and the relative, foster parents, or siblings as agreed upon and contained in the proposed order, would be in the child's best interests.\n(g) Failure to comply with the terms of an order regarding communication or contact that has been entered by the court under this section is not grounds for:\n(1) setting aside an adoption decree; or\n(2) revocation of a written consent to an adoption after that consent has become irrevocable.\n(h) An order regarding communication or contact entered under this section may be enforced by filing a motion in the existing adoption file with the court that entered the contact agreement. Any party to the communication or contact order or the child who is the subject of the order has standing to file the motion to enforce the order. The prevailing party may be awarded reasonable attorney fees and costs.\n(i) The court shall not modify an order under this section unless it finds that the modification is necessary to serve the best interests of the child, and:\n(1) the modification is agreed to by the parties to the agreement; or\n(2) exceptional circumstances have arisen since the order was entered that justified modification of the order.",
	"repealed": false
}