{
	"id": "17.118",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.118",
	"title": "17.118 LIVESTOCK INVESTMENT GRANT PROGRAM.",
	"text": "The commissioner may award a livestock investment grant to a person who raises livestock in this state equal to ten percent of the first $500,000 of qualifying expenditures, provided the person makes qualifying expenditures of at least $4,000. The commissioner may award multiple livestock investment grants to a person over the life of the program and shall give preference to applicants who have not previously received a grant under this section.\n(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Livestock\" means beef cattle, dairy cattle, swine, poultry, goats, mules, farmed Cervidae, Ratitae, bison, sheep, horses, and llamas.\n(c) \"Qualifying expenditures\" means the amount spent for:\n(1) the acquisition, construction, or improvement of buildings or facilities for the production of livestock or livestock products;\n(2) the development of pasture for use by livestock including, but not limited to, the acquisition, development, or improvement of:\n(i) lanes used by livestock that connect pastures to a central location;\n(ii) watering systems for livestock on pasture including water lines, booster pumps, and well installations;\n(iii) livestock stream crossing stabilization; and\n(iv) fences; or\n(3) the acquisition of equipment for livestock housing, confinement, feeding, and waste management including, but not limited to, the following:\n(i) freestall barns;\n(ii) watering facilities;\n(iii) feed storage and handling equipment;\n(iv) milking parlors;\n(v) robotic equipment;\n(vi) scales;\n(vii) milk storage and cooling facilities;\n(viii) bulk tanks;\n(ix) computer hardware and software and associated equipment used to monitor the productivity and feeding of livestock;\n(x) manure pumping and storage facilities;\n(xi) swine farrowing facilities;\n(xii) swine and cattle finishing barns;\n(xiii) calving facilities;\n(xiv) digesters;\n(xv) equipment used to produce energy;\n(xvi) on-farm processing facilities equipment;\n(xvii) fences, including but not limited to farmed Cervidae perimeter fences required under section 35.155, subdivision 4; and\n(xviii) livestock pens and corrals and sorting, restraining, and loading chutes.\nExcept for qualifying pasture development expenditures under clause (2), qualifying expenditures only include amounts that are allowed to be capitalized and deducted under either section 167 or 179 of the Internal Revenue Code in computing federal taxable income. Qualifying expenditures do not include an amount paid to refinance existing debt.\nTo be eligible for a livestock investment grant, a person must:\n(1) be a resident of Minnesota or an entity specifically defined in section 500.24, subdivision 2, that is eligible to own farmland and operate a farm in this state under section 500.24;\n(2) be the principal operator of the farm;\n(3) hold a feedlot registration, if required; and\n(4) apply to the commissioner on forms prescribed by the commissioner including a statement of the qualifying expenditures made during the qualifying period along with any proof or other documentation the commissioner may require.\nThe commissioner, in consultation with the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over agriculture finance, shall develop competitive eligibility criteria and may allocate grants on a needs basis. The commissioner shall place any eligible unfunded applications on a waiting list and, notwithstanding subdivision 2, paragraph (d), give them consideration during the next fiscal year in which program funding is available. The commissioner shall notify in writing any applicant who applies for a grant and is ineligible under the provisions of this section as well as any applicant whose application is received or reviewed after the fiscal year funding limit has been reached.",
	"repealed": false
}