{
	"id": "60A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.08",
	"title": "60A.08 CONTRACTS OF INSURANCE.",
	"text": "A statement in full of the conditions of insurance shall be incorporated in or attached to every policy, and neither the application of the insured nor the bylaws of the company shall be considered as a warranty or a part of the contract, except in so far as they are so incorporated or attached.\nEvery company, domestic or foreign, shall conduct its business, display all signs and advertisements, and issue all policies, circulars, and other documents and publications in this state, in its own corporate name, and every foreign company shall state conspicuously upon a sign at each agency the state or country of its organization. When a company publishes its assets, it shall in the same connection, and with equal conspicuousness, publish its liabilities, computed on the basis allowed for its annual statements; and any publication purporting to show its capital shall state only the amount thereof which has been actually paid in cash.\nAny insurance policy terminating by its provisions at a specified expiration date or limited as to term by any statute and not otherwise renewable may be renewed or extended at the option of the insurer, at the premium rate then required therefor, for a specific additional period or periods by a certificate, and without requiring the issuance of a new policy. The insurer must also post the current policy form on its website, or must inform the policyholder annually in writing that a copy of the current policy form is available on request.\nAll contracts of insurance on property, lives, or interests in this state, shall be deemed to be made in this state.\nIt shall be unlawful for any person, firm, or corporation to solicit or make, or aid in soliciting or making, any contract of insurance not authorized by the laws of this state.\nAll insurance policies shall be signed by the secretary or an assistant secretary, and by the president or vice-president, or in their absence, by two directors of the insurer. The signatures may be facsimile signatures.\nEvery bond or policy of insurance issued in this state insuring against either actual loss suffered by the insured, and imposed by law for damages on account of personal injury, death, or injury to property caused by accident, or legal liability imposed upon the insured by reason of such injuries or death, shall, notwithstanding anything in the policy to the contrary, be deemed to contain the following condition:\nThe bankruptcy, insolvency, or dissolution of the insured shall not relieve the insurer of any of its obligations under this policy, and in case an execution against the insured on a final judgment is returned unsatisfied, then such judgment creditor shall have a right of action on this policy against the company to the same extent that the insured would have, had the insured paid the final judgment.\nWhen a judgment has been rendered by any court in this state against any company holding the commissioner's certificate, and an execution issued thereon has been returned unsatisfied, in whole or in part, and a certified transcript of the docket entry and the court administrator's certificate of those facts is filed with the commissioner, the commissioner shall forthwith revoke its certificate and give one week's published notice thereof. No new certificate shall issue until such judgment has been fully satisfied and proof thereof filed with the commissioner, and the expenses and fees incurred are paid. During this revocation neither the company, nor any of its officers or agents, shall issue any new policy, take any risk, or transact any business, except such as is absolutely necessary in closing up its affairs in this state.\nAny insurance company licensed to do business in this state which issues policies of insurance in this state upon which the premium is determined by means of an audit shall within 60 days from the date of the expiration of any insurance policy so issued request from the insured a statement of the facts and figures necessary to determine the premium thereon. The insured shall furnish such statement of facts and figures within 60 days of the date of the request. Upon failure of the insured to comply within the time specified, then the provisions of this subdivision shall not apply as to such insured. Within 12 months from the date of the expiration of the policy, or within such longer time as the commissioner of commerce may for cause shown direct, the insurer unless it elects to accept the insured's statement shall make a final audit. Failure to make such final audit within the time herein provided shall constitute a waiver of the insurer's right to make such audit and an election to accept the statement furnished by the insured as a basis for determining the premium on such policy. In the event an audit discloses that the insured submitted to the insurer a fraudulent statement of facts and figures, then the insured shall be liable for three times the normal premium. This subdivision shall not apply to policies issued covering workers' compensation.\nNo oral or written misrepresentation made by the assured, or in the assured's behalf, in the negotiation of insurance, shall be deemed material, or defeat or avoid the policy, or prevent its attaching, unless made with intent to deceive and defraud, or unless the matter misrepresented increases the risk of loss.\nThis subdivision shall not apply to life insurance or accident and health insurance.\nNo contract of insurance written pursuant to the authority to transact the kind of business enumerated in section 60A.06, subdivision 1, clause (15) shall include any provision interfering with the attorney-client relationship.\nNo misrepresentation or omission made in an application or negotiation for any policy providing directors and officers liability coverage for directors or officers of a corporation shall defeat or avoid coverage or prevent the policy from attaching for a director or officer unless the director or officer has signed the application and has actual knowledge of the facts misrepresented or omitted. The application shall be attached to and incorporated into the contract. This subdivision applies with respect to all policies governed by this chapter or issued or renewed in this state.\nAll commercial automobile liability policies must provide coverage for rented vehicles as required in chapter 65B.\nThis coverage can be excess over any and all specific motor vehicle coverage that is applicable.\n(a) No insurer shall issue or renew a policy of liability insurance in this state that reduces the limits of liability stated in the policy by the costs of legal defense.\n(b) This subdivision does not apply to:\n(1) professional liability insurance with annual aggregate limits of liability of at least $100,000, including directors' and officers' and errors and omissions liability insurance;\n(2) environmental impairment liability insurance;\n(3) insurance policies issued to large commercial risks; or\n(4) coverages that the commissioner determines to be appropriate which will be published in the manner prescribed for surplus lines insurance in section 60A.201, subdivision 4.\n(c) For purposes of this subdivision, \"large commercial risks\" means an insured whose gross annual revenues in the fiscal year preceding issuance of the policy were at least $10,000,000.\n(a) If the insurer has knowledge of any claims against the insured that would remain unsatisfied due to the financial condition of the insured, the insurer and the insured may not agree to:\n(1) rescind the policy; or\n(2) directly or indirectly transfer to, or release to, the insurer the insured's claim or potential claim against the insurer based upon the insurer's refusal to settle a claim against the insured.\n(b) Before entering into an agreement described in paragraph (a), an insurer must make a good faith effort to ascertain: (1) the existence and identity of all claims against the policy; and (2) the financial condition of the insured.\n(c) The insured must provide reasonable financial information upon request of the insurer.\n(d) An agreement made in violation of this section is void and unenforceable.\n(a) All forms, rates, and related information filed with the commissioner under section 61A.02 shall be nonpublic data until the filing becomes effective.\n(b) All forms, rates, and related information filed with the commissioner under section 62A.02 shall be nonpublic data until the filing becomes effective.\n(c) All forms, rates, and related information filed with the commissioner under section 62C.14, subdivision 10, shall be nonpublic data until the filing becomes effective.\n(d) All forms, rates, and related information filed with the commissioner under section 70A.06 shall be nonpublic data until the filing becomes effective.\n(e) All forms, rates, and related information filed with the commissioner under section 79.56 shall be nonpublic data until the filing becomes effective.\n(f) All forms, rates, and related information filed with the commissioner under section 65A.298 are nonpublic data until the filing becomes effective.\n(g) Notwithstanding paragraphs (b) and (c), for all rate increases subject to review under section 2794 of the Public Health Services Act and any amendments to, or regulations, or guidance issued under the act that are filed with the commissioner on or after September 1, 2011, the commissioner:\n(1) may acknowledge receipt of the information;\n(2) may acknowledge that the corresponding rate filing is pending review;\n(3) must provide public access from the Department of Commerce's website to parts I and II of the Preliminary Justifications of the rate increases subject to review; and\n(4) must provide notice to the public on the Department of Commerce's website of the review of the proposed rate, which must include a statement that the public has 30 calendar days to submit written comments to the commissioner on the rate filing subject to review.\n(h) Notwithstanding paragraphs (b) and (c), for all proposed premium rates filed with the commissioner for individual health plans, as defined in section 62A.011, subdivision 4, and small group health plans, as defined in section 62K.03, subdivision 12, the commissioner must provide public access on the Department of Commerce's website to compiled data of the proposed changes to rates, separated by health plan and geographic rating area, within ten business days after the deadline by which health carriers, as defined in section 62A.011, subdivision 2, must submit proposed rates to the commissioner for approval.\n(a) Insurance policies, endorsements, riders, and any explanatory or advertising material may be issued in a language other than English. In the event of a dispute or complaint regarding the insurance or advertising material, the English language version of the insurance coverage shall control the resolution of the dispute or complaint. Any insurance policy, endorsement, rider, or advertising material required by law to be filed with the commissioner that is prepared in a language other than English must be accompanied by an English language translation certifying that the English version is substantively identical to the filed version.\n(b) This subdivision does not limit the application of chapter 72A.",
	"repealed": false
}