{
	"id": "216A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/216A.03",
	"title": "216A.03 PUBLIC UTILITIES COMMISSION.",
	"text": "The Public Utilities Commission shall consist of five members. The terms of members shall be six years and until their successors have been appointed and qualified. Each commissioner shall be appointed by the governor by and with the advice and consent of the senate. Not more than three commissioners shall belong to the same political party. At least one commissioner must have been domiciled at the time of appointment outside the seven-county metropolitan area. If the membership of the commission after July 31, 1986, does not consist of at least one member domiciled at the time of appointment outside the seven-county metropolitan area, the membership shall conform to this requirement following normal attrition of the present commissioners. The governor when selecting commissioners shall give consideration to persons learned in the law or persons who have engaged in the profession of engineering, public accounting, property and utility valuation, finance, physical or natural sciences, production agriculture, or natural resources as well as being representative of the general public.\nFor purposes of this subdivision, \"seven-county metropolitan area\" means Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington Counties.\nThe removal of members, and filling of vacancies on the commission shall be as provided in section 15.0575.\n[Repealed, 1976 c 134 s 79]\nThe governor shall select one of the commissioners to serve as the chair for a term concurrent with that of the governor.\nIf a vacancy occurs in the position of chair, the governor shall select a new chair to complete the unexpired term.\nThe chair shall be the principal executive officer of the commission and shall preside at meetings of the commission. The chair shall organize the work of the commission and may make assignments to commission members, appoint committees and give direction to the commission staff through the executive secretary subject to the approval of the commission.\nBefore entering upon the duties of office, each commissioner shall take and file with the secretary of state the following oath:\n\"I do solemnly swear that I will support the Constitution of the United States, the constitution of this state; that I will faithfully discharge my duties as commissioner of the Public Utilities Commission according to the best of my ability; and that I am not in the employ of or holding any official relation to or pecuniarily interested in any individual proprietorship, firm, copartnership, corporation or association, the activities of which are wholly or partially subject to regulation by the Public Utilities Commission; nor do I serve on or under any committee of any political party.\"\nA majority of the commission shall constitute a quorum, and the act or decision of a majority of commissioners present, if at least a quorum is present, shall be the act or decision of the commission. If a vacancy exists on the commission a majority of the remaining commissioners constitutes a quorum.\nAn audio magnetic or audio electronic recording device shall be used to keep a record of all proceedings before the commission.\nThe commission may delegate to the executive secretary authority to require hearing reporter services. The cost of hearing reporter services must be borne by the utility, telephone company, or telecommunications carrier that is the subject of the proceeding. If more than one company is the subject of a proceeding, the commission or, if the commission so delegates, the executive secretary, shall determine how the hearing reporter costs are to be allocated for the proceeding.\nA filing with the commission may be deemed approved by the commission after 60 days of filing, unless the commission, a commissioner, or any other person requests the filing be set aside for action by the commission. The commission may designate, by standing order, categories or types of filings that are eligible for approval under this subdivision. Complaint filings, petitions for rulemakings, or petitions to increase rates are not eligible for designation. The commission must publish a weekly notice of the filings that are approved without other action by the commission, and shall issue a written order approving the filing upon passage of the 60-day term. Orders approved under this subdivision are subject to reconsideration, as provided in section 216B.27 or the commission's rules of practice and procedure, and nothing in this subdivision affects the rights of any entity under section 216B.17 or 237.081.\n(a) The commission may create and appoint members to standing or ad hoc subcommittees of the commission consisting of at least one commissioner. The commission, at a regularly scheduled agenda hearing, may delegate any of the commission's legislative, administrative, or quasi-judicial functions, as defined in section 216A.02, to a subcommittee of the commission.\n(b) Upon objection by a party, a participant, or a commissioner, a decision by a subcommittee must be referred to the full commission. Subcommittee decisions for which no objection is filed with the commission within ten days from the date of receipt of the written decision of the subcommittee are deemed decisions of the full commission. If referred to the full commission, the full commission may rely on the record developed by the subcommittee but shall treat the subcommittee decision as advisory.\n(c) In either their initial or reply filings with the commission, a party or a participant may request that the commission not delegate the proceeding to a commission subcommittee. The request must be granted.\n(d) For the purposes of this subdivision:\n(1) a \"party\" means a person by or against whom a proceeding before the commission is commenced or a person permitted to intervene in a proceeding under this chapter; and\n(2) a \"participant\" means a person who files comments or appears to present views without becoming a party in a proceeding, other than public hearings held in contested cases and other commission proceedings conducted to receive general public comments.\nThe commission may designate a commissioner to be the lead commissioner for a docket, a type of docket, or for a particular subject area. The commission shall allow interested persons to be heard on a proposed designation prior to making the designation. The lead commissioner is authorized to exercise the commission's authority to develop an evidentiary record for a proceeding, including holding hearings and requesting written or oral comments. At the request of the commission, the lead commissioner shall provide the commission and the service list for the proceeding with a written summary of the evidentiary record developed by the lead commissioner for the case, including any recommendations of the commissioner. Any findings of fact, conclusions of law, or recommendations of the lead commissioner are advisory only and are not binding on the commission. The commission may delegate its authority to designate lead commissioners to the chair. Nothing in this subdivision affects a person's opportunity to request a contested case proceeding under chapter 14.",
	"repealed": false
}