{
	"id": "21.1195",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.1195",
	"title": "21.1195 MINIMUM STANDARDS FOR PLANTING.",
	"text": "Seed potatoes may not be planted in the state in lots of ten or more acres unless the seed meets the minimum disease standards prescribed by the commissioner. Seed potatoes may meet the standards by being certified in accordance with this chapter and rules adopted by the commissioner, or under the certification program of another state or province which, in the judgment of the commissioner, provides equivalent assurances of seed potato quality. Seed potatoes may be planted without certification if they have had at least field inspection as required for certified seed potatoes, have passed the field inspection standards of disease tolerance, and are free from ring rot. A person that plants seed potatoes in violation of this section is subject to a civil penalty of $20 per acre for each acre or part of an acre planted in violation of this section. Failure to maintain complete and accurate records in accordance with this section or rules adopted by the commissioner is an additional violation resulting in a separate civil penalty of $200 for each failure.\nIf there is not available to be planted in this state, in any year, a sufficient volume of potato seed meeting certified seed potato disease standards, in any or all varieties, the commissioner may, upon application by one or more growers, permit seed that does not comply with this section to be planted for that growing season if the seed does not pose a serious disease threat.\nEach grower shall keep records of each lot of seed potatoes planted. For each growing season, the records must include, by field, the variety and source of the seed potatoes. Each grower shall file records as prescribed by the commissioner. All records must be made available for inspection by the commissioner or the commissioner's agents during normal business hours.\nIn addition to the enforcement powers and penalties in this section, the commissioner may issue a subpoena to a grower in order to compel delivery of records which are required under this section. These subpoenas are enforceable by any court of competent jurisdiction.",
	"repealed": false
}