{
	"id": "142B.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.54",
	"title": "142B.54 REQUIREMENTS; MALTREATMENT OF MINORS OR VULNERABLE ADULTS.",
	"text": "Except for family child care settings and foster care for children in the license holder's residence, license holders serving children shall:\n(1) establish and maintain policies and procedures to ensure that an internal review is completed within 30 calendar days and that corrective action is taken if necessary to protect the health and safety of children in care when the facility has reason to know that an internal or external report of alleged or suspected maltreatment has been made. The review must include an evaluation of whether:\n(i) related policies and procedures were followed;\n(ii) the policies and procedures were adequate;\n(iii) there is a need for additional staff training;\n(iv) the reported event is similar to past events with the children or the services involved; and\n(v) there is a need for corrective action by the license holder to protect the health and safety of children in care.\nBased on the results of this review, the license holder must develop, document, and implement a corrective action plan designed to correct current lapses and prevent future lapses in performance by individuals or the license holder, if any;\n(2) identify the primary and secondary person or position who will ensure that, when required, internal reviews are completed. The secondary person shall be involved when there is reason to believe that the primary person was involved in the alleged or suspected maltreatment; and\n(3) document and make internal reviews accessible to the commissioner immediately upon the commissioner's request. For the purposes of this section, the documentation provided to the commissioner by the license holder may consist of a completed checklist that verifies completion of each of the requirements of the review.\n(a) Child care centers licensed under this chapter and Minnesota Rules, chapter 9503, must develop a risk reduction plan that identifies the general risks to children served by the child care center. The license holder must establish procedures to minimize identified risks, train staff on the procedures, and annually review the procedures.\n(b) The risk reduction plan must include an assessment of risk to children the center serves or intends to serve and identify specific risks based on the outcome of the assessment. The assessment of risk must be based on the following:\n(1) an assessment of the risks presented by the physical plant where the licensed services are provided, including an evaluation of the following factors: the condition and design of the facility and its outdoor space, bathrooms, storage areas, and accessibility of medications and cleaning products that are harmful to children when children are not supervised and the existence of areas that are difficult to supervise; and\n(2) an assessment of the risks presented by the environment for each facility and for each site, including an evaluation of the following factors: the type of grounds and terrain surrounding the building and the proximity to hazards, busy roads, and publicly accessed businesses.\n(c) The risk reduction plan must include a statement of measures that will be taken to minimize the risk of harm presented to children for each risk identified in the assessment required under paragraph (b) related to the physical plant and environment. At a minimum, the stated measures must include the development and implementation of specific policies and procedures or reference to existing policies and procedures that minimize the risks identified.\n(d) In addition to any program-specific risks identified in paragraph (b), the plan must include development and implementation of specific policies and procedures or refer to existing policies and procedures that minimize the risk of harm or injury to children, including:\n(1) closing children's fingers in doors, including cabinet doors;\n(2) leaving children in the community without supervision;\n(3) children leaving the facility without supervision;\n(4) caregiver dislocation of children's elbows;\n(5) burns from hot food or beverages, whether served to children or being consumed by caregivers, and the devices used to warm food and beverages;\n(6) injuries from equipment, such as scissors and glue guns;\n(7) sunburn;\n(8) feeding children foods to which they are allergic;\n(9) children falling from changing tables; and\n(10) children accessing dangerous items or chemicals or coming into contact with residue from harmful cleaning products.\n(e) The plan shall prohibit the accessibility of hazardous items to children.\n(f) The plan must include specific policies and procedures to ensure adequate supervision of children at all times as defined under section 142B.01, subdivision 27, with particular emphasis on:\n(1) times when children are transitioned from one area within the facility to another;\n(2) nap-time supervision, including infant crib rooms as specified under section 142B.01, subdivision 27, which requires that when an infant is placed in a crib to sleep, supervision occurs when a staff person is within sight or hearing of the infant. When supervision of a crib room is provided by sight or hearing, the center must have a plan to address the other supervision components;\n(3) child drop-off and pick-up times;\n(4) supervision during outdoor play and on community activities, including but not limited to field trips and neighborhood walks;\n(5) supervision of children in hallways;\n(6) supervision of school-age children when using the restroom and visiting the child's personal storage space; and\n(7) supervision of preschool children when using an individual, private restroom within the classroom.\nThe license holder must review the risk reduction plan each calendar year and document the review. When conducting the review, the license holder must consider incidents that have occurred in the center since the last review, including:\n(1) the assessment factors in the plan;\n(2) the internal reviews conducted under this section, if any;\n(3) substantiated maltreatment findings, if any; and\n(4) incidents that caused injury or harm to a child, if any, that occurred since the last review.\nFollowing any change to the risk reduction plan, the license holder must inform staff persons, under the control of the license holder, of the changes in the risk reduction plan, and document that the staff were informed of the changes.\n(a) In addition to the orientation training required by the applicable licensing rules and statutes, private child-placing agency license holders must provide a training annually on the maltreatment of minors reporting requirements and definitions in chapter 260E to each mandatory reporter, as described in section 260E.06, subdivision 1.\n(b) In addition to the orientation training required by the applicable licensing rules and statutes, all family child foster care license holders and caregivers who are mandatory reporters as described in section 260E.06, subdivision 1, must complete training each year on the maltreatment of minors reporting requirements and definitions in chapter 260E.\nLicense holders serving vulnerable adults are subject to the requirements of section 245A.65.",
	"repealed": false
}