{
	"id": "144.1205",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1205",
	"title": "144.1205 RADIOACTIVE MATERIAL; SPECIAL NUCLEAR MATERIAL.",
	"text": "When a license is required for radioactive material or source or special nuclear material by a rule adopted under section 144.1202, subdivision 2, an application fee according to subdivision 4 must be paid upon initial application for a license. The licensee must renew the license 60 days before the expiration date of the license. The expiration date of a license is the date specified by rule of the commissioner of health.\n(a) A licensee must pay an initial fee that is equivalent to the annual fee upon issuance of the initial license.\n(b) A licensee must pay an annual fee at least 60 days before the anniversary date of the issuance of the license. The annual fee is as follows:\n(a) Fee categories under this section are equivalent to the licensing categories used by the United States Nuclear Regulatory Commission under Code of Federal Regulations, title 10, parts 30 to 36, 39, 40, 70, 71, and 150, except as provided in paragraph (b).\n(b) The category of \"Academic, small\" is the type of license required for the use of radioactive materials in a teaching institution. Radioactive materials are limited to ten radionuclides not to exceed a total activity amount of one curie.\nA licensee must pay an initial and a renewal application fee according to this subdivision.\nAn annual fee or a license renewal fee submitted to the commissioner after the due date specified by rule must be accompanied by an additional amount equal to 25 percent of the fee due.\nThe commissioner of health shall make periodic safety inspections of the radioactive material and source and special nuclear material of a licensee. The commissioner shall prescribe the frequency of safety inspections by rule.\nIf the commissioner finds serious violations of public health standards during an inspection under subdivision 6, the licensee must pay all costs associated with subsequent reinspection of the source. The costs shall be the actual costs incurred by the commissioner and include, but are not limited to, labor, transportation, per diem, materials, legal fees, testing, and monitoring costs.\nA licensee submitting an application for reciprocal recognition of a materials license issued by another agreement state or the United States Nuclear Regulatory Commission for a period of 180 days or less during a calendar year must pay $2,400. For a period of 181 days or more, the licensee must obtain a license under subdivision 4.\nA licensee must pay a fee of $600 to amend a license as follows:\n(1) to amend a license requiring review including, but not limited to, addition of isotopes, procedure changes, new authorized users, or a new radiation safety officer; or\n(2) to amend a license requiring review and a site visit including, but not limited to, facility move or addition of processes.\nA person required to register generally licensed devices according to Minnesota Rules, part 4731.3215, must pay an annual registration fee of $450.",
	"repealed": false
}