{
	"id": "52.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.06",
	"title": "52.06 SUPERVISION; REPORTS; AUDITS; FEES.",
	"text": "Credit unions shall be under the supervision of the commissioner of commerce. Each credit union shall annually, on or before January 25, file a report with the commissioner of commerce on forms supplied by the commissioner for that purpose giving such relevant information as the commissioner may require concerning the operations during the preceding calendar year. Additional reports may be required. Credit unions shall be examined, at least once every 24 calendar months, by the commissioner of commerce. Further, in lieu of this examination the commissioner may accept any examination made by the National Credit Union Administration, provided a copy of the examination is furnished to the commissioner. A report of the examination by the commissioner of commerce shall be forwarded to the president, or the chair of the board if the position is so designated pursuant to section 52.09, subdivision 4, of the examined credit union within 60 days after completion of the examination. Within 60 days of the receipt of such report, a general meeting of the directors and committees shall be called to consider matters contained in the report. For failure to file reports when due, unless excused for cause, the credit union shall pay to the commissioner of management and budget $5 for each day of its delinquency.\nWhenever it shall appear to the commissioner of commerce that any credit union operating in this state does not keep books and accounts in such manner as to enable the commissioner to readily ascertain the true condition of such credit union, the commissioner may require the officers of such credit union or any of them to open and keep such books or accounts as the commissioner may determine and prescribe for the purpose of keeping accurate and convenient records of the transactions and accounts of such credit union. Credit union books and records must be maintained in one location and be available for examination sometime between the hours of 8:00 a.m. and 5:00 p.m. weekdays. Any credit union failing to produce the books and records when requested shall be charged for such attempted examination by the examiner on the basis outlined in section 46.131 and a like charge shall be assessed for each and every attempt made by the examiner to obtain the books and records. Prepaid expenses may be treated as an asset account in accordance with sound accounting procedures.",
	"repealed": false
}