{
	"id": "13.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.202",
	"title": "13.202 POLITICAL SUBDIVISION DATA CODED ELSEWHERE.",
	"text": "The sections referenced in subdivisions 2 to 12 are codified outside this chapter. Those sections classify political subdivision data as other than public, place restrictions on access to government data, or involve data sharing.\nCertain data in an application for property tax abatement are classified under section 375.192, subdivision 2.\n(a) Data collected by the Hennepin Healthcare System, Inc. are governed under section 383B.917, subdivision 1.\n(b) Records of Hennepin County board meetings permitted to be closed under section 383B.217, subdivision 7, are classified under that subdivision.\nCertain data collected or created in the course of a coroner's or medical examiner's inquest are classified under sections 390.11, subdivision 7, and 390.32, subdivision 6.\nData obtained in an audit of a solid waste collector under section 400.08, subdivision 4, are classified under that subdivision.\nPublic utility data and names, addresses, and telephone numbers provided to a 911 system under section 403.07, subdivisions 3 and 4, are classified under those subdivisions.\nFinancial information received or prepared by a Public Facilities Authority is classified under section 446A.04, subdivision 18.\n[Repealed, 2002 c 220 art 10 s 40]\n(a) Self-insurer claims. Disclosure of information about individual claims filed by the employees of a municipality which is a self-insurer is governed by section 471.617, subdivision 5.\n(b) Meetings of governing bodies. Treatment of data discussed at meetings of governing bodies is governed by section 13D.05.\n(c) Job evaluation system reports. Treatment of reports containing the results of job evaluation systems is governed by section 471.995.\n(d) Pay equity compliance. Implementation reports of equitable compensation plans are classified by section 471.9981, subdivision 5b.\n[Repealed, 2014 c 258 s 4]\n(a) Affirmative action plans. Treatment of data relating to metropolitan agency affirmative action plans is governed by section 473.143, subdivisions 5 and 7.\n(b) Contracts for management services. Data relating to compensation of personnel who work under a management service contract are classified by section 473.405, subdivision 12.\n(c) Arena acquisition. Certain data in connection with a decision whether to acquire a sports arena are classified under section 473.598, subdivision 4.\n(d) Airports commission. Certain airline data submitted to the Metropolitan Airports Commission in connection with the issuance of revenue bonds are classified under section 473.6671, subdivision 3.\n(e) Solid waste landfill fee. Information obtained from the operator of a mixed municipal solid waste disposal facility under section 473.843 is classified under section 473.843, subdivision 4.\n(f) Metropolitan airport parking customers. Data relating to applicants for or users of automated parking facilities at the Minneapolis-St. Paul International Airport are classified under section 473.685.\nInformation contained in a register with respect to the ownership of certain municipal obligations is classified under section 475.55, subdivision 6.",
	"repealed": false
}