{
	"id": "142G.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.77",
	"title": "142G.77 INDIAN TRIBE MFIP EMPLOYMENT SERVICES.",
	"text": "The commissioner may enter into agreements with federally recognized Indian tribes with a reservation in the state to provide MFIP employment services to members of the Indian tribe and to other caregivers who are a part of the tribal member's MFIP assistance unit. For purposes of this section, \"Indian tribe\" means a tribe, band, nation, or other federally recognized group or community of Indians. The commissioner may also enter into an agreement with a consortium of Indian tribes providing the governing body of each Indian tribe in the consortium complies with the provisions of this section.\nThe Indian tribe must:\n(1) agree to fulfill the responsibilities provided under the employment services component of MFIP regarding operation of MFIP employment services, as designated by the commissioner;\n(2) operate its employment services program within a geographic service area not to exceed the counties within which a border of the reservation falls;\n(3) operate its program in conformity with section 13.46 and any applicable federal regulations in the use of data about MFIP recipients;\n(4) coordinate operation of its program with the county agency, Workforce Investment Act programs, and other support services or employment-related programs in the counties in which the tribal unit's program operates;\n(5) provide financial and program participant activity record keeping and reporting in the manner and using the forms and procedures specified by the commissioner and permit inspection of its program and records by representatives of the state; and\n(6) have the Indian tribe's employment service provider certified by the commissioner of employment and economic development, or approved by the county.\nIf the commissioner and an Indian tribe are parties to an agreement under this subdivision, the agreement shall annually provide to the Indian tribe the funding allocated in section 142G.76.\nIndian tribal members receiving MFIP benefits and residing in the service area of an Indian tribe operating employment services under an agreement with the commissioner must be referred by county agencies in the service area to the Indian tribe for employment services.",
	"repealed": false
}