{
	"id": "6.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.91",
	"title": "6.91 LOCAL PERFORMANCE MEASUREMENT AND REPORTING.",
	"text": "(a) A county or city that elects to participate in the standard measures program must report its results to its citizens annually through publication, direct mailing, posting on the jurisdiction's website, or through a public hearing at which the budget and levy will be discussed and public input allowed.\n(b) Each year, jurisdictions participating in the local performance measurement and improvement program must file a report with the state auditor by July 1, in a form prescribed by the auditor. All reports must include a declaration that the jurisdiction has complied with, or will have complied with by the end of the year, the requirement in paragraph (a). For jurisdictions participating in the standard measures program, the report shall consist of the jurisdiction's results for the standard set of performance measures under section 6.90, subdivision 2, paragraph (a). In 2012, jurisdictions participating in the comprehensive performance measurement program must submit a resolution approved by its local governing body indicating that it either has implemented or is in the process of implementing a local performance measurement system that meets the minimum standards specified by the council under section 6.90, subdivision 2, paragraph (b). In 2013 and thereafter, jurisdictions participating in the comprehensive performance measurement program must submit a statement approved by its local governing body affirming that it has implemented a local performance measurement system that meets the minimum standards specified by the council under section 6.90, subdivision 2, paragraph (b).\n(a) A county or city that elects to participate in the standard measures program for 2011 is: (1) eligible for per capita reimbursement of $0.14 per capita, but not to exceed $25,000 for any government entity; and (2) exempt from levy limits under sections 275.70 to 275.74 for taxes payable in 2012, if levy limits are in effect.\n(b) Any county or city that elects to participate in the standard measures program for 2012 is eligible for per capita reimbursement of $0.14 per capita, but not to exceed $25,000 for any government entity. Any jurisdiction participating in the comprehensive performance measurement program is exempt from levy limits under sections 275.70 to 275.74 for taxes payable in 2013 if levy limits are in effect.\n(c) Any county or city that elects to participate in the standard measures program for 2013 or any year thereafter is eligible for per capita reimbursement of $0.14 per capita, but not to exceed $25,000 for any government entity. Any jurisdiction participating in the comprehensive performance measurement program for 2013 or any year thereafter is exempt from levy limits under sections 275.70 to 275.74 for taxes payable in the following year, if levy limits are in effect.\n(a) The state auditor shall certify to the commissioner of revenue by August 1 of each year the counties and cities that are participating in the standard measures program and the comprehensive performance measurement program.\n(b) The commissioner of revenue shall make per capita aid payments under this section on the second payment date specified in section 477A.015, in the same year that the measurements were reported.\n(c) The commissioner of revenue shall notify each county and city that is entitled to exemption from levy limits by August 10 of each levy year.\nThe amount necessary to fund obligations under subdivision 2 is annually appropriated from the general fund to the commissioner of revenue.",
	"repealed": false
}