{
	"id": "148.5181",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5181",
	"title": "148.5181 LICENSURE; SPEECH-LANGUAGE PATHOLOGY ASSISTANTS.",
	"text": "Except as provided in subdivisions 3 and 4, an applicant for licensure as a speech-language pathology assistant must meet the requirements of this section.\n(a) To be eligible for speech-language pathology assistant licensure, an applicant must submit to the commissioner a transcript from an educational institution documenting satisfactory completion of either:\n(1) an associate's degree from a speech-language pathology assistant program that is accredited by the Higher Learning Commission of the North Central Association of Colleges or its equivalent as approved by the commissioner and that includes at least 100 hours of supervised field work experience in speech-language pathology assisting; or\n(2) a bachelor's degree in the discipline of communication sciences or disorders and a speech-language pathology assistant certificate program that includes:\n(i) coursework in an introduction to speech-language pathology assisting, adult communication disorders and treatment, speech sound disorders, and language disorders at a speech-language pathology assistant level; and\n(ii) at least 100 hours of supervised field work experience in speech-language pathology assisting.\n(b) Within one month following expiration of a license, an applicant for licensure renewal as a speech-language pathology assistant must provide, on a form provided by the commissioner, evidence to the commissioner of a minimum of 20 contact hours of continuing education obtained within the two years immediately preceding licensure expiration. A minimum of 13 contact hours of continuing education must be directly related to the licensee's area of licensure. Seven contact hours of continuing education may be in areas generally related to the licensee's area of licensure. Licensees who are issued licenses for a period of less than two years must prorate the number of contact hours required for licensure renewal based on the number of months licensed during the biennial licensure period. Licensees must receive contact hours for continuing education activities only for the biennial licensure period in which the continuing education activity was performed.\nThe commissioner shall issue a speech-language pathology assistant license to a person who holds a current speech-language pathology assistant license in another state if the following conditions are met:\n(1) payment of the commissioner's current fee for licensure; and\n(2) submission of evidence of licensure in good standing from another state that maintains a system and standard of examinations for speech-language pathology assistants that meets or exceeds the current requirements for licensure in Minnesota.",
	"repealed": false
}