{
	"id": "203B.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.24",
	"title": "203B.24 DUTIES OF ELECTION JUDGES.",
	"text": "Upon receipt of an absentee ballot returned as provided in sections 203B.16 to 203B.27, the election judges shall compare the voter's name with the names recorded under section 203B.19 in the statewide registration system to insure that the ballot is from a voter eligible to cast an absentee ballot under sections 203B.16 to 203B.27. The election judges shall mark the signature envelope \"Accepted\" and initial or sign the signature envelope below the word \"Accepted\" if the election judges are satisfied that:\n(1) the voter's name and address on the signature envelope appears in substantially the same form as on the application records provided to the election judges by the county auditor;\n(2) the voter has signed the federal oath prescribed pursuant to section 705(b)(2) of the Help America Vote Act, Public Law 107-252;\n(3) the voter has set forth the same voter's passport number, or Minnesota driver's license or state identification card number, or the last four digits of the voter's Social Security number as submitted on the application, if the voter has one of these documents;\n(4) the voter is not known to have died; and\n(5) the voter has not already voted at that election, either in person or by absentee ballot.\nIf the identification number described in clause (3) does not match the number as submitted on the application, the election judges must make a reasonable effort to satisfy themselves through other information provided by the applicant, or by an individual authorized to apply on behalf of the voter, that the ballots were returned by the same person to whom the ballots were transmitted.\nAn absentee ballot cast pursuant to sections 203B.16 to 203B.27 may only be rejected for the lack of one of clauses (1) to (5). In particular, failure to place the ballot within the ballot envelope before placing it in the signature envelope is not a reason to reject an absentee ballot.\nElection judges must note the reason for rejection on the back of the envelope in the space provided for that purpose.\nFailure to return unused ballots shall not invalidate a marked ballot, but a ballot shall not be counted if the certificate on the signature envelope is not properly executed. In all other respects the provisions of the Minnesota Election Law governing deposit and counting of ballots shall apply. Notwithstanding other provisions of this section, the counting of the absentee ballot of a deceased voter does not invalidate the election.\nThe election judges shall compare the voter's name with the names recorded under section 203B.19 in the statewide registration system. For each returned ballot, the election judges must indicate on the record in the statewide registration system whether the absentee ballot was accepted or rejected.",
	"repealed": false
}