{
	"id": "604A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.33",
	"title": "604A.33 REFERENCE CHECKS BY CERTAIN HEALTH CARE PROVIDERS AND FACILITIES.",
	"text": "This section applies to residential treatment programs for children or group homes for children licensed under chapter 245A, residential services and programs for juveniles licensed under section 241.021, providers licensed pursuant to sections 144A.01 to 144A.33 or sections 144A.43 to 144A.47, personal care provider organizations under section 256B.0659, providers of day training and habilitation services under sections 252.41 to 252.46, board and lodging facilities licensed under chapter 157, intermediate care facilities for persons with developmental disabilities, and other facilities licensed to provide residential services to persons with developmental disabilities.\n(a) No action may be brought against a provider or facility listed in subdivision 1 or a designated employee or agent of the provider or facility who discloses information regarding a former or current employee to a prospective employer as provided under this section. This subdivision does not preclude a charge or action under chapter 363A, or an action arising from a disclosure that is proved, by a preponderance of the evidence, was made fraudulently or with deliberate disregard as to its truth or falsity.\n(b) This subdivision does not preclude an action against a prospective employer for disclosing information received under this section.\n(a) Upon written request, a provider or facility listed in subdivision 1 or a designated employee or agent of the provider or facility may disclose in writing the following information about a current or former employee to a prospective employer:\n(1) dates of employment;\n(2) compensation and wage history;\n(3) job description and duties;\n(4) training and education provided by the employer; and\n(5) all acts of violence, theft, harassment, or illegal conduct by the employee documented in the personnel record which resulted in disciplinary action or resignation, and the employee's written response, if necessary, contained in the personnel record.\n(b) With the written authorization of the current or former employee, a provider or facility listed in subdivision 1 or a designated employee or agent of the provider or facility may also disclose the following information in writing to a prospective employer:\n(1) written employee evaluations conducted prior to the employee's separation from the employer and the employee's written response, if any, contained in the employee's personnel record;\n(2) disciplinary warnings and actions in the five years before the date of the authorization and the employee's written response, if any, contained in the employee's personnel record; and\n(3) reasons for separation from employment.\n(c) The provider, facility, designated employee, or agent must provide a written copy of a disclosure made under this subdivision and information on to whom the disclosure was made to the current or former employee upon request.",
	"repealed": false
}