{
	"id": "246.716",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.716",
	"title": "246.716 BLOOD SAMPLE COLLECTION FOR TESTING.",
	"text": "(a) If a blood sample is not otherwise available, the state-operated treatment program shall obtain consent from the patient before collecting a blood sample for testing for blood-borne pathogens. The consent process shall include informing the patient that the patient may refuse to provide a blood sample and that the patient's refusal may result in a request for a court order under subdivision 2 to require the patient to provide a blood sample.\n(b) If the patient consents to provide a blood sample, the state-operated treatment program shall collect a blood sample and ensure that the sample is tested for blood-borne pathogens.\n(c) The state-operated treatment program shall inform the employee's health care provider about the patient's test results without the patient's name or other uniquely identifying information. The state-operated treatment program shall inform the patient of the test results.\n(d) If the patient refuses to provide a blood sample for testing, the state-operated treatment program shall inform the employee of the patient's refusal.\n(a) A state-operated treatment program or an employee of a state-operated treatment program may bring a petition for a court order to require a patient to provide a blood sample for testing for blood-borne pathogens. The petition shall be filed in the district court in the county where the patient is receiving treatment from the state-operated treatment program. The state-operated treatment program shall serve the petition on the patient three days before a hearing on the petition. The petition shall include one or more affidavits attesting that:\n(1) the state-operated treatment program followed the procedures in sections 246.71 to 246.722 and attempted to obtain blood-borne pathogen test results according to those sections;\n(2) a licensed physician, advanced practice registered nurse, or physician assistant knowledgeable about the most current recommendations of the United States Public Health Service has determined that a significant exposure has occurred to the employee of a state-operated treatment program under section 246.721; and\n(3) a physician, advanced practice registered nurse, or physician assistant has documented that the employee has provided a blood sample and consented to testing for blood-borne pathogens and blood-borne pathogen test results are needed for beginning, continuing, modifying, or discontinuing medical treatment for the employee under section 246.721.\n(b) State-operated treatment programs shall cooperate with petitioners in providing any necessary affidavits to the extent that facility staff can attest under oath to the facts in the affidavits.\n(c) The court may order the patient to provide a blood sample for blood-borne pathogen testing if:\n(1) there is probable cause to believe the employee of a state-operated treatment program has experienced a significant exposure to the patient;\n(2) the court imposes appropriate safeguards against unauthorized disclosure that must specify the persons who have access to the test results and the purposes for which the test results may be used;\n(3) a licensed physician, advanced practice registered nurse, or physician assistant for the employee of a state-operated treatment program needs the test results for beginning, continuing, modifying, or discontinuing medical treatment for the employee; and\n(4) the court finds a compelling need for the test results. In assessing compelling need, the court shall weigh the need for the court-ordered blood collection and test results against the interests of the patient, including, but not limited to, privacy, health, safety, or economic interests. The court shall also consider whether involuntary blood collection and testing would serve the public interests.\n(d) The court shall conduct the proceeding in camera unless the petitioner or the patient requests a hearing in open court and the court determines that a public hearing is necessary to the public interest and the proper administration of justice.\n(e) The patient may arrange for counsel in any proceeding brought under this subdivision.",
	"repealed": false
}