{
	"id": "144.0758",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0758",
	"title": "144.0758 AMERICAN INDIAN HEALTH SPECIAL EMPHASIS GRANTS.",
	"text": "The commissioner of health shall establish the American Indian health special emphasis grant program. The purposes of the program are to:\n(1) plan and develop programs targeted to address continuing and persistent health disparities of Minnesota's American Indian population and improve American Indian health outcomes based upon needs identified by health indicators and identified disparities;\n(2) identify disparities in American Indian health arising from cumulative and historical discrimination; and\n(3) plan and develop community-based solutions with a multisector approach to addressing identified disparities in American Indian health.\nThe commissioner of health shall:\n(1) develop a request for proposals for an American Indian health special emphasis grant program in consultation with Minnesota's Tribal Nations and urban American Indian community-based organizations based upon needs identified by the community, health indicators, and identified disparities;\n(2) provide outreach, technical assistance, and program development guidance to potential qualifying organizations or entities;\n(3) review responses to requests for proposals in consultation with community stakeholders and award grants under this section;\n(4) establish a transparent and objective accountability process in consultation with community stakeholders focused on outcomes that grantees agree to achieve;\n(5) provide grantees with access to data to assist grantees in establishing and implementing effective community-led solutions; and\n(6) collect and maintain data on outcomes reported by grantees.\nOrganizations eligible to receive grant funding under this section are Minnesota's Tribal Nations and urban American Indian community-based organizations.\nIn developing the proposals and awarding the grants, the commissioner shall consider building upon the existing capacity of Minnesota's Tribal Nations and urban American Indian community-based organizations and on developing capacity where it is lacking. Proposals may focus on addressing health equity issues specific to Tribal and urban American Indian communities; addressing the health impact of historical trauma; reducing health disparities experienced by American Indian communities; and incorporating a multisector approach to addressing identified disparities.\nGrantees must report grant program outcomes to the commissioner on the forms and according to the timelines established by the commissioner.",
	"repealed": false
}