{
	"id": "524.2-1102",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-1102",
	"title": "524.2-1102 DEFINITIONS.",
	"text": "As used in sections 524.2-1101 to 524.2-1116:\n(1) \"benefactor\" means the creator of the interest that is subject to a disclaimer;\n(2) \"beneficiary designation\" means an instrument, other than an instrument creating or amending a trust, naming the beneficiary of:\n(i) an annuity or insurance policy;\n(ii) an account with a designation for payment on death;\n(iii) a security registered in beneficiary form;\n(iv) a pension, profit-sharing, retirement, or other employment-related benefit plan; or\n(v) any other nonprobate transfer at death;\n(3) \"disclaimant\" means the person to whom a disclaimed interest or power would have passed had the disclaimer not been made;\n(4) \"disclaimed interest\" or \"power\" means the portion of the interest that would have passed to the disclaimant had the disclaimer not been made;\n(5) \"disclaimer\" means the refusal to accept an interest in or power over property;\n(6) \"fiduciary\" means a personal representative, trustee of a trust, agent acting under a power of attorney, conservator, or other person authorized to act as a fiduciary with respect to the property of another person;\n(7) \"future interest\" means an interest that takes effect in possession or enjoyment, if at all, later than the time of its creation;\n(8) \"holder\" means a person who has an interest in or power over property;\n(9) \"insolvent\" means that the sum of a person's debts is greater than all of the person's assets at fair valuation. A person is presumed to be \"insolvent\" if the person is generally not paying debts as they become due. Assets do not include property that has been transferred, concealed, or removed, with intent to hinder, delay, or defraud creditors, or has been transferred in a manner making the transfer voidable. Debts do not include an obligation to the extent it is secured by a valid lien or property of the debtor not included as an asset;\n(10) \"jointly held property\" means property held in the names of two or more persons under an arrangement in which all holders have concurrent interests and under which the last surviving holder is entitled to the whole of the property;\n(11) \"person\" means an individual, living, deceased, or unborn, ascertained or unascertained, whether entitled to an interest by right of intestacy or otherwise, corporation, business trust, partnership, limited liability company, association, joint venture, government, government subdivision, agency or instrumentality, public corporation, or other commercial entity;\n(12) \"time of distribution\" means the time when a disclaimed interest would have taken effect in possession or enjoyment;\n(13) \"state\" means a state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, the United States Virgin Islands, or any territory of insular possession subject to the jurisdiction of the United States. The term includes an Indian tribe or band, or Alaskan native village, recognized by federal law or formally acknowledged by a state; and\n(14) \"trust\" means:\n(i) an express trust charitable or noncharitable, with additions thereto, whenever and however created; and\n(ii) a trust created pursuant to a statute, judgment, or decree which requires the trust be administered in the manner of an express trust.",
	"repealed": false
}