{
	"id": "206.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.57",
	"title": "206.57 EXAMINATION OF NEW VOTING SYSTEMS.",
	"text": "A vendor of an electronic voting system may apply to the secretary of state to examine the system and to report as to its compliance with the requirements of law and as to its accuracy, durability, efficiency, and capacity to register the will of voters. The secretary of state or a designee shall examine the system submitted and file a report on it in the Office of the Secretary of State. Examination is not required of every individual machine or counting device, but only of each type of electronic voting system before its adoption, use, or purchase and before its continued use after significant changes have been made in an approved system. The examination must include the ballot programming; electronic ballot marking, including all assistive technologies intended to be used with the system; vote counting; and vote accumulation functions of each voting system.\nIf the report of the secretary of state or the secretary's designee concludes that the kind of system examined complies with the requirements of sections 206.55 to 206.90 and can be used safely, the system shall be deemed approved by the secretary of state, and may be adopted and purchased for use at elections in this state. A voting system not approved by the secretary of state may not be used at an election in this state. The secretary of state may adopt permanent rules consistent with sections 206.55 to 206.90 relating to the examination and use of electronic voting systems.\nThe secretary of state may assess a fee to accompany the application to cover the actual and necessary costs for the examinations and licenses provided for in this section. The fee must be deposited in the state treasury. The expenses of administering this section must be paid from appropriations to the secretary of state.\n[Repealed, 1993 c 337 s 20]\nVendors of electronic voting systems shall certify to the secretary of state that they will not offer for sale a system which is not certified for use in Minnesota elections. The vendor shall furnish a bond in the amount of $5,000 along with the certification to the secretary of state conditioned on offering the equipment for sale in accordance with Minnesota election laws and any conditions of the approval of the equipment granted as provided in this section.\nIn federal and state elections held after December 31, 2005; in county, city, and school district elections held after December 31, 2007; and, except as provided in subdivision 5a, in township elections held after December 31, 2009, the voting method used in each polling place must include a voting system that is accessible for individuals with disabilities, including nonvisual accessibility for the blind and visually impaired in a manner that provides the same opportunity for access and participation, including privacy and independence, as for other voters.\n(a) A town conducting an election not held in conjunction with any federal, state, county, or school district election is exempt from the requirements of subdivision 5 if the town has fewer than 500 registered voters, as determined by the secretary of state by June 1 of each year.\n(b) A town that would otherwise satisfy the requirements of this subdivision is still required to comply with subdivision 5 at its next general town election if the voters at the preceding year's annual town meeting instruct the town to conduct elections in compliance with subdivision 5.\n(c) If the secretary of state, after consultation with the Minnesota Association of Townships, county auditors, or other interested parties, determines that a town's share of the cost of compliance with subdivision 5 will not exceed $150 for an election, the town may not use the exemption under paragraph (a) and shall conduct elections under subdivision 5. In determining the town's cost of compliance, the secretary shall include any expense associated with programming, ballot preparation and printing, and the equipment costs directly related to compliance with subdivision 5.\n(a) Beginning in 2009 and at least once every other year until 2016, the secretary of state shall consult with interested parties, including, but not limited to, members of the legislature, town officers, county election officials, the National Federation of the Blind, the Minnesota State Council on Disability, and the Disability Law Center regarding:\n(1) options for full compliance with subdivision 5; and\n(2) ongoing costs of compliance with subdivision 5 and methods of reducing those costs.\n(b) Beginning January 15, 2010, and until January 15, 2017, the secretary of state shall report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over elections policy and finance regarding the findings, discussions, and developments under paragraph (a).\nIn addition to the requirements in subdivision 1, a voting system must be certified by an independent testing authority accredited by the Election Assistance Commission or appropriate federal agency responsible for testing and certification of compliance with the federal voting systems guidelines at the time of submission of the application required by subdivision 1 to be in conformity with voluntary voting system guidelines issued by the Election Assistance Commission or other previously referenced agency. The application must be accompanied by the certification report of the voting systems test laboratory. A certification under this section from an independent testing authority accredited by the Election Assistance Commission or other previously referenced agency meets the requirement of Minnesota Rules, part 8220.0350, item L. A vendor must provide a copy of the source code for the voting system to the secretary of state. A chair of a major political party or the secretary of state may select, in consultation with the vendor, an independent third-party evaluator to examine the source code to ensure that it functions as represented by the vendor and that the code is free from defects. A major political party that elects to have the source code examined must pay for the examination. Except as provided by this subdivision, a source code that is trade secret information must be treated as nonpublic information, according to section 13.37. A third-party evaluator must not disclose the source code to anyone else.\n[Repealed, 2010 c 201 s 82]\nNotwithstanding Minnesota Rules, part 8230.4355, ballot boxes used with precinct count voting systems are not required to contain two separate compartments to receive ballots.",
	"repealed": false
}