{
	"id": "85.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.20",
	"title": "85.20 VIOLATIONS OF RULES; LITTERING; PENALTIES.",
	"text": "(a) Any person who, within the limits of any outdoor recreation unit established in chapter 86A, shall willfully cut, injure, or destroy any live tree, shrub, timber, evergreen, or ornamental plant of any kind, or who shall willfully injure, remove, destroy, deface, or mutilate any guideboard, guidepost, furniture, fixture, improvement, monument, tablet, or other property of the state of any kind, or who shall willfully violate, or fail to comply with, any rule of the commissioner adopted according to section 86A.06, is guilty of a petty misdemeanor.\n(b) Violations under paragraph (a) adopted for wildlife management areas described in section 86A.05, subdivision 8, are misdemeanors, consistent with game and fish law penalties defined in section 97A.301, subdivision 1, clause (6).\n(c) If a different penalty is provided in another section of law for the violation and the person is charged under that section of law, the penalty specified for the violation will control over the penalty specified in paragraphs (a) and (b). Violations relating to the taking of wild animals are subject to the penalties as specified in the game and fish laws described in section 97A.011.\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\n[Repealed, 1975 c 353 s 41]\n(a) No person shall drain, throw, or deposit upon the lands and waters within any unit of the outdoor recreation system as defined in section 86A.04 any substance, including cigarette filters and debris from fireworks, that would mar the appearance, create a stench, destroy the cleanliness or safety of the land, or would be likely to injure any animal, vehicle, or person traveling upon those lands and waters. The operator of a vehicle or watercraft, except a school bus or a vehicle transporting passengers for hire and regulated by a successor agency of the former Interstate Commerce Commission, shall not permit articles to be thrown or discarded from the vehicle upon any lands or waters within any unit of the outdoor recreation system.\n(b) Violation of this subdivision is a misdemeanor. Any person sentenced under this subdivision shall in lieu of the sentence imposed be permitted, under terms established by the court, to work under the direction of the Department of Natural Resources at clearing rubbish, trash, and debris from any unit of the outdoor recreation system. The court may for any violation of this subdivision order the offender to perform such work under terms established by the court with the option of a jail sentence being imposed.\n(c) In lieu of enforcement under paragraph (b), this subdivision may be enforced by imposition of a civil penalty and an action for damages for littering under section 115A.99.",
	"repealed": false
}