{
	"id": "17.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.53",
	"title": "17.53 DEFINITIONS.",
	"text": "As used in sections 17.51 to 17.69, the terms defined in this section shall have the following meanings.\n(a) Except as provided in paragraph (b), \"agricultural commodity\" means any agricultural product, including, without limitation, animals and animal products, grown, raised, produced, or fed within Minnesota for use as food, feed, seed, or any industrial or chemurgic purpose.\n(b) For wheat, barley, corn, and cultivated wild rice, \"agricultural commodity\" means wheat, barley, corn and cultivated wild rice including, without limitation, wheat, barley, corn and cultivated wild rice grown or produced within or outside Minnesota, for use as food, feed, seed, or any industrial or chemurgic purpose.\n\"Commercial channels\" means the processes of sale of any agricultural commodity to any commercial buyer, dealer, processor, cooperative or to any person, public or private, who resells such commodity or any product produced from such commodity for slaughter, storage, processing or distribution.\n[Repealed, 1996 c 310 s 1]\n\"Cooperative\" means a nonprofit association legally constituted under the laws of Minnesota or of another state of producers who have gathered together for purposes of bargaining for a price for marketing their commodity. This includes all cooperatives domiciled inside or outside of the state which buy commodities from Minnesota producers.\n\"Council\" means a council created under the provisions of sections 17.51 to 17.69.\n\"First handler\" means a person, whether an owner, agent or other person, who initially places a commodity into commercial channels, or who is engaged in the processing of the commodity into food for human consumption in any form, except for potato flour or potato starch.\n(a) Except as provided in paragraph (b), \"first purchaser\" means any person that buys agricultural commodities for movement into commercial channels from the producer; or any lienholder, secured party or pledgee, public or private, or assignee of said lienholder, secured party or pledgee, who gains title to the agricultural commodity from the producer as the result of exercising any legal rights by the lienholder, secured party, pledgee, or assignee thereof, regardless of when the lien, security interest or pledge was created and regardless of whether the first purchaser is domiciled within the state or without. \"First purchaser\" does not mean the Commodity Credit Corporation when a commodity is used as collateral for a federal nonrecourse loan unless the commissioner determines otherwise.\n(b) For wheat, barley, corn, and cultivated wild rice, \"first purchaser\" means a person who buys, receives delivery of, or provides storage for the agricultural commodity from a producer for movement into commercial channels; or a lienholder, secured party, or pledgee, who gains title to the agricultural commodity from the producers as the result of exercising any legal rights by the lienholder, secured party, pledgee, or assignee, regardless of when the lien, security interest, or pledge was created and regardless of whether or not the first purchaser is domiciled in the state. \"First purchaser\" does not mean the Commodity Credit Corporation when the wheat, barley, corn or cultivated wild rice is used as collateral for a federal nonrecourse loan unless the commissioner determines otherwise.\n\"Marketing year\" means a one-year period from July 1 through June 30, or any other one-year period determined by the promotion order of a specific council.\n\"Participating producer\" means a producer of an agricultural commodity for which a promotional order has been issued and exists, who produces that commodity in the organized area and meets the minimal requirements established by the council to qualify as a producer.\n[Repealed, 1996 c 310 s 1]\n\"Private processor\" means a privately owned commodity processor legally constituted under the laws of Minnesota for the purpose of buying or marketing the commodity and commodity products, whether the processor is domiciled within the state or without.\n(a) Except as provided in paragraph (b), \"producer\" means any person who owns or operates an agricultural producing or growing facility for an agricultural commodity and shares in the profits and risk of loss from such operation, and who grows, raises, feeds or produces the agricultural commodity in Minnesota during the current or preceding marketing year.\n(b) For wheat, barley, corn, and cultivated wild rice, \"producer\" means in addition to the meaning in paragraph (a) and for the purpose of the payment or the refund of the checkoff fee paid pursuant to sections 17.51 to 17.69 only, a person who delivers into, stores within, or makes the first sale of the agricultural commodity in Minnesota.\n\"Producer-processor\" means a producer who processes and markets the producer's own product. For the purpose of collecting the checkoff fee, a producer-processor is the first purchaser.\n\"Promotional order\" means an order issued by the commissioner, with the advice and consent of a council and after a referendum pursuant to this chapter, which establishes a program for promotion, advertising, production, market research, and market development of the growing, processing, distributing, sale or handling of an agricultural commodity and provides for the collection of checkoff fees.\n\"Qualified voter\" means a producer who would be subject to the payment of fees to finance the activities described in sections 17.51 to 17.69 and who shares directly in the profits and risk of loss from the agricultural operation which produces or grows the commodity, regardless of the Internal Revenue Service tax filing status of the producer.\n\"Retailer\" means a person who sells directly to the consumer in small quantities or broken lots.\n\"Sale\" means any passing of title from the producer to the first purchaser. Sale includes any pledge, security interest or lien after harvest.",
	"repealed": false
}