{
	"id": "617.293",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.293",
	"title": "617.293 HARMFUL MATERIALS; DISSEMINATION AND DISPLAY TO MINORS PROHIBITED.",
	"text": "It is unlawful for any person knowingly to sell or loan for monetary consideration to a minor:\n(a) any picture, photograph, drawing, sculpture, motion picture film, or similar visual representation or image of a person or portion of the human body which depicts nudity, sexual conduct, or sadomasochistic abuse and which is harmful to minors, or\n(b) any book, pamphlet, magazine, printed matter however reproduced, or sound recording which contains any matter enumerated in clause (a), or which contains explicit and detailed verbal descriptions or narrative accounts of sexual excitement, sexual conduct, or sadomasochistic abuse which, taken as a whole, is harmful to minors.\n(a) It is unlawful for any person commercially and knowingly to exhibit or display any material which is harmful to minors in its content in any place of public accommodation where minors are or may be present and where minors are able to view the material unless each item is kept in a sealed wrapper at all times.\n(b) It is unlawful for any person commercially and knowingly to exhibit or display any material the cover or packaging of which, standing alone, is harmful to minors in any place of public accommodation where minors are or may be present or allowed to be present and where minors are able to view the material unless each item is blocked from view by an opaque cover. The opaque cover requirement is satisfied if those portions of the cover or packaging containing the material harmful to minors are blocked from view by an opaque cover.\n(c) The provisions of this subdivision do not apply to the exhibition or display of materials harmful to minors under circumstances where minors are not present or are not able to view the material or the material's cover or packaging. A person may comply with the requirements of this paragraph by (1) physically segregating the material in a manner that physically prohibits access to and view of the material by minors, (2) prominently posting at the entrance to the restricted area: \"Adults only--you must be 18 to enter,\" and (3) enforcing the restriction.",
	"repealed": false
}