{
	"id": "356.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.401",
	"title": "356.401 EXEMPTION FROM PROCESS.",
	"text": "None of the money, annuities, or other benefits provided for in the governing law of a covered retirement plan is assignable either in law or in equity or subject to state estate tax, or to execution, levy, attachment, garnishment, or other legal process, except as provided in subdivision 2 or section 518.58, 518.581, or 518A.53.\n(a) The chief administrative officer of a covered retirement plan may remit, through an automatic deposit system, annuity, benefit, or refund payments only to a financial institution associated with the National Automated Clearinghouse Association or a comparable successor organization that is trustee for a person who is eligible to receive the annuity, benefit, or refund.\n(b) Upon the request of a retiree, disabilitant, survivor, or former member, the chief administrative officer of a covered retirement plan may remit the annuity, benefit, or refund payment to the applicable financial institution for deposit in the person's individual account or the person's joint account. If an overpayment of benefits is paid after the death of the annuitant or benefit recipient, the chief administrative officer of the pension plan is authorized to issue an administrative subpoena consistent with the requirements of section 13A.02, requiring the applicable financial institution to disclose the names of all joint and co-owners of the account and a description of all deposits to, and withdrawals from, the account which take place on or after the death of the annuitant or benefit recipient. An overpayment to a joint account after the death of the annuitant or benefit recipient must be repaid to the fund of the applicable covered retirement plan by the joint tenant if the overpayment is not repaid to that fund by the financial institution associated with the National Automated Clearinghouse Association or its successor. The governing board of the covered retirement plan may prescribe the conditions under which these payments may be made.\nThe provisions of this section apply to the following retirement plans:\n(1) the legislators retirement plan, established by chapter 3A, including constitutional officers as specified in that chapter;\n(2) the general state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(3) the correctional state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(4) the State Patrol retirement plan, established by chapter 352B;\n(5) the unclassified state employees retirement program, established by chapter 352D;\n(6) the general employees retirement plan of the Public Employees Retirement Association, established by chapter 353;\n(7) the public employees police and fire plan of the Public Employees Retirement Association, established by chapter 353;\n(8) the public employees defined contribution plan, established by chapter 353D;\n(9) the local government correctional service retirement plan of the Public Employees Retirement Association, established by chapter 353E;\n(10) the statewide lump-sum volunteer firefighter plan, established by chapter 353G;\n(11) the Teachers Retirement Association, established by chapter 354;\n(12) the St. Paul Teachers Retirement Fund Association, established by chapter 354A;\n(13) the individual retirement account plan, established by chapter 354B;\n(14) the higher education supplemental retirement plan, established by chapter 354C; and\n(15) the judges retirement fund, established by chapter 490.",
	"repealed": false
}