{
	"id": "308A.210",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.210",
	"title": "308A.210 TELECOMMUNICATION SERVICES PURCHASING COOPERATIVES.",
	"text": "A telecommunication services purchasing cooperative may be formed under this chapter for the sole purpose of purchasing advanced telecommunications services by aggregating demand and negotiating reduced rates for its members. Any such telecommunication services shall be provided and directly billed by a telephone company or a telecommunication carrier. A purchasing cooperative must declare in its articles of incorporation a contiguous area comprising less than the entire state in which it may operate.\nIn addition to others that may form a cooperative, a political subdivision of the state, including a service cooperative created under section 123A.21, may act to organize a telecommunication services purchasing cooperative within its jurisdiction for the benefit of its residents.\nA purchasing cooperative has all of the powers described in section 308A.201, except that a purchasing cooperative does not have the power of eminent domain. A purchasing cooperative is not a telephone or electric cooperative as those terms are used in this chapter and chapters 216B and 237.\nA board of directors of five to seven members shall govern a telecommunication services purchasing cooperative. The directors must be elected according to the requirements of section 308A.311, except that:\n(1) all of the directors must be members of the purchasing cooperative;\n(2) a director may not be a provider of services to the cooperative or an employee of the provider;\n(3) a director may not be a member of a governing body of a political subdivision; and\n(4) a majority of the directors must be seeking to purchase some residential telecommunication services through the cooperative.\nIn order to ensure that residential customers experience the benefits of cooperative purchasing, at least 50 percent of the total number of entities or individuals who are members of the purchasing cooperative must be seeking to purchase residential telecommunication services through the cooperative. If the telecommunication services purchasing cooperative fails to comply with this subdivision, it shall notify the Department of Commerce and shall have one year from the date of noncompliance to come into compliance. If it does not come into compliance, the telecommunication services purchasing cooperative shall be dissolved and its assets distributed to its members.\nA purchasing cooperative must immediately file a copy of its contracts with telecommunication services providers with the Department of Commerce. A purchasing cooperative must file its annual financial statements with the department.\nAny person within the geographic operating area declared in a cooperative's articles of incorporation or any person within the exchange boundary or service area of a telephone company or telecommunication carrier that in whole or in part is included in the geographic operating area declared in the cooperative's articles of incorporation may become a member of the telecommunication services purchasing cooperative.\n\"Advanced telecommunications service\" includes any service that would be classified as a flexibly priced service within the meaning of section 237.761, subdivision 4, or non-price-regulated service within the meaning of section 237.761, subdivision 4, provided that a service may be an advanced telephone service whether or not the telephone company has adopted an alternative rate plan within the meaning of section 237.76.",
	"repealed": false
}