{
	"id": "60J.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/60J.09",
	"title": "60J.09 MINIMUM STANDARDS.",
	"text": "The provisions of this section apply if, in any calendar year, the aggregate amount of gross written premium on business placed with a controlled insurer by a controlling producer is equal to or greater than five percent of the admitted assets of the controlled insurer, as reported in the controlled insurer's quarterly statement filed as of September 30 of the prior year.\nNotwithstanding subdivision 1, this section does not apply under the following conditions:\n(1) the controlling producer:\n(i) places insurance only with the controlled insurer, or only with the controlled insurer and a member of the controlled insurer's holding company system, or the controlled insurer's parent, affiliate, or subsidiary and receives no compensation based upon the amount of premiums written in connection with the insurance; and\n(ii) accepts insurance placements only from nonaffiliated subproducers and not directly from insureds; and\n(2) the controlled insurer, except for insurance business written through a residual market facility, accepts insurance business only from a controlling producer, a producer controlled by the controlled insurer, or a producer that is a subsidiary of the controlled insurer.\nA controlled insurer shall not accept business from a controlling producer and a controlling producer shall not place business with a controlled insurer unless there is a written contract between the controlling producer and the insurer specifying the responsibilities of each party. The contract must be approved by the board of directors of the insurer and contain the following minimum provisions:\n(1) the controlled insurer may terminate the contract for cause, upon written notice to the controlling producer. The controlled insurer shall suspend the authority of the controlling producer to write business during the pendency of any dispute regarding the cause for the termination;\n(2) the controlling producer shall submit accounts to the controlled insurer detailing all material transactions, including information necessary to support all commissions, charges, and other fees received by, or owing to, the controlling producer;\n(3) the controlling producer shall remit all funds due under the terms of the contract to the controlled insurer on at least a monthly basis. The due date must be fixed so that premiums or installments collected are remitted no later than 90 days after the effective date of any policy placed with the controlled insurer under this contract;\n(4) all funds collected for the controlled insurer's account shall be held by the controlling producer in a fiduciary capacity, in one or more appropriately identified bank accounts in banks that are members of the Federal Reserve System, in accordance with the provisions of the insurance law as applicable. Funds of a controlling producer not required to be licensed in this state must be maintained in compliance with the requirements of the controlling producer's domiciliary jurisdiction;\n(5) the controlling producer shall maintain separately identifiable records of business written for the controlled insurer;\n(6) the contract may not be assigned in whole or in part by the controlling producer;\n(7) the controlled insurer shall provide the controlling producer with its underwriting standards, rules, and procedures, manuals specifying the rates to be charged, and the conditions for the acceptance or rejection of risks. The controlling producer shall adhere to the standards, rules, procedures, rates, and conditions. The standards, rules, procedures, rates, and conditions must be the same as those applicable to comparable business placed with the controlled insurer by a producer other than the controlling producer;\n(8) the rates and terms of the controlling producer's commissions, charges, or other fees and the purposes for those charges or fees. The rates of the commissions, charges, and other fees may be no greater than those applicable to comparable business placed with the controlled insurer by producers other than controlling producers. For purposes of this clause and clause (7), examples of \"comparable business\" include the same lines of insurance, same kinds of insurance, same kinds of risks, similar policy limits, and similar quality of business;\n(9) if the contract provides that the controlling producer, on insurance business placed with the insurer, is to be compensated contingent upon the insurer's profits on that business, then the compensation may not be determined and paid until at least five years after the premiums on liability insurance are earned and at least one year after the premiums are earned on any other insurance. In no event may the commissions be paid until the adequacy of the controlled insurer's reserves on remaining claims has been independently verified as provided under subdivision 5;\n(10) a limit on the controlling producer's writings in relation to the controlled insurer's surplus and total writings. The insurer may establish a different limit for each line or subline of business. The controlled insurer shall notify the controlling producer when the applicable limit is approached and shall not accept business from the controlling producer if the limit is reached. The controlling producer shall not place business with the controlled insurer if it has been notified by the controlled insurer that the limit has been reached; and\n(11) the controlling producer may negotiate but may not bind reinsurance on behalf of the controlled insurer on business the controlling producer places with the controlled insurer, except that the controlling producer may bind facultative reinsurance contracts pursuant to obligatory facultative agreements if the contract with the controlled insurer contains underwriting guidelines including, for both reinsurance assumed and ceded, a list of reinsurers with which the automatic agreements are in effect, the coverages and amounts or percentages that may be reinsured and commission schedules.\nA controlled insurer shall have an audit committee of the board of directors composed of independent directors. The audit committee shall annually meet with management, the insurer's independent certified public accountants, and an independent casualty actuary or other independent loss reserve specialist acceptable to the commissioner to review the adequacy of the insurer's loss reserves.\nIn addition to any other required loss reserve certification, the controlled insurer shall annually, on April 1 of each year, file with the commissioner an opinion of an independent casualty actuary, or other independent loss reserve specialist acceptable to the commissioner, reporting loss ratios for each line of business written and attesting to the adequacy of loss reserves established for losses incurred and outstanding as of year end, including incurred but not reported, on business placed by the producer. The controlled insurer shall annually report to the commissioner the amount of commissions paid to the producer, the percentage the amount represents of the net premiums written, and comparable amounts and percentage paid to noncontrolling producers for placements of the same kinds of insurance.",
	"repealed": false
}