{
	"id": "325G.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.55",
	"title": "325G.55 CANCELLATION WITHOUT PENALTY OF RENTAL, CLUB, SERVICE, AND MEMBERSHIP TRAVEL CONTRACTS BY MILITARY SERVICE PERSONNEL.",
	"text": "This section applies to any rental contracts, club contracts under section 325G.23, service contracts, and membership travel contracts under section 325G.50 in which:\n(1) such a contract was executed by or on the behalf of a person who, after the execution of the contract, was issued orders into active duty, for deployment, or for a permanent change of duty station; and\n(2) where as a result of the orders it is impractical for the person to enjoy the benefits of the contract.\nA service member who enters into a rental, club, membership travel, or service contract, and who is issued orders into active duty, for deployment, or for a permanent change of duty station, subsequent to the execution of the contract, is entitled to cancel the contract at no penalty and with a full refund of any money which may have been placed on deposit where the service member's military activation, deployment, or change in duty station causes it to be impractical for the service member to abide by the terms and conditions of the contract. For purposes of this section, \"service contract\" includes those for services such as television, computer, Internet service, or any other type of service.\nAny such contract may be terminated by notice in writing sent to the contractor by the person issued orders for active duty, for deployment, or for a permanent change of duty station, canceling the service member's rental, club, or membership travel contract. The notice must include a copy of the orders in question. Delivery of the notice must be made by certified mail addressed to the contractor. The termination of the contract is effective the day following receipt of proper notice as described in this subdivision.\nThis section may be enforced by the attorney general pursuant to section 8.31.",
	"repealed": false
}