{
	"id": "154.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.161",
	"title": "154.161 REGISTRATION; ISSUANCE, REVOCATION, SUSPENSION, DENIAL.",
	"text": "If the board, or a complaint committee if authorized by the board, has a reasonable basis for believing that a person has engaged in or is about to engage in a violation of a statute, rule, or order that the board has adopted or issued or is empowered to enforce, the board or complaint committee may proceed as provided in subdivision 2 or 3. Except as otherwise provided in this section, all hearings must be conducted in accordance with the Administrative Procedure Act.\n(a) When necessary to prevent an imminent violation of a statute, rule, or order that the board has adopted or issued or is empowered to enforce, the board, or a complaint committee if authorized by the board, may bring an action in the name of the state in the District Court of Ramsey County in which jurisdiction is proper to enjoin the act or practice and to enforce compliance with the statute, rule, or order. On a showing that a person has engaged in or is about to engage in an act or practice that constitutes a violation of a statute, rule, or order that the board has adopted or issued or is empowered to enforce, the court shall grant a permanent or temporary injunction, restraining order, or other appropriate relief.\n(b) For purposes of injunctive relief under this subdivision, irreparable harm exists when the board shows that a person has engaged in or is about to engage in an act or practice that constitutes violation of a statute, rule, or order that the board has adopted or issued or is empowered to enforce.\n(c) Injunctive relief granted under paragraph (a) does not relieve an enjoined person from criminal prosecution by a competent authority, or from action by the board under subdivision 3, 4, 5, or 6 with respect to the person's registration, certificate, or application for examination, registration, or renewal.\n(a) The board, or complaint committee if authorized by the board, may issue and have served upon an unregistered person, or a holder of a certificate of registration or a shop registration card, an order requiring the person to cease and desist from an act or practice that constitutes a violation of a statute, rule, or order that the board has adopted or issued or is empowered to enforce. The order must (1) give reasonable notice of the rights of the person named in the order to request a hearing, and (2) state the reasons for the entry of the order. No order may be issued under this subdivision until an investigation of the facts has been conducted under section 214.10.\n(b) Service of the order under this subdivision is effective when the order is personally served on the person or counsel of record, or served by certified mail to the most recent address provided to the board for the person or counsel of record.\n(c) The board must hold a hearing under this subdivision not later than 30 days after the board receives the request for the hearing, unless otherwise agreed between the board, or complaint committee if authorized by the board, and the person requesting the hearing.\n(d) Notwithstanding any rule to the contrary, the administrative law judge must issue a report within 30 days of the close of the contested case hearing. Within 30 days after receiving the report and subsequent exceptions and argument, the board shall issue a further order vacating, modifying, or making permanent the cease and desist order. If no hearing is requested within 30 days of service of the order, the order becomes final and remains in effect until modified or vacated by the board.\n(a) With respect to a person who is a holder of or applicant for registration or a shop registration card under sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28, the board may by order deny, refuse to renew, suspend, temporarily suspend, or revoke the application, certificate of registration, or shop registration card, censure or reprimand the person, refuse to permit the person to sit for examination, or refuse to release the person's examination grades, if the board finds that such an order is in the public interest and that, based on a preponderance of the evidence presented, the person has:\n(1) violated a statute, rule, or order that the board has adopted or issued or is empowered to enforce;\n(2) engaged in conduct or acts that are fraudulent, deceptive, or dishonest, whether or not the conduct or acts relate to the practice of barbering, if the fraudulent, deceptive, or dishonest conduct or acts reflect adversely on the person's ability or fitness to engage in the practice of barbering;\n(3) engaged in conduct or acts that constitute malpractice, are negligent, demonstrate incompetence, or are otherwise in violation of the standards in the rules of the board, where the conduct or acts relate to the practice of barbering;\n(4) employed fraud or deception in obtaining a certificate of registration, shop registration card, renewal, or reinstatement, or in passing all or a portion of the examination;\n(5) had a certificate of registration or shop registration card, right to examine, or other similar authority revoked in another jurisdiction;\n(6) failed to meet any requirement for issuance or renewal of the person's certificate of registration or shop registration card;\n(7) practiced as a barber while having an infectious or contagious disease;\n(8) advertised by means of false or deceptive statements;\n(9) demonstrated intoxication or indulgence in the use of drugs, including but not limited to narcotics as defined in section 152.01 or in United States Code, title 26, section 4731, barbiturates, amphetamines, benzedrine, dexedrine, or other sedatives, depressants, stimulants, or tranquilizers;\n(10) demonstrated unprofessional conduct or practice;\n(11) permitted an employee or other person under the person's supervision or control to practice as a registered barber or registered instructor of barbering unless that person has (i) a current certificate of registration as a registered barber or registered instructor of barbering, (ii) a temporary apprentice permit, or (iii) a temporary permit as an instructor of barbering;\n(12) practices, offered to practice, or attempted to practice by misrepresentation;\n(13) failed to display a certificate of registration as required by section 154.14;\n(14) used any room or place of barbering that is also used for any other purpose, or used any room or place of barbering that violates the board's rules governing sanitation;\n(15) in the case of a barber or other person working in or in charge of any barber shop, or any person in a barber school engaging in the practice of barbering, failed to use separate and clean towels for each customer or patron, or to discard and launder each towel after being used once;\n(16) in the case of a barber or other person in charge of any barber shop or barber school, (i) failed to supply in a sanitary manner clean hot and cold water in quantities necessary to conduct the shop or barbering service for the school, (ii) failed to have water and sewer connections from the shop or barber school with municipal water and sewer systems where they are available for use, or (iii) failed or refused to maintain a receptacle for hot water of a capacity of at least five gallons;\n(17) refused to permit the board to make an inspection permitted or required by sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28, or failed to provide the board or the attorney general on behalf of the board with any documents or records they request;\n(18) failed promptly to renew a certificate of registration or shop registration card when remaining in practice, pay the required fee, or issue a worthless check;\n(19) permitted the practice of barbering by a person not registered with the board or not holding a temporary permit;\n(20) refused to serve a customer because of race, color, creed, religion, disability, national origin, or sex;\n(21) failed to comply with a provision of sections 136A.82 to 136A.834, or a provision of another chapter that relates to barber schools; or\n(22) with respect to temporary suspension orders, has committed an act, engaged in conduct, or committed practices that the board, or complaint committee if authorized by the board, has determined may result or may have resulted in an immediate threat to the public.\n(b) In lieu of or in addition to any remedy under paragraph (a), the board may as a condition of continued registration, termination of suspension, reinstatement of registration, examination, or release of examination results, require that the person:\n(1) submit to a quality review of the person's ability, skills, or quality of work, conducted in a manner and by a person or entity that the board determines; or\n(2) complete to the board's satisfaction continuing education as the board requires.\n(c) Service of an order under this subdivision is effective if the order is served personally on, or is served by certified mail to the most recent address provided to the board by the certificate holder, applicant, or counsel of record. The order must state the reason for the entry of the order.\n(d) Except as provided in subdivision 5, paragraph (c), all hearings under this subdivision must be conducted in accordance with the Administrative Procedure Act.\n(a) When the board, or complaint committee if authorized by the board, issues a temporary suspension order, the suspension provided for in the order is effective on service of a written copy of the order on the certificate holder or counsel of record. The order must specify the statute, rule, or order violated by the certificate holder. The order remains in effect until the board issues a final order in the matter after a hearing, or on agreement between the board and the certificate holder.\n(b) An order under this subdivision may (1) prohibit the certificate holder from engaging in the practice of barbering in whole or in part, as the facts require, and (2) condition the termination of the suspension on compliance with a statute, rule, or order that the board has adopted or issued or is empowered to enforce. The order must state the reasons for entering the order and must set forth the right to a hearing as provided in this subdivision.\n(c) Within ten days after service of an order under this subdivision, the certificate holder may request a hearing in writing. The board must hold a hearing before its own members within five working days of the request for a hearing. The sole issue at such a hearing must be whether there is a reasonable basis to continue, modify, or terminate the temporary suspension. The hearing is not subject to the Administrative Procedure Act. Evidence presented to the board or the certificate holder may be in affidavit form only. The certificate holder or counsel of record may appear for oral argument.\n(d) Within five working days after the hearing, the board shall issue its order and, if the order continues the suspension, shall schedule a contested case hearing within 30 days of the issuance of the order. Notwithstanding any rule to the contrary, the administrative law judge shall issue a report within 30 days after the closing of the contested case hearing record. The board shall issue a final order within 30 days of receiving the report.\n(a) The board may impose a civil penalty of up to $2,000 per violation on a person who violates a statute, rule, or order that the board has adopted or issued or is empowered to enforce.\n(b) In addition to any penalty under paragraph (a), the board may impose a fee to reimburse the board for all or part of the cost of (1) the proceedings resulting in disciplinary action authorized under this section, (2) the imposition of a civil penalty under paragraph (a), or (3) the issuance of a cease and desist order. The board may impose a fee under this paragraph when the board shows that the position of the person who has violated a statute, rule, or order that the board has adopted or issued or is empowered to enforce is not substantially justified unless special circumstances make such a fee unjust, notwithstanding any rule to the contrary. Costs under this paragraph include, but are not limited to, the amount paid by the board for services from the Office of Administrative Hearings, attorneys' fees, court reporter costs, witness costs, reproduction of records, board members' compensation, board staff time, and expense incurred by board members and staff.\n(c) All hearings under this subdivision must be conducted in accordance with the Administrative Procedure Act.\nThe board may reinstate a suspended, revoked, or surrendered certificate of registration or shop registration card, on petition of the former or suspended registrant. The board may in its sole discretion place any conditions on reinstatement of a suspended, revoked, or surrendered certificate of registration or shop registration card that it finds appropriate and necessary to ensure that the purposes of sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 are met. No certificate of registration or shop registration card may be reinstated until the former registrant has completed at least one-half of the suspension period.",
	"repealed": false
}