{
	"id": "148.725",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.725",
	"title": "148.725 REQUIREMENTS FOR FOREIGN-EDUCATED APPLICANTS.",
	"text": "An applicant for licensure who is a foreign-educated physical therapist must fulfill the requirements in subdivisions 2 to 5, providing certified English translations of board-required relevant documentation.\nThe applicant must present evidence of completion of physical therapy schooling equivalent to that required in section 148.721 by having a Type I comprehensive credentials evaluation or educational credentials review performed by the Foreign Credentialing Commission on Physical Therapy (FCCPT). The evaluation must be sent directly to the board from the FCCPT. The applicant shall be responsible for the expenses incurred as a result of the evaluation.\nIf not completed as part of the FCCPT Type I comprehensive credentials evaluation, the applicant must demonstrate English language proficiency by taking the test of English as a foreign language examination (TOEFL) and achieving a passing score as established by the board, or a passing score on a comparable nationally recognized examination approved by the board. For purposes of this subdivision, the passing score adopted by the board shall be applied prospectively.\nThe applicant must have practiced satisfactorily for at least six months under the supervision of a licensed physical therapist at a board-approved facility. A facility that offers such practice must provide a broad base of experience including a variety of physical agents, therapeutic exercises, evaluation procedures, and patient diagnoses. Supervision must be provided by a licensed physical therapist with at least three years of clinical experience. A proposed outline of clinical experiences must be approved by the board before the facility begins offering the experience.\nThe applicant must satisfactorily complete the board-approved examination as stated in section 148.723.",
	"repealed": false
}