{
	"id": "161.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.12",
	"title": "161.12 ADDITIONAL ROUTES ADDED; FEDERAL AID.",
	"text": "To take advantage of federal aid made available by the United States to the state of Minnesota for highway purposes, the following trunk highway routes are added to the trunk highway system which routes form a part of the national system of interstate and defense highways and may be referred to as the interstate system.\nBeginning at a point on the boundary between the states of Minnesota and Iowa, southerly of Albert Lea; thence extending in a general northeasterly direction to a point in Duluth on the boundary between the states of Minnesota and Wisconsin. Route No. 390 shall not include any portion of Trunk Highway marked 3 from Trunk Highway marked 110 in Dakota County to East Seventh Street in the city of St. Paul.\nBeginning at a point on the boundary between the states of Minnesota and South Dakota, westerly of Luverne; thence extending in a general easterly direction to a point on the boundary between the states of Minnesota and Wisconsin, near La Crescent.\nBeginning at a point on the boundary between the states of Minnesota and North Dakota in or near Moorhead; thence extending in a general southeasterly direction through the city of Minneapolis; thence in a general easterly direction through the city of St. Paul to a point on the boundary between the states of Minnesota and Wisconsin in or near Lakeland.\nBeginning at a point on Route No. 392, easterly of the city of St. Paul; thence in a general southerly and westerly direction through the city of South St. Paul; thence in a general westerly direction to a point in Eden Prairie Township, Hennepin County; thence in a general northerly direction to a point in the city of Maple Grove, Hennepin County; thence in a general easterly direction to a point on Route 390; thence in a general easterly, southeasterly and southerly direction to the point of beginning on Route No. 392, easterly of St. Paul.\nBeginning at a point on Route No. 390, southerly of the Minnesota River; thence extending in a general northerly and northeasterly direction through the city of Minneapolis; thence continuing in a northeasterly direction to a point on Route No. 390, near Forest Lake and there terminating.\nBeginning at a point on Route No. 390 at or near the intersection of Superior Street and Nineteenth Avenue West in the city of Duluth, thence extending in a northeasterly direction to a point on Route No. 103 at or near the intersection of Superior Street and Tenth Avenue East in the city of Duluth.\nBeginning at a point approximately on the intersection of Legislative Route No. 103, also known as Trunk Highway 61 and London Road, and 10th Avenue East in Duluth; thence extending in a general northeasterly direction and approximately parallel to Legislative Route No. 103 to a point approximately on the intersection of Legislative Route No. 103 and 26th Avenue East in Duluth.",
	"repealed": false
}