{
	"id": "14.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.47",
	"title": "14.47 PUBLICATION IN COMPILED FORM.",
	"text": "The revisor of statutes shall:\n(1) formulate a plan for the compilation of all permanent agency rules and, to the extent practicable, other rules, adopted pursuant to the Administrative Procedure Act or filed pursuant to the provisions of section 14.38, subdivisions 5 to 9, or 14.386 which were in effect at the time the rules were filed or subdivision 11, including their order, classification, arrangement, form, and indexing, and any appropriate tables, annotations, cross-references, citations to applicable statutes, explanatory notes, and other appropriate material to facilitate use of the rules by the public, and for the compilation's composition, printing, binding, and distribution;\n(2) publish the compilation of permanent agency rules and, if practicable, other rules, adopted pursuant to the Administrative Procedure Act or filed pursuant to the provisions of section 14.38, subdivisions 5 to 9, or 14.386 which were in effect at the time the rules were filed or subdivision 11, which shall be called \"Minnesota Rules\";\n(3) periodically either publish a supplement or a new compilation, which includes all rules adopted since the last supplement or compilation was published and removes rules incorporated in prior compilations or supplements which are no longer effective;\n(4) include in Minnesota Rules a consolidated list of publications and other documents incorporated by reference into the rules after June 30, 1981, and found conveniently available by the revisor under section 14.07, subdivision 4, indicating where the publications or documents are conveniently available to the public; and\n(5) copyright any compilations and or supplements in the name of the state of Minnesota.\nThe revisor of statutes shall not:\n(1) alter the sense, meaning, or effect of any rule in the course of compiling or publishing it;\n(2) aid an agency in the preparation of any statement concerning the need for or reasonableness of a rule except as provided by section 14.07, subdivision 6;\n(3) act as legal counsel for an agency before an administrative law judge except as provided by section 14.07, subdivision 6.\nIn order to ensure that the complete text of rules is included in the first compilation published pursuant to subdivision 1, clause (2), and containing the revisor's certificate, the revisor may use the Minnesota Code of Agency Rules, the State Register, the rule files of the secretary of state, the files of individual agencies, the records of the administrative law judge's office, and the records of the attorney general. The revisor is not required to compare the text of a rule as shown by the other possible source documents with the text of the rule in the secretary of state's file.\nIf any comparison of documents shows there is a material discrepancy in the text of the rule, the revisor shall include in Minnesota Rules the text in the secretary of state's files unless the discrepancy between the secretary of state's files and any of the other documents is the result of an obvious unintentional omission or clerical error. The text published by the revisor shall correct those omissions and errors. The revisor shall add an appropriate footnote describing the apparent discrepancy in text. Before publication of Minnesota Rules, the revisor shall also notify the agency whose rules are affected, the attorney general, the chief administrative law judge, and the Legislative Coordinating Commission about the omission or error.\nIf any comparison of documents shows that a rule has been filed with the secretary of state but apparently has not been published in the State Register as required by law the revisor may, unless the attorney general objects, include the rule in Minnesota Rules or omit the rule if the rule was a repeal but shall add an appropriate footnote describing the apparent fault. Before publication of Minnesota Rules, the revisor shall notify the agency whose rules are affected, the attorney general, the chief administrative law judge, and the Legislative Commission to Review Administrative Rules about the apparent lack of publication.\nIf a comparison of documents shows that a rule as adopted in the State Register has apparently not been filed with the secretary of state, the revisor may not publish the rule in Minnesota Rules unless the attorney general approves the publication. Before publication of Minnesota Rules the revisor shall notify the agency affected, the attorney general, the chief administrative law judge and the Legislative Commission to Review Administrative Rules of the apparent lack of filing of the rule. If the revisor publishes the rule, the revisor shall add an appropriate footnote describing the apparent lack of filing.\nThe revisor of statutes shall file with the secretary of state one copy of each compilation or supplement which is published. The first compilation shall contain the revisor's certificate that the rules contained in it have been incorporated into the compilation in the manner required by law and that the incorporation is correct. Each copy thereafter shall contain the revisor's certificate that the rules added to the compilation or supplement have been compared to the original rules filed with the secretary of state and are correctly incorporated into the compilation.\n(a) In preparing a compilation or supplement, the revisor may:\n(1) renumber rule parts, subparts, or other divisions of a rule part;\n(2) combine or divide rule parts, subparts, or other divisions of a rule part;\n(3) rearrange the order of rule parts, subparts, or other divisions of a rule part;\n(4) move subparts or other divisions of a rule part to another rule part;\n(5) remove redundant language;\n(6) make minor punctuation and grammatical changes to facilitate the renumbering, combining, dividing, and rearranging of rule parts, subparts, or other divisions of a rule part;\n(7) change reference numbers to agree with renumbered rule parts, subparts, or other divisions of a rule part;\n(8) change reference numbers to agree with renumbered statutes or divisions of statutes;\n(9) substitute the proper rule part, subpart, or other division of a rule part for the term \"this rule,\" \"the preceding rule\" and the like;\n(10) substitute numbers for written words and written words for numbers;\n(11) substitute the term \"rule\" for the term \"regulation\" when \"regulation\" refers to a Minnesota rule;\n(12) substitute the date on which the rule becomes effective for the words \"the effective date of this rule,\" and the like;\n(13) change capitalization, punctuation, and forms of citation for the purpose of uniformity;\n(14) convert citations of Laws of Minnesota to citations of Minnesota Statutes;\n(15) correct manifest clerical or typographical errors;\n(16) correct all misspelled words;\n(17) correct manifest grammatical and punctuation errors;\n(18) replace gender specific words with gender neutral words and, if necessary, recast sentences containing gender specific words; and\n(19) make other editorial changes to ensure the accuracy and utility of the compilation or supplement.\n(b) The revisor shall provide headnotes as catch words to rule parts and subparts. The headnotes are not part of the rule even if included with the rule when adopted. The revisor may change a headnote to clearly indicate the subject matter of a rule part or subpart. \"Headnote\" means any text functioning as catch words to the substance of text and not itself communicating the substantive content of the rule part or subpart.\n(a) For purposes of any compilation or publication of the rules, the revisor, unless the attorney general objects, may omit any extraneous descriptive or informative text that is not an operative portion of the rule. The revisor may also omit effective date provisions, statements that a rule is repealed, prefaces, appendices, guidelines, organizational descriptions, explanations of federal or state law, and similar material. The revisor shall consult with the agency, the attorney general, the Legislative Coordinating Commission, and the chief administrative law judge before omitting text from publication.\n(b) For the purposes of any compilation or publication of the rules, the revisor, unless the attorney general objects, may omit any rules that, by their own terms, are no longer effective or have been repealed directly by the agency, repealed by the legislature, or declared unconstitutional or otherwise void by a court of last resort. The revisor shall consult the agency involved, the attorney general, the chief administrative law judge, and the Legislative Coordinating Commission before omitting a rule from publication.\nInsofar as economically feasible, the revisor shall utilize the same equipment, computer assistance and procedures for drafting agency rules and publishing compilations and supplements as for preparing bill drafts and statutory publications.\nAny compilation, reissue, or supplement published by the revisor shall be sold by the revisor for a reasonable fee and its proceeds deposited in the general fund. An agency shall purchase from the revisor the number of copies of the compilation or supplement needed by the agency. The revisor shall provide without charge copies of each edition of any compilation, reissue, or supplement to the persons or bodies listed in this subdivision. Those copies must be marked with the words \"State Copy\" and kept for the use of the office. The revisor shall distribute:\n(a) 25 copies to the Office of the Attorney General;\n(b) two copies to the leader of each caucus in the house of representatives and the senate, two copies to the Legislative Reference Library, and one copy each to the House of Representatives Research Department and the Office of Senate Counsel and Research;\n(c) three copies to the revisor of statutes for transmission to the Library of Congress for copyright and depository purposes;\n(d) 150 copies to the State Law Library;\n(e) ten copies to the law school of the University of Minnesota;\n(f) one copy of any compilation or supplement to each county library maintained pursuant to section 134.12 upon its request, except in counties containing cities of the first class. If a county has not established a county library pursuant to section 134.12, the copy will be provided to any public library in the county upon its request; and\n(g) three copies to the Office of Administrative Hearings.\nNotwithstanding any provision of law to the contrary, the revisor of statutes may obtain competitive bids from and enter into contracts with the lowest responsible bidder for compiling, editing, indexing, composition, printing, binding, distribution, or other services, if the work either cannot be performed by the revisor or it is uneconomical for the revisor to do so.",
	"repealed": false
}