{
	"id": "125A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.63",
	"title": "125A.63 RESOURCES; DEAF OR HARD-OF-HEARING AND BLIND OR VISUALLY IMPAIRED.",
	"text": "[Repealed, 1Sp2015 c 3 art 5 s 31]\n(a) The department must offer summer institutes or other training programs throughout the state for deaf or hard-of-hearing, blind or visually impaired, and multiply disabled pupils. The department must also offer workshops for teachers, and leadership development for teachers.\n(b) Training and workshop programs offered under paragraph (a) must help promote and develop education programs offered by school districts or other organizations. The programs must assist school districts or other organizations to develop innovative programs.\nThe department may contract to have nonprofit organizations provide programs under subdivision 2.\n(a) The commissioner shall establish advisory committees for the deaf and hard-of-hearing and for the blind and visually impaired. The advisory committees shall develop recommendations and submit an annual report to the commissioner on the form and in the manner prescribed by the commissioner.\n(b) The advisory committees for the deaf and hard-of-hearing and for the blind and visually impaired shall meet periodically at least four times per year. The committees must each review, approve, and submit a biennial report to the commissioner, the education policy and finance committees of the legislature, and the Commission of the Deaf, DeafBlind and Hard of Hearing. The reports must, at least:\n(1) identify and report the aggregate, data-based education outcomes for children with the primary disability classification of deaf and hard-of-hearing or of blind and visually impaired, consistent with the commissioner's child count reporting practices, the commissioner's state and local outcome data reporting system by district and region, and the school performance report cards under section 120B.36, subdivision 1; and\n(2) describe the implementation of a data-based plan for improving the education outcomes of deaf and hard-of-hearing or blind and visually impaired children that is premised on evidence-based best practices, and provide a cost estimate for ongoing implementation of the plan.\n(a) The coordinator shall:\n(1) collaborate with the early hearing detection and intervention coordinator for the Department of Health, deaf and hard-of-hearing state specialist, and the Department of Health Early Hearing Detection and Intervention Advisory Council;\n(2) coordinate and support Department of Education and Department of Children, Youth, and Families early hearing detection and intervention teams;\n(3) leverage resources by serving as a liaison between interagency early intervention committees; part C coordinators from the Departments of Education, Health, and Human Services; Department of Education regional low-incidence facilitators; service coordinators from school districts; Minnesota children with special health needs in the Department of Health; public health nurses; child find; Department of Human Services Deaf and Hard-of-Hearing Services Division; and others as appropriate;\n(4) identify, support, and promote culturally appropriate and evidence-based early intervention practices for infants with hearing loss, and provide training, outreach, and use of technology to increase consistency in statewide service provision;\n(5) identify culturally appropriate specialized reliable and valid instruments to assess and track the progress of children with hearing loss and promote their use;\n(6) ensure that early childhood providers, parents, and members of the individual family service and intervention plan are provided with child progress data resulting from specialized assessments;\n(7) educate early childhood providers and teachers of the deaf and hard-of-hearing to use developmental data from specialized assessments to plan and adjust individual family service plans; and\n(8) make recommendations that would improve educational outcomes to the early hearing detection and intervention committee, the commissioners of education; children, youth, and families; and health, the Commission of the Deaf, DeafBlind and Hard of Hearing, and the advisory council for the deaf and hard-of-hearing.\n(b) The Department of Education and Department of Children, Youth, and Families must provide aggregate data regarding outcomes of deaf and hard-of-hearing children who receive early intervention services within the state in accordance with the state performance plan.",
	"repealed": false
}