{
	"id": "571.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.74",
	"title": "571.74 GARNISHMENT SUMMONS AND NOTICE TO DEBTOR.",
	"text": "The garnishment summons and notice to debtor must be substantially in the following form. The notice to debtor must be in no smaller than 14-point type.\nGARNISHMENT SUMMONS\nThe State of Minnesota\nTo the Garnishee named above:\nYou are hereby summoned and required to serve upon the creditor's attorney (or the creditor if not represented by an attorney) and on the debtor within 20 days after service of this garnishment summons upon you, a written disclosure, of the nonexempt indebtedness, money, or other property due or belonging to the debtor and owing by you or in your possession or under your control and answers to all written interrogatories that are served with the garnishment summons. However, if the garnishment is on earnings and the debtor has garnishable earnings, you shall serve the completed disclosure form on the creditor's attorney, or the creditor if not represented by an attorney, within ten days of the last payday to occur within the 90 days after the date of the service of this garnishment summons. \"Payday\" means the day which you pay earnings in the ordinary course of business. If the debtor has no regular paydays, \"payday\" means the 15th day and the last day of each month.\nYour disclosure need not exceed 110 percent of the amount of the creditor's claim that remains unpaid.\nYou shall retain garnishable earnings, other indebtedness, money, or other property in your possession in an amount not to exceed 110 percent of the creditor's claim until such time as the creditor causes a writ of execution to be served upon you, until the debtor authorizes you in writing to release the property to the creditor, or until the expiration of ...... days from the date of service of this garnishment summons upon you, at which time you shall return the disposable earnings, other indebtedness, money, or other property to the debtor.\nEARNINGS\nIn the event you are summoned as a garnishee because you owe \"earnings\" (as defined on the Earnings Garnishment Disclosure form attached to this Garnishment Summons, if applicable) to the debtor, then you are required to serve upon the creditor's attorney, or the creditor if not represented by an attorney, a written earnings disclosure form within the time limit set forth above.\nIn the case of earnings you are further required to retain in your possession all unpaid nonexempt disposable earnings owed or to be owed by you and earned or to be earned to the debtor within the pay period in which this garnishment summons is served and within all subsequent pay periods whose paydays (defined above) occur within the 90 days after the date of service of this garnishment summons.\nAny assignment of earnings made by the debtor to any party within ten days before the receipt of the first garnishment on a debt is void. Any indebtedness to you incurred by the debtor within the ten days before the receipt of the first garnishment on a debt may not be set off against amounts otherwise subject to the garnishment.\nYou are prohibited by law from discharging or disciplining the debtor because the debtor's earnings have been subject to garnishment.\nThis Garnishment Summons includes:\n(check applicable box)\nNOTICE TO DEBTOR\nA Garnishment Summons, Earnings Garnishment Disclosure form, Nonwage Garnishment Disclosure form, Garnishment Exemption Notices and/or written Interrogatories (strike out if not applicable), copies of which are hereby served on you, were served upon the Garnishee by delivering copies to the Garnishee. The Garnishee was paid $15.",
	"repealed": false
}