{
	"id": "116G.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/116G.07",
	"title": "116G.07 PREPARING, REVIEWING, AND APPROVING PLANS AND REGULATIONS.",
	"text": "(a) Within 30 days of receiving notification of the designation of an area or areas of critical concern within its jurisdiction, the local unit of government shall submit existing plans and regulations which deal with or affect the area or areas so designated to the appropriate regional development commission or to the board if no regional development commission has been established.\n(b) If no plans or regulations exist, the local unit of government shall upon receiving notification of the designation of an area or areas of critical concern within its jurisdiction:\n(1) Within six months of said notification prepare plans and regulations for the designated area or areas of critical concern and submit them to the appropriate regional development commission for review; or\n(2) Within 30 days of said notification request that the appropriate regional development commission prepare plans and regulations for the area or areas of critical concern. Within six months of receipt of such request, the regional development commission shall prepare said plans and regulations and submit them to the board for review. If no regional development commission has been established, the local unit of government may request that the board prepare plans and rules for adoption by the local unit of government.\nWithin 45 days of receiving plans and regulations from the local unit of government under the provisions of subdivision 1, the regional development commission shall review the plans and regulations to determine their consistency with regional objectives and the provisions of the order designating the areas of critical concern and transmit its recommendations, together with the plans and regulations, to the board.\n(a) Within 45 days of receiving plans and regulations from the local unit of government or a regional development commission, the board shall review the plans and regulations to determine their consistency with the provisions of the order designating the area, the recommendations of the regional development commission, and the review comments of such state agencies as the board shall deem appropriate, and shall either approve the plans and regulations by written order or return them to the local unit of government or regional development commission for modification along with a written explanation of the need for modification.\n(b) Plans and regulations which are returned to the local unit of government or regional development commission for modification shall be revised consistent with the instructions of the board and resubmitted to the board within 60 days of their receipt, provided that final revision need not be made until a formal meeting has been held with the board on the plans and regulations if requested by the local unit of government or regional development commission.\n(c) Plans or regulations prepared pursuant to this section shall become effective when enacted by the local unit of government or, following legislative or regional development commission approval of the designation, upon such date as the board may provide in its order approving said plans and regulations.\nPlans and regulations of local units of government within the Mississippi River Corridor Critical Area are exempt from subdivisions 1 to 3 and are subject to section 116G.15, subdivision 8.",
	"repealed": false
}