{
	"id": "51A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.11",
	"title": "51A.11 ACCESS TO BOOKS AND RECORDS; COMMUNICATION WITH MEMBERS OR STOCKHOLDERS.",
	"text": "The right of inspection and examination of the books and records of an association including those pertaining to loans and accounts shall be limited (1) to the commissioner or duly authorized representatives as provided in sections 51A.01 to 51A.57, (2) to persons duly authorized by the association to act for the association, (3) to affiliates, and (4) to any federal or state instrumentality or agency authorized by the association to inspect or examine the books and records of an insured association. The books and records pertaining to the accounts, loans, and voting rights of depositors, borrowers, or stockholders shall otherwise be kept confidential by such association, its directors, officers, and employees, and by the commissioner, the commissioner's examiners and representatives, except where the disclosure thereof shall be compelled by a court of competent jurisdiction or public authority in accordance with law, and no depositor, borrower, or stockholder or any other person shall have access to the books and records or shall be furnished or shall possess a partial or complete list of the depositors, borrowers, or stockholders except upon authority of the board of directors.\nIn the event, however, that any member, members, stockholder, or stockholders desires to communicate with the other members or stockholders of the association with reference to any question pending or to be presented for consideration at a meeting of the members or stockholders, the association shall furnish upon request a statement of the approximate number of members or stockholders of the association at the time of the request, and an estimate of the cost of forwarding the communication. The requesting member, members, stockholder, or stockholders shall then submit the communication, together with a sworn statement that the proposed communication is not for any reason other than the business welfare of the association, to the commissioner who, if the commissioner finds it to be appropriate, truthful, and in the best interests of the association and its members or stockholders, shall execute a certificate setting out the findings, forward the certificate together with the communication to the association, and direct that the communication be prepared and mailed by the association to the members or stockholders upon the requesting member's, members', stockholder's, or stockholders' payment to it of the expenses of the preparation and mailing. If the commissioner finds the proposed communication to be inappropriate, untruthful, or contrary to the best interests of the association and its members or stockholders, the commissioner shall have the discretion to make any disposition of the request to communicate which the commissioner deems proper and shall execute a certificate setting out the finding and deliver it to the requesting member or stockholder together with an order making disposition of the request.\n[Repealed, 1988 c 666 s 75]",
	"repealed": false
}