{
	"id": "122A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.31",
	"title": "122A.31 AMERICAN SIGN LANGUAGE/ENGLISH INTERPRETERS.",
	"text": "(a) In addition to any other requirements that a school district establishes, any person employed to provide American sign language/English interpreting or sign transliterating services on a full-time or part-time basis for a school district after July 1, 2000, must:\n(1) hold current interpreter or transliterator certificates awarded by the Registry of Interpreters for the Deaf (RID), or the general level interpreter proficiency certificate awarded by the National Association of the Deaf (NAD), or a comparable state certification from the commissioner of education, and satisfactorily complete an interpreter/transliterator training program affiliated with an accredited educational institution; or\n(2) hold a certified deaf interpreter certification issued by RID.\n(b) New graduates of an interpreter/transliterator program affiliated with an accredited education institution or deaf interpreters who have completed 40 hours of RID-approved continuing education units shall be granted a two-year provisional certificate by the commissioner. During the two-year provisional period, the interpreter/transliterator must develop and implement an education plan in collaboration with a mentor under paragraph (c).\n(c) A mentor of a provisionally certified interpreter/transliterator must be an interpreter/transliterator who has either NAD level IV or V certification or RID certified interpreter and certified transliterator certification and have at least three years of interpreting/transliterating experience in any educational setting. The mentor, in collaboration with the provisionally certified interpreter/transliterator, shall develop and implement an education plan designed to meet the requirements of paragraph (a), and include a weekly on-site mentoring process.\n(d) Consistent with the requirements of this paragraph, a person holding a provisional certificate may apply to the commissioner for one time-limited extension. The commissioner, in consultation with the Commission of the Deaf, DeafBlind and Hard of Hearing, must grant the person a time-limited extension of the provisional certificate based on the following documentation:\n(1) letters of support from the person's mentor, a parent of a pupil the person serves, the special education director of the district in which the person is employed, and a representative from the regional service center of the deaf and hard-of-hearing;\n(2) records of the person's formal education, training, experience, and progress on the person's education plan; and\n(3) an explanation of why the extension is needed.\nAs a condition of receiving the extension, the person must comply with a plan and the accompanying timeline for meeting the requirements of this subdivision. A committee composed of the deaf and hard-of-hearing state specialist, a representative of the Minnesota Association of Deaf Citizens, a representative of the Minnesota Registry of Interpreters for the Deaf, and other appropriate committee members selected by the commissioner must develop the plan and timeline for the person receiving the extension.\n(e) A school district may employ only an interpreter/transliterator who has been certified under paragraph (a) or (b), or for whom a time-limited extension has been granted under paragraph (d).\n(f) An interpreter who meets the requirements of paragraph (a) or (b) is \"essential personnel\" as defined in section 125A.76, subdivision 1.\n(a) In addition to any other requirements that a school district establishes, any person employed to provide oral transliterating or cued speech transliterating services on a full-time or part-time basis for a school district after July 1, 2000, must hold a current applicable transliterator certificate awarded by the national certifying association or comparable state certification from the commissioner of education.\n(b) To provide oral or cued speech transliterator services on a full-time or part-time basis, a person employed in a school district must comply with paragraph (a). The commissioner shall grant a nonrenewable, two-year certificate to a school district on behalf of a person who has not yet attained a current applicable transliterator certificate under paragraph (a). A person for whom a nonrenewable, two-year certificate is issued must work under the direction of a licensed teacher who is skilled in language development of individuals who are deaf or hard-of-hearing. A person for whom a nonrenewable, two-year certificate is issued also must enroll in a state-approved training program and demonstrate progress towards the certification required under paragraph (a) sufficient for the person to be certified at the end of the two-year period.\n(c) Consistent with the requirements of this paragraph, a person holding a provisional certificate may apply to the commissioner for one time-limited extension. The commissioner, in consultation with the Commission of the Deaf, DeafBlind and Hard of Hearing, must grant the person a time-limited extension of the provisional certificate based on the following documentation:\n(1) letters of support from the person's mentor, a parent of a pupil the person serves, the special education director of the district in which the person is employed, and a representative from the regional service center of the deaf and hard-of-hearing;\n(2) records of the person's formal education, training, experience, and progress on the person's education plan; and\n(3) an explanation of why the extension is needed.\nAs a condition of receiving the extension, the person must comply with a plan and the accompanying time line for meeting the requirements of this subdivision. A committee composed of the deaf and hard-of-hearing state specialist, a representative of the Minnesota Association of Deaf Citizens, a representative of the Minnesota Registry of Interpreters of the Deaf, and other appropriate persons selected by the commissioner must develop the plan and time line for the person receiving the extension.\nThe Department of Education state specialist for deaf and hard-of-hearing shall work with existing interpreter/transliterator training programs, other training/educational institutions, and the regional service centers to ensure that ongoing staff development training for educational interpreters/transliterators is provided throughout the state.\n(a) For purposes of revenue under section 125A.76, the Department of Education must only reimburse school districts for the services of those interpreters/transliterators who satisfy the standards of competency under this section.\n(b) Notwithstanding paragraph (a), a district shall be reimbursed for the services of interpreters with a nonrenewable provisional certificate, interpreters/transliterators employed to mentor the provisional certified interpreters, and persons for whom a time-limited extension has been granted under subdivision 1, paragraph (d), or subdivision 2, paragraph (c).",
	"repealed": false
}