{
	"id": "15.992",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.992",
	"title": "15.992 TIME LIMITATION.",
	"text": "Unless a shorter period is provided by law, all state agencies that must act on a customer's application for a license shall take final action on it within 60 days after the customer's submission of a completed application to the responsible agency or within 60 days after the customer has been provided with a work plan under section 15.991, subdivision 2, paragraph (c), whichever is later. If action on the application is not completed within 60 days, the license is deemed to be granted. The time period specified in this subdivision does not begin to run until the customer has completed any required application in complete, correct form and has provided any additional required information or documentation.\nAn agency may provide for a longer time for the conclusion of action on an application, by itself and by another agency or agencies, if:\n(1) the agency states in writing to the customer that a longer time is needed to protect against serious and significant harm to the public health, safety, or welfare, states the reason why, and specifies the additional time needed;\n(2) the agency states in writing to the customer that a longer time is needed to comply with state or federal requirements, states the requirements, and specifies the additional time needed; or\n(3) an agency that must take action on an application is a multimember board that meets periodically, in which case the agency must complete its action within 60 days after its first meeting after receipt of the application, or within a longer period established under clause (1) or (2).\nThis section does not apply to an application requiring one or more public hearings or an environmental impact statement or environmental assessment worksheet.\nWhen a license is deemed granted under subdivision 1, this section does not limit the right of an agency to suspend, limit, revoke, or change a license for failure of the customer to comply with applicable laws or rules.\nA decision of an agency under subdivision 2 that a time longer than 60 days is needed to complete action on an application is not subject to judicial review.",
	"repealed": false
}