{
	"id": "349.2125",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.2125",
	"title": "349.2125 CONTRABAND.",
	"text": "The following are contraband:\n(1) all pull-tab or tipboard deals, paddle ticket cards, or raffle boards not bar coded in accordance with this chapter or chapter 297E;\n(2) all pull-tab or tipboard deals or raffle boards in the possession of any unlicensed person, firm, or organization;\n(3) any container used for the storage and display of any contraband pull-tab or tipboard deals or raffle boards as defined in clauses (1) and (2);\n(4) all currency, checks, and other things of value used for pull-tab, tipboard, or raffle board transactions not expressly permitted under this chapter, and any cash drawer, cash register, or any other container used for illegal pull-tab, tipboard, or raffle board transactions including its contents;\n(5) any device including, but not limited to, motor vehicles, trailers, snowmobiles, airplanes, and boats used, with the knowledge of the owner or of a person operating with the consent of the owner, for the storage or transportation of more than five pull-tab or tipboard deals or raffle boards that are contraband under this subdivision. When pull-tabs, tipboards, or raffle boards are being transported in the course of interstate commerce between locations outside this state, the pull-tab and tipboard deals or raffle boards are not contraband, notwithstanding the provisions of clauses (1) and (12);\n(6) any unaffixed registration stamps except as provided in section 349.162, subdivision 4;\n(7) any prize used or offered in a game utilizing contraband as defined in this subdivision;\n(8) any altered, modified, or counterfeit pull-tab or tipboard ticket or raffle board;\n(9) any unregistered gambling equipment except as permitted by this chapter;\n(10) any gambling equipment kept in violation of section 349.18;\n(11) any gambling equipment not in conformity with law or board rule;\n(12) any pull-tab or tipboard deal or raffle board in the possession of a person other than a licensed distributor or licensed manufacturer for which the person, upon demand of a licensed peace officer or authorized agent of the commissioner of revenue or director of alcohol and gambling enforcement, does not immediately produce for inspection the invoice or a true and correct copy of the invoice for the acquisition of the deal or board from a licensed distributor;\n(13) any pull-tab or tipboard deals or raffle boards or portions of deals or boards on which the tax imposed under chapter 297E has not been paid; and\n(14) any device prohibited by section 609.76, subdivisions 4 to 6.\nProperty made contraband by subdivision 1 may be seized by the commissioner of revenue or the director of alcohol and gambling enforcement or their authorized agents or by any sheriff or other police officer, hereinafter referred to as the seizing authority, with or without process, and shall be subject to forfeiture as provided in subdivisions 3 and 4.\nWithin ten days after the seizure of any alleged contraband, the person making the seizure shall make available an inventory of the property seized to the person from whom the property was seized, if known, and file a copy with the commissioner of revenue or the director of alcohol and gambling enforcement. Within ten days after the date of service of the inventory, the person from whom the property was seized or any person claiming an interest in the property may file with the seizing authority a demand for judicial determination of whether the property was lawfully subject to seizure and forfeiture. Within 60 days after the date of filing of the demand, the seizing authority must bring an action in the district court of the county where seizure was made to determine the issue of forfeiture. The action must be brought in the name of the state and be prosecuted by the county attorney or by the attorney general. The court shall hear the action without a jury and determine the issues of fact and laws involved. When a judgment of forfeiture is entered, the seizing authority may, unless the judgment is stayed pending an appeal, either (1) cause the forfeited property to be destroyed; or (2) cause it to be sold at a public auction as provided by law.\nIf demand for judicial determination is made and no action is commenced by the seizing authority as provided in this subdivision, the property must be released by the seizing authority and delivered to the person entitled to it. If no demand is made, the property seized is considered forfeited to the seizing authority by operation of law and may be disposed of by the seizing authority as provided where there has been a judgment of forfeiture. When the seizing authority is satisfied that a person from whom property is seized was acting in good faith and without intent to evade a tax imposed by chapter 297E, the seizing authority shall release the property seized without further legal proceedings.\n(a) The property described in subdivision 1, clauses (4) and (5), must be confiscated after conviction of the person from whom it was seized, upon compliance with the following procedure: the seizing authority shall file with the court a separate complaint against the property, describing it and charging its use in the specific violation, and specifying substantially the time and place of the unlawful use. A copy of the complaint must be served upon the defendant or person in charge of the property at the time of seizure, if any. If the person arrested is acquitted, the court shall dismiss the complaint against the property and order it returned to the persons legally entitled to it. Upon conviction of the person arrested, the court shall issue an order directed to any person known or believed to have any right, title or interest in, or lien upon, any of the property, and to persons unknown claiming any right, title, interest, or lien in it, describing the property and (1) stating that it was seized and that a complaint against it, charging the specified violation, has been filed with the court, (2) requiring the persons to file with the court administrator their answer to the complaint, setting forth any claim they may have to any right or title to, interest in, or lien upon the property, within 30 days after the service of the order, and (3) notifying them in substance that if they fail to file their answer within the time, the property will be ordered sold by the seizing authority. The court shall cause the order to be served upon any person known or believed to have any right, title, interest, or lien as in the case of a summons in a civil action, and upon unknown persons by publication, as provided for service of summons in a civil action. If no answer is filed within the time prescribed, the court shall, upon affidavit by the court administrator, setting forth the fact, order the property sold by the seizing authority. Seventy percent of the proceeds of the sale of forfeited property, after payment of seizure, storage, forfeiture and sale expenses, must be forwarded to the seizing authority for deposit as a supplement to its operating fund or similar fund for official use, and 20 percent must be forwarded to the county attorney or other prosecuting agency that handled the forfeiture for deposit as a supplement to its operating fund or similar fund for prosecutorial purposes. The remaining ten percent of the proceeds must be forwarded within 60 days after resolution of the forfeiture to the Department of Human Services to fund programs for the treatment of compulsive gamblers. If answer is filed within the time provided, the court shall fix a time for a hearing, which shall be not less than ten nor more than 30 days after the time for filing answer expires. At the time fixed for hearing, unless continued for cause, the matter shall be heard and determined by the court, without a jury, as in other civil actions.\n(b) If the court finds that the property, or any part of it, was used in the violation specified in the complaint, it shall order the property unlawfully used, sold as provided by law, unless the owner shows to the satisfaction of the court that the owner had no notice or knowledge or reason to believe that the property was used or intended to be used in the violation. The officer making a sale, after deducting the expense of keeping the property, the fee for seizure, and the costs of the sale, shall pay all liens according to their priority, which are established at the hearing as being bona fide and as existing without the lienor having any notice or knowledge that the property was being used or was intended to be used for or in connection with the violation specified in the order of the court, and shall pay the balance of the proceeds to the seizing authority for official use and sharing in the manner provided in paragraph (a). A sale under this section shall free the property sold from any and all liens on it. Appeal from the order of the district court will lie as in other civil cases. At any time after seizure of the articles specified in this subdivision, and before the hearing provided for, the property must be returned to the owner or person having a legal right to its possession, upon execution of a good and valid bond to the state, with corporate surety, in the sum of not less than $100 and not more than double the value of the property seized, to be approved by the court in which the case is triable, or a judge of it, conditioned to abide any order and the judgment of the court, and to pay the full value of the property at the time of the seizure. The seizing authority may dismiss the proceedings outlined in this subdivision when the seizing authority considers it to be in the public interest to do so.",
	"repealed": false
}