{
	"id": "152.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.12",
	"title": "152.12 HEALTH CARE PROVIDERS MAY PRESCRIBE.",
	"text": "A licensed doctor of medicine, a doctor of osteopathic medicine, duly licensed to practice medicine, a doctor of dental surgery, a doctor of dental medicine, a licensed doctor of podiatry, a licensed advanced practice registered nurse, a licensed physician assistant, or a licensed doctor of optometry limited to Schedules IV and V, and in the course of professional practice only, may prescribe, administer, and dispense a controlled substance included in Schedules II through V of section 152.02, may cause the same to be administered by a nurse, an intern or an assistant under the direction and supervision of the doctor, and may cause a person who is an appropriately certified and licensed health care professional to prescribe and administer the same within the expressed legal scope of the person's practice as defined in Minnesota Statutes.\nA licensed doctor of veterinary medicine, in good faith, and in the course of professional practice only, and not for use by a human being, may prescribe, administer, and dispense a controlled substance included in Schedules II through V of section 152.02, and may cause the same to be administered by an assistant under the direction and supervision of the doctor.\nAny qualified person may use controlled substances in the course of a bona fide research project but cannot administer or dispense such drugs to human beings unless such drugs are prescribed, dispensed and administered by a person lawfully authorized to do so. Every person who engages in research involving the use of such substances shall apply annually for registration by the state Board of Pharmacy and shall pay any applicable fee specified in section 151.065, provided that such registration shall not be required if the person is covered by and has complied with federal laws covering such research projects.\nNothing in this chapter shall prohibit the sale to, or the possession of, a controlled substance in Schedule II, III, IV or V by: Registered drug wholesalers, registered manufacturers, registered pharmacies, or any licensed hospital or other licensed institutions wherein sick and injured persons are cared for or treated, or bona fide hospitals wherein animals are treated; or by licensed pharmacists, licensed doctors of medicine, doctors of osteopathic medicine duly licensed to practice medicine, licensed doctors of dental surgery, licensed doctors of dental medicine, licensed doctors of podiatry, licensed doctors of optometry limited to Schedules IV and V, or licensed doctors of veterinary medicine when such practitioners use controlled substances within the course of their professional practice only.\nNothing in this chapter shall prohibit the possession of a controlled substance in Schedule II, III, IV or V by an employee or agent of a registered drug wholesaler, registered manufacturer, or registered pharmacy, while acting in the course of employment; by a patient of a licensed doctor of medicine, a doctor of osteopathic medicine duly licensed to practice medicine, a licensed doctor of dental surgery, a licensed doctor of dental medicine, or a licensed doctor of optometry limited to Schedules IV and V; or by the owner of an animal for which a controlled substance has been prescribed by a licensed doctor of veterinary medicine, when such controlled substances are dispensed according to law.\nNothing in this chapter shall prohibit an analytical laboratory from conducting an anonymous analysis service when such laboratory is registered by the Federal Drug Enforcement Administration, nor prohibit the possession of a controlled substance by an employee or agent of such analytical laboratory while acting in the course of employment.",
	"repealed": false
}