{
	"id": "119A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/119A.37",
	"title": "119A.37 GRANTS FOR PARENTING TIME CENTERS.",
	"text": "The commissioner shall issue a request for proposals from existing local nonprofit, nongovernmental, or governmental organizations, to use existing local facilities as parenting time centers which may also be used for parenting time exchanges. The commissioner shall award grants in amounts up to $50,000 for the purpose of creating or maintaining parenting time centers in an effort to reduce children's vulnerability to violence and trauma related to parenting time, where there has been a history of domestic violence or abuse within the family. The commissioner shall award the grants to provide the greatest possible number of parenting time centers and to locate them to provide for the broadest possible geographic distribution of the centers throughout the state.\nEach parenting time center must use existing local facilities to provide a healthy interactive environment for parents who are separated or divorced and for parents with children in foster homes to visit with their children. The centers must be available for use by district courts who may order parenting time to occur at a parenting time center. The centers may also be used as drop-off sites, so that parents who are under court order to have no contact with each other can exchange children for parenting time at a neutral site. Each center must provide sufficient security to ensure a safe parenting time environment for children and their parents. A grantee must demonstrate the ability to provide a 25 percent local match, which may include in-kind contributions.\nEach county or group of counties is encouraged to provide supervised parenting time services in an effort to fill the gap in the court system that orders supervised parenting time but does not provide a center to accomplish the supervised parenting time as ordered. Each county or group of counties is encouraged to either financially contribute to an existing parenting time center in the area, or establish a new center if there is not one in the area, possibly through county social services. In creating a new center, the county may collaborate with other counties, other parenting time centers, family services collaboratives, court services, and any other entity or organization. The goal is to provide parenting time centers statewide. The county shall apply for funding that may be available through the federal government, specifically for family preservation or family reunification purposes, or any other source of funding that will aid in developing and maintaining this vital service.\nThe commissioner may award grants to create or maintain parenting time centers.\nIn awarding grants to maintain a parenting time center, the commissioner may award a grant to a center that can demonstrate a 25 percent local match, provided the center is diligently exploring and pursuing all available funding options in an effort to become self-sustaining, and those efforts are reported to the commissioner.\nIn awarding grants to create a parenting time center, the commissioner shall give priority to:\n(1) areas of the state where no other parenting time center or similar facility exists;\n(2) applicants who demonstrate that private funding for the center is available and will continue; and\n(3) facilities that are adapted for use to care for children, such as day care centers, religious institutions, community centers, schools, technical colleges, parenting resource centers, and child care referral services.\nIn awarding grants to create or maintain a parenting time center, the commissioner shall require the proposed center to meet standards developed by the commissioner to ensure the safety of the custodial parent and children.\nEach parenting time center may provide parenting and child development classes, and offer support groups to participating custodial parents and hold regular classes designed to assist children who have experienced domestic violence and abuse. Each parenting time center must have available an individual knowledgeable about or experienced in the provision of services to battered women and domestic abuse victims on its staff, its board of directors, or otherwise available to it for consultation.\nIn administering the grants authorized by this section, the commissioner shall ensure that the term \"parenting time center\" is used in all future applications, publicity releases, requests for proposals, and other materials of like nature. Materials published prior to the enactment of this legislation which use different terms may be distributed by the commissioner until supplies are gone.",
	"repealed": false
}