{
	"id": "252.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.28",
	"title": "252.28 COMMISSIONER OF HUMAN SERVICES; DUTIES.",
	"text": "MS 2020 [Repealed, 2021 c 30 art 13 s 84]\nThe commissioner of human services shall:\n(1) Establish uniform rules and program standards for each type of residential and day facility or service for persons with developmental disabilities, including state hospitals under control of the executive board and serving persons with developmental disabilities, and excluding persons with developmental disabilities residing with their families.\n(2) Grant licenses according to the provisions of Laws 1976, chapter 243, sections 2 to 13.\n(a) No new license shall be granted pursuant to this section when the issuance of the license would substantially contribute to an excessive concentration of community residential facilities within any town, municipality or county of the state.\n(b) In determining whether a license shall be issued pursuant to this subdivision, the commissioner of human services shall specifically consider the population, size, land use plan, availability of community services and the number and size of existing public and private community residential facilities in the town, municipality or county in which a licensee seeks to operate a residence. Under no circumstances may the commissioner newly license any facility pursuant to this section except as provided in section 245A.11. The commissioner of human services shall establish uniform rules to implement the provisions of this subdivision.\n(c) Licenses for community facilities and services shall be issued pursuant to section 245.821.\n(d) No new license shall be granted for a residential program that provides home and community-based waivered services to more than four individuals at a site, except as authorized by the commissioner for emergency situations that would result in the placement of individuals into regional treatment centers. Such licenses shall not exceed 24 months.\n(e) The commissioner shall not approve a determination of need application that requests that an existing residential program license under chapter 245D be modified in a manner that would result in the issuance of two or more licenses for the same residential program at the same location.\n(a) Notwithstanding the provisions of subdivision 3, the commissioner may license service sites, each accommodating up to six residents moving from a 48-bed intermediate care facility for persons with developmental disabilities located in Dakota County that is closing under section 252.292.\n(b) Notwithstanding the provisions of any other state law or administrative rule, the rate provisions of section 256I.05, subdivision 1, apply to the exception in this subdivision.\n(c) If a service site is licensed for six persons according to this subdivision, the capacity of the license may remain at six persons.\n(a) Notwithstanding subdivision 3, the commissioner may license service sites each accommodating up to five residents moving from a 43-bed intermediate care facility for persons with developmental disabilities located in Olmsted County that is closing under section 252.292.\n(b) Notwithstanding the provisions of any other state law or administrative rule, the rate provisions of section 256I.05, subdivision 1, apply to the exception in this subdivision.\n(c) If a service site is licensed for five persons according to this subdivision, the capacity of the license may remain at five persons.\nThe commissioner shall promulgate in rule criteria for decertification of beds in intermediate care facilities for persons with developmental disabilities, and shall encourage providers in voluntary decertification efforts. The commissioner shall not recommend to the commissioner of health the involuntary decertification of an intermediate care facility for beds for persons with developmental disabilities prior to the availability of appropriate services for those residents affected by the decertification. The commissioner of health shall decertify those intermediate care beds determined to be not needed by the commissioner of human services.\nMS 2020 [Repealed, 2021 c 30 art 13 s 84]",
	"repealed": false
}