{
	"id": "473.4052",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4052",
	"title": "473.4052 RIGHT-OF-WAY USE; CONTRACTS; LIABILITY.",
	"text": "(a) The location of light rail transit in a shared corridor that is within or adjacent to right-of-way used for freight rail purposes is a public purpose.\n(b) The council, a metropolitan county, or a public entity contracting with the council or county may contract with a railroad for (1) the use of right-of-way for light rail transit and freight rail purposes, or (2) the construction, operation, or maintenance of rail track, facilities, or services for light rail transit and freight rail purposes in a shared corridor that is within or adjacent to the right-of-way.\n(c) Notwithstanding any law to the contrary, a contract under paragraph (b) may also provide for the allocation of financial responsibility, indemnification, and the procurement of insurance for the parties for all types of claims or damages.\n(d) A contract entered into under this section does not affect rights of employees under the federal Employers' Liability Act (1908) (Railroads), Statutes at Large, volume 35, chapter 149, or the federal Railway Labor Act, Statutes at Large, volume 44, chapter 347.\nNotwithstanding any law to the contrary, a railroad and its employees operating within a shared corridor as described in subdivision 1 has the same limits to liability for all types of claims or damages as provided to a municipality under sections 466.04 and 466.06, in an action arising from or related to an incident occurring within, along, or adjacent to the shared corridor. The liability limits under this subdivision apply when the claims or damages would not have occurred but for light rail transit, including, but not limited to, light rail transit track, facilities, services, construction, improvements, maintenance, and operations.\n(a) Where the council and the railroad have entered into a contract pursuant to subdivision 1, the council must procure insurance as commercially available that is consistent with the amount of the damages limitation established under United States Code, title 49, section 28103(a)(2), as indexed under Fixing America's Surface Transportation Act, Public Law 114-94, section 11415.\n(b) The council must procure insurance required by paragraph (a) so that it is in place and effective when light rail vehicles are operating during prerevenue testing and revenue service. This minimum insurance requirement is satisfied by an overall railroad liability policy covering all of the council's railroad obligations, and a separate policy is not required for each freight railroad or each project.\n(c) Procurement of insurance as required by this subdivision constitutes a waiver of the liability limits for the railroad and the council under sections 466.04 and 466.06 only to the extent that the insurance procured by the council pays the claim on an incident that occurred within, along, or adjacent to the shared corridor.\n(d) Insurance procured by the railroad itself shall not create or be construed to be a waiver of the liability limits for the railroad established under subdivision 2.\nThe liability limits under subdivision 2 and the insurance requirements under subdivision 3 apply only for that segment of a light rail transit line or line extension in which the project formally entered the engineering phase of the Federal Transit Administration's \"New Starts\" capital investment grant program between August 1, 2016, and December 31, 2016.",
	"repealed": false
}