{
	"id": "165.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/165.08",
	"title": "165.08 BRIDGE OVER WATERS BETWEEN STATES OR NATIONS.",
	"text": "When a trunk highway leads to waters forming the boundary between this state and an adjoining nation or province thereof, and the Congress of the United States has authorized the construction of a bridge or bridges over the waters, the commissioner may enter into equitable agreements with the authorized authorities of the nation or province providing for the purchase, construction, reconstruction, maintenance, repair, and operation of the bridge or bridges, and for the division of costs and responsibilities to be borne by each therefor. The bridge or bridges shall thereafter be constructed, reconstructed, maintained, improved, and operated in accordance with the agreement. Such equitable agreement may create a joint and independent international authority or commission, which may independently purchase, construct, reconstruct, maintain, improve, repair and operate the bridge or bridges in accordance with the agreement.\nThe agreement may provide that such bridges may be operated as free bridges or as toll bridges. If the latter, tolls may be collected for the use thereof at rates sufficient to liquidate the capital costs in a reasonable period of time, and after the liquidation of such capital costs, tolls may continue to be charged so as to defer any costs of reconstruction, maintenance, repair, improvement and operation which are thereafter incurred.\nWhen any trunk highway leads to a toll bridge over boundary waters between this state and an adjoining nation or province, and such bridge is owned by a municipality of this state, the commissioner may purchase such bridge and assume the obligations of any bonds issued for the construction of such bridge and still outstanding at the time of purchase. Such bridge may be purchased under agreement with the adjoining nation or province, or may be purchased in its entirety with trunk highway funds. Upon such purchase, the bridge may be operated as a free bridge or as a toll bridge. If such bridge is operated as a toll bridge, the commissioner may collect tolls for the use of the bridge in such amounts so as to, as nearly as practicable, enable the outstanding bonds to be retired at maturity from the income from such toll charges.\nAll costs to be borne by this state of purchasing, constructing, reconstructing, maintaining, improving and operating such bridges, including interest and principal payments of any bond obligations assumed by the commissioner shall be paid out of the trunk highway fund. Minnesota's share of all tolls collected under agreement with an adjoining nation or province, and all tolls collected for any toll bridge purchased entirely by this state shall be paid into the trunk highway fund. Notwithstanding this section or any other provision of law to the contrary, a joint and independent international authority or commission created under subdivision 1 is authorized to establish, collect, retain and spend all tolls for the purchase, construction, reconstruction, maintenance, improvement, repair and operation of any bridge or bridges under its control, and such international authority or commission is not required to deposit such tolls into the trunk highway fund.\nNotwithstanding any other provision of law to the contrary, the properties, moneys, and other assets of any joint and independent international authority or commission created under subdivision 1, all revenues or other income of any such authority or commission shall be exempt from all taxation, licenses, fees, or charges of any kind imposed by the state or by any county, municipality, political subdivision, taxing district, or other public agency or body of the state.",
	"repealed": false
}