{
	"id": "31A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/31A.07",
	"title": "31A.07 MARKING OR LABELING OF INSPECTED ARTICLES.",
	"text": "When poultry, poultry food products, meat, or meat food products prepared for intrastate commerce which have been inspected and marked \"Minnesota Inspected and Passed\" is placed or packed in a can, pot, tin, canvas, or other receptacle or covering in an establishment where inspection is done under sections 31A.01 to 31A.31, the person, firm, or corporation preparing the product shall have a label attached to the can, pot, tin, canvas, or other receptacle or covering, under supervision of an inspector. The label must state that the contents have been \"Minnesota Inspected and Passed\" under sections 31A.01 to 31A.31. An inspection or examination of poultry, poultry food products, meat, or meat food products deposited or enclosed in cans, tins, pots, canvas, or other receptacles or coverings in an establishment where inspection is done under this chapter is not complete until the poultry, poultry food products, meat, or meat food products have been sealed or enclosed in the can, tin, pot, canvas, or other receptacle or covering under the supervision of an inspector.\nAll carcasses, parts of carcasses, poultry, poultry food products, meat, and meat food products inspected at an establishment under this chapter and found not to be adulterated, must when they leave the establishment bear, directly or on their containers, legible labels or official marks as required by the commissioner.\nIf the commissioner determines that it is necessary for the protection of the public, the commissioner may prescribe:\n(1) the styles and sizes of type to be used in material required to be incorporated in labeling to avoid false or misleading labeling of articles or animals subject to sections 31A.01 to 31A.20; and\n(2) definitions and standards of identity, composition, or fill of container for articles subject to sections 31A.01 to 31A.16 consistent with standards established under the Federal Food, Drug, and Cosmetic Act or the Federal Meat Inspection Act. The commissioner and the Secretary of Agriculture of the United States shall consult before issuance of standards to avoid inconsistent state and federal standards.\nNo article subject to sections 31A.01 to 31A.16 may be sold or offered for sale by a person in intrastate commerce under a name or other marking or labeling which is false or misleading or in a container of a misleading form or size. Established trade names and other marking and labeling and containers which are not false or misleading and which are approved by the commissioner are permitted.\nIf the commissioner has reason to believe that a marking or labeling or the size or form of a container in use or proposed for use with an article subject to sections 31A.01 to 31A.16 is false or misleading, the commissioner may direct that its use be withheld unless the marking, labeling, or container is modified in a manner the commissioner prescribes so that it will not be false or misleading. If the person using or proposing to use the marking, labeling, or container does not accept the determination of the commissioner, the person may request a hearing. The use of the marking, labeling, or container must, if the commissioner so directs, be withheld pending hearing and final determination by the commissioner. A determination by the commissioner is conclusive unless the person adversely affected appeals to the district court within 30 days after receiving the notice of final determination.",
	"repealed": false
}