{
	"id": "260E.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.14",
	"title": "260E.14 AGENCY RESPONSIBLE FOR SCREENING AND ASSESSMENT OR INVESTIGATION.",
	"text": "(a) The local welfare agency is the agency responsible for investigating allegations of maltreatment in child foster care, family child care, legally nonlicensed child care, and reports involving children served by an unlicensed personal care provider organization under section 256B.0659. Copies of findings related to personal care provider organizations under section 256B.0659 must be forwarded to the Department of Human Services provider enrollment.\n(b) The Department of Children, Youth, and Families is the agency responsible for screening and investigating allegations of maltreatment in juvenile correctional facilities listed under section 241.021 located in the local welfare agency's county and in facilities licensed or certified under chapters 245A and 245D.\n(c) The Department of Health is the agency responsible for screening and investigating allegations of maltreatment in facilities licensed under sections 144.50 to 144.58 and 144A.43 to 144A.482 or chapter 144H.\n(d) The Department of Education is the agency responsible for screening and investigating allegations of maltreatment in a school as defined in section 120A.05, subdivisions 9, 11, and 13, and chapter 124E. The Department of Education's responsibility to screen and investigate includes allegations of maltreatment involving students 18 through 21 years of age, including students receiving special education services, up to and including graduation and the issuance of a secondary or high school diploma.\n(e) A health or corrections agency receiving a report may request the local welfare agency to provide assistance pursuant to this section and sections 260E.20 and 260E.22.\n(f) The Department of Children, Youth, and Families is the agency responsible for screening and investigating allegations of maltreatment in facilities or programs not listed in paragraph (a) that are licensed or certified under chapters 142B and 142C.\n(a) The local welfare agency is the agency responsible for investigating an allegation of sexual abuse if the alleged offender is the parent, guardian, sibling, or an individual functioning within the family unit as a person responsible for the child's care, or a person with a significant relationship to the child if that person resides in the child's household.\n(b) The local welfare agency is also responsible for assessing or investigating when a child is identified as a victim of sex trafficking.\n(a) The local welfare agency is responsible for immediately conducting a family assessment or investigation if the report alleges neglect or physical abuse by a parent, guardian, or individual functioning within the family unit as a person responsible for the child's care.\n(b) The local welfare agency is also responsible for conducting a family assessment or investigation when a child is identified as a victim of labor trafficking.\n[See Note.]\n(a) Upon receiving data under section 144.225, subdivision 2b, contained in a birth record or recognition of parentage identifying a child who is subject to threatened injury under section 260E.03, subdivision 23, the Department of Children, Youth, and Families shall send the data to the responsible local welfare agency. The data is known as \"birth match data.\"\n(b) Unless the responsible local welfare agency has already begun an investigation or assessment of the report due to the birth of the child or execution of the recognition of parentage and the parent's previous history with child protection, the agency shall accept the birth match data as a report under section 260E.03, subdivision 23.\n(a) The local law enforcement agency is the agency responsible for investigating a report of maltreatment if a violation of a criminal statute is alleged.\n(b) Law enforcement and the responsible agency must coordinate their investigations or assessments as required under this chapter when: (1) a report alleges maltreatment that is a violation of a criminal statute by a person who is a parent, guardian, sibling, person responsible for the child's care within the family unit, or by a person who lives in the child's household and who has a significant relationship to the child in a setting other than a facility as defined in section 260E.03; or (2) a report alleges sex or labor trafficking of a child.\n[See Note.]",
	"repealed": false
}