{
	"id": "260.781",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.781",
	"title": "260.781 RECORDS; INFORMATION AVAILABILITY.",
	"text": "(a) A state court entering a final decree or order in an Indian child adoptive placement shall provide the Department of Children, Youth, and Families and the child's Tribal social services agency with a copy of the decree or order together with such other information to show:\n(1) the name and Tribal affiliation of the Indian child;\n(2) the names and addresses of the biological parents and Indian custodian, if any;\n(3) the names and addresses of the adoptive parents; and\n(4) the identity of any agency having files or information relating to the adoptive placement.\nIf the court records contain an affidavit of the biological or adoptive parents or Indian custodian requesting anonymity, the court shall delete the name and address of the biological or adoptive parents or Indian custodian from the information sent to the Indian child's Tribal social services agency. The court shall include the affidavit with the other information provided to the Minnesota Department of Children, Youth, and Families and the Secretary of the Interior. The Minnesota Department of Children, Youth, and Families shall and the Secretary of the Interior is requested to ensure that the confidentiality of the information is maintained and the information shall not be subject to the Freedom of Information Act, United States Code, title 5, section 552, as amended.\n(b) For:\n(1) disclosure of information for membership of an Indian child in the Tribe;\n(2) determination of member rights or benefits; or\n(3) certification of entitlement to membership upon the request of the adopted Indian child over the age of eighteen, the adoptive or foster parents of an Indian child, or an Indian Tribe,\nthe Secretary of the Interior is requested to disclose any other necessary information for the membership of an Indian child in the Tribe in which the Indian child may be eligible for membership or for determining any rights or benefits associated with that membership. Where the documents relating to the Indian child contain an affidavit from the biological parent or Indian custodian requesting anonymity, the Secretary of the Interior is requested to certify to the Indian child's Tribe, where the information warrants, that the Indian child's parentage and other circumstances of birth entitle the Indian child to membership under the criteria established by the Tribe.\nUpon the request of an adopted Indian person over the age of 18, the adoptive or foster parents of an Indian person, or an Indian Tribal social services agency, the Department of Children, Youth, and Families shall disclose to the Indian person's Tribe information necessary for membership of an Indian person in the Tribe in which the person may be eligible for membership or for determining any rights or benefits associated with that membership. When the documents relating to the person contain an affidavit from the biological or adoptive parent or parents requesting anonymity, the department must use the procedures described in subdivision 1.\nUpon application by an Indian individual who has reached the age of 18 and who was the subject of an adoptive placement, the court that entered the final decree shall inform the individual of the Tribal affiliation, if any, of the individual's biological parents and provide any other necessary information to protect any rights flowing from the individual's Tribal relationship.",
	"repealed": false
}