{
	"id": "203B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.07",
	"title": "203B.07 RETURN AND BALLOT ENVELOPES; DIRECTIONS TO VOTERS.",
	"text": "The county auditor or the municipal clerk shall prepare, print, and transmit a return envelope, a signature envelope, a ballot envelope, and a copy of the directions for casting an absentee ballot to each applicant whose application for absentee ballots is accepted pursuant to section 203B.04. The county auditor or municipal clerk shall provide first class postage for the return envelope. The directions for casting an absentee ballot shall be printed in at least 14-point bold type with heavy leading and may be printed on the ballot envelope. When a person requests the directions in Braille or on audio file, the county auditor or municipal clerk shall provide them in the form requested. The secretary of state shall prepare Braille and audio file copies and make them available.\nWhen a voter registration application is sent to the applicant as provided in section 203B.06, subdivision 4, the directions or registration application shall include instructions for registering to vote.\n(a) The signature envelope shall be of sufficient size to conveniently enclose and contain the ballot envelope and a folded voter registration application. The signature envelope shall be designed to open on the left-hand end.\n(b) The return envelope must be designed in one of the following ways:\n(1) it must be of sufficient size to contain a signature envelope and when the return envelope is sealed, it conceals the signature, identification, and other information; or\n(2) it must be the signature envelope and provide an additional flap that when sealed, conceals the signature, identification, and other information.\n(c) Election officials may open the flap or the return envelope at any time after receiving the returned ballot to inspect the returned certificate for completeness or to ascertain other information.\nA certificate of eligibility to vote by absentee ballot shall be printed on the back of the signature envelope. The certificate shall contain space for the voter's Minnesota driver's license number, state identification number, or the last four digits of the voter's Social Security number, or to indicate that the voter does not have one of these numbers. The space must be designed to ensure that the voter provides the same type of identification as provided on the voter's absentee ballot application for purposes of comparison. The certificate must also contain a statement to be signed and sworn by the voter indicating that the voter meets all of the requirements established by law for voting by absentee ballot and space for a statement signed by a person who is at least 18 years of age on or before the day of the election and a citizen of the United States or by a notary public or other individual authorized to administer oaths stating that:\n(1) the ballots were displayed to that individual unmarked;\n(2) the voter marked the ballots in that individual's presence without showing how they were marked, or, if the voter was physically unable to mark them, that the voter directed another individual to mark them; and\n(3) if the voter was not previously registered, the voter has provided proof of residence as required by section 201.061, subdivision 3.",
	"repealed": false
}