{
	"id": "144H.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/144H.20",
	"title": "144H.20 PHYSICAL ENVIRONMENT.",
	"text": "A PPEC center shall conform with or exceed the physical environment requirements in this section and the physical environment requirements for day care facilities in Minnesota Rules, part 9502.0425. If the physical environment requirements in this section differ from the physical environment requirements for day care facilities in Minnesota Rules, part 9502.0425, the requirements in this section shall prevail. A PPEC center must have sufficient indoor and outdoor space to accommodate at least six medically complex or technologically dependent children.\n(a) The entrance to a PPEC center must be barrier-free, have a wheelchair ramp, provide for traffic flow with a driveway area for entering and exiting, and have storage space for supplies from home.\n(b) A PPEC center must have a treatment room with a medication preparation area. The medication preparation area must contain a work counter, refrigerator, sink with hot and cold running water, and locked storage for biologicals and prescription drugs.\n(c) A PPEC center must develop isolation procedures to prevent cross-infections and must have an isolation room with at least one glass area for observation of a child in the isolation room. The isolation room must be at least 100 square feet in size.\n(d) A PPEC center must have:\n(1) an outdoor play space adjacent to the center of at least 35 square feet per child in attendance at the center, for regular use; or\n(2) a park, playground, or play space within 1,500 feet of the center.\n(e) A PPEC center must have at least 50 square feet of usable indoor space per child in attendance at the center.\n(f) Notwithstanding the Minnesota State Building Code and the Minnesota State Fire Code, a new construction PPEC center or an existing building converted into a PPEC center must meet the requirements of the International Building Code in Minnesota Rules, chapter 1305, for:\n(1) Group R, Division 4 occupancy, if serving 12 or fewer children; or\n(2) Group E, Division 4 occupancy or Group I, Division 4 occupancy, if serving 13 or more children.",
	"repealed": false
}