{
	"id": "515B.3-115",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-115",
	"title": "515B.3-115 ASSESSMENTS FOR COMMON EXPENSES; CIC CREATED BEFORE AUGUST 1, 2010.",
	"text": "(a) The obligation of a unit owner to pay common expense assessments shall be as follows:\n(1) If a common expense assessment has not been levied, the declarant shall pay all operating expenses of the common interest community, and shall fund the replacement reserve component of the common expenses as required by subsection (b).\n(2) If a common expense assessment has been levied, all unit owners, including the declarant, shall pay the assessments allocated to their units, subject to the following:\n(i) If the declaration so provides, a declarant's liability, and the assessment lien, for the common expense assessments, exclusive of replacement reserves, on any unit owned by the declarant may be limited to 25 percent or more of any assessment, exclusive of replacement reserves, until the unit or any building located in the unit is substantially completed. Substantial completion shall be evidenced by a certificate of occupancy in any jurisdiction that issues the certificate.\n(ii) If the declaration provides for a reduced assessment pursuant to paragraph (2)(i), the declarant shall be obligated, within 60 days following the termination of the period of declarant control, to make up any operating deficit incurred by the association during the period of declarant control. The existence and amount, if any, of the operating deficit shall be determined using the accrual basis of accounting applied as of the date of termination of the period of declarant control, regardless of the accounting methodology previously used by the association to maintain its accounts.\n(b) The replacement reserve component of the common expenses shall be funded for each unit in accordance with the projected annual budget required by section 515B.4-102(a)(23) provided that the funding of replacement reserves with respect to a unit shall commence no later than the date that the unit or any building located within the unit boundaries is substantially completed. Substantial completion shall be evidenced by a certificate of occupancy in any jurisdiction that issues the certificate.\n(c) After an assessment has been levied by the association, assessments shall be levied at least annually, based upon a budget approved at least annually by the association.\n(d) Except as modified by subsections (a)(1) and (2), (e), (f), and (g), all common expenses shall be assessed against all the units in accordance with the allocations established by the declaration pursuant to section 515B.2-108.\n(e) Unless otherwise required by the declaration:\n(1) any common expense associated with the maintenance, repair, or replacement of a limited common element shall be assessed against the units to which that limited common element is assigned, equally, or in any other proportion the declaration provides;\n(2) any common expense or portion thereof benefiting fewer than all of the units may be assessed exclusively against the units benefited, equally, or in any other proportion the declaration provides;\n(3) the costs of insurance may be assessed in proportion to risk or coverage, and the costs of utilities may be assessed in proportion to usage;\n(4) subject to section 515B.3-102(a)(11), reasonable attorney fees and costs incurred by the association in connection with (i) the collection of assessments against a unit owner, and (ii) the enforcement of this chapter, the articles, bylaws, declaration, or rules and regulations against a unit owner, may be assessed against the unit owner's unit subject to section 515B.3-116(h); and\n(5) fees, charges, late charges, fines and interest may be assessed as provided in section 515B.3-116(a).\n(f) Assessments levied under section 515B.3-116 to pay a judgment against the association may be levied only against the units in the common interest community at the time the judgment was entered, in proportion to their common expense liabilities.\n(g) If any damage to the common elements or another unit is caused by the act or omission of any unit owner, or occupant of a unit, or their invitees, the association may assess the costs of repairing the damage exclusively against the unit owner's unit to the extent not covered by insurance.\n(h) Subject to any shorter period specified by the declaration or bylaws, if any installment of an assessment becomes more than 60 days past due, then the association may, upon ten days' written notice to the unit owner, declare the entire amount of the assessment immediately due and payable in full, except that any portion of the assessment that represents installments that are not due and payable without acceleration as of the date of reinstatement must not be included in the amount that a unit owner must pay to reinstate under section 580.30 or chapter 581.\n(i) If common expense liabilities are reallocated for any purpose authorized by this chapter, common expense assessments and any installment thereof not yet due shall be recalculated in accordance with the reallocated common expense liabilities.\n(j) An assessment against fewer than all of the units must be levied within three years after the event or circumstances forming the basis for the assessment, or shall be barred.\n(k) This section applies only to common interest communities created before August 1, 2010.",
	"repealed": false
}