{
	"id": "252.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.275",
	"title": "252.275 SEMI-INDEPENDENT LIVING SERVICES FOR PERSONS WITH DEVELOPMENTAL DISABILITIES.",
	"text": "The commissioner of human services shall establish a statewide program to provide support for persons with developmental disabilities to live as independently as possible in the community. An objective of the program is to reduce unnecessary use of intermediate care facilities for persons with developmental disabilities and home and community-based services. The commissioner shall reimburse county boards for semi-independent living services provided by agencies or individuals that meet the applicable standards of sections 245A.01 to 245A.16 and 252.28, and for the provision of onetime living allowances to secure and furnish a home for a person who will receive semi-independent living services under this section, if other public funds are not available for the allowance.\nFor the purposes of this section, \"semi-independent living services\" means training and assistance in managing money, preparing meals, shopping, maintaining personal appearance and hygiene, and other activities which are needed to maintain and improve an adult with developmental disability's capability to live in the community. Eligible persons:\n(1) must be age 18 or older;\n(2) must be unable to function independently without semi-independent living services; and\n(3) must not be at risk of placement in an intermediate care facility for persons with developmental disabilities in the absence of less restrictive services.\nSemi-independent living services costs and onetime living allowance costs may be paid directly by the county, or may be paid by the recipient with a voucher or cash issued by the county.\nThe methods, materials, and settings used to provide semi-independent living services to a person must be designed to:\n(1) increase the person's independence in performing tasks and activities by teaching skills that reduce dependence on caregivers;\n(2) provide training in an environment where the skill being taught is typically used;\n(3) increase the person's opportunities to interact with nondisabled individuals who are not paid caregivers;\n(4) increase the person's opportunities to use community resources and participate in community activities, including recreational, cultural, and educational resources, stores, restaurants, religious services, and public transportation;\n(5) increase the person's opportunities to develop decision-making skills and to make informed choices in all aspects of daily living, including:\n(i) selection of service providers;\n(ii) goals and methods;\n(iii) location and decor of residence;\n(iv) roommates;\n(v) daily routines;\n(vi) leisure activities; and\n(vii) personal possessions;\n(6) provide daily schedules, routines, environments and interactions similar to those of nondisabled individuals of the same chronological age; and\n(7) comply with section 245.825, subdivision 1.\n[Repealed, 1991 c 292 art 6 s 59]\nCounties shall be reimbursed for all expenditures made pursuant to subdivision 1 at a rate of 85 percent, up to the allocation determined pursuant to subdivisions 4 and 4b. However, the commissioner shall not reimburse costs of services for any person if the costs exceed the state share of the average medical assistance costs for services provided by intermediate care facilities for a person with a developmental disability for the same fiscal year, and shall not reimburse costs of a onetime living allowance for any person if the costs exceed $1,500 in a state fiscal year. The commissioner may make payments to each county in quarterly installments. The commissioner may certify an advance of up to 25 percent of the allocation. Subsequent payments shall be made on a reimbursement basis for reported expenditures and may be adjusted for anticipated spending patterns.\nThe commissioner shall allocate funds on a calendar year basis. Beginning with the calendar year in the 1996 grant period, funds shall be allocated first in amounts equal to each county's guaranteed floor according to subdivision 4b, with any remaining available funds allocated based on each county's portion of the statewide expenditures eligible for reimbursement under this section during the 12 months ending on June 30 of the preceding calendar year.\nIf the legislature appropriates funds for special purposes, the commissioner may allocate the funds based on proposals submitted by the counties to the commissioner in a format prescribed by the commissioner. Nothing in this section prevents a county from using other funds to pay for additional costs of semi-independent living services.\n[Repealed, 1995 c 207 art 3 s 23]\nEach county shall have a guaranteed floor equal to the lesser of clause (1) or (2):\n(1) the county's original allocation for the preceding year; or\n(2) 70 percent of the county's reported expenditures eligible for reimbursement during the 12 months ending on June 30 of the preceding calendar year.\nNotwithstanding this subdivision, no county shall be allocated a guaranteed floor of less than $1,000.\nWhen the amount of funds available for allocation is less than the amount available in the previous year, each county's previous year allocation shall be reduced in proportion to the reduction in the statewide funding, to establish each county's guaranteed floor.\nAfter each quarter, the commissioner shall review county program expenditures. The commissioner may reallocate unexpended money at any time among those counties which have earned their full allocation.\n[Repealed, 2007 c 147 art 7 s 76]\nThe commissioner may adopt rules in accordance with chapter 14 to govern allocation, reimbursement, and compliance.\nThe commissioner shall specify requirements for reports, including quarterly fiscal and annual program reports, according to section 256.01, subdivision 2, paragraph (o).\n(a) The commissioner shall make every reasonable effort to maximize the use of federal funds for semi-independent living services.\n(b) The commissioner shall reduce the payments to be made under this section to each county from January 1, 1994, to June 30, 1996, by the amount of the state share of medical assistance reimbursement for services other than residential services provided under the home and community-based waiver program under section 256B.092 from January 1, 1994 to June 30, 1996, for clients for whom the county is financially responsible and who have been transferred by the county from the semi-independent living services program to the home and community-based waiver program. Unless otherwise specified, all reduced amounts shall be transferred to the medical assistance state account.\n(c) For fiscal year 1997, the base appropriation available under this section shall be reduced by the amount of the state share of medical assistance reimbursement for services other than residential services provided under the home and community-based waiver program authorized in section 256B.092 from January 1, 1995, to December 31, 1995, for persons who have been transferred from the semi-independent living services program to the home and community-based waiver program. The base appropriation for the medical assistance state account shall be increased by the same amount.\n(d) For purposes of calculating the guaranteed floor under subdivision 4b and to establish the calendar year 1996 allocations, each county's original allocation for calendar year 1995 shall be reduced by the amount transferred to the state medical assistance account under paragraph (b) during the six months ending on June 30, 1995. For purposes of calculating the guaranteed floor under subdivision 4b and to establish the calendar year 1997 allocations, each county's original allocation for calendar year 1996 shall be reduced by the amount transferred to the state medical assistance account under paragraph (b) during the six months ending on December 31, 1995.\nIf a county board or provider under contract with a county board to provide semi-independent living services does not comply with this section and the rules adopted by the commissioner of human services under this section, including the reporting requirements, the commissioner may recover, suspend, or withhold payments.\n[Repealed, 1995 c 207 art 3 s 23]",
	"repealed": false
}