{
	"id": "342.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.12",
	"title": "342.12 LICENSES; TRANSFERS; ADJUSTMENTS.",
	"text": "(a) Licenses issued under this chapter that are available to all applicants pursuant to section 342.14, subdivision 1b, paragraph (c), may be freely transferred subject to the prior written approval of the office unless the license holder has not received a final site inspection or the license holder is a social equity applicant.\n(b) Licenses issued as social equity licenses pursuant to either section 342.14, subdivision 1b, paragraph (b), or section 342.175, paragraph (b), may only be transferred to another social equity applicant for three years after the date on which the office issues the license. Three years after the date of issuance, a license holder may transfer a license to any entity. Transfer of a license that was issued as a social equity license must be reviewed by the Division of Social Equity and is subject to the prior written approval of the office.\n(c) License preapproval issued pursuant to section 342.125 may not be transferred.\n(d) A new license must be obtained when:\n(1) the form of the licensee's legal business structure converts or changes to a different type of legal business structure; or\n(2) the licensee dissolves; consolidates; reorganizes; undergoes bankruptcy, insolvency, or receivership proceedings; merges with another legal organization; or assigns all or substantially all of its assets for the benefit of creditors.\n(e) Licenses must be renewed annually.\n(f) License holders may petition the office to adjust the tier of a license issued within a license category if the license holder meets all applicable requirements.\n(g) The office by rule may permit the relocation of a licensed cannabis business; permit the relocation of an approved operational location, including a cultivation, manufacturing, processing, or retail location; adopt requirements for the submission of a license relocation application; establish standards for the approval of a relocation application; and charge a fee not to exceed $250 for reviewing and processing applications. Relocation of a licensed premises pursuant to this paragraph does not extend or otherwise modify the license term of the license subject to relocation.",
	"repealed": false
}