{
	"id": "84.798",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.798",
	"title": "84.798 REGISTRATION.",
	"text": "(a) Unless exempted under paragraph (b) or subdivision 2, after January 1, 1995, a person may not operate and an owner may not give permission for another to operate an off-road vehicle on off-road vehicle-designated trails or areas on land administered by the commissioner, or on off-road vehicle grant-in-aid trails and areas funded under section 84.803, unless the vehicle has been registered under this section.\n(b) Annually on the third Saturday of May, nonregistered off-road vehicles may be operated at the Iron Range Off-Highway Vehicle Recreation Area.\nRegistration is not required for an off-road vehicle that is:\n(1) owned and used by the United States, an Indian tribal government, the state, another state, or a political subdivision;\n(2) registered in another state or country and has not been in this state for more than 30 consecutive days; or\n(3) operated with a valid state trail pass according to section 84.8035.\n(a) Application for registration or continued registration must be made to the commissioner, or an authorized deputy registrar of motor vehicles in a form prescribed by the commissioner. The form must state the name and address of every owner of the off-road vehicle. Upon receipt of the application and the appropriate fee, the commissioner shall register the off-road vehicle and assign a registration number that must be affixed to the vehicle in accordance with subdivision 4.\n(b) A deputy registrar of motor vehicles acting under section 168.33 is also a deputy registrar of off-road vehicles. The commissioner of natural resources in cooperation with the commissioner of public safety may prescribe the accounting and procedural requirements necessary to ensure efficient handling of registrations and registration fees. Deputy registrars shall strictly comply with the accounting and procedural requirements. In addition to other fees prescribed by law, a filing fee of $4.50 is charged for each off-road vehicle registration renewal, duplicate or replacement registration card, and replacement decal and a filing fee of $7 is charged for each off-road vehicle registration and registration transfer issued by:\n(1) a deputy registrar and must be deposited in the treasury of the jurisdiction where the deputy is appointed, or retained if the deputy is not a public official; or\n(2) the commissioner and must be deposited in the state treasury and credited to the off-road vehicle account.\nAn off-road vehicle must display a registration sticker issued by the commissioner. If the vehicle is licensed as a motor vehicle, the registration sticker must be affixed on the upper left corner of the rear license plate. If the vehicle is not licensed as a motor vehicle, the owner shall provide a plate not less than four inches high and 7-1/2 inches wide. The plate must be attached to the rear of the vehicle at least 12 inches from the ground. The registration sticker must be affixed on the upper left corner of the plate. Plates and registration stickers must be maintained in a clean and legible condition.\nThe commissioner shall provide to the registrant a registration card that includes the registration number, date of expiration, make and serial number of the off-road vehicle, owner's name and address, and additional information the commissioner may require. The registration is not valid unless signed by at least one owner. Information concerning each registration must be kept by the commissioner. If a registration card is lost or destroyed, the commissioner shall issue a replacement registration card on payment of a fee of $4. The fees collected from replacement registration cards must be credited to the off-road vehicle account in the natural resources fund.\n(a) The fee for registration of an off-road vehicle under this section, other than those registered by a dealer or manufacturer under paragraph (b) or (c), is $30 for three years and $4 for a duplicate or transfer.\n(b) The total registration fee for off-road vehicles owned by a dealer and operated off-road for demonstration or testing purposes is $50 per year. Dealer registrations are not transferable.\n(c) The total registration fee for off-road vehicles owned by a manufacturer and operated off-road for research, testing, experimentation, or demonstration purposes is $150 per year. Manufacturer registrations are not transferable.\n(d) The fees collected under this subdivision must be credited to the off-road vehicle account in the natural resources fund.\nAn owner of an off-road vehicle must renew registration in a manner prescribed by the commissioner upon payment of the appropriate registration fee under subdivision 5.\nA political subdivision may not require licensing or registration of off-road vehicles regulated under sections 84.797 to 84.804.\nA person under the age of 18 may not register an off-road vehicle.\nThe commissioner may issue a refund on a registration, not including any issuing fees paid under subdivision 3, paragraph (b), or section 84.027, subdivision 15, paragraph (a), clause (2), if the refund request is received within 60 days of the original registration, the registration is not used or transferred, and:\n(1) the off-road vehicle was registered incorrectly; or\n(2) the off-road vehicle was registered twice, once by the dealer and once by the customer.\n[See Note.]",
	"repealed": false
}