{
	"id": "299A.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.62",
	"title": "299A.62 COMMUNITY-ORIENTED POLICING (COPS) GRANT PROGRAM.",
	"text": "(a) A community-oriented policing grant program is established under the administration of the commissioner of public safety.\n(b) Grants may be awarded as provided in subdivision 2 for the following purposes:\n(1) to enable local law enforcement agencies to hire law enforcement officers. The grants must be used by law enforcement agencies to increase the complement of officers in the agency by paying the salaries of new officers who replace an existing officer who has been reassigned primarily to investigate and prevent juvenile crime or to perform community-oriented policing duties;\n(2) to enable local law enforcement agencies to assign overtime officers to high crime areas within their jurisdictions; and\n(3) to enable local law enforcement agencies to implement or expand community-oriented policing projects, liaison efforts with local school districts, and other innovative community policing initiatives.\nGrants under this section shall be awarded by the commissioner of public safety. A grant under subdivision 1, paragraph (b), clause (1), may be awarded only to a law enforcement agency that demonstrates in its application that it currently has a need for an additional officer to be assigned to: (1) community-oriented policing duties; or (2) the investigation and prevention of juvenile crime, based on the juvenile crime rate in the area over which the agency has jurisdiction. More than one grant under subdivision 1, paragraph (b), clause (1), may be awarded to an agency; however, each grant may fund only one position. At least 50 percent of the grants awarded under subdivision 1, paragraph (b), clause (1), must be awarded to the cities of Minneapolis and St. Paul.\nA grant awarded under subdivision 1, paragraph (b), clause (1), must reimburse up to 150 percent of the entry level salary and benefits of a law enforcement officer, not to exceed $75,000. However, the money may not be used to pay for equipment or uniforms for the officer. The grant is intended to be used for the salary of the officer over a three-year period.\n(a) Grant recipients who receive grants under subdivision 1, paragraph (b), clause (1), shall continue to employ a law enforcement officer hired with money granted under this section for at least a three-year period. If for any reason during the three-year period the employment relationship ends, the agency shall hire an additional officer so that the total number of officers employed by the agency does not change.\n(b) A law enforcement agency that fails to comply with this subdivision shall reimburse the commissioner as follows:\n(1) if the failure occurs during the first year, the agency shall reimburse the full amount of the grant;\n(2) if the failure occurs during the second year, the agency shall reimburse two-thirds of the grant; or\n(3) if the failure occurs during the third year but prior to the three-year anniversary of the officer's hiring, the agency shall reimburse one-third of the grant.\nThe commissioner shall deposit the reimbursement in the state treasury and credit it to the general fund.",
	"repealed": false
}