{
	"id": "609.487",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.487",
	"title": "609.487 FLEEING PEACE OFFICER; MOTOR VEHICLE; OTHER.",
	"text": "For purposes of this section, the term \"flee\" means to increase speed, extinguish motor vehicle headlights or taillights, refuse to stop the vehicle, or use other means with intent to attempt to elude a peace officer following a signal given by any peace officer to the driver of a motor vehicle.\nFor purposes of this section, \"peace officer\" means:\n(1) an employee of a political subdivision or state law enforcement agency who is licensed by the Minnesota Board of Peace Officer Standards and Training, charged with the prevention and detection of crime and the enforcement of the general criminal laws of the state and who has the full power of arrest, and shall also include the Minnesota State Patrol and Minnesota conservation officers;\n(2) an employee of a law enforcement agency of a federally recognized tribe, as defined in United States Code, title 25, section 450b(e), who is licensed by the Minnesota Board of Peace Officer Standards and Training; or\n(3) a member of a duly organized state, county, or municipal law enforcement unit of another state charged with the duty to prevent and detect crime and generally enforce criminal laws, and granted full powers of arrest.\nFor purposes of this section, \"motor vehicle\" has the meaning given it in section 169.011, subdivision 42, and includes a snowmobile, as defined in section 84.81, off-road recreational vehicles as defined in section 169A.03, subdivision 16, and motorboats as defined in section 169A.03, subdivision 13.\nWhoever by means of a motor vehicle flees or attempts to flee a peace officer who is acting in the lawful discharge of an official duty, and the perpetrator knows or should reasonably know the same to be a peace officer, is guilty of a felony and may be sentenced to imprisonment for not more than three years and one day or to payment of a fine of not more than $5,000, or both.\nWhoever flees or attempts to flee by means of a motor vehicle a peace officer who is acting in the lawful discharge of an official duty, and the perpetrator knows or should reasonably know the same to be a peace officer, and who in the course of fleeing in a motor vehicle or subsequently by other means causes the death of a human being not constituting murder or manslaughter or any bodily injury to any person other than the perpetrator may be sentenced to imprisonment as follows:\n(a) if the course of fleeing results in death, to imprisonment for not more than 40 years or to payment of a fine of not more than $80,000, or both; or\n(b) if the course of fleeing results in great bodily harm, to imprisonment for not more than seven years or to payment of a fine of not more than $14,000, or both; or\n(c) if the course of fleeing results in substantial bodily harm, to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\nWhen a person is convicted of operating a motor vehicle in violation of subdivision 3 or 4, or an ordinance in conformity with those subdivisions, the court shall notify the commissioner of public safety and order the commissioner to revoke the driver's license of the person.\nWhoever, for the purpose of avoiding arrest, detention, or investigation, or in order to conceal or destroy potential evidence related to the commission of a crime, attempts to evade or elude a peace officer, who is acting in the lawful discharge of an official duty, by means of running, hiding, or by any other means except fleeing in a motor vehicle, is guilty of a misdemeanor.",
	"repealed": false
}