{
	"id": "505.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.01",
	"title": "505.01 PLATS, DONATIONS, PURPOSE, DEFINITIONS.",
	"text": "Plats of land may be made in accordance with the provisions of this chapter, and, when so made and recorded, every donation of a park to the public shall operate to convey the fee of all land so donated, for the uses and purposes named or intended, with the same effect, upon the donor and the donor's heirs, and in favor of the donee, as though such land were conveyed by warranty deed. Land donated for any public use in any municipality shall be held in the corporate name in trust for the purposes set forth or intended. A street, road, alley, trail, and other public way dedicated or donated on a plat shall convey an easement only. Easements dedicated or donated on a plat shall convey an easement only.\nA plat prepared and recorded in accordance with this chapter may be used to:\n(1) indicate the dedication of easements for public ways, utility easements, and drainage easements as necessary for orderly development;\n(2) depict one or more parcels for the purpose of simplifying legal descriptions; or\n(3) comply with minor subdivision procedures of a local unit of government.\n(a) \"Block\" means a tract of land consisting of one or more lots, as identified on the plat, and bounded by plat boundaries, public ways, outlots, parks, or bodies of water.\n(b) \"Drainage easement\" means an easement for the purpose of controlling, preserving, and providing for the flow or storage of water.\n(c) \"Lot\" means a tract of land which is all or part of a block and is identified on the plat.\n(d) \"Minor subdivision procedure\" means an approval process that a local unit of government may adopt under this chapter for simple land divisions.\n(e) \"Outlot\" means a tract of land identified by a capital letter and is land that is not part of a block.\n(f) \"Plat\" means a delineation of one or more existing parcels of land drawn to scale showing all data as required by this chapter, depicting the location and boundaries of lots, blocks, outlots, parks, and public ways.\n(g) \"Plat monument\" means a durable magnetic marker placed at all locations required by this chapter or other locations as shown on the plat.\n(h) \"Public way\" means a thoroughfare or cul-de-sac which provides ingress and egress to the public.\n(i) \"Survey line\" means a monumented reference line that is not a boundary.\n(j) \"Utility easement\" means an easement conveyed, granted, or dedicated to the public for utility purposes.\n(k) \"Water boundary\" means the shore or margin of lakes, ponds, rivers, creeks, streams, drainage ditches, or swamps, which forms a boundary of or within the plat.\n(l) \"Wet land\" means all rivers, streams, creeks, drainage ditches, lakes, ponds, and swamps.\n(m) \"Witness monument\" means a plat monument placed at an identified distance and direction from a corner that is in a physical location that is not practical to monument.",
	"repealed": false
}