{
	"id": "116R.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.02",
	"title": "116R.02 BOND ISSUE; SALE AUTHORIZATION.",
	"text": "The commissioner of management and budget, upon the request of the governor, may issue and sell revenue bonds as provided under sections 116R.01 to 116R.15 in one or more series or issues for the purposes provided in this section in the aggregate principal amount of up to $350,000,000, except for refunding bonds. Proceeds of the bonds and investment income on the proceeds are appropriated in the amounts and for the purposes specified in subdivisions 2 and 5 and section 116R.04.\n(a) The commissioner may loan the proceeds of the bonds, make other loans or enter into lease agreements or other revenue agreements for the project described in subdivision 5. The commissioner may provide for servicing of the loans and agreements, the times they are payable and the amounts of payments, the amount of the loans and agreements, their security, and other terms, conditions, and provisions necessary or convenient in connection with them and may enter into all necessary contracts and security instruments in connection with them. The commissioner shall seek to obtain the best available terms and security for the loans or agreements. The terms and security must be reasonably determined by the commissioner to be adequate and of the kind and degree which would be required by an investment banking or other financial institution. The facilities described in subdivision 5 must be pledged as collateral for the loans made and bonds issued under sections 116R.01 to 116R.15.\n(b) To reduce the risk that state general funds will be needed to pay debt service on the state guaranteed bonds, the commissioner must require that the financing arrangements include a coverage test satisfactory to the commissioner so that the sum of the value of the assets and other security pledged to the payment of bonds or the rent due under any lease of the project and taken into account by the commissioner is no less than 125 percent of the difference between the outstanding state guaranteed bonds, and any cash collateral held in a debt service reserve account and pledged to the payment of principal and interest for the state guaranteed bonds and no other bonds. Assets and other security that may be taken into account include (1) net unencumbered value of the project and any collateral or third-party guaranty, including a letter of credit, pledged or otherwise furnished by a user of the project or by a benefited airline company as security for the payment of rent, (2) bond proceeds, including earnings thereon, and (3) prepayments of rent, after making such adjustments the commissioner determines to be appropriate to take into account any outstanding bonds secured by a lien on the project or rent that is prior to the lien securing the state guaranteed bonds, but excluding any cash collateral deducted from the outstanding state guaranteed bonds in applying the coverage test. The commissioner may adopt the method of valuing the assets and other security as the commissioner determines to be appropriate, including valuation of the project at its original cost less depreciation.\n[Repealed, 2007 c 138 s 17]\n(a) If so provided in the commissioner's order or any indenture authorizing the applicable series of bonds, up to $125,000,000 principal amount of bonds for the facility described in subdivision 5, and any bonds issued to refund these bonds may be secured by either of the following methods:\n(1) upon the occurrence of any deficiency in a debt service reserve fund for a series of bonds as provided in section 116R.13, subdivision 3, the commissioner shall issue and sell deficiency bonds in a principal amount not to exceed $125,000,000 for facilities described in subdivision 5; or\n(2) the bonds may be directly secured by a pledge of the full faith, credit, and taxing power of the state and issued as general obligation revenue bonds of the state in accordance with the Minnesota Constitution, article XI, sections 4 to 7. In no event may the security provided by this paragraph extend in whole or part to any series of bonds other than the initial series of bonds so secured and any series of bonds issued to refund these bonds.\nDeficiency bonds and bonds issued under clause (2) must be issued in accordance with and subject to sections 16A.641, 16A.66, 16A.672, and 16A.675, except for section 16A.641, subdivision 5, except as otherwise provided in Laws 1991, chapter 350, article 1, and except that the bonds may be sold at public or private sale at a price or prices determined by the commissioner as provided in section 116R.13, subdivision 3.\n(b) The commissioner may request St. Louis County to pay or secure payment of principal and interest due on up to $12,600,000 principal amount of revenue bonds for the facility described in subdivision 5. At the request of the commissioner, St. Louis County shall, by resolution of its county board, unconditionally and irrevocably pledge as a general obligation, its full faith, credit, and taxing power to pay or secure payment of principal and interest due on the principal amount or amounts requested by the commissioner. The general obligation and pledge of St. Louis County are not subject to and shall not be taken into account for purposes of any debt limitation. A levy of taxes for the St. Louis County general obligation is not subject to and shall not be taken into account for purposes of any levy limitations. The general obligation and the bonds secured by the general obligation may be issued without an election. Except for sections 475.61 and 475.64, chapter 475 does not apply to the general obligation or to the bonds secured by the general obligation.\n(c) The commissioner may request the city of Duluth to pay or secure payment of principal and interest due on up to $47,600,000 principal amount of revenue bonds for the facility described in subdivision 5. At the request of the commissioner, the city of Duluth shall pledge specified revenues of the city, as provided in Laws 1991, chapter 350, article 1, section 24, to pay principal and interest due on the principal amount requested by the commissioner.\nThe proceeds of the bonds issued in a principal amount not to exceed $250,000,000 may be used to finance the costs related to the planning, construction, improvement, or equipping of a heavy maintenance facility for aircraft and facilities subordinate and related to the facility to be located at the Duluth International Airport and any costs of issuance, reserves, credit enhancement, or an initial period of interest payments related to the bonds or the facility. The bond proceeds are appropriated to the commissioner for the purposes specified in this subdivision. With the approval of the commissioner, the owner of the facility may place a mortgage or security interest lien on the facility or any interest in or part of the facility. The mortgage is exempt from the mortgage registry tax imposed under chapter 287. In the event of a default under the loan, lease agreement, or other revenue agreement, the facility, or any part of the facility, may be leased or sold to another person for any lawful purpose, subject to the approval of the commissioner. The approval of the commissioner is not required if the bond trustee has taken control of the facility as a result of a default.\nThe ownership of the facility by the owner may create no liability of the owner for payment of the debt service on the bonds if so determined by the commissioner. The owner may require as a condition of entering into the lease of the facility that the lessee or other party pay all costs, expenses, or any other obligations of ownership of the facility.\nNo revenues derived from the lease of the project may be used other than for a purpose related to the project, including its operation, administration, maintenance, improvement, or financing.\n[Repealed, 2007 c 138 s 17]\n[Repealed, 2007 c 138 s 17]\nNotwithstanding any other law or rule, no environmental review must be completed prior to the approval of an application and the issuance of a conditional commitment for the loan, or the taking of any other action permitted by Laws 1991, chapter 350, article 1, including the issuance of bonds, unless considered necessary or desirable by the commissioner to prepare for a final commitment and to make it effective. Environmental review, to the extent required by law, shall be made in conjunction with the issuance by state agencies of environmental permits for the project. Permits may be applied for prior to the issuance of a conditional commitment. Action shall be taken as expeditiously as possible on environmental review and all permits required.\n[Repealed, 2007 c 138 s 17]",
	"repealed": false
}