{
	"id": "43A.183",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.183",
	"title": "43A.183 PAYMENT OF SALARY DIFFERENTIAL TO RESERVE FORCES WHO REPORT FOR ACTIVE SERVICE.",
	"text": "Each agency head shall pay to each eligible member an amount equal to the person's salary differential for each month or portion of month that the person is ordered to serve in active service.\nThis payment may be made only to a person for whom the amount in subdivision 2, paragraph (b), clause (1), is greater than the amount in subdivision 2, paragraph (b), clause (2). Payments must be made at the intervals at which the member received pay as a state employee, except that any back pay due under this section may be paid as a lump sum. Payment under this section must not extend beyond four years from the date the employee reported for active service, plus any additional time the employee may be legally required to serve. An eligible member may apply for the salary differential benefits authorized under this section no later than two years after completion of active service. The eligible member must be provided with notice as described in subdivision 4 of the two-year deadline. A copy of military orders showing active service must be provided prior to payment.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Salary differential\" means the difference between:\n(1) the person's monthly total gross earnings as an active state employee, excluding any overtime pay received but including all other earnings, averaged over the last three full months of the person's active state employment prior to reporting to active service, and including any additional salary or earnings adjustments that the person would have received at any time during the person's authorized leave from state employment had the person been serving as an active state employee during that time; and\n(2) the person's monthly base pay in active service.\n(c) \"Eligible member\" means:\n(1) any member of the National Guard or other reserve component of the United States armed forces who was an employee of the state of Minnesota at the time the member took military leave under section 192.261 to report for active military service; and\n(2) any member of any other nonmilitary reserve component of the uniformed services of the United States who was an employee of Minnesota at the time the member took properly authorized leave from state employment under substantially comparable federal or state authority ordering the person to report for federal or state active service.\n(d) \"State employee\" means an employee of the executive, judicial, or legislative branch of state government or an employee of the Minnesota State Retirement System, the Public Employee Retirement Association, or the Teachers Retirement Association.\n(e) \"Active service\" has the meaning given in section 190.05, subdivision 5, for military members, and includes substantially comparable service for reserve members of other nonmilitary components of the uniformed services of the United States, but excludes service performed exclusively for purposes of:\n(1) basic training, advanced individual training, annual training, and periodic inactive duty training;\n(2) special training periodically made available to reserve members;\n(3) service performed in accordance with section 190.08, subdivision 3; and\n(4) service performed as part of the active guard/reserve program pursuant to United States Code, title 32, section 502(f), or other applicable authority, as well as substantially comparable service by members of other nonmilitary components of the uniformed services of the United States.\nThe agency head must continue the employee's enrollment in health and dental coverage, and the employer contribution toward that coverage, until the employee reports for active service. If the employee had elected dependent coverage for health or dental coverage as of the time that the employee reported for active service, the agency head must offer the employee the option to continue the dependent coverage at the employee's own expense. The agency head must permit the employee to continue participating in any pretax account in which the employee participated when the employee reported for active service, to the extent of employee pay available for that purpose. An employee who has opted to continue a permitted benefit may cancel that continuation at any time during the person's authorized leave from state employment by written notification from the employee, or from the employee's designated attorney-in-fact under a power of attorney, to the agency head or the commissioner of management and budget.\nThe agency head must periodically inform in writing all agency personnel who are or may be members of the reserve component of the United States armed forces or any other nonmilitary reserve component of the uniformed services of the United States of the benefits provided under this section and of the procedures relevant to securing those benefits, including, but not limited to, any procedures regarding the continuation and discontinuation of any optional deductions. It will suffice to meet this requirement if the agency head posts the information on the agency website in a highly recognizable manner that can be easily found and understood by the employees to whom it might apply.\nUpon being ordered to active service, the employee must notify the agency head of that order in a timely manner and must provide to the agency head the name of and contact information for the employee's designated attorney-in-fact under a power of attorney. Prior to the commencement of the employee's authorized leave from state employment, the agency head must ensure the agency's receipt of that information and immediately convey that information to the commissioner of management and budget, including any subsequent change in that designation by the employee. When communicating with the employee during the person's leave, the agency head and the commissioner of management and budget must immediately provide a copy of the communication to the employee's designated attorney-in-fact. Those officials must also honor requests for information or other appropriate directives from that designee on behalf of the employee during the employee's leave.\nThe commissioner of management and budget shall adopt procedures required to implement this section. The procedures are exempt from chapter 14.\nThis section does not apply to a judge, legislator, or constitutional officer of the executive branch.",
	"repealed": false
}