{
	"id": "353G.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/353G.18",
	"title": "353G.18 TERMINATION OF PARTICIPATION AND DISTRIBUTION OF BENEFITS.",
	"text": "This section provides the procedures that apply if an entity wishes to terminate its participation in the plan and authorize the distribution of all assets credited to the entity's account in the retirement fund held for the benefit of the entity's former firefighters. If this section conflicts with another section of this chapter, this section controls.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them unless the context clearly indicates otherwise.\n(b) \"Departing entity\" means the entity seeking to terminate its participation in the plan and the coverage of its departing firefighters by the plan.\n(c) \"Departing firefighter\" means each former firefighter of the departing entity who:\n(1) is credited with one or more years of service under the plan or under the relief association previously affiliated with the departing entity;\n(2) has not yet received a distribution of the firefighter's pension benefit; and\n(3) is entitled to a distribution of a pension benefit under this section.\n(d) \"Direct rollover\" means a payment described under section 356.633, subdivisions 1 and 2. Consistent with the definition of \"distributee\" under section 356.633, subdivision 1, paragraph (b), a departing firefighter is a distributee for the purpose of a direct rollover election.\n(e) \"Distribution date\" means the date as of which all assets in the entity's account are to be distributed in the form of a payment to each departing firefighter or the survivor of each deceased departing firefighter or as a direct rollover, if elected under section 356.633, subdivisions 1 and 2.\n(f) \"Entity\" means a municipality, a firefighting corporation, or a joint powers entity that operates or had operated a fire department with firefighters who are covered by the plan.\n(g) \"Entity's account\" means the pension plan that is a component of the plan and under which the departing firefighters have accrued lump sum pension benefits and with which the departing entity is affiliated.\n(h) \"Executive director\" means the executive director of the Public Employees Retirement Association.\n(i) \"Termination date\" means the effective date of the termination of the pension plan that is the entity's account. The termination date shall precede the distribution date.\n(j) \"Year of service\" means a year of service credit certified by the departing entity's fire chief under section 353G.07. For purposes of determining the amount of a departing firefighter's pension benefit under this section, year of service includes any service credit earned by the departing firefighter under the relief association previously affiliated with the departing entity, which must be certified under section 424A.003 beginning January 1, 2019. Service credit ends when the departing firefighter's active service ends, notwithstanding a later termination date as defined in paragraph (i).\nAn entity is eligible to terminate its participation in the plan under this section if the entity satisfies the following conditions:\n(1) the entity has eliminated its fire department or, if its fire department is ongoing, the fire department has ceased using the services of all departing firefighters and any other noncareer or volunteer firefighters; and\n(2) the entity's account has assets sufficient to cover all liabilities, after taking into account the requirement to fully vest all departing firefighters and pay administrative expenses determined under subdivision 4, paragraph (c), clause (3).\n(a) The participation of a departing entity in the plan and the coverage of the departing firefighters by the plan shall cease as of the date the requirements in this subdivision are completed and all assets credited to the entity's account are distributed.\n(b) The governing board of the departing entity shall adopt the resolutions under subdivision 5 and deliver the resolutions to the executive director.\n(c) The executive director shall:\n(1) fully vest all departing firefighters as of the termination date and consider each departing firefighter 100 percent vested in the pension benefit accrued by the departing firefighter under the entity's account as of the termination date;\n(2) determine the present value of each departing firefighter's accrued benefit as of the termination date, taking into account the benefit level under section 353G.11 or otherwise in effect for the departing firefighter as determined by the executive director;\n(3) determine, as of the termination date, the value of accrued liabilities, including administrative expenses incurred or reasonably anticipated to be incurred through the distribution date, and the value of assets attributable to the entity's account; and\n(4) to the extent necessary to minimize the risk of investment losses between the termination date and the distribution date, reinvest the assets credited to the entity's account in low-risk investments.\n(d) If the entity's account has assets in excess of accrued liabilities, the executive director shall allocate the excess among all departing firefighters in the same proportion that the present value of the accrued benefit for each departing firefighter bears to the total present value of the accrued benefits of all departing firefighters, and each departing firefighter's benefit, as determined under paragraph (c), clause (2), shall be increased by the departing firefighter's share of the excess.\n(e) The executive director shall, as soon as practicable after the termination date, distribute to each departing firefighter, regardless of whether the departing firefighter has attained age 50, the firefighter's benefit as calculated by the executive director under paragraphs (c) and (d). The distribution shall be made in a lump sum, either as a payment to the departing firefighter or as a direct rollover, if elected by the firefighter. If the departing firefighter is deceased, then the firefighter's benefit shall be paid to the firefighter's survivor under section 353G.12 or as a direct rollover, if elected by the survivor.\n(f) The executive director shall pay supplemental benefits under section 424A.10, but only to the extent that the executive director will be reimbursed under section 424A.10, subdivision 3.\nIf an entity wishes to cease its participation in the plan and end the coverage of its former firefighters by the plan, the entity's governing board shall approve the following resolutions in a form satisfactory to the executive director:\n(1) a statement of intent to terminate participation in the plan and cease the coverage by the plan of the entity's former firefighters; and\n(2) the proposed termination date, which must be the last day of a month and at least 90 days after the date the resolutions are to be delivered to the executive director.",
	"repealed": false
}