{
	"id": "142B.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.74",
	"title": "142B.74 SUBSTITUTE CAREGIVERS AND REPLACEMENTS IN FAMILY CHILD CARE.",
	"text": "Notwithstanding Minnesota Rules, part 9502.0365, subpart 5, the use of a substitute caregiver in a licensed family child care program must be limited to a cumulative total of not more than 500 hours annually. The license holder must document the name, dates, and number of hours of the substitute who provided care.\n(a) A license holder may allow an adult who has not completed the training requirements under this chapter or the background study requirements under chapter 245C to supervise children in a family child care program in an emergency. For purposes of this subdivision, an emergency is a situation in which:\n(1) the license holder has begun operating the family child care program for the day and for reasons beyond the license holder's control, including, but not limited to a serious illness or injury, accident, or situation requiring the license holder's immediate attention, the license holder needs to leave the licensed space and close the program for the day; and\n(2) the parents or guardians of the children attending the program are contacted to pick up their children as soon as is practicable.\n(b) The license holder must make reasonable efforts to minimize the time the emergency replacement has unsupervised contact with the children in care, not to exceed 24 hours per emergency incident.\n(c) The license holder shall not knowingly use a person as an emergency replacement who has committed an action or has been convicted of a crime that would cause the person to be disqualified from providing care to children, if a background study was conducted under chapter 245C.\n(d) To the extent practicable, the license holder must attempt to arrange for emergency care by a substitute caregiver before using an emergency replacement.\n(e) To the extent practicable, the license holder must notify the county licensing agency within seven days that an emergency replacement was used, and specify the circumstances that led to the use of the emergency replacement. The county licensing agency must notify the commissioner within three business days after receiving the license holder's notice that an emergency replacement was used, and specify the circumstances that led to the use of the emergency replacement.\n(f) Notwithstanding the requirements in Minnesota Rules, part 9502.0405, a license holder is not required to provide the names of persons who may be used as replacements in emergencies to parents or the county licensing agency.",
	"repealed": false
}