{
	"id": "501C.0108",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0108",
	"title": "501C.0108 PRINCIPAL PLACE OF ADMINISTRATION.",
	"text": "(a) Without precluding other means for establishing a sufficient connection with the designated jurisdiction, terms of a trust designating the initial principal place of administration are valid and controlling if:\n(1) a trustee's principal place of business is located in, or a trustee is a resident of, the designated jurisdiction; or\n(2) all or part of the administration occurs in the designated jurisdiction.\n(b) A trustee is under a continuing duty to administer the trust at a place appropriate to its purposes, its administration, and the interests of the beneficiaries.\n(c) Without precluding the right of the court to order, approve, or disapprove a transfer, the trustee, in furtherance of the duty prescribed by paragraph (b), may transfer the trust's principal place of administration to another state or to a jurisdiction outside of the United States.\n(d) The trustee shall notify the qualified beneficiaries of a proposed transfer of a trust's principal place of administration not less than 60 days before initiating the transfer; provided that the trustee may initiate the transfer at any time after the notice if all of the qualified beneficiaries agree in writing to an earlier effective date or waive the right to object to the transfer in writing, or upon court approval. The notice of proposed transfer must include:\n(1) the name of the jurisdiction to which the principal place of administration is to be transferred;\n(2) the address and telephone number at the new location at which the trustee can be contacted;\n(3) an explanation of the reasons for the proposed transfer;\n(4) the date on which the proposed transfer is anticipated to occur; and\n(5) the date, not less than 60 days after giving the notice, by which the qualified beneficiary must notify the trustee of an objection to the proposed transfer.\n(e) The authority of a trustee under this section to transfer a trust's principal place of administration terminates if a qualified beneficiary notifies the trustee of an objection to the proposed transfer on or before the date specified in the notice. If the trustee receives an objection from a qualified beneficiary, the trustee shall not transfer the principal place of administration absent court approval.\n(f) Notwithstanding paragraphs (a) to (e), a trustee may transfer some or all of the trust's assets to a successor trustee designated in the terms of the trust or appointed pursuant to section 501C.0704 even if the successor trustee has a principal place of business or residence in a jurisdiction that is different from the trust's principal place of administration.",
	"repealed": false
}