{
	"id": "142G.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.61",
	"title": "142G.61 COMMUNITY WORK EXPERIENCE.",
	"text": "To the extent of available resources, each county agency may establish and operate a community work experience component for MFIP caregivers who are participating in employment and training services. This option for county agencies supersedes the requirement in section 402(a)(1)(B)(iv) of the Social Security Act that caregivers who have received assistance for two months and who are not exempt from work requirements must participate in a work experience program. The purpose of the community work experience component is to enhance the caregiver's employability and self-sufficiency and to provide meaningful, productive work activities. The county shall use this program for an individual after exhausting all other employment opportunities. The county agency shall not require a caregiver to participate in the community work experience program unless the caregiver has been given an opportunity to participate in other work activities.\nThe commissioner shall assist counties in the design and implementation of these components.\n(a) Work sites developed under this section are limited to projects that serve a useful public service such as: health, social service, environmental protection, education, urban and rural development and redevelopment, welfare, recreation, public facilities, public safety, community service, services to aged citizens or citizens with a disability, and child care. To the extent possible, the prior training, skills, and experience of a caregiver must be considered in making appropriate work experience assignments.\n(b) Structured, supervised uncompensated work with an agency or organization, which is monitored by the county service provider, may, with the approval of the county agency, be used as a community work experience placement.\n(c) As a condition of placing a caregiver in a program under this section, the county agency shall first provide the caregiver the opportunity:\n(1) for placement in suitable subsidized employment through participation in a job search; or\n(2) for placement in suitable employment through participation in on-the-job training, if such employment is available.\n(a) The caretaker's employment plan must include the length of time needed in the community work experience program, the need to continue job-seeking activities while participating in community work experience, and the caregiver's employment goals.\n(b) After each six months of a caregiver's participation in a community work experience job placement, and at the conclusion of each community work experience assignment under this section, the county agency shall reassess and revise, as appropriate, the caregiver's employment plan.\n(c) A caregiver may claim good cause under section 142G.71, subdivision 1, for failure to cooperate with a community work experience job placement.\n(d) The county agency shall limit the maximum number of hours any participant may work under this section to the amount of the MFIP standard of need divided by the federal or applicable state minimum wage, whichever is higher. After a participant has been assigned to a position for nine months, the participant may not continue in that assignment unless the maximum number of hours a participant works is no greater than the amount of the MFIP standard of need divided by the rate of pay for individuals employed in the same or similar occupations by the same employer at the same site. This limit does not apply if it would prevent a participant from counting toward the federal work participation rate.",
	"repealed": false
}