{
	"id": "367.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/367.35",
	"title": "367.35 TOWN ADMINISTRATOR.",
	"text": "As soon as practicable after adoption of option C in a town, the town board shall appoint an administrator upon the terms it deems advisable. The administrator shall be chosen solely on the basis of training, experience, and administrative qualifications and need not be a resident of the town. The town clerk may be designated the administrator if the clerk meets these qualifications. The administrator shall be appointed for an indefinite period and may be removed by the board at any time, but after having served as administrator for one year the administrator may demand written charges and a public hearing on the charges before the board before final removal takes effect. Pending a hearing and removal, the board may suspend the administrator from office, with or without pay. The board may appoint a qualified person to perform the duties of the administrator during absence or disability.\n(a) The town administrator shall be the administrative head of the town and be responsible for the administration and supervision of the affairs of the town as assigned.\n(b) The administrator shall, with the approval of the town board, coordinate the various activities of the town.\n(c) The administrator shall exercise the authority and responsibilities assigned by the town board by ordinance or resolution which may include the following duties:\n(1) to provide for the execution of all ordinances, resolutions, and orders of the board and all laws of the state required to be enforced through the town board, by the administrator or by officers under the administrator's direction and supervision;\n(2) to recommend to the town board the appointment, suspension, and removal of all town personnel whose appointment, suspension, or removal is a function of the town board by law;\n(3) to provide for town purchases in accordance with statutory procedures;\n(4) to prepare and submit to the town board a proposed annual budget, including detailed estimates of revenue and expenditures, and enforce the budget as adopted by the board;\n(5) to attend all meetings of the board and recommend measures for adoption as the administrator deems advisable or expedient;\n(6) to advise the board as to the financial condition and needs of the town;\n(7) to perform other assigned ministerial, nondiscretionary duties.\nIf option C is abandoned, the town board shall, as soon as practicable, abolish the office. Duties and responsibilities assigned to the administrator shall be assumed by the town board or by the officer having responsibility for the function prior to the appointment of the administrator.",
	"repealed": false
}