{
	"id": "92.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.16",
	"title": "92.16 CERTIFICATE OF SALE.",
	"text": "At the time of the sale the commissioner shall execute, acknowledge, and deliver to the purchaser a certificate of sale, numbered and made assignable, certifying the description of the land sold, its quantity, the price per acre, the consideration paid and to be paid, and the time and terms of payment. A certificate must not be delivered until the sum required by law to be paid at the time of the sale is paid. If the purchaser fails to pay the sum, the commissioner may reoffer the land for sale, but a bid may not be accepted from the person failing to pay the original offer. If the purchaser pays in full at the time of sale, the commissioner is not required to issue a certificate of sale.\nUpon cancellation of any certificate of sale the commissioner may without notice take possession of the lands described in the certificate and resell them at public auction in the same manner and under the same rules as provided for the first sale. When the commissioner has reappraised, advertised, and publicly offered the lands for sale, the state is deemed to have reentered the lands without any other act, but this is not essential to cancellation of the certificate of sale and does not extend any rights of any person claiming under the certificate. The purchaser at the sale is entitled to immediate possession. If the land is not sold after cancellation of a certificate of sale, it is unsold land of the state, free of rights claimed by any person under the certificate whether in actual or constructive possession.\nMason's Supplement 1940, section 6285, as it existed before the passage of Laws 1941, chapter 374, applies to all state lands of any kind referred to in it sold after the passage of Extra Session Laws 1933-1934, chapter 39, January 5, 1934, and before May 1, 1941. Mason's Minnesota Statutes of 1927, section 6285, as it existed before the passage of chapter 39, applies to all state lands sold before the passage of chapter 39, as if chapter 39 and Laws 1941, chapter 374, had not been enacted. Section 6285, as amended by Laws 1941, chapter 374, applies to all state lands sold after April 30, 1941.\nIf state lands sold before the passage of Extra Session Laws 1933-1934, chapter 39, January 5, 1934, have been repossessed or reentered before the passage of Laws 1941, chapter 374, in accordance with Mason's Minnesota Statutes of 1927, section 6285, as it existed before the passage of chapter 39, the reentry or repossession is valid for all purposes.\nNotwithstanding subdivisions 1 to 4, no certificate of sale shall be issued for land sold on or after July 1, 2004. The terms of payment for land sales on or after July 1, 2004, are as provided in section 92.06, subdivision 1a.",
	"repealed": false
}