{
	"id": "160.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.21",
	"title": "160.21 SNOW REMOVAL.",
	"text": "Road authorities, including road authorities of cities, may contract with each other for the construction and maintenance of, or removal of snow from, any or all highways under their supervision. Such road authorities may also contract with any agency or political subdivision of the state, including but not limited to school districts and public sanitariums, for the removal of snow from publicly owned lands thereof.\nThe road authority of any county or town may remove snow from private property upon payment of not less than the cost thereof when such snow removal does not unduly delay or interfere with the removal of snow from public highways under its jurisdiction.\nAll money received for snow removal shall be paid into the respective funds provided by law, or set aside, for highway or street purposes.\nAny road authority including road authorities of cities may remove snow from any road or highway in cases of emergency.\nAll persons while engaged in snow removal or other work as provided in this section shall be deemed for all purposes the employees of the road authority hiring them.\n(a) A road authority, including a statutory or home rule charter city, may remove snow from unopened or private roads in uncompleted subdivisions containing five or more lots, upon adoption of an annual resolution finding that the subdivision developer, due to general insolvency or pending foreclosure, is unable to maintain the roads and that public safety may be jeopardized if the access of school buses, public works vehicles, or authorized emergency vehicles, as defined in section 169.011, subdivision 3, is obstructed. Snow removal activities are limited to streets reasonably necessary for access by these buses or vehicles.\n(b) Snow removal under this subdivision does not constitute:\n(1) acceptance of the road from the developer by the road authority for public use;\n(2) the opening of the road to public use; nor\n(3) a use, repair, or maintenance of the road sufficient for the purposes of dedication of roads under section 160.05.\n(c) The road authority may impose a reasonable and proportionate charge on all properties within the subdivision for services provided under this subdivision. These charges, if unpaid, may constitute a lien upon the properties within the subdivision and may be collected as a special assessment as provided by section 429.101 or by charter.\n(d) Where a road has been maintained pursuant to this subdivision, the road authority with jurisdiction over the road, and its officers and employees, are exempt from liability for any tort claim for injury to person or property arising from plowing, maintaining, or otherwise working on the road and from traveling on the road and related to its maintenance or condition. This paragraph does not apply to a claim for injury that is affirmatively caused by a negligent act of the road authority or its officers and employees.",
	"repealed": false
}