{
	"id": "256S.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.08",
	"title": "256S.08 CASE MANAGEMENT PROVIDER QUALIFICATIONS AND STANDARDS.",
	"text": "(a) Except as provided in section 256S.07, subdivision 2, elderly waiver case management must be provided by a lead agency or by a private agency that is enrolled as a medical assistance provider.\n(b) Any private agency that provides case management to a participant must not have a financial interest in the provision of any other services included in the participant's support plan.\nThe commissioner must enroll providers qualified to provide elderly waiver case management under the elderly waiver. The enrollment process must ensure the provider's ability to meet the qualification requirements and standards in this section and other federal and state requirements of this service.\nExcept as provided in section 256S.07, subdivision 2, a case management provider must be an enrolled medical assistance provider who is determined by the commissioner to have the following characteristics:\n(1) the demonstrated capacity and experience to provide the components of case management to coordinate and link community resources needed by the eligible population;\n(2) administrative capacity and experience in serving the target population for whom the provider will provide services and in ensuring quality of services under state and federal requirements;\n(3) a financial management system that provides accurate documentation of services and costs under state and federal requirements; and\n(4) the capacity to document and maintain individual case records under state and federal requirements.\nThe lead agency may allow a case manager to delegate certain aspects of the case management activity to a case aide if there is oversight of the case aide by the case manager. The case manager must not delegate those aspects that require professional judgment including assessments, reassessments, and support plan development.\nA case aide shall provide assistance to the case manager in carrying out administrative activities of the elderly waiver case management function. The case aide must not assume responsibilities that require professional judgment including assessments, reassessments, and support plan development. The case manager is responsible for providing oversight of the case aide.",
	"repealed": false
}