{
	"id": "168.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.101",
	"title": "168.101 OWNERSHIP AND REGISTRATION BY MINOR; PROHIBITIONS.",
	"text": "Except as provided in this subdivision it is unlawful for a person under the age of 18 to own a passenger automobile or truck. A person who is under the age of 18 may own a passenger automobile or truck only if any of the following conditions exist:\n(1) the person has completed a driver training course approved by the commissioner of public safety and has attained the age of 17;\n(2) the person is a high school graduate and has attained the age of 17;\n(3) the person is an employed, emancipated minor who holds a Minnesota driver's license; or\n(4) the person became the owner of the passenger automobile or truck which the person seeks to register in Minnesota while a resident of a foreign state, district, territory, or country, and which passenger automobile or truck is duly registered in the person's name in such foreign state, district, territory, or country.\nAny person who knowingly sells or in any manner knowingly transfers title of a passenger automobile or truck to a person who is prohibited from owning a passenger automobile or truck under the provisions of subdivision 1 shall be guilty of a misdemeanor.\nAny person who fails to mail in the application for registration or transfer with appropriate taxes and fees to the registrar of motor vehicles or otherwise fails to submit said forms and remittance to the registrar within ten days following date of sale shall be guilty of a misdemeanor.\nThe registrar of motor vehicles shall refuse to register a passenger automobile or truck unless the owner submits to the registrar, at the time the owner files the first application for registration or transfer of a passenger automobile or truck, a written and verified statement that the owner is 18 years of age or over or, if under the age 18, is permitted by the provisions of subdivision 1 to own a passenger automobile or truck. The statement of an applicant under the age of 18 also shall set forth the number of the applicant's driver's license, or if the applicant has no driver's license the applicant shall so state. The applicant shall make an oath or affirmation before an officer authorized by law to administer oaths and affirmations that the statements made are correct and true. The registrar may prescribe a form for the statement required by this subdivision, which form the registrar may make a part of the application for registration or transfer.\nA person who violates the provisions of this section is guilty of a misdemeanor. The commissioner of public safety shall suspend, for not less than one year, the driver's license of a person who, while under the age of 18, misrepresents the person's age on the statement required by subdivision 3.\nMS 1988 [Repealed, 1989 c 140 s 14]",
	"repealed": false
}