{
	"id": "136D.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/136D.73",
	"title": "136D.73 POWERS AND DUTIES.",
	"text": "The intermediate school board shall have the general charge of the business of the district, the schoolhouses, and the interest of the schools thereof.\n(a) It shall be the duty and the function of the intermediate district to furnish to every person eligible therefor residing in any part of such district and such other resident of the state as provided by law the following:\n(1) technical college facilities and instruction in vocational technical education; and\n(2) facilities for and instruction in special education.\n(b) The board may also provide any other educational programs or other services requested by a participating district. However, these programs and services may not be postsecondary programs or services. Academic offerings shall be provided only under the direction of properly licensed academic supervisory personnel.\n[Repealed, 1994 c 647 art 6 s 42]\nThe board shall employ and contract with necessary qualified teachers and administrators and may discharge the same for cause. The board may employ and discharge other necessary employees and may contract for other services deemed necessary.\nThe board shall provide an educational program for high school, post high school, and adult vocational phases of instruction.\nThe high school phase of its educational program shall be offered in conjunction with the comprehensive curriculum offered by each of the component school districts. Graduation shall be from the student's home high school as shall be determined by the governing body of a participating school district.\nInsofar as applicable, sections 120A.22, subdivision 1, 120B.14, 120B.35, 121A.21, 122A.44, 122A.69, 123A.22, 123A.24, 123B.02, subdivisions 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 17, 18, 19, and 20, 123B.49, 123B.51, 123B.52, 123B.88, 124D.02, 124D.09, and 124D.51 shall apply.\nThe board may, in its discretion, prescribe rates of tuition for attendance at its schools.",
	"repealed": false
}