{
	"id": "559A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/559A.01",
	"title": "559A.01 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 559A.01 to 559A.05.\n\"Balloon payment\" means a scheduled payment of principal, interest, or both under a contract for deed that is significantly larger than the regular installment payments and that may be due prior to the end of the contract term or may be the final payment that satisfies the contract.\n\"Churning\" means the act of an investor seller executing a contract for deed on or after August 1, 2024, if previously the investor had frequently or repeatedly executed contracts for deed and subsequently terminated those contracts under section 559.21.\n\"Contract for deed\" has the meaning given in section 507.235, subdivision 1a.\n(a) \"Investor seller\" means a person entering into a contract for deed to sell residential real property, or, in the event of a transfer or assignment of the seller's interest, the holder of the interest.\n(b) An investor seller does not include a person entering into a contract for deed who is:\n(1) a natural person who has owned and occupied the residential real property as the natural person's primary residence for a continuous 12-month period at any time prior to the execution of the contract for deed;\n(2) any spouse, parent, child, sibling, grandparent, grandchild, uncle, aunt, niece, nephew, or cousin of the natural person;\n(3) a personal representative of the natural person;\n(4) a devisee of the natural person;\n(5) a grantee under a transfer on death deed made by the natural person; or\n(6) a trust whose settlor is the natural person;\n(7) a trust whose beneficiary is a natural person where the trust or the natural person, or a combination of the two, has owned, and the natural person has occupied, the residential real property as the natural person's primary residence for a continuous 12-month period at any time prior to the execution of the contract for deed, or any spouse, parent, child, sibling, grandparent, grandchild, uncle, aunt, niece, nephew, or cousin of the natural person;\n(8) a natural person selling on contract for deed to any spouse, parent, child, sibling, grandparent, grandchild, uncle, aunt, niece, nephew, or cousin;\n(9) a bank, credit union, or residential mortgage originator that is under the supervision of or regulated by the Office of the Comptroller of the Currency, the Federal Deposit Insurance Corporation, the National Credit Union Administration, or the Minnesota Department of Commerce;\n(10) a natural person who has owned and leased the residential real property to the purchaser for at least the prior two years; or\n(11) the person who built the dwelling on the residential real estate and the dwelling has not previously been occupied.\n(c) If, substantially contemporaneous with the execution of the contract for deed, the seller's interest is assigned or transferred to a person who does not meet any of the qualifications of paragraph (b), the assignee or transferee shall be deemed to be an investor seller who has executed the contract for deed.\n\"Person\" means a natural person, partnership, corporation, limited liability company, association, trust, or other legal entity, however organized.\n\"Purchase agreement\" means a purchase agreement for a contract for deed, an earnest money contract, or an executed option contemplating that, at closing, the investor seller and the purchaser will enter into a contract for deed.\n\"Purchaser\" means a person who executes a contract for deed to purchase residential real property. Purchaser includes all purchasers who execute the same contract for deed to purchase residential real property.\n\"Residential real property\" means real property consisting of one to four family dwelling units, one of which is intended to be occupied as the principal place of residence by:\n(1) the purchaser;\n(2) if the purchaser is an entity, the natural person who is the majority or controlling owner of the entity; or\n(3) if the purchaser is a trust, the settlor or beneficiary of the trust.\nResidential real property does not include a transaction subject to sections 583.20 to 583.32.",
	"repealed": false
}