{
	"id": "471.975",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.975",
	"title": "471.975 PAY DIFFERENTIAL AND BENEFITS FOR MEMBER OF NATIONAL GUARD OR RESERVE COMPONENT ON ACTIVE DUTY; POWERS AND DUTIES.",
	"text": "(a) Except as provided in paragraph (b), a statutory or home rule charter city, county, town, or other political subdivision may pay to each eligible member of the National Guard or other reserve component of the armed forces of the United States an amount equal to the difference between the member's base active duty military salary and the salary the member would be paid as an active political subdivision employee, including any adjustments the member would have received if not on leave of absence. This payment may be made only to a person whose base active duty military salary is less than the salary the person would be paid as an active political subdivision employee. Back pay authorized by this section may be paid in a lump sum. Payment under this section must not extend beyond four years from the date the employee reported for active service, plus any additional time the employee may be legally required to serve.\n(b) Each school district shall pay to each eligible member of the National Guard or other reserve component of the armed forces of the United States an amount equal to the difference between the member's base active duty military salary and the salary the member would be paid as an active school district employee, including any adjustments the member would have received if not on leave of absence. The pay differential must be based on a comparison between the member's daily base rate of active duty pay, calculated by dividing the member's base military monthly salary by the number of paid days in the month, and the member's daily rate of pay for the member's school district salary, calculated by dividing the member's total school district salary by the number of contract days. The member's salary as a school district employee must include the member's basic salary and any additional salary the member earns from the school district for cocurricular and extracurricular activities. The differential payment under this paragraph must be the difference between the daily base rates of military pay times the number of school district contract days the member misses because of military active duty. This payment may be made only to a person whose daily base rate of active duty pay is less than the person's daily rate of pay as an active school district employee. Payments may be made at the intervals at which the member received pay as a school district employee. Payment under this section must not extend beyond four years from the date the employee reported for active service, plus any additional time the employee may be legally required to serve.\n(c) An eligible member of the reserve components of the armed forces of the United States is a reservist or National Guard member who was an employee of a political subdivision at the time the member reported for active service on or after May 29, 2003, or who is on active service on May 29, 2003.\n(d) Except as provided in paragraph (e) and elsewhere in Minnesota Statutes, a statutory or home rule charter city, county, town, or other political subdivision has total discretion regarding employee benefit continuation for a member who reports for active service and the terms and conditions of any benefit.\n(e) A school district must continue the employee's enrollment in health and dental coverage, and the employer contribution toward that coverage, until the employee is covered by health and dental coverage provided by the armed forces. If the employee had elected dependent coverage for health or dental coverage as of the time that the employee reported for active service, a school district must offer the employee the option to continue the dependent coverage at the employee's own expense. A school district must permit the employee to continue participating in any pretax account in which the employee participated when the employee reported for active service, to the extent of employee pay available for that purpose.\n(f) For purposes of this section, \"active service\" has the meaning given in section 190.05, subdivision 5, but excludes service performed exclusively for purposes of:\n(1) basic combat training, advanced individual training, annual training, and periodic inactive duty training;\n(2) special training periodically made available to reserve members; and\n(3) service performed in accordance with section 190.08, subdivision 3.\n(g) When an employee of a school district who, as a member of the National Guard or any other reserve unit of the United States armed forces, reports for active service as defined in section 190.05, subdivision 5, the district must place into a special service members' aggregate salary savings account the amount of salary the district would have paid to the employee during the employee's leave for military service. The district must use the combined proceeds in the account only to fully pay the salary differentials of all eligible deployed employees in the district, as determined under paragraph (b). Funds remaining in the account at the end of the fiscal year after all obligations to employees under this statute have been satisfied may be used to pay for substitutes for the deployed employees, and then for any other purpose.",
	"repealed": false
}