{
	"id": "62U.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.08",
	"title": "62U.08 ESSENTIAL BENEFIT SET.",
	"text": "The commissioner of health shall convene a work group to make recommendations on the design of a health benefit set that provides coverage for a broad range of services and technologies, is based on scientific evidence that the services and technologies are clinically effective and cost-effective, and provides lower enrollee cost sharing for services and technologies that have been determined to be cost-effective. The work group shall include representatives of health care providers, health plans, state agencies, and employers. Members of the work group must have expertise in standards for evidence-based care, benefit design and development, actuarial analysis, or knowledge relating to the analysis of the cost impact of coverage of specified benefits. The work group must meet at least once per year and at other times as necessary to make recommendations to the commissioner on updating the benefit set as necessary to ensure that the benefit set continues to be safe, effective, and scientifically based.\nBy October 15, 2009, the work group shall develop and submit to the commissioner an initial essential benefit set and design that includes coverage for a broad range of services, is based on scientific evidence that services are clinically effective and cost-effective, and provides lower enrollee cost sharing for services that have been determined to be cost-effective. The benefit set must include necessary evidence-based health care services, procedures, diagnostic tests, and technologies that are scientifically proven to be both clinically effective and cost-effective. In developing its recommendations, the work group may consult with the Institute for Clinical Systems Improvement (ICSI) to assemble existing scientifically based practice standards.\nBy January 15, 2010, the commissioner shall report the recommendations of the work group to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health care policy and finance.",
	"repealed": false
}