{
	"id": "221.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.185",
	"title": "221.185 OPERATING AUTHORITY; SUSPENSION, CANCELLATION.",
	"text": "Despite the provisions of section 221.021, a household goods mover permit or a motor carrier registration issued under section 221.0251 or 221.0252 is suspended without a hearing, by order of the commissioner, if the permit holder or carrier fails to maintain and file with the commissioner, the insurance or bond required by section 221.141 and rules adopted under that section or the carrier or permit holder fails to pay annual vehicle registration fees or renew permits as required by section 221.131, or the permit holder or carrier fails to pay an administrative penalty under section 221.036.\n(a) Failure to file and maintain insurance, renew permits under section 221.131, or to pay annual vehicle registration fees under section 221.131 suspends a motor carrier's permit or certificate two days after the commissioner sends notice of the suspension by certified mail, return receipt requested, to the last known address of the motor carrier.\n(b) In order to avoid permanent cancellation of the permit or certificate, the motor carrier must do one of the following within 45 days from the date of suspension:\n(1) comply with the law by filing insurance or bond, renewing permits, or paying vehicle registration fees; or\n(2) request a hearing before the commissioner regarding the failure to comply with the law.\nThe commissioner shall issue a notice of suspension if one of the conditions described in subdivision 1 occurs. The notice must give the reason for suspension and must be sent to the last known address of the carrier by certified mail, return receipt requested. A suspension is effective two days after a notice is mailed.\nIf the motor carrier complies with the requirements of this chapter within 45 days after the date of suspension and pays the required fees, including a late vehicle registration fee of $5 for each vehicle registered, the commissioner shall rescind the suspension unless the carrier's registration has expired. If a registered carrier fails to comply within one year of the effective date of a suspension, the carrier's registration is canceled.\nIf the motor carrier requests a hearing within 45 days after the date of suspension, the commissioner shall review the suspension and:\n(1) determine that the carrier has complied with the law and rescind the suspension;\n(2) for just cause, grant an extension which must not exceed 20 days; or\n(3) schedule a hearing to ascertain whether the carrier has failed to comply with the law. If it is determined after the hearing that the carrier has failed to comply with the law, the commissioner shall cancel the carrier's suspended permit or certificate.\nExcept as provided in subdivision 5a, failure to comply with the requirements of section 221.141 relating to bonds and insurance or 221.131 relating to annual vehicle registration or permit renewal, or failure to request a hearing within 45 days of the date of suspension, is deemed an abandonment of the motor carrier's permit or certificate and the permit or certificate must be canceled by the commissioner.\nThe commissioner shall notify the motor carrier by certified mail, return receipt requested, that the permit or certificate is canceled effective on the date of mailing the notice of cancellation.\nA motor carrier whose permit or certificate is canceled for failure to comply with section 221.141 relating to bonds and insurance may ask the commissioner to review the cancellation. Upon review, the commissioner shall rescind the cancellation if (1) the motor carrier presents evidence showing that before the effective date of the notice of cancellation issued under subdivision 5, the motor carrier had obtained and paid for the insurance required by section 221.141, and the rules of the commissioner, and (2) the commissioner is satisfied that the motor carrier has complied with the requirements of section 221.141 and the rules of the commissioner.\n[Repealed, 1984 c 520 s 26]\n[Repealed, 1984 c 520 s 26]\n[Repealed, 1984 c 520 s 26]\nIf the holder of a canceled permit or certificate seeks authority to operate as a motor carrier it shall file a petition with the commissioner for a permit or certificate as provided in section 221.121.",
	"repealed": false
}