{
	"id": "256P.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.06",
	"title": "256P.06 INCOME CALCULATIONS.",
	"text": "To determine eligibility, the county agency must evaluate income received by members of the assistance unit, or by other persons whose income is considered available to the assistance unit, and only count income that is available to the assistance unit. Income is available if the individual has legal access to the income.\n(a) The following members of an assistance unit under chapters 142E and 142G are exempt from having their earned income count toward the income of an assistance unit:\n(1) children under six years old;\n(2) caregivers under 20 years of age enrolled at least half-time in school; and\n(3) minors enrolled in school full time.\n(b) The following members of an assistance unit are exempt from having their earned and unearned income count toward the income of an assistance unit for 12 consecutive calendar months, beginning the month following the marriage date, for benefits under chapter 142G if the household income does not exceed 275 percent of the federal poverty guideline:\n(1) a new spouse to a caretaker in an existing assistance unit; and\n(2) the spouse designated by a newly married couple, both of whom were already members of an assistance unit under chapter 142G.\n(c) If members identified in paragraph (b) also receive assistance under section 142E.08, they are exempt from having their earned and unearned income count toward the income of the assistance unit if the household income prior to the exemption does not exceed 67 percent of the state median income for recipients for 26 consecutive biweekly periods beginning the second biweekly period after the marriage date.\n(d) For individuals who are members of an assistance unit under chapters 142G and 256I, the assistance standard effective in January 2020 for a household of one under chapter 142G shall be counted as income under chapter 256I, and any subsequent increases to unearned income under chapter 142G shall be exempt.\nThe following must be included in determining the income of an assistance unit:\n(1) earned income; and\n(2) unearned income, which includes:\n(i) interest and dividends from investments and savings;\n(ii) capital gains as defined by the Internal Revenue Service from any sale of real property;\n(iii) contract for deed payments in excess of the principal and interest portion owed on property;\n(iv) income from trusts, excluding special needs and supplemental needs trusts;\n(v) interest income from loans made by the participant or household;\n(vi) cash prizes and winnings;\n(vii) unemployment insurance income that is received by an adult member of the assistance unit unless the individual receiving unemployment insurance income is:\n(A) 18 years of age and enrolled in a secondary school; or\n(B) 18 or 19 years of age, a caregiver, and is enrolled in school at least half-time;\n(viii) for the purposes of programs under chapters 256D and 256I, retirement, survivors, and disability insurance payments;\n(ix) retirement benefits;\n(x) cash assistance benefits, as defined by each program in chapters 142E, 142G, 256D, and 256I;\n(xi) income from members of the United States armed forces unless excluded from income taxes according to federal or state law;\n(xii) for the purposes of programs under chapters 142E, 256D, and 256I, all child support payments;\n(xiii) for the purposes of programs under chapter 142G, the amount of child support received that exceeds $100 for assistance units with one child and $200 for assistance units with two or more children;\n(xiv) spousal support;\n(xv) workers' compensation; and\n(xvi) for the purposes of programs under chapters 119B and 256J, the amount of retirement, survivors, and disability insurance payments that exceeds the applicable monthly federal maximum Supplemental Security Income payments.\nIncome received from lived-experience engagement, as defined in section 256P.01, subdivision 5a, must not be counted as income for purposes of determining or redetermining eligibility or benefits.\nCensus income does not count as income for purposes of determining or redetermining eligibility or benefits.",
	"repealed": false
}