{
	"id": "136F.481",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.481",
	"title": "136F.481 EARLY SEPARATION INCENTIVE PROGRAM.",
	"text": "(a) Notwithstanding any provision of law to the contrary, the board may offer a targeted early separation incentive program for its employees.\n(b) The early separation incentive program may include one or both of the following:\n(1) cash incentives, not to exceed one year of base salary; or\n(2) employer contributions to the postretirement health care savings plan established under section 352.98.\n(c) To be eligible to receive an incentive, an employee must be at least age 55 and must have at least five years of employment by the Minnesota State Colleges and Universities System. The board shall establish and periodically revise the eligibility requirements for system employees to receive an incentive. The board shall file a copy of its proposed revised eligibility requirements with the chairs and ranking members of the senate committee with higher education within its jurisdiction and the senate finance division with higher education within its jurisdiction and with the chair and ranking members of the committee in the house of representatives with higher education within its jurisdiction and of the house of representatives Committee on Ways and Means, at least 30 days before the final adoption of the proposed revised eligibility requirements by the board, shall post the same document on the system website at the same time, and shall hold a public hearing on the proposed eligibility requirements. The type and any additional amount of the incentive to be offered may vary by employee classification, as specified by the board.\n(d) The president of a college or university, consistent with paragraphs (b) and (c), may designate:\n(1) specific departments or programs at the college or university whose employees are eligible to be offered the incentive program; or\n(2) positions at the college or university eligible to be offered the incentive program.\n(e) The chancellor, consistent with paragraphs (b) and (c), may designate:\n(1) system office divisions whose employees are eligible to be offered the incentive program; or\n(2) positions at the system office eligible to be offered the incentive program.\n(f) Acceptance of the offered incentive must be voluntary on the part of the employee and must be in writing. The incentive may only be offered at the sole discretion of the president of the applicable college or university.\n(g) A decision by the president of a college or university or by the chancellor not to offer an incentive may not be challenged.\n(h) The cost of the incentive is payable by the college or university on whose behalf the president offered the incentive or from the system office budget if the chancellor offered the incentive. If a college or university is merged, the remaining cost of any early separation incentive must be borne by the successor institution. If a college or university is closed, the remaining cost of any early separation incentive must be borne by the board.\n(i) Annually, the chancellor and the president of each college or university must report on the number and types of early separation incentives which were offered and utilized under this section. The report must be filed annually with the board and with the Legislative Reference Library on or before September 1.",
	"repealed": false
}