{
	"id": "144.3345",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.3345",
	"title": "144.3345 INTERCONNECTED ELECTRONIC HEALTH RECORD GRANTS.",
	"text": "(a) The following definitions are used for the purposes of this section.\n(b) \"Eligible community e-health collaborative\" means an existing or newly established collaborative to support the adoption and use of interoperable electronic health records. A collaborative must consist of at least two or more eligible health care entities in at least two of the categories listed in paragraph (c) and have a focus on interconnecting the members of the collaborative for secure and interoperable exchange of health care information.\n(c) \"Eligible health care entity\" means one of the following:\n(1) community clinics, as defined under section 145.9268;\n(2) hospitals eligible for rural hospital capital improvement grants, as defined in section 144.148;\n(3) physician, advanced practice registered nurse, or physician assistant clinics located in a community with a population of less than 50,000 according to United States Census Bureau statistics and outside the seven-county metropolitan area;\n(4) nursing facilities licensed under sections 144A.01 to 144A.27;\n(5) community health boards as established under chapter 145A;\n(6) nonprofit entities with a purpose to provide health information exchange coordination governed by a representative, multi-stakeholder board of directors; and\n(7) other providers of health or health care services approved by the commissioner for which interoperable electronic health record capability would improve quality of care, patient safety, or community health.\nThe commissioner of health shall award grants to:\n(1) eligible community e-health collaborative projects to improve the implementation and use of interoperable electronic health records including but not limited to the following projects:\n(i) collaborative efforts to host and support fully functional interoperable electronic health records in multiple care settings;\n(ii) electronic medication history and electronic patient medical history information;\n(iii) electronic personal health records for persons with chronic diseases and for prevention services;\n(iv) rural and underserved community models for electronic prescribing;\n(v) modernize local public health information systems to rapidly and electronically exchange information needed to participate in community e-health collaboratives or for public health emergency preparedness and response; and\n(vi) implement regional or community-based health information exchange organizations;\n(2) community clinics, as defined under section 145.9268, to implement and use interoperable electronic health records, including but not limited to the following projects:\n(i) efforts to plan for and implement fully functional, standards-based interoperable electronic health records; and\n(ii) purchases and implementation of computer hardware, software, and technology to fully implement interoperable electronic health records;\n(3) regional or community-based health information exchange organizations to connect and facilitate the exchange of health information between eligible health care entities, including but not limited to the development, testing, and implementation of:\n(i) data exchange standards, including data, vocabulary, and messaging standards, for the exchange of health information, provided that such standards are consistent with state and national standards;\n(ii) security standards necessary to ensure the confidentiality and integrity of health records;\n(iii) computer interfaces and mechanisms for standardizing health information exchanged between eligible health care entities;\n(iv) a record locator service for identifying the location of patient health records; or\n(v) interfaces and mechanisms for implementing patient consent requirements; and\n(4) community health boards as established under chapter 145A to modernize local public health information systems to be standards-based and interoperable with other electronic health records and information systems, or for enhanced public health emergency preparedness and response.\nGrant funds may not be used for construction of health care or other buildings or facilities.\n(a) To receive a grant under this section, an eligible community e-health collaborative, community clinic, regional or community-based health information exchange, or community health board must submit an application to the commissioner of health by the deadline established by the commissioner. A grant may be awarded upon the signing of a grant contract. In awarding grants, the commissioner shall give preference to projects benefiting providers located in rural and underserved areas of Minnesota which the commissioner has determined have an unmet need for the development and funding of electronic health records. Applicants may apply for and the commissioner may award grants for one-year, two-year, or three-year periods.\n(b) An application must be on a form and contain information as specified by the commissioner but at a minimum must contain:\n(1) a description of the purpose or project for which grant funds will be used;\n(2) a description of the problem or problems the grant funds will be used to address, including an assessment of the likelihood of the project occurring absent grant funding;\n(3) a description of achievable objectives, a work plan, budget, budget narrative, a project communications plan, a timeline for implementation and completion of processes or projects enabled by the grant, and an assessment of privacy and security issues and a proposed approach to address these issues;\n(4) a description of the health care entities and other groups participating in the project, including identification of the lead entity responsible for applying for and receiving grant funds;\n(5) a plan for how patients and consumers will be involved in development of policies and procedures related to the access to and interchange of information;\n(6) evidence of consensus and commitment among the health care entities and others who developed the proposal and are responsible for its implementation;\n(7) a plan for documenting and evaluating results of the grant; and\n(8) a plan for use of data exchange standards, including data and vocabulary.\n(c) The commissioner shall review each application to determine whether the application is complete and whether the applicant and the project are eligible for a grant. In evaluating applications, the commissioner shall take into consideration factors, including but not limited to, the following:\n(1) the degree to which the proposal interconnects with other health care entities in the applicant's geographic community;\n(2) the degree to which the project provides for the interoperability of electronic health records or related health information technology;\n(3) the degree to which the project addresses current unmet needs pertaining to interoperable electronic health records in a geographic area of Minnesota and the likelihood that the needs would not be met absent grant funds;\n(4) the applicant's thoroughness and clarity in describing the project, how the project will improve patient safety, quality of care, and consumer empowerment, and the role of the various collaborative members;\n(5) the recommendations of the Health Information and Technology Infrastructure Advisory Committee; and\n(6) other factors that the commissioner deems relevant.\n(d) Grant funds shall be awarded on a three-to-one match basis. Applicants shall be required to provide $1 in the form of cash or in-kind staff or services for each $3 provided under the grant program.\n(e) Grants shall not exceed $900,000 per grant. The commissioner has discretion over the size and number of grants awarded.\nThe commissioner of health shall evaluate the overall effectiveness of the grant program. The commissioner shall collect progress and expenditure reports to evaluate the grant program from the eligible community collaboratives receiving grants.",
	"repealed": false
}