{
	"id": "84.8015",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.8015",
	"title": "84.8015 EDUCATION AND TRAINING.",
	"text": "(a) The commissioner shall establish a comprehensive off-road vehicle environment and safety education and training program, including the preparation and dissemination of vehicle information and safety advice to the public, the training of off-road vehicle operators, and the issuance of off-road vehicle safety certificates to operators 16 to 18 years of age who successfully complete the off-road vehicle environment and safety education and training courses.\n(b) Beginning July 1, 2006, an individual who is convicted of violating a law related to the operation of an off-road vehicle must successfully complete the environment and safety education and training program established under paragraph (a) before continuing operation of an off-road vehicle.\nFor the purposes of administering the program and to defray a portion of the expenses of training and certifying vehicle operators, the commissioner shall collect a fee not to exceed $15 from each person who receives the training. The commissioner shall collect a fee for issuing a duplicate off-road vehicle safety certificate. The commissioner shall establish the fee for a duplicate off-road vehicle safety certificate that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the service. The fees must be deposited in the state treasury and credited to the off-road vehicle account.\nThe commissioner shall cooperate with private organizations and associations, private and public corporations, and local governmental units in furtherance of the program established under this section. The commissioner shall consult with the commissioner of public safety in regard to training program subject matter and performance testing that leads to the certification of off-road vehicle operators.\nThe commissioner may enter into reciprocity agreements or otherwise certify off-road vehicle environment and safety education and training courses from other states that are substantially similar to in-state courses. Proof of completion of a course subject to a reciprocity agreement or certified as substantially similar is adequate to meet the safety certificate requirements of this section.",
	"repealed": false
}