{
	"id": "430.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.04",
	"title": "430.04 AWARDS ON APPEAL; ASSESSMENTS.",
	"text": "If an award of damages to appellants after an appeal to the district court exceeds the amount of the award appealed from, or if an assessment of benefits made in respect to an appellant upon appeal is less than the amount of the assessment of benefits appealed from, the city may pay the amount of this increase or decrease from the permanent improvement fund or any available city fund. Alternatively, the city council may have the amount assessed upon any property benefited by the proposed improvements in addition and without prejudice to prior assessments made in the proceedings, referring the matter to the commissioners appointed by the council in the proceeding or to new commissioners to be appointed by the council. The commissioners must have the qualifications required of commissioners appointed under section 430.02 and must take an oath to faithfully discharge their duties as commissioners.\nThe commissioners shall give notice of the time when and the place where they will meet to hear persons interested and assess the amounts of the increase of awards of damages or decrease of assessments of benefits on land previously assessed or to assess benefits on land not previously assessed for benefits in the proceeding. The notice must be sent to owners of land entitled to increase of their awards upon any appeal and to owners of land to be assessed for benefits that were not assessed in the original proceeding by the commissioners. It must be deposited in the post office of the city, postage paid, addressed to the owners' last known place of residence, either known to the commissioners or obtained from the office of the county treasurer. The failure of any owner to receive notice does not invalidate any proceedings under this chapter.\nThe commissioners shall meet at the time and place designated in their notice, hear interested persons, and assess the amount of the increased awards of damages, decreased assessments of benefits, or new and original assessments of benefits on property benefited by the proposed improvements in proportion to the benefits. The amount of an assessment may not exceed the actual benefit to the assessed land. The commissioners shall file with the city clerk an assessment list containing a brief description of each piece of property assessed, the names of the owners, if known, and the amount assessed; the city clerk shall present this list to the city council for consideration. Minutes of the presentation of this assessment list to the city council, included in the record of the proceedings of the city council, are sufficient notice to concerned persons. This assessment list must lie over without action by the city council until a regular meeting of the council at least one week later. At that or a later meeting the city council may confirm the assessments and assessment roll or send them back to the commissioners for further consideration.\nAn interested person who is dissatisfied with the amount of an assessment may appeal from the confirmation of the assessment by the city council to the district court under section 430.03. A decrease in an assessment on appeal may be paid by the city from the permanent improvement fund or from any available city fund, or the city council may have the amount reassessed under this chapter.",
	"repealed": false
}