{
	"id": "302A.613",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.613",
	"title": "302A.613 PLAN APPROVAL.",
	"text": "The plan of merger or exchange shall be approved by the affirmative vote of a majority of the directors present at a meeting of the board of each constituent corporation and shall then be submitted at a regular or a special meeting to the shareholders of (i) each constituent corporation, in the case of a plan of merger, and (ii) the corporation whose shares will be acquired by the acquiring organization in the exchange, in the case of a plan of exchange. If shareholders holding any class or series of stock of the corporation are entitled to vote on the plan of merger or exchange pursuant to this section, written notice shall be given to every shareholder of a corporation, whether or not entitled to vote at the meeting, not less than 14 days nor more than 60 days before the meeting, in the manner provided in section 302A.435 for notice of meetings of shareholders. The written notice shall state that a purpose of the meeting is to consider the proposed plan of merger or exchange. A copy or short description of the plan of merger or exchange shall be included in or enclosed with the notice. If the merger or exchange is with a domestic or foreign limited liability company, the plan of merger or exchange must also be approved in the manner required by the laws of the state under which the limited liability company is organized.\n(a) At the meeting a vote of the owners shall be taken on the proposed plan. The plan of merger or exchange is adopted when approved by the affirmative vote of the holders of a majority of the voting power of all shares entitled to vote and, if the merger or exchange is with a domestic or foreign limited liability company, when approved in the manner required by the laws of the state under which the limited liability company is organized. Except as provided in paragraph (b), a class or series of shares of the corporation is entitled to vote as a class or series if any provision of the plan would, if contained in a proposed amendment to the articles, entitle the class or series of shares to vote as a class or series and, in the case of an exchange, if the class or series is included in the exchange.\n(b) A class or series of shares of the corporation is not entitled to vote as a class or series if the plan of merger or exchange effects a cancellation or exchange of all shares of the corporation of all classes and series that are outstanding immediately prior to the merger or exchange and shareholders of shares of that class or series are entitled to obtain payment for the fair value of their shares under section 302A.471, or would have the right to obtain payment for their shares absent the exception set forth in paragraph (c) of section 302A.471, subdivision 3, in the event of the merger or exchange.\nNotwithstanding the provisions of subdivisions 1 and 2, submission of a plan of merger to a vote at a meeting of shareholders of a surviving corporation is not required if:\n(a) The articles of the corporation will not be amended in the transaction;\n(b) Each holder of shares of the corporation that were outstanding immediately before the effective time of the transaction will hold the same number of shares with identical rights immediately thereafter;\n(c) The voting power of the outstanding shares of the corporation entitled to vote immediately after the merger, plus the voting power of the shares of the corporation entitled to vote issuable on conversion of, or on the exercise of rights to purchase, securities issued in the transaction, will not exceed by more than 20 percent, the voting power of the outstanding shares of the corporation entitled to vote immediately before the transaction; and\n(d) The number of participating shares of the corporation immediately after the merger, plus the number of participating shares of the corporation issuable on conversion of, or on the exercise of rights to purchase, securities issued in the transaction, will not exceed by more than 20 percent, the number of participating shares of the corporation immediately before the transaction. \"Participating shares\" are outstanding shares of the corporation that entitle their holders to participate without limitation in distributions by the corporation.\n(a) Notwithstanding the provisions of subdivisions 1 and 2, unless otherwise expressly provided in the articles, submission of a plan of merger to a vote at a meeting of shareholders of a constituent corporation that is a publicly held corporation immediately before the execution of the plan of merger is not required if each of the following requirements is met:\n(1) The plan of merger expressly:\n(i) permits or requires the merger to be effected in accordance with this subdivision; and\n(ii) requires that the merger be effected as soon as practicable following the consummation of an offer if the merger is effected under this subdivision.\n(2) An organization consummates, on the terms provided in the plan of merger, an offer for all of the outstanding shares of the constituent corporation that, absent this subdivision, would be entitled to vote on the adoption of the plan of merger. Subject to the plan of merger, (i) the offer may be conditioned on the tender of a minimum number or percentage of shares of the constituent corporation, or of any class or series thereof, (ii) the offer may exclude any excluded shares, and (iii) the organization may consummate separate offers for separate classes or series of shares of the constituent corporation.\n(3) Immediately following the consummation of the offer, the shares irrevocably accepted for purchase or exchange pursuant to the offer and received by the depository before expiration of the offer, together with any excluded shares, equal at least the percentage of the shares of the constituent corporation, and of each class or series thereof, that, absent this subdivision, would be required to adopt the plan of merger under the articles of the constituent corporation and this section.\n(4) The organization consummating the offer or one of its qualifying affiliates merges with or into the constituent corporation pursuant to the plan of merger.\n(5) Each outstanding share, other than excluded shares, of each class or series of the constituent corporation that is the subject of, and is not irrevocably accepted for purchase or exchange in, the offer must be converted in the merger into, or into the right to receive, the same amount and kind of cash, property, rights, or securities, or some combination thereof, to be paid for shares of the class or series of the constituent corporation irrevocably accepted for purchase or exchange in the offer.\n(b) For purposes of this subdivision, the following terms have the meanings given them.\n(1) \"Consummates\" and, with correlative meaning, \"consummation\" or \"consummating,\" means irrevocably accepts for purchase or exchange shares tendered pursuant to an offer.\n(2) \"Depository\" means an agent, including a depository, appointed to facilitate consummation of an offer.\n(3) \"Excluded shares\" means, to the extent the plan of merger permits or requires them to be excluded from the offer or the merger, (i) shares of the constituent corporation that are owned at the commencement of an offer by the organization consummating the offer, by any person that owns, directly or indirectly, all of the outstanding ownership interests of the organization consummating the offer, or by any direct or indirect wholly owned subsidiary of any of the foregoing, and (ii) rollover shares.\n(4) \"Offer\" means a tender offer or an exchange offer that, in either case, meets the requirements of paragraph (a), clause (2).\n(5) \"Qualifying affiliate\" means, with respect to the organization consummating an offer, a person that (i) owns, directly or indirectly, all of the outstanding ownership interests of the organization or (ii) is a direct or indirect wholly owned subsidiary of the organization or of a person referred to in item (i).\n(6) \"Received\" means (i) with respect to certificated shares, physical receipt of a stock certificate accompanied by an executed letter of transmittal, (ii) with respect to uncertificated shares held of record by a clearing corporation as nominee, transfer into the depository's account by means of an agent's message, and (iii) with respect to uncertificated shares held of record by a person other than a clearing corporation as nominee, physical receipt of an executed letter of transmittal by the depository. Shares will cease to be received (i) with respect to certificated shares, if the certificate representing the shares was canceled before consummation of the offer, or (ii) with respect to uncertificated shares, to the extent the uncertificated shares have been reduced or eliminated due to any sale of those shares before consummation of the offer.\n(7) \"Rollover shares\" means any shares of the constituent corporation that are the subject of a written agreement requiring those shares to be transferred, contributed, or delivered to the organization consummating the offer or any of its qualifying affiliates in exchange for shares or other equity interests in the organization consummating the offer or its qualifying affiliate. Shares will cease to be rollover shares if, immediately before the time the merger becomes effective, those shares have not been transferred, contributed, or delivered to the organization consummating the offer or any of its qualifying affiliates pursuant to the written agreement.",
	"repealed": false
}