{
	"id": "80C.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/80C.14",
	"title": "80C.14 UNFAIR PRACTICES.",
	"text": "No person, whether by means of a term or condition of a franchise or otherwise, shall engage in any unfair or inequitable practice in contravention of such rules as the commissioner may adopt defining as to franchises the words \"unfair and inequitable.\" For the purpose of rules defining the words \"unfair and inequitable,\" the commissioner may specifically recognize classifications of franchises including but not limited to the classifications of motor vehicle fuel franchises, motor vehicle franchises, hardware franchises, and franchises which require that the franchisee make an initial, unfinanced investment in excess of $200,000. A violation of this section is enjoinable by a court of competent jurisdiction. Irreparable harm to the franchisee will be presumed if there is a violation of this section by a person who is required to register under section 80C.02, but who fails to do so.\nA temporary injunction may be granted under this section without requiring the posting of any bond or security. A bond or security is required if a temporary restraining order is granted.\nAll franchise contracts or agreements, other than those classifications of franchises specifically recognized by the commissioner under subdivision 1, and any other device or practice of a franchisor must conform to subdivisions 3 and 4. It is an unfair and inequitable practice for a person to commit an act specified in subdivisions 3 to 5.\n(a) No person may terminate or cancel a franchise unless: (i) that person has given written notice setting forth all the reasons for the termination or cancellation at least 90 days in advance of termination or cancellation, and (ii) the recipient of the notice fails to correct the reasons stated for termination or cancellation in the notice within 60 days of receipt of the notice; except that the notice is effective immediately upon receipt where the alleged grounds for termination or cancellation are:\n(1) voluntary abandonment of the franchise relationship by the franchisee;\n(2) the conviction of the franchisee of an offense directly related to the business conducted pursuant to the franchise; or\n(3) failure to cure a default under the franchise agreement which materially impairs the good will associated with the franchisor's trade name, trademark, service mark, logotype or other commercial symbol after the franchisee has received written notice to cure of at least 24 hours in advance thereof.\n(b) No person may terminate or cancel a franchise except for good cause. \"Good cause\" means failure by the franchisee to substantially comply with the material and reasonable franchise requirements imposed by the franchisor including, but not limited to:\n(1) the bankruptcy or insolvency of the franchisee;\n(2) assignment for the benefit of creditors or similar disposition of the assets of the franchise business;\n(3) voluntary abandonment of the franchise business;\n(4) conviction or a plea of guilty or no contest to a charge of violating any law relating to the franchise business; or\n(5) any act by or conduct of the franchisee which materially impairs the good will associated with the franchisor's trademark, trade name, service mark, logotype or other commercial symbol.\nUnless the failure to renew a franchise is for good cause as defined in subdivision 3, paragraph (b), and the franchisee has failed to correct reasons for termination as required by subdivision 3, no person may fail to renew a franchise unless (1) the franchisee has been given written notice of the intention not to renew at least 180 days in advance of the expiration of the franchise; and (2) the franchisee has been given an opportunity to operate the franchise over a sufficient period of time to enable the franchisee to recover the fair market value of the franchise as a going concern, as determined and measured from the date of the failure to renew. No franchisor may refuse to renew a franchise if the refusal is for the purpose of converting the franchisee's business premises to an operation that will be owned by the franchisor for its own account.\nIt is unfair and inequitable for a person to unreasonably withhold consent to an assignment, transfer, or sale of the franchise whenever the franchisee to be substituted meets the present qualifications and standards required of the franchisees of the particular franchisor.",
	"repealed": false
}