{
	"id": "142G.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.57",
	"title": "142G.57 MINOR PARENTS; EMPLOYMENT PLAN.",
	"text": "(a) The county agency must document the educational level of each MFIP caregiver who is under the age of 20 and determine if the caregiver has obtained a high school diploma or its equivalent. If the caregiver has not obtained a high school diploma or its equivalent, the county agency must complete an individual assessment for the caregiver unless the caregiver is exempt from the requirement to attend school under subdivision 5 or has chosen to have an employment plan under section 142G.56, subdivision 2, as allowed in paragraph (b). The assessment must be performed as soon as possible but within 30 days of determining MFIP eligibility for the caregiver. The assessment must provide an initial examination of the caregiver's educational progress and needs, literacy level, child care and supportive service needs, family circumstances, skills, and work experience. In the case of a caregiver under the age of 18, the assessment must also consider the results of either the caregiver's or the caregiver's minor child's child and teen checkup under section 256B.0625, subdivision 58, if available, and the effect of a child's development and educational needs on the caregiver's ability to participate in the program. The county agency must advise the caregiver that the caregiver's first goal must be to complete an appropriate education option if one is identified for the caregiver through the assessment and, in consultation with educational agencies, must review the various school completion options with the caregiver and assist in selecting the most appropriate option.\n(b) The county agency must give a caregiver, who is age 18 or 19 and has not obtained a high school diploma or its equivalent, the option to choose an employment plan with an education option under subdivision 3 or an employment plan under section 142G.56, subdivision 2.\nFor caregivers who are under age 18 without a high school diploma or its equivalent, the assessment under subdivision 1 and the employment plan under subdivision 3 must be completed by the social services agency under section 257.33. For caregivers who are age 18 or 19 without a high school diploma or its equivalent who choose to have an employment plan with an education option under subdivision 3, the assessment under subdivision 1 and the employment plan under subdivision 3 must be completed by the job counselor or, at county option, by the social services agency under section 257.33. Upon reaching age 18 or 19 a caregiver who received social services under section 257.33 and is without a high school diploma or its equivalent has the option to choose whether to continue receiving services under the caregiver's plan from the social services agency or to utilize an MFIP employment and training service provider. The social services agency or the job counselor shall consult with the participant's school in developing the educational plan.\nIf the job counselor or county social services agency identifies an appropriate education option for a minor caregiver without a high school diploma or its equivalent, or a caregiver age 18 or 19 without a high school diploma or its equivalent who chooses an employment plan with an education option, the job counselor or agency must develop an employment plan which reflects the identified option. The plan must specify that participation in an educational activity is required, what school or educational program is most appropriate, the services that will be provided, the activities the caregiver will take part in, including child care and supportive services, the consequences to the caregiver for failing to participate or comply with the specified requirements, and the right to appeal any adverse action. The employment plan must, to the extent possible, reflect the preferences of the caregiver.\nIf the job counselor determines that there is no appropriate educational option for a caregiver who is age 18 or 19 without a high school diploma or its equivalent, the job counselor must develop an employment plan, as defined in section 142G.50, subdivision 4, for the caregiver. If the county social services agency determines that school attendance is not appropriate for a caregiver under age 18 without a high school diploma or its equivalent, the county agency shall refer the caregiver to social services for services as provided in section 257.33.\n(a) Minor parents, or 18- or 19-year-old parents without a high school diploma or its equivalent who choose an employment plan with an education option must attend school unless:\n(1) transportation services needed to enable the caregiver to attend school are not available;\n(2) appropriate child care services needed to enable the caregiver to attend school are not available;\n(3) the caregiver is ill or incapacitated seriously enough to prevent attendance at school; or\n(4) the caregiver is needed in the home because of the illness or incapacity of another member of the household. This includes a caregiver of a child who is younger than six weeks of age.\n(b) The caregiver must be enrolled in a secondary school and meeting the school's attendance requirements. The county, social service agency, or job counselor must verify at least once per quarter that the caregiver is meeting the school's attendance requirements. An enrolled caregiver is considered to be meeting the attendance requirements when the school is not in regular session, including during holiday and summer breaks.",
	"repealed": false
}