{
	"id": "237.764",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.764",
	"title": "237.764 PLAN ADOPTION; EFFECT.",
	"text": "(a) Before acting on a petition for approval of an alternative regulation plan, the commission shall conduct any public meetings it may consider necessary.\n(b) The commission shall require the petitioning telephone company to provide notice of the proposed plan to its customers, along with a summary description of the plan provisions and the dates, times, and locations of public meetings scheduled by the commission.\n(c) The company's petition shall contain an explanation of how ratepayers will benefit from the plan and a justification of the appropriateness of earnings levels and rates in light of the proposed plan as well as any proposed changes in rates for price-regulated services for the first three years of the proposed plan. If a telephone company has completed a general rate proceeding, rate investigation, or audit of its earnings by the department or commission within two years of the initial application for an alternative form of regulation plan, the commission order or department audit report, updated for the most recent calendar year, is sufficient justification of earnings levels to initiate the filing of an alternative regulation plan. At the time of filing a plan, the current earnings level of a telephone company with more than 1,000,000 access lines in Minnesota shall be deemed reasonable.\n(d) The commission shall conduct a proceeding under section 237.61 to decide whether to approve the plan and shall grant discovery as appropriate.\n(e) The commission shall issue findings of fact and conclusions concerning the appropriateness of the proposed initial rates, where necessary, and the proposed plan, or any modifications to it, but may not order that a modified plan take effect without the agreement of the petitioning telephone company. The commission shall issue its decision on a plan within six months after receiving the petition to approve the plan unless the commission and the petitioning company agree to an extension of the time for commission action.\n(f) If a settlement is submitted to the commission, the commission shall accept, reject, or modify the proposed settlement within 60 days from the date it was submitted.\nUpon receipt of a petition for an alternative regulation plan, the commission shall convene a conference including all interested parties to encourage settlement or stipulation of issues. Any settlement or stipulation must be submitted to the commission, which shall accept or reject the proposal in its entirety or modify it. If the commission modifies the proposal, all parties have 30 days to comment on the proposed modifications, after which the commission shall issue its final order. If the final order contains modifications to the proposal, each party to the settlement has ten days to reject the proposed modifications, in which case the matter must be decided under section 237.61. After appropriate notice and hearing for all parties, the commission may adopt a stipulation submitted by a substantial number of, but less than all, parties.\nThe approval of a plan under this section automatically terminates any existing incentive plan previously approved under section 237.625, prior to its expiration on August 1, 1999, upon the effective date of the plan approved under this section. However, the company remains obligated to share earnings under the terms of the incentive plan through the date of the termination of that plan and also is required to complete the performance of any other unexecuted commitments under the incentive plan.",
	"repealed": false
}