{
	"id": "60K.365",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.365",
	"title": "60K.365 PRODUCER TRAINING REQUIREMENTS FOR LONG-TERM CARE INSURANCE PRODUCTS.",
	"text": "(a) An individual may not sell, solicit, or negotiate long-term care insurance unless the individual is licensed as an insurance producer for accident and health or sickness insurance or life insurance and has completed an initial training course and ongoing training every 24 months thereafter. The training must meet the requirements of paragraph (b).\n(b) The initial training course required by this section must be no less than eight hours, and the ongoing training courses required by this section must be no less than four hours every 24 months. The courses must be approved by the commissioner and may be approved as continuing education courses under section 60K.56. The courses must consist of topics related to long-term care insurance, long-term care services, and qualified state long-term care insurance partnership programs, including, but not limited to:\n(1) state and federal regulations and requirements and the relationship between qualified state long-term care insurance partnership programs and other public and private coverage of long-term care services, including Medicaid/Minnesota medical assistance;\n(2) available long-term care services and providers;\n(3) changes or improvements in long-term care services or providers;\n(4) alternatives to the purchase of private long-term care insurance;\n(5) the effect of inflation on benefits and the importance of inflation protection; and\n(6) consumer suitability standards and guidelines.\nThe training required by this section must not include training that is insurer or company product specific or that includes any sales or marketing information, materials, or training, other than those required by state or federal law.\n(c) Insurers shall obtain verification that a producer has received the training required by this section before a producer is permitted to sell, solicit, or negotiate the insurer's long-term care insurance products. Insurers shall maintain records verifying that the producer has received the training contained in this section and make that verification available to the commissioner upon request.\n(d) The satisfaction of these initial training requirements in any state shall be deemed to satisfy the initial training requirements of this section.\n(e) Nonresident producers selling partnership policies shall be expected to demonstrate knowledge about unique aspects of the Minnesota medical assistance system. An insurer offering partnership products in Minnesota shall maintain records verifying that its nonresident producers have attained the required training and make that verification available to the commissioner upon request.",
	"repealed": false
}