{
	"id": "363A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.02",
	"title": "363A.02 PUBLIC POLICY.",
	"text": "(a) It is the public policy of this state to secure for persons in this state, freedom from discrimination:\n(1) in employment because of one or more of the following: race, color, creed, religion, national origin, sex, gender identity, marital status, disability, status with regard to public assistance, sexual orientation, familial status, and age;\n(2) in housing and real property because of one or more of the following: race, color, creed, religion, national origin, sex, gender identity, marital status, disability, status with regard to public assistance, sexual orientation, and familial status;\n(3) in public accommodations because of one or more of the following: race, color, creed, religion, national origin, sex, gender identity, sexual orientation, and disability;\n(4) in public services because of one or more of the following: race, color, creed, religion, national origin, sex, gender identity, marital status, disability, sexual orientation, and status with regard to public assistance; and\n(5) in education because of one or more of the following: race, color, creed, religion, national origin, sex, gender identity, marital status, disability, status with regard to public assistance, sexual orientation, and age.\n(b) Such discrimination threatens the rights and privileges of the inhabitants of this state and menaces the institutions and foundations of democracy. It is also the public policy of this state to protect all persons from wholly unfounded charges of discrimination. Nothing in this chapter shall be interpreted as restricting the implementation of positive action programs to combat discrimination.\nThe opportunity to obtain employment, housing, and other real estate, and full and equal utilization of public accommodations, public services, and educational institutions without such discrimination as is prohibited by this chapter is hereby recognized as and declared to be a civil right.\nIf any provision of Laws 1967, chapter 897, or the application thereof to any person or circumstances is held invalid, the invalidity does not affect the other provisions or applications of Laws 1967, chapter 897, which can be given effect without the invalid provision or application, and to this end the provisions of Laws 1967, chapter 897, are severable.",
	"repealed": false
}