{
	"id": "156.0721",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.0721",
	"title": "156.0721 INSTITUTIONAL LICENSURE.",
	"text": "(a) Any person who seeks to practice veterinary medicine while employed by the University of Minnesota and who is not eligible for a regular license shall make a written application to the board for an institutional license using forms provided for that purpose or in a format accepted by the board. The board shall issue an institutional license to practice veterinary medicine to an applicant who:\n(1) has obtained the degree of doctor of veterinary medicine or its equivalent from a nonaccredited college of veterinary medicine. A graduate from an accredited college and an applicant who has earned ECFVG or PAVE certificates should apply for a regular license to practice veterinary medicine;\n(2) has passed the Minnesota Veterinary Jurisprudence Examination;\n(3) is a person of good moral character, as attested by five notarized reference letters from adults not related to the applicant, at least two of whom are licensed veterinarians in the jurisdiction where the applicant is currently practicing or familiar with the applicant's clinical abilities as evidenced in clinical rotations;\n(4) has paid the license application fee;\n(5) provides proof of employment by the University of Minnesota;\n(6) certifies that the applicant understands and agrees that the institutional license is valid only for the practice of veterinary medicine associated with the applicant's employment as a faculty member, intern, resident, or locum of the University of Minnesota College of Veterinary Medicine or other unit of the University of Minnesota;\n(7) provides proof of graduation from a veterinary college;\n(8) completed a criminal background check as defined in section 214.075; and\n(9) provides other information and proof as the board may require by rules and regulations.\n(b) The University of Minnesota may submit the applications of its employees who seek an institutional license in a compiled format acceptable to the board, with any license application fees in a single form of payment.\n(c) The fee for a license issued under this subdivision is the same as for a regular license to practice veterinary medicine in the state. License payment and renewal deadlines, late payment fees, and other license requirements are also the same as for a regular license to practice veterinary medicine.\n(d) The University of Minnesota may be responsible for timely payment of renewal fees and submission of renewal forms.\n(a) An institutional license holder may practice veterinary medicine only as related to the license holder's regular function at the University of Minnesota. A person holding only an institutional license in this state must be remunerated for the practice of veterinary medicine in the state solely from state, federal, or institutional funds and not from the patient-owner beneficiary of the license holder's practice efforts.\n(b) A license issued under this section must be canceled by the board upon receipt of information from the University of Minnesota that the holder of the license has left or is otherwise no longer employed at the University of Minnesota in this state.\n(c) An institutional license holder must abide by all laws governing the practice of veterinary medicine in the state and is subject to the same disciplinary action as any other veterinarian licensed in the state.",
	"repealed": false
}