{
	"id": "446A.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.081",
	"title": "446A.081 DRINKING WATER REVOLVING FUND.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Eligible recipient\" means governmental units or other entities eligible to receive loans or other assistance as provided in the federal Safe Drinking Water Act.\n(c) \"Federal Safe Drinking Water Act\" means the federal Safe Drinking Water Act, as amended, United States Code, title 42, sections 300f et seq.\nThe authority shall establish a drinking water revolving fund to provide loans and other forms of financial assistance authorized by the federal Safe Drinking Water Act, as determined by the authority under the rules adopted under this section for the purposes and eligible costs authorized under the federal Safe Drinking Water Act. The fund must be credited with repayments. The federal Safe Drinking Water Act requires that the fund corpus must be managed so as to be available in perpetuity for the financing of drinking water systems in the state. At a minimum, 15 percent of the funds received each federal fiscal year shall be available solely for providing loans to public water systems which regularly serve fewer than 10,000 individuals.\nA state matching fund is established to be used in compliance with federal matching requirements specified in the federal Safe Drinking Water Act.\nThe authority shall enter into an agreement with the administrator of the United States Environmental Protection Agency to receive capitalization grants for the fund. The authority and the Department of Health shall enter into an operating agreement with the administrator of the United States Environmental Protection Agency to satisfy the criteria in the act to operate the fund. The authority and the Department of Health may exercise the powers necessary to comply with the requirements specified in the agreements and to ensure that loan recipients comply with all applicable federal and state requirements.\nThe authority shall annually prepare and submit to the United States Environmental Protection Agency an intended use plan. The plan must identify the intended uses of the amounts available to the drinking water revolving loan fund. The Department of Health shall provide a prioritized list of drinking water projects and other eligible activities to be considered for funding by the authority. The plan may be amended by the authority and include additional eligible projects proposed by the Department of Health.\nApplications by municipalities, privately owned public water systems, and eligible entities identified in the annual intended use plan for loans from the fund must be made to the authority on the forms prescribed by the rules of the authority and the rules of the Department of Health adopted under this section. The authority shall forward the application to the Department of Health within ten days of receipt. The Department of Health shall approve those applications that appear to meet the criteria in the federal Safe Drinking Water Act, this section, and the rules of the Department of Health or the authority.\nThe authority shall award loans to those municipalities, privately owned public water systems, and other eligible entities approved by the Department of Health, provided that the applicant is able to comply with the terms and conditions of the authority loan, which must be in conformance with the federal Safe Drinking Water Act, this section, and the rules of the authority adopted under this section.\n(a) When making loans from the drinking water revolving fund, the authority shall comply with the conditions of the federal Safe Drinking Water Act, including the criteria in this subdivision.\n(b) Loans must be made at or below market interest rates, including zero interest loans, for terms not to exceed those allowed under the federal Safe Drinking Water Act.\n(c) The annual principal and interest payments must begin no later than one year after completion of the project. Loans must be amortized no later than 20 years after project completion, unless the recipient's average annual residential drinking water system cost after completion of the project would exceed 1.2 percent of median household income in the recipient governmental unit or entity, in which case the loan must be fully amortized no later than 30 years after project completion.\n(d) A loan recipient must identify and establish a dedicated source of revenue for repayment of the loan, and provide for a source of revenue to properly operate, maintain, and repair the water system.\n(e) The fund must be credited with all payments of principal and interest on all loans, except the costs as permitted under section 446A.04, subdivision 5, paragraph (a).\n(f) A loan may not be used to pay operating expenses or current obligations, unless specifically allowed by the federal Safe Drinking Water Act.\n(g) A loan made by the authority must be secured by notes or bonds of the governmental unit and collateral to be determined by the authority for private borrowers.\n(h) Notwithstanding any law or rule to the contrary, for projects to replace lead service lines, loan and grant agreements must not exceed ten years. The interest rate for loans to replace lead service lines shall be zero percent with principal payments commencing not later than 18 months after completion of the project.\n(a) The drinking water revolving loan fund may be used as provided in the act, including the following uses:\n(1) to buy or refinance the debt obligations, at or below market rates, of public water systems for drinking water systems, where the debt was incurred after the date of enactment of the act, for the purposes of construction of the necessary improvements to comply with the national primary drinking water regulations under the federal Safe Drinking Water Act;\n(2) to purchase or guarantee insurance for local obligations to improve credit market access or reduce interest rates;\n(3) to provide a source of revenue or security for the payment of principal and interest on revenue or general obligation bonds issued by the authority if the bond proceeds are deposited in the fund;\n(4) to provide loans or loan guarantees for similar revolving funds established by a governmental unit or state agency;\n(5) to earn interest on fund accounts;\n(6) to pay the reasonable costs incurred by the authority, the Department of Employment and Economic Development, and the Department of Health for conducting activities as authorized and required under the act up to the limits authorized under the act;\n(7) to develop and administer programs for water system supervision, source water protection, and related programs required under the act;\n(8) to provide principal forgiveness or grants to the extent permitted under the federal Safe Drinking Water Act and other federal law, based on the criteria and requirements established for drinking water projects under the water infrastructure funding program under section 446A.072;\n(9) to provide loans, principal forgiveness or grants to the extent permitted under the federal Safe Drinking Water Act and other federal law to address green infrastructure, water or energy efficiency improvements, or other environmentally innovative activities;\n(10) to provide principal forgiveness, or grants for 80 percent of project costs up to a maximum of $100,000 for projects needed to comply with national primary drinking water standards for an existing nonmunicipal community public water system;\n(11) to provide principal forgiveness or grants to the extent permitted under the federal Safe Drinking Water Act and other federal laws for projects to replace the privately owned portion of drinking water lead service lines; and\n(12) to provide principal forgiveness or grants to the extent permitted under the federal Safe Drinking Water Act and other federal laws for 50 percent of project costs up to a maximum of $3,000,000 for projects to address emerging contaminants in drinking water as defined by the United States Environmental Protection Agency.\n(b) Principal forgiveness or grants provided under paragraph (a), clause (9), may not exceed 25 percent of the eligible project costs as determined by the Department of Health for project components directly related to green infrastructure, water or energy efficiency improvements, or other environmentally innovative activities, up to a maximum of $1,000,000.\nPayments from the fund to borrowers must be in accordance with the applicable state and federal laws governing the payments, except no payment for a project may be made to a borrower until and unless the authority has determined that the total estimated cost of the project and the financing of the project are assured by:\n(1) a loan authorized by state law or appropriation of proceeds of bonds or other money of the borrower to a fund for the construction of the project; and\n(2) an irrevocable undertaking, by resolution of the governing body of the borrower, to use all money made available for the project exclusively for the project, and to pay any additional amount by which the cost of the project exceeds the estimate by the appropriation to the construction fund of additional money or proceeds of additional bonds to be issued by the borrower.\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 10]\nThe Department of Health shall adopt rules relating to the procedures for administration of the Department of Health's duties under the act and this section.",
	"repealed": false
}