{
	"id": "148B.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.381",
	"title": "148B.381 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for disciplinary action relating to licensure or unlicensed practice under sections 148B.29 to 148B.392 may report the violation to the board.\nA state agency, political subdivision, agency of a local unit of government, private agency, hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the agency, institution, or organization or any of its administrators or medical or other committees to revoke, suspend, restrict, or condition a licensee's privilege to practice or treat patients or clients in the institution, or as part of the organization, any denial of privileges, or any other disciplinary action for conduct that might constitute grounds for disciplinary action by the board under sections 148B.29 to 148B.392. The institution or organization shall also report the resignation of any licensees prior to the conclusion of any disciplinary action proceeding for conduct that might constitute grounds for disciplinary action under sections 148B.29 to 148B.392, or prior to the commencement of formal charges but after the licensee had knowledge that formal charges were contemplated or in preparation.\nA state or local professional society or association for licensees shall forward to the board any complaint received concerning the ethics or conduct of the practice of marriage and family therapy. The society or association shall forward a complaint to the board upon receipt of the complaint. The society or association shall also report to the board any disciplinary action taken against a member.\nA licensed health professional shall report to the board personal knowledge of any conduct that the licensed health professional reasonably believes constitutes grounds for disciplinary action under sections 148B.29 to 148B.392 by any licensee, including conduct indicating that the licensee may be medically incompetent, or may be medically or physically unable to engage safely in the provision of services. If the information was obtained in the course of a client relationship, the client is another licensee, and the treating individual successfully counsels the other individual to limit or withdraw from practice to the extent required by the impairment, the board may deem this limitation of or withdrawal from practice to be sufficient disciplinary action.\n(a) Four times each year as prescribed by the board, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to licensees, or the Joint Underwriting Association under chapter 62I, shall submit to the board a report concerning the licensees against whom malpractice settlements or awards have been made to the plaintiff. The report must contain at least the following information:\n(1) the total number of malpractice settlements or awards made;\n(2) the date the malpractice settlements or awards were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made;\n(4) the dollar amount of each malpractice settlement or award;\n(5) the regular address of the practice of the licensee against whom an award was made or with whom a settlement was made; and\n(6) the name of the licensee against whom an award was made or with whom a settlement was made.\n(b) The insurance company shall, in addition to the information listed in paragraph (a), report to the board any information it possesses that tends to substantiate a charge that a licensee may have engaged in conduct violating this chapter.\nThe court administrator of a district court or any other court of competent jurisdiction shall report to the board any judgment or other determination of the court that adjudges or includes a finding that a licensee is a person who is mentally ill, mentally incompetent, guilty of a felony, guilty of a violation of federal or state narcotics laws or controlled substances act, or guilty of abuse or fraud under Medicare or Medicaid; or that appoints a guardian of the licensee pursuant to sections 524.5-101 to 524.5-502 or commits a licensee pursuant to chapter 253B.\nA licensee shall report to the board any personal action that would require that a report be filed by any person, health care facility, business, or organization pursuant to subdivisions 2 to 6.\nReports required by subdivisions 2 to 7 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to ensure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 2 to 7 or any related documents.\nAny person, institution, insurer, or organization that fails to report as required under subdivisions 2 to 6 shall be subject to civil penalties for failing to report as required by law.",
	"repealed": false
}