{
	"id": "121A.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.335",
	"title": "121A.335 LEAD IN SCHOOL DRINKING WATER.",
	"text": "The commissioners of health and education shall jointly develop a model plan to require school districts to accurately and efficiently test for the presence of lead in water in public school buildings serving students in kindergarten through grade 12. To the extent possible, the commissioners shall base the plan on the standards established by the United States Environmental Protection Agency. The plan may be based on the technical guidance in the Department of Health's document, \"Reducing Lead in Drinking Water: A Technical Guidance for Minnesota's School and Child Care Facilities.\" The plan must include recommendations for remediation efforts when testing reveals the presence of lead at or above five parts per billion.\n(a) By July 1, 2018, the board of each school district or charter school must adopt the commissioners' model plan or develop and adopt an alternative plan to accurately and efficiently test for the presence of lead in water in school buildings serving prekindergarten students and students in kindergarten through grade 12.\n(b) By July 1, 2024, a school district or charter school must revise its plan to include its policies and procedures for ensuring consistent water quality throughout the district's or charter school's facilities. The plan must document the routine water management strategies and procedures used in each building or facility to maintain water quality and reduce exposure to lead. A district or charter school must base the plan on the United States Environmental Protection Agency's \"Ensuring Drinking Water Quality in Schools During and After Extended Closures\" fact sheet and the United States Environmental Protection Agency's \"3Ts Toolkit for Reducing Lead in Drinking Water in Schools and Child Care Facilities\" manual. A district or charter school's plan must be publicly available upon request.\n(a) The plan under subdivision 2 must include a testing schedule for every building serving prekindergarten through grade 12 students. The schedule must require that each building be tested at least once every five years. A school district or charter school must begin testing school buildings by July 1, 2018, and complete testing of all buildings that serve students within five years.\n(b) A school district or charter school that finds lead at a specific location providing cooking or drinking water within a facility must formulate, make publicly available, and implement a plan that is consistent with established guidelines and recommendations to ensure that student exposure to lead is reduced to below five parts per billion as verified by a retest. This includes, when a school district or charter school finds the presence of lead at or above five parts per billion in any water fixture that can provide cooking or drinking water, immediately shutting off the water fixture or making it unavailable until the hazard has been remediated as verified by a retest.\n(c) A school district or charter school must test for the presence of lead after completing remediation activities required under this section to confirm that the water contains lead at a level below five parts per billion.\nA school district may include lead testing and remediation as a part of its ten-year facilities plan under section 123B.595.\n(a) A school district or charter school must send parents an annual notice that includes the district's or charter school's annual testing and remediation plan, information about how to find test results, and a description of remediation efforts on the district website. The district or charter school must update the lead testing and remediation information on its website at least annually. In addition to the annual notice, the district or charter school must include in an official school handbook or official school policy guide information on how parents may find the test results and a description of remediation efforts on the district or charter school website and how often this information is updated.\n(b) If a test conducted under subdivision 3, paragraph (a), reveals the presence of lead at or above five parts per billion, the school district or charter school must, within 30 days of receiving the test result, either remediate the presence of lead to below five parts per billion, verified by retest, or directly notify parents of the test result.\n(c) Starting July 1, 2024, school districts and charter schools must report their test results and remediation activities to the commissioner of health in the form and manner determined by the commissioner in consultation with school districts and charter schools, by July 1 of each year. The commissioner of health must post and annually update the test results and remediation efforts on the department website by school site.\n(d) A district or charter school must maintain a record of lead testing results and remediation activities for at least 15 years.\n(a) A district or charter school is not financially responsible for remediation of documented elevated lead levels in drinking water caused by the presence of lead infrastructure owned by a public water supply utility providing water to the school facility, such as lead service lines, meters, galvanized service lines downstream of lead, or lead connectors. The district or charter school must communicate with the public water system regarding its documented significant contribution to lead contamination in school drinking water and request from the public water system a plan for reducing the lead contamination.\n(b) If the infrastructure is jointly owned by a district or charter school and a public water supply utility, the district or charter school must attempt to coordinate any needed replacements of lead service lines with the public water supply utility.\n(c) A district or charter school may defer its remediation activities under this section until after the elevated lead level in the public water system's infrastructure is remediated and postremediation testing does not detect an elevated lead level in the drinking water that passes through that infrastructure. A district or charter school may also defer its remediation activities if the public water supply exceeds the federal Safe Drinking Water Act lead action level or is in violation of the Safe Drinking Water Act Lead and Copper Rule.\nBy January 1, 2026, and every five years thereafter, the commissioner of health must report to the legislative committees having jurisdiction over health and kindergarten through grade 12 education any recommended changes to this section. The recommendations must be based on currently available scientific evidence regarding the effects of lead in drinking water.",
	"repealed": false
}