{
	"id": "289A.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.55",
	"title": "289A.55 INTEREST PAYABLE TO COMMISSIONER.",
	"text": "When interest is required under this section, interest is computed at the rate specified in section 270C.40.\nIf a tax is not paid within the time named by law for payment, the unpaid tax bears interest from the date the tax should have been paid until the date the tax is paid.\nWhen an extension of time for payment has been granted, interest must be paid from the date the payment should have been made, if no extension had been granted, until the date the tax is paid.\nWhen a taxpayer is liable for additional taxes because of a redetermination by the commissioner, or for any other reason, the additional taxes bear interest from the time the tax should have been paid, without regard to an extension allowed, until the date the tax is paid.\nWhen it is determined that a claim for a property tax refund was excessive, the amount that the taxpayer must repay bears interest from the date the claim was paid until the date of repayment.\nIn the case of an erroneous refund, interest begins to accrue from the date the refund was paid unless the erroneous refund results from a mistake of the commissioner, in which case no interest or penalty will be imposed, unless the deficiency assessment is not satisfied within 60 days of the order.\nInterest must be paid on unpaid installment payments of the tax authorized under section 289A.30, subdivision 2, beginning on the date the tax was due without regard to extensions allowed or extensions elected, at the rate given in section 270C.40.\nNotwithstanding section 549.09, if judgment is entered in favor of the commissioner with regard to any tax, the judgment bears interest at the rate given in section 270C.40 from the date the judgment is entered until the date of payment.\n(a) A penalty imposed under section 289A.60, subdivision 1, 2, 2a, 4, 5, 6, or 21 bears interest from the date provided in section 270C.40, subdivision 3, to the date of payment of the penalty.\n(b) A penalty not included in paragraph (a) bears interest only if it is not paid within 60 days from the date of notice. In that case interest is imposed from the date of notice to the date of payment.\nA purchaser that meets the requirements of section 297A.995, subdivision 11, is relieved from the imposition of interest on tax and penalty.",
	"repealed": false
}