{
	"id": "120B.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.251",
	"title": "120B.251 ETHNIC STUDIES REQUIREMENTS.",
	"text": "\"Ethnic studies\" has the meaning provided in section 120B.25.\n(a) Starting in the 2026-2027 school year, a district or charter school high school must offer an ethnic studies course that fulfills the requirements of this paragraph. Nothing in this section increases or otherwise affects the number of credits required for graduation under section 120B.024. An ethnic studies course may fulfill a social studies, language arts, arts, math, or science credit if the course meets the applicable state academic standards. An ethnic studies course may fulfill an elective credit if the course meets applicable local academic standards or other requirements.\n(b) School districts and charter schools must provide ethnic studies instruction in elementary schools and middle schools by the 2027-2028 school year in accordance with state academic standards.\n(c) Ethnic studies instruction must meet statewide ethnic studies academic standards.\n(d) An ethnic studies course may focus specifically on a particular group of national or ethnic origin.\nThe Department of Education must hire dedicated ethnic studies staff sufficient to fulfill the following department duties:\n(1) support school district and charter school implementation of ethnic studies courses that fulfill ethnic studies standards through activities such as assistance with increased completion of the Minnesota Common Course Catalog, hosting an annual implementation support symposium, and regular updates and lessons learned;\n(2) support school districts and charter schools in providing training for teachers and school district staff to successfully implement ethnic studies standards;\n(3) support and provide tools for each school district or charter school to annually evaluate the implementation of the ethnic studies requirements by seeking feedback from students, parents or guardians, and community members;\n(4) provide resources and examples of how a dedicated coordinator for ethnic studies can facilitate higher quality implementation of ethnic studies; and\n(5) make available to school districts and charter schools the following:\n(i) an ethnic studies school survey for each school district and charter school to use as part of a school needs assessment;\n(ii) a list of recommended examples of implementation supports for use in kindergarten through grade 12 that accurately reflect the diversity of the state of Minnesota;\n(iii) training materials for teachers and district and school staff, including an ethnic studies coordinator, to implement ethnic studies requirements; and\n(iv) other resources to assist districts and charter schools in successfully implementing ethnic studies standards.",
	"repealed": false
}