{
	"id": "469.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.155",
	"title": "469.155 POWERS.",
	"text": "Any municipality or redevelopment agency has the powers set forth in this section.\nIt may acquire, construct, and hold any lands, buildings, easements, water and air rights, improvements to lands and buildings, and capital equipment to be located permanently or used exclusively on a designated site and solid waste disposal and pollution control equipment, and alternative energy equipment and inventory, regardless of where located, that are deemed necessary in connection with a project to be situated within the state, and construct, reconstruct, improve, better, and extend the project. It may also pay part or all of the cost of an acquisition and construction by a contracting party under a revenue agreement.\nIn the case of a project described in section 469.153, subdivision 2, paragraph (j), it may purchase obligations issued by a local unit of government that is located in whole or in part within the boundaries of the municipality at public sale, or at private sale if the obligations may be sold in that manner under the law authorizing their issuance. The obligations must be issued under a capital improvement plan or program of at least five years.\n(a) It may issue revenue bonds, in anticipation of the collection of revenues of a project to be situated within the state, to finance, in whole or in part, the cost of the acquisition, construction, reconstruction, improvement, betterment, or extension thereof and of any related public improvements.\n(b) It may issue revenue bonds to purchase the obligations of local government units located in whole or in part within the boundaries of the municipality. The proceeds of bonds issued to purchase obligations as provided under this paragraph may be disbursed or otherwise used to pay underwriter's or placement fees, expenses, or other costs of issuance and sale for the bonds only on a pro rata basis determined with respect to the portion of the proceeds that are used to purchase the obligations. The municipality may not pay the underwriter's or placement fees, expenses, or other costs of issuance and sale out of other money.\nIt may issue revenue bonds to pay, purchase, or discharge all or any part of the outstanding indebtedness of a contracting party that is a qualifying organization previously incurred in the acquisition or betterment of its existing facilities to the extent deemed necessary by the governing body of the municipality or redevelopment agency; this may include any unpaid interest on the indebtedness accrued or to accrue to the date on which the indebtedness is finally paid, and any premium the governing body of the municipality or redevelopment agency determines to be necessary to be paid to pay, purchase, or defease the outstanding indebtedness. If revenue bonds are issued for this purpose, the refinancing and the existing properties of the contracting party shall be deemed to constitute a project under section 469.153, subdivision 2, paragraph (b), (c), or (d).\nFor purposes of this subdivision, \"qualifying organization\" means an organization that is primarily engaged in one or more of the following:\n(1) health care related activities;\n(2) activities for mentally or physically disabled persons;\n(3) the operation of one or more nonprofit hospitals or nursing homes;\n(4) educational activities as an elementary, secondary, or postsecondary school;\n(5) presentation of artistic performances or arts education, such as theaters and museums; or\n(6) providing social services, such as providing assistance to the poor, distressed, or underprivileged.\nIt may enter into a revenue agreement with any person, firm, or public or private corporation or federal or state governmental subdivision or agency so that payments required thereby to be made by the contracting party are fixed and revised as necessary to produce income and revenue sufficient to provide for the prompt payment of principal of and interest on all bonds issued hereunder when due. The revenue agreement must also provide that the contracting party is required to pay all expenses of the operation and maintenance of the project including adequate insurance thereon and insurance against all liability for injury to persons or property arising from its operation, and all taxes and special assessments levied upon or with respect to the project and payable during the term of the revenue agreement. During the term of the revenue agreement, except as provided in subdivision 17, a tax shall be imposed and collected upon the project or, pursuant to the provisions of section 272.01, subdivision 2, for the privilege of using and possessing the project, in the same amount and to the same extent as though the contracting party were the owner of all real and personal property comprising the project. No revenue agreement is required in connection with a project described in section 469.153, subdivision 2, paragraph (j).\nIt may pledge and assign to the holders of the bonds or a trustee therefor all or any part of the revenues of one or more projects and define and segregate the revenues or provide for the payment thereof to a trustee, whether or not the trustee is in possession of the project under a mortgage or otherwise.\nIt may mortgage or otherwise encumber or grant a security interest in any project and its revenues, or may permit a mortgage, encumbrance, or security interest to be granted by a contracting party to the revenue agreement, in favor of the municipality or redevelopment agency, the holders of the bonds, or a trustee therefor. In creating a mortgage, encumbrance, or security interest, a municipality or redevelopment agency shall not obligate itself except with respect to the project and its revenues, unless otherwise specifically provided by law.\nIt may make all contracts, execute all instruments, and do all things necessary or convenient in the exercise of the powers granted in sections 469.152 to 469.165, or in the performance of its covenants or duties, or in order to secure the payment of its bonds. It may enter into a revenue agreement authorizing the contracting party, subject to any terms and conditions the municipality or redevelopment agency finds necessary or desirable and proper, to provide for the construction, acquisition, and installation of the buildings, improvements, and equipment to be included in the project and any related public improvements by any means legally available to the contracting party and in the manner determined by the contracting party and without advertisement for bids unless advertisement by the contracting party is otherwise required by law.\nIt may enter into and perform contracts and agreements with other municipalities, political subdivisions, and state agencies, authorities, and institutions as the governing body of the municipality or redevelopment agency may deem proper and feasible for or concerning the planning, construction, lease, purchase, mortgaging, or other acquisition, and the financing of a project, and the maintenance thereof, including an agreement whereby one municipality issues its revenue bonds in behalf of one or more other municipalities pursuant to revenue agreements with the same or different contracting parties, which contracts and agreements may establish a board, commission, or other body deemed proper for the supervision and general management of the facilities of the project. However, no municipality or redevelopment agency may enter into or perform any contract or agreement with any school district under which the municipality or redevelopment agency issues its revenue bonds or otherwise provides for the construction of school facilities and the school leases or otherwise acquires these facilities.\nIt may accept from any authorized agency of the federal government loans or grants for the planning, construction, acquisition, leasing, purchase, or other provision of any project, and enter into agreements with the agency respecting the loans or grants.\nIt may sell and convey all properties acquired in connection with projects, including the sale and conveyance thereof subject to a mortgage, or the sale and conveyance thereof under an option granted to the lessee of the project, for the price, and at the time the governing body of the municipality or redevelopment agency determines. No sale or conveyance of the properties may be made in a manner that impairs the rights or interests of the holders of any bonds issued under the authority of sections 469.152 to 469.165.\nIt may issue revenue bonds to refund, in whole or in part, bonds previously issued by the municipality or redevelopment agency under authority of sections 469.152 to 469.165, and interest on them. The municipality or redevelopment agency may issue revenue bonds to refund, in whole or in part, bonds previously issued by any other municipality or redevelopment agency on behalf of an organization described in section 501(c)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1990, under authority of sections 469.152 to 469.155, and interest on them, but only with the consent of the original issuer of such bonds. The municipality or redevelopment agency may issue and sell warrants which give to their holders the right to purchase refunding bonds issuable under this subdivision prior to a stipulated date. The warrants are not required to be sold at public sale and all or any agreed portion of the proceeds of the warrants may be paid to the contracting party under the revenue agreement required by subdivision 5 or to its designee under the conditions the municipality or redevelopment agency shall agree upon. Warrants shall not be issued which obligate a municipality or redevelopment agency to issue refunding bonds that are or will be subject to federal tax law as defined in section 474A.02, subdivision 8. The warrants may provide a stipulated exercise price or a price that depends on the tax exempt status of interest on the refunding bonds at the time of issuance. The average interest rate on refunding bonds issued upon the exercise of the warrants to refund fixed rate bonds shall not exceed the average interest rate on fixed rate bonds to be refunded. The municipality or redevelopment agency may appoint a bank or trust company to serve as agent for the warrant holders and enter into agreements deemed necessary or incidental to the issuance of the warrants.\nIf so provided in the revenue agreement, it may terminate the agreement and reenter or repossess the project upon the default of the contracting party, and operate, lease, or sell the project in the manner authorized or required by the provisions of the revenue agreement or of the resolution or indenture securing the bonds issued for the project. If it undertakes to operate the project, it may hold in its own name all necessary operating licenses including licenses for the sale of food and intoxicating liquors. Any revenue agreement which includes provision for a conveyance of real estate to the contracting party may be terminated in accordance with the revenue agreement, notwithstanding that the revenue agreement may constitute an equitable mortgage.\nIt may not operate any project referred to in sections 469.152 to 469.165 as a business or in any manner, except as authorized in subdivision 13. Nothing in this section authorizes any municipality or redevelopment agency to expend any funds on any project, other than the revenues of the project, or the proceeds of revenue bonds and notes issued hereunder, or other funds granted to the municipality or redevelopment agency for the purposes of sections 469.152 to 469.165, except:\n(1) as is otherwise permitted by law;\n(2) to enforce any right or remedy under any revenue agreement or related agreement for the benefit of the bondholders or for the protection of any security given in connection with a revenue agreement; or\n(3) to pay without reimbursement part or all of the public cost of redevelopment of land including the acquisition of the site of the project, which cost shall not be deemed part of the cost of the project.\nIt may invest or deposit, or authorize a trustee to invest or deposit, any proceeds of revenue bonds or notes issued pursuant to sections 469.152 to 469.165, and income from the investment of the proceeds, in any manner and upon any terms and conditions agreed to by the contracting party under the related revenue agreement, resolution, or indenture, notwithstanding chapter 118A, but subject to any statutory provisions which govern the deposit and investment of funds of a contracting party which is itself a governmental subdivision or agency.\nIt may waive or require the furnishing of a contractor's payment and performance bond of the kind described in section 574.26, whether or not the municipality or redevelopment agency is a party to the construction contract. If the bond is required, the provisions of chapter 514 relating to liens for labor and materials are not applicable with respect to work done or labor or materials supplied for the project. If the bond is waived, the provisions of chapter 514 apply with respect to work done or labor or materials supplied for the project.\nIf a building is to be constructed for sale or rent to a contracting party, the building is exempt from taxation as public property exclusively used for a public purpose until the building is first conveyed or first occupied by the lessee, in whole or in part, whichever occurs first, for up to a maximum of four years from the date of issue of bonds or notes for the project. The exemption must be applied for before October 10 of the year of the levy of the first taxes to which the exemption applies.\nUpon foreclosure of any mortgage securing a revenue agreement entered into with respect to revenue bonds issued under this section, the city, trustee, or other mortgagee may determine that the mortgage debt for purposes of chapters 580, 581, 582, and 583 is the revenue agreement debt and does not include the bond debt, or the mortgagee may determine that the mortgage debt includes both the revenue agreement debt and the bond debt. The notice of sale or complaint shall state whether the foreclosure is to enforce only the revenue agreement debt or both the revenue agreement debt and the bond debt. If the mortgagee determines that the foreclosure is to enforce only the revenue agreement debt and not the bond debt:\n(1) the revenue agreement debt is the mortgage debt for all purposes under chapters 580, 581, 582, and 583;\n(2) the bond debt will remain outstanding as a valid and continuing separate debt and will not be extinguished, satisfied, relinquished, or otherwise terminated by the foreclosure sale; and\n(3) the city or mortgagee may enter into a revenue agreement with the purchaser of the mortgaged property or a subsequent transferee, which provides for satisfaction by payment in full or otherwise of all principal of and interest on the bonds then in arrears and to become due.",
	"repealed": false
}