{
	"id": "97A.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.121",
	"title": "97A.121 HUNTING IN PRIVATE SHOOTING PRESERVES.",
	"text": "(a) A person hunting released birds in a private shooting preserve must have the licenses required by law for hunting pheasants.\n(b) A license is not required to hunt authorized game birds on a commercial shooting preserve.\n(a) The open season for hunting in commercial shooting preserves is continuous. Sanctioned registered field trials in commercial shooting preserves may be held from April 16 to July 14 after notification to the commissioner.\n(b) The open season for hunting in a private shooting preserve is September 15 until December 31.\n(c) The commissioner may restrict the open season after receiving a complaint, holding a public hearing, and finding that the population of wild game birds is in danger by hunting in the preserve.\nA shooting preserve licensee may determine who is allowed to hunt in the preserve. In each preserve the licensee may establish the charge for taking game, the shooting hours, the season, limitations, and restrictions on the age, sex, and number of each species that may be taken by a hunter. These provisions may not conflict with this section or section 97A.115 and may not be less restrictive than any rule.\nExcept as provided in subdivision 4a, the commissioner shall prescribe the minimum number of each authorized species that may be released and the percentage of each species that may be taken. The commissioner shall prescribe methods for identifying birds to be released.\n(a) A private shooting preserve licensed to release pheasants may release no more than 300 adult pheasants on the licensed shooting preserve area during the private shooting preserve hunting season. The number of pheasants harvested may not exceed 95 percent of the number of pheasants released.\n(b) A commercial shooting preserve must release at least 1,000 adult pheasants.\nHarvested game, except ducks that are marked in accordance with regulations of the United States Fish and Wildlife Service, must be marked or identified by the shooting preserve in a manner prescribed by the commissioner. The commissioner may issue the tags or other markings at a cost of 15 cents each. The marking must remain attached on the bird while the bird is transported.\nA shooting preserve licensee must maintain a registration book listing the names, addresses, and hunting license numbers, if applicable, of all hunters, the date when they hunted, the amount and species of game taken, and the tag numbers or other markings affixed to each bird. A shooting preserve must keep records of the number of each species raised and purchased and the date and number of each species released. The records must be open to inspection by the commissioner at all reasonable times.",
	"repealed": false
}