{
	"id": "412.571",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.571",
	"title": "412.571 CONTINUANCE IN OFFICE; ELECTIONS.",
	"text": "When an optional plan is first adopted in any statutory city in which the standard plan of statutory city government is then in operation, the council shall continue as then constituted until the expiration of the term of the incumbent clerk. At the city election preceding expiration of the term of the incumbent clerk, one council member shall be elected in addition to the council member or council members who would otherwise be chosen at the election. If a minority of the other council members is chosen at the election, the term of the additional council member chosen at the election shall be four years, but if a majority of the other council members is chosen at the election, the initial term of the additional council member chosen at the election shall be two years. At each regular election thereafter, council members shall be elected for four-year terms. If the optional plan is adopted at the regular city election at which the office of clerk is to be filled, the candidate elected to that office at the election shall not assume the office of clerk in January, but shall become the additional council member unless appointed clerk under the optional plan, in which case the unfilled office of council member shall be considered vacant.\nWhen an optional plan is first adopted in any city in which the standard plan is then in operation, the incumbent clerk and treasurer, or clerk-treasurer, shall continue to serve until the expiration of their respective terms.\nWhen an optional plan is abandoned and another optional plan is adopted in its place, incumbent members of the council shall continue to serve until the expiration of their respective terms, and the election schedule shall not be affected by the change.\nWhen any optional plan is abandoned and the standard form of city government is resumed, terms of then incumbent council members shall not be affected by the abandonment; but until the first business day of January following the next regular city election, the clerk shall not serve as a member of the council. At the city election preceding that date one council member less shall be elected.\nWhen any optional plan is abandoned and the standard form of city government is resumed, the office of clerk, or clerk-treasurer shall remain appointive until the first business day of January following the next regular city election and the office of treasurer, if there is no clerk-treasurer, shall remain appointive until the first business day of January following the first subsequent city election at which the clerk is not elected; and the successor to the incumbent clerk, clerk-treasurer, and treasurer shall be chosen at the regular city election immediately preceding the January in which the office becomes elective.",
	"repealed": false
}