{
	"id": "257C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/257C.03",
	"title": "257C.03 PROCEDURE.",
	"text": "(a) In a court of this state with jurisdiction to decide child custody matters, a de facto or third-party child custody proceeding may be brought by an individual other than a parent by filing a petition seeking custody in the county where:\n(1) the child is permanently a resident, the child is found, or an earlier order for custody of the child has been entered; or\n(2) the court has jurisdiction over the matter under chapter 518D.\n(b) The proceeding is commenced by personal service of the summons and petition.\n(c) An individual other than a parent who seeks visitation under this section must qualify under one of the provisions of section 257C.08, and must comply with the provisions of this subdivision to commence the proceeding.\n(a) A petition for custody filed under this section must state and allege:\n(1) the name and address of the petitioner and any prior or other name used by the petitioner;\n(2) the name and, if known, the address and Social Security number of the respondent mother and father or guardian and any prior or other name used by the respondent and known to the petitioner;\n(3) the name and date of birth of each child for whom custody is sought;\n(4) the relationship of the petitioner to each child for whom custody is sought;\n(5) the petitioner or petitioners' basis for jurisdiction under section 257C.01, subdivision 2 or 3;\n(6) the current legal and physical custodial status of each child for whom custody is sought and a list of all prior orders of custody, if known to the petitioner;\n(7) whether any party is a member of the armed services;\n(8) the length of time each child has resided with the petitioner and has resided in the state of Minnesota;\n(9) whether a separate proceeding for dissolution, legal separation, or custody is pending in a court in this state or elsewhere;\n(10) whether a permanent or temporary standby custody designation has been executed or filed in a court in this state or elsewhere;\n(11) whether a permanent or temporary standby custody designee differs in identity from the de facto custodian and reasons why the proposed de facto custodian should have custodial priority over a designated standby custodian;\n(12) whether parenting time should be granted to the respondents;\n(13) any temporary or permanent child support, attorney fees, costs, and disbursements;\n(14) whether an order of protection under chapter 518B or a similar law of another state that governs the parties or a party and a minor child of the parties is in effect and, if so, the district court or similar jurisdiction in which it was entered; and\n(15) that it is in the best interests of the child under section 257C.04 that the petitioner have custody of the child.\n(b) The petition must be verified by the petitioner or petitioners and its allegations established by competent evidence.\n(a) Written notice of a hearing on a petition to establish de facto or third-party custody of a child must be given to:\n(1) the parent of the child, if:\n(i) the person's name appears on the child's birth certificate as a parent;\n(ii) the person has substantially supported the child;\n(iii) the person either was married to the person designated on the birth certificate as the natural mother within the 325 days before the child's birth or married that person within the ten days after the child's birth;\n(iv) the person is openly living with the child or the person designated on the birth certificate as the natural mother of the child, or both;\n(v) the person has been adjudicated the child's parent;\n(vi) the person has filed a paternity action within 30 days after the child's birth and the action is still pending; or\n(vii) the person and the mother of the child signed a declaration of parentage under section 257.34 before August 1, 1995, which has not been revoked, or a recognition of parentage under section 257.75 which has not been revoked or vacated;\n(2) the guardian or legal custodian, if any, of the child; and\n(3) the child's tribe pursuant to section 260.761, subdivision 3, if the child is an Indian child.\n(b) Notice under this section need not be given to a person listed in this subdivision whose parental rights have been terminated.\n(c) Written notice of a hearing on a petition to establish de facto or third-party custody of a child must be given to the public authority if either parent receives public assistance, the petitioner receives public assistance on behalf of the child, or either parent receives child support enforcement services from the public authority or applies for public assistance or child support enforcement services from the public authority after a petition under this section is filed. Notice to the public authority must include a copy of the petition.\n(a) Approval of an order under this section without a hearing is permitted if both parents consent by stipulation or agreement that it is in the best interests of the child to be in the custody of the de facto custodian or interested third party.\n(b) If either parent receives public assistance, the petitioner receives public assistance on behalf of the child, or either parent receives child support enforcement services from the public authority, the petitioner must notify the public authority of the stipulation or agreement under this subdivision.\n(a) The court must be guided by the factors set forth in section 518.131, concerning temporary orders and restraining orders; chapter 518A, concerning child support; sections 518.17 to 518.175, concerning custody and parenting time; and sections 518.14 and 518A.735, concerning costs and attorney fees, in making temporary orders and restraining orders.\n(b) The court may grant ex parte relief only if requested by a motion with a properly executed supporting affidavit. The affidavit must outline specific supporting facts as to why the case needs to be expedited.\n(c) The court shall grant ex parte or temporary relief if the petitioner and situation fit the factors outlined for de facto custodian or third-party custodian under subdivisions 6 and 7, and section 257C.01, subdivisions 2 and 3.\n(d) If the court orders temporary custody under this subdivision, the de facto custodian or interested third party shall seek temporary or permanent custody of the child pursuant to a petition under this chapter and the other standards of this chapter apply.\n(a) To establish that an individual is a de facto custodian, the individual must:\n(1) show by clear and convincing evidence that the individual satisfies the provisions of section 257C.01, subdivision 2; and\n(2) prove by a preponderance of the evidence that it is in the best interests of the child to be in the custody of the de facto custodian.\n(b) The following factors must be considered by the court in determining a parent's lack of demonstrated consistent participation for purposes of section 257C.01, subdivision 2:\n(1) the intent of the parent or parents in placing the child with the de facto custodian;\n(2) the amount of involvement the parent had with the child during the parent's absence;\n(3) the facts and circumstances of the parent's absence;\n(4) the parent's refusal to comply with conditions for retaining custody set forth in previous court orders;\n(5) whether the parent now seeking custody was previously prevented from doing so as a result of domestic violence; and\n(6) whether a sibling of the child is already in the petitioner's care.\n(c) In determining the best interests of the child, the court must apply the standards in section 257C.04.\n(a) To establish that an individual is an interested third party, the individual must:\n(1) show by clear and convincing evidence that one of the following factors exist:\n(i) the parent has abandoned, neglected, or otherwise exhibited disregard for the child's well-being to the extent that the child will be harmed by living with the parent;\n(ii) placement of the child with the individual takes priority over preserving the day-to-day parent-child relationship because of the presence of physical or emotional danger to the child, or both; or\n(iii) other extraordinary circumstances;\n(2) prove by a preponderance of the evidence that it is in the best interests of the child to be in the custody of the interested third party; and\n(3) show by clear and convincing evidence that granting the petition would not violate section 518.179.\n(b) The following factors must be considered by the court in determining an interested third party's petition:\n(1) the amount of involvement the interested third party had with the child during the parent's absence or during the child's lifetime;\n(2) the amount of involvement the parent had with the child during the parent's absence;\n(3) the presence or involvement of other interested third parties;\n(4) the facts and circumstances of the parent's absence;\n(5) the parent's refusal to comply with conditions for retaining custody set forth in previous court orders;\n(6) whether the parent now seeking custody was previously prevented from doing so as a result of domestic violence;\n(7) whether a sibling of the child is already in the care of the interested third party; and\n(8) the existence of a standby custody designation under chapter 257B.\n(c) In determining the best interests of the child, the court must apply the standards in section 257C.04.\n(a) The court must dismiss a petition for custody if the court finds that:\n(1) the petitioner is not a de facto custodian as set forth in section 257C.01, subdivision 2;\n(2) the petitioner does not establish at least one of the factors in subdivision 7, paragraph (a); or\n(3) placement of the child with the petitioner is not in the best interests of the child.\n(b) If the court finds that a party cannot establish factors for visitation under section 257C.08, the court must dismiss a petition for visitation.",
	"repealed": false
}