{
	"id": "322C.1204",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.1204",
	"title": "322C.1204 APPLICATION TO EXISTING RELATIONSHIPS.",
	"text": "(a) On or after August 1, 2015, a limited liability company may not be formed under chapter 322B.\n(b) Before January 1, 2018, this chapter governs only:\n(1) a limited liability company formed on or after August 1, 2015; and\n(2) except as otherwise provided in subdivision 3, a limited liability company formed before August 1, 2015, which elects, in the manner provided in its operating agreement or bylaw for amending the operating agreement, to be subject to this chapter.\nExcept as otherwise provided in subdivision 3, on and after January 1, 2018, this chapter governs all limited liability companies.\nFor the purposes of applying this chapter to a limited liability company formed before August 1, 2015:\n(1) the limited liability company's articles of organization under chapter 322B at the time the limited liability company becomes subject to this chapter are deemed to be the limited liability company's articles of organization;\n(2) for the purposes of applying section 322C.0102, subdivision 17, and subject to section 322C.0112, subdivision 4, the language in the articles of organization, and any bylaws, operating agreement, or member control agreement of a limited liability company formed before August 1, 2015, that becomes subject to this chapter will operate as if that language were in the operating agreement of the limited liability company when it becomes subject to this chapter; and\n(3) subject to the operating agreement of the limited liability company:\n(i) the limited liability company shall keep the records specified in section 322B.373, subdivision 1, clause (11), at the company's principal executive office, or at another place or places within the United States as determined under section 322B.373, subdivision 1, before the company became subject to this chapter;\n(ii) for the purpose of applying item (i), section 322B.40, subdivisions 3 and 4, continue to apply to the limited liability company as if those provisions had not been repealed;\n(iii) section 322C.0404, subdivision 1, does not apply to the limited liability company;\n(iv) the profits and losses of the limited liability company are to be allocated among the members, and among classes and series of members, in proportion to the value of the contributions of the members reflected in the records required by item (i);\n(v) the voting power of each membership interest is in proportion to the value of the contributions of the members reflected in the records required by item (i);\n(vi) distributions of cash or other assets of the company, including distributions on termination of the limited liability company, must be allocated in proportion to the value of the contributions of the members reflected in the records required by item (i);\n(vii) sections 322B.383, subdivisions 1, clause (1), 2, and 3, and 322B.386 continue to apply to the limited liability company as if those provisions had not been repealed; and\n(viii) for the purpose of applying item (vii), section 322B.356, subdivision 1, continues to apply to the limited liability company as if that provision had not been repealed.",
	"repealed": false
}