{
	"id": "484.841",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.841",
	"title": "484.841 DISPOSITION OF FINES, FEES, AND OTHER MONEY; ACCOUNTS; HENNEPIN COUNTY DISTRICT COURT.",
	"text": "(a) Except as otherwise provided within this subdivision, and except as otherwise provided by law, the court administrator shall pay all fines and penalties collected by the court administrator, all fees collected by the court administrator for court administrator's services, all sums forfeited to the court as provided in this subdivision, and all other money received by the court administrator to the subdivision of government entitled to it as follows on or before the 20th day after the last day of the month in which the money was collected. Eighty percent of all fines and penalties collected during the previous month shall be paid to the treasurer of the municipality or subdivision of government where the crime was committed. The remainder of the fines and penalties shall be credited to the general fund of the state. In all cases in which the county attorney had charge of the prosecution, all fines and penalties shall be credited to the state general fund.\n(b) The court administrator shall identify the name of the municipality or other subdivision of government where the offense was committed and the total amount of fines or penalties collected for each municipality or other subdivision of government, for the county, or for the state.\n(c) Amounts represented by checks issued by the court administrator or received by the court administrator which have not cleared by the end of the month may be shown on the monthly account as having been paid or received, subject to adjustment on later monthly accounts.\n(d) The court administrator may receive negotiable instruments in payment of fines, penalties, fees or other obligations as conditional payments, and is not held accountable for this until collection in cash is made and then only to the extent of the net collection after deduction of the necessary expense of collection.\n(a) The civil fees payable to the administrator for services are the same in amount as the fees then payable to the District Court of Hennepin County for like services. Library and filing fees are not required of the defendant in an eviction action. The fees payable to the administrator for all other services of the administrator or the court shall be fixed by rules promulgated by a majority of the judges.\n(b) Fees are payable to the administrator in advance.\n(c) Judgments will be entered only upon written application.",
	"repealed": false
}