{
	"id": "473.129",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.129",
	"title": "473.129 POWERS OF METROPOLITAN COUNCIL.",
	"text": "The Metropolitan Council shall have and exercise all powers which may be necessary or convenient to enable it to perform and carry out the duties and responsibilities now existing or which may hereafter be imposed upon it by law. Such powers include the specific powers enumerated in this section.\nThe Metropolitan Council shall prescribe all terms and conditions for the employment of its employees including, but not limited to, adopting a compensation and classification plan for its employees. Employees of the Metropolitan Council are public employees and are members of the Minnesota State Retirement System. Those employed by a predecessor of the Metropolitan Council and transferred to it may at their option become members of the Minnesota State Retirement System or may continue as members of the public retirement association to which they belonged as employees of the predecessor of the Metropolitan Council. The Metropolitan Council shall make the employer's contributions to pension funds of its employees.\nThe Metropolitan Council may contract for the services of consultants who perform engineering, legal, or services of a professional nature. Such contracts shall not be subject to the requirements of any law relating to public bidding.\nThe Metropolitan Council may accept gifts, apply for and use grants or loans of money or other property from the United States, the state, or any person for any Metropolitan Council purpose and may enter into agreements required in connection therewith and may hold, use, and dispose of such moneys or property in accordance with the terms of the gift, grant, loan, or agreement relating thereto.\nThe Metropolitan Council may (1) participate as a party in any proceedings originating under chapter 414, if the proceedings involve the change in a boundary of a governmental unit in the metropolitan area, and (2) conduct studies of the feasibility of annexing, enlarging, or consolidating units in the metropolitan area.\nThe Metropolitan Council shall appoint from its membership a member to serve with each metropolitan agency. Each member of the Metropolitan Council so appointed on each of such agencies shall serve without a vote.\nThe council may acquire, own, hold, use, improve, operate, maintain, lease, exchange, transfer, sell, or otherwise dispose of personal or real property, franchises, easements, or property rights or interests of any kind.\nThe council may provide for self-insurance or otherwise provide for insurance relating to any of its property, rights, or revenue, workers' compensation, public liability, or any other risk or hazard arising from its activities, and may provide for insuring any of its officers or employees against the risk or hazard at the expense of the council. If the council provides for self-insurance, against its liability and the liability of its officers, employees, and agents for damages resulting from its torts and those of its officers, employees, and agents, including its obligation to pay basic economic loss benefits under sections 65B.41 to 65B.71, it shall be entitled to deduct from damages and basic economic loss benefits all money paid or payable to the persons seeking damages and benefits from all governmental entities providing medical, hospital, and disability benefits except for payments made under the Minnesota family investment program or medical assistance program.\nWhen necessary and proper to the performance of its duties, the council may enter in a reasonable manner upon any premises for the purpose of making any reasonably necessary or proper investigations and examinations. The entry is not a trespass. The council is liable for any actual and consequential loss, injury, or damage from the entry. When necessary and proper to the performance of its duties, the council or its authorized agents may require the production of accounts, books, records, memoranda, correspondence, and other documents and papers of a person receiving financial assistance from the council, may inspect and copy them, and may have access to and may inspect the lands, buildings, facilities, or equipment of the person.\nThe council may provide a program for health and wellness services for council employees and provide necessary staff, funds, equipment, and facilities.\nFor purposes of this subdivision, \"service capacity\" means an existing service or operation carried out by the council as authorized by law, or existing council real or personal property, for which the council on a temporary basis has capacity available for use outside the council. Notwithstanding other law, the council may enter into arrangements to provide service capacity to other governmental entities or the private sector on the terms and conditions it considers appropriate. In providing service capacity, the council:\n(1) may not commit to providing the service capacity for a period in excess of five years; and\n(2) must receive compensation for providing the service capacity in at least an amount sufficient to recover the actual costs of providing the service capacity including, but not limited to, the costs of materials and supplies, employee salaries and benefits, and administrative overhead.\n(a) Notwithstanding the provisions of section 471.345, the council may award a contract for the purchase of transit vehicles to the vendor or contractor offering the best value under a request for proposals. For the purposes of this subdivision, \"transit vehicles\" means buses and coaches, commuter rail locomotives and coach cars, light rail vehicles, and paratransit vehicles that are used to provide transit and special transportation service pursuant to sections 473.371 to 473.449.\n(b) For the purposes of this subdivision, \"best value\" describes a result intended in the acquisition of goods and services described in paragraph (a). Price must be one of the evaluation criteria. Other evaluation criteria may include, but are not limited to, environmental considerations, quality, and vendor or contractor performance. The evaluation criteria must be included in the solicitation document as well as the relative importance of price and other factors.",
	"repealed": false
}