{
	"id": "462A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.10",
	"title": "462A.10 BONDS AND NOTES; OPTIONAL RESOLUTION AND CONTRACT PROVISIONS.",
	"text": "Any resolution authorizing any notes or bonds or any issue thereof may contain provisions, which shall be a part of the contract with the holders thereof, as to the matters referred to in this section.\nIt may pledge or create a lien on all or any part of the moneys or property of the agency and any moneys held in trust or otherwise by others to secure the payment of the notes or bonds or of any issue thereof, subject to such agreements with bondholders or noteholders as may then exist.\nIt may provide for the custody, collection, securing, investment, and payment of any moneys of the agency.\nIt may set aside reserves or sinking funds and provide for the regulation and disposition thereof and may create other special funds into which any moneys of the agency may be deposited.\nIt may limit the loans and securities to which the proceeds of sale of notes or bonds may be applied and may pledge repayments thereon to secure the payment of the notes or bonds or of any issue thereof.\nIt may limit the issuance of additional notes or bonds, the terms upon which additional notes or bonds may be issued and secured, and the refunding of outstanding or other notes or bonds.\nIt may prescribe the procedure, if any, by which the terms of any contract with noteholders or bondholders may be amended or abrogated, the amount of notes or bonds the holders of which must consent thereto, and the manner in which such consent may be given.\nIt may vest in a trustee or trustees such property, rights, powers and duties in trust as the agency may determine, which may include any or all of the rights, powers and duties of the bondholders, or may limit the rights, powers and duties of such trustee.\nIt may define the acts or omissions to act which shall constitute a default in the obligations and duties of the agency and may provide for the rights and remedies of the holders of bonds or notes in the event of such default, and provide any other matters of like or different character, consistent with the general laws of the state and other provisions of this chapter, which in any way affect the security or protection of the notes or bonds and the rights of the holders thereof.\nIt may provide that the agency may defer the issuance and delivery of the bonds to the underwriters to a designated future date when the proceeds of the bonds are required for one or more of the purposes specified in section 462A.08.",
	"repealed": false
}