{
	"id": "103B.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.521",
	"title": "103B.521 INITIATION BY PETITION AND ESTABLISHMENT BY COUNTY BOARD.",
	"text": "(a) A lake improvement district may be initiated by a petition to the county board. The petition must state:\n(1) the name of the proposed lake improvement district;\n(2) the necessity of the proposed district to promote public health or public welfare;\n(3) the benefits to property from the establishment of the lake improvement district;\n(4) the boundaries of the proposed district which shall be encouraged to be as consistent as possible with natural hydrologic boundaries;\n(5) a map of the proposed district;\n(6) the number, from five to nine, of directors proposed for the district; and\n(7) a request for establishing the district as proposed.\n(b) A petition must be signed by a majority of the property owners within the proposed lake improvement district described in the petition. Governmental subdivisions, other than the state or federal governments, owning lands within the proposed district are eligible to sign the petition.\n(c) The petition must be filed with the county auditor and addressed to the board, requesting the board to establish a lake improvement district to develop and provide a program of water and related land resources management.\n(d) The county board shall, at least 30 days before it acts on a petition, send the town board of a town wholly or partially within the boundaries of a proposed district a copy of the petition submitted under this subdivision and encourage the town board to respond to the proposed creation of the district.\nAfter receiving the petition, the county auditor must verify the signatures and notify the county board. Within 30 days after being notified of the petition, the county board must hold a public hearing on whether the requested lake improvement district should be established.\nWithin 30 days after holding the public hearing, the county board shall, by order, establish or deny the establishment of the petitioned lake improvement district. An order establishing a district must conform to section 103B.535 and may modify the petition relating to the district's boundaries, functions, financing, or organization.",
	"repealed": false
}