{
	"id": "387.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/387.20",
	"title": "387.20 SALARIES, FEES, BUDGETS; APPEALS.",
	"text": "(a) In addition to the sheriff's salary, the sheriff shall be reimbursed for all expenses incurred in the performance of official duties for the sheriff's county and the claim for the expenses shall be prepared, allowed, and paid in the same manner as other claims against counties are prepared, allowed, and paid except that the expenses incurred by the sheriffs in the performance of service required of them in connection with persons with a mental illness either by a district court or by law and a per diem for deputies and assistants necessarily required under the performance of the services shall be allowed and paid as provided by the law regulating the apprehension, examination, and commitment of persons with a mental illness; provided that any sheriff or deputy receiving an annual salary shall pay over any per diem received to the county in the manner and at the time prescribed by the county board, but not less often than once each month.\n(b) All claims for livery hire shall state the purpose for which such livery was used and have attached thereto a receipt for the amount paid for such livery signed by the person of whom it was hired.\n(c) A county may pay a sheriff or deputy as compensation for the use of a personal automobile in the performance of official duties a mileage allowance prescribed by the county board or a monthly or other periodic allowance in lieu of mileage. The allowance for automobile use is not subject to limits set by other law.\n(a) The county board of each of the counties of less than 75,000 population annually shall set by resolution the salary of the county sheriff which shall be paid to the county sheriff at such intervals as the board shall determine, but not less often than once each month.\n(b) At the January meeting prior to the first date on which applicants may file for the office of county sheriff the board shall set by resolution the minimum salary to be paid the county sheriff for the term next following.\n(c) In the event a vacancy occurs in the office of county sheriff, the board may set the annual salary for the remainder of the calendar year at an amount less than was set for that year.\n(d) The salary of the county sheriff shall not be reduced during the term for which the sheriff was elected or appointed.\nMS 1974 [Repealed, 1975 c 301 s 16]\nMS 2008 [Repealed, 2009 c 152 s 25]\nThe county sheriff shall charge and collect all fees and per diems prescribed by law and may require such fees and per diems to be paid before performing the services for which they are charged. The sheriff shall pay all such fees and per diems to the county in the manner and at the times prescribed by the county board, but not less often than once each month. The sheriff shall not retain any additional compensation or other emolument for services in any activity of county government. For purposes of this subdivision, (1) the expenses of the sheriff incurred in the performance of official duties for the county, (2) uniform allowances, (3) mileage and travel allowances, except as the board shall have furnished motor vehicles pursuant to Minnesota Statutes 1961, section 387.29, (4) living quarters provided by the county, and (5) payments for boarding prisoners, shall not be deemed an emolument of the office.\nThe county board by resolution shall provide the budget for:\n(1) the salaries of deputies, jailers, matrons, bailiffs, clerks and other employees in the office of the sheriff;\n(2) other expenses necessary in the performance of the duties of said office, including the reimbursement of the sheriff or a designee for necessary and reasonable expenses incurred in furnishing board, laundry and other services to prisoners in the county jail, provided that the county board may at its option provide for the furnishing of these services to the prisoners;\n(3) the payment of premiums of any bonds or license fees required of the sheriff or any deputy or other employee in said office; and\n(4) mileage allowances prescribed by the board and the board is authorized to appropriate funds therefor and for the salary of the sheriff.\nThe sheriff, if dissatisfied with the action of the county board in setting the amount of the sheriff's salary or the amount of the budget for the office of sheriff, may appeal to the district court on the grounds that the determination of the county board in setting such salary or budget was arbitrary, capricious, oppressive or without sufficiently taking into account the extent of the responsibilities and duties of said office, and the sheriff's experience, qualifications, and performance. The appeal shall be taken within 15 days after the date of the resolution setting such salary or budget by serving a notice of appeal on the county auditor and filing same with the court administrator of the district court. The court either in term or vacation and upon ten days' notice to the chair of the board shall hear such appeal. On the hearing of the appeal the court shall review the decision or resolution of the board in a hearing de novo and may hear new or additional evidence, or the court may order the officer appealing and the board to submit briefs or other memoranda and may dispose of the appeal on such writings. If the court shall find that the board acted in an arbitrary, capricious, oppressive or unreasonable manner or without sufficiently taking into account the extent of the responsibilities and duties of the office of the sheriff, the sheriff's experience, qualifications, and performance, it shall make such order to take the place of the order appealed from as is justified by the record and shall remand the matter to the county board for further action consistent with the court's findings. After determination of the appeal the county board shall proceed in conformity therewith.\nThe provisions of subdivisions 1 to 7 shall take effect in the respective counties specified in subdivisions 1 to 7 as follows:\n(1) upon the expiration of the term of the incumbent holding the office on July 1, 1965; or\n(2) upon the occurrence prior thereto of a vacancy in the office of county sheriff; or\n(3) subsequent to July 1, 1965, and upon not less than 30 days' written notice by the sheriff, the county board shall make the provisions of subdivisions 1 to 7 effective on the first day of the month following the expiration of the notice period.\nAll laws relating to the salary, fees, and deputies and clerk hire for the county sheriff inconsistent herewith are superseded.",
	"repealed": false
}