{
	"id": "115B.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.171",
	"title": "115B.171 TESTING FOR PRIVATE WELLS; EAST METROPOLITAN AREA.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"East metropolitan area\" means:\n(1) the cities of Afton, Cottage Grove, Lake Elmo, Maplewood, Newport, Oakdale, St. Paul Park, and Woodbury;\n(2) the townships of Denmark, Grey Cloud Island, and West Lakeland; and\n(3) other areas added by the commissioner that have a potential for significant groundwater pollution from PFCs.\n(c) \"PFCs\" means per- and poly-fluorinated chemicals.\nTo provide results of PFC groundwater monitoring to the public, the commissioner of the Pollution Control Agency must develop a web page that may include, but is not limited to, the following:\n(1) the process for private and public well PFC sampling in the east metropolitan area;\n(2) an interactive map system that allows the public to view locations of the Department of Health well advisories and areas projected to be sampled for PFCs; and\n(3) how to contact the Pollution Control Agency or Department of Health staff to answer questions on sampling of private wells.\n(a) By March 15 each year, the commissioner of the Pollution Control Agency must report to each community in the east metropolitan area a summary of the results of the testing for private wells in the community. The report must include information on the number of wells tested and trends of PFC contamination in private wells in the community. Reports to communities under this section must also be published on the Pollution Control Agency's website.\n(b) By March 15 each year, the commissioner of the Pollution Control Agency must report to the legislature, as provided in section 3.195, on the testing for private wells conducted in the east metropolitan area, including copies of the community reports required in paragraph (a), the number of requests for well testing in each community, and the total amount spent for testing private wells in each community.",
	"repealed": false
}