{
	"id": "565.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/565.24",
	"title": "565.24 RECOVERY OF POSSESSION PRIOR TO NOTICE AND HEARING.",
	"text": "A claimant seeking to recover possession of property prior to notice and hearing as provided in section 565.23 shall proceed by motion seeking such relief. The motion shall be accompanied by an affidavit setting forth:\n(1) the information required by section 565.23, subdivision 1;\n(2) the facts establishing grounds for a prehearing seizure, as specified in subdivision 2.\nThe court may order seizure of the property from the respondent prior to a hearing only if it makes specific findings, based upon competent evidence in the form of affidavit or oral testimony, that:\n(1) a good faith effort has been made to inform respondent of the motion for a prehearing seizure or that so informing respondent would endanger the ability of the claimant to recover the property;\n(2) claimant has demonstrated the probability of success on the merits entitling the claimant to possession of the property; and\n(3)(i) respondent is about to remove the property in question from the state with the intent to hinder, delay or defraud the claimant;\n(ii) respondent is about to conceal, damage or dispose of the property with intent to hinder, delay or defraud the claimant; or\n(iii) due to other circumstances, which must be specified in the court's order, the claimant will suffer irreparable harm if possession of the property is not obtained prior to a hearing; and\n(4) claimant's interest in the property cannot be protected, pending a hearing pursuant to section 565.23 by an appropriate order of the court other than directing seizure.\nIf the court makes the findings required by subdivision 2, clauses (1), (2), and (3), but does not direct seizure, it may issue an appropriate order protecting the claimant's interest in the property pending a hearing pursuant to section 565.23.\nIf the court issues an order pursuant to subdivisions 2 or 3, the order shall establish a date for a hearing at which respondent may be heard and which shall be conducted at the earliest practicable time and shall take precedence over all matters except older matters of the same character.\nThe hearing held pursuant to subdivision 4 shall be conducted in accordance with the criteria established in section 565.23, subdivisions 3, 4 and 5. In addition, if the court finds that the motion for a prehearing seizure was made in bad faith the court may, in its discretion, award respondent the actual damages incurred by reason of seizure of the property.\nThe respondent shall be served with a copy of the order issued pursuant to this section together with a copy of all pleadings and supporting documents and a notice of hearing. Service shall be in the manner prescribed for personal service of a summons or the court in its discretion may prescribe alternative methods of service calculated to provide actual notice to respondent.\nThe notice of hearing served upon the respondent shall be signed by claimant or the attorney for claimant and shall provide, at a minimum, the following information in substantially the following language:\n\"NOTICE OF HEARING\nCourt action has been taken which affects the following property:\n[list property]\n[Claimant] (hereinafter \"claimant\") has claimed that claimant is entitled to this property and that claimant's interest in this property would have been harmed unless this court took immediate action.\nYou have a right to challenge claimant's claims at a hearing before a judge. This hearing has been scheduled for the ........ day of ..........., .........., at .......... o'clock ..M., at [place] ...........................\nAfter this hearing the judge will decide, what should be done with the property pending a final decision on claimant's claim.\"",
	"repealed": false
}