{
	"id": "256B.198",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.198",
	"title": "256B.198 PAYMENTS FOR NON-HOSPITAL-BASED GOVERNMENTAL HEALTH CENTERS.",
	"text": "(a) The commissioner may make payments to non-hospital-based health centers operated by a governmental entity for the difference between the expenditures incurred by the health center for patients eligible for medical assistance, and the payments to the health center for medical assistance permitted elsewhere under this chapter.\n(b) The nonfederal share of payments authorized under paragraph (a) shall be provided through certified public expenditures authorized under section 256B.199, paragraph (b).\n(c) Effective July 1, 2013, or no earlier than 12 months after implementation of a total cost of care demonstration project, Hennepin County may receive federal matching funds for certified public expenditures under paragraph (a), if the county participates in a total cost of care demonstration project under sections 256B.0755 and 256B.0756, or another total cost of care demonstration project approved by the commissioner, and the county exceeds the minimum performance threshold established by the commissioner for the demonstration project. The value of the federal matching funds for the certified public expenditures allocated to Hennepin County shall be equal to the value of savings achieved above the minimum performance threshold. The same proportion of federal matching funds for certified public expenditure allocated to Hennepin County based on savings achieved under the demonstration project shall continue after the demonstration project and must continue to be paid to Hennepin County each year thereafter.\n(d) Beginning July 1, 2014, or no earlier than 12 months after the initial allocation under paragraph (c) if a portion of the federal matching funds for certified public expenditure remains with the state, the commissioner shall annually determine if the savings from county's total cost of care demonstration project exceeded the savings from the previous year and allocate federal matching funds for certified public expenditures to Hennepin County equal to the amount of savings achieved above the amount achieved in the previous year. The proportion of federal matching funds for certified public expenditure allocated to Hennepin County shall be paid to Hennepin County each year thereafter, until no federal matching funds for certified public expenditures under paragraph (a) remain with the state.\n(e) Nothing under this section precludes Hennepin County from receiving an additional gain-sharing payment or relieves the county from paying a downside risk-sharing payment to the state under the demonstration project under section 256B.0755.",
	"repealed": false
}