{
	"id": "626.8516",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8516",
	"title": "626.8516 INTENSIVE COMPREHENSIVE PEACE OFFICER EDUCATION TRAINING PROGRAM.",
	"text": "A program is established within the Department of Public Safety to fund the intensive comprehensive law enforcement education and training of two- and four-year college graduates. The program shall be known as the intensive comprehensive peace officer education and training program.\nThe program is intended to address the critical shortage of peace officers in the state. The program shall provide a grant to law enforcement agencies that have developed a plan to recruit, educate, and train highly qualified two- and four-year college graduates to become license-eligible peace officers in the state.\n(a) The chief law enforcement officer of a law enforcement agency may apply to the commissioner for a grant for the cost of educating, training, and paying an eligible peace officer candidate until the candidate is licensed by the board as a peace officer.\n(b) The commissioner must consider all eligible expenses proposed by the chief law enforcement officer in order to issue a grant to the agency for the actual cost of educating, training, and paying an eligible candidate up to $50,000.\n(c) The commissioner shall consider geographic diversity in grant distribution based on grant applications received.\nThe commissioner must prepare the necessary grant application forms and make the forms available on the agency's public website no later than December 31, 2023.\nNo later than December 31, 2023, the commissioner, in consultation with the executive director of the board and the institutions designated as education providers under subdivision 6, shall develop an intensive comprehensive law enforcement education and skills training curriculum that will provide eligible peace officer candidates with the law enforcement education and skills training needed to be licensed as a peace officer. The curriculum must be designed to be completed in eight months or less and shall be offered at the institutions designated under subdivision 6. The curriculum may overlap, coincide with, or draw upon existing law enforcement education and training programs at institutions designated as education providers under subdivision 6. The executive director of the board may designate existing law enforcement education and training programs that are designed to be completed in eight months or less as intensive comprehensive law enforcement education and skills training programs for the purposes of this section.\n(a) No later than October 1, 2023, the Board of Trustees of the Minnesota State Colleges and Universities shall designate at least two regionally diverse system campuses to provide the required intensive comprehensive law enforcement education and skills training to eligible peace officer candidates.\n(b) In addition to the campuses designated under paragraph (a), the commissioner may designate private, nonprofit postsecondary institutions to provide the required intensive comprehensive law enforcement education and skills training to eligible peace officer candidates.\n(c) Effective July 1, 2025, the Board of Regents of the University of Minnesota may request that the commissioner designate one or more campuses to provide intensive comprehensive law enforcement education and skills training to eligible peace officer candidates. Upon such a request, the commissioner may designate at least one of the requested campuses.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of public safety.\n(c) \"Eligible peace officer candidate\" means a person who:\n(1) has met all of the hiring requirements to become a peace officer in the state, except for (i) completing a professional peace officer education program, and (ii) passing the licensing exam; and\n(2) a chief law enforcement officer has agreed to hire upon completing the training required under this chapter and passing the licensing exam.\n(d) \"Law enforcement agency\" has the meaning given in section 626.84, subdivision 1, paragraph (f), clause (1).\n(e) \"Program\" means the intensive comprehensive peace officer education and training program.",
	"repealed": false
}