{
	"id": "142G.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.05",
	"title": "142G.05 APPLYING FOR ASSISTANCE.",
	"text": "To apply for assistance a person must submit a signed application to the county agency in the county where that person lives.\nWhen a person inquires about assistance, a county agency must:\n(1) explain the eligibility requirements of, and how to apply for any assistance for which the person may be eligible; and\n(2) offer the person brochures developed or approved by the commissioner that describe how to apply for assistance.\n(a) A county agency must offer, in person or by mail, the application forms prescribed by the commissioner as soon as a person makes a written or oral inquiry. At that time, the county agency must:\n(1) inform the person that assistance begins on the date of application or on the date that all eligibility criteria are met, whichever is later;\n(2) inform a person that the person may submit the application by telephone or through Internet telepresence;\n(3) inform a person of the application submission requirements in section 256P.04, subdivision 1a;\n(4) inform the person that any delay in submitting the application will reduce the amount of assistance paid for the month of application;\n(5) inform a person that the person may submit the application before an interview;\n(6) explain the information that will be verified during the application process by the county agency as provided in section 142G.10, subdivision 2;\n(7) inform a person about the county agency's average application processing time and explain how the application will be processed under subdivision 7;\n(8) explain how to contact the county agency if a person's application information changes and how to withdraw the application;\n(9) inform a person that the next step in the application process is an interview and what a person must do if the application is approved including, but not limited to, attending orientation under section 142G.27 and complying with employment and training services requirements in sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71;\n(10) inform the person that an interview must be conducted. The interview may be conducted face-to-face in the county office or at a location mutually agreed upon, through Internet telepresence, or by telephone;\n(11) explain the child care and transportation services that are available under paragraph (c) to enable caregivers to attend the interview, screening, and orientation; and\n(12) identify any language barriers and arrange for translation assistance during appointments, including, but not limited to, screening under subdivision 4, orientation under section 142G.27, and assessment under section 142G.56.\n(b) Upon receipt of a signed application, the county agency must stamp the date of receipt on the face of the application. The county agency must process the application within the time period required under subdivision 7. An applicant may withdraw the application at any time by giving written or oral notice to the county agency. The county agency must issue a written notice confirming the withdrawal. The notice must inform the applicant of the county agency's understanding that the applicant has withdrawn the application and no longer wants to pursue it. When, within ten days of the date of the agency's notice, an applicant informs a county agency, in writing, that the applicant does not wish to withdraw the application, the county agency must reinstate the application and finish processing the application.\n(c) Upon a participant's request, the county agency must arrange for transportation and child care or reimburse the participant for transportation and child care expenses necessary to enable participants to attend the screening under subdivision 4 and orientation under section 142G.27.\nThe county agency, or at county option, the county's employment and training service provider as defined in section 142G.50, must screen each applicant to determine immediate needs and to determine if the applicant may be eligible for another program that is not partially funded through the federal temporary assistance to needy families block grant under Title I of Public Law 104-193, including the expedited issuance of the Supplemental Nutrition Assistance Program (SNAP) benefits under section 142G.19, subdivision 1. If the applicant appears eligible for another program, including any program funded by the MFIP consolidated fund, the county must make a referral to the appropriate program.\nIf the applicant is not diverted from applying for MFIP, and if the applicant meets the MFIP eligibility requirements, then a county agency must:\n(1) identify an applicant who is under the age of 20 without a high school diploma or its equivalent and explain to the applicant the assessment procedures and employment plan requirements under section 142G.57;\n(2) explain to the applicant the eligibility criteria in section 142G.53 for the family violence waiver, and what an applicant should do to develop an employment plan;\n(3) explain that the activities and hourly requirements of the employment plan may be adjusted to accommodate the personal and family circumstances of applicants who meet the criteria in section 142G.52, subdivision 1, paragraph (d), explain how a person should report to the county agency any status changes, and explain that an applicant who is not required to participate in employment services under section 142G.52 may volunteer to participate in employment and training services;\n(4) for applicants who are not exempt from the requirement to attend orientation, arrange for an orientation under section 142G.27 and an assessment under section 142G.56;\n(5) inform an applicant who is not exempt from the requirement to attend orientation that failure to attend the orientation is considered an occurrence of noncompliance with program requirements and will result in an imposition of a sanction under section 142G.70; and\n(6) explain how to contact the county agency if an applicant has questions about compliance with program requirements.\nA county agency must verify information provided by an applicant as required in section 142G.10, subdivision 2.\nUpon receiving an application, a county agency must determine the applicant's eligibility, approve or deny the application, inform the applicant of its decision according to the notice provisions in section 142G.21, and, if eligible, issue the assistance payment to the applicant. When a county agency is unable to process an application within 30 days, the county agency must inform the applicant of the reason for the delay in writing. When an applicant establishes the inability to provide required verification within the 30-day processing period, the county agency may not use the expiration of that period as the basis for denial.\nA county agency must not delay a decision on eligibility or delay issuing the assistance payment except to establish state residence as provided in section 142G.12 by:\n(1) treating the 30-day processing period as a waiting period;\n(2) delaying approval or issuance of the assistance payment pending the decision of the county board; or\n(3) awaiting the result of a referral to a county agency in another county when the county receiving the application does not believe it is the county of financial responsibility.\nThe requirements in subdivisions 7 and 8 apply without regard to the length of time that an applicant remains, or intends to remain, a resident of the county in which the application is made. When an applicant leaves the county where application was made but remains in the state, section 142G.78 applies and the county agency may request additional information from the applicant about changes in circumstances related to the move.\nUntil a county agency issues notice of approval or denial, additional applications submitted by an applicant are void. However, an application for monthly assistance or other benefits funded under section 142G.76 and an application for emergency general assistance may exist concurrently. More than one application for monthly assistance or emergency general assistance may exist concurrently when the county agency decisions on one or more earlier applications have been appealed to the commissioner, and the applicant asserts that a change in circumstances has occurred that would allow eligibility. A county agency must require additional application forms or supplemental forms as prescribed by the commissioner when a payee's name changes, or when a caregiver requests the addition of another person to the assistance unit.\n(a) An addendum to an existing application must be used to add persons to an assistance unit regardless of whether the persons being added are required to be in the assistance unit. When a person is added by addendum to an assistance unit, eligibility for that person begins on the first of the month the addendum was filed except as provided in section 142G.26, subdivision 2, clause (1).\n(b) An overpayment must be determined when a change in household composition is not reported within the deadlines in section 142G.20, subdivision 8. Any overpayment must be calculated from the month of the change including the needs, income, and assets of any individual who is required to be included in the assistance unit under section 142G.17, subdivision 2. Individuals not included in the assistance unit who are identified in section 142G.31, subdivisions 1 to 4, must have their income and assets considered when determining the amount of the overpayment.\nWhen an applicant is not eligible for MFIP because the applicant does not meet eligibility requirements, the county agency must determine whether the applicant is eligible for SNAP or health care programs. The county must also inform applicants about resources available through the county or other agencies to meet short-term emergency needs.\n[See Note.]\n(a) The commissioner shall provide a domestic violence informational brochure that provides information about the existence of domestic violence waivers to all MFIP applicants. The brochure must explain that eligible applicants may be temporarily waived from certain program requirements due to domestic violence. The brochure must provide information about services and other programs to help victims of domestic violence.\n(b) The brochure must be funded with TANF funds.\n(c) The commissioner must work with the commissioner of human services to create a brochure that meets the requirements of this section and section 256.029.",
	"repealed": false
}