{
	"id": "237.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.53",
	"title": "237.53 TELECOMMUNICATIONS DEVICES AND INTERCONNECTIVITY PRODUCTS.",
	"text": "A person applying for a telecommunications device or interconnectivity product under this section must apply to the program administrator on a form prescribed by the Department of Human Services.\nTo be eligible to obtain a telecommunications device or interconnectivity product under this section, a person must:\n(1) be able to benefit from and use the equipment for its intended purpose;\n(2) have a communication disability;\n(3) be a resident of the state;\n(4) be a resident in a household that has a median income at or below the applicable median household income in the state, except a person who is deafblind applying for a Braille device may reside in a household that has a median income no more than 150 percent of the applicable median household income in the state; and\n(5) be a resident in a household that has telecommunications service or that has made application for service and has been assigned a telephone number; or a resident in a residential care facility, such as a nursing home or group home where telecommunications service is not included as part of overall service provision.\nAfter a person is determined to be eligible for the program, the commissioner of human services shall assess the person's telecommunications needs to determine (1) the type of telecommunications device that provides the person with functionally equivalent access to telecommunications services, and (2) appropriate interconnectivity products for the person.\nThe commissioner of human services shall (1) purchase a sufficient number of telecommunications devices and interconnectivity products so that each eligible household receives appropriate devices and products as determined under section 237.51, subdivision 5a, and (2) distribute the devices and products to eligible households free of charge.\nThe commissioner of human services shall maintain the telecommunications devices and interconnectivity products until the warranty period expires, and provide training, without charge, to first-time users of the devices and products. The commissioner shall provide information about assistive communications devices and products that may benefit a program participant and about where a person may obtain or purchase assistive communications devices and products. Assistive communications devices and products include a pocket talker for a person who is hard-of-hearing, a communication board for a person with a speech disability, a one-to-one video communication application for a person who is deaf, and other devices and products designed to facilitate effective communication for a person with a communication disability.\n[Repealed by amendment, 2012 c 216 art 10 s 4]\nTelecommunications devices and interconnectivity products purchased pursuant to subdivision 3, clause (1), are the property of the state of Minnesota. Policies and procedures for the return of distributed devices and products shall be determined by the commissioner of human services.\nThe telecommunications devices distributed under this section must comply with the electronic industries alliance standards and be approved by the Federal Communications Commission. The commissioner of human services must provide each eligible person a choice of several models of devices, the retail value of which may not exceed $600 for a text telephone, and a retail value of $7,000 for a Braille device, or an amount authorized by the Department of Human Services for all other telecommunications devices, auxiliary equipment, and interconnectivity products it deems cost-effective and appropriate to distribute according to sections 237.51 to 237.56.\n[Repealed, 1988 c 621 s 19]\nThe commissioner of human services shall assist a person who is applying for telecommunication devices and products in applying for discounted telecommunications or Internet services.",
	"repealed": false
}