{
	"id": "62Q.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.19",
	"title": "62Q.19 ESSENTIAL COMMUNITY PROVIDERS.",
	"text": "(a) The commissioner shall designate essential community providers. The criteria for essential community provider designation shall be the following:\n(1) a demonstrated ability to integrate applicable supportive and stabilizing services with medical care for uninsured persons and high-risk and special needs populations, underserved, and other special needs populations; and\n(2) a commitment to serve low-income and underserved populations by meeting the following requirements:\n(i) has nonprofit status in accordance with chapter 317A;\n(ii) has tax-exempt status in accordance with the Internal Revenue Service Code, section 501(c)(3);\n(iii) charges for services on a sliding fee schedule based on current poverty income guidelines; and\n(iv) does not restrict access or services because of a client's financial limitation;\n(3) status as a local government unit as defined in section 62D.02, subdivision 11, a hospital district created or reorganized under sections 447.31 to 447.37, an Indian Tribal government, an Indian health service unit, or a community health board as defined in chapter 145A;\n(4) a former state hospital that specializes in the treatment of cerebral palsy, spina bifida, epilepsy, closed head injuries, specialized orthopedic problems, and other disabling conditions;\n(5) a sole community hospital. For these rural hospitals, the essential community provider designation applies to all health services provided, including both inpatient and outpatient services. For purposes of this section, \"sole community hospital\" means a rural hospital that:\n(i) is eligible to be classified as a sole community hospital according to Code of Federal Regulations, title 42, section 412.92, or is located in a community with a population of less than 5,000 and located more than 25 miles from a like hospital currently providing acute short-term services;\n(ii) has experienced net operating income losses in two of the previous three most recent consecutive hospital fiscal years for which audited financial information is available; and\n(iii) consists of 40 or fewer licensed beds;\n(6) a birth center licensed under section 144.615;\n(7) a hospital and affiliated specialty clinics that predominantly serve patients who are under 21 years of age and meet the following criteria:\n(i) provide intensive specialty pediatric services that are routinely provided in fewer than five hospitals in the state; and\n(ii) serve children from at least one-half of the counties in the state; or\n(8) a psychiatric residential treatment facility, as defined in section 256B.0625, subdivision 45a, paragraph (b), that is certified by the commissioner of health and licensed by the commissioner of human services.\n(b) Prior to designation, the commissioner shall publish the names of all applicants in the State Register. The public shall have 30 days from the date of publication to submit written comments to the commissioner on the application. No designation shall be made by the commissioner until the 30-day period has expired.\n(c) The commissioner may designate an eligible provider as an essential community provider for all the services offered by that provider or for specific services designated by the commissioner.\n(d) For the purpose of this subdivision, supportive and stabilizing services include at a minimum, transportation, child care, cultural, and linguistic services where appropriate.\n(a) Any provider may apply to the commissioner for designation as an essential community provider by submitting an application form developed by the commissioner.\n(b) Each application submitted must be accompanied by an application fee of $60. The fee shall be no more than what is needed to cover the administrative costs of processing the application.\n(c) The name, address, contact person, and the date by which the commissioner's decision is expected to be made shall be classified as public data under section 13.41. All other information contained in the application form shall be classified as private data under section 13.41 until the application has been approved, approved as modified, or denied by the commissioner. Once the decision has been made, all information shall be classified as public data unless the applicant designates and the commissioner determines that the information contains trade secret information.\nFor purposes of this section, \"health plan company\" does not include a health plan company as defined in section 62Q.01 with fewer than 50,000 enrollees, all of whose enrollees are covered under medical assistance or MinnesotaCare.\nA health plan company must offer a provider contract to all designated essential community providers located within the area served by the health plan company. A health plan company must include all essential community providers that have accepted a contract in each of the company's provider networks. A health plan company shall not restrict enrollee access to services designated to be provided by the essential community provider for the population that the essential community provider is certified to serve. A health plan company may also make other providers available for these services. A health plan company may require an essential community provider to meet all data requirements, utilization review, and quality assurance requirements on the same basis as other health plan providers.\nEssential community providers must agree to serve enrollees of all health plan companies operating in the area in which the essential community provider is located.\nAn essential community provider and a health plan company may negotiate the payment rate for covered services provided by the essential community provider. This rate must be at least the same rate per unit of service as is paid by the health plan company to the essential community provider under the provider contract between the two with the highest number of enrollees receiving health care services from the provider or, if there is no provider contract between the health plan company and the essential community provider, the rate must be at least the same rate per unit of service as is paid to other plan providers for the same or similar services. The provider contract used to set the rate under this subdivision must be in relation to an individual, small group, or large group health plan. This subdivision applies only to provider contracts in relation to individual, small employer, and large group health plans.\nAn essential community provider and a health plan company may negotiate the payment rate for covered services provided by the essential community provider. This rate must be at least the same rate per unit of service as is paid to other health plan providers for the same or similar services. This subdivision applies only to provider contracts in relation to health plans offered through the State Employee Group Insurance Program, medical assistance, and MinnesotaCare.\nEach health plan company and essential community provider shall cooperate to facilitate the use of the essential community provider by the high risk and special needs populations. This includes cooperation on the submission and processing of claims, sharing of all pertinent records and data, including performance indicators and specific outcomes data, and the use of all dispute resolution methods.\nFor any violation of this section or any rule applicable to an essential community provider, the commissioner may suspend, modify, or revoke an essential community provider designation. The commissioner may also use the enforcement authority specified in section 62D.17.\nThe designation as an essential community provider shall be valid for a five-year period from the date of designation. Every five years after the designation or renewal of the designation of essential community provider is granted to a provider, the commissioner shall review the need for and appropriateness of continuing the designation for that provider. The commissioner may require a provider whose designation is to be reviewed to submit an application to the commissioner for renewal of the designation and may require an application fee of $60 to be submitted with the application to cover the administrative costs of processing the application. Based on that review, the commissioner may renew a provider's essential community provider designation for an additional five-year period or terminate the designation. Once the designation terminates, the former essential community provider has no rights or privileges beyond those of any other health care provider.\nBy January 1, 1996, the commissioner shall adopt rules for establishing essential community providers and for governing their relationship with health plan companies. The commissioner shall also identify and address any conflict of interest issues regarding essential community provider designation for local governments. The rules shall require health plan companies to comply with all provisions of section 62Q.14 with respect to enrollee use of essential community providers.",
	"repealed": false
}