{
	"id": "123B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.07",
	"title": "123B.07 MISSING CHILDREN; VOLUNTARY FINGERPRINTING.",
	"text": "For purposes of this section:\n(a) \"child\" means a person under 18 years old; and\n(b) \"missing child\" means a child who has run away or is otherwise missing from the home or the care, custody, and control of the child's parents, guardian, legal custodian, or other person having responsibility for the child.\nEach district may develop a fingerprinting program for pupils and children who reside in the district. The principal or chief administrative officer of a nonpublic school may develop a fingerprinting program for pupils of the school. If developed, the program must be developed in conjunction with law enforcement agencies having jurisdiction within the district or the place where the nonpublic school is located. The law enforcement agencies must cooperate fully with the district or the nonpublic school in the development of its fingerprinting program.\nIf developed, the fingerprinting program may be developed only for the purpose of assisting in the location and identification of missing children, and must be operated according to the following procedures:\n(a) No child may be required to participate in the program.\n(b) Before a child may participate in the program, the child's parents, guardian, legal custodian, or other person responsible for the child must authorize the child's participation by signing a form developed by the district or the principal or chief administrative officer of the nonpublic school.\n(c) Fingerprinting of children must be done by law enforcement personnel on fingerprint cards provided to the district or nonpublic school by the commissioner of public safety or on fingerprint cards acquired elsewhere.\n(d) The school must give the fingerprint card to the child's parents, guardian, legal custodian, or other person responsible for the child. No copy of the fingerprint card may be retained by the law enforcement agency, school, or district.\n(e) The child's name, sex, hair and eye color, height, weight, and date and place of birth must be written on the fingerprint card.\nDistricts and nonpublic schools that develop fingerprinting programs under this section shall offer them on a periodic basis, and shall notify parents, guardians, legal custodians, and residents of the district or communities served by the school of the program and its purpose. Notification may be made by means of memoranda, letters, newspaper articles, or other reasonable means.\nFingerprints of a child obtained pursuant to this section are inadmissible as evidence against the child in any criminal or juvenile court proceeding.\nThis section does not apply to fingerprinting programs for children that are provided by private organizations other than nonpublic schools, or governmental entities other than districts.",
	"repealed": false
}