{
	"id": "609.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.49",
	"title": "609.49 RELEASE, FAILURE TO APPEAR.",
	"text": "(a) A person charged with or convicted of a felony and released from custody, with or without bail or recognizance, who intentionally fails to appear when required after having been notified that a failure to appear for a court appearance is a criminal offense, or after having been released on an order or condition that the releasee personally appear when required with respect to the charge or conviction, is guilty of a crime for failure to appear and may be sentenced to not more than one-half of the maximum term of imprisonment or fine, or both, provided for the underlying crime for which the person failed to appear, but this maximum sentence shall, in no case, be less than a term of imprisonment of one year and one day or a fine of $1,500, or both.\n(b) A felony charge under this subdivision may be filed upon the person's nonappearance. However, the charge must be dismissed if the person who fails to appear voluntarily surrenders within 48 hours after the time required for appearance. This paragraph does not apply if the offender appears as a result of being apprehended by law enforcement authorities.\n(a) A person who intentionally fails to appear for a juvenile court disposition is guilty of a felony if:\n(1) the person was prosecuted in juvenile court for an offense that would have been a felony if committed by an adult;\n(2) the juvenile court made findings pursuant to an admission in court or after trial;\n(3) the person was released from custody on condition that the person appear in the juvenile court for a disposition in connection with the offense; and\n(4) the person was notified that failure to appear is a criminal offense.\n(b) A person who violates the provisions of this subdivision is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\nA person charged with a gross misdemeanor or misdemeanor who intentionally fails to appear in court for trial on the charge after having been notified that a failure to appear for a court appearance is a criminal offense, or after having been released on an order or condition that the releasee personally appear for trial when required with respect to the charge, is guilty of a misdemeanor.\nIf proven by a preponderance of the evidence, it is an affirmative defense to a violation of subdivision 1, 1a, or 2 that the person's failure to appear in court as required was due to circumstances beyond the person's control.\nA violation of this section is prosecuted by the prosecuting authority who was responsible for prosecuting the offense in connection with which the person failed to appear in court.\nUpon conviction of a defendant for a violation of subdivision 1 or 2, the court may order as part of the sentence that the defendant pay the costs incurred by the prosecuting authority or governmental agency due to the defendant's failure to appear. The court may order this payment in addition to any other penalty authorized by law which it may impose. A defendant shall pay the entire amount of any restitution ordered and fine imposed before paying costs ordered under this subdivision. The order for payment of these costs may be enforced in the same manner as the sentence, or by execution against property. When collected, the costs must be paid into the treasury of the county of conviction.",
	"repealed": false
}