{
	"id": "142G.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.34",
	"title": "142G.34 SUPPORT FROM PARENTS OF MINOR CAREGIVERS LIVING APART.",
	"text": "A minor caregiver and the minor's dependent child living outside of the home of the adult parent must meet the criteria in section 142G.14, to be eligible for assistance in the MFIP program. A parent who lives outside the home of a minor child who is an unemancipated minor caregiver of an assistance unit is financially responsible for that minor caregiver unless the parent is a recipient of public assistance, SSI, MSA, medical assistance, or general assistance, and a court order does not otherwise provide a support obligation.\nThe amount of support to be paid by a parent, except a parent specified in subdivision 4, must be determined according to paragraphs (a) to (f).\n(a) A minor caregiver must provide information required by the county agency to identify the whereabouts of the minor caregiver's absent parent or parents.\n(b) A county agency must notify an absent parent of the parent's legal responsibility to support a minor caregiver and shall request that the absent parent provide the following:\n(1) the amount of the parent's earned and unearned income for the previous tax year;\n(2) the amount of the parent's earned and unearned income for the current month;\n(3) the number and names of dependents who are claimed or could be claimed by the parent on federal income tax forms;\n(4) the amount of annual medical bills paid by the parent;\n(5) the amount of annual housing costs paid by the parent;\n(6) the costs for utilities and repairs to the home which are paid by the parent; and\n(7) the amount of annual educational costs for family members paid by the parent.\n(c) When a parent of a minor caregiver does not provide the information requested under paragraph (b), the county agency must refer the matter to the county attorney. Assistance to the minor caregiver must not be denied, delayed, reduced, or ended because of the lack of cooperation of the minor caregiver's parent.\n(d) When the information requested under paragraph (b) is received by a county agency, the county agency must compare the parent's income against the scale set forth below using the conditions and procedures specified in paragraph (e).\n(e) The parent's income is the parent's gross earned income plus unearned income, determined by the methods in section 142G.16. To determine family size, each person claimed or who could be claimed by a parent as a dependent on federal income tax forms, exclusive of the minor caregiver, must be included. A deduction from income must be allowed for the amount that medical, educational, and housing costs together exceed 30 percent of the parent's income. When the amount of income, after the allowable deduction, exceeds the annual income level in paragraph (d), a parent is liable to pay one-third of the excess for the annual support of the minor caregiver. These payments must be paid monthly to the minor caregiver or to the county agency on behalf of the minor caregiver.\n(f) A county agency must notify the parents of the minor caregiver that they are liable for the amount of support determined by the county agency as specified in paragraph (e). When the support payment is received by the minor caregiver, it must be treated as unearned income of the assistance unit. When the support payment is not received, or a lesser amount is received in any payment month, the county agency must refer the matter to the county attorney.\nA county agency must review financial responsibility every 12 months until minor caregivers reach the age of 18 or are otherwise emancipated. When a parent reports a change in circumstances, the county agency must review the required amount of payment within ten calendar days.\nA parent who is required under an existing court order issued under some other authority in state or federal law to pay child support for a minor caregiver is subject to the conditions of that order in lieu of the requirements and contribution levels in subdivision 2.",
	"repealed": false
}