{
	"id": "256I.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/256I.05",
	"title": "256I.05 MONTHLY RATES.",
	"text": "Monthly room and board rates negotiated by a county agency for a recipient receiving housing support must not exceed the MSA equivalent rate specified under section 256I.03, subdivision 11a.\n(a) Subject to the provisions of section 256I.04, subdivision 3, the agency may negotiate a payment not to exceed $494.91 for other services necessary to provide room and board if the residence is licensed by or registered by the Department of Health, or licensed by the Department of Human Services to provide services in addition to room and board, and if the provider of services is not also concurrently receiving funding for services for a recipient in the residence under the following programs or funding sources: (1) home and community-based waiver services under chapter 256S or section 256B.0913, 256B.092, or 256B.49; (2) personal care assistance under section 256B.0659; (3) community first services and supports under section 256B.85; or (4) services for adults with mental illness grants under section 245.73. If funding is available for other necessary services through a home and community-based waiver under chapter 256S, or section 256B.0913, 256B.092, or 256B.49; personal care assistance services under section 256B.0659; community first services and supports under section 256B.85; or services for adults with mental illness grants under section 245.73, then the housing support rate is limited to the rate set in subdivision 1. Unless otherwise provided in law, in no case may the supplementary service rate exceed $494.91. The registration and licensure requirement does not apply to establishments which are exempt from state licensure because they are located on Indian reservations and for which the tribe has prescribed health and safety requirements. Service payments under this section may be prohibited under rules to prevent the supplanting of federal funds with state funds.\n(b) Agencies must not negotiate supplementary service rates with providers of housing support that are licensed as board and lodging with special services and that do not encourage a policy of sobriety on their premises and make referrals to available community services for volunteer and employment opportunities for residents.\n[Repealed, 2014 c 262 art 1 s 12]\nAn agency may not increase the rates negotiated for housing support above those in effect on June 30, 1993, except as provided in paragraphs (a) to (f).\n(a) An agency may increase the rates for room and board to the MSA equivalent rate for those settings whose current rate is below the MSA equivalent rate.\n(b) An agency may increase the rates for residents in adult foster care whose difficulty of care has increased. The total housing support rate for these residents must not exceed the maximum rate specified in subdivisions 1 and 1a. Agencies must not include nor increase difficulty of care rates for adults in foster care whose difficulty of care is eligible for funding by home and community-based waiver programs under title XIX of the Social Security Act.\n(c) An agency must increase the room and board rates each year when the MSA equivalent rate is adjusted for SSI cost-of-living increases by the amount of the annual SSI increase, less the amount of the increase in the medical assistance personal needs allowance under section 256B.35.\n(d) An agency may increase the rates for residents in facilities meeting substantial change criteria within the prior year. Substantial change criteria exist if the establishment experiences a 25 percent increase or decrease in the total number of its beds, if the net cost of capital additions or improvements is in excess of 15 percent of the current market value of the residence, or if the residence physically moves, or changes its licensure, and incurs a resulting increase in operation and property costs.\n(e) Until June 30, 1994, an agency may increase by up to five percent the total rate paid for recipients of assistance under sections 256D.01 to 256D.21 or 256D.33 to 256D.54 who reside in residences that are licensed by the commissioner of health as a boarding care home, but are not certified for the purposes of the medical assistance program. However, an increase under this clause must not exceed an amount equivalent to 65 percent of the 1991 medical assistance reimbursement rate for nursing home resident class A, in the geographic grouping in which the facility is located, as established under Minnesota Rules, parts 9549.0051 to 9549.0058.\n(f) Notwithstanding the provisions of subdivision 1, an agency may increase the monthly room and board rates by $50 per month for residents in settings under section 256I.04, subdivision 2a, paragraph (b), clause (2). Participants in the Minnesota supportive housing demonstration program under section 256I.04, subdivision 3, paragraph (a), clause (3), may not receive the increase under this paragraph.\nNotwithstanding the provisions of subdivisions 1a and 1c, a county agency may negotiate a supplementary service rate in addition to the board and lodging rate for facilities licensed and registered by the Minnesota Department of Health under section 157.17 prior to December 31, 1996, if the facility meets the following criteria:\n(1) at least 75 percent of the residents have a primary diagnosis of mental illness, substance use disorder, or both, and have related special needs;\n(2) the facility provides 24-hour, on-site, year-round supportive services by qualified staff capable of intervention in a crisis of persons with late-state inebriety or mental illness who are vulnerable to abuse or neglect;\n(3) the services at the facility include, but are not limited to:\n(i) secure central storage of medication;\n(ii) reminders and monitoring of medication for self-administration;\n(iii) support for developing an individual medical and social service plan, updating the plan, and monitoring compliance with the plan; and\n(iv) assistance with setting up meetings, appointments, and transportation to access medical, chemical health, and mental health service providers;\n(4) each resident has a documented need for at least one of the services provided;\n(5) each resident has been offered an opportunity to apply for admission to a licensed residential treatment program for mental illness, substance use disorder, or both, have refused that offer, and the offer and their refusal has been documented to writing; and\n(6) the residents are not eligible for home and community-based services waivers because of their unique need for community support.\nUntil June 30, 2002, the supplementary service rate of qualifying facilities under this subdivision may be increased by up to 15 percent of the supplementary service rate in effect on January 1, 2001, for the facility. Qualifying facilities with no supplementary service rate may negotiate a supplementary service rate not to exceed $300 per month.\n(a) Notwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2005, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for a housing support provider that:\n(1) is located in Hennepin County and has had a housing support contract with the county since June 1996;\n(2) operates in three separate locations a 75-bed facility, a 50-bed facility, and a 26-bed facility; and\n(3) serves a clientele with substance use disorder, providing 24 hours per day supervision and limiting a resident's maximum length of stay to 13 months out of a consecutive 24-month period.\n(b) Notwithstanding subdivisions 1a and 1c, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, of a housing support provider that:\n(1) is located in St. Louis County and has had a housing support contract with the county since 2006;\n(2) operates a 62-bed facility; and\n(3) serves an adult male clientele with substance use disorder, providing 24 hours per day supervision and limiting a resident's maximum length of stay to 13 months out of a consecutive 24-month period.\n(c) Notwithstanding subdivisions 1a and 1c, beginning July 1, 2013, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for the provider described under paragraphs (a) and (b), not to exceed an additional 115 beds.\nUntil June 30, 2002, the supplementary service rate for recipients of assistance under section 256I.04 who reside in a residence that is licensed by the commissioner of health as a boarding care home but is not certified for purposes of the medical assistance program may be increased by up to 32 percent of the supplementary service rate in effect for that facility on January 1, 2001. The new rate shall not exceed the nonfederal share of the statewide weighted average monthly medical assistance nursing facility payment rate for case mix A in effect on January 1, 2001.\nAn agency may negotiate a supplementary service rate for recipients of assistance under section 256I.04, subdivision 1, paragraph (a) or (b), who have experienced long-term homelessness and who live in a supportive housing establishment under section 256I.04, subdivision 2a, paragraph (b), clause (2).\nNotwithstanding subdivisions 1a and 1c, beginning July 1, 2007, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $737.87 per month, including any legislatively authorized inflationary adjustments, for a housing support provider that:\n(1) is located in Ramsey County and has had a housing support contract with the county since 1982 and has been licensed as a board and lodge facility with special services since 1979; and\n(2) serves males with and recovering from substance use disorder, providing 24-hour-a-day supervision.\nNotwithstanding the provisions of subdivisions 1a and 1c, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, up to the available appropriation, for a facility located in Hennepin County with a capacity of up to 48 beds that has been licensed since 1978 as a board and lodging facility and that until August 1, 2007, operated as a licensed substance use disorder treatment program.\nNotwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2007, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for a new 65-bed facility in Crow Wing County that will serve persons with substance use disorder operated by a housing support provider that currently operates a 304-bed facility in Minneapolis and a 44-bed facility in Duluth which opened in January of 2006.\nNotwithstanding the provisions of this section, beginning July 1, 2009, a county agency shall negotiate a supplementary service rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for a housing support provider located in Stearns, Sherburne, or Benton County that operates a 40-bed facility, that received financing through the Minnesota Housing Finance Agency Ending Long-Term Homelessness Initiative and serves clientele with substance use disorder, providing 24-hour-a-day supervision.\nNotwithstanding the provisions of this section, beginning July 1, 2007, a county agency shall negotiate a supplementary service rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for a housing support provider located in St. Louis County that operates a 30-bed facility, that received financing through the Minnesota Housing Finance Agency Ending Long-Term Homelessness Initiative and serves clientele with substance use disorder, providing 24-hour-a-day supervision.\nNotwithstanding the provisions of this section, beginning July 1, 2007, a county agency shall negotiate a supplemental service rate in addition to the rate specified in subdivision 1, not to exceed the maximum rate in subdivision 1a or the existing monthly rate, whichever is higher, including any legislatively authorized inflationary adjustments, for a housing support provider that operates two ten-bed facilities, one located in Hennepin County and one located in Ramsey County, which provide community support and serve the mental health needs of individuals who have chronically lived unsheltered, providing 24-hour-per-day supervision.\nNotwithstanding the provisions of this section, for the rate period July 1, 2010, to June 30, 2011, a county agency shall negotiate a supplemental service rate in addition to the rate specified in subdivision 1, not to exceed $753 per month or the existing rate, including any legislative authorized inflationary adjustments, for a housing support provider located in Mahnomen County that operates a 28-bed facility providing 24-hour care to individuals who are homeless, disabled, mentally ill, chronically homeless, or have substance use disorder.\n[Repealed, 2014 c 275 art 1 s 139]\nNotwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2017, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $700 per month, including any legislatively authorized inflationary adjustments, for a housing support provider that:\n(1) is located in St. Louis County and has had a housing support contract with the county since July 2016;\n(2) operates a 35-bed facility;\n(3) serves women who have substance use disorder, mental illness, or both;\n(4) provides 24-hour per day supervision;\n(5) provides on-site support with skilled professionals, including a licensed practical nurse, registered nurses, peer specialists, and resident counselors; and\n(6) provides independent living skills training and assistance with family reunification.\nNotwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2017, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $750 per month, including any legislatively authorized inflationary adjustments, for a housing support provider located in Olmsted County that operates long-term residential facilities with a total of 104 beds that serve men and women with substance use disorder and provide 24-hour-a-day supervision and other support services.\nNotwithstanding the provisions in this section, a county agency shall negotiate a supplemental rate for 42 beds in addition to the rate specified in subdivision 1, not to exceed the maximum rate allowed under subdivision 1a, including any legislatively authorized inflationary adjustments, for a housing support provider that is located in Anoka County and provides emergency housing on the former Anoka Regional Treatment Center campus.\nNotwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2023, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $750 per month, including any legislatively authorized inflationary adjustments, for a housing support provider located in Douglas County that operates a long-term residential facility with a total of 74 beds that serve chemically dependent men and provide 24-hour-a-day supervision and other support services.\nNotwithstanding the provisions of subdivisions 1a and 1c, beginning July 1, 2023, a county agency shall negotiate a supplementary rate in addition to the rate specified in subdivision 1, not to exceed $750 per month, including any legislatively authorized inflationary adjustments, for a housing support provider located in Crow Wing County that operates a long-term residential facility with a total of 90 beds that serves chemically dependent men and women and provides 24-hour-a-day supervision and other support services.\nNotwithstanding the provisions in this section, beginning July 1, 2023, a county agency shall negotiate a supplemental rate for up to 20 beds in addition to the rate specified in subdivision 1, not to exceed the maximum rate allowed under subdivision 1a, including any legislatively authorized inflationary adjustments, for a housing support provider located in Douglas County that operates two facilities and provides room and board and supplementary services to adult males recovering from substance use disorder, mental illness, or housing instability.\nThis subdivision applies to a residence that on August 1, 1984, was licensed by the commissioner of health only as a boarding care home, certified by the commissioner of health as an intermediate care facility, and licensed by the commissioner of human services under Minnesota Rules, parts 9520.0500 to 9520.0670. Notwithstanding the provisions of subdivision 1c, the rate paid to a facility reimbursed under this subdivision shall be determined under chapter 256R, if the facility is accepted by the commissioner for participation in the alternative payment demonstration project. The rate paid to this facility shall also include adjustments to the room and board rate according to subdivision 1.\n(a) When a person receiving housing support is temporarily absent and the absence is reported in advance to the agency's social service staff, the agency must continue to pay on behalf of the person the applicable rate for housing support. Advance reporting is not required for absences due to crisis, illness, or injury. The limit on payments for absence days under this paragraph is 18 calendar days per incident, not to exceed 60 days in a calendar year.\n(b) An agency must continue to pay an additional 74 days per incident, not to exceed a total of 92 days in a calendar year, for a person who is temporarily absent due to admission at a residential behavioral health facility, inpatient hospital, or nursing facility.\n(c) If a person is temporarily absent due to admission at a residential behavioral health facility, inpatient hospital, or nursing facility for a period of time exceeding the limits described in paragraph (b), the agency may request in a format prescribed by the commissioner an absence day limit exception to continue housing support payments until the person is discharged.\nMS 2018 [Repealed, 1Sp2019 c 9 art 5 s 94]\n[Repealed, 1Sp1993 c 1 art 8 s 29]\n[Repealed, 2014 c 262 art 1 s 12]\nThe commissioner shall establish a comprehensive statewide system of rates and payments for recipients who receive housing support to be effective as soon as possible. The commissioner may adopt rules to establish this rate setting system.\n[Repealed, 1992 c 513 art 8 s 59]\n[Repealed, 1992 c 513 art 8 s 59]\nThe commissioner shall not provide automatic annual inflation adjustments for housing support rates for the fiscal year beginning on July 1, 1993, and for subsequent fiscal years. The commissioner of management and budget shall include as a budget change request annual adjustments in reimbursement rates for housing support in each biennial detailed expenditure budget submitted to the legislature under section 16A.11.\nThe commissioner is authorized to pursue the expansion of a demonstration project under federal Supplemental Nutrition Assistance Program (SNAP) regulation for the purpose of gaining additional federal reimbursement of food and nutritional costs currently paid by the state housing support program. The commissioner shall seek approval no later than October 1, 2009. Any reimbursement received is nondedicated revenue to the general fund.\nFor a person who is eligible under section 256I.04, subdivision 1, paragraph (b), state participation in the housing support payment is determined according to section 256D.03, subdivision 2. For a person who is eligible under section 256I.04, subdivision 1, paragraph (a), state participation in the housing support rate is determined according to section 256D.36.\n[Repealed, 1Sp1993 c 1 art 8 s 29]\n[Repealed, 1Sp1993 c 1 art 8 s 29]\n(a) The commissioner is authorized to make cost-neutral transfers from the housing support fund for beds under this section to other funding programs administered by the department after consultation with the agency in which the affected beds are located.\n(b) The commissioner may also make cost-neutral transfers from the housing support fund to agencies for beds removed from the housing support census under a plan submitted by the agency and approved by the commissioner.\n(c) The commissioner shall make a cost-neutral transfer of funding from the housing support fund to the agency for emergency shelter beds removed from the housing support census under a plan submitted by the agency and approved by the commissioner. Plans submitted under this paragraph must include anticipated and actual outcomes for persons experiencing homelessness in emergency shelters.\n(d) Plans submitted under paragraph (b) or (c) must describe: (1) improved efficiencies in administration; (2) requirements for individual eligibility; and (3) plans for quality assurance monitoring and quality assurance outcomes. The commissioner shall review agency plans to monitor implementation and outcomes at least biennially, and more frequently if the commissioner deems necessary.\n(e) Funding under paragraph (b), (c), or (d) may be used for the provision of room and board or supplemental services according to section 256I.03, subdivisions 14a and 14b. Providers must meet the requirements of section 256I.04, subdivisions 2a to 2f. Funding must be allocated annually, and the room and board portion of the allocation shall be adjusted according to the percentage change in the housing support room and board rate. The commissioner or agency may return beds to the housing support fund with 180 days' notice, including financial reconciliation.",
	"repealed": false
}