{
	"id": "611A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.26",
	"title": "611A.26 POLYGRAPH EXAMINATIONS; CRIMINAL SEXUAL CONDUCT COMPLAINTS; LIMITATIONS.",
	"text": "No law enforcement agency or prosecutor shall require that a complainant of a criminal sexual conduct or sex trafficking offense submit to a polygraph examination as part of or a condition to proceeding with the investigation, charging, or prosecution of such offense.\nA law enforcement agency or prosecutor may not ask that a complainant of a criminal sexual conduct offense submit to a polygraph examination as part of the investigation, charging, or prosecution of such offense unless the complainant has been referred to, and had the opportunity to exercise the option of consulting with a sexual assault counselor as defined in section 595.02, subdivision 1, paragraph (k).\nAt the request of the complainant, a law enforcement agency may conduct a polygraph examination of the complainant only with the complainant's written, informed consent as provided in this subdivision.\nTo consent to a polygraph, a complainant must be informed in writing that:\n(1) the taking of the polygraph examination is voluntary and solely at the victim's request;\n(2) a law enforcement agency or prosecutor may not ask or require that the complainant submit to a polygraph examination;\n(3) the results of the examination are not admissible in court; and\n(4) the complainant's refusal to take a polygraph examination may not be used as a basis by the law enforcement agency or prosecutor not to investigate, charge, or prosecute the offender.\nA complainant's refusal to submit to a polygraph examination shall not prevent the investigation, charging, or prosecution of the offense.\nFor the purposes of this section, the following terms have the meanings given.\n(a) \"Criminal sexual conduct\" means a violation of section 609.342, 609.343, 609.344, 609.345, 609.3451, or 609.3458.\n(b) \"Sex trafficking\" means a violation of section 609.322.\n(c) \"Complainant\" means a person reporting to have been subjected to criminal sexual conduct or sex trafficking.\n(d) \"Polygraph examination\" means any mechanical or electrical instrument or device of any type used or allegedly used to examine, test, or question individuals for the purpose of determining truthfulness.",
	"repealed": false
}