{
	"id": "268B.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.185",
	"title": "268B.185 BENEFIT OVERPAYMENTS.",
	"text": "(a) Any applicant who (1) because of a determination or amended determination issued under this chapter, or (2) because of a hearing officer's decision under section 268B.08, has received any family or medical leave benefits that the applicant was held not entitled to, is overpaid the benefits and must promptly repay the benefits to the family and medical benefit insurance account.\n(b) If the applicant fails to repay the benefits overpaid, including any penalty and interest assessed under subdivisions 2 and 4, the total due may be collected by the methods allowed under state and federal law.\n(a) An applicant has committed misrepresentation if the applicant is overpaid benefits by making an intentional false statement or representation in an effort to fraudulently collect benefits. Overpayment because of misrepresentation does not occur where there is an unintentional mistake or a good faith belief as to the eligibility or correctness of the statement or representation.\n(b) After the discovery of facts indicating misrepresentation, the commissioner must issue a determination of overpayment penalty assessing a penalty equal to 15 percent of the amount overpaid.\n(c) A determination of overpayment penalty must state the methods of collection the commissioner may use to recover the overpayment, penalty, and interest assessed. Money received in repayment of overpaid benefits, penalties, and interest is first applied to the benefits overpaid, second to the penalty amount due, and third to any interest due.\n(d) The department is authorized to issue a determination of overpayment penalty under this subdivision within 24 months of the establishment of the leave upon which the benefits were obtained through misrepresentation.\n[See Note.]\n(a) An individual is guilty of theft and must be sentenced under section 609.52 if the individual obtains, or attempts to obtain, or aids or abets any other individual to obtain, by an intentional false statement or representation, by intentional concealment of a material fact, or by impersonation or other fraudulent means, benefits to which the individual is not entitled under this chapter.\n(b) Any employer, or any officer or agent of an employer, or any other individual has committed fraud and is guilty of a crime, if, in order to avoid or reduce any payment required from an employer under this chapter, to improperly secure a grant under section 268B.29, or to prevent or reduce the payment of benefits to an applicant, they:\n(1) make a false statement or representation knowing it to be false;\n(2) knowingly fail to disclose a material fact; or\n(3) knowingly advise or assist an employer in violating clause (1) or (2).\nThe individual is guilty of a gross misdemeanor if the value of the fraudulent activity is $500 or less. The individual is guilty of a felony if the value of the fraudulent activity exceeds $500.\nFor any family and medical leave benefits obtained by misrepresentation, and any penalty amounts assessed under subdivision 2, the commissioner must assess interest on any amount that remains unpaid beginning 30 calendar days after the date of a determination of overpayment penalty. Interest is assessed at the rate of six percent per year. A determination of overpayment penalty must state that interest will be assessed. Interest is not assessed on unpaid interest. Interest collected under this subdivision is credited to the family and medical benefit insurance account.\nThe commissioner may offset from any future family and medical leave benefits otherwise payable the amount of an overpayment. No single offset may exceed 20 percent of the amount of the payment from which the offset is made.\n(a) If family and medical leave benefits overpayments are not repaid or offset from subsequent benefits within three years after the date of the determination or decision holding the applicant overpaid, the commissioner must cancel the overpayment balance, and no administrative or legal proceedings may be used to enforce collection of those amounts.\n(b) The commissioner may cancel at any time any overpayment, including penalties and interest that the commissioner determines is uncollectible because of death or bankruptcy.\n(a) The commissioner has discretion regarding the recovery of any overpayment for reasons other than misrepresentation. Regardless of any law to the contrary, the commissioner is not required to refer any overpayment for reasons other than misrepresentation to a public or private collection agency, including agencies of this state.\n(b) Amounts overpaid for reasons other than misrepresentation are not considered a \"debt\" to the state of Minnesota for purposes of any reporting requirements to the commissioner of management and budget.\n(c) A pending appeal under section 268B.08 does not suspend the assessment of interest, penalties, or collection of an overpayment.\n(d) Section 16A.626 applies to the repayment by an applicant of any overpayment, penalty, or interest.\n(a) If the department is required to pay any court fees in an attempt to enforce collection of overpaid benefits, penalties, or interest, the amount of the court fees may be added to the total amount due.\n(b) If an applicant who has been overpaid benefits because of misrepresentation seeks to have any portion of the debt discharged under the federal bankruptcy code, and the department files an objection in bankruptcy court to the discharge, the cost of any court fees may be added to the debt if the bankruptcy court does not discharge the debt.\n(c) If the Internal Revenue Service assesses a fee from the department for offsetting from a federal tax refund the amount of any overpayment, including penalties and interest, the amount of the fee may be added to the total amount due. The offset amount must be put in the family and medical benefit insurance account and that amount credited to the total amount due from the applicant.",
	"repealed": false
}