{
	"id": "245C.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.031",
	"title": "245C.031 BACKGROUND STUDY; ALTERNATIVE BACKGROUND STUDIES.",
	"text": "(a) The commissioner shall conduct an alternative background study of individuals listed in this section.\n(b) Notwithstanding other sections of this chapter, all alternative background studies except subdivision 12 shall be conducted according to this section and with sections 299C.60 to 299C.64, including the consent and self-disclosure required in section 299C.62, subdivision 2.\n(c) All terms in this section shall have the definitions provided in section 245C.02.\n(d) The entity that submits an alternative background study request under this section shall submit the request to the commissioner according to section 245C.05.\n(e) The commissioner shall comply with the destruction requirements in section 245C.051.\n(f) Background studies conducted under this section are subject to the provisions of section 245C.32.\n(g) The commissioner shall forward all information that the commissioner receives under section 245C.08 to the entity that submitted the alternative background study request under subdivision 2. The commissioner shall not make any eligibility determinations regarding background studies conducted under this section.\n(h) All data obtained by the commissioner for a background study completed under this section is classified as private data on individuals, as defined in section 13.02, subdivision 12.\nEach entity that submits an alternative background study request shall enter into an agreement with the commissioner before submitting requests for alternative background studies under this section. As a part of the agreement, the entity must agree to comply with state and federal law.\nThe commissioner shall conduct an alternative background study of any person who has responsibility for child protection duties when the background study is initiated by a county social services agency or by a local welfare agency according to section 260E.36, subdivision 3.\nThe commissioner shall conduct an alternative background study, including a check of state data, and a national criminal history records check of the following individuals. For studies under this section, the following persons shall complete a consent form and criminal history disclosure form:\n(1) An applicant for initial licensure, temporary licensure, or relicensure after a lapse in licensure as an audiologist, speech-language pathologist, or speech-language pathologist assistant, or an applicant for initial certification as a hearing instrument dispenser who must submit to a background study under section 144.0572.\n(2) An applicant for a renewal license or certificate as an audiologist, speech-language pathologist, or hearing instrument dispenser who was licensed or obtained a certificate before January 1, 2018.\n[See Note.]\nMS 2022 [Repealed, 2023 c 70 art 7 s 47]\nMS 2022 [Repealed, 2023 c 70 art 7 s 47]\nMS 2022 [Repealed, 2023 c 70 art 7 s 47]\nThe commissioner shall conduct an alternative background study of:\n(1) A guardian ad litem appointed under section 518.165 if a background study of the guardian ad litem has not been completed within the past three years. The background study of the guardian ad litem must be completed before the court appoints the guardian ad litem, unless the court determines that it is in the best interests of the child to appoint the guardian ad litem before a background study is completed by the commissioner.\n(2) A guardian ad litem once every three years after the guardian has been appointed, as long as the individual continues to serve as a guardian ad litem.\n(a) An alternative background study for a guardian ad litem under subdivision 8 must include:\n(1) criminal history data from the Bureau of Criminal Apprehension and other criminal history data obtained by the commissioner of human services; and\n(2) data regarding whether the person has been a perpetrator of substantiated maltreatment of a minor or a vulnerable adult. If the study subject has been determined by the Department of Human Services or the Department of Health to be the perpetrator of substantiated maltreatment of a minor or a vulnerable adult in a licensed facility, the response must include a copy of the public portion of the investigation memorandum under section 260E.30 or the public portion of the investigation memorandum under section 626.557, subdivision 12b. When the background study shows that the subject has been determined by a county adult protection or child protection agency to have been responsible for maltreatment, the court shall be informed of the county, the date of the finding, and the nature of the maltreatment that was substantiated.\n(b) For checks of records under paragraph (a), clauses (1) and (2), the commissioner shall provide the records within 15 working days of receiving the request. The information obtained under sections 245C.05 and 245C.08 from a national criminal history records check shall be provided within three working days of the commissioner's receipt of the data.\n(c) Notwithstanding section 260E.30 or 626.557, subdivision 12b, if the commissioner or county lead agency or lead investigative agency has information that a person of whom a background study was previously completed under this section has been determined to be a perpetrator of maltreatment of a minor or vulnerable adult, the commissioner or the county may provide this information to the court that requested the background study.\nThe Professional Educator Licensing and Standards Board shall make all eligibility determinations for alternative background studies conducted under this section for the Professional Educator Licensing and Standards Board. The commissioner may conduct an alternative background study of all first-time applicants for educator licenses pursuant to section 122A.18, subdivision 8. The alternative background study for all first-time applicants for educator licenses must include a review of information from the Bureau of Criminal Apprehension, including criminal history data as defined in section 13.87, and must also include a review of the national criminal records repository.\nThe Board of School Administrators shall make all eligibility determinations for alternative background studies conducted under this section for the Board of School Administrators. The commissioner may conduct an alternative background study of all first-time applicants for administrator licenses pursuant to section 122A.18, subdivision 8. The alternative background study for all first-time applicants for administrator licenses must include a review of information from the Bureau of Criminal Apprehension, including criminal history data as defined in section 13.87, and must also include a review of the national criminal records repository.\n(a) The commissioner shall conduct a background study of any individual required under section 62V.05 to have a background study completed under this chapter. Notwithstanding subdivision 1, paragraph (g), the commissioner shall conduct a background study only based on Minnesota criminal records of:\n(1) each navigator;\n(2) each in-person assister; and\n(3) each certified application counselor.\n(b) The MNsure board of directors may initiate background studies required by paragraph (a) using the online NETStudy 2.0 system operated by the commissioner.\n(c) The commissioner shall review information that the commissioner receives to determine if the study subject has potentially disqualifying offenses. The commissioner shall send a letter to the subject indicating any of the subject's potential disqualifications as well as any relevant records. The commissioner shall send a copy of the letter indicating any of the subject's potential disqualifications to the MNsure board.\n(d) The MNsure board or its delegate shall review a reconsideration request of an individual in paragraph (a), including granting a set aside, according to the procedures and criteria in chapter 245C. The board shall notify the individual and the Department of Human Services of the board's decision.",
	"repealed": false
}