{
	"id": "248.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/248.10",
	"title": "248.10 REHABILITATION COUNCIL FOR THE BLIND.",
	"text": "(a) The commissioner shall establish a Rehabilitation Council for the Blind consistent with the federal Rehabilitation Act of 1973, Public Law 93-112, as amended. Council members shall be compensated as provided in section 15.059, subdivision 3. The council shall advise the commissioner about programs of the Division of State Services for the Blind.\n(b) Notwithstanding section 13D.01, the Rehabilitation Council for the Blind may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the council participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the council can hear all discussion and testimony and all votes of members of the council;\n(3) at least one member of the council is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(c) Each member of the council participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(d) If telephone or another electronic means is used to conduct a meeting, the council to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The council may require the person making such a connection to pay for documented marginal costs that the council incurs as a result of the additional connection.\n(e) If telephone or another electronic means is used to conduct a regular, special, or emergency meeting, the council shall provide notice of the regular meeting location, of the fact that some members may participate by electronic means, and of the provisions of paragraph (d). The timing and method of providing notice is governed by section 13D.04.",
	"repealed": false
}