{
	"id": "245A.1443",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.1443",
	"title": "245A.1443 SUBSTANCE USE DISORDER TREATMENT LICENSED PROGRAMS THAT SERVE PARENTS WITH THEIR CHILDREN.",
	"text": "This section applies to residential substance use disorder treatment facilities that are licensed under this chapter and chapter 245G and that provide services in accordance with section 245G.19.\n(a) On or before the date of a child's initial physical presence at the facility, the license holder must provide education to the child's parent related to safe bathing and reducing the risk of sudden unexpected infant death and abusive head trauma from shaking infants and young children. The license holder must use the educational material developed by the commissioner to comply with this requirement. At a minimum, the education must address:\n(1) instruction that a child or infant should never be left unattended around water, a tub should be filled with only two to four inches of water for infants, and an infant should never be put into a tub when the water is running; and\n(2) the risk factors related to sudden unexpected infant death and abusive head trauma from shaking infants and young children, and means of reducing the risks, including the safety precautions identified in section 142B.46 and the risks of co-sleeping.\n(b) The license holder must document the parent's receipt of the education and keep the documentation in the parent's file. The documentation must indicate whether the parent agrees to comply with the safeguards. If the parent refuses to comply, program staff must provide additional education to the parent as described in the parental supervision plan. The parental supervision plan must include the intervention, frequency, and staff responsible for the duration of the parent's participation in the program or until the parent agrees to comply with the safeguards.\n(a) On or before the date of a child's initial physical presence at the facility, the license holder must document the parent's capacity to meet the health and safety needs of the child while on the facility premises considering the following factors:\n(1) the parent's physical and mental health;\n(2) the parent being under the influence of drugs, alcohol, medications, or other chemicals;\n(3) the child's physical and mental health; and\n(4) any other information available to the license holder that indicates the parent may not be able to adequately care for the child.\n(b) The license holder must have written procedures specifying the actions to be taken by staff if a parent is or becomes unable to adequately care for the parent's child.\n(c) If the parent refuses to comply with the safeguards described in subdivision 2 or is unable to adequately care for the child, the license holder must develop a parental supervision plan in conjunction with the client. The plan must account for any factors in paragraph (a) that contribute to the parent's inability to adequately care for the child. The plan must be dated and signed by the staff person who completed the plan.\nThe license holder must have written procedures addressing whether the program permits a parent to arrange for supervision of the parent's child by another client in the program. If permitted, the facility must have a procedure that requires staff approval of the supervision arrangement before the supervision by the nonparental client occurs. The procedure for approval must include an assessment of the nonparental client's capacity to assume the supervisory responsibilities using the criteria in subdivision 3. The license holder must document the license holder's approval of the supervisory arrangement and the assessment of the nonparental client's capacity to supervise the child, and must keep this documentation in the file of the parent of the child being supervised.",
	"repealed": false
}