{
	"id": "3.757",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.757",
	"title": "3.757 RELEASE OF OPIOID-RELATED CLAIMS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Municipality\" has the meaning provided in section 466.01, subdivision 1.\n(c) \"Opioid litigation\" means any civil litigation, demand, or settlement in lieu of litigation alleging unlawful conduct related to the marketing, sale, or distribution of opioids in this state or other alleged illegal actions that contributed to the excessive use of opioids.\n(d) \"Released claim\" means any cause of action or other claim that has been released in a statewide opioid settlement agreement, including matters identified as a released claim as that term or a comparable term is defined in a statewide opioid settlement agreement.\n(e) \"Settling defendant\" means Johnson & Johnson, AmerisourceBergen Corporation, Cardinal Health, Inc., McKesson Corporation, Teva Pharmaceuticals, Allergan plc, CVS Health Corporation, Walgreens Boots Alliance, Inc., and Walmart, Inc., as well as related subsidiaries, affiliates, officers, directors, and other related entities specifically named as a released entity in a statewide opioid settlement agreement.\n(f) \"Statewide opioid settlement agreement\" means an agreement, including consent judgments, assurances of discontinuance, and related agreements or documents, between the attorney general, on behalf of the state, and a settling defendant, to provide or allocate remuneration for conduct related to the marketing, sale, or distribution of opioids in this state or other alleged illegal actions that contributed to the excessive use of opioids.\n(a) No municipality shall have the authority to assert, file, or enforce a released claim against a settling defendant.\n(b) Any claim in pending opioid litigation filed by a municipality against a settling defendant that is within the scope of a released claim is extinguished by operation of law.\n(c) The attorney general shall have authority to appear or intervene in opioid litigation where a municipality has asserted, filed, or enforced a released claim against a settling defendant and release with prejudice any released claims.\n(d) This section does not limit any causes of action, claims, or remedies, nor the authority to assert, file, or enforce such causes of action, claims, or remedies, by a party other than a municipality.\n(e) This section does not limit any causes of action, claims, or remedies, nor the authority to assert, file, or enforce such causes of action, claims, or remedies by a municipality against entities and individuals other than a released claim against a settling defendant.",
	"repealed": false
}