{
	"id": "168.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.125",
	"title": "168.125 SPECIAL PLATES FOR FORMER PRISONERS OF WAR.",
	"text": "(a) The commissioner shall issue special plates bearing the inscription \"EX-POW\" to any applicant who:\n(1) is both a former prisoner of war and a registered owner of a passenger automobile, motorcycle, or recreational motor vehicle; and\n(2) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(b) The special plates must be of a design and size to be determined by the commissioner. Only one set of plates, or a single plate in the case of a motorcycle, bearing the \"EX-POW\" inscription may be issued for each qualified applicant.\nApplication for issuance of these plates must be made at the time of renewal or first application for registration. The application must include a certification by the commissioner of veterans affairs that the applicant was a member of the military forces of the United States who was captured, separated, and incarcerated by an enemy of the United States during a period of armed conflict.\nThe commissioner shall issue a set of EX-POW plates, or a single plate for a motorcycle, to qualified applicants, free of charge, and shall replace them without charge if they become damaged. In addition, no fee may be charged for a subsequent year when stickers are issued for that motor vehicle on which the EX-POW plates are placed.\nDespite the provisions of section 168.12, subdivision 1, the special plates issued under this section may be transferred to another motor vehicle registered to the former prisoner of war upon notification to the commissioner.\nUpon the death of a former prisoner of war, the commissioner shall continue to issue free of charge, upon renewal, the special plates to a motor vehicle owned by the surviving spouse of the former prisoner of war. Special plates issued to a surviving spouse may be transferred to another motor vehicle registered to the surviving spouse as provided in subdivision 1c. No fee may be charged for replacement plates issued to a surviving spouse or for stickers issued for the motor vehicle on which the special \"EX-POW\" plates are placed. A surviving spouse is not exempt from the motor vehicle registration tax.\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 11]\nThe commissioner shall issue special plates bearing both the \"EX-POW\" and disability emblems to any applicant who is entitled to the special plates provided under this section and who is also entitled to special plates for the physically disabled under section 168.021 upon compliance with the provisions of both sections. The plates must be of a design and size determined by the commissioner.\nThe commissioner of public safety may adopt by rule, in accordance with chapter 14, the procedures for issuance or transfer of the special plates authorized under this section.\nThe commissioner of veterans affairs shall establish the procedure for obtaining the certification of former prisoner of war status.\nNothing in this section alters the exemption for disabled war veterans provided for in section 168.031.",
	"repealed": false
}