{
	"id": "221.0314",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.0314",
	"title": "221.0314 FEDERAL SAFETY REGULATIONS; ADOPTION.",
	"text": "(a) Intrastate motor carriers must comply with the federal regulations incorporated in this section. Private carriers and persons providing intrastate transportation described in section 221.025 must comply with the federal regulations incorporated in this section to the extent required by section 221.031. Every carrier and its officers, agents, representatives, and employees responsible for managing, maintaining, equipping, operating, or driving motor vehicles, or hiring, supervising, training, assigning, or dispatching drivers, must be instructed in and comply with the rules incorporated in this section and shall require that its agents, representatives, drivers, and employees comply.\n(b) In the rules incorporated in subdivisions 2 to 11:\n(1) the term \"motor carrier\" means a carrier required to comply with this section;\n(2) a reference to a federal agency or office means the Minnesota Department of Transportation; and\n(3) a reference to a federal administrative officer means the commissioner of the Minnesota Department of Transportation.\nCode of Federal Regulations, title 49, part 391 and appendixes D and E, are incorporated by reference except for sections 391.2; 391.11, paragraph (b)(1); 391.47; 391.49; 391.62; 391.64; 391.67; 391.68; and 391.69. In addition, cross-references to sections or paragraphs not incorporated in this subdivision are not incorporated by reference. For medical examinations conducted on and after May 21, 2014, the term \"medical examiner\" as used in this section and in the rules adopted under this section means an individual certified by the Federal Motor Carrier Safety Administration and listed on the National Registry of Certified Medical Examiners.\nA person who is not physically qualified to drive under subdivision 2, but who meets the other qualifications under subdivision 2, may drive a motor vehicle if the commissioner grants a waiver to that person. The commissioner may grant a waiver to a person who is not physically qualified to drive under Code of Federal Regulations, title 49, section 391.41, paragraph (b)(1) or (b)(2), according to rules adopted under section 221.031.\n(a) The commissioner may grant a waiver to a person who is not physically qualified to drive under Code of Federal Regulations, title 49, section 391.41, paragraph (b)(3), (b)(10), or (b)(11). A waiver granted under this subdivision applies to intrastate transportation only.\n(b) A person who wishes to obtain a waiver under this subdivision must give the commissioner the following information:\n(1) the applicant's name, address, and telephone number;\n(2) the name, address, and telephone number of an employer coapplicant, if any;\n(3) a description of the applicant's experience in driving the type of vehicle to be operated under the waiver;\n(4) a description of the type of driving to be done under the waiver;\n(5) a description of any modifications to the vehicle the applicant intends to drive under the waiver that are designed to accommodate the applicant's medical condition or disability;\n(6) whether the applicant has been granted another waiver under this subdivision;\n(7) a copy of the applicant's current driver's license;\n(8) a copy of a medical examiner's report and medical examiner's certificate showing that the applicant is medically unqualified to drive unless a waiver is granted;\n(9) a statement from the applicant's treating physician that includes:\n(i) the extent to which the physician is familiar with the applicant's medical history;\n(ii) a description of the applicant's medical condition for which a waiver is necessary;\n(iii) assurance that the applicant has the ability and willingness to follow any course of treatment prescribed by the physician, including the ability to self-monitor or manage the medical condition; and\n(iv) the physician's professional opinion that the applicant's condition will not adversely affect the applicant's ability to operate a commercial motor vehicle safely; and\n(10) any other information considered necessary by the commissioner including requiring a physical examination or medical report from a physician who specializes in a particular field of medical practice.\n(c) In granting a waiver under this subdivision, the commissioner may impose conditions the commissioner considers necessary to ensure that an applicant is able to operate a motor vehicle safely and that the safety of the general public is protected.\n(d) A person who is granted a waiver under this subdivision must:\n(1) at intervals specified in the waiver, give the commissioner periodic reports from the person's treating physician, or a medical specialist if the commissioner so requires in the waiver, that contain the information described in paragraph (b), clause (9), together with a description of any episode that involved the person's loss of consciousness or loss of ability to operate a motor vehicle safely; and\n(2) immediately report the person's involvement in an accident.\n(e) The commissioner may deny an application or may immediately revoke a waiver granted under this subdivision. Notice of the commissioner's reasons for denying an application or for revoking a waiver must be in writing and must be mailed to the applicant's or waiver holder's last known address by certified mail, return receipt requested. A person whose application is denied or whose waiver is revoked is entitled to a hearing under chapter 14.\n(f) A waiver granted under this subdivision expires on the date of expiration shown on the medical examiner's certificate described in paragraph (b), clause (8).\nNotwithstanding subdivisions 3 and 3a, a Minnesota intrastate waiver is not required in Minnesota intrastate commerce if that person holds a valid interstate waiver or comparable document for physical qualifications described in Code of Federal Regulations, title 49, section 391.41.\nDrivers of vehicles engaged in intrastate transportation and subject to subdivision 2 must be at least 18 years of age. Drivers of vehicles subject to section 221.033 must be at least 21 years of age, except as provided in that section.\nA carrier subject to subdivision 2 must keep each driver's qualification file at the carrier's principal place of business for as long as a driver is employed by that carrier and for three years after the driver leaves employment. Upon written request to and with the written approval of the commissioner, a carrier may retain driver qualification files at a regional or terminal office.\nCode of Federal Regulations, title 49, part 392, is incorporated by reference.\nCode of Federal Regulations, title 49, part 393, is incorporated by reference. In addition, despite the first paragraph of Code of Federal Regulations, title 49, section 393.95, a lightweight vehicle must carry a fire extinguisher meeting the requirements in Code of Federal Regulations, title 49, section 393.95.\nThe definitions of \"accident,\" \"disabling damage,\" and \"fatality\" in Code of Federal Regulations, title 49, sections 390.5 and 390.15, are incorporated by reference.\n(a) Code of Federal Regulations, title 49, part 395, is incorporated by reference, except that paragraphs (a), (c), (d), (f), (h), (i), (m), and (n) of section 395.1 of that part are not incorporated. In addition, cross-references to sections or paragraphs not incorporated in this subdivision are not incorporated by reference.\n(b) For purposes of Code of Federal Regulations, title 49, part 395.1, paragraph (k), the planting and harvest period for Minnesota is from January 1 through December 31 of each year.\n(c) The requirements of Code of Federal Regulations, title 49, part 395, do not apply to drivers of lightweight vehicles.\n[Repealed, 2014 c 287 s 26]\nCode of Federal Regulations, title 49, part 396, is incorporated by reference, except that sections 396.9; 396.11, paragraph (a), clause (5); 396.17; 396.19; 396.21; and 396.23 of that part are not incorporated.\nA person who transports hazardous materials shall comply with this section and rules adopted under section 221.031 when that person is transporting a hazardous material, hazardous waste, or hazardous substance in a vehicle that must be marked or placarded in accordance with Code of Federal Regulations, title 49, section 172.504, incorporated by reference in section 221.033. Code of Federal Regulations, title 49, part 397, is incorporated by reference. A petroleum transport driver shall not park on a public street adjacent to a bridge, tunnel, dwelling, building, or place where persons work, congregate, or assemble, except when necessary to unload.\nA person who transports the hazardous materials designated in Code of Federal Regulations, title 49, section 385.403, shall comply with this section and with the provisions of Code of Federal Regulations, title 49, part 385, subpart E, which is incorporated by reference.",
	"repealed": false
}