{
	"id": "60M.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.04",
	"title": "60M.04 PRODUCER AUDITS.",
	"text": "(a) By April 30 each year, a surety must audit each licensed bail bond producer's bonds written during the previous calendar year to ensure the licensed bail bond producer has complied with this subdivision.\n(b) The premium audits must include a review of an adequate sample of bonds written by each bail bond producer. A review sample is adequate if it consists of the lesser of: (1) 20 percent of the bonds written by the bail bond producer; (2) 24 bonds; or (3) all of the bonds written by the bail bond producer, if the bail bond producer wrote fewer than 12 bonds during the previous calendar year. The audit sample must include the four largest bonds written by the bail bond producer and four bonds that charged an alternative premium under section 60M.02, subdivision 5, if applicable. Of the remaining bonds audited and to the extent the quantity of bonds supports the percentages, 50 percent must be randomly selected bonds with a penal sum that is $10,000 or less, and 50 percent must be randomly selected bonds with a penal sum that is greater than $10,000.\n(c) The premium audit must be conducted at the producer's office or the bail bond agency's office, depending on which entity maintains the physical records. The surety must not disclose to the producer or bail bond agency, or anyone affiliated with the surety or bail bond agency, which files the surety intends to audit until the surety's on-site audit of the producer begins.\n(d) For each bond audited, the surety must confirm that:\n(1) the proper premium was charged and collected, including a review of the premium account statements and deposit slips;\n(2) a proper premium receipt is in the producer's file;\n(3) if the full premium was not paid before the bond was posted, a proper promissory note was executed; and\n(4) if the premium was not paid as required, the producer complied with section 60M.02, subdivision 6.\n(e) An annual premium audit under this section must also include a follow-up review of each bond audited the previous year for which full premium had not yet been collected at the time the audit occurred. For each bond subject to a follow-up review, the surety must:\n(1) review the premium account and deposit slips to confirm that the full premium was collected; or\n(2) if full payment of the premium was not received, confirm that the producer complied with section 60M.02, subdivision 6.\n(f) A bail bond agency or producer is prohibited from acting on behalf of the surety to conduct the bail bond agency's or producer's own bail bond agency or producer audits.\n(a) By April 30 each year, a surety must audit each licensed bail bond producer's bonds written during the previous calendar year to ensure the licensed bail bond producer has complied with this subdivision.\n(b) A collateral audit under this subdivision must include confirmation that:\n(1) a collateral log was maintained;\n(2) a cash collateral account exists;\n(3) the balance of the cash collateral indicated on the collateral log is identical to the amount held in the collateral trust account; and\n(4) a collateral receipt exists for collateral collected, as represented by a sampling of the lesser of: (i) 20 percent of all bonds secured by collateral; or (ii) 12 bonds that were secured by collateral.\n(a) By May 31 each year, a surety must prepare a report of the audits conducted under this section during that year. The report must include:\n(1) a list of the bonds audited under subdivision 1 for each producer, including the power of attorney number used for each audited bond and whether full premium payment was made by the date the audit occurred;\n(2) a list of the bonds included in a follow-up review of the previous year's audit, including whether full premium payment was collected by the date the audit occurred;\n(3) the compliance certifications required under section 60M.07, subdivision 4; and\n(4) details regarding any violations discovered during the audit or a statement that no violations were discovered, as applicable.\n(b) The annual report under this subdivision must be maintained for a period of at least 36 months from the date the report is complete. Annual reports must be submitted to the commissioner by June 30 each year.",
	"repealed": false
}