{
	"id": "79.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.55",
	"title": "79.55 STANDARDS FOR RATES.",
	"text": "Premiums shall not be excessive, inadequate, or unfairly discriminatory.\nRates and rating plans are excessive if the expected underwriting profit, together with expected income from invested reserves, that would accrue to an insurer under the rates and rating plans would be unreasonably high in relation to the risk undertaken by the insurer in transacting the business. The burden is on the insurer to establish that profit is not unreasonably high.\nPremiums are inadequate if, together with the investment income associated with an insurer's Minnesota workers' compensation insurance business, they are clearly insufficient to sustain projected losses and expenses of the insurer and (a) if their continued use could lead to an insolvent situation for the insurer; or (b) if their use destroys or lessens competition or is likely to destroy or lessen competition.\nPremiums are unfairly discriminatory if differentials for insureds fail to reasonably reflect the differences in expected losses and expenses to the insurer attributable to the insureds. Rates are not unfairly discriminatory solely because different premiums result for insureds with like loss exposures but different expense factors, or like expense factors but different loss exposures, provided that rates reflect the differences with reasonable accuracy.\nAn insurer may offer a discount from a manual premium if the premium otherwise complies with this section. The commissioner shall not by rule, or otherwise, prohibit a credit or discount from a manual premium solely because it is greater than a certain fixed percentage of the premium.\n(a) In determining whether a rate filing complies with this section, separate consideration shall be given to:\n(1) past and prospective loss experience within this state and outside this state to the extent necessary to develop credible rates;\n(2) dividends, savings, or unabsorbed premium deposits allowed or returned by insurers to their policyholders, members, or subscribers; and\n(3) a reasonable allowance for expense and profit.\n(b) An allowance for expense shall be presumed reasonable if it reflects expenses that are 22.5 percent greater or less than the average expense for all insurers writing workers' compensation insurance in this state.\n(c) An allowance for after-tax profit shall consider anticipated investment income from premium receipts net of disbursements and from allocated surplus, based on the current five-year United States Treasury note yield and an assumed premium to surplus ratio of 2.25 to one.\n(d) The allowance for after-tax profit shall be presumed reasonable if the corresponding return on equity target is equal to or less than the sum of:\n(1) the current yield on five-year United States Treasury securities; and\n(2) an appropriate equity risk premium that reflects the risks of writing workers' compensation insurance.\n(e) The risk premium shall not be less than the average, since 1926, of the differences in return between:\n(1) the annual return, including dividend income, for the Standards and Poors 500 common stock index or predecessor index for each year; and\n(2) the five-year United States Treasury note yield as of the start of the corresponding year.\n(f) Profit and expense allowances not presumed reasonable under this subdivision, are reasonable if the circumstances of an insurer, the market, or other factors justify them.\nThat portion of a rate or rating plan related to assessments from the assigned risk plan, reinsurance association, guarantee fund, special compensation fund, agent commission, premium tax and any other state-mandated surcharges shall not cause the rate or rating plan to be considered excessive, inadequate, or unfairly discriminatory.\nNot later than October 1 of each year, the rating association shall file with the commissioner and the Rate Oversight Commission the following information used and related to the calculation and cost of workers' compensation insurance premiums:\n(1) all statistical plans, including classification definitions used to assign each compensation risk written by its members to its approved classification for reporting purposes;\n(2) all development factors and alternative derivations;\n(3) a description and summary of each data reporting and monitoring method used to collect and monitor the database for workers' compensation insurance;\n(4) trend factors and alternative derivations and applications;\n(5) pure premium relativities for the approved classification system for which data are reported;\n(6) an evaluation of the effects of changes in law on loss data;\n(7) an explicit discussion and explanation of all methodology, alternatives examined, assumptions adopted, and areas of judgment and reasoning supporting judgments entered into, and the effect of various combinations of these elements on indications for modification of an overall pure premium rate level change; and\n(8) all merit rating plans and the calculation of any variable factors necessary for utilization of the plan.\nNot later than December 1 of each year, the Rate Oversight Commission may submit to the commissioner a report concerning the completeness of the filing and compliance of the filing with the standards for excessiveness, inadequacy, and unfair discrimination set forth in this chapter.\n(a) By March 1 of each year, the commissioner must issue a report that evaluates the competitiveness of the workers' compensation market in Minnesota in order to evaluate whether the competitive rating law is working.\n(b) The report under this subdivision must: (1) compare the average rates charged by workers' compensation insurers in Minnesota with the pure premium base rates filed by the association; and (2) provide market information, including but not limited to the number of carriers, market shares, the loss-cost multipliers used by companies, and the residual market and self-insurance.\n(c) The commissioner must provide the report to the Rate Oversight Commission for review. If after reviewing the report the Rate Oversight Commission concludes that concerns exist regarding the competitiveness of the workers' compensation market in Minnesota, the Rate Oversight Commission must recommend to the legislature appropriate modifications to this chapter.",
	"repealed": false
}