{
	"id": "84.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.705",
	"title": "84.705 COMMUNITY TREE-PLANTING GRANTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Shade tree\" means a woody perennial grown primarily for aesthetic or environmental purposes with minimal to residual timber value.\n(c) \"Supplemental demographic index\" means an index in the Environmental Justice Screening and Mapping Tool developed by the United States Environmental Protection Agency that is based on socioeconomic indicators, including low income, unemployment, less than high school education, limited English speaking, and low life expectancy.\n(a) The commissioner must establish a grant program to provide grants to cities, counties, townships, Tribal governments, and park and recreation boards in cities of the first class for the following purposes:\n(1) removing and planting shade trees on public or Tribal land to provide environmental benefits;\n(2) replacing trees lost to forest pests, disease, or storms; and\n(3) establishing a more diverse community forest better able to withstand disease and forest pests.\n(b) Any tree planted with money granted under this section must be a climate-adapted species to Minnesota.\n(a) Priority for grants awarded under this section must be given to:\n(1) projects removing and replacing ash trees that pose significant public safety concerns; and\n(2) projects located in a census block group with a supplemental demographic index score in the 70th percentile or higher within the state of Minnesota.\n(b) The commissioner may not prioritize projects based on criteria other than the criteria established under paragraph (a).\n(a) The proceeds of state general obligation bonds may only be expended for grants to cities, counties, townships, and park and recreation boards in cities of the first class.\n(b) Appropriations from the general fund may be expended for grants to Tribal governments, cities, counties, townships, and park and recreation boards in cities of the first class.",
	"repealed": false
}