{
	"id": "85A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/85A.02",
	"title": "85A.02 POWERS AND DUTIES.",
	"text": "The board shall possess the powers and shall be charged with the duties and responsibilities prescribed in this section.\nThe board shall acquire, construct, equip, operate and maintain the Minnesota Zoological Garden at a site in Dakota County legally described in Laws 1975, chapter 382, section 12. The zoological garden shall consist of adequate facilities and structures for the collection, habitation, preservation, care, exhibition, examination or study of wild and domestic animals, including, but not limited to mammals, birds, fish, amphibians, reptiles, crustaceans and mollusks. The board may provide such lands, buildings and equipment as it deems necessary for parking, transportation, entertainment, education, or instruction of the public in connection with such zoological garden. The zoological garden is an official pollinator bank for the state of Minnesota. For purposes of this subdivision, \"pollinator bank\" means a program to avert the extinction of pollinator species by cultivating insurance breeding populations.\nThe board may conduct research studies and programs, collect and analyze data and prepare reports, maps, charts and other information relating to the zoological garden or any wild or domestic animals or may contract for any of such services without complying with chapter 16C.\n[Repealed, 1993 c 337 s 20]\nThe board may accept and use gifts, grants, or contributions from any nonstate source. Unless otherwise restricted by the terms of a gift or bequest, the board may sell, exchange, or otherwise dispose of, and invest or reinvest the money, securities, or other property given or bequeathed to it from nonstate sources. The principal of these funds, the income from them, and all other revenues received by it from any nonstate source must be placed in the depositories the board determines and is subject to expenditure for the board's purposes, except that expenditures of $25,000 or more must be approved by the full board. Any additional operating expenses incurred by virtue of capital development projects must be paid for with funds other than state appropriations.\n(a) The board shall appoint an administrator who shall serve as the executive secretary and principal administrative officer of the board and, subject to its approval, shall operate the Minnesota Zoological Garden and enforce all rules and policy decisions of the board. The administrator must be chosen solely on the basis of training, experience, and other qualifications appropriate to the field of zoo management and development. The board shall set the salary of the administrator; however, any amount exceeding 95 percent of the salary of the governor must consist of nonstate funds. The administrator shall perform duties assigned by the board and serves in the unclassified service at the pleasure of the board. The administrator, with the participation of the board, shall appoint a development director in the unclassified service or contract with a development consultant to establish mechanisms to foster community participation in and community support for the Minnesota Zoological Garden. The board may employ other necessary professional, technical, and clerical personnel. Employees of the zoological garden are eligible for salary supplement in the same manner as employees of other state agencies. The commissioner of management and budget shall determine the amount of salary supplement based on available funds.\n(b) The board may contract with individuals to perform professional services and may contract for the purchases of necessary species exhibits, supplies, services, and equipment. The board may also contract for the construction and operation of entertainment facilities on the zoo grounds that are not directly connected to ordinary functions of the zoological garden. The zoo board may not enter into a final agreement for construction of an entertainment facility that is not directly connected to the ordinary functions of the zoo until after final construction plans have been submitted to the chairs of the senate Finance and house of representatives Ways and Means Committees for their recommendations.\n(c) The zoo may not contract for entertainment during the period of the Minnesota State Fair that would directly compete with entertainment at the Minnesota State Fair.\nThe board is not subject to sections 3.841 to 3.843, 15.057, 15.061, 16A.1285, and 16A.28; chapters 16B and 16C, except for sections 16B.35, 16B.55, 16C.06, 16C.08, 16C.09, and 16C.16; and chapter 14, except section 14.386, paragraph (a), clauses (1) and (3). Section 14.386, paragraph (b), does not apply to the board's actions.\nThe board shall employ a certified public accountant to audit and examine its financial records each year. The board shall submit to the legislative auditor a report of the accountant's examination or audit. The legislative auditor shall review the report and may make additional examinations if these would be in the public interest. The working papers of the certified public accountant relating to the board must be made available to the legislative auditor on request.\nLands necessary for any of the purposes enumerated in this section may be acquired by eminent domain proceedings under the authority of chapter 117.\nThe board may enact rules governing the efficient protection of the Minnesota Zoological Garden and the related facilities and the conduct of persons entering therein. Notwithstanding subdivision 5b, rules shall become effective in the manner provided by law for the promulgation of rules by state departments and agencies. The violation of a rule promulgated by the board under this section is a petty misdemeanor. The board may specify that violation of a designated rule shall be sufficient cause for ejection from the grounds of the zoological garden.\n[Repealed, 1973 c 207 s 6]\nThe board shall comply with all federal laws and any rules or regulations prescribed by any agency of the federal government, relating to the quarantine, transportation, examination, habitation, care, and treatment of wild animals. The Department of Natural Resources may prescribe rules supplemental to such federal regulations, relating to the transportation, examination, care, and treatment of wild animals native to this state held or proposed to be acquired by the board and may inspect all such wild animals as often and at such times as it shall deem necessary.\n(a) The board shall not be subject to the provisions of chapters 17, 35, 97A, 97B, and 97C, and section 343.21, subdivision 8, relating to purchase, barter, sale, possession, breeding, or transporting wild animals, but must comply with paragraph (b).\n(b) The board must request a permit from the Board of Animal Health for any exemption from the provisions of chapter 35 or rules adopted thereunder and from the Department of Natural Resources for any exemption from the provisions of chapter 97A, 97B, or 97C or rules adopted thereunder.\nThe board shall have all powers necessary or convenient to discharge the duties imposed upon it by law, and to operate the zoological garden in the manner which will best serve the public.\nThe board shall report to the legislature by September 15 of each year on the activities of the board and the operation of the zoological garden. The report must summarize the activities of the board and the Minnesota Zoological Garden over the preceding fiscal year ending June 30. The report must be submitted together with the financial report required by subdivision 5c.\nThe board may acquire by gift, purchase, or condemnation any real estate, not previously acquired and conveyed to the state by the county of Dakota, necessary to complete the zoo site as described in Laws 1975, chapter 382, section 12 or to meet United States Department of Agriculture certification requirements. Funds from the Minnesota Zoological Garden building account may be expended for the acquisitions.\nThe board may sell or exchange animals determined by it to be superfluous to zoo operations, subject to all state and federal regulations.\nThe board may provide for promotional and advertising programs which may be developed and implemented either by zoological garden personnel or by contract with outside personnel and which shall be paid for out of funds other than bond revenues.\nThe board may acquire by lease-purchase or installment purchase contract, transportation systems, facilities and equipment that it determines will substantially enhance the public's opportunity to view, study, or derive information concerning the animals to be located in the zoological garden, and will increase attendance at the garden. The contracts may provide for: (1) the payment of money over a 12-year period, or over a longer period not exceeding 25 years if approved by the board; (2) the payment of money from any funds of the board not pledged or appropriated for another purpose; (3) indemnification of the lessor or seller for damage to property or injury to persons due primarily to the actions of the board or its employees; (4) the transfer of title to the property to the board upon execution of the contract or upon payment of specified amounts; (5) the reservation to the lessor or seller of a security interest in the property; and (6) any other terms that the board determines to be commercially reasonable. Property so acquired by the board, and its purchase or use by the board, or by any nonprofit corporation having a concession from the board requiring its purchase, shall not be subject to taxation by the state or its political subdivisions. Each contract shall be subject to the provisions of chapter 16C, relating to competitive bidding, provided that, notwithstanding subdivision 5b, the board is not required to readvertise for competitive proposals for any transportation system, facilities and equipment heretofore selected from competitive proposals.\n(a) The board may establish a schedule of charges for admission to or the use of the Minnesota Zoological Garden or any related facility. Notwithstanding section 16A.1283, legislative approval is not required for the board to establish a schedule of charges for admission or use of the Minnesota Zoological Garden or related facilities. The board shall have a policy admitting elementary school children at a reduced charge when they are part of an organized school activity. The Minnesota Zoological Garden will offer free admission throughout the year to economically disadvantaged Minnesota citizens equal to ten percent of the average annual attendance. However, the zoo may charge at any time for parking, special services, and for admission to special facilities for the education, entertainment, or convenience of visitors.\n(b) The board may provide for the purchase, reproduction, and sale of gifts, souvenirs, publications, informational materials, food and beverages, and grant concessions for the sale of these items. Notwithstanding subdivision 5b, section 16C.09 does not apply to activities authorized under this paragraph.\nThe board may contract for supplies, materials, purchase or rental of equipment, and utility services. Except as provided in subdivision 5b, chapter 16C does not apply to these contracts.",
	"repealed": false
}