{
	"id": "256D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.03",
	"title": "256D.03 RESPONSIBILITY TO PROVIDE GENERAL ASSISTANCE.",
	"text": "Every county agency shall provide general assistance to persons residing within its jurisdiction who meet the need requirements of sections 256D.01 to 256D.21. General assistance shall be administered by the county agencies according to law and rules promulgated by the commissioner pursuant to sections 14.001 to 14.69.\nState aid shall be paid for all general assistance and grants up to the standards of section 256D.01, subdivision 1a, and according to procedures established by the commissioner, except as provided for under section 256.017.\nAny county agency may, from its own resources, make payments of general assistance: (1) at a standard higher than that established by the commissioner without reference to the standards of section 256D.01, subdivision 1; or (2) to persons not meeting the eligibility standards set forth in section 256D.05, subdivision 1, but for whom the aid would further the purposes established in the general assistance program according to rules adopted by the commissioner according to the Administrative Procedure Act. The Minnesota Department of Human Services may maintain client records and issue these payments, providing the cost of benefits is paid by the counties to the Department of Human Services according to section 256.01.\nEvery county agency shall determine eligibility and calculate benefit amounts for general assistance according to chapter 256P.\n[See Note.]\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (a)]\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (a)]\nGeneral assistance applicants and recipients must cooperate with the state and local agency to identify potentially liable third-party payors and assist the state in obtaining third-party payments. Cooperation includes identifying any third party who may be liable for care and services provided under this chapter to the applicant, recipient, or any other family member for whom application is made and providing relevant information to assist the state in pursuing a potentially liable third party.\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (b)]\n[Repealed, 2010 c 200 art 1 s 21]\n[Repealed, 2010 c 382 s 87; 1Sp2010 c 1 art 16 s 47]\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (a)]\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (a)]\nMS 2010 [Repealed, 1Sp2010 c 1 art 16 s 47 para (a)]\n[Repealed, 2010 c 200 art 1 s 21]",
	"repealed": false
}