{
	"id": "136A.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.68",
	"title": "136A.68 RECORDS.",
	"text": "(a) A registered school shall maintain a permanent record for each student for 50 years from the last date of the student's attendance. A registered school offering distance instruction to a student located in Minnesota shall maintain a permanent record for each Minnesota student for 50 years from the last date of the student's attendance. Records include a student's academic transcript, documents, and files containing student data about academic credits earned, courses completed, grades awarded, degrees awarded, and periods of attendance.\n(b) A registered school shall maintain records required for professional licensure in Minnesota that are not included in paragraph (a) for ten years from the last date of the student's attendance or the number of years required by an institutional or programmatic accreditor, whichever is greater.\n(c) To preserve permanent records, a school shall submit a plan that meets the following requirements:\n(1) at least one copy of the records must be held in a secure, fireproof depository or duplicate records must be maintained off site in a secure location and in a manner approved by the office;\n(2) an appropriate official must be designated to provide a student with copies of records or a transcript upon request;\n(3) an alternative method approved by the office of complying with clauses (1) and (2) must be established if the school ceases to exist; and\n(4) if the school has no binding agreement approved by the office for preserving student records, a continuous surety bond or an irrevocable letter of credit issued by a financial institution must be filed with the office in an amount not to exceed $20,000. The bond or irrevocable letter of credit shall run to the state of Minnesota. In the event of a school closure, the surety bond or irrevocable letter of credit must be used by the office to retrieve, recover, maintain, digitize, and destroy academic records.",
	"repealed": false
}