{
	"id": "28A.0753",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.0753",
	"title": "28A.0753 ENFORCEMENT OF LAWS BY COMMISSIONER.",
	"text": "The commissioner is authorized, if upon investigation the commissioner is satisfied that the laws of the state, relative to any laws placed within the commissioner's jurisdiction, have been violated, to cause to be instituted, in the commissioner's own name as commissioner or in the name of the state, actions in the proper court, to secure punishment of the guilty party; and, if the party complained against is a corporation, to secure the cancellation of its authority and the annulment of its corporate existence, if a domestic corporation; or, if a foreign corporation, the forfeiture of its license to do business in this state.\nIf, after an investigation, it appears to the commissioner that the laws of this state have been violated in any respect, the commissioner shall present all available information bearing upon such apparent violation to the proper law enforcing or prosecuting officer of the state or of the United States.\nWhen a food manufacturer, processor, or distributor is licensed by the commissioner of agriculture, the food manufacturer, processor or distributor is exempt from the licensing requirements of any municipal corporation or subdivision of state government, except for licensing requirements which may be imposed by the municipal corporation or subdivision of state government in which the manufacturer, processor, or distributor locates a plant. All delivery equipment used by such a food manufacturer, processor or distributor is included within the meaning of this section, whether owned or operated, independently contracted, or contracted with a common carrier approved by the commissioner of agriculture. This delivery equipment is exempt from licensing by any municipal corporation or subdivision of state government except for those requirements which may be imposed by the municipal corporation or subdivision of state government in which the equipment is principally located. Delivery equipment approved by the commissioner of agriculture shall carry, at all times, a certificate of approval for the purposes for which the equipment is utilized. Nothing in this section is intended to permit the enactment of an ordinance regulating an activity where the state has preempted the field.",
	"repealed": false
}