{
	"id": "60B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.04",
	"title": "60B.04 JURISDICTION AND VENUE.",
	"text": "Except as provided in subdivision 2, no delinquency proceeding shall be commenced under sections 60B.01 to 60B.61 by anyone other than the commissioner, including an acting commissioner, of this state and no court shall have jurisdiction to entertain, hear, or determine any proceeding under sections 60B.01 to 60B.61 commenced by any other person.\n(a) The judgment creditors of three or more unrelated judgments may commence proceedings under the conditions and in the manner prescribed in this subdivision by serving notice upon the commissioner and the insurer of intention to file a petition for liquidation under section 60B.20 or 60B.53. Each of the judgments must:\n(1) have been rendered against the insurer by a court in this state having jurisdiction over the subject matter and the insurer;\n(2) have been entered more than 60 days before the service of notice;\n(3) not have been paid in full;\n(4) not be the subject of a valid contract between the insurer and any judgment creditor for payment of the judgment, unless the contract has been breached by the insurer; and\n(5) not be a judgment on which an appeal or review is pending.\n(b) If any one of the judgments in favor of a petitioning creditor remains unpaid for 30 days after service of the notice, and the commissioner has not then filed a petition for liquidation, the creditor may file in the name of the commissioner a verified petition for liquidation of the insurer under section 60B.20 or 60B.53 alleging the conditions stated in this subdivision. The commissioner shall be served and joined in the action.\nNo court of this state shall have jurisdiction to entertain, hear, or determine any complaint praying for the dissolution, liquidation, rehabilitation, sequestration, conservation, or receivership of any insurer, or praying for an injunction or restraining order or other relief preliminary to, incidental to, or relating to such proceedings other than in accordance with sections 60B.01 to 60B.61, except that the voluntary dissolution or liquidation of a solvent insurer may occur as otherwise permitted by law, and any court of this state shall have jurisdiction to entertain, hear and determine a petition for voluntary dissolution or liquidation where otherwise permitted by law upon it being established to the satisfaction of the court, after notice to the commissioner, that the insurer is solvent.\nVenue for proceedings arising under sections 60B.01 to 60B.61 shall be laid initially as specified in the sections providing for such proceedings. All other actions and proceedings initiated by the receiver may be commenced and tried where the delinquency proceedings are then pending, or where venue would be laid by other applicable law. All other actions and proceedings against the receiver shall be commenced and tried in the county where the delinquency proceedings are pending. At any time upon motion of any party, venue may be changed by order of the court or the presiding judge thereof to any other district court in this state, as the convenience of the parties and witnesses and the ends of justice may require. This subdivision relates only to venue and is not jurisdictional.\nIn addition to other grounds for jurisdiction provided by the law of this state, a court of this state having jurisdiction of the subject matter has jurisdiction over a person served pursuant to rule 4 of Minnesota Rules of Civil Procedure in an action brought by the receiver of a domestic insurer or an alien insurer domiciled in this state:\n(a) if the person served is obligated to the insurer in any way as an incident to an agency or brokerage arrangement that may exist or has existed between the insurer and the agent or broker, in any action on or incident to the obligation;\n(b) if the person served is a reinsurer who has at any time written a policy of reinsurance for an insurer against which a rehabilitation or liquidation order is in effect when the action is commenced, or is an agent or broker of or for the reinsurer, in any action on or incident to the reinsurance contract; or\n(c) if the person served is or has been an officer, manager, trustee, organizer, promoter, or person in a position of comparable authority or influence in an insurer against which a rehabilitation or liquidation order is in effect when the action is commenced, in any action resulting from the relationship with the insurer.\nIf the court on motion of any party finds that any action commenced under subdivision 5 should as a matter of substantial justice be tried in a forum outside this state, the court may enter an order to stay further proceedings on the action in this state.",
	"repealed": false
}