{
	"id": "62L.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.02",
	"title": "62L.02 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 62L.01 to 62L.22.\n\"Actuarial opinion\" means a written statement by a member of the American Academy of Actuaries that a health carrier is in compliance with this chapter, based on the person's examination, including a review of the appropriate records and of the actuarial assumptions and methods utilized by the health carrier in establishing premium rates for health benefit plans.\n\"Association\" means the Health Coverage Reinsurance Association.\n[Repealed, 2013 c 84 art 1 s 94]\n\"Board of directors\" means the board of directors of the Health Coverage Reinsurance Association.\n\"Case characteristics\" means the relevant characteristics of a small employer, as determined by a health carrier in accordance with this chapter, which are considered by the carrier in the determination of premium rates for the small employer.\n\"Coinsurance\" means an established dollar amount or percentage of health care expenses that an eligible employee or dependent is required to pay directly to a provider of medical services or supplies under the terms of a health benefit plan.\n\"Commissioner\" means the commissioner of commerce for health carriers subject to the jurisdiction of the Department of Commerce or the commissioner of health for health carriers subject to the jurisdiction of the Department of Health, or the relevant commissioner's designated representative. For purposes of sections 62L.13 to 62L.22, \"commissioner\" means the commissioner of commerce or that commissioner's designated representative.\n\"Continuous coverage\" means the maintenance of continuous and uninterrupted qualifying coverage. An individual is considered to have maintained continuous coverage if the individual requests enrollment in qualifying coverage within 63 days of termination of qualifying coverage.\n\"Current employee\" means an employee, as defined in this section, other than a retiree or disabled former employee.\n\"Deductible\" means the amount of health care expenses an eligible employee or dependent is required to incur before benefits are payable under a health benefit plan.\n\"Dependent\" means an eligible employee's spouse, dependent child to the limiting age as defined in section 62Q.01, subdivision 2a, dependent child of any age who is disabled and who meets the eligibility criteria in section 62A.14, subdivision 2, or any other person whom state or federal law requires to be treated as a dependent for purposes of health plans. For the purpose of this definition, a dependent child to the limiting age as defined in section 62Q.01, subdivision 2a, includes a child for whom the employee or the employee's spouse has been appointed legal guardian and an adoptive child as provided in section 62A.27. A child also means a grandchild as provided in section 62A.042 with continued eligibility of grandchildren as provided in section 62A.302, subdivision 4.\n\"Discounted eligible charges\" means, as determined by the board of directors, eligible charges reduced by the average difference between eligible charges and the expected liability of the health carrier for services performed. The board of directors, in its discretion, may determine additional different discounts, based upon geographic area and type of delivery system.\n\"Eligible charges\" means the actual charges submitted to a health carrier by or on behalf of a provider, eligible employee, or dependent for health services covered by the health carrier's health benefit plan. Eligible charges do not include charges for health services excluded by the health benefit plan or charges for which an alternate health carrier is liable under the coordination of benefit provisions of the health benefit plan.\n\"Eligible employee\" means an employee who has satisfied all employer participation and eligibility requirements.\n\"Employee\" means an individual employed for at least 20 hours per week and includes a sole proprietor or a partner of a partnership, if the sole proprietor or partner is included under a health benefit plan of the employer, but does not include individuals who work on a temporary, seasonal, or substitute basis. \"Employee\" also includes a retiree or a disabled former employee required to be covered under sections 62A.147 and 62A.148.\n\"Enrollment date\" means, with respect to a covered individual, the date of enrollment of the individual in the health benefit plan or, if earlier, the first day of the waiting period for the individual's enrollment.\n\"Financially impaired condition\" means a situation in which a health carrier is not insolvent, but (1) is considered by the commissioner to be potentially unable to fulfill its contractual obligations, or (2) is placed under an order of rehabilitation or conservation by a court of competent jurisdiction.\n\"Guaranteed issue\" means that a health carrier shall not decline an application by a small employer for any health benefit plan offered by that health carrier and shall not decline to cover under a health benefit plan any eligible employee or eligible dependent, including persons who become eligible employees or eligible dependents after initial issuance of the health benefit plan.\n\"Health benefit plan\" means a policy, contract, or certificate offered, sold, issued, or renewed by a health carrier to a small employer for the coverage of medical and hospital benefits. Health benefit plan includes a small employer plan. Health benefit plan does not include coverage, including any combination of the following coverages, that is:\n(1) limited to disability or income protection coverage;\n(2) automobile medical payment coverage;\n(3) liability insurance or supplemental to liability insurance;\n(4) designed solely to provide coverage for a specified disease or illness or to provide payments on a per diem, fixed indemnity, or non-expense-incurred basis, if offered as independent, noncoordinated coverage;\n(5) credit accident and health insurance as defined in section 62B.02;\n(6) designed solely to provide dental or vision care;\n(7) blanket accident and sickness insurance as defined in section 62A.11;\n(8) accident-only coverage;\n(9) a long-term care policy as defined in section 62A.46 or a qualified long-term care insurance policy as defined in section 62S.01;\n(10) Medicare-related coverage as defined in section 62Q.01, subdivision 6;\n(11) workers' compensation insurance; or\n(12) limited to care provided at on-site medical clinics operated by an employer for the benefit of the employer's employees and their dependents, in connection with which the employer does not transfer risk.\nFor the purpose of this chapter, a health benefit plan issued to eligible employees of a small employer who meets the participation requirements of section 62L.03, subdivision 3, is considered to have been issued to a small employer. A health benefit plan issued on behalf of a health carrier is considered to be issued by the health carrier.\n\"Health carrier\" means an insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01; a health service plan corporation licensed under chapter 62C; a health maintenance organization licensed under chapter 62D; a community integrated service network operating under chapter 62N; an accountable provider network regulated under chapter 62T; a fraternal benefit society operating under chapter 64B; a joint self-insurance employee health plan operating under chapter 62H; a multiple employer welfare arrangement, as defined in United States Code, title 29, section 1002(40), as amended. Any use of this definition in another chapter by reference does not include a community integrated service network, unless otherwise specified. For the purpose of this chapter, companies that are affiliated companies or that are eligible to file a consolidated tax return must be treated as one health carrier, except that any insurance company or health service plan corporation that is an affiliate of a health maintenance organization located in Minnesota, or any health maintenance organization located in Minnesota that is an affiliate of an insurance company or health service plan corporation, or any health maintenance organization that is an affiliate of another health maintenance organization in Minnesota, may treat the health maintenance organization as a separate health carrier.\n\"Health plan\" means a health plan as defined in section 62A.011 and includes individual and group coverage regardless of the size of the group, unless otherwise specified.\n[Repealed, 2013 c 84 art 1 s 94]\n\"Individual health plan\" has the meaning given in section 62A.011, subdivision 4.\n[Repealed, 2013 c 84 art 1 s 94]\n\"MCHA\" means the Minnesota Comprehensive Health Association established under section 62E.10.\n\"Medical necessity\" means the appropriate and necessary medical and hospital services eligible for payment under a health benefit plan as determined by a health carrier.\n\"Members\" means the health carriers operating in the small employer market who may participate in the association.\n[Repealed, 2013 c 84 art 1 s 94]\n[Repealed, 2013 c 84 art 1 s 94]\n\"Rating period\" means the 12-month period for which premium rates established by a health carrier are assumed to be in effect, as determined by the health carrier. During the rating period, a health carrier may adjust the rate based on the prorated change in the index rate.\n(a) \"Small employer\" means, with respect to a calendar year and a plan year, a person, firm, corporation, partnership, association, or other entity actively engaged in business in Minnesota, including a political subdivision of the state, that employed an average of at least one, not including a sole proprietor, but not more than 50 current employees on business days during the preceding calendar year and that employs at least one current employee, not including a sole proprietor, on the first day of the plan year. A small employer plan may be offered through a domiciled association to self-employed individuals and small employers who are members of the association, even if the self-employed individual or small employer has fewer than two current employees. Entities that are treated as a single employer under subsection (b), (c), (m), or (o) of section 414 of the federal Internal Revenue Code are considered a single employer for purposes of determining the number of current employees. Small employer status must be determined on an annual basis as of the renewal date of the health benefit plan. The provisions of this chapter continue to apply to an employer who no longer meets the requirements of this definition until the annual renewal date of the employer's health benefit plan. If an employer was not in existence throughout the preceding calendar year, the determination of whether the employer is a small employer is based upon the average number of current employees that it is reasonably expected that the employer will employ on business days in the current calendar year. For purposes of this definition, the term employer includes any predecessor of the employer. An employer that has more than 50 current employees but has 50 or fewer employees, as \"employee\" is defined under United States Code, title 29, section 1002(6), is a small employer under this subdivision.\n(b) Where an association, as defined in section 62L.045, comprised of employers contracts with a health carrier to provide coverage to its members who are small employers, the association and health benefit plans it provides to small employers, are subject to section 62L.045, with respect to small employers in the association, even though the association also provides coverage to its members that do not qualify as small employers.\n(c) If an employer has employees covered under a trust specified in a collective bargaining agreement under the federal Labor-Management Relations Act of 1947, United States Code, title 29, section 141, et seq., as amended, or employees whose health coverage is determined by a collective bargaining agreement and, as a result of the collective bargaining agreement, is purchased separately from the health plan provided to other employees, those employees are excluded in determining whether the employer qualifies as a small employer. Those employees are considered to be a separate small employer if they constitute a group that would qualify as a small employer in the absence of the employees who are not subject to the collective bargaining agreement.\n(d) Small group health plans offered through MNsure under chapter 62V to employees of a small employer are not considered individual health plans, regardless of whether the health plan is purchased using a defined contribution from the small employer.\n(a) \"Small employer market\" means the market for health benefit plans for small employers.\n(b) A health carrier is considered to be participating in the small employer market if the carrier offers, sells, issues, or renews a health benefit plan to: (1) any small employer; or (2) the eligible employees of a small employer offering a health benefit plan if, with the knowledge of the health carrier, either of the following conditions is met:\n(i) any portion of the premium or benefits is paid for or reimbursed by a small employer; or\n(ii) the health benefit plan is treated by the employer or any of the eligible employees or dependents as part of a plan or program for the purposes of the Internal Revenue Code, section 106, 125, or 162.\n\"Small employer plan\" means a health benefit plan issued by a health carrier to a small employer for coverage of the medical and hospital benefits described in section 62L.05.\n\"Waiting period\" means, with respect to an individual who is a potential enrollee under a health benefit plan, the period that must pass with respect to the individual before the individual is eligible, under the employer's eligibility requirements, for coverage under the health benefit plan.",
	"repealed": false
}