{
	"id": "17.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.59",
	"title": "17.59 FEES TO DEFRAY EXPENSES.",
	"text": "For the purpose of providing funds to defray the necessary expenses incurred by the commissioner and the council in formulating, submitting to referendum, issuing, administering and enforcing a promotional order, the promotional order shall provide for checkoff fees in amounts sufficient to defray such expenses, and shall indicate the maximum checkoff rate which shall not exceed one percent of the market value of the year's production of participating producers. Any increase in the maximum checkoff provided for in the promotional order must be within the limit herein prescribed and must be approved by the majority of voting participating producers in a referendum held for that purpose after reasonable notice of such proposed increase.\n(a) Notwithstanding subdivision 1, the Minnesota dairy research and promotion order, or any provision to the contrary in this chapter or rules adopted under this chapter, the checkoff rate applicable to the Dairy Research and Promotion Council must be equal to the maximum credit allowed under the Dairy Promotion and Research Order, adopted under the Dairy Production Stabilization Act of 1983, United States Code, title 7, sections 4501 to 4538, for producers participating in a qualified state or regional dairy product promotion or nutrition education program. The checkoff rate provided in this subdivision is effective and must be automatically adjusted without amendment to the Minnesota dairy research and promotion order.\n(b) Subdivision 1 applies for the establishment of the checkoff rate applicable to the Dairy Research and Promotion Council if:\n(1) the Dairy Production Stabilization Act of 1983 is repealed;\n(2) the Dairy Promotion and Research Order is suspended or terminated, in which case subdivision 1 applies only during the period of suspension or termination; or\n(3) the federal credit for participation in a qualified state or regional dairy product or nutrition education program is eliminated.\nThe commissioner shall establish the procedure for the timely payment of the checkoff fee by the producer to the council. The procedure shall be clearly outlined in the proposed promotional order. The procedure must be fair, reasonable and the checkoff fee shall be deducted by the first purchaser at the time of sale. The first purchaser shall submit to the council any checkoff fees so deducted once every 30 days in accordance with the commissioner's rules.\nThe commissioner shall require producers petitioning for a promotional order to deposit in advance an amount necessary to defray the expense of electing the first council, formulating an order, submitting it to referendum and issuing the order. Funds received for that purpose shall be deposited in the commodity research and promotion account. If the order is issued, the producers shall be reimbursed when funds are available from assessments. If the order is not issued the commissioner shall refund only that portion of the deposit remaining after payment of expenses incurred on a pro rata basis.\nCheckoff fees collected pursuant to sections 17.51 to 17.69 shall be deposited in a federally insured depository institution and shall be disbursed by the officers and employees approved by the council for the necessary expenses incurred in the administration of sections 17.51 to 17.69. Checkoff fees collected shall be used exclusively for the purpose collected and not to support or oppose a political party or a candidate for nomination or election to a public office.\nAll fees collected by the department under sections 17.51 to 17.69 and any other fees and income received by the department in the administration of these statutes shall be deposited in a separate account known as the commodity research and promotion account in the agricultural fund. Money in the account, including interest, is appropriated to the commissioner to carry out the duties of sections 17.51 to 17.69.",
	"repealed": false
}