{
	"id": "256L.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.06",
	"title": "256L.06 PREMIUM ADMINISTRATION.",
	"text": "[Repealed, 1998 c 407 art 5 s 48]\n[Repealed, 1998 c 407 art 5 s 48]\n(a) Premiums are dedicated to the commissioner for MinnesotaCare.\n(b) The commissioner shall develop and implement procedures to: (1) require enrollees to report changes in income; (2) adjust sliding scale premium payments, based upon both increases and decreases in enrollee income, at the time the change in income is reported; and (3) disenroll enrollees from MinnesotaCare for failure to pay required premiums. Failure to pay includes payment with a dishonored check, a returned automatic bank withdrawal, or a refused credit card or debit card payment. The commissioner may demand a guaranteed form of payment, including a cashier's check or a money order, as the only means to replace a dishonored, returned, or refused payment.\n(c) Premiums are calculated on a calendar month basis and may be paid on a monthly, quarterly, or semiannual basis, with the first payment due upon notice from the commissioner of the premium amount required. The commissioner shall inform applicants and enrollees of these premium payment options. Premium payment is required before enrollment is complete and to maintain eligibility in MinnesotaCare. Premium payments received before noon are credited the same day. Premium payments received after noon are credited on the next working day.\n(d) Nonpayment of the premium will result in disenrollment from the plan effective for the calendar month following the month for which the premium was due. Persons disenrolled for nonpayment may not reenroll prior to the first day of the month following the payment of an amount equal to two months' premiums.\n(e) The commissioner shall forgive the past-due premium for persons disenrolled under paragraph (d) prior to issuing a premium invoice for the fourth month following disenrollment.",
	"repealed": false
}