{
	"id": "144.555",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.555",
	"title": "144.555 FACILITY OR CAMPUS CLOSINGS, RELOCATING SERVICES, OR CEASING TO OFFER CERTAIN SERVICES; PATIENT RELOCATIONS.",
	"text": "If a facility licensed under sections 144.50 to 144.56, other than a hospital, voluntarily plans to cease operations or to curtail operations to the extent that patients or residents must be relocated, the controlling persons of the facility must notify the commissioner of health at least 90 days before the scheduled cessation or curtailment. The commissioner shall cooperate with the controlling persons and advise them about relocating the patients or residents.\n(a) The controlling persons of a hospital licensed under sections 144.50 to 144.56 or a hospital campus must notify the commissioner of health, the public, and others at least 182 days before the hospital or hospital campus voluntarily plans to implement one of the scheduled actions listed in paragraph (b), unless the controlling persons can demonstrate to the commissioner that meeting the advanced notice requirement is not feasible and the commissioner approves a shorter advanced notice.\n(b) The following scheduled actions require advanced notice under paragraph (a):\n(1) ceasing operations;\n(2) curtailing operations to the extent that patients must be relocated;\n(3) relocating the provision of health services to another hospital or another hospital campus; or\n(4) ceasing to offer maternity care and newborn care services, intensive care unit services, inpatient mental health services, or inpatient substance use disorder treatment services.\n(c) A notice required under this subdivision must comply with the requirements in subdivision 1d.\n(d) The commissioner shall cooperate with the controlling persons and advise them about relocating the patients.\nWithin 30 days after receiving notice under subdivision 1a, the commissioner shall conduct a public hearing on the scheduled cessation of operations, curtailment of operations, relocation of health services, or cessation in offering health services. The commissioner must provide adequate public notice of the hearing in a time and manner determined by the commissioner. The controlling persons of the hospital or hospital campus must participate in the public hearing. The public hearing must be held at a location that is within ten miles of the hospital or hospital campus or with the commissioner's approval as close as is practicable, and that is provided or arranged by the hospital or hospital campus. Video conferencing technology must be used to allow members of the public to view and participate in the hearing. The public hearing must include:\n(1) an explanation by the controlling persons of the reasons for ceasing or curtailing operations, relocating health services, or ceasing to offer any of the listed health services;\n(2) a description of the actions that controlling persons will take to ensure that residents in the hospital's or campus's service area have continued access to the health services being eliminated, curtailed, or relocated;\n(3) an opportunity for public testimony on the scheduled cessation or curtailment of operations, relocation of health services, or cessation in offering any of the listed health services, and on the hospital's or campus's plan to ensure continued access to those health services being eliminated, curtailed, or relocated; and\n(4) an opportunity for the controlling persons to respond to questions from interested persons.\n(a) Notwithstanding the time period in subdivision 1a by which notice must be provided to the commissioner and the public, the controlling persons of a hospital or hospital campus must notify the commissioner of health and the public as soon as practicable after deciding to take an action listed in subdivision 1a, paragraph (a), if the action is caused by:\n(1) a natural disaster or other emergency; or\n(2) an inability of the hospital to provide health services according to the applicable standard of care due to the hospital's inability to retain or secure essential staff after reasonable effort.\n(b) Notwithstanding the time period in subdivision 1b by which a public hearing must be held, the commissioner must hold a public hearing according to subdivision 1b as soon as practicable after the controlling persons of the hospital or hospital campus governed by this subdivision decide to take the action.\n(a) A notice required under subdivision 1a must be provided to patients, hospital personnel, the public, local units of government, and the commissioner of health using at least the following methods:\n(1) posting a notice of the proposed cessation of operations, curtailment, relocation of health services, or cessation in offering health services at the main public entrance of the hospital or hospital campus;\n(2) providing written notice to the commissioner of health, to the city council in the city where the hospital or hospital campus is located, and to the county board in the county where the hospital or hospital campus is located;\n(3) providing written notice to the local health department as defined in section 145A.02, subdivision 8b, for the community where the hospital or hospital campus is located;\n(4) providing notice to the public through a written public announcement which must be distributed to local media outlets;\n(5) providing written notice to existing patients of the hospital or hospital campus; and\n(6) notifying all personnel currently employed in the unit, hospital, or hospital campus impacted by the proposed cessation, curtailment, or relocation.\n(b) A notice required under subdivision 1a must include:\n(1) a description of the proposed cessation of operations, curtailment, relocation of health services, or cessation in offering health services. The description must include:\n(i) the number of beds, if any, that will be eliminated, repurposed, reassigned, or otherwise reconfigured to serve populations or patients other than those currently served;\n(ii) the current number of beds in the impacted unit, hospital, or hospital campus, and the number of beds in the impacted unit, hospital, or hospital campus after the proposed cessation, curtailment, or relocation takes place;\n(iii) the number of existing patients who will be impacted by the proposed cessation, curtailment, or relocation;\n(iv) any decrease in personnel, or relocation of personnel to a different unit, hospital, or hospital campus, caused by the proposed cessation, curtailment, or relocation;\n(v) a description of the health services provided by the unit, hospital, or hospital campus impacted by the proposed cessation, curtailment, or relocation; and\n(vi) identification of the three nearest available health care facilities where patients may obtain the health services provided by the unit, hospital, or hospital campus impacted by the proposed cessation, curtailment, or relocation, and any potential barriers to seamlessly transition patients to receive services at one of these facilities. If the unit, hospital, or hospital campus impacted by the proposed cessation, curtailment, or relocation serves medical assistance or Medicare enrollees, the information required under this item must specify whether any of the three nearest available facilities serves medical assistance or Medicare enrollees; and\n(2) a telephone number, email address, and address for each of the following, to which interested parties may offer comments on the proposed cessation, curtailment, or relocation:\n(i) the hospital or hospital campus; and\n(ii) the parent entity, if any, or the entity under contract, if any, that acts as the corporate administrator of the hospital or hospital campus.\nFailure to notify the commissioner under subdivision 1 may result in issuance of a correction order under section 144.653, subdivision 5.\n(a) Failure to participate in a public hearing under subdivision 1b or failure to notify the commissioner under subdivision 1c may result in issuance of a correction order under section 144.653, subdivision 5.\n(b) Notwithstanding any law to the contrary, the commissioner must impose on the controlling persons of a hospital or hospital campus a fine of $20,000 for each failure to provide notice to an individual or entity or at a location required under subdivision 1d, paragraph (a). The cumulative fines imposed under this paragraph must not exceed $60,000 for any scheduled action requiring notice under subdivision 1a. The commissioner is not required to issue a correction order before imposing a fine under this paragraph. Section 144.653, subdivision 8, applies to fines imposed under this paragraph.",
	"repealed": false
}