{
	"id": "115A.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.69",
	"title": "115A.69 POWERS.",
	"text": "A district shall have all powers necessary or convenient to perform its duties, including the powers provided in this section.\nThe district may sue and be sued, and shall be a public body within the meaning of chapter 562.\nThe district may acquire by purchase, lease, condemnation, gift, or grant, any right, title, and interest in and to real or personal property deemed necessary for the exercise of its powers or the accomplishment of its purposes, including positive and negative easements and water and air rights. Any local government unit and the commissioners of transportation, natural resources, and administration may convey to or permit the use of any property or facilities by the district, subject to the rights of the holders of any bonds issued with respect thereto, with or without compensation and without an election or approval by any other government agency. The district may hold the property for its purposes, and may lease or rent the property so far as not needed for its purposes, upon the terms and in the manner as it deems advisable. The right to acquire lands and property rights by condemnation shall be exercised in accordance with chapter 117. The district may take possession of any property for which condemnation proceedings have been commenced at any time after the issuance of a court order appointing commissioners for its condemnation.\nWhenever the district deems it necessary to the accomplishment of its purposes, the district or any member, employee, or agent thereof, when authorized by it, may enter upon any property, public or private, for the purpose of obtaining information or conducting surveys or investigations, provided that the entrance and activity is undertaken after reasonable notice and during normal business hours and provided that compensation is made for any damage to the property caused by the entrance and activity.\nThe district may apply for and accept gifts, loans, or other property from the United States, the state, or any person for any of its purposes, may enter into any agreement required in connection therewith, and may hold, use, and dispose of the money or property in accordance with the terms of the gift, grant, loan or agreement.\nAny real or personal property owned, used, or occupied by the district for any authorized purpose is declared to be acquired, owned, used and occupied for public and governmental purposes, and shall be exempted from taxation by the state or any political subdivision of the state, except to the extent that the property is subject to the sales and use tax under chapter 297A, provided that those properties shall be subject to special assessments levied by a political subdivision for a local improvement in amounts proportionate to and not exceeding the special benefit received by the properties from the improvement. No possible use of the properties in any manner different from their use for solid waste management at the time shall be considered in determining the special benefit received by the properties.\nThe district may construct, equip, develop, enlarge, improve, and operate solid waste facilities and services as it deems necessary and may negotiate contracts for the use of public or private facilities and services. The district shall contract with private persons for the construction, maintenance, and operation of facilities and services where the facilities and services are adequate and available for use and competitive with other means of providing the same service.\nThe district may establish and collect rates and charges for the facilities and services provided by the district and may negotiate and collect rates and charges for facilities and services contracted for by the district. The board of directors of the district may agree with the holders of district obligations which are secured by revenues of the district as to the maximum or minimum amounts which the district shall charge and collect for services provided by the district. Before establishing or raising any rates and charges, the board of directors shall hold a public hearing regarding the proposed rates and charges. Notice of the hearing shall be published at least once in a legal newspaper of general circulation throughout the area affected by the rates and charges. Publication shall be no more than 45 days and no less than 15 days prior to the date of the hearing.\nThe district may sell or otherwise dispose of any real or personal property acquired by it which is no longer required for accomplishment of its purposes. The property shall be sold in the manner provided by section 469.065, insofar as practical. The district shall give notice of sale which it deems appropriate. When the district determines that any property which has been acquired from a government unit without compensation is no longer required, the district shall transfer it to the government unit.\nThe district may use, sell, or otherwise dispose of all of the products and energy produced by its facilities. Section 471.345 shall not apply to the sale of products and energy. The district shall give particular consideration to the needs of purchasers in this state and shall actively promote sales to such purchasers so long as this can be done at prices and under conditions that meet constitutional requirements and that are consistent with the district's object of being financially self supporting to the greatest extent possible.\nThe district may enter into any contract necessary or proper for the exercise of its powers or the accomplishment of its purposes.\nThe district may act under the provisions of section 471.59, or any other law providing for joint or cooperative action between government units.\nThe district may conduct research studies and programs, collect and analyze data, prepare reports, maps, charts, and tables, and conduct all necessary hearings and investigations in connection with its work and may advise and assist other government units on planning matters within the scope of its powers, duties, and objectives.\nThe district may employ persons or firms and contract for services to perform engineering, legal, or other services necessary to carry out its functions.\nThe district may require any employee to obtain and file with it an individual bond or fidelity insurance policy. It may procure insurance in amounts it deems necessary to insure against liability of the board of directors and employees or both, for personal injury or death and property damage or destruction, with the force and effect stated in chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property as it deems necessary.\nThe district may require that persons shall not acquire, construct, alter, reconstruct, or operate a solid waste facility within the district without prior consultation with and approval of the district.",
	"repealed": false
}