{
	"id": "65B.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.63",
	"title": "65B.63 ASSIGNED CLAIMS PLAN.",
	"text": "Reparation obligors providing basic economic loss insurance in this state shall organize and maintain, subject to approval and regulation by the commissioner, an assigned claims bureau and an assigned claims plan, and adopt rules for their operation and for the assessment of costs on a fair and equitable basis consistent with sections 65B.41 to 65B.71. The assigned claims bureau shall be managed by a governing committee made up of four individuals selected by the insurer members, one individual selected by the self-insurer members, and two public members appointed by the governor to two-year terms. Public members may include licensed insurance agents. If such obligors do not organize and continuously maintain an assigned claims bureau and an assigned claims plan in a manner considered by the commissioner of commerce to be consistent with sections 65B.41 to 65B.71, the commissioner shall organize and maintain an assigned claims bureau and an assigned claims plan. Each reparation obligor providing basic economic loss insurance in this state shall participate in the assigned claims bureau and the assigned claims plan. Costs incurred shall be allocated fairly and equitably among the reparation obligors.\nA ruling, action, or decision of the governing committee may be appealed to the commissioner within 30 days. A final action or order of the commissioner is subject to judicial review in the manner provided by chapter 14. In lieu of an appeal to the commissioner, judicial review of the governing committee's ruling, action, or decision may be sought.\nThe assigned claims bureau shall promptly assign each claim and notify the claimant of the identity and address of the assignee-obligor of the claim. Claims shall be assigned so as to minimize inconvenience to claimants. The assignee thereafter has rights and obligations as if the assignee had issued a policy of basic economic loss insurance complying with sections 65B.41 to 65B.71 applicable to the injury or, in case of financial inability of a reparation obligor to perform its obligations, as if the assignee had written the applicable reparation insurance, undertaken the self-insurance, or lawfully obligated itself to pay basic economic loss benefits.",
	"repealed": false
}