{
	"id": "176.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.137",
	"title": "176.137 REMODELING OF RESIDENCE; DISABLED EMPLOYEES.",
	"text": "The employer shall furnish to an employee who is permanently disabled because of a personal injury suffered in the course of employment with that employer such alteration or remodeling of the employee's principal residence as is reasonably required to enable the employee to move freely into and throughout the residence and to otherwise adequately accommodate the disability. Any remodeling or alteration shall be furnished only when the division determines that the injury is to such a degree that the employee is substantially prevented from functioning within the principal residence.\nThe pecuniary liability of an employer for remodeling or alteration required by this section is limited to prevailing costs in the community for remodeling or alteration of that type. The costs of obtaining the architectural certification and supervision required by this section, or the costs of obtaining approval by a certified building official or certified accessibility specialist under subdivision 4, paragraph (b), clause (3), are included in the $150,000 limit in subdivision 5.\nWhere the alteration or remodeling of the employee's residence is not practicable, the award may be to purchase or lease a new or different residence if the new or different residence would better accommodate the disability.\n(a) Except as provided in paragraph (b), no award may be made except upon the certification of a licensed architect to the division that the proposed alteration or remodeling of an existing residence or the building or purchase of a new or different residence is reasonably required for the purposes specified in subdivision 1. The Council on Disability shall advise the division as provided in section 256.482, subdivision 5, clause (7). The alteration or remodeling of an existing residence, or the building or purchase of a new home must be done under the supervision of a licensed architect relative to the specific needs to accommodate the disability.\n(b) Remodeling or alteration projects do not require an architect's certification and supervision if the project is:\n(1) approved by the Council on Disability;\n(2) performed by a residential building contractor or residential remodeler licensed under section 326B.805, subdivision 1; and\n(3) approved by a certified building official or certified accessibility specialist under section 326B.133, subdivision 3a, paragraphs (b) and (d), who states in writing that the proposed remodeling or alterations are reasonably required to enable the employee to move freely into and throughout the residence and to otherwise accommodate the disability.\nAn employee is limited to $150,000 under this section for each personal injury.\nA proceeding to resolve a dispute under this section shall be initiated by petition under sections 176.271 and 176.291 and decided by a compensation judge at the office under section 176.305, 176.322, or 176.341. The decision of the compensation judge is appealable to the Workers' Compensation Court of Appeals under section 176.421.",
	"repealed": false
}