{
	"id": "160.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.27",
	"title": "160.27 PARTICULAR USES OF RIGHT-OF-WAY; MISDEMEANORS.",
	"text": "With the approval of the proper road authority, billboards for the use and purpose of displaying public notices only may be erected within the limits of any public highway, including city streets.\n(a) Benches and shelters for the convenience and comfort of persons waiting for streetcars or buses may be placed and maintained within the limits of any street or highway, including streets and highways within cities, when a license, permit, or franchise therefor is first obtained from the road authority. The owners may place advertising on the benches and shelters if authorized by the license, permit, or franchise, provided that advertising on shelters shall be limited to one-third of the vertical surface of the shelter. The benches shall not be placed or maintained on the portion of the highway or street prepared and maintained for vehicle traffic.\n(b) The council of any city may, by public negotiation or bid, grant franchises for the construction, operation, or maintenance of bus shelters and benches on streets and highways within the city. The franchises shall be granted subject to terms and conditions as the city may prescribe, including the payment of compensation to the city. This provision does not preclude the requirement for obtaining permits from the appropriate road authority having jurisdiction for construction within the limits of any trunk highway, county highway, or county state-aid highway.\n(c) On streets and highways outside of cities, the road authority may, by public negotiation or bid, grant franchises for the construction, operation, or maintenance of bus shelters and benches on streets and highways within the road authority's jurisdiction. The franchises shall be granted subject to terms and conditions as the road authority may prescribe, including the payment of compensation to the road authority.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\nUnited States customs inspection facilities may be placed and maintained within the limits of any public highway, including city streets, when a written permit is issued for such facilities by the proper road authority.\n[Renumbered 160.2715]\nThe road authorities may take down, remove, or destroy any advertisement, building, or structure in or upon any highway in violation of this section and section 160.2715.\n(a) For purposes of this subdivision, \"micromobility facility\" means an installation for micromobility devices as defined in section 169.011, subdivision 40b, whether for personal use or shared mobility services, that provides one or more of the following: a rack or docking station, a battery charging or swapping station, or a storage facility.\n(b) In a statutory or home rule charter city, advertisements, public art, and informational signs may be placed and maintained on a micromobility facility if:\n(1) a road authority has issued a permit to the city authorizing the micromobility facility to be placed within the right-of-way of a public highway;\n(2) the city has recommended and the road authority has authorized in the permit the placement of advertisements, public art, and informational signs on the micromobility facility; and\n(3) the placement does not create an unsafe situation.\n(c) Advertisements, public art, and information signs authorized under this subdivision are subject to the terms and conditions imposed by the road authority authorizing their placement.\n(a) For purposes of this subdivision, \"shared electric vehicle facility\" means an installation for one or more parking spaces that is:\n(1) established as part of a shared mobility service;\n(2) identified for use by all-electric vehicles as defined in section 169.011, subdivision 1a; and\n(3) equipped to recharge an all-electric vehicle, recharge an all-electric vehicle energy storage device, or provide for swapping an all-electric vehicle battery.\n(b) In a statutory or home rule charter city, advertisements, public art, and informational signs may be placed and maintained on a shared electric vehicle facility if:\n(1) a road authority has issued a permit to the city authorizing the shared electric vehicle facility to be placed within the right-of-way of a public highway;\n(2) the city has recommended and the road authority has authorized in the permit the placement of advertisements, public art, and informational signs on the shared electric vehicle facility; and\n(3) the placement does not create an unsafe situation.\n(c) Advertisements, public art, and information signs authorized under this subdivision are subject to the terms and conditions imposed by the road authority authorizing their placement.\n(a) The commissioner may restrict the use of, or close, any state trunk highway for the protection and safety of the public or for the protection of the highway from damage during and after storms if there is danger of the road becoming impassable or if visibility is so limited that safe travel is unlikely.\n(b) To notify the public that a trunk highway is closed or its use restricted, the commissioner shall give notice by one or more of the following methods:\n(1) erect suitable barriers or obstructions on the highway;\n(2) post warnings or notices of the closing or restricting of a trunk highway;\n(3) place signs to warn, detour, direct, or otherwise control traffic on the highway; or\n(4) place personnel to warn, detour, direct, or otherwise control traffic on the highway.\n(a) A person is civilly liable for rescue costs if the person (1) fails to obey the direction or instruction of authorized personnel at the location of the closed highway, or (2) drives over, through, or around a barricade, fence, or obstruction erected to prevent traffic from passing over a portion of a highway closed to public travel. \"Civilly liable for rescue costs\" means that the person is liable to a state agency or political subdivision for costs incurred for the purpose of rescuing the person, any passengers, or the vehicle. Civil liability may be imposed under this subdivision in addition to the misdemeanor penalty imposed under section 160.2715. However, civil liability must not exceed $10,000. A fine paid by a defendant in a misdemeanor action that arose from the same violation may not be applied toward payment of the civil liability imposed under this subdivision.\n(b) A state agency or political subdivision that incurs costs as described in paragraph (a) may bring an action to recover the civil liability and related legal, administrative, and court costs. A civil action may be commenced as is any civil action.\n(a) In connection with the use of road right-of-way controlled by the commissioner, excluding on controlled-access highways under section 160.08, a property owner or occupant of property may apply for a permit for temporary placement, for up to 14 days, of a pressurized flexible force main to transport manure for field application.\n(b) The property owner or occupant must:\n(1) identify the entire length of the right-of-way for use under the permit;\n(2) place the force main within the backslope of the right-of-way where possible;\n(3) place pumping equipment outside the right-of-way; and\n(4) meet all of the permit requirements identified by the commissioner.\n(c) Once the commissioner has issued a permit, the property owner or occupant may place the force main over the length of the right-of-way from the permittee's property to where the manure will be applied, irrespective of whether the permittee is the owner or occupant of all property abutting the portion of the right-of-way where the force main is to be placed.\n(d) The commissioner may restrict the number of force mains simultaneously located in the same right-of-way.\n(a) A local road authority may, by ordinance, establish a permitting process to authorize the placement of pressurized flexible force main within right-of-way under the jurisdiction of the local road authority to transport manure for field application. A town board must be authorized to adopt the ordinance at an annual town meeting. A local road authority must not impose a fee or other charge for the permit. A permit issued under the ordinance is valid for one year or longer as specified by the local road authority.\n(b) A local road authority that has adopted an ordinance providing for a permitting process must issue a permit to any property owner or occupant who applies for a permit if:\n(1) the applicant submits a complete application at least five days prior to the day the applicant intends to place the force main within the identified right-of-way or a shorter time if approved by the road authority; and\n(2) the requirements under subdivision 13 are met.\nWhen the local road authority has not adopted an ordinance establishing a permitting process under subdivision 11, an owner or occupant may place a pressurized flexible force main within right-of-way under the jurisdiction of the local road authority to transport manure for field application if:\n(1) the local road authority has not notified the owner or occupant of scheduled road authority maintenance activities that would be unduly interfered with if the placement occurred during the maintenance activity; and\n(2) the requirements under subdivision 13 are met.\nThe following requirements apply when a force main is placed in a road right-of-way under subdivision 11 or 12:\n(1) the owner or occupant must provide, at least one business day prior to placement of the force main, written or electronic notice to the local road authority of the intent to place a force main within an identified right-of-way;\n(2) unless specifically authorized, the force main must not be left in a right-of-way for more than 21 consecutive days;\n(3) the owner or occupant must identify and notify the local road authority of the intended starting and end points, and the path of the intended placement;\n(4) the owner or occupant must provide to the local road authority the intended starting and ending dates the force main will be placed in the right-of-way;\n(5) unless otherwise instructed by the applicable local road authority, the owner or occupant must place the force main in the backslope of the right-of-way to the extent possible;\n(6) unless specifically instructed otherwise, the owner or occupant must place all pumping equipment outside of the right-of-way;\n(7) the identified right-of-way must not be a controlled-access highway under section 160.08;\n(8) the owner or occupant must provide the local road authority (i) the owner or occupant's full name, address, and phone number where the owner or occupant can be reached during the time the force main is placed within the right-of-way, and (ii) any other contact information where the owner or occupant can be reached after the force main has been removed from the right-of-way;\n(9) field application must be performed by the holder of a valid commercial animal waste technician applicator license under section 18C.430, including proof of financial responsibility;\n(10) the force main placement must not unreasonably interfere with: (i) another landowner or occupant's access to the owner or occupant's property; (ii) the safe use of the right-of-way in which the force main is placed; (iii) the safe use of any driveway or private road that the force main crosses; or (iv) maintenance activities authorized by the local road authority;\n(11) no prior notice under clause (1) or permit under subdivision 11 is required if the placement of the force main is necessary to prevent overflow of a manure lagoon or manure storage pond or to deal with emergency pumping activities created by flooding, natural disaster, or declared emergency. The owner or occupant must make a good faith effort to notify the local road authority of emergency placement and operation of a force main under this clause, and must remove the force main within three days following the end of the impending overflow, flood, natural disaster response, or declared emergency;\n(12) the local road authority may remove or have removed, at the owner or occupant's expense, any force main remaining in a right-of-way beyond the number of days authorized under this section;\n(13) the owner or occupant is responsible for restoring the right-of-way to the preplacement condition, including the immediate cleanup of any spillage or leakage of manure into the right-of-way; and\n(14) a local road authority may, by ordinance, restrict the number of force mains simultaneously located in the same right-of-way.\n(a) A commercial animal waste technician company licensed under section 18C.430 using a pressurized flexible force main for the transport of manure for field application under this section is liable for the costs of cleanup and repair for any spill or damage caused by a commercial animal waste technician applicator during the placement, use, or removal of the force main.\n(b) Neither the commissioner nor any city, county, or town road authority is subject to any cause of action arising from the placement or operation of a pressurized flexible force main under this section.",
	"repealed": false
}