{
	"id": "126C.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.69",
	"title": "126C.69 CAPITAL GRANTS AND LOANS.",
	"text": "Capital grants and loans are available only to qualifying districts. Capital grants and loans must not be used for the construction of swimming pools, ice arenas, athletic facilities, auditoriums, bus garages, or heating system improvements. Proceeds of the grants and loans may be used only for sites for education facilities and for acquiring, bettering, furnishing, or equipping education facilities. Contracts must be entered into within 18 months after the date on which each grant and loan is approved. For purposes of this section, \"education facilities\" includes space for Head Start programs and social service programs.\nBeginning July 1, 2020, a district is not eligible for a capital grant and loan unless the district's estimated net debt tax rate as computed by the commissioner after debt service equalization aid would be more than 41.98 percent of adjusted net tax capacity. The estimate must assume a 20-year maturity schedule for new debt.\nA district or a joint powers district that intends to apply for a capital grant and loan must submit a proposal to the commissioner for review and comment according to section 123B.71 by July 1 of an odd-numbered year. The commissioner shall prepare a review and comment on the proposed facility, regardless of the amount of the capital expenditure required to construct the facility. In addition to the information provided under section 123B.71, subdivision 9, the commissioner shall require that predesign packages comparable to those required under section 16B.335 be prepared by the applicant school district. The predesign packages must be sufficient to define the scope, cost, and schedule of the project and must demonstrate that the project has been analyzed according to appropriate space needs standards and also consider the following criteria in determining whether to make a positive review and comment.\n(a) To grant a positive review and comment the commissioner shall determine that all of the following conditions are met:\n(1) the facilities are needed for pupils for whom no adequate facilities exist or will exist;\n(2) there is evidence to indicate that the facilities will have a useful public purpose for at least the term of the bonds;\n(3) no form of cooperation with another district would provide the necessary facilities;\n(4) the facilities are comparable in size and quality to facilities recently constructed in other districts that have similar enrollments;\n(5) the facilities are comparable in size and quality to facilities recently constructed in other districts that are financed without a capital loan;\n(6) the district is projected to have adequate funds in its general operating budget to support a quality education for its students for at least the next five years;\n(7) the current facility poses a threat to the life, health, and safety of pupils, and cannot reasonably be brought into compliance with fire, health, or life safety codes;\n(8) the district has made a good faith effort, as evidenced by its maintenance expenditures, to adequately maintain the existing facility during the previous ten years and to comply with fire, health, and life safety codes and state and federal requirements for accessibility for people with disabilities;\n(9) the district has made a good faith effort to encourage integration of social service programs within the new facility;\n(10) evaluations by boards of adjacent districts have been received; and\n(11) the proposal includes a comprehensive technology plan that assures information access for the students, parents, and community.\n(b) The commissioner may grant a negative review and comment if:\n(1) the state demographer has examined the population of the communities to be served by the facility and determined that the communities have not grown during the previous five years;\n(2) the state demographer determines that the economic and population bases of the communities to be served by the facility are not likely to grow or to remain at a level sufficient, during the next ten years, to ensure use of the entire facility;\n(3) the need for facilities could be met within the district or adjacent districts at a comparable cost by leasing, repairing, remodeling, or sharing existing facilities or by using temporary facilities;\n(4) the district plans do not include cooperation and collaboration with health and human services agencies and other political subdivisions; or\n(5) if the application is for new construction, an existing facility that would meet the district's needs could be purchased at a comparable cost from any other source within the area.\nIn addition to the requirements of subdivision 3, the commissioner may use additional requirements to determine a positive review and comment on projects that are designed to serve more than one district. These requirements may include:\n(1) reducing or increasing the number of districts that plan to use the facility;\n(2) location of the facility; and\n(3) formation of a joint powers agreement among the participating districts.\nThe district must present the proposed project to the board of each adjacent district at a public meeting of that district. The board of an adjacent district must make a written evaluation of how the project will affect the future education and building needs of the adjacent district. The board must submit the evaluation to the applying district within 30 days of the meeting.\nThe school board of a district desiring a capital grant and loan shall adopt a resolution stating the amount proposed to be funded, the purpose for which the funding is requested, and an estimate of the dates when the facilities for which the funding is requested will be contracted for and completed. Applications for grants and loans must be accompanied by a copy of the adopted board resolution and copies of the adjacent district evaluations. The commissioner shall retain the evaluation as part of a permanent record of the district submitting the evaluation.\nApplications must be in the form and accompanied by the additional data required by the commissioner. Applications must be received by the commissioner by September 1 of an odd-numbered year. A district must resubmit an application each odd-numbered year. Capital grant and loan applications that do not receive voter approval or are not approved in law cancel July 1 of the year following application. When an application is received, the commissioner shall obtain from the commissioner of revenue the information in the Revenue Department's official records that is required to be used in computing the debt limit of the district under section 475.53, subdivision 4.\nBy November 1 of each odd-numbered year, the commissioner must review all applications for capital grants and loans that have received a positive review and comment. When reviewing applications, the commissioner must consider whether the criteria in subdivision 3 have been met. The commissioner may not approve an application if all of the required deadlines have not been met. The commissioner may either approve or reject an application for a capital grant and loan.\nThe commissioner shall examine and consider applications for capital grants and loans that have been approved and promptly notify any district rejected of the decision.\nThe commissioner shall report each capital grant and loan that has been approved by the commissioner and that has received voter approval to the education committees of the legislature by January 1 of each even-numbered year. The commissioner must not report a capital grant and loan that has not received voter approval. The commissioner shall also report on the money remaining in the capital loan account and, if necessary, request that another bond issue be authorized.\n(a) A grant and loan must not be recommended for approval for a district exceeding an amount computed as follows:\n(1) the amount requested by the district under subdivision 6;\n(2) plus the aggregate principal amount of general obligation bonds of the district outstanding on June 30 of the year following the year the application was received, not exceeding the limitation on net debt of the district in section 475.53, subdivision 4, or 637 percent of its adjusted net tax capacity as most recently determined, whichever is less;\n(3) less the maximum net debt permissible for the district on December 1 of the year the application is received, under the limitation in section 475.53, subdivision 4, or 637 percent of its adjusted net tax capacity as most recently determined, whichever is less;\n(4) less any amount by which the amount voted exceeds the total cost of the facilities for which the grant and loan is approved.\n(b) The grant and loan may be approved in an amount computed as provided in paragraph (a), clauses (1) to (3), subject to later reduction according to paragraph (a), clause (4).\n(c) The loan amount equals the lesser of the total grant and loan approved or:\n(1) the product of the maximum effort tax rate times 50 times the district's most recent adjusted net tax capacity at the time the capital grant and loan is approved under subdivision 10, minus\n(2) the district's capital loan balance outstanding at the time the capital grant and loan is approved under subdivision 10, minus\n(3) the district's principal and interest balance outstanding for eligible bonds issued for prior capital projects at the time the capital loan and grant is approved.\n(d) The grant amount equals the difference between the total grant and loan approved and the loan amount under paragraph (c).\nEach capital grant and loan must be approved in a law.\nIf the aggregate amount of the capital grants and loans exceeds the amount that is or can be made available, the commissioner shall allot the available amount among any number of qualified applicant districts, according to the commissioner's judgment and discretion, based upon the districts' respective needs.\nAfter receipt of the review and comment on the project and before January 1 of the even-numbered year, the question authorizing the borrowing of money for the facilities must be submitted by the school board to the voters of the district at a regular or special election. The question submitted must state the total amount to be borrowed from all sources. Approval of a majority of those voting on the question is sufficient to authorize the issuance of the obligations on public sale in accordance with chapter 475. The face of the ballot must include the following statement: \"APPROVAL OF THIS QUESTION DOES NOT GUARANTEE THAT THE SCHOOL DISTRICT WILL RECEIVE A CAPITAL GRANT AND LOAN FROM THE STATE. THE GRANT AND LOAN MUST BE APPROVED BY THE STATE LEGISLATURE AND IS DEPENDENT ON AVAILABLE FUNDING.\" The district must mail to the commissioner a certificate by the clerk showing the vote at the election.\n(a) Each capital grant and loan must be evidenced by a contract between the district and the state acting through the commissioner. The contract must obligate the state to reimburse the district, from the maximum effort school loan fund, for eligible capital expenses for construction of the facility for which the grant and loan is approved, an amount computed as provided in subdivision 9. The commissioner must receive from the district a certified resolution of the board estimating the costs of construction and reciting that contracts for construction of the facilities for which the grant and loan is approved have been awarded, that bonds of the district have been issued and sold or that other district funds have been set aside in the amount necessary to pay all estimated costs of construction in excess of the amount of the grant and loan, and that all work, when completed, meets or exceeds standards established in the State Building Code. The contract must obligate the district to repay the loan out of the excesses of its maximum effort debt service levy over its required debt service levy. Beginning July 1, 2020, no interest assessments shall be made on capital loan balances.\n(b) The district must each year, as long as it is indebted to the state, levy for debt service (i) the amount of its maximum effort debt service levy or (ii) the amount of its required debt service levy, whichever is greater. The district shall remit payments to the commissioner according to section 126C.71. The actual debt service levy shall be adjusted under section 477A.09.\n(c) The commissioner shall supervise the collection of outstanding accounts due the fund and may, by notice to the proper county auditor, require the maximum levy to be made as required in this subdivision. By September 30, the commissioner shall notify the county auditor of each county containing taxable property situated within the district of the amount of the maximum effort debt service levy of the district for that year. The county auditor or auditors shall extend upon the tax rolls an ad valorem tax upon all taxable property within the district in the aggregate amount so certified.\nIf any capital loan is not paid within 50 years after it is granted from maximum effort debt service levies in excess of required debt service levies, the liability of the district on the loan is satisfied and discharged and interest on the loan ceases.\nThe district must file a copy of the capital loan contract with the county auditor of each county in which any part of the district is situated. The county auditor shall enter the capital loan, evidenced by the contract, in the auditor's bond register. The commissioner shall keep a record of each capital grant and loan contract showing the name and address of the district, the date of the contract, and the amount of the grant and loan initially approved. On receipt of the resolution required in subdivision 12 and documentation of expenditures under the contract, the commissioner shall issue payments on the capital grant and loan account for the amount that may be disbursed under subdivision 1.\n(a) A district having an outstanding state loan must not issue and sell any bonds on the public market, except to refund state loans, unless it agrees to make the maximum effort debt service levy in each later year at the higher rate provided in section 126C.63, subdivision 8, and unless it schedules the maturities of the bonds according to section 475.54, subdivision 2. A district that refunds bonds at a lower interest rate may continue to make the maximum effort debt service levy in each later year at the current rate provided in section 126C.63, subdivision 8, if the district can demonstrate to the commissioner's satisfaction that the district's repayments of the state loan will not be reduced below the previous year's level. The district must report each sale to the commissioner.\n(b) For a capital loan issued prior to July 1, 2001, after the district's capital loan has been outstanding for 30 years, the district must not issue bonds on the public market except to refund the loan.\n(c) For a capital loan issued on or after July 1, 2001, after the district's capital loan has been outstanding for 20 years, the district must not issue bonds on the public market except to refund the loan.",
	"repealed": false
}