{
	"id": "376.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/376.06",
	"title": "376.06 SUPERINTENDENT, HOSPITAL BOARD; DUTIES.",
	"text": "A county board which has purchased and constructed buildings for hospital purposes may operate these buildings as a hospital and may appoint a superintendent. The board shall set the superintendent's salary, term of employment, and powers and duties; provide for the management and operation of the hospital; and operate, control, and manage the hospital. The superintendent shall serve at the pleasure of the board. If the board determines that it is in the public interest, it may appoint a hospital board of at least three, but not more than nine members, who may include some or all of the county commissioners except as otherwise provided in subdivision 2. Persons appointed to the hospital board must reside in the hospital's service area and 80 percent of the board members, including any commissioners appointed to serve on the hospital board, must be residents of the county. The hospital board serves without compensation unless the county board authorizes the payment of compensation and reimbursement of expenses for service on the hospital board. Notwithstanding section 375.44, if compensation and reimbursement are authorized, they shall be the same as authorized for service on the local social services agency. Subject to its supervision, the county board may commit the care, management, and operation of the hospital to the hospital board. The county board may provide for the organization and regulation of the hospital board, its duties and the duties of the members, and regulations for the management, operation, and control of the hospital. The county board may lease the hospital grounds and buildings to a nonprofit or governmental hospital organization for terms it considers advisable.\nA county commissioner may be appointed by the county board to any hospital board under sections 376.009 to 376.09 except for any hospital board operating a county hospital located in a city of the first class.",
	"repealed": false
}