{
	"id": "142B.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.65",
	"title": "142B.65 CHILD CARE CENTER TRAINING REQUIREMENTS.",
	"text": "(a) The child care center license holder must ensure that the director, staff persons, substitutes, and unsupervised volunteers are given orientation training and successfully complete the training before starting assigned duties. The orientation training must include information about:\n(1) the center's philosophy, child care program, and procedures for maintaining health and safety according to section 142B.66 and Minnesota Rules, part 9503.0140, and handling emergencies and accidents according to Minnesota Rules, part 9503.0110;\n(2) specific job responsibilities;\n(3) the behavior guidance standards in Minnesota Rules, part 9503.0055;\n(4) the reporting responsibilities in chapter 260E and Minnesota Rules, part 9503.0130;\n(5) the center's drug and alcohol policy under section 142B.10, subdivision 1, paragraph (c);\n(6) the center's risk reduction plan as required under section 142B.54, subdivision 2;\n(7) at least one-half hour of training on the standards under section 142B.46 and on reducing the risk of sudden unexpected infant death as required in subdivision 6, if applicable;\n(8) at least one-half hour of training on the risk of abusive head trauma as required for the director and staff under subdivision 7, if applicable; and\n(9) training required by a child's individual child care program plan as required under Minnesota Rules, part 9503.0065, subpart 3, if applicable.\n(b) In addition to paragraph (a), before having unsupervised direct contact with a child, the director and staff persons within the first 90 days of employment, and substitutes and unsupervised volunteers within 90 days after the first date of direct contact with a child, must complete:\n(1) pediatric first aid, in accordance with subdivision 4; and\n(2) pediatric cardiopulmonary resuscitation, in accordance with subdivision 5.\n(c) In addition to paragraph (b), the director and staff persons within the first 90 days of employment, and substitutes and unsupervised volunteers within 90 days from the first date of direct contact with a child, must complete training in child development, in accordance with subdivision 3.\n(d) The license holder must ensure that documentation, as required in subdivision 10, identifies the number of hours completed for each topic with a minimum training time identified, if applicable, and that all required content is included.\n(e) Training in this subdivision must not be used to meet in-service training requirements in subdivision 9.\n(f) Training completed within the previous 12 months under paragraphs (a), clauses (7) and (8), and (c) are transferable to another child care center.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Substitute\" means an adult who is temporarily filling a position as a director, teacher, assistant teacher, or aide in a licensed child care center for less than 240 hours total in a calendar year due to the absence of a regularly employed staff person.\n(c) \"Staff person\" means an employee of a child care center who provides direct contact services to children.\n(d) \"Unsupervised volunteer\" means an individual who:\n(1) assists in the care of a child in care;\n(2) is not under the continuous direct supervision of a staff person; and\n(3) is not employed by the child care center.\n(a) The director and all staff persons, substitutes, and unsupervised volunteers shall complete child development and learning training within the first 90 days of employment. The director and staff persons, not including substitutes, must complete at least two hours of training on child development and learning. The training for substitutes and unsupervised volunteers is not required to be of a minimum length. For purposes of this subdivision, \"child development and learning training\" means any training in Knowledge and Competency Area I: Child Development and Learning, which is training in understanding how children develop physically, cognitively, emotionally, and socially and learn as part of the children's family, culture, and community.\n(b) Notwithstanding paragraph (a), individuals are exempt from this requirement if they:\n(1) have taken a three-credit college course on early childhood development within the past five years;\n(2) have received a baccalaureate or master's degree in early childhood education or school-age child care within the past five years;\n(3) are licensed in Minnesota as a prekindergarten teacher, an early childhood educator, a kindergarten to sixth grade teacher with a prekindergarten specialty, an early childhood special education teacher, or an elementary teacher with a kindergarten endorsement; or\n(4) have received a baccalaureate degree with a Montessori certificate within the past five years.\n(c) The director and staff persons, not including substitutes, must complete at least two hours of child development and learning training every second calendar year.\n(d) Substitutes and unsupervised volunteers must complete child development and learning training every second calendar year. There is no minimum number of training hours required.\n(e) Except for training required under paragraph (a), training completed under this subdivision may be used to meet the in-service training requirements under subdivision 9.\n(a) Unless training has been completed within the previous two years, the director, staff persons, substitutes, and unsupervised volunteers must satisfactorily complete pediatric first aid training prior to having unsupervised direct contact with a child, but not to exceed the first 90 days of employment.\n(b) Pediatric first aid training must be repeated at least every second calendar year. First aid training under this subdivision must be provided by an individual approved as a first aid instructor and must not be used to meet in-service training requirements under subdivision 9.\n(a) Unless training has been completed within the previous two years, the director, staff persons, substitutes, and unsupervised volunteers must satisfactorily complete pediatric cardiopulmonary resuscitation (CPR) training that meets the requirements of this subdivision. Pediatric CPR training must be completed prior to having unsupervised direct contact with a child, but not to exceed the first 90 days of employment.\n(b) Pediatric CPR training must be provided by an individual approved to provide pediatric CPR instruction.\n(c) The pediatric CPR training must:\n(1) cover CPR techniques for infants and children and the treatment of obstructed airways;\n(2) include instruction, hands-on practice, and an in-person, observed skills assessment under the direct supervision of a CPR instructor; and\n(3) be developed by the American Heart Association, the American Red Cross, or another organization that uses nationally recognized, evidence-based guidelines for CPR.\n(d) Pediatric CPR training must be repeated at least once every second calendar year.\n(e) Pediatric CPR training in this subdivision must not be used to meet in-service training requirements under subdivision 9.\n(a) Before caring for infants, the director, staff persons, substitutes, unsupervised volunteers, and any other volunteers must receive training on the standards under section 142B.46 and on reducing the risk of sudden unexpected infant death during orientation and each calendar year thereafter.\n(b) Sudden unexpected infant death reduction training required under this subdivision must be at least one-half hour in length. At a minimum, the training must address the risk factors related to sudden unexpected infant death, means of reducing the risk of sudden unexpected infant death in child care, and license holder communication with parents regarding reducing the risk of sudden unexpected infant death.\n(c) Except if completed during orientation, training taken under this subdivision may be used to meet the in-service training requirements under subdivision 9.\n(a) Before caring for children under school age, the director, staff persons, substitutes, and unsupervised volunteers must receive training on the risk of abusive head trauma during orientation and each calendar year thereafter.\n(b) Abusive head trauma training under this subdivision must be at least one-half hour in length. At a minimum, the training must address the risk factors related to shaking infants and young children, means to reduce the risk of abusive head trauma in child care, and license holder communication with parents regarding reducing the risk of abusive head trauma.\n(c) Except if completed during orientation, training taken under this subdivision may be used to meet the in-service training requirements under subdivision 9.\n(d) The commissioner shall make available for viewing a video presentation on the dangers associated with shaking infants and young children, which may be used in conjunction with the annual training required under paragraph (b).\n(a) Before a license holder transports a child or children under age eight in a motor vehicle, the person placing the child or children in a passenger restraint must satisfactorily complete training on the proper use and installation of child restraint systems in motor vehicles.\n(b) Training required under this subdivision must be repeated at least once every five years. At a minimum, the training must address the proper use of child restraint systems based on the child's size, weight, and age, and the proper installation of a car seat or booster seat in the motor vehicle used by the license holder to transport the child or children.\n(c) Training required under this subdivision must be provided by individuals who are certified and approved by the Department of Public Safety, Office of Traffic Safety. License holders may obtain a list of certified and approved trainers through the Department of Public Safety website or by contacting the agency.\n(d) Child care providers that only transport school-age children as defined in section 142B.01, subdivision 25, in child care buses as defined in section 169.448, subdivision 1, paragraph (e), are exempt from this subdivision.\n(e) Training completed under this subdivision may be used to meet in-service training requirements under subdivision 9. Training completed within the previous five years is transferable upon a staff person's change in employment to another child care center.\n(a) A license holder must ensure that the center director, staff persons, substitutes, and unsupervised volunteers complete in-service training each calendar year.\n(b) The center director and staff persons who work more than 20 hours per week must complete 24 hours of in-service training each calendar year. Staff persons who work 20 hours or less per week must complete 12 hours of in-service training each calendar year. Substitutes and unsupervised volunteers must complete the requirements of paragraphs (d) to (g) and do not otherwise have a minimum number of hours of training to complete.\n(c) The number of in-service training hours may be prorated for individuals not employed for an entire year.\n(d) Each year, in-service training must include:\n(1) the center's procedures for maintaining health and safety according to section 142B.66 and Minnesota Rules, part 9503.0140, and handling emergencies and accidents according to Minnesota Rules, part 9503.0110;\n(2) the reporting responsibilities under chapter 260E and Minnesota Rules, part 9503.0130;\n(3) at least one-half hour of training on the standards under section 142B.46 and on reducing the risk of sudden unexpected infant death as required under subdivision 6, if applicable; and\n(4) at least one-half hour of training on the risk of abusive head trauma from shaking infants and young children as required under subdivision 7, if applicable.\n(e) Each year, or when a change is made, whichever is more frequent, in-service training must be provided on: (1) the center's risk reduction plan under section 142B.54, subdivision 2; and (2) a child's individual child care program plan as required under Minnesota Rules, part 9503.0065, subpart 3.\n(f) At least once every two calendar years, the in-service training must include:\n(1) child development and learning training under subdivision 3;\n(2) pediatric first aid that meets the requirements of subdivision 4;\n(3) pediatric cardiopulmonary resuscitation training that meets the requirements of subdivision 5;\n(4) cultural dynamics training to increase awareness of cultural differences; and\n(5) disabilities training to increase awareness of differing abilities of children.\n(g) At least once every five years, in-service training must include child passenger restraint training that meets the requirements of subdivision 8, if applicable.\n(h) The remaining hours of the in-service training requirement must be met by completing training in the following content areas of the Minnesota Knowledge and Competency Framework:\n(1) Content area I: child development and learning;\n(2) Content area II: developmentally appropriate learning experiences;\n(3) Content area III: relationships with families;\n(4) Content area IV: assessment, evaluation, and individualization;\n(5) Content area V: historical and contemporary development of early childhood education;\n(6) Content area VI: professionalism;\n(7) Content area VII: health, safety, and nutrition; and\n(8) Content area VIII: application through clinical experiences.\n(i) For purposes of this subdivision, the following terms have the meanings given them.\n(1) \"Child development and learning training\" means training in understanding how children develop physically, cognitively, emotionally, and socially and learn as part of the children's family, culture, and community.\n(2) \"Developmentally appropriate learning experiences\" means creating positive learning experiences, promoting cognitive development, promoting social and emotional development, promoting physical development, and promoting creative development.\n(3) \"Relationships with families\" means training on building a positive, respectful relationship with the child's family.\n(4) \"Assessment, evaluation, and individualization\" means training in observing, recording, and assessing development; assessing and using information to plan; and assessing and using information to enhance and maintain program quality.\n(5) \"Historical and contemporary development of early childhood education\" means training in past and current practices in early childhood education and how current events and issues affect children, families, and programs.\n(6) \"Professionalism\" means training in knowledge, skills, and abilities that promote ongoing professional development.\n(7) \"Health, safety, and nutrition\" means training in establishing health practices, ensuring safety, and providing healthy nutrition.\n(8) \"Application through clinical experiences\" means clinical experiences in which a person applies effective teaching practices using a range of educational programming models.\n(j) The license holder must ensure that documentation, as required in subdivision 10, includes the number of total training hours required to be completed, name of the training, the Minnesota Knowledge and Competency Framework content area, number of hours completed, and the director's approval of the training.\n(k) In-service training completed by a staff person that is not specific to that child care center is transferable upon a staff person's change in employment to another child care program.\nAll training must be documented and maintained on site in each personnel record. In addition to any requirements for each training provided in this section, documentation for each staff person must include the staff person's first date of direct contact and first date of unsupervised contact with a child in care.",
	"repealed": false
}