{
	"id": "116M.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/116M.18",
	"title": "116M.18 MINNESOTA EMERGING ENTREPRENEUR PROGRAM.",
	"text": "The Minnesota emerging entrepreneur program is established to award grants to nonprofit corporations, Tribal economic development entities, and community development financial institutions to fund loans to businesses owned by minority or low-income persons, women, veterans, or people with disabilities.\nTo the extent there is sufficient eligible demand, loans shall be made so that an approximately equal dollar amount of loans are made to businesses in the metropolitan area as in the nonmetropolitan area. After March 31 of each fiscal year, the department may allow loans to be made anywhere in the state without regard to geographic area.\nThe department shall make grants to nonprofit corporations, Tribal economic development entities, and community development financial institutions to fund loans to businesses owned by minority or low-income persons, women, veterans, or people with disabilities to encourage private investment, to provide jobs for minority and low-income persons, to create and strengthen minority business enterprises, and to promote economic development in a low-income area.\n(a) The department may enter into agreements with nonprofit corporations, Tribal economic development entities, and community development financial institutions to fund loans the nonprofit corporation, Tribal economic development entity, or community development financial institution makes to businesses owned by minority or low-income persons, women, veterans, or people with disabilities. The department shall evaluate applications from nonprofit corporations, Tribal economic development entities, and community development financial institutions. In evaluating applications, the department must consider, among other things, whether the nonprofit corporation, Tribal economic development entity, or community development financial institution:\n(1) has a board of directors that includes citizens experienced in business and community development, minority business enterprises, addressing racial income disparities, and creating jobs for low-income and minority persons;\n(2) has the technical skills to analyze projects;\n(3) is familiar with other available public and private funding sources and economic development programs;\n(4) can initiate and implement economic development projects;\n(5) can establish and administer a revolving loan account or has operated a revolving loan account;\n(6) can work with job referral networks which assist minority and low-income persons; and\n(7) has established relationships with minority communities.\n(b) The department shall review existing agreements with nonprofit corporations, Tribal economic development entities, and community development financial institutions every five years and may renew or terminate the agreement based on the review. In making its review, the department shall consider, among other criteria, the criteria in paragraph (a).\n(a) The department shall establish a revolving loan fund to make grants to nonprofit corporations, Tribal economic development entities, and community development financial institutions for the purpose of making loans to businesses owned by minority or low-income persons, women, veterans, or people with disabilities, and to support minority business enterprises and job creation for minority and low-income persons.\n(b) Nonprofit corporations, Tribal economic development entities, and community development financial institutions that receive grants from the department under the program must establish a commissioner-certified revolving loan fund for the purpose of making eligible loans.\n(c) Eligible business enterprises include, but are not limited to, technologically innovative industries, value-added manufacturing, and information industries.\n(d) Loan applications given preliminary approval by the nonprofit corporation, Tribal economic development entity, or community development financial institution must be forwarded to the department. Nonprofit corporations, Tribal economic development entities, and community development financial institutions designated as preferred partners do not need final approval by the commissioner. All other loans must be approved by the commissioner and the commissioner must make approval decisions within 20 days of receiving a loan application unless the application contains insufficient information to make an approval decision. The amount of the state funds contributed to any loan may not exceed 50 percent of each loan. The commissioner must develop the criteria necessary to receive loan forgiveness.\n(a) The criteria in this subdivision apply to loans made by nonprofit corporations, Tribal economic development entities, and community development financial institutions under the program.\n(b) Loans must be made to businesses that are not likely to undertake a project for which loans are sought without assistance from the program.\n(c) A loan must be used to support a business owned by a minority or a low-income person, woman, veteran, or a person with disabilities. Priority must be given for loans to the lowest income areas.\n(d) The minimum state contribution to a loan is $5,000 and the maximum is $150,000.\n(e) The state contribution must be matched by at least an equal amount of new private investment.\n(f) A loan may not be used for a retail development project.\n(g) The business must agree to work with job referral networks that focus on minority and low-income applicants.\n(h) Up to ten percent of a loan's principal amount may be forgiven if the borrower has met lender and agency criteria, including being current with all payments, for at least two years. The commissioner must develop the criteria for receiving loan forgiveness.\n(a) Program grants may be used to make microenterprise loans to small, beginning businesses, including a sole proprietorship. Microenterprise loans are subject to this section except that:\n(1) they may also be made to qualified retail businesses;\n(2) they may be made for a minimum of $5,000 and a maximum of $40,000;\n(3) in a low-income area, they may be made for a minimum of $5,000 and a maximum of $55,000; and\n(4) they do not require a match.\n(b) Up to ten percent of a loan's principal amount may be forgiven if the borrower has met criteria developed by the lender and the commissioner, including being current with all payments, for at least two years.\n(a) The department shall establish a minimum interest rate or fee for loans or guarantees to ensure that necessary loan administration costs are covered. The interest rate charged by a nonprofit corporation, Tribal economic development entity, or community development financial institution for a loan under this subdivision must not exceed the Wall Street Journal prime rate plus two percent, with a maximum rate of ten percent. For a loan under this subdivision, the nonprofit corporation, Tribal economic development entity, or community development financial institution may charge a loan origination fee equal to or less than one percent of the loan value. The nonprofit corporation, Tribal economic development entity, or community development financial institution may retain the amount of the origination fee.\n(b) Loan repayment of principal must be paid to the department for deposit in the revolving loan fund. Loan interest payments must be deposited in a revolving loan fund created by the nonprofit corporation, Tribal economic development entity, or community development financial institution originating the loan being repaid for further distribution or use, consistent with the criteria of this section.\n(c) Administrative expenses of the nonprofit corporations, Tribal economic development entities, and community development financial institutions with whom the department enters into agreements, including expenses incurred by a nonprofit corporation, Tribal economic development entity, or community development financial institution in providing financial, technical, managerial, and marketing assistance to a business enterprise receiving a loan under subdivision 4, may be paid out of the interest earned on loans and out of interest earned on money invested by the state Board of Investment under section 116M.16, subdivision 2, as may be provided by the department.\n(d) The department must provide the nonprofit corporation, Tribal economic development entity, or community development financial institution making the loan with a fee equal to one percent of the loan value for every loan closed to offset related expenses for loan processing, loan servicing, legal filings, and reporting.\n[Repealed by amendment, 2016 c 189 art 7 s 37]\n[Repealed by amendment, 2016 c 189 art 7 s 37]\nA nonprofit corporation, Tribal economic development entity, or community development financial institution that receives a program grant shall cooperate with other organizations, including but not limited to, community development corporations, community action agencies, and the Minnesota small business development centers.\n(a) A nonprofit corporation, Tribal economic development entity, or community development financial institution that receives a program grant shall:\n(1) submit an annual report to the department by February 15 of each year that includes a description of businesses supported by the grant program, an account of loans made during the calendar year, the program's impact on minority business enterprises and job creation for minority persons and low-income persons, the source and amount of money collected and distributed by the program, the program's assets and liabilities, and an explanation of administrative expenses; and\n(2) provide for an independent annual audit to be performed in accordance with generally accepted accounting practices and auditing standards and submit a copy of each annual audit report to the department.\n(b) By March 1 of each year, the commissioner must provide a report compiling the information received from nonprofit corporations, Tribal economic development entities, and community development financial institutions under paragraph (a) to the chairs and ranking minority members of the legislative committees with jurisdiction over workforce development. The report must also specify any nonprofit corporations, Tribal economic development entities, or community development financial institutions that failed to provide the information required under paragraph (a).\nThe small business emergency loan account is created as an account in the special revenue fund.",
	"repealed": false
}