{
	"id": "326B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.31",
	"title": "326B.31 DEFINITIONS.",
	"text": "For purposes of sections 326B.31 to 326B.399, the terms defined in this section have the meanings given them.\n\"Class A electrical contractor\" means a licensed contractor whose responsible licensed individual is a licensed Class A master electrician.\nMS 2007 Supp [Renumbered subd 10]\nMS 2007 Supp [Renumbered subd 24]\nMS 2007 Supp [Renumbered subd 28]\nMS 2007 Supp [Renumbered subd 30]\n\"Class A installer\" means an individual who has the necessary qualifications, training, experience, and technical knowledge to properly lay out and install electrical wiring, apparatus, and equipment for major electrical home appliances and such other electrical equipment as is determined by the commissioner pursuant to section 326B.33, subdivision 3, on the load side of the main service on farmsteads or in any town or municipality with less than 1,500 inhabitants, which is not contiguous to a city of the first class and does not contain an established business of a master electrician, and who is licensed as a Class A installer by the commissioner.\n\"Class A journeyworker electrician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to perform and supervise any electrical work except for planning or laying out of electrical work, and who is licensed as a Class A journeyworker electrician by the commissioner.\n\"Class A master electrician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to perform and supervise any electrical work, and who is licensed as a Class A master electrician by the commissioner.\n\"Class B electrical contractor\" means a licensed contractor whose responsible licensed individual is a licensed Class B master electrician.\n\"Class B installer\" means an individual who has the necessary qualifications, training, experience, and technical knowledge to properly lay out and install electrical wiring, apparatus, and equipment on center pivot irrigation booms on the load side of the main service on farmsteads, and install other electrical equipment determined by the commissioner, and who is licensed as a Class B installer by the commissioner.\n\"Class B journeyworker electrician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to install, alter, repair, and supervise the installing, altering, or repairing of electrical wiring, apparatus, and equipment for single phase systems of not more than 200 ampere capacity for light, heat, power, and other purposes on any farm or in any single family dwelling located in any town or municipality which has a population of less than 2,500 inhabitants, and who is licensed as a Class B journeyworker electrician by the commissioner.\n\"Class B master electrician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to perform and supervise any electrical work for single phase systems of not over 200 ampere capacity for light, heat, power, and other purposes on any farm or in any single family dwelling located in any town or municipality which has a population of less than 2,500 inhabitants, and who is licensed as a Class B master electrician by the commissioner.\n\"Contractor\" means a person who performs or offers to perform any electrical work, with or without compensation, who is licensed as a contractor by the commissioner. A contractor's license does not of itself qualify its holder to perform or supervise the electrical work authorized by holding any class of electrician's or other personal license. Contractor includes electrical contractors, satellite system contractors, and technology system contractors.\n\"Demarcation\" means listed equipment as identified in Minnesota Rules, part 3801.3619, such as a transformer, uninterruptible power supply (UPS), battery, control panel, or other device that isolates technology circuits or systems from nontechnology circuits or systems, including plug or cord and plug connection.\n\"Direct supervision\" means:\n(1) an unlicensed individual is being supervised by an individual licensed to perform the electrical work being supervised;\n(2) during the entire working day of the unlicensed individual, the licensed individual is physically present at the location where the unlicensed individual is performing electrical work and immediately available to the unlicensed individual;\n(3) the licensed individual is physically present and immediately available to the unlicensed individual at all times for assistance and direction;\n(4) electronic supervision does not meet the requirement of physically present and immediately available;\n(5) the licensed individual shall review the electrical work performed by the unlicensed individual before the electrical work is operated; and\n(6) the licensed individual is able to and does determine that all electrical work performed by the unlicensed individual is performed in compliance with section 326B.35.\nThe licensed individual is responsible for the compliance with section 326B.35 of all electrical work performed by the unlicensed individual.\n\"Electrical work\" means the installing, altering, repairing, planning, or laying out of electrical wiring, apparatus, or equipment for electrical light, heat, power, technology circuits or systems, or other purposes. The installing, altering, repairing, planning, or laying out of electrical wiring, apparatus, or equipment for electrical light, heat, power, technology circuits or systems, or other purposes includes, but is not limited to, the performance of any work regulated by the standards referred to in section 326B.35.\n[Repealed, 2013 c 85 art 2 s 44]\n[Repealed, 2013 c 85 art 2 s 44]\n\"Lineman\" means an individual having the necessary qualifications, training, experience, and technical knowledge to construct and maintain transmission and distribution systems that are or will be owned or leased by an electrical utility, and who is licensed as a lineman by the commissioner.\n\"Maintenance electrician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to properly maintain and repair electrical wiring, apparatus, and equipment, who is licensed as a maintenance electrician by the commissioner or who is exempt from licensing by sections 326B.32 to 326B.399.\n[Repealed, 2013 c 85 art 2 s 44]\nAn \"owner\" is an individual who physically performs electrical work on premises the individual owns and actually occupies as a residence or owns and will occupy as a residence upon completion of its construction.\n\"Personal license\" means any license issued by the commissioner under section 326B.33 or the rules adopted under section 326B.33, except a contractor's license.\n\"Power limited technician\" means an individual having the necessary qualifications, training, experience, and technical knowledge to install, alter, repair, plan, lay out, and supervise the installing, altering, and repairing of electrical wiring, apparatus, and equipment for technology circuits or systems, and who is licensed as a power limited technician by the commissioner.\n\"Process control circuits or systems\" are circuits or systems, regardless of electrical classification, that are integrated with a manufacturing, mining, energy, finishing, conveyance of equipment or product, material handling or packaging process that makes or assembles, or similar process. Process control systems does not include premises network and communication systems whose purpose or function is not dedicated to process control circuits or systems.\n\"Request for inspection\" means the application for and issuance of a permit for an electrical installation that is required to be inspected under section 326B.36.\nA \"residential dwelling\" is a single dwelling unit that is contained in a one-family, two-family, or multifamily dwelling as defined in the National Electrical Code pursuant to section 326B.35. A residential dwelling includes a garage and accessory building that can only be used by the residents of the single dwelling unit.\nA contractor's \"responsible licensed individual\" means the licensed Class A master electrician, Class B master electrician, master elevator constructor, or power limited technician designated in writing by the contractor in the contractor's license application, or in another manner acceptable to the commissioner, as the individual responsible for the contractor's compliance with sections 326B.31 to 326B.399, all rules adopted under these sections, and all orders issued under section 326B.082. The terms \"licensed responsible individual\" and \"licensed responsible master electrician or power limited technician\" are synonymous.\n\"Technology circuits or systems\" means class 2 or class 3 circuits or systems for, but not limited to, remote control, signaling, control, alarm, and audio signal, including associated components as covered by the National Electrical Code, articles 640, 645, 650, 725, 760, 770, and 780, and which are isolated from circuits or systems other than class 2 or class 3 by a demarcation and are not process control circuits or systems; antenna and communication circuits or systems as covered by chapter 8 of the National Electrical Code; and circuitry and equipment for indoor lighting and outdoor landscape lighting systems that are supplied by the secondary circuit of an isolating power supply operating at 30 volts or less as covered by the National Electrical Code, article 411. The planning, laying out, installing, altering, and repairing of technology circuits or systems must be performed in accordance with the applicable requirements of the National Electrical Code pursuant to section 326B.35.\n\"Technology system contractor\" means a licensed contractor whose responsible licensed individual is a licensed power limited technician or licensed master electrician.\n\"Satellite broadcast communication system\" means antenna and receiving equipment for a residential dwelling to receive and transmit communication signals from satellite sources as covered by the National Electrical Code. Satellite broadcast communication system is a subset of technology circuits and systems.\n\"Satellite system installer\" means an individual having the necessary training, knowledge, and experience to plan, lay out, supervise, and install, maintain, and repair wiring, apparatus, and equipment for satellite broadcast communication systems.\n\"Satellite system contractor\" means a licensed contractor whose responsible licensed individual is a licensed satellite system installer.",
	"repealed": false
}