{
	"id": "116.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.12",
	"title": "116.12 HAZARDOUS WASTE ADMINISTRATION FEES.",
	"text": "The agency shall establish the fees provided in subdivisions 2 and 3 to cover expenditures of amounts appropriated from the environmental fund to the agency for permitting, monitoring, inspection, and enforcement expenses of the hazardous waste activities of the agency.\n(a) Each generator of hazardous waste shall pay a fee on the hazardous waste generated by that generator. The agency shall base the amount of fees on the quantity of hazardous waste generated and may charge a minimum fee for each generator not exempted by the agency. In adopting the fee rules, the agency shall consider:\n(1) reducing the fees for generators using environmentally beneficial hazardous waste management methods, including recycling;\n(2) the agency resources allocated to regulating the various sizes or types of generators;\n(3) adjusting fees for sizes or types of generators that would bear a disproportionate share of the fees to be collected; and\n(4) whether implementing clauses (1) to (3) would require excessive staff time compared to staff time available for providing technical assistance to generators or would make the fee system difficult for generators to understand.\n(b) The agency may exempt generators of very small quantities of hazardous wastes otherwise subject to the fee if it finds that the cost of administering a fee on those generators is excessive relative to the proceeds of the fee.\n(c) The agency shall reduce fees charged to generators in counties which also charge generator fees to reflect a lesser level of activity by the agency in those counties. The fees charged by the agency in those counties shall be collected by the counties in the manner in which and at the same time as those counties collect their generator fees. Counties shall remit to the agency the amount of the fees charged by the agency by the last day of the month following the month in which they were collected. If a county does not collect or remit generator fees due to the agency, the agency may collect fees from generators in that county according to rules adopted under paragraph (a).\n(d) The agency may not impose a volume-based fee under this subdivision on material that is reused at the facility where the material is generated in a manner that the facility owner or operator can demonstrate does not increase the toxicity of, or the level of hazardous substances or pollutants or contaminants in, products that leave the facility. The agency may impose a flat annual fee on a facility that generates the type of material described in the preceding sentence, provided that the fee reflects the reasonable and necessary costs of inspections of the facility.\nThe agency shall charge hazardous waste facility fees including, but not limited to, an original permit fee, a reissuance fee, a major modification fee, and an annual facility fee for any hazardous waste facility regulated by the agency. The agency may exempt facilities otherwise subject to the fee if regulatory oversight of those facilities is minimal. The agency may include reasonable and necessary costs of any environmental review required under chapter 116D in the original permit fee for any hazardous waste facility.",
	"repealed": false
}