{
	"id": "115A.194",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.194",
	"title": "115A.194 EVALUATING AND SELECTING SITES; PERMITS.",
	"text": "The agency shall proceed to take the actions provided in subdivisions 2 and 4 pursuant to any contracts executed under section 115A.191.\nBefore the agency makes decisions under subdivision 4:\n(1) the agency shall complete environmental impact statements on the environmental effects of the decisions, in the manner provided in chapter 116D and the rules issued under that chapter; and\n(2) the commissioner shall present to the agency the report on facility development prepared as provided in section 115A.193.\nWithin 30 days following the determination of the adequacy of the environmental impact statements and the presentation of the report on facility development, after consulting with the agency, facility developers, and affected local government units, the chief executive officer of each permitting state agency shall issue to the agency reports on permit conditions and permit application requirements at each location. The reports must indicate, to the extent possible based on existing information, the probable terms, conditions, and requirements of permits, and the probable supplementary documentation that will be required for the environmental impact statement and permit applications under subdivision 5. If the agency has selected a developer, the report of the agency must include a description of the rules necessary to implement the provisions of section 115A.175, subdivision 4.\n(a) Within 90 days after the agency has determined the adequacy of the environmental impact statement, the agency shall:\n(1) specify the type, capacity, and function of the stabilization and containment facility, including operating and design standards for the facility; and\n(2) select one of the study areas evaluated under this section as the site for the facility, unless the agency determines, based upon potential significant adverse effects on the environment, that none of the study areas should be selected as the site consistent with the reasonable requirements of the public health, safety, and welfare and the state's paramount concern for the protection of its air, water, land, and other natural resources from pollution, impairment, or destruction.\n(b) The provisions of sections 115A.28, subdivisions 2 and 3, and 115A.30 apply to any agency decision to select a study area as a site under this subdivision.\n(c) If the agency selects a study area as a site under this subdivision, the agency shall dismiss all other study areas from further consideration. If the agency does not select a study area as a site under this subdivision, the agency shall dismiss all study areas from further consideration.\nBefore the agency issues permits for the facility, the agency shall complete an environmental impact statement specifically on the environmental effects of permitting decisions required to be made by permitting agencies. The statement must be completed in the manner provided in chapter 116D and the rules issued under that chapter.",
	"repealed": false
}