{
	"id": "17.4986",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4986",
	"title": "17.4986 IMPORTATION OF AQUATIC LIFE.",
	"text": "A person may not import fish into or stock fish in the state without first obtaining a transportation permit with a disease certification, as prescribed under section 17.4985, subdivision 5, when required or a bill of lading from the commissioner, unless the person is exempted.\n(a) The commissioner shall issue transportation permits to import:\n(1) indigenous and naturalized species except trout, salmon, catfish, or species on the VHS-susceptible-species list and sperm from any source to a standard facility;\n(2) trout, salmon, catfish, or species on the VHS-susceptible-species list from a nonemergency enzootic disease area to a containment facility if the fish are certified within the previous year to be free of certifiable diseases, except that eggs with enteric redmouth, whirling disease, or furunculosis may be imported following treatment approved by the commissioner, and fish with bacterial kidney disease or viral hemorrhagic septicemia may be imported into areas where the disease has been identified as being present; and\n(3) trout, salmon, catfish, or species on the VHS-susceptible-species list from a facility in a nonemergency enzootic disease area with a disease-free history of three years or more to a standard facility, except that eggs with enteric redmouth, whirling disease, or furunculosis may be imported following treatment approved by the commissioner, and fish with bacterial kidney disease or viral hemorrhagic septicemia may be imported into areas where the disease has been identified as being present.\n(b) If a source facility in a nonemergency enzootic disease area cannot demonstrate a history free from disease, aquatic life may only be imported into a quarantine facility.\nExcept as otherwise provided and except that eggs with enteric redmouth, whirling disease, or furunculosis may be imported following treatment approved by the commissioner, and fish with bacterial kidney disease may be imported into areas where the disease has been previously introduced, fish may be imported from emergency enzootic disease areas only as fertilized eggs under the following conditions:\n(1) to be imported into a standard facility, fertilized eggs must have a disease-free history for at least five years;\n(2) to be imported into a containment facility, fertilized eggs must have a disease-free history for at least three years; or\n(3) to be imported into a quarantine facility, fertilized eggs may have a disease-free history of less than three years.\nDisease-free histories required under this section must include the results of a fish health inspection. When disease-free histories of more than one year are required for importing salmonids, catfish, or species on the VHS-susceptible-species list, the disease history must be of consecutive years that include the year previous to, or the year of, the transportation request.",
	"repealed": false
}