{
	"id": "82A.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/82A.111",
	"title": "82A.111 ESCROW REQUIREMENT.",
	"text": "All funds received by a broker, membership camping operator, or salesperson in connection with the offer or sale of a membership camping contract must be deposited immediately upon receipt in an escrow account maintained by the broker or membership camping operator for that purpose in a bank or an industrial loan and thrift company with deposit liabilities designated by the broker or membership camping operator. The funds must remain in the escrow account, for the benefit of the purchaser, until the expiration of the purchaser's right of rescission as set forth in section 82A.11, subdivision 3. The depository bank must be a Minnesota bank, trust company, or savings association, or a foreign bank which authorizes the commissioner to examine its records of these deposits upon demand by the commissioner. The industrial loan and thrift company must be organized under chapter 53.\nA membership camping operator or the operator's salesperson shall deposit all membership dues received in an escrow account in a Minnesota bank, trust company, or savings association, a foreign bank which authorizes the commissioner to examine its records of these deposits upon demand by the commissioner, or an industrial loan and thrift company organized under chapter 53 with deposit liabilities. The operator may draw funds from the escrow as needed provided that funds are expended for purposes identified by the budget.\nA broker, membership camping operator, or salesperson shall deposit only funds specified in subdivisions 1 and 2 in an escrow account and shall not commingle personal funds or other funds in an escrow account; except that a broker, membership camping operator, or salesperson may deposit and maintain a sum not to exceed $100 in an escrow account from personal funds, which sum must be specifically identified and used to pay service charges relating to the escrow account.\nEach broker and membership camping operator shall maintain and retain records of all escrowed funds and escrow accounts.\n[Repealed, 2014 c 222 art 1 s 58]",
	"repealed": false
}