{
	"id": "115B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.48",
	"title": "115B.48 DEFINITIONS.",
	"text": "The definitions in section 115B.02 and this section apply to sections 115B.47 to 115B.51.\n\"Dry cleaner environmental response and reimbursement account\" or \"account\" means the dry cleaner environmental response and reimbursement account in the remediation fund established in sections 115B.49 and 116.155.\n\"Dry cleaning facility\" means a facility located in this state that is or has been used for a dry cleaning operation, other than:\n(1) a coin-operated dry cleaning operation;\n(2) a facility located on a United States military base;\n(3) a uniform service or linen supply facility;\n(4) a prison or other penal institution;\n(5) a facility on the national priorities list established under the federal Superfund Act; or\n(6) a facility at which a response action has been taken or started before July 1, 1995, except as authorized in a settlement agreement approved by the commissioner by July 1, 1997.\n\"Dry cleaning operation\" means commercial cleaning of apparel and household fabrics for the general public, using one or more dry cleaning solvents.\n\"Dry cleaning solvent\" means any nonaqueous solvent for use in the cleaning of garments or other fabrics at a dry cleaning facility, including, but not limited to:\n(1) perchloroethylene and its degradation products; and\n(2) petroleum-based solvents and their degradation products.\n\"Environmental response costs\" means those costs described in section 115B.17, subdivision 6.\n\"Facility\" means one or more buildings or parts of a building and the equipment, installations, and structures contained in the building, located on a single site or on contiguous or adjacent sites. Facility includes any site or area where a hazardous substance, or a pollutant or contaminant, has been deposited, stored, disposed of, or placed, or otherwise comes to be located.\n\"Full-time equivalence\" means 2,000 hours worked by employees, owners, and others in a dry cleaning facility during a 12-month period beginning July 1 of the preceding year and running through June 30 of the year in which the annual registration fee is due. For those dry cleaning facilities that were in business less than the 12-month period, full-time equivalence means the total of all of the hours worked in the dry cleaning facility, divided by 2,000 and multiplied by a fraction, the numerator of which is 50 and the denominator of which is the number of weeks in business during the reporting period. For the purposes of section 115B.49, an owner working 2,000 hours or more shall be considered as one full-time equivalent.\n[Repealed, 2016 c 123 s 6]\n\"Owner or operator\" means a person who:\n(1) owns or has owned a dry cleaning facility during the time the dry cleaning facility operated; or\n(2) operates or has operated a dry cleaning facility.",
	"repealed": false
}