{
	"id": "161.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.20",
	"title": "161.20 GENERAL POWERS OF COMMISSIONER.",
	"text": "The commissioner shall carry out the provisions of article 14, section 2, of the Constitution of the state of Minnesota.\n(a) The commissioner is authorized:\n(1) to acquire by purchase, gift, or by eminent domain proceedings as provided by law, in fee or such lesser estate as the commissioner deems necessary, all lands and properties necessary in preserving future trunk highway corridors or in laying out, constructing, maintaining, and improving the trunk highway system including recreational vehicle lanes; to locate, construct, reconstruct, improve, and maintain the trunk highway system; to purchase all road material, machinery, tools, and supplies necessary for the construction, maintenance, and improvement thereof; to construct necessary buildings, or rent or acquire by purchase, gift, or condemnation, grounds and buildings necessary for the storing and housing of such material, machinery, tools, and supplies or necessary for office space for employees; to maintain, repair, or remodel such buildings as may be necessary;\n(2) to acquire by purchase, gift, or condemnation, replacement sites for historically significant buildings or structures and to relocate these buildings or structures onto those sites, reconstructing and maintaining them until disposed of through public sale to the highest responsible bidder;\n(3) to make agreements with any county for the relocation or reestablishment, by the county, of section, quarter section, or meander corners originally established by the United States, when such relocation or reestablishment is necessary in order to write land acquisition descriptions or by reason of the construction, reconstruction, improvement, or maintenance of a trunk highway;\n(4) to contract on an equitable basis with railroad companies for the installation and reinstallation of safety devices at trunk highway-railroad grade crossings, and for the construction, reconstruction, and maintenance of bridges and approaches existing or necessary for the separation of grades at railroad and trunk highway intersections; and\n(5) in carrying out duties, to let all necessary contracts in the manner prescribed by law.\n(b) The commissioner may make agreements with and cooperate with any governmental authority for the purpose of effectuating the provisions of this chapter.\nThe commissioner may expend trunk highway funds only for trunk highway purposes. Payment of expenses related to Bureau of Criminal Apprehension laboratory, Explore Minnesota Tourism kiosks, Minnesota Safety Council, driver education programs, Emergency Medical Services Board, Mississippi River Parkway Commission, payments to the Department of Information Technology Services in excess of actual costs incurred for trunk highway purposes, and personnel costs incurred on behalf of the Governor's Office do not further a highway purpose and do not aid in the construction, improvement, or maintenance of the highway system.\n[See Note.]\nThe commissioner shall make reasonable and businesslike efforts to collect money owed for licenses, fines, penalties, and permit fees or arising from damages to state-owned property or other causes related to the activities of the Department of Transportation. The commissioner may contract for debt collection services for the purpose of collecting a money judgment or legal indebtedness. The commissioner may enter into an agreement with the commissioner of public safety to use debt collection services authorized by this subdivision when civil penalties relating to the use of highways have been reduced to money judgment. Money received as full or partial payment shall be deposited to the appropriate fund. When money is collected through contracted services, the commissioner may make payment for the service from the money collected. The amount necessary for payment of contractual collection costs is appropriated from the fund in which money so collected is deposited.\nNotwithstanding sections 16A.013 to 16A.016, the commissioner may accept on behalf of the state, gifts, grants, or contributions for purposes pertaining to the activities of the department. Funds received under this subdivision must be deposited in the trunk highway fund and are annually appropriated to the commissioner for the purpose for which they are given.",
	"repealed": false
}