{
	"id": "151.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.72",
	"title": "151.72 SALE OF CERTAIN CANNABINOID PRODUCTS.",
	"text": "For the purposes of this section, the following terms have the meanings given.\n(a) \"Artificially derived cannabinoid\" means a cannabinoid extracted from a hemp plant or hemp plant parts with a chemical makeup that is changed after extraction to create a different cannabinoid or other chemical compound by applying a catalyst other than heat or light. Artificially derived cannabinoid includes but is not limited to any tetrahydrocannabinol created from cannabidiol.\n(b) \"Batch\" means a specific quantity of a specific product containing cannabinoids derived from hemp, including an edible cannabinoid product, that is manufactured at the same time and using the same methods, equipment, and ingredients that is uniform and intended to meet specifications for identity, strength, purity, and composition, and that is manufactured, packaged, and labeled according to a single batch production record executed and documented.\n(c) \"Certified hemp\" means hemp plants that have been tested and found to meet the requirements of chapter 18K and the rules adopted thereunder.\n(d) \"Distributor\" means a person who sells, arranges a sale, or delivers a product containing cannabinoids derived from hemp, including an edible cannabinoid product, that the person did not manufacture to a retail establishment for sale to consumers. Distributor does not include a common carrier used only to complete delivery to a retailer.\n(e) \"Edible cannabinoid product\" means any product that is intended to be eaten or consumed as a beverage by humans, contains a cannabinoid in combination with food ingredients, and is not a drug.\n(f) \"Hemp\" has the meaning given to \"industrial hemp\" in section 18K.02, subdivision 3.\n(g) \"Label\" has the meaning given in section 151.01, subdivision 18.\n(h) \"Labeling\" means all labels and other written, printed, or graphic matter that are:\n(1) affixed to the immediate container in which a product regulated under this section is sold;\n(2) provided, in any manner, with the immediate container, including but not limited to outer containers, wrappers, package inserts, brochures, or pamphlets; or\n(3) provided on that portion of a manufacturer's website that is linked by a scannable barcode or matrix barcode.\n(i) \"Matrix barcode\" means a code that stores data in a two-dimensional array of geometrically shaped dark and light cells capable of being read by the camera on a smartphone or other mobile device.\n(j) \"Nonintoxicating cannabinoid\" means substances extracted from certified hemp plants that do not produce intoxicating effects when consumed by any route of administration.\n(k) \"Office\" means the director of the Office of Cannabis Management.\n(l) \"Synthetic cannabinoid\" means a substance with a similar chemical structure and pharmacological activity to a cannabinoid, but which is not extracted or derived from hemp plants, or hemp plant parts and is instead created or produced by chemical or biochemical synthesis.\n(a) This section applies to the sale of any product that contains cannabinoids extracted from hemp and that is an edible cannabinoid product or is intended for human or animal consumption by any route of administration.\n(b) This section does not apply to any product dispensed by a registered medical cannabis manufacturer pursuant to sections 152.22 to 152.37.\n(c) The office must have no authority over food products, as defined in section 34A.01, subdivision 4, that do not contain cannabinoids extracted or derived from hemp.\n(a) Notwithstanding any other section of this chapter, a product containing nonintoxicating cannabinoids, including an edible cannabinoid product, may be sold for human or animal consumption only if all of the requirements of this section are met. A product sold for human or animal consumption must not contain more than 0.3 percent of any tetrahydrocannabinol and an edible cannabinoid product must not contain an amount of any tetrahydrocannabinol that exceeds the limits established in subdivision 5a, paragraph (f).\n(b) A product containing nonintoxicating cannabinoids, other than an edible cannabinoid product, may be sold for human or animal consumption only if it is intended for application externally to a part of the body of a human or animal. Such a product must not be manufactured, marketed, distributed, or intended to be consumed:\n(1) by combustion or vaporization of the product and inhalation of smoke, aerosol, or vapor from the product;\n(2) through chewing, drinking, or swallowing; or\n(3) through injection or application to a mucous membrane or nonintact skin.\n(c) No other substance extracted or otherwise derived from hemp may be sold for human consumption if the substance is intended:\n(1) for external or internal use in the diagnosis, cure, mitigation, treatment, or prevention of disease in humans or other animals; or\n(2) to affect the structure or any function of the bodies of humans or other animals.\n(d) No product containing any cannabinoid or tetrahydrocannabinol extracted or otherwise derived from hemp may be sold to any individual who is under the age of 21.\n(e) Products that meet the requirements of this section are not controlled substances under section 152.02.\n(f) Products may be sold for on-site consumption if all of the following conditions are met:\n(1) the retailer must also hold an on-sale license issued under chapter 340A;\n(2) products, other than products that are intended to be consumed as a beverage, must be served in original packaging, but may be removed from the products' packaging by customers and consumed on site;\n(3) products must not be sold to a customer who the retailer knows or reasonably should know is intoxicated;\n(4) products must not be permitted to be mixed with an alcoholic beverage; and\n(5) products that have been removed from packaging must not be removed from the premises.\n(g) Edible cannabinoid products that are intended to be consumed as a beverage may be served outside of the products' packaging if the information that is required to be contained on the label of an edible cannabinoid product is posted or otherwise displayed by the retailer.\n(a) A manufacturer of a product regulated under this section must submit representative samples of each batch of the product to an independent, accredited laboratory in order to certify that the product complies with the standards adopted by the office. Testing must be consistent with generally accepted industry standards for herbal and botanical substances, and, at a minimum, the testing must confirm that the product:\n(1) contains the amount or percentage of cannabinoids that is stated on the label of the product;\n(2) does not contain more than trace amounts of any mold, residual solvents or other catalysts, pesticides, fertilizers, or heavy metals; and\n(3) does not contain more than 0.3 percent of any tetrahydrocannabinol.\n(b) A manufacturer of a product regulated under this section must disclose all known information regarding pesticides, fertilizers, solvents, or other foreign materials applied to industrial hemp or added to industrial hemp during any production or processing stages of any batch from which a representative sample has been sent for testing, including any catalysts used to create artificially derived cannabinoids. The disclosure must be made to the laboratory performing testing or sampling and, upon request, to the office. The disclosure must include all information known to the manufacturer regardless of whether the application or addition was made intentionally or accidentally, or by the manufacturer or any other person.\n(c) Upon the request of the office, the manufacturer of the product must provide the office with the results of the testing required in this section.\n(d) The office may determine that any testing laboratory that does not operate formal management systems under the International Organization for Standardization is not an accredited laboratory and require that a representative sample of a batch of the product be retested by a testing laboratory that meets this requirement.\n(e) Testing of the hemp from which the nonintoxicating cannabinoid was derived, or possession of a certificate of analysis for such hemp, does not meet the testing requirements of this section.\n(a) A product regulated under this section must bear a label that contains, at a minimum:\n(1) the name, location, contact phone number, and website of the manufacturer of the product;\n(2) the name and address of the independent, accredited laboratory used by the manufacturer to test the product;\n(3) the batch number; and\n(4) an accurate statement of the amount or percentage of cannabinoids found in each unit of the product meant to be consumed.\n(b) The information in paragraph (a) may be provided on an outer package if the immediate container that holds the product is too small to contain all of the information.\n(c) The information required in paragraph (a) may be provided through the use of a scannable barcode or matrix barcode that links to a page on the manufacturer's website if that page contains all of the information required by this subdivision.\n(d) The label must also include a statement stating that the product does not claim to diagnose, treat, cure, or prevent any disease and has not been evaluated or approved by the United States Food and Drug Administration (FDA) unless the product has been so approved.\n(e) The information required by this subdivision must be prominently and conspicuously placed on the label or displayed on the website in terms that can be easily read and understood by the consumer.\n(f) The labeling must not contain any claim that the product may be used or is effective for the prevention, treatment, or cure of a disease or that it may be used to alter the structure or function of human or animal bodies, unless the claim has been approved by the FDA.\n(a) In addition to the testing and labeling requirements under subdivisions 4 and 5, an edible cannabinoid must meet the requirements of this subdivision.\n(b) An edible cannabinoid product must not:\n(1) bear the likeness or contain cartoon-like characteristics of a real or fictional person, animal, or fruit that appeals to children;\n(2) be modeled after a brand of products primarily consumed by or marketed to children;\n(3) be made by applying an extracted or concentrated hemp-derived cannabinoid to a commercially available candy or snack food item;\n(4) be substantively similar to a meat food product; poultry food product as defined in section 31A.02, subdivision 10; or a dairy product as defined in section 32D.01, subdivision 7;\n(5) contain an ingredient, other than a hemp-derived cannabinoid, that is not approved by the United States Food and Drug Administration for use in food;\n(6) be packaged in a way that resembles the trademarked, characteristic, or product-specialized packaging of any commercially available food product; or\n(7) be packaged in a container that includes a statement, artwork, or design that could reasonably mislead any person to believe that the package contains anything other than an edible cannabinoid product.\n(c) An edible cannabinoid product must be prepackaged in packaging or a container that is child-resistant, tamper-evident, and opaque or placed in packaging or a container that is child-resistant, tamper-evident, and opaque at the final point of sale to a customer. The requirement that packaging be child-resistant does not apply to an edible cannabinoid product that is intended to be consumed as a beverage.\n(d) If an edible cannabinoid product, other than a product that is intended to be consumed as a beverage, is intended for more than a single use or contains multiple servings, each serving must be indicated by scoring, wrapping, or other indicators designating the individual serving size that appear on the edible cannabinoid product. If it is not possible to indicate a single serving by scoring or use of another indicator that appears on the product, the edible cannabinoid product may not be packaged in a manner that includes more than a single serving in each container, except that a calibrated dropper, measuring spoon, or similar device for measuring a single serving, when sold with the product, may be used for any edible cannabinoid products that are intended to be combined with food or beverage products prior to consumption.\n(e) A label containing at least the following information must be affixed to the packaging or container of all edible cannabinoid products sold to consumers:\n(1) the serving size;\n(2) the cannabinoid profile per serving and in total;\n(3) a list of ingredients, including identification of any major food allergens declared by name; and\n(4) the following statement: \"Keep this product out of reach of children.\"\n(f) An edible cannabinoid product must not contain more than five milligrams of any tetrahydrocannabinol in a single serving. An edible cannabinoid product, other than a product that is intended to be consumed as a beverage, may not contain more than a total of 50 milligrams of any tetrahydrocannabinol per package. An edible cannabinoid product that is intended to be consumed as a beverage may not contain more than two servings per container.\n(g) An edible cannabinoid product may contain delta-8 tetrahydrocannabinol or delta-9 tetrahydrocannabinol that is extracted from hemp plants or hemp plant parts or is an artificially derived cannabinoid. Edible cannabinoid products are prohibited from containing any other artificially derived cannabinoid, including but not limited to THC-P, THC-O, and HHC, unless the office authorizes use of the artificially derived cannabinoid in edible cannabinoid products. Edible cannabinoid products are prohibited from containing synthetic cannabinoids.\n(h) Every person selling edible cannabinoid products to consumers, other than products that are intended to be consumed as a beverage, must ensure that all edible cannabinoid products are displayed behind a checkout counter where the public is not permitted or in a locked case.\n(a) Every person selling an edible cannabinoid product to a consumer must be registered with the office. Existing registrations through the Department of Health must be transferred to the office by July 1, 2024. All other persons required to register must register in a form and manner established by the office. The sale of edible cannabinoid products by a person who is not registered with the office is prohibited and subject to the penalties in section 342.09, subdivision 6; any applicable criminal penalty; and any other applicable civil or administrative penalty.\n(b) The registration form must contain an attestation of compliance and each registrant must affirm that it is operating and will continue to operate in compliance with the requirements of this section and all other applicable state and local laws and ordinances.\n(c) The office must not charge a fee for registration under this subdivision.\n(a) Prior to initiating a sale or otherwise providing an edible cannabinoid product to an individual, an employee of a retailer must verify that the individual is at least 21 years of age.\n(b) Proof of age may be established only by one of the following:\n(1) a valid driver's license or identification card issued by Minnesota, another state, or a province of Canada and including the photograph and date of birth of the licensed person;\n(2) a valid Tribal identification card as defined in section 171.072, paragraph (b);\n(3) a valid passport issued by the United States;\n(4) a valid instructional permit issued under section 171.05 to a person of legal age to purchase edible cannabinoid products, which includes a photograph and the date of birth of the person issued the permit; or\n(5) in the case of a foreign national, by a valid passport.\n(c) A registered retailer may seize a form of identification listed under paragraph (b) if the registered retailer has reasonable grounds to believe that the form of identification has been altered or falsified or is being used to violate any law. A registered retailer that seizes a form of identification as authorized under this paragraph must deliver it to a law enforcement agency within 24 hours of seizing it.\n(a) A product regulated under this section, including an edible cannabinoid product, shall be considered a noncompliant product if the product is offered for sale in this state or if the product is manufactured, imported, distributed, or stored with the intent to be offered for sale in this state in violation of any provision of this section, including but not limited to if:\n(1) it consists, in whole or in part, of any filthy, putrid, or decomposed substance;\n(2) it has been produced, prepared, packed, or held under unsanitary conditions where it may have been rendered injurious to health, or where it may have been contaminated with filth;\n(3) its container is composed, in whole or in part, of any poisonous or deleterious substance that may render the contents injurious to health;\n(4) it contains any food additives, color additives, or excipients that have been found by the FDA to be unsafe for human or animal consumption;\n(5) it contains an amount or percentage of nonintoxicating cannabinoids that is different than the amount or percentage stated on the label;\n(6) it contains more than 0.3 percent of any tetrahydrocannabinol or, if the product is an edible cannabinoid product, an amount of tetrahydrocannabinol that exceeds the limits established in subdivision 5a, paragraph (f); or\n(7) it contains more than trace amounts of mold, residual solvents, pesticides, fertilizers, or heavy metals.\n(b) A product regulated under this section shall be considered a noncompliant product if the product's labeling is false or misleading in any manner or in violation of the requirements of this section.\n(c) The office may assume that any product regulated under this section that is present in the state, other than a product lawfully possessed for personal use, has been manufactured, imported, distributed, or stored with the intent to be offered for sale in this state if a product of the same type and brand was sold in the state on or after July 1, 2023, or if the product is in the possession of a person who has sold any product in violation of this section.\n(d) The office may enforce this section, including enforcement against a manufacturer or distributor of a product regulated under this section, under section 342.19.\n(e) The office may enter into an interagency agreement with the commissioner of agriculture to perform inspections and take other enforcement actions on behalf of the office.\n(a) A person who does any of the following regarding a product regulated under this section is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both:\n(1) knowingly alters or otherwise falsifies testing results;\n(2) intentionally alters or falsifies any information required to be included on the label of an edible cannabinoid product; or\n(3) intentionally makes a false material statement to the office.\n(b) A person who does any of the following on the premises of a registered retailer or another business that sells retail goods to customers is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both:\n(1) sells an edible cannabinoid product knowing that the product does not comply with the limits on the amount or types of cannabinoids that a product may contain;\n(2) sells an edible cannabinoid product knowing that the product does not comply with the applicable testing, packaging, or labeling requirements; or\n(3) sells an edible cannabinoid product to a person under the age of 21, except that it is an affirmative defense to a charge under this clause if the defendant proves by a preponderance of the evidence that the defendant reasonably and in good faith relied on proof of age as described in subdivision 5c.",
	"repealed": false
}