{
	"id": "13.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.44",
	"title": "13.44 PROPERTY DATA.",
	"text": "The identities of individuals who register complaints with government entities concerning violations of state laws or local ordinances concerning the use of real property are classified as confidential data, pursuant to section 13.02, subdivision 3.\nCode violation records pertaining to a particular parcel of real property and the buildings, improvements, and dwelling units located on it that are kept by any state, county, or city agency charged by the governing body of the appropriate government entity with the responsibility for enforcing a state, county, or city health, housing, building, fire prevention, or housing maintenance code are public data; except as otherwise provided by section 13.39, subdivision 2; 13.44; or 13.82, subdivision 7.\n(a) Confidential or protected nonpublic data. Estimated or appraised values of individual parcels of real property that are made by personnel of a government entity or by independent appraisers acting for a government entity for the purpose of selling or acquiring land through purchase or condemnation are classified as confidential data on individuals or protected nonpublic data.\n(b) Private or nonpublic data. Appraised values of individual parcels of real property that are made by appraisers working for fee owners or contract purchasers who have received an offer to purchase their property from a government entity are classified as private data on individuals or nonpublic data.\n(c) Public data. The data made confidential or protected nonpublic under paragraph (a) or made private or nonpublic under paragraph (b) become public upon the occurrence of any of the following:\n(1) the data are submitted to a court-appointed condemnation commissioner;\n(2) the data are presented in court in condemnation proceedings; or\n(3) the negotiating parties enter into an agreement for the purchase and sale of the property.\nThe data made confidential or protected nonpublic under paragraph (a) also become public at the discretion of the government entity, determined by majority vote of the entity's governing body, or, in the case of a state agency, as determined by the commissioner of the agency.\nPreliminary and final market value appraisals, which are made by personnel of a city or county or by an independent appraiser acting on behalf of a city or county, of personal and intangible property owned by the city or county, are classified as nonpublic data not on individuals until either (1) a purchase agreement is entered into; or (2) the parties negotiating the transaction exchange appraisals.",
	"repealed": false
}