{
	"id": "209.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/209.06",
	"title": "209.06 INSPECTION OF BALLOTS.",
	"text": "After a contest has been instituted, either party may have the ballots inspected before preparing for trial. The party requesting an inspection shall file with the district court where the contest is brought a verified petition, stating that the case cannot properly be prepared for trial without an inspection of the ballots and designating the precincts in which an inspection is desired. A judge of the court in which the contest is pending shall then appoint as many sets of three inspectors for a contest of any office or question as are needed to count and inspect the ballots expeditiously. One inspector must be selected by each of the parties to the contest and a third must be chosen by those two inspectors. If either party neglects or refuses to name an inspector, the judge shall appoint the inspector. The compensation of inspectors is the same as for referees, unless otherwise stipulated.\nThe party applying for the inspection shall file with the court administrator of district court a bond in the sum of $250 if the contest is in a single county. In other cases the bond shall be in a sum set by the court with sureties approved by the court, and conditioned that the party seeking inspection will pay the administrative costs and expenses of the inspection if that party loses the contest.\nAn inspection must be made in the office and in the presence of the legal custodian of the ballots. The inspectors shall recanvass the votes cast for the parties to the contest or the question in issue in accordance with the rules for counting ballots in the Minnesota Election Law. They shall make a written report of the inspection indicating the number of votes cast for each candidate or each side of the question in each precinct where the ballots were inspected and indicating any disputed ballots upon which the inspectors cannot agree.",
	"repealed": false
}