{
	"id": "144.419",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.419",
	"title": "144.419 ISOLATION AND QUARANTINE OF PERSONS.",
	"text": "For purposes of sections 144.419 to 144.4196, the following definitions apply:\n(1) \"bioterrorism\" means the intentional use of any microorganism, virus, infectious substance, or biological product that may be engineered as a result of biotechnology, or any naturally occurring or bioengineered component of any such microorganism, virus, infectious substance, or biological product, to cause death, disease, or other biological malfunction in a human, an animal, a plant, or another living organism in order to influence the conduct of government or to intimidate or coerce a civilian population;\n(2) \"communicable disease\" means a disease that can be transmitted person to person and for which isolation or quarantine is an effective control strategy, including:\n(i) viral hemorrhagic fevers;\n(ii) severe acute respiratory syndromes;\n(iii) influenza that can cause a pandemic;\n(iv) a disease caused by bioterrorism;\n(v) a new or novel or previously controlled or eradicated infectious agent or biological toxin; or\n(vi) any communicable disease included in the list of quarantinable communicable diseases as authorized by section 361(b) of the Public Health Service Act, United States Code, title 42, section 264(b).\nCommunicable disease excludes a disease that is directly transmitted as defined under section 144.4172, subdivision 5;\n(3) \"isolation\" means separation, during the period of communicability, of a person infected with a communicable disease, in a place and under conditions so as to prevent direct or indirect transmission of an infectious agent to others; and\n(4) \"quarantine\" means restriction, during a period of communicability, of activities or travel of an otherwise healthy person who likely has been exposed to a communicable disease to prevent disease transmission during the period of communicability in the event the person is infected.\n(a) The commissioner of health or any person acting under the commissioner's authority shall comply with paragraphs (b) to (h) when isolating or quarantining individuals or groups of individuals.\n(b) Isolation and quarantine must be by the least restrictive means necessary to prevent the spread of a communicable or potentially communicable disease to others and may include, but are not limited to, confinement to private homes or other private or public premises.\n(c) Isolated individuals must be confined separately from quarantined individuals.\n(d) The health status of isolated and quarantined individuals must be monitored regularly to determine if they require continued isolation or quarantine. To adequately address emergency health situations, isolated and quarantined individuals shall be given a reliable means to communicate 24 hours a day with health officials and to summon emergency health services.\n(e) If a quarantined individual subsequently becomes infectious or is reasonably believed to have become infectious with a communicable or potentially communicable disease, the individual must be isolated according to section 144.4195.\n(f) Isolated and quarantined individuals must be immediately released when they pose no known risk of transmitting a communicable or potentially communicable disease to others.\n(g) The needs of persons isolated and quarantined shall be addressed in a systematic and competent fashion, including, but not limited to, providing adequate food, clothing, shelter, means of communication between those in isolation or quarantine and those outside these settings, medication, and competent medical care.\n(h) Premises used for isolation and quarantine shall be maintained in a safe and hygienic manner and be designed to minimize the likelihood of further transmission of infection or other harms to persons isolated and quarantined.\nThe isolation or quarantine of a person must terminate automatically on the expiration date of a court order authorizing isolation or quarantine that is issued according to section 144.4195, or before the expiration date if the commissioner of health determines that isolation or quarantine of the person is no longer necessary to protect the public.\nAny person who is isolated or quarantined according to this section and section 144.4195 has a fundamental right to refuse medical treatment, testing, physical or mental examination, vaccination, participation in experimental procedures and protocols, collection of specimens, and preventive treatment programs. A person who has been directed by the commissioner of health or any person acting under the commissioner's authority to submit to medical procedures and protocols because the person is infected with or reasonably believed by the commissioner or by the person acting under the commissioner's authority to be infected with or exposed to a communicable disease and who refuses to submit to them may be subject to continued isolation or quarantine according to the parameters set forth in section 144.4195.\n(a) No person, other than a person authorized by the commissioner of health or authorized by any person acting under the commissioner's authority, shall enter an isolation or quarantine area. If, by reason of an unauthorized entry into an isolation or quarantine area, a person poses a danger to public health, the person may be subject to isolation or quarantine according to this section and section 144.4195.\n(b) A family member or health care agent of a person isolated or quarantined has a right to choose to enter into an isolation or quarantine area. The commissioner of health must permit the family member or health care agent entry into the isolation or quarantine area if the family member or health care agent signs a consent form stating that the family member or health care agent has been informed of the potential health risks, isolation and quarantine guidelines, and the consequences of entering the area. The family member or health care agent may not hold the Department of Health, the commissioner of health, or the state responsible for any consequences of entering the isolation or quarantine area. If, by reason of entry into an isolation or quarantine area under this paragraph, a person poses a danger to public health, the person may be subject to isolation or quarantine according to this section and section 144.4195.",
	"repealed": false
}