{
	"id": "462.3535",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.3535",
	"title": "462.3535 COMMUNITY-BASED PLANNING.",
	"text": "Each municipality is encouraged to prepare and implement a community-based comprehensive municipal plan.\nA municipality that prepares a community-based comprehensive municipal plan shall coordinate its plan with the plans, if any, of the county and the municipality's neighbors both in order to prevent the plan from having an adverse impact on other jurisdictions and to complement the plans of other jurisdictions. The municipality shall prepare its plan to be incorporated into the county's community-based comprehensive plan, if the county is preparing or has prepared one, and shall otherwise assist and cooperate with the county in its community-based planning.\nUnder the joint exercise of powers provisions in section 471.59, a municipality may establish a joint planning district with other municipalities or counties that are geographically contiguous, to adopt a single community-based comprehensive plan for the district. A municipality may delegate its authority to adopt official controls under sections 462.351 to 462.364, to the board of the joint planning district.\n(a) The community-based comprehensive municipal plan for a statutory or home rule charter city, and official controls to implement the plan, must at a minimum, address any urban growth area identified in a county plan and may establish an urban growth area for the urbanized and urbanizing area. The city plan must establish a staged process for boundary adjustment to include the urbanized or urbanizing area within corporate limits as the urban growth area is developed and provided municipal services.\n(b) Within the urban growth area, the plan must provide for the staged provision of urban services, including, but not limited to, water, wastewater collection and treatment, and transportation.\n(a) After an urban growth area has been identified in a county or city plan, a city shall negotiate, as part of the comprehensive planning process and in coordination with the county, an orderly annexation agreement with the townships containing the affected unincorporated areas located within the identified urban growth area. The agreement shall contain a boundary adjustment staging plan that establishes a sequencing plan over the subsequent 20-year period for the orderly growth of the city based on its reasonably anticipated development pattern and ability to extend municipal services into designated unincorporated areas located within the identified urban growth area. The city shall include the staging plan agreed upon in the orderly annexation agreement in its comprehensive plan. Upon agreement by the city and town, prior adopted orderly annexation agreements may be included as part of the boundary adjustment plan and comprehensive plan without regard to whether the prior adopted agreement is consistent with this section. When either the city or town requests that an existing orderly annexation agreement affecting unincorporated areas located within an identified or proposed urban growth area be renegotiated, the renegotiated plan shall be consistent with this section.\n(b) After a city's community-based comprehensive plan is approved under this section, the orderly annexation agreement shall be filed with the chief administrative law judge of the state Office of Administrative Hearings or any successor agency. Thereafter, the city may orderly annex the part or parts of the designated unincorporated area according to the sequencing plan and conditions contained in the negotiated orderly annexation agreement by submitting a resolution to the chief administrative law judge. The resolution shall specify the legal description of the area designated pursuant to the staging plan contained in the agreement, a map showing the new boundary and its relation to the existing city boundary, a description of and schedule for extending municipal services to the area, and a determination that all applicable conditions in the agreement have been satisfied. Within 30 days of receipt of the resolution, the chief administrative law judge shall review the resolution and if it finds that the terms and conditions of the orderly annexation agreement have been met, shall order the annexation. The boundary adjustment shall become effective upon issuance of an order by the chief administrative law judge. The chief administrative law judge shall cause copies of the boundary adjustment order to be mailed to the secretary of state, Department of Revenue, state demographer, and Department of Transportation. No further proceedings under chapter 414 or 572A shall be required to accomplish the boundary adjustment. This section provides the sole method for annexing unincorporated land within an urban growth area, unless the parties agree otherwise.\n(c) If a community-based comprehensive plan is updated, the parties shall renegotiate the orderly annexation agreement as needed to incorporate the adjustments and shall refile the agreement with the chief administrative law judge.\nBefore a community-based comprehensive municipal plan is incorporated into the county's plan under section 394.232, subdivision 3, a municipality's community-based comprehensive municipal plan must be coordinated with adjacent municipalities within the county. As soon as practical after the development of a community-based comprehensive municipal plan, the municipality shall provide a copy of the draft plan to adjacent municipalities within the county for review and comment. An adjacent municipality has 30 days after receipt to review the plan and submit written comments.\n(a) If a city does not plan for growth beyond its current boundaries, the city shall submit its community-based comprehensive municipal plan to the county for review and comment. A county has 60 days after receipt to review the plan and submit written comments to the city. The city may amend its plan based upon the county's comments.\n(b) If a town prepares a community-based comprehensive plan, it shall submit the plan to the county for review and comment. As provided in section 394.33, the town plan may not be inconsistent with or less restrictive than the county plan. A county has 60 days after receipt to review the plan and submit written comments to the town. The town may amend its plan based on the county's comment.\n(a) If a city plans for growth beyond its current boundaries, the city's proposed community-based comprehensive municipal plan and proposed urban growth area must be reviewed and approved by the county before the plan is incorporated into the county's plan. The county may review and provide comments on any orderly annexation agreement during the same period of review of a comprehensive plan.\n(b) Upon receipt by the county of a community-based comprehensive plan submitted by a city for review and approval under this subdivision, the county shall, within 60 days of receipt of a city plan, review and approve the plan in accordance with this subdivision.\n(c) In the event the county does not approve the plan, the county shall submit its comments to the city within 60 days. The city may, thereafter, amend the plan and resubmit the plan to the county. The county shall have an additional 60 days to review and approve a resubmitted plan. In the event the county and city are unable to come to agreement, either party may initiate the dispute resolution process contained in chapter 572A. Within 30 days of receiving notice that the other party has initiated dispute resolution, the city or county shall send notice of its intent to enter dispute resolution. If the city refuses to enter the dispute resolution process, it must refund any grant received from the county for community-based planning activities.\nMS 2010 [Repealed, 2011 c 76 art 4 s 8]\nMS 2010 [Repealed, 2011 c 76 art 4 s 8]",
	"repealed": false
}