{
	"id": "142F.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.14",
	"title": "142F.14  FOOD SHELF.",
	"text": "The commissioner must distribute funds appropriated to the commissioner by law for that purpose to Hunger Solutions, a statewide association of food shelves organized as a nonprofit corporation as defined under section 501(c)(3) of the Internal Revenue Code of 1986, to distribute to qualifying food shelves. A food shelf qualifies under this section if:\n(1) it is a nonprofit corporation, or is affiliated with a nonprofit corporation, as defined in section 501(c)(3) of the Internal Revenue Code of 1986 or a federally recognized Tribal nation;\n(2) it distributes standard food orders without charge to needy individuals. The standard food order must consist of at least a two-day supply or six pounds per person of nutritionally balanced food items;\n(3) it does not limit food distributions to individuals of a particular religious affiliation, race, or other criteria unrelated to need or to requirements necessary to administration of a fair and orderly distribution system;\n(4) it does not use the money received or the food distribution program to foster or advance religious or political views; and\n(5) it has a stable address and directly serves individuals.\nIn order to receive money appropriated under this section, Hunger Solutions must apply to the commissioner. The application must be in a form prescribed by the commissioner and must indicate the proportion of money each qualifying food shelf shall receive. Applications must be filed at the times and for the periods determined by the commissioner.\nHunger Solutions must distribute money distributed to it by the department to food shelf programs in proportion to the number of individuals served by each food shelf program. The commissioner must gather data from Hunger Solutions or other appropriate sources to determine the proportionate amount each qualifying food shelf program is entitled to receive. The commissioner may increase or decrease the qualifying food shelf program's proportionate amount if the commissioner determines the increase or decrease is necessary or appropriate to meet changing needs or demands.\nAt least 96 percent of the money distributed to Hunger Solutions under this section must be distributed to food shelf programs to purchase, transport, and coordinate the distribution of nutritious food to needy individuals and families. The money distributed to food shelf programs may also be used to purchase personal hygiene products, including but not limited to diapers and toilet paper. No more than four percent of the money may be expended for other expenses, such as rent, salaries, and other administrative expenses of Hunger Solutions.\nHunger Solutions must retain records documenting expenditure of the money and comply with any additional requirements imposed by the commissioner. The commissioner may require Hunger Solutions to report on its use of the funds. The commissioner may require that the report contain an independent audit. If ineligible expenditures are made by Hunger Solutions, the ineligible amount must be repaid to the commissioner and deposited in the general fund.\nAll funds appropriated under this section must be distributed to Hunger Solutions as provided under this section with deduction by the commissioner for administrative expenses limited to 1.8 percent.\nData collected on individuals from which the identity of any individual receiving services may be determined are private data on individuals as defined in section 13.02.",
	"repealed": false
}