{
	"id": "18.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.84",
	"title": "18.84 LIABILITY; APPEALS.",
	"text": "Counties and municipalities are not liable for damages from the noxious weed control program for actions conducted in accordance with sections 18.76 to 18.91.\nA person who is ordered to control noxious weeds under sections 18.76 to 18.91 and is charged for noxious weed control may appeal the cost of noxious weed control to the county board of the county where the noxious weed control measures were undertaken within 30 days after being charged. The county board shall determine the amount and approve the charge and filing of a lien against the property if it determines that the owner, or occupant if other than the owner, responsible for controlling noxious weeds did not comply with the order of the inspector or county-designated employee.\n(a) A person who is ordered to control noxious weeds under sections 18.76 to 18.91 and is charged for the cost of noxious weed control may petition for judicial review of the charges. The petition must be filed within 30 days after being charged. The petition must be filed with the court administrator in the county in which the land where the noxious weed control measures were undertaken is located, together with proof of service of a copy of the petition on the county auditor. No responsive pleadings may be required of the county, and no court fees may be charged for the appearance of the county in this matter.\n(b) The petition must be captioned in the name of the person making the petition as petitioner and respective county as respondents. The petition must include the petitioner's name, the legal description of the land involved, a copy of the notice to control noxious weeds, and the date or dates on which appealed control measures were undertaken.\n(c) The petition must state with specificity the grounds upon which the petitioner seeks to avoid the imposition of a lien for the cost of noxious weed control measures.\n(a) A hearing under subdivisions 3 to 5 must be held at the earliest practicable date, and in no event later than 90 days following the filing of the petition of objection. The hearing must be before a district judge in the county in which the land where the noxious weed control measures were undertaken is located, and must be conducted in accordance with the District Court Rules of Civil Procedure.\n(b) The court shall either order that a lien representing part or all of the costs for noxious weed control measures be imposed against the land or that the landowner be relieved of responsibility for payment of noxious weed control measures undertaken.\nA party aggrieved by the decision of the reviewing court may appeal the decision as provided in the Rules of Appellate Procedure.",
	"repealed": false
}