{
	"id": "363A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.08",
	"title": "363A.08 UNFAIR DISCRIMINATORY PRACTICES RELATING TO EMPLOYMENT OR UNFAIR EMPLOYMENT PRACTICE.",
	"text": "Except when based on a bona fide occupational qualification, it is an unfair employment practice for a labor organization, because of race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age:\n(1) to deny full and equal membership rights to a person seeking membership or to a member;\n(2) to expel a member from membership;\n(3) to discriminate against a person seeking membership or a member with respect to hiring, apprenticeship, tenure, compensation, terms, upgrading, conditions, facilities, or privileges of employment; or\n(4) to fail to classify properly, or refer for employment or otherwise to discriminate against a person or member.\nExcept when based on a bona fide occupational qualification, it is an unfair employment practice for an employer, because of race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, membership or activity in a local commission, disability, sexual orientation, or age to:\n(1) refuse to hire or to maintain a system of employment which unreasonably excludes a person seeking employment; or\n(2) discharge an employee; or\n(3) discriminate against a person with respect to hiring, tenure, compensation, terms, upgrading, conditions, facilities, or privileges of employment.\n[See Note.]\nExcept when based on a bona fide occupational qualification, it is an unfair employment practice for an employment agency, because of race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age to:\n(1) refuse or fail to accept, register, classify properly, or refer for employment or otherwise to discriminate against a person; or\n(2) comply with a request from an employer for referral of applicants for employment if the request indicates directly or indirectly that the employer fails to comply with the provisions of this chapter.\n(a) Except when based on a bona fide occupational qualification, it is an unfair employment practice for an employer, employment agency, or labor organization, before a person is employed by an employer or admitted to membership in a labor organization, to:\n(1) require or request the person to furnish information that pertains to race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age; or, subject to section 363A.20, to require or request a person to undergo physical examination; unless for the sole and exclusive purpose of national security, information pertaining to national origin is required by the United States, this state or a political subdivision or agency of the United States or this state, or for the sole and exclusive purpose of compliance with the Public Contracts Act or any rule, regulation, or laws of the United States or of this state requiring the information or examination. A law enforcement agency may, after notifying an applicant for a peace officer or part-time peace officer position that the law enforcement agency is commencing the background investigation on the applicant, request the applicant's date of birth, gender, and race on a separate form for the sole and exclusive purpose of conducting a criminal history check, a driver's license check, and fingerprint criminal history inquiry. The form shall include a statement indicating why the data is being collected and what its limited use will be. No document which has date of birth, gender, or race information will be included in the information given to or available to any person who is involved in selecting the person or persons employed other than the background investigator. No person may act both as background investigator and be involved in the selection of an employee except that the background investigator's report about background may be used in that selection as long as no direct or indirect references are made to the applicant's race, age, or gender; or\n(2) seek and obtain for purposes of making a job decision, information from any source that pertains to the person's race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age, unless for the sole and exclusive purpose of compliance with the Public Contracts Act or any rule, regulation, or laws of the United States or of this state requiring the information; or\n(3) cause to be printed or published a notice or advertisement that relates to employment or membership and discloses a preference, limitation, specification, or discrimination based on race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, disability, sexual orientation, or age.\n(b) Any individual who is required to provide information that is prohibited by this subdivision is an aggrieved party under sections 363A.06, subdivision 4, and 363A.28, subdivisions 1 to 9.\nExcept when based on a bona fide occupational qualification, it is an unfair employment practice for an employer, an employment agency, or a labor organization, with respect to all employment related purposes, including receipt of benefits under fringe benefit programs, not to treat women affected by pregnancy, childbirth, or disabilities related to pregnancy or childbirth, the same as other persons who are not so affected but who are similar in their ability or inability to work, including a duty to make reasonable accommodations as provided by subdivision 6.\n(a) Except when based on a bona fide occupational qualification, it is an unfair employment practice for an employer with a number of part-time or full-time employees for each working day in each of 20 or more calendar weeks in the current or preceding calendar year equal to or greater than 25 effective July 1, 1992, and equal to or greater than 15 effective July 1, 1994, an employment agency, or a labor organization, not to provide a reasonable accommodation for a job applicant or qualified employee with a disability unless the employer, agency, or organization can demonstrate that the accommodation would impose an undue hardship on the business, agency, or organization. \"Reasonable accommodation\" means steps which must be taken to accommodate the known physical or mental limitations of a qualified individual with a disability. To determine the appropriate reasonable accommodation the employer, agency, or organization shall initiate an informal, interactive process with the individual with a disability in need of the accommodation. This process should identify the limitations resulting from the disability and any potential reasonable accommodations that could overcome those limitations. \"Reasonable accommodation\" may include but is not limited to, nor does it necessarily require: (1) making facilities readily accessible to and usable by individuals with disabilities; and (2) job restructuring, modified work schedules, reassignment to a vacant position, acquisition or modification of equipment or devices, and the provision of aides on a temporary or periodic basis.\n(b) In determining whether an accommodation would impose an undue hardship on the operation of a business or organization, factors to be considered include:\n(1) the overall size of the business or organization with respect to number of employees or members and the number and type of facilities;\n(2) the type of the operation, including the composition and structure of the work force, and the number of employees at the location where the employment would occur;\n(3) the nature and cost of the needed accommodation;\n(4) the reasonable ability to finance the accommodation at each site of business; and\n(5) documented good faith efforts to explore less restrictive or less expensive alternatives, including consultation with the disabled person or with knowledgeable disabled persons or organizations.\nA prospective employer need not pay for an accommodation for a job applicant if it is available from an alternative source without cost to the employer or applicant.\nFor purposes of this section, discrimination on account of age shall include acts which interfere with an employee's opportunity to acquire pension credits or pension benefits when the interference cannot be shown to have been based on just cause unrelated to the employee's status with regard to pension credits or pension benefits.\n[See Note.]\n(a) \"Pay history\" as used in this subdivision means any prior or current wage, salary, earnings, benefits, or any other compensation about an applicant for employment.\n(b) An employer, employment agency, or labor organization shall not inquire into, consider, or require disclosure from any source the pay history of an applicant for employment for the purpose of determining wages, salary, earnings, benefits, or other compensation for that applicant. The general prohibition against inquiring into the pay history of an applicant does not apply if the job applicant's pay history is a matter of public record under federal or state law, unless the employer, employment agency, or labor organization sought access to those public records with the intent of obtaining pay history of the applicant for the purpose of determining wages, salary, earnings, benefits, or other compensation for that applicant.\n(c) Nothing in this subdivision shall prevent an applicant for employment from voluntarily and without asking, encouraging, or prompting disclosing pay history for the purposes of negotiating wages, salary, benefits, or other compensation. If an applicant for employment voluntarily and without asking, encouraging, or prompting discloses pay history to a prospective employer, employment agency, or labor organization, nothing in this subdivision shall prohibit that employer, employment agency, or labor organization from considering or acting on that voluntarily disclosed salary history information to support a wage or salary higher than initially offered by the employer, employment agency, or labor organization.\n(d) Nothing in this subdivision limits, prohibits, or prevents a person from bringing a charge, grievance, or any other cause of action alleging wage discrimination because of race, color, creed, religion, national origin, sex, gender identity, marital status, status with regard to public assistance, familial status, membership or activity in a local commission, disability, sexual orientation, or age, as otherwise provided in this chapter.\n(e) Nothing in this subdivision shall be construed to prevent an employer from:\n(1) providing information about the wages, benefits, compensation, or salary offered in relation to a position; or\n(2) inquiring about or otherwise engaging in discussions with an applicant about the applicant's expectations or requests with respect to wages, salary, benefits, or other compensation.",
	"repealed": false
}