{
	"id": "609.2336",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2336",
	"title": "609.2336 DECEPTIVE OR UNFAIR TRADE PRACTICES; ELDERLY OR DISABLED VICTIMS.",
	"text": "As used in this section:\n(1) \"charitable solicitation law violation\" means a violation of sections 309.50 to 309.61;\n(2) \"consumer fraud law violation\" means a violation of sections 325F.68 to 325F.70;\n(3) \"deceptive trade practices law violation\" means a violation of sections 325D.43 to 325D.48;\n(4) \"false advertising law violation\" means a violation of section 325F.67;\n(5) \"disabled person\" means a person who has an impairment of physical or mental function or emotional status that substantially limits one or more major life activities;\n(6) \"major life activities\" means functions such as caring for oneself, performing manual tasks, walking, seeing, hearing, speaking, breathing, learning, and working; and\n(7) \"senior citizen\" means a person who is 65 years of age or older.\nIt is a gross misdemeanor for any person to commit a charitable solicitation law violation, a consumer fraud law violation, a deceptive trade practices law violation, or a false advertising law violation if the person knows or has reason to know that the person's conduct:\n(1) is directed at one or more disabled persons or senior citizens; and\n(2) will cause or is likely to cause a disabled person or a senior citizen to suffer loss or encumbrance of a primary residence, principal employment or other major source of income, substantial loss of property set aside for retirement or for personal or family care and maintenance, substantial loss of pension, retirement plan, or government benefits, or substantial loss of other assets essential to the victim's health or welfare.\nThe attorney general has statewide jurisdiction to prosecute violations of this section. This jurisdiction is concurrent with that of the local prosecuting authority responsible for prosecuting gross misdemeanors in the place where the violation was committed.",
	"repealed": false
}