{
	"id": "501A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/501A.01",
	"title": "501A.01 WHEN NONVESTED INTEREST, POWERS OF APPOINTMENT ARE INVALID; EXCEPTIONS.",
	"text": "(a) A nonvested property interest is invalid unless:\n(1) when the interest is created, it is certain to vest or terminate no later than 21 years after the death of an individual then alive; or\n(2) the interest either vests or terminates within 90 years after its creation.\n(b) A general power of appointment not presently exercisable because of a condition precedent is invalid unless:\n(1) when the power is created, the condition precedent is certain to be satisfied or become impossible to satisfy no later than 21 years after the death of an individual then alive; or\n(2) the condition precedent either is satisfied or becomes impossible to satisfy within 90 years after its creation.\n(c) A nongeneral power of appointment or a general testamentary power of appointment is invalid unless:\n(1) when the power is created, it is certain to be irrevocably exercised or otherwise to terminate no later than 21 years after the death of an individual then alive; or\n(2) the power is irrevocably exercised or otherwise terminates within 90 years after its creation.\n(d) In determining whether a nonvested property interest or a power of appointment is valid under paragraph (a), clause (1), paragraph (b), clause (1), or paragraph (c), clause (1), the possibility that a child will be born to an individual after the individual's death is disregarded.\n(e) If, in measuring a period from the creation of a trust or other property arrangement, language in a governing instrument seeks to:\n(1) disallow the vesting or termination of any interest trust beyond;\n(2) postpone the vesting or termination of any interest or trust until; or\n(3) operate in effect in any similar fashion upon,\nthe later of the expiration of a period of time not exceeding 21 years after the death of the survivor of specified lives in being at the creation of the trust or other property arrangement, or the expiration of a period of time that exceeds or might exceed 21 years after the death of the survivor of lives in being at the creation of the trust or other property arrangement;\nthat language is inoperative to the extent it produces a period of time that exceeds 21 years after the death of the survivor of the specified lives.",
	"repealed": false
}