{
	"id": "306.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.761",
	"title": "306.761 PERMANENT CARE AND IMPROVEMENT FUNDS.",
	"text": "A cemetery association operating a cemetery larger than ten acres shall establish a permanent care and improvement fund. All cemetery associations operating a cemetery larger than ten acres and having a permanent care and improvement fund shall annually file, as part of the report required in subdivision 2, a notice with the county auditor of the county in which the cemetery is located. The notice must include the names and addresses of each person or entity owning a five percent or greater interest in the cemetery, and the names and addresses of all officers if any change has taken place since the previous notice. The term \"association\" as used in this section includes any person, firm, partnership, association, or corporation.\nA cemetery association operating a cemetery larger than ten acres and any person, firm, partnership, association, or corporation owning or operating a mausoleum or columbarium, or constructing or selling space in a mausoleum or columbarium to be built, which has a permanent care and improvement fund shall annually make a complete written report to the county auditor of the county in which the cemetery or mausoleum or columbarium or future site of the mausoleum or columbarium is located on the state of the fund, including all deposits and withdrawals of principal amounts and all receipts and disbursements. The report must be filed on forms prescribed by the state auditor by March 31 for any entity described in this subdivision which operates on a calendar year basis and by 90 days after the end of the fiscal year for any entity described in this subdivision which operates on a fiscal year basis. The report shall be signed and notarized under oath. A filing fee of $15 for each report must be paid to the county auditor.\nAny person, firm, partnership, association, or corporation holding money in trust under this section shall provide notice to the person purchasing the cemetery lot, or the burial space in a mausoleum or columbarium, at the time of the first payment. The notice shall be in writing, and shall identify the location where the money will be held in trust including any identifying account numbers and the name and address of the institution in which the money is held. Any person, firm, partnership, association, or corporation holding money in trust under this section shall notify the county auditor receiving the annual report if there is a change in the identifying account numbers or location of the fund within seven days of the change.\nAny person, firm, partnership, association, or corporation subject to this section must file a notice of change of trustee of any trust funds with the same county auditor who should receive the annual report required by this section within 30 days after the change of trustees.\nA person, firm, partnership, association, or corporation knowingly violating this section is guilty of a misdemeanor and for a second offense is guilty of a gross misdemeanor.\nThis section does not apply to cemeteries, mausoleums, or columbariums owned and operated by a municipality, church, religious corporation, or religious association.",
	"repealed": false
}