{
	"id": "245F.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.14",
	"title": "245F.14 STAFFING REQUIREMENTS AND DUTIES.",
	"text": "A license holder must employ or contract with a person, on a full-time basis, to serve as program director. The program director must be responsible for all aspects of the facility and the services delivered to the license holder's patients. An individual may serve as program director for more than one program owned by the same license holder.\nDuring all hours of operation, a license holder must designate a staff member as the responsible staff person to be present and awake in the facility and be responsible for the program. The responsible staff person must have decision-making authority over the day-to-day operation of the program as well as the authority to direct the activity of or terminate the shift of any staff member who has direct patient contact.\nA license holder must have one technician awake and on duty at all times for every ten patients in the program. A license holder may assign technicians according to the need for care of the patients, except that the same technician must not be responsible for more than 15 patients at one time. For purposes of establishing this ratio, all staff whose qualifications meet or exceed those for technicians under section 245F.15, subdivision 6, and who are performing the duties of a technician may be counted as technicians. The same individual may not be counted as both a technician and an alcohol and drug counselor.\nA license holder must employ or contract with a registered nurse, who must be available 24 hours a day by telephone or in person for consultation. The registered nurse is responsible for:\n(1) establishing and implementing procedures for the provision of nursing care and delegated medical care, including:\n(i) a health monitoring plan;\n(ii) a medication control plan;\n(iii) training and competency evaluations for staff performing delegated medical and nursing functions;\n(iv) handling serious illness, accident, or injury to patients;\n(v) an infection control program; and\n(vi) a first aid kit;\n(2) delegating nursing functions to other staff consistent with their education, competence, and legal authorization;\n(3) assigning, supervising, and evaluating the performance of nursing tasks; and\n(4) implementing condition-specific protocols in compliance with section 151.37, subdivision 2.\nA license holder must have a medical director available for medical supervision. The medical director is responsible for ensuring the accurate and safe provision of all health-related services and procedures. A license holder must obtain and document the medical director's annual approval of the following procedures before the procedures may be used:\n(1) admission, discharge, and transfer criteria and procedures;\n(2) a health services plan;\n(3) physical indicators for a referral to a physician, registered nurse, or hospital, and procedures for referral;\n(4) procedures to follow in case of accident, injury, or death of a patient;\n(5) formulation of condition-specific protocols regarding the medications that require a withdrawal regimen that will be administered to patients;\n(6) an infection control program;\n(7) protective procedures; and\n(8) a medication control plan.\nA withdrawal management program must provide one full-time equivalent alcohol and drug counselor for every 16 patients served by the program.\nThe responsible staff person under subdivision 2 must ensure that the program does not exceed the staff-to-patient ratios in subdivisions 3 and 6 and must inform admitting staff of the current staffed capacity of the program for that shift. A license holder must have a written policy for documenting staff-to-patient ratios for each shift and actions to take when staffed capacity is reached.\nA license holder must notify the commissioner within five business days of a change or vacancy in a key staff position. The key positions are a program director as required by subdivision 1, a registered nurse as required by subdivision 4, and a medical director as required by subdivision 5. The license holder must notify the commissioner of the staffing change on a form approved by the commissioner and include the name of the staff person now assigned to the key staff position and the staff person's qualifications for the position. The license holder must notify the program licensor of a vacancy to discuss how the duties of the key staff position will be fulfilled during the vacancy.",
	"repealed": false
}