{
	"id": "84.0895",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0895",
	"title": "84.0895 PROTECTION OF THREATENED AND ENDANGERED SPECIES.",
	"text": "Notwithstanding any other law, a person may not take, import, transport, release, or sell any portion of an endangered or threatened species of wild animal or plant, or sell or possess with intent to sell an article made with any part of the skin, hide, or parts of an endangered or threatened species of wild animal or plant, except as provided in subdivisions 2 and 7.\n(a) Subdivision 1 does not apply to:\n(1) plants on land classified for property tax purposes as class 2a or 2c agricultural land under section 273.13, on a ditch, or on an existing public road right-of-way as defined in section 84.92, subdivision 6a, except for ground not previously disturbed by construction or maintenance; and\n(2) noxious weeds designated pursuant to sections 18.76 to 18.88 or to weeds otherwise designated as troublesome by the Department of Agriculture.\n(b) If control of noxious weeds is necessary, it takes priority over the protection of endangered plant species, as long as a reasonable effort is taken to preserve the endangered plant species first.\n(c) The taking or killing of an endangered plant species on land adjacent to class 3 or 3b agricultural land as a result of the application of pesticides or other agricultural chemical on the class 3 or 3b land is not a violation of subdivision 1, if reasonable care is taken in the application of the pesticide or other chemical to avoid impact on adjacent lands. For the purpose of this paragraph, class 3 or 3b agricultural land does not include timber land, waste land, or other land for which the owner receives a state paid wetlands or native prairie tax credit.\n(d) The accidental taking of an endangered plant, where the existence of the plant is not known at the time of the taking, is not a violation of subdivision 1.\n(a) The commissioner shall adopt rules under chapter 14, to designate species of wild animal or plant as:\n(1) endangered, if the species is threatened with extinction throughout all or a significant portion of its range;\n(2) threatened, if the species is likely to become endangered within the foreseeable future throughout all or a significant portion of its range; or\n(3) species of special concern, if although the species is not endangered or threatened, it is extremely uncommon in this state, or has unique or highly specific habitat requirements and deserves careful monitoring of its status. Species on the periphery of their range that are not listed as threatened may be included in this category along with those species that were once threatened or endangered but now have increasing or protected, stable populations.\n(b) The range of the species in this state is a factor in determining its status as endangered, threatened, or of special concern. A designation by the secretary of the interior that a species is threatened or endangered is a prima facie showing under this section.\n(c) The commissioner shall reevaluate the designated species list every three years after it is first adopted and make appropriate changes. The review must consider the need for further protection of species on the species of special concern list. Species may be withdrawn from designation in the same manner that species are designated.\nThe commissioner may conduct investigations to determine the status and requirements for survival of a resident species of wild animal or plant.\n(a) Notwithstanding any other law, the commissioner may undertake management programs, issue orders, and adopt rules necessary to bring a resident species of wild animal or plant that has been designated as threatened or endangered to a point at which it is no longer threatened or endangered.\n(b) Subject to the provisions of subdivision 6, management programs for endangered or threatened species include research, census, law enforcement, habitat acquisition, habitat maintenance, propagation, live trapping, transplantation, and regulated taking.\nA peace officer or conservation officer, pursuant to chapter 626, may execute a warrant to search for and seize goods, merchandise, plant or animal taken, sold or offered for sale in violation of this section, or items used in connection with a violation of this section. Seized property must be held pending judicial proceedings. Upon conviction, seized property is forfeited to the state and must be offered to a scientific or educational institution or destroyed.\n(a) The commissioner may issue permits and prescribe conditions for an act otherwise prohibited by subdivision 1 if:\n(1) the act is for the purpose of zoological, educational, or scientific study;\n(2) the act enhances the propagation or survival of the affected species;\n(3) the act prevents injury to persons or property; or\n(4) the social and economic benefits of the act outweigh the harm caused by it.\n(b) The commissioner may issue a general permit to a governmental subdivision or to the general public to conduct one or more acts described in paragraph (a).\n(c) A member of an endangered species may not be destroyed under paragraph (a), clause (3) or (4), until all alternatives, including live trapping and transplantation, have been evaluated and rejected. The commissioner may prescribe conditions to propagate a species or subspecies.\n(d) A person may capture or destroy a member of an endangered species, without permit, to avoid an immediate and demonstrable threat to human life or property.\n(e) The commissioner must give approval under this subdivision for forest management, including permit, sale, or lease of land for timber harvesting.\nThis section does not apply retroactively.\nA violation of this section is a misdemeanor.",
	"repealed": false
}