{
	"id": "103B.3369",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.3369",
	"title": "103B.3369 LOCAL WATER RESOURCES RESTORATION, PROTECTION, AND MANAGEMENT PROGRAM.",
	"text": "State agencies may give priority to local government unit requests that are part of or responsive to a comprehensive plan, local water management plan, watershed management plan, or comprehensive watershed management plan, developed or amended, approved and adopted, according to chapter 103B, 103C, 103D, or 114D, when administering programs for water-related financial and technical assistance.\nA local water resources restoration, protection, and management program is established. The board may provide financial assistance to local units of government for activities that restore, protect, or manage water and related land quality. The activities include planning, zoning, official controls, best management practices, capital projects, and other activities to implement a comprehensive plan, local water management plan, or watershed management plan, developed or amended, adopted and approved, according to chapter 103B, 103C, or 103D.\n[Repealed, 2003 c 128 art 1 s 176]\nA local unit of government may contract to implement programs. An explanation of the program responsibilities proposed to be contracted must accompany grant requests. A local unit of government that contracts is responsible for ensuring that state funds are properly expended and for providing an annual report to the board describing expenditures of funds and program accomplishments.\nThe board may award performance-based, watershed-based, or program-based grants or other financial assistance to local units of government that are responsible for implementing elements of applicable portions of watershed management plans, comprehensive plans, local water management plans, or comprehensive watershed management plans, developed or amended, adopted and approved, according to chapter 103B, 103C, or 103D. Upon request by a local government unit, the board may also award performance-based grants to local units of government to carry out TMDL implementation plans as provided in chapter 114D, if the TMDL implementation plan has been incorporated into the local water management plan according to the procedures for approving comprehensive plans, watershed management plans, local water management plans, or comprehensive watershed management plans under chapter 103B, 103C, or 103D, or if the TMDL implementation plan has undergone a public review process. Notwithstanding section 16A.41, the board may award performance-based, watershed-based, or program-based grants or other financial assistance on an advanced basis and may prescribe the amount of local match required. The board may enter into intergovernmental agreements to provide funding for water management to local governments.\n(a) Grants provided to implement programs under this section must be reviewed by the state agency having statutory program authority to assure compliance with minimum state standards. At the request of the state agency commissioner, the board shall revoke the portion of a grant used to support a program not in compliance.\n(b) Grants may be provided to develop, amend, or implement local water management plans, comprehensive plans, watershed management plans, or comprehensive watershed management plans, approved and adopted, according to chapter 103B, 103C, 103D, or 114D.\n(c) A local unit of government may not request or be awarded grants for project implementation unless a comprehensive plan, local water management plan, watershed management plan, or comprehensive watershed management plan has been developed or amended, adopted and approved, according to chapter 103B, 103C, or 103D.\n[Repealed, 2002 c 220 art 8 s 16]\n[Repealed, 2002 c 220 art 8 s 16]\n(a) The board must develop and use performance-based criteria for local water resources restoration, protection, and management programs and projects. The criteria may include but are not limited to science-based assessments, organizational capacity, priority resource issues, community outreach and support, partnership potential, potential for multiple benefits, and program and project delivery efficiency and effectiveness.\n(b) Notwithstanding paragraph (a), the board may develop and use eligibility criteria for state grants or other financial assistance provided to local governments.",
	"repealed": false
}