{
	"id": "317A.733",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.733",
	"title": "317A.733 ARTICLES OF DISSOLUTION; CERTIFICATE OF DISSOLUTION; EFFECT.",
	"text": "Articles of dissolution for a corporation dissolving under section 317A.721 must be filed with the secretary of state after compliance with section 317A.811, if applicable, and:\n(1) the payment of claims of known creditors and claimants has been made or provided for;\n(2) if the corporation has given notice to creditors and claimants in the manner provided in section 317A.727: (i) the 90-day period in section 317A.727, subdivision 2, clause (5), has expired and the payment of claims of the creditors and claimants filing a claim within that period has been made or provided for; or (ii) the longer of the periods described in section 317A.729, clause (2), has expired; or, in all other cases;\n(3) the two-year period described in section 317A.730 has expired.\nThe articles of dissolution must state:\n(a)(1) whether notice has been given to the creditors and claimants of the corporation in the manner provided in section 317A.727 and, if notice has been given, the last date on which the notice was given and: (i) that the payment of the creditors and claimants filing a claim within the 90-day period set forth in section 317A.727, subdivision 2, clause (5), has been made or provided for; or (ii) the date on which the longer of the periods described in section 317A.729, clause (2), expired; or\n(2) if notice was not given and articles of dissolution are being filed under subdivision 1, clause (1), that the debts, obligations, and liabilities of the corporation have been paid and discharged or that adequate provisions have been made for them;\n(b) that the remaining assets of the corporation have been distributed under section 317A.735 or that adequate provision has been made for the distribution;\n(c) that there are no pending legal, administrative, or arbitration proceedings by or against the corporation, or that adequate provision has been made for the satisfaction of a judgment, order, or decree that may be entered against it in a pending proceeding; and\n(d) if applicable, that notice to the attorney general required by section 317A.811 has been given and the waiting period has expired or has been waived by the attorney general.\nWhen the articles of dissolution have been filed with the secretary of state, or on a later date or a later time each within 30 days after filing if the articles of dissolution so provide, the corporation is dissolved.\nThe secretary of state shall issue to the dissolved corporation a certificate of dissolution that contains:\n(1) the name of the corporation;\n(2) the date the dissolution was filed with the secretary of state; and\n(3) a statement that the corporation is dissolved at the effective date and time of the dissolution.",
	"repealed": false
}