{
	"id": "260C.317",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.317",
	"title": "260C.317 TERMINATION OF PARENTAL RIGHTS; EFFECT.",
	"text": "If, after a hearing, the court finds by clear and convincing evidence that one or more of the conditions set out in section 260C.301 exist, it may terminate parental rights. Upon the termination of parental rights all rights, powers, privileges, immunities, duties, and obligations, including any rights to custody, control, visitation, or support existing between the child and parent shall be severed and terminated and the parent shall have no standing to appear at any further legal proceeding concerning the child. Provided, however, that a parent whose parental rights are terminated:\n(1) shall remain liable for the unpaid balance of any support obligation owed under a court order upon the effective date of the order terminating parental rights; and\n(2) may be a party to a communication or contact agreement under section 259.58.\nAn order terminating the parent and child relationship shall not disentitle a child to any benefit due the child from any third person, agency, state, or the United States, nor shall any action under this section be deemed to affect any rights and benefits that a child derives from the child's descent from a member of a federally recognized Indian tribe.\n(a) A certified copy of the findings and the order terminating parental rights, and a summary of the court's information concerning the child shall be furnished by the court to the commissioner or the agency to which guardianship is transferred.\n(b) The orders shall be on a document separate from the findings. The court shall furnish the guardian a copy of the order terminating parental rights.\n(c) When the court orders guardianship pursuant to this section, the guardian ad litem and counsel for the child shall continue on the case until an adoption decree is entered. An in-court appearance hearing must be held every 90 days following termination of parental rights for the court to review progress toward an adoptive placement and the specific recruitment efforts the agency has taken to find an adoptive family for the child and to finalize the adoption or other permanency plan. Review of the progress toward adoption of a child under guardianship of the commissioner of children, youth, and families shall be conducted according to section 260C.607.\n(d) Upon terminating parental rights or upon a parent's consent to adoption under this chapter resulting in an order for guardianship to the commissioner of children, youth, and families, the court shall retain jurisdiction:\n(1) until the child is adopted;\n(2) through the child's minority; or\n(3) as long as the child continues in or reenters foster care, until the individual becomes 21 years of age according to sections 260C.193, subdivision 6, and 260C.451.\n(a) Upon entry of an order terminating the parental rights of any person who is identified as a parent on the original birth record of the child as to whom the parental rights are terminated, the court shall cause written notice to be made to that person setting forth the right of the person to file at any time with the state registrar of vital records a contact preference form under section 144.2253.\n(b) A parent whose rights are terminated under this section shall retain the ability to enter into a contact or communication agreement under section 260C.619 if an agreement is determined by the court to be in the best interests of the child. The agreement shall be filed with the court at or prior to the time the child is adopted. An order for termination of parental rights shall not be conditioned on an agreement under section 260C.619.",
	"repealed": false
}