{
	"id": "256.0112",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.0112",
	"title": "256.0112 GRANTS AND PURCHASE OF SERVICE CONTRACTS.",
	"text": "The local agency may purchase community social services by grant or purchase of service contract from agencies or individuals approved as vendors.\nThe local agency must:\n(1) use a written grant or purchase of service contract when purchasing community social services. Every grant and purchase of service contract must be completed, signed, and approved by all parties to the agreement, including the county board, unless the county board has designated the local agency to sign on its behalf. No service shall be provided before the effective date of the grant or purchase of service contract;\n(2) determine a client's eligibility for purchased services, or delegate the responsibility for making the preliminary determination to the approved vendor under the terms of the grant or purchase of service contract;\n(3) ensure the development of an individual social service plan based on the client's needs;\n(4) monitor purchased services and evaluate grants and contracts on the basis of client outcomes; and\n(5) purchase only from approved vendors.\nWhen the local agency chooses to purchase community social services from a vendor that is not subject to state licensing laws or department rules, the local agency must establish written criteria for vendor approval to ensure the health, safety, and well being of clients.\nCase records and data reporting requirements for grants and purchased services are the same as case record and data reporting requirements for direct services.\nThe local agency must keep an administrative file for each grant and contract.\nParagraphs (a) to (e) govern contracting within and across county lines and lead county contracts. Paragraphs (a) to (e) govern contracting within and across reservation boundaries and lead Tribal contracts for initiative tribes under section 256.01, subdivision 14b. For purposes of this subdivision, \"local agency\" includes a tribe or a county agency.\n(a) Once a local agency and an approved vendor execute a contract that meets the requirements of this subdivision, the contract governs all other purchases of service from the vendor by all other local agencies for the term of the contract. The local agency that negotiated and entered into the contract becomes the lead tribe or county for the contract.\n(b) When the local agency in the county or reservation where a vendor is located wants to purchase services from that vendor and the vendor has no contract with the local agency or any other tribe or county, the local agency must negotiate and execute a contract with the vendor.\n(c) When a local agency wants to purchase services from a vendor located in another county or reservation, it must notify the local agency in the county or reservation where the vendor is located. Within 30 days of being notified, the local agency in the vendor's county or reservation must:\n(1) if it has a contract with the vendor, send a copy to the inquiring local agency;\n(2) if there is a contract with the vendor for which another local agency is the lead tribe or county, identify the lead tribe or county to the inquiring agency; or\n(3) if no local agency has a contract with the vendor, inform the inquiring agency whether it will negotiate a contract and become the lead tribe or county. If the agency where the vendor is located will not negotiate a contract with the vendor because of concerns related to clients' health and safety, the agency must share those concerns with the inquiring local agency.\n(d) If the local agency in the county where the vendor is located declines to negotiate a contract with the vendor or fails to respond within 30 days of receiving the notification under paragraph (c), the inquiring agency is authorized to negotiate a contract and must notify the local agency that declined or failed to respond.\n(e) When the inquiring local agency under paragraph (d) becomes the lead tribe or county for a contract and the contract expires and needs to be renegotiated, that tribe or county must again follow the requirements under paragraph (c) and notify the local agency where the vendor is located. The local agency where the vendor is located has the option of becoming the lead tribe or county for the new contract. If the local agency does not exercise the option, paragraph (d) applies.\n(f) This subdivision does not affect the requirement to seek county concurrence under section 256B.092, subdivision 8a, when the services are to be purchased for a person with a developmental disability or under section 245.4711, subdivision 3, when the services to be purchased are for an adult with serious and persistent mental illness.\nA local agency within the geographic area served by a community mental health board authorized by sections 245.61 to 245.66, may contract directly with the community mental health board. However, if a local agency outside of the geographic area served by a community mental health board wishes to purchase services from the board, the local agency must follow the requirements under subdivision 6.\nA placement agreement must be used for residential services. Placement agreements are valid when signed by authorized representatives of the facility and the county of financial responsibility. If the county of financial responsibility and the county where the approved vendor is located are not the same, the county of financial responsibility must, if requested, mail a copy of the placement agreement to the county where the approved vendor is providing the service and to the lead county within ten calendar days after the date on which the placement agreement is signed. The placement agreement must specify that the service will be provided in accordance with the individual service plan as required and must specify the unit cost, the date of placement, and the date for the review of the placement. A placement agreement may also be used for nonresidential services.\nIn addition to the agreements in subdivision 8, a local agency may negotiate a supplemental agreement to a contract executed between a lead agency and an approved vendor under subdivision 6 for the purposes of contracting for specific performance. The supplemental agreement may augment the lead contract requirements and rates for services authorized by that local agency only. The additional provisions must be negotiated with the vendor and designed to encourage successful, timely, and cost-effective outcomes for clients, and may establish incentive payments, penalties, performance-related reporting requirements, and similar conditions. The per diem rate allowed under this subdivision must not be less than the rate established in the lead county contract. Nothing in the supplemental agreement between a local agency and an approved vendor binds the lead agency or other local agencies to the terms and conditions of the supplemental agreement.\n[Renumbered 142A.07, subd 8]",
	"repealed": false
}