{
	"id": "524.2-712",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-712",
	"title": "524.2-712 DECEDENTS DYING AFTER DECEMBER 31, 2009, AND BEFORE JANUARY 1, 2011; FORMULA CLAUSES TO BE CONSTRUED TO REFER TO FEDERAL ESTATE TAX AND FEDERAL GENERATION-SKIPPING TRANSFER TAX LAWS.",
	"text": "(a) A governing instrument, including a will or trust agreement, of a decedent who dies after December 31, 2009, and before January 1, 2011, that contains a formula or provision referring to the \"unified credit,\" \"estate tax exemption,\" \"applicable exemption amount,\" \"applicable credit amount,\" \"applicable exclusion amount,\" \"generation-skipping transfer tax exemption,\" \"GST exemption,\" \"marital deduction,\" \"maximum marital deduction,\" \"unlimited marital deduction,\" \"inclusion ratio,\" \"applicable fraction,\" or any section of the Internal Revenue Code relating to the federal estate tax or federal generation-skipping transfer tax, or that measures a share of an estate or trust by reference to federal estate taxes or federal generation-skipping transfer taxes, is deemed to refer to the federal estate tax and federal generation-skipping transfer tax laws as they applied with respect to the estates of decedents dying on December 31, 2009. This paragraph does not apply to a governing instrument, including a will or trust agreement, that manifests an intent that a contrary rule will apply if the decedent dies on a date on which there is no then-applicable federal estate or federal generation-skipping transfer tax.\n(b) The personal representative, trustee, or any interested person under the governing instrument, including a will or trust agreement, may bring a proceeding to determine whether the decedent intended that a formula or provision described in paragraph (a) be construed with respect to the law as it existed after December 31, 2009. This proceeding must be commenced by December 31, 2011, and the court may consider extrinsic evidence that contradicts the plain meaning of the will, trust, or other governing instrument. The court may modify a provision of a will, trust, or other governing instrument that refers to the federal estate tax or generation-skipping transfer tax laws as described in paragraph (a) to conform the terms to the decedent's intention, or achieve the decedent's tax objectives in a manner that is not contrary to the decedent's probable intention. The court may provide that its decision, including any decision to modify a provision of a will, trust, or other governing instrument, is effective as of the date of the decedent's death.",
	"repealed": false
}