{
	"id": "256.477",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.477",
	"title": "256.477 SELF-ADVOCACY GRANTS.",
	"text": "(a) The commissioner shall make available a grant for the purposes of establishing and maintaining the Rick Cardenas Statewide Self-Advocacy Network for persons with intellectual and developmental disabilities. The Rick Cardenas Statewide Self-Advocacy Network shall:\n(1) ensure that persons with intellectual and developmental disabilities are informed of their rights in employment, housing, transportation, voting, government policy, and other issues pertinent to the intellectual and developmental disability community;\n(2) provide public education and awareness of the civil and human rights issues persons with intellectual and developmental disabilities face;\n(3) provide funds, technical assistance, and other resources for self-advocacy groups across the state;\n(4) organize systems of communications to facilitate an exchange of information between self-advocacy groups;\n(5) train and support the activities of a statewide network of peer-to-peer mentors for persons with developmental disabilities focused on building awareness among people with developmental disabilities of service options; assisting people with developmental disabilities choose service options; and developing the advocacy skills of people with developmental disabilities necessary for them to move toward full inclusion in community life, including by developing and delivering a curriculum to support the peer-to-peer network;\n(6) provide outreach activities, including statewide conferences and disability networking opportunities, focused on self-advocacy, informed choice, and community engagement skills; and\n(7) provide an annual leadership program for persons with intellectual and developmental disabilities.\n(b) An organization receiving a grant under paragraph (a) must be an organization governed by people with intellectual and developmental disabilities that administers a statewide network of disability groups in order to maintain and promote self-advocacy services and supports for persons with intellectual and developmental disabilities throughout the state.\n(c) An organization receiving a grant under this subdivision may use a portion of grant revenue determined by the commissioner for administration and general operating costs.\nThe commissioner shall make available to an organization described under subdivision 1 a grant for subgrants to organizations in Minnesota to conduct outreach to persons working and living in institutional settings to provide education and information about community options. Subgrant funds must be used to deliver peer-led skill training sessions in six regions of the state to help persons with intellectual and developmental disabilities understand community service options related to:\n(1) housing;\n(2) employment;\n(3) education;\n(4) transportation;\n(5) emerging service reform initiatives contained in the state's Olmstead plan; the Workforce Innovation and Opportunity Act, Public Law 113-128; and federal home and community-based services regulations; and\n(6) connecting with individuals who can help persons with intellectual and developmental disabilities make an informed choice and plan for a transition in services.",
	"repealed": false
}