{
	"id": "18D.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/18D.111",
	"title": "18D.111 LIABILITY FOR COSTS.",
	"text": "(a) A responsible party is liable for the costs, including for a corrective action administrative cost incurred after the corrective action order has been issued, or for emergency corrective action, all costs. The commissioner may issue an order for recovery of the costs.\n(b) A responsible party is liable for the costs of any destruction to wildlife. Payments of costs for wildlife destruction shall be deposited in the game and fish fund of the state treasury.\nAn owner of real property is not a responsible party for an incident on the owner's property unless that owner:\n(1) was engaged in manufacturing, formulating, transporting, storing, handling, applying, distributing, or disposing of an agricultural chemical on the property;\n(2) knowingly permitted any person to make regular use of the property for disposal of agricultural chemicals; or\n(3) violated this chapter in a way that contributed to the incident.\nA person licensed under chapter 18B or 18C is civilly liable for violations of this chapter, chapter 18B, or 18C by the person's employees and agents.\n(a) A responsible party may not avoid liability by means of a conveyance of a right, title, or interest in real property, or by an indemnification, hold harmless agreement, or similar agreement.\n(b) This subdivision does not:\n(1) prohibit a person who may be liable from entering an agreement by which the person is insured, held harmless, or indemnified for part or all of the liability;\n(2) prohibit the enforcement of an insurance, hold harmless, or indemnification agreement; or\n(3) bar a cause of action brought by a person who may be liable or by an insurer or guarantor, whether by right of subrogation or otherwise.\nAs a defense to a penalty or liability for damages, a person may prove that a violation was caused solely by an act of God, an act of war, or an act or failure to act that constitutes sabotage or vandalism, or a combination of these defenses.",
	"repealed": false
}