{
	"id": "252.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.41",
	"title": "252.41 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 252.41 to 252.46.\n\"Commissioner\" means the commissioner of the Department of Human Services.\n(a) \"Day services for adults with disabilities\" means services that:\n(1) include supervision, training, assistance, support, facility-based work-related activities, or other community-integrated activities designed and implemented in accordance with the support plan and support plan addendum required under sections 245D.02, subdivision 4, paragraphs (b) and (c), and 256B.092, subdivision 1b, and Minnesota Rules, part 9525.0004, subpart 12, to help an adult reach and maintain the highest possible level of independence, productivity, and integration into the community;\n(2) include day support services, prevocational services, day training and habilitation services, structured day services, and adult day services as defined in Minnesota's federally approved disability waiver plans; and\n(3) are provided by a vendor licensed under sections 245A.01 to 245A.16, 245D.27 to 245D.31, 252.28, subdivision 2, or 252.41 to 252.46, or Minnesota Rules, parts 9525.1200 to 9525.1330, to provide day services.\n(b) Day services reimbursable under this section do not include special education and related services as defined in the Education of the Individuals with Disabilities Act, United States Code, title 20, chapter 33, section 1401, clauses (6) and (17), or vocational services funded under section 110 of the Rehabilitation Act of 1973, United States Code, title 29, section 720, as amended.\n(c) Day services do not include employment exploration, employment development, or employment support services as defined in the home and community-based services waivers for people with disabilities authorized under sections 256B.092 and 256B.49.\n\"Independence\" means the extent to which persons with disabilities exert control and choice over their own lives.\n\"Integration\" means that persons with disabilities:\n(1) use the same community resources that are used by and available to individuals who are not disabled;\n(2) participate in the same community activities in which nondisabled individuals participate; and\n(3) regularly interact and have contact with nondisabled individuals.\n\"Productivity\" means that persons with disabilities:\n(1) engage in income-producing work designed to improve their income level, employment status, or job advancement; or\n(2) engage in activities that contribute to a business, household, or community.\n\"Regional center\" means any state-operated facility under the direct administrative authority of the commissioner that serves persons with disabilities.\nMS 2018 [Repealed, 1Sp2019 c 9 art 5 s 94]\n\"Vendor\" means a legal entity that:\n(1) is licensed under sections 245A.01 to 245A.16, 245D.27 to 245D.31, 252.28, subdivision 2, and 252.41 to 252.46, and Minnesota Rules, parts 9525.1200 to 9525.1330, to provide day services to adults with disabilities; and\n(2) does not have a financial interest in the legal entity that provides residential services to the same person or persons to whom it provides day services. This clause does not apply to regional treatment centers, state-operated, community-based programs operating according to section 246C.11 until July 1, 2000, or vendors licensed prior to April 15, 1983.",
	"repealed": false
}