{
	"id": "93.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.55",
	"title": "93.55 FORFEITURE OF SEVERED MINERAL INTEREST.",
	"text": "If the owner of a mineral interest fails to record the verified statement required by section 93.52, before January 1, 1975, as to any interests owned on or before December 31, 1973, or within one year after acquiring the interests as to interests acquired after December 31, 1973, the mineral interest shall forfeit to the state after notice and opportunity for hearing as provided in this section. However, before completing the procedures set forth in subdivision 2, the commissioner of natural resources may lease the severed mineral interest as provided in subdivisions 1a and 3.\nIf the owner of a severed mineral interest fails to record the verified statement required by section 93.52 before the dates specified in subdivision 1, the commissioner of natural resources may lease the mineral interest as provided in this subdivision and subdivision 3 before completing the procedures set forth in subdivision 2. In any lease issued under this subdivision, the commissioner shall cite, as authority for issuing the lease, this subdivision, subdivision 3, and the United States Supreme Court decision in Texaco, Inc., et al. v. Short, et al., 454 U.S. 516 (1982), where the Supreme Court determined, under Amendment XIV to the Constitution of the United States, that enactment of a state law requiring an owner of severed mineral interests to timely record a statement of claim to the mineral interests was constitutional, without individual advance notice of operation of the law, before the owner loses the mineral interests for failing to timely record the statement of claim. A lessee holding a lease issued under this subdivision may not mine under the lease until the commissioner completes the procedures set forth in subdivision 2 and a court has adjudged the forfeiture of the mineral interest to be absolute. \"Mine\" for the purposes of this subdivision is defined to exclude exploration activities, exploratory boring, trenching, test pitting, test shafts and drifts, and related activities.\nNotwithstanding subdivision 1, a severed mineral interest for which a statement was recorded as required under section 93.52, but for which no new statement was recorded when the interest was subsequently conveyed on or after December 31, 1969, but before July 1, 2007, is not subject to forfeiture if:\n(1) substantial compliance can be shown as provided in subdivision 2; and\n(2) a new statement is recorded within one year of any conveyance of ownership on or after July 1, 2007.\n(a) The commissioner shall notify the last owner of record in either the county recorder's or registrar of titles' office of a hearing on an order to show cause why the mineral interest should not forfeit to the state absolutely. The notice shall be served in the same manner as provided for the service of summons in a civil action to determine adverse claims under chapter 559 and shall contain the following:\n(1) the legal description of the property upon or beneath which the interest exists;\n(2) a recitation that the statement of severed mineral interest either did not comply with the requirements specified by section 93.52 for such a statement or was not recorded within the time specified in this section, or both; and\n(3) that the court will be requested to enter an order adjudging the forfeiture of the mineral interest to be absolute in the absence of a showing that there was substantial compliance with laws requiring the registration and taxation of severed mineral interests.\n(b) For the purposes of this section, substantial compliance with laws requiring the registration and taxation of severed mineral interests means:\n(1) that the records in the office of the county recorder or registrar of titles specified the true ownership of the severed mineral interest during the time period within which the statement of severed mineral interest should have been recorded with the county recorder or the registrar of titles, or that probate, divorce, bankruptcy, mortgage foreclosure, or other proceedings affecting the title had been timely initiated and diligently pursued by the true owner during the time period within which the severed mineral interest statement should have been recorded; and\n(2) that all taxes relating to severed mineral interests had been timely paid, including any taxes which would have been due and owing under section 273.165, subdivision 1, had the interest been properly recorded as required by section 93.52 within the time specified in this section.\n(c) For the purposes of this section, \"timely paid\" means paid within the time period during which tax forfeiture would not have been possible had a real property tax been assessed against the property.\nThe commissioner may lease severed mineral interests described in subdivision 1 in the same manner as provided in section 93.335, for the lease of minerals and mineral rights becoming the absolute property of the state under the tax laws, except that no permit or lease issued pursuant to this section shall afford the permittee or lessee any of the rights of condemnation provided in section 93.05, as to overlying surface interests.\n(a) After the mineral interest has forfeited to the state pursuant to this section, a person claiming an ownership interest before the forfeiture may recover the fair market value of the interest, either:\n(1) as an alternative claim raised in the hearing on the order to show cause why the mineral interest should not forfeit absolutely, with fair market value to be determined and paid as provided in this subdivision; or\n(2) in a separate action brought as follows.\n(b) An action may be commenced within six years after entry of judgment under this section to determine the ownership and the fair market value of the mineral interests in the property both at the time of forfeiture and at the time of bringing the action. The action shall be brought in the manner provided in chapter 559, for an action to determine adverse claims, to the extent applicable. The person bringing the action shall serve notice of the action on the commissioner of natural resources in the same manner as is provided for service of notice of the action on a defendant. The commissioner may appear and contest the allegations of ownership and value in the same manner as a defendant in such actions.\n(c) Persons determined by the court to be owners of the interests at the time of forfeiture to the state under this section may present to the commissioner of management and budget a verified claim for refund of the fair market value of the interest. A copy of the court's decree shall be attached to the claim. Thereupon the commissioner of management and budget shall refund to the claimant the fair market value at the time of forfeiture, which is the expiration of the period within which tax forfeiture would not have been possible had the mineral interest been properly and timely filed for record under section 93.52, or at the time of bringing the action, whichever is lesser, less any taxes, penalties, costs, and interest which could have been collected during the period following the forfeiture under this section, had the interest in minerals been valued and assessed for tax purposes at the time of forfeiture under this section. There is appropriated from the general fund to the persons entitled to a refund an amount sufficient to pay the refund.\nThe forfeiture provisions of this section do not apply to mineral interests valued and taxed under other laws relating to the taxation of minerals, gas, coal, oil, or other similar interests, so long as a tax is imposed and no forfeiture under the tax laws is complete. However, if the mineral interest is valued under other tax laws, but no tax is imposed, the mineral interest forfeits under this section if not recorded as required by this section.",
	"repealed": false
}