{
	"id": "148B.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.331",
	"title": "148B.331 GUEST LICENSURE.",
	"text": "(a) A nonresident of the state of Minnesota who is not seeking licensure in Minnesota and intends to practice marriage and family therapy in Minnesota must apply to the board for guest licensure. An applicant must apply for guest licensure at least 30 days prior to the expected date of practice in Minnesota and is subject to approval by the board or its designee.\n(b) To be eligible for licensure under this section, the applicant must:\n(1) have a license, certification, or registration in good standing to practice marriage and family therapy from another jurisdiction;\n(2) have a graduate degree in marriage and family therapy from a regionally accredited institution or a degree in a related field from a regionally accredited institution with completed coursework meeting the educational requirements provided in Minnesota Rules, part 5300.0140, subpart 2;\n(3) be of good moral character;\n(4) have no pending complaints or active disciplinary or corrective actions in any jurisdiction;\n(5) submit the required fee and complete the criminal background check according to section 214.075; and\n(6) pay a fee to the board in the amount set forth in section 148B.392.\n(c) A license issued under this section is valid for one year from the date of issuance and allows practice by the nonresident for a maximum of five months. The months in which the nonresident may practice under the license must be consecutive. A guest license is not renewable, but the nonresident may reapply for guest licensure, subject to continued eligibility under paragraph (b), following expiration of a guest license.\nNotwithstanding subdivision 1, a nonresident of the state of Minnesota who is not seeking licensure in Minnesota may serve as an expert witness, organizational consultant, presenter, or educator without obtaining guest licensure, provided the nonresident is appropriately trained or educated, or has been issued a license, certificate, or registration by another jurisdiction.\nA person's privilege to practice under this section is subject to the prohibitions and sanctions for unprofessional or unethical conduct contained in Minnesota laws and rules for marriage and family therapy under this chapter.",
	"repealed": false
}