{
	"id": "504B.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.161",
	"title": "504B.161 COVENANTS OF LANDLORD OR LICENSOR.",
	"text": "(a) In every lease or license of residential premises, the landlord or licensor covenants:\n(1) that the premises and all common areas are fit for the use intended by the parties;\n(2) to keep the premises and all common areas in reasonable repair during the term of the lease or license, including services and conditions listed in section 504B.381, subdivision 1, and extermination of insects, rodents, vermin, or other pests on the premises, except when the disrepair has been caused by the willful, malicious, or irresponsible conduct of the tenant or licensee or a person under the direction or control of the tenant or licensee;\n(3) to make the premises and all common areas reasonably energy efficient by installing weatherstripping, caulking, storm windows, and storm doors when any such measure will result in energy procurement cost savings, based on current and projected average residential energy costs in Minnesota, that will exceed the cost of implementing that measure, including interest, amortized over the ten-year period following the incurring of the cost;\n(4) to maintain the premises and all common areas in compliance with the applicable health and safety laws of the United States, of the state, and of the local units of government, including ordinances regulating rental licensing, where the premises are located during the term of the lease or license, except when violation of the health and safety laws has been caused by the willful, malicious, or irresponsible conduct of the tenant or licensee or a person under the direction or control of the tenant or licensee; and\n(5) to supply or furnish heat at a minimum temperature of 68 degrees Fahrenheit from October 1 through April 30, unless a utility company requires and instructs the heat to be reduced.\n(b) The parties to a lease or license of residential premises may not waive or modify the covenants imposed by this section.\nThe landlord or licensor may agree with the tenant or licensee that the tenant or licensee is to perform specified repairs or maintenance, but only if the agreement is supported by adequate consideration and set forth in a conspicuous writing. No such agreement, however, may waive the provisions of subdivision 1 or relieve the landlord or licensor of the duty to maintain common areas of the premises.\nThis section shall be liberally construed, and the opportunity to inspect the premises before concluding a lease or license shall not defeat the covenants established in this section.\nThe covenants contained in this section are in addition to any covenants or conditions imposed by law or ordinance or by the terms of the lease or license.\nNothing in this section shall be construed to alter the liability of the landlord or licensor of residential premises for injury to third parties.\nThe provisions of this section apply only to leases or licenses of residential premises concluded or renewed on or after June 15, 1971. For the purposes of this section, estates at will shall be deemed to be renewed at the commencement of each rental period.",
	"repealed": false
}