{
	"id": "340A.318",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.318",
	"title": "340A.318 CREDIT EXTENSIONS RESTRICTED.",
	"text": "Except as provided in this section, no retail licensee may accept or receive credit, other than merchandising credit in the ordinary course of business for a period not to exceed 30 days, from a distiller, manufacturer, or wholesaler of distilled spirits or wine, or agent or employee thereof. No distiller, manufacturer or wholesaler may extend the prohibited credit to a retail licensee. No retail licensee delinquent beyond the 30-day period shall solicit, accept or receive credit or purchase or acquire distilled spirits or wine directly or indirectly, and no distiller, manufacturer or wholesaler shall knowingly grant or extend credit nor sell, furnish or supply distilled spirits or wine to a retail licensee who has been posted delinquent under subdivision 3. No right of action shall exist for the collection of any claim based upon credit extended contrary to the provisions of this section.\nEvery distiller, manufacturer or wholesaler selling to retailers shall submit to the commissioner in triplicate not later than Thursday of each calendar week a verified list of the names and addresses of each retail licensee purchasing distilled spirits or wine from that distiller, manufacturer, or wholesaler who, on the first day of that calendar week, was delinquent beyond the 30-day period, or a verified statement that no delinquencies exist which are required to be reported. The name and address of each retail licensee who makes payment with a postdated check, or a check that is dishonored on presentment, must also be submitted to the commissioner at that time. If a retail licensee previously reported as delinquent cures the delinquency by payment, the name and address of that licensee shall be submitted in triplicate to the commissioner not later than the close of the second full business day following the day the delinquency was cured.\nVerified lists or statements required by subdivision 2 shall be posted by the commissioner in offices of the department in places available for public inspection not later than the Monday following receipt. Documents posted shall constitute notice to every distiller, manufacturer, or wholesaler of the information posted. Actual notice, however received, also constitutes notice.\nThe 30-day merchandising period allowed by this section shall commence with the day immediately following the date of invoice and shall include all successive days, including Sundays and holidays, to and including the 30th successive day. In addition to other legal methods, payment by check during the period for which merchandising credit may be extended shall be considered payment. All checks received in payment for distilled spirits or wine shall be deposited promptly for collection. A postdated check or a check dishonored on presentation for payment does not constitute payment. A retail licensee shall not be deemed delinquent for any alleged sale in any instance where there exists a bona fide dispute between the licensee and the distiller, manufacturer or wholesaler as to the amount owing as a result of the alleged sale. A delinquent retail licensee who engages in the retail liquor business at two or more locations shall be deemed to be delinquent with respect to each location. A retail licensee who engages in the retail liquor business at two or more locations means \"a person or group of persons possessing 50 percent or more ownership in two or more locations.\"\nThe license of any retail licensee, distiller, manufacturer or wholesaler violating any provision of this section shall be subject to suspension or revocation in the manner provided by this chapter.",
	"repealed": false
}