{
	"id": "123A.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.48",
	"title": "123A.48 CONSOLIDATION.",
	"text": "Common or independent districts or parts thereof, or any combination of the foregoing may consolidate into a single independent district by proceedings taken in accordance with this section. The proposed new district must contain at least 18 sections of land.\n(a) Upon a resolution of a board in the area proposed for consolidation or upon receipt of a petition therefor executed by 25 percent of the voters resident in the area proposed for consolidation or by 50 such voters, whichever is less, the county auditor of the county which contains the greatest land area of the proposed new district shall prepare a plat. The resolution or petition must show the approximate area proposed for consolidation.\n(b) The resolution or petition may propose the following:\n(1) that the bonded debt of the component districts will be paid according to the levies previously made for that debt under chapter 475, or that the taxable property in the newly created district will be taxable for the payment of all or a portion of the bonded debt previously incurred by any component district as provided in subdivision 18;\n(2) that obligations for a capital loan or an energy loan made according to section 216C.37 or sections 298.292 to 298.297 outstanding in a preexisting district as of the effective date of consolidation remain solely with the preexisting district that obtained the loan, or that all or a portion of the loan obligations will be assumed by the newly created or enlarged district and paid by the newly created or enlarged district on behalf of the preexisting district that obtained the loan;\n(3) that referendum levies previously approved by voters of the component districts pursuant to section 126C.17, subdivision 9, or its predecessor provision, be combined as provided in section 123A.73, subdivision 4 or 5, or that the referendum levies be discontinued;\n(4) that the board of the newly created district consist of the number of members determined by the component districts, which may be six or seven members elected according to subdivision 20, or any number of existing school board members of the component districts, and a method to gradually reduce the membership to six or seven; or\n(5) that separate election districts from which board members will be elected, the boundaries of these election districts, and the initial term of the member elected from each of these election districts be established.\nThe resolution must provide for election of board members from one of the following options: single-member districts; multimember districts; at large; or a combination of these options. The resolution must include a plan for the orderly transition to the option chosen.\nA group of districts that operates a cooperative secondary facility funded under section 123A.443 may also propose a temporary board structure as specified in section 123A.443, subdivision 9.\nIf a county auditor receives more than one request for a plat and the requests involve parts of identical districts, the auditor shall prepare a plat which in the auditor's opinion best serves the educational interests of the inhabitants of the districts or areas affected.\n(c) The plat must show:\n(1) Boundaries of the proposed district, as determined by the county auditor, and present district boundaries,\n(2) The location of school buildings in the area proposed as a new district and the location of school buildings in adjoining districts,\n(3) The boundaries of any proposed separate election districts, and\n(4) Other pertinent information as determined by the county auditor.\nThe county auditor of the county containing the greatest land area of the area proposed to be consolidated shall perform the duties provided by this section.\nAs part of the resolution required by subdivision 2, the board must prepare a plan for the orderly reduction of the membership of the board to six or seven members and a plan for the establishment or dissolution of election districts. The plan may shorten any or all terms of incumbent board members to achieve the orderly reduction. The plan must be submitted to the secretary of state for review and comment.\nThe county auditor shall prepare a supporting statement to accompany the plat. The statement must contain:\n(a) The adjusted net tax capacity of property in the proposed district,\n(b) If a part of any district is included in the proposed new district, the adjusted net tax capacity of the property and the approximate number of pupils residing in the part of the district included shall be shown separately and the adjusted net tax capacity of the property and the approximate number of pupils residing in the part of the district not included shall also be shown,\n(c) The reasons for the proposed consolidation, including a statement that at the time the plat is submitted to the commissioner of education, no proceedings are pending to dissolve any district involved in the plat unless all of the district to be dissolved and all of each district to which attachment is proposed is included in the plat,\n(d) A statement showing that the jurisdictional fact requirements of subdivision 1 are met by the proposal,\n(e) Any proposal contained in the resolution or petition regarding the disposition of the bonded debt, outstanding energy loans made according to section 216C.37 or sections 298.292 to 298.297, capital loan obligations, or referendum levies of component districts,\n(f) Any other information the county auditor desires to include, and\n(g) The signature of the county auditor.\nThe county auditor shall submit the plat and supporting statement to the commissioner and a true copy of each to the auditor of each county containing any land area of the proposed new district.\nUpon receipt of a plat and the supporting statement, each county's auditor shall immediately notify the county's board. After such notification, and during the pendency of proceedings under the plat and supporting statement or for a period of six months, whichever is shorter, no action may be taken by the county board under any other law to modify the boundary of any district if any part of the district is included in an area proposed for consolidation.\nThe commissioner shall, upon receipt of a plat, examine it and approve, modify or reject it. The commissioner shall also approve or reject any proposal contained in the resolution or petition regarding the disposition of the bonded debt of the component districts. If the plat shows the boundaries of proposed separate election districts and if the commissioner modifies the plat, the commissioner shall also modify the boundaries of the proposed separate election districts. The commissioner shall conduct a public meeting at the nearest county seat in the area upon reasonable notice to the affected districts and county boards if requested within 20 days after submission of the plat. The public meeting may be requested by the board of any affected district, a county board of commissioners, or the petition of 20 resident voters living within the area proposed for consolidation. The commissioner shall endorse on the plat action regarding any proposal for the disposition of the bonded debt of component districts and the reasons for these actions and after a minimum of 20 days, but no more than 60 days of the date of the receipt of the plat, the commissioner shall return it to the county auditor who submitted it. The commissioner shall furnish a copy of that plat, and the supporting statement and its endorsement to the auditor of each county containing any land area of the proposed new district. If land area of a particular county was included in the plat, as submitted by the county auditor, and all of such land area is excluded in the plat as modified and approved, the commissioner shall also furnish a copy of the modified plat, supporting statement, and any endorsement to the auditor of such county.\nUpon receipt of an approved plat, the county auditor shall notify the board of any district, all or part of whose land is included in the proposed new district.\nThe board of any independent district maintaining a secondary school, the board of any common district maintaining a secondary school, all or part of whose land is included in the proposed new district, must, within 45 days of the approval of the plat by the commissioner, either adopt or reject the plan as proposed in the approved plat. If the board of any such district entitled to act on the petition rejects the proposal, the proceedings are terminated and dismissed. If any board fails to act on the plat within the time allowed, the proceedings are terminated. If any school board is unable to obtain a majority of its members' votes to accept or reject the plat and plan, a petition of residents of the district unable to obtain a majority of votes equal to 20 percent of the votes cast in the last school district general election in that district may be submitted to the county auditor requesting a public vote to accept or reject the plat and plan. The vote shall be scheduled on the next available election date. The county auditor shall notify the commissioner of the scheduled vote, conduct the election in that district and certify the results of the election to the commissioner. Other affected school boards that approve the plat and plan may choose to hold an election. If elections are conducted in each affected school district, results shall be separate and a majority vote to approve the plat and plan must be reached in each of the affected districts. If the plat and plan are rejected by the voters, a new plat and plan cannot be submitted, except by school board resolution in a district where the plat and plan were rejected, until January 1 of the year following the next school district general election.\nIf the approved plat contains land area in more than one independent district maintaining a secondary school, or common district maintaining a secondary school, and if each board entitled to act on the plat approves the plat, each board shall publish notice of its action at least once in its official newspaper. If all of the boards entitled to act on the plat call, by resolution, for an election on the question, or if five percent of the eligible voters of any such district petition the clerk of the district, within 30 days after the publication of the notice, for an election on the question, the consolidation shall not become effective until approved by a majority vote in the district at an election held in the manner provided in subdivisions 13, 14, and 15.\nIf an approved plat contains land area in any district not entitled to act on approval or rejection of the plat by action of its board, the plat may be approved by the residents of the land area within 60 days of approval of plat by the commissioner in the following manner:\nA petition calling upon the county auditor to call and conduct an election on the question of adoption or rejection of the plat may be circulated in the land area by any person residing in the area. Upon the filing of the petition with the county auditor, executed by at least 25 percent of the eligible voters in each district or part of a district contained in the land area, the county auditor shall call and conduct a special election of the electors resident in the whole land area on the question of adoption of the plat. For the purposes of this section, the term \"electors resident in the whole land area\" means any person residing on any remaining portion of land, a part of which is included in the consolidation plat. Any eligible voter owning land included in the plat who lives upon land adjacent or contiguous to that part of the voter's land included in the plat shall be included and counted in computing the 25 percent of the eligible voters necessary to sign the petition and shall also be qualified to sign the petition. Failure to file the petition within 60 days of approval of the plat by the commissioner terminates the proceedings.\nUpon an election becoming callable under provisions of subdivision 11 or 12, the board shall give ten days' posted notice of election in the area in which the election is to be held and also if a newspaper is published in the area, one weeks' published notice shall be given. The notice must specify the time, place and purpose of the election.\nThe board shall determine the date of the election as authorized by section 205A.05, subdivision 1a, the number of boundaries of voting precincts, and the location of the polling places where voting shall be conducted, and the hours the polls will be open. The board shall also provide official ballots which must be used exclusively and shall be in the following form: \"Shall the (name of school district) and the (name of school district) be consolidated as proposed? Yes .... No ....\"\nThe board must appoint election judges who shall act as clerks of election. The ballots and results must be certified to the board who shall canvass and tabulate the total vote cast for and against the proposal.\nIf a majority of the votes cast on the question at the election approve the consolidation, and if the necessary approving resolutions of boards entitled to act on the plat have been adopted, the board must, within ten days of the election, notify the county auditor who shall, within ten days of the notice or of the expiration of the period during which an election can be called, issue an order setting a date for the effective date of the change. The effective date must be July 1 of the year determined by the board in the original resolution adopted under subdivision 2. The auditor shall mail or deliver a copy of such order to each auditor holding a copy of the plat and to the clerk of each district affected by the order and to the commissioner. The board must similarly notify the county auditor if the election fails. The proceedings are then terminated and the county auditor shall so notify the commissioner and the auditors and the clerk of each district affected.\nUpon receipt of the order creating a new district, the commissioner shall, by order, assign an identification number to the new district and shall mail a copy of the order to the county auditor and to each auditor who holds a copy of the plat. If all of the territory in one and only one independent district maintaining a secondary school is included in the new independent district created pursuant to consolidation, and if the commissioner finds that it is more practical and reasonable and in the interest of efficiency and economy of operation to so do, the commissioner may assign to the new district the same number as previously held by the included independent district.\nIf no district is divided by virtue of the proceedings, all of the assets, real and personal, of the districts involved and all legally valid and enforceable claims and contract obligations of the districts pass to the new district, except as provided in section 123A.75. If a district is divided by virtue of the proceedings, upon receipt of the order of the commissioner, the auditor of the county containing the greatest land area of the new district shall present a copy of the plat and supporting statement and orders issued in the proceedings to the commissioner, together with such information as is available to that auditor concerning the assets and liabilities not secured by bonds of each district, any part of which is included in the newly created district. Thereafter within 30 days the commissioner shall issue an order providing for a division of the assets and liabilities of the districts involved and apportioning and dividing these assets and liabilities according to such terms as the commissioner may deem just and equitable. In making this division of assets and liabilities, the commissioner may consider the amount of bonded debt to be assumed by property in each area under the provisions of this section. If the order of consolidation transfers any real estate interest to the new district or to another district, the order apportioning assets and liabilities may impose a dollar claim on the district receiving the real estate in favor of any other district involved in an amount not exceeding the reasonable value of the real estate interest involved, which claim shall be paid in the manner provided by law for the enforcement of judgments.\n(a) As of the effective date of the consolidation, the bonded debt of all component districts must be paid according to the plan for consolidation proposed in the approved plat and according to this subdivision.\n(b) If the plan for consolidation so provides, the bonded debt of all component districts must be paid according to levies previously made for that debt under chapter 475. In this case, the obligation of the taxable property in the component districts with reference to the payment of such bonded debt is not affected by the consolidation.\n(c) If the plan for consolidation makes no provision for the disposition of bonded debt, all the taxable property in the newly created district is taxable for the payment of any bonded debt incurred by any component district in the proportion which the net tax capacity of that part of a preexisting district which is included in the newly created district bears to the net tax capacity of the entire preexisting district as of the time of the consolidation.\n(d) If the plan for consolidation so provides, all the taxable property in the newly created district will be taxable for a portion of the bonded debt incurred by any component district prior to the consolidation.\n(e) The county auditor shall make the apportionment required under paragraphs (c) and (d) and incorporate the apportionment as an annex to the order of the commissioner dividing the assets and liabilities of the component parts. This subdivision shall not relieve any property from any tax liability for payment of any bonded obligation but taxable property in the newly created district becomes primarily liable for the payment of bonded debts to the extent of the proportion stated.\nThe board of the newly created district, when constituted as provided in Minnesota Statutes 1990, section 122.23, subdivision 17, may provide for an election of that district on the issuance of bonds. It may issue and sell bonds authorized at the election, or bonds authorized at an election previously held in any preexisting district wholly included within the newly created district, or bonds for a purpose for which an election is not required by law. The actions may be taken at any time after the date of the county auditor's order issued under Minnesota Statutes 1990, section 122.23, subdivision 17, and before or after the date upon which the consolidation becomes effective for other purposes, and taxes for the payment of the bonds shall be levied upon all taxable property in the newly created district. No bonds shall be delivered to purchasers until 30 days after the date of the county auditor's order. If within this period a notice of appeal from the county auditor's order to the district court is filed in accordance with section 123A.49, no bonds shall be delivered by the newly created district to purchasers unless:\n(1) the county auditor's order is affirmed by final order of the district court in the special proceeding, and a period of 30 days from the service of the final order expires without an appeal being commenced; or\n(2) if an appeal is taken, the order is affirmed and the time for petitioning for further review has expired. Notwithstanding the pendency of the appeal, if all of the territory of one and only one independent district maintaining a secondary school is included in the newly created district, and if the net tax capacity of taxable property in the territory comprises 90 percent or more of the net tax capacity of all taxable property in the newly created district, then the board may issue, sell, and deliver any bonds voted by the preexisting independent district and any bonds voted or otherwise authorized by the newly created district, and the bonds must be paid by the levy of taxes upon the property within the territory of the preexisting independent district and within the other areas, if any, that are finally determined to be properly included within the newly created district. In any election held in the newly created district as authorized in the preceding sentence, all qualified electors residing within the area of that district as defined in the county auditor's order shall be entitled to vote, but the votes cast by residents of former districts or portions of former districts included in the area, other than the independent district maintaining the secondary school, shall be received and counted separately. The bonds must not be issued and sold unless authorized by a majority of the votes cast thereon by electors of the independent district maintaining the secondary school, and also by a majority of the votes cast thereon by electors residing within the entire area of the newly created district.\n(a) The county auditor shall determine a date, not less than 30 nor more than 60 days from the date that the order setting the effective date of the consolidation according to subdivision 15 was issued, to hold a special election in the district for the purpose of electing a board of six members for terms of four years and until a successor is elected and qualifies according to provisions of law governing the election of board members in independent districts. Notwithstanding the foregoing, three members of the first board must be elected to terms that expire on the first Monday in January following the first regularly scheduled school district general election that occurs more than six months after the election of the first board and three members must be elected to terms that expire on the first Monday in January following the second school district general election that occurs more than six months after the election of the first board. If the first board consists of seven members, then four members may be elected at either the first or second regularly scheduled school district general election following the election of the first board. If the resolution or petition for consolidation pursuant to subdivision 2 proposed the establishment of separate election districts, these members shall be elected from separate election districts according to the provisions of that resolution or petition and of chapter 205A.\n(b) The county auditor shall give ten days' posted notice of election in the area in which the election is to be held and also if a newspaper is published in the proposed new district, one weeks' published notice shall be given. The notice must specify the time, place, and purpose of the election.\n(c) Any person desiring to be a candidate for a school election shall file an application with the county auditor to have the applicant's name placed on the ballot for such office, specifying the term for which the application is made. The application must be filed not less than 21 days before the election.\n(d) The county auditor shall prepare, at the expense of the county, necessary ballots for the election of officers, placing thereon the names of the proposed candidates for each office. The ballots must be marked and signed as official ballots and shall be used exclusively at the election. The county auditor shall determine the number of voting precincts and the boundaries of each. The county auditor shall determine the location of polling places and the hours the polls shall be open and shall appoint three election judges for each polling place who shall act as clerks of election. Election judges shall certify ballots and results to the county auditor for tabulation and canvass.\n(e) After making a canvass and tabulation, the county auditor shall issue a certificate of election to the candidate for each office who received the largest number of votes cast for the office. The county auditor shall deliver such certificate to the person entitled to a certificate by certified mail, and each person so certified shall file an acceptance and oath of office with the county auditor within 30 days of the date of mailing of the certificate. A person who fails to qualify prior to the time specified shall be deemed to have refused to serve, but such filing may be made at any time before action to fill vacancy has been taken.\n(f) The board of each district included in the new enlarged district shall continue to maintain the schools therein until the effective date of the consolidation. Such boards shall have power and authority only to make such contracts, to do such things as are necessary to properly maintain the schools for the period prior to that date, and to certify to the county auditor according to levy limitations applicable to the component districts the taxes collectible in the calendar year when the consolidation becomes effective.\n(g) The newly elected board of the enlarged district has the immediate duty, after the members have qualified and the board has been organized, to plan for the maintenance of the school or schools of the new district for the next school year, to enter into the necessary negotiations and contracts for the employment of personnel, purchase of equipment and supplies, and other acquisition and betterment purposes, when authorized by the voters to issue bonds under the provisions of chapter 475. On the effective date of the consolidation, the newly elected board must assume the full duties of the care, management and control of the new enlarged district. The board of the new enlarged district must give due consideration to the feasibility of maintaining such existing attendance centers and of establishing such other attendance centers, especially in rural areas, as will afford equitable and efficient school administration and assure the convenience and welfare of the pupils residing in the enlarged district. The obligations of the new board to teachers employed by component districts shall be governed by the provisions of section 123A.75. The obligations of the new board to nonlicensed employees employed by component districts is governed by subdivision 21.\n(a) As of the effective date of a consolidation of two or more districts or parts of them, each nonlicensed employee employed by an affected district must be assigned to the newly created district.\n(b) As of the effective date of a consolidation, any employee organization may petition the commissioner of the Bureau of Mediation Services for a certification election under chapter 179A. An organization certified as the exclusive representative for nonlicensed employees in a particular preexisting district continues as the exclusive representative for those particular employees for a period of 90 days from the effective date of a consolidation. If a petition for representation of nonlicensed employees is filed within 90 days, an exclusive representative for those particular nonlicensed employees continues as the exclusive representative until the Bureau of Mediation Services certification proceedings are concluded.\n(c) The terms and conditions of employment of nonlicensed employees assigned to the newly created district are temporarily governed by contracts executed by an exclusive representative for a period of 90 days from the effective date of the consolidation. If a petition for representation is filed with the Bureau of Mediation Services within the 90 days, the contractual terms and conditions of employment for those nonlicensed employees who were governed by a preexisting contract continue in effect until the Bureau of Mediation Services proceedings are concluded and, if an exclusive representative has been elected, until successor contracts are executed between the board of the newly created district and the new exclusive representative. The terms and conditions of employment of nonlicensed employees assigned to the newly created district who were not governed by a collective bargaining agreement at the time of the consolidation are governed by the policies of the board of the newly created district.\n(d) The date of first employment in the newly created district is the date on which services were first performed by the employee in the preexisting district. Any sick leave, vacation time, or severance pay benefits accumulated under policies of the preexisting district or contracts between the exclusive representatives and the board of the preexisting district continue to apply in the newly created district to the employees of the preexisting districts, subject to any maximum accumulation limitations negotiated in a successor contract. Future leaves of absence, vacations, or other benefits to be accumulated in the newly created district are governed by board policy or by contract between the exclusive representative of an appropriate unit of employees and the board of the newly created district. The board of the newly created district must provide, to transferred nonlicensed employees, open enrollment in all insurance plans with no limit on preexisting conditions.\nIn case of the consolidation of two or more districts or parts of districts into a larger district, any portions or parts of divided districts which have less than four sections of land shall be attached to one or more adjoining districts by the board of county commissioners upon due notice and hearing.\nThe county auditor shall give ten days' posted notice of the hearing in the area to be attached and shall deliver a copy of the notice of hearing to the clerk of each district adjoining the area at least 30 days prior to the date set for the hearing. If any adjoining district by resolution of its board, a copy of which is served on the county board before the hearing, demands that area to be attached assume a proportionate share of the bonded debt of the demanding district, then if the order of the county board attaches any land area to such district, the taxable property in such area assumes its proportionate share of the authorized and outstanding bonded debt of the district to which it is attached.\n(a) For consolidations effective July 1, 1994, and thereafter, a board of a district may offer early retirement incentives to licensed and nonlicensed staff. The early retirement incentives that the board may offer are:\n(1) the payment of employer pension plan contributions for a specified period of allowable service credit for district employees who have at least ten years of allowable service credit in the applicable pension plan under paragraph (b);\n(2) an extended leave of absence for an eligible employee under section 122A.46;\n(3) severance payment incentives under paragraph (c); and\n(4) the employer payment of the premiums for continued health insurance coverage under paragraph (d).\nThese incentives may only be offered to employees who terminate active employment with the district or who enter into an extended leave of absence as a result of the consolidation. The board may determine the staff to whom the incentives are offered. Unilateral implementation of this section by a board is not an unfair labor practice under chapter 179A.\n(b) An employee with at least ten years of allowable service credit in the applicable pension plan who is offered an early retirement incentive under paragraph (a), clause (1), may purchase up to five additional years of allowable service credit from the applicable pension plan. To do so, the former employee must pay the member contributions to the pension plan annually in a manner and in accord with a schedule specified by the executive director of the applicable fund. If the former employee makes the member contribution, the board must make the applicable employer contribution. The salary used to determine these contributions is the salary of the person in the last year that the former employee was employed by the district. During the period of continuing member and employer contributions, the person is not considered to be an active member of the applicable pension plan, is not eligible for any active member disability or survivorship benefit coverage, and is not included in any postemployment termination benefit plan changes unless the applicable benefit legislation provides otherwise. Continued eligibility to purchase service credit under this paragraph expires if the person is subsequently employed during the service purchase period by a public employer with retirement coverage under a pension plan specified in section 356.30, subdivision 3.\n(c) Severance payment incentives must conform with sections 465.72, 465.721, and 465.722.\n(d) The board may offer a former employee continued employer-paid health insurance coverage. Coverage may not extend beyond age 65 or the end of the first month in which the employee is eligible for employer-paid health insurance coverage from a new employer. For purposes of this subdivision, \"employer-paid health insurance coverage\" means medical, hospitalization, or health insurance coverage provided through an insurance company that is licensed to do business in the state and for which the employing unit pays more than one-half of the cost of the insurance premiums.\n(e) A board may offer these incentives beginning on the day that the consolidation is approved under subdivision 14 or, if an election is not called under subdivision 11 or 12, on the day that the plat is approved by the commissioner. A board may offer these incentives until the June 30 following the effective date of the consolidation.",
	"repealed": false
}