{
	"id": "325F.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.661",
	"title": "325F.661 SALE OF ELECTRIC-ASSISTED BICYCLES AND OTHER ELECTRIC CYCLES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Class 1 electric-assisted bicycle,\" \"class 2 electric-assisted bicycle,\" and \"class 3 electric-assisted bicycle\" have the meanings given in section 169.011, subdivisions 15a, 15b, and 15c.\n(c) \"Electric-assisted bicycle\" has the meaning given in section 169.011, subdivision 27.\n(d) \"Motorcycle\" has the meaning given in section 169.011, subdivision 44.\n(e) \"Motorized bicycle\" has the meaning given in section 169.011, subdivision 45.\n(f) \"Multiple mode electric-assisted bicycle\" has the meaning given in section 169.011, subdivision 45a.\nBefore a purchase is completed, a seller of an electric-assisted bicycle must disclose to a consumer in written form:\n(1) the maximum motor power of the electric-assisted bicycle;\n(2) the maximum speed of the electric-assisted bicycle, as evaluated using a test method matching the criteria specified in Code of Federal Regulations, title 16, section 1512.2(a)(2), or successor requirements; and\n(3) whether the electric-assisted bicycle is a class 1, class 2, class 3, or multiple mode electric-assisted bicycle.\n(a) A seller of a motorized bicycle or motorcycle equipped with an electric motor for propulsion may not sell the vehicle or offer the vehicle for sale if it is labeled as a class 1, class 2, class 3, or multiple mode electric-assisted bicycle.\n(b) Before a purchase is completed and in any advertising materials, a seller of a motorized bicycle or motorcycle equipped with an electric motor for propulsion who describes the vehicle as an \"electric bicycle,\" \"electric bike,\" \"e-bike,\" or other similar term must disclose to a consumer:\n(1) the name or classification of the vehicle under state law or the most likely classification following an intended or anticipated vehicle modification as defined in section 169.011, subdivision 27, paragraph (c); and\n(2) the following statement:\n\"This vehicle is not an \"electric-assisted bicycle\" as defined in Minnesota law. It is instead a type of motor vehicle and subject to applicable motor vehicle laws if used on public roads or public lands. Your insurance policies might not provide coverage for crashes involving the use of this vehicle. To determine coverage, you should contact your insurance company or agent.\"\n(c) Advertising materials under paragraph (b) include but are not limited to a website or social media post that identifies or promotes the vehicle.\n(d) The disclosure under paragraph (b) must be (1) written, and (2) provided clearly and conspicuously and in a manner designed to attract the attention of a consumer.\nIt is an unlawful practice under section 325F.69 to advertise, offer for sale, or sell a motorized bicycle or motorcycle equipped with an electric motor for propulsion:\n(1) as an electric-assisted bicycle; or\n(2) using the words \"electric bicycle,\" \"electric bike,\" \"e-bike,\" or other similar term without providing the disclosure required under subdivision 3.",
	"repealed": false
}