{
	"id": "388.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/388.19",
	"title": "388.19 COUNTY ATTORNEYS COUNCIL.",
	"text": "There is hereby created a county attorneys council hereinafter designated as the \"council\" to be composed of the county attorney from each of the 87 counties and the attorney general of the state of Minnesota. The members shall meet annually in November of each year and, commencing at the annual meeting in November 1973, shall elect a president, a president-elect, a secretary, and a treasurer, and such other officers and directors as the county attorneys council shall determine. Each of these officers shall hold office for a term of one year and until their successors are elected and qualified. The county attorneys council may adopt such rules as are necessary for the carrying out of its duties. A county attorney may designate in writing an assistant who may act in the county attorney's stead in carrying out any function of the county attorneys council except serving as an officer. The county attorneys council may acquire and hold property, accept gifts, grants, and contributions and may charge fees for services, for seminars, workshops and publications it conducts and produces. All receipts from these sources shall be deposited in one or more special accounts in the state treasury and are appropriated to the county attorneys council for carrying out the duties described in subdivision 4.\nMS 1994 [Repealed, 1996 c 310 s 1]\nThe board of governors of the county attorneys council shall be composed of the president, the president-elect, the secretary, the treasurer, the immediate past president, and the attorney general. A vacancy in any office of the board of governors of the county attorneys council shall be filled by appointment of the remaining members of the board of governors of the county attorneys council.\nThe board of governors shall have such authority and duties as delegated to it by the council.\nThe council shall perform such functions as in its opinion shall strengthen the criminal justice system and strengthen and increase efficiency in county government in Minnesota, including but not limited to the following:\n(a) Provide training and continuing education for county attorneys and assistants.\n(b) Gather and disseminate information to county attorneys including changes in the law by rule, case decisions, and legislative enactment.\n(c) Coordinate with law enforcement, courts, and corrections providing interdisciplinary seminars to augment effectiveness of the system.",
	"repealed": false
}