{
	"id": "354.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.435",
	"title": "354.435 ADDITIONAL CONTRIBUTIONS BY SPECIAL SCHOOL DISTRICT NO. 1 AND CITY OF MINNEAPOLIS.",
	"text": "(a) Special School District No. 1, Minneapolis, and the city of Minneapolis must make additional employer contributions to the Teachers Retirement Association in the amounts specified in paragraph (b). These contributions can be made from any available source. If made in whole or in part by a levy, the levy may be classified as that of a special taxing district for purposes of sections 275.065 and 276.04, and for all other property tax purposes.\n(b) Each fiscal year $1,250,000 must be contributed by Special School District No. 1, Minneapolis, and $1,250,000 must be contributed by the city of Minneapolis to the Teachers Retirement Association, and the state shall match this total by paying to the Teachers Retirement Association $2,500,000. The superintendent of Special School District No. 1, Minneapolis, the mayor of the city of Minneapolis, and the executive director of the Teachers Retirement Association shall jointly certify to the commissioner of management and budget the total amount that has been contributed by Special School District No. 1, Minneapolis, and by the city of Minneapolis to the Teachers Retirement Association. Any certification to the commissioner of management and budget must be made quarterly. If the certifications for a fiscal year exceed the maximum annual direct state matching aid amount in any quarter, the amount of direct state matching aid payable to the Teachers Retirement Association must be limited to the balance of the maximum annual direct state matching aid amount available. The amount required under this paragraph, subject to the maximum direct state matching aid amount, is appropriated annually to the commissioner of management and budget.\n(c) The commissioner of management and budget may prescribe the form of the certifications required under paragraph (b).\nIn addition to any other required contributions, on or before June 30 each fiscal year, Special School District No. 1, Minneapolis, and the city of Minneapolis must each make an additional contribution to the Teachers Retirement Association of $1,000,000.\nIf Special School District No. 1, Minneapolis, or the city of Minneapolis fails to pay the full amount required under subdivision 1, paragraph (b), or 2, in a timely manner, the executive director is authorized to use section 354.512, or any other process in law to ensure full payment is obtained.\nThe aid amounts specified in this section must continue until the earlier of:\n(1) the first day of the fiscal year following three consecutive fiscal years in which, for each fiscal year, the actuarial value of assets of the fund equals or exceeds 100 percent of the actuarial accrued liabilities as reported by the actuary retained under section 356.214 in the annual actuarial valuation prepared under section 356.215; or\n(2) July 1, 2048.",
	"repealed": false
}