{
	"id": "326B.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.38",
	"title": "326B.38 MANUFACTURED ELECTRICAL PARTS; EXEMPTION.",
	"text": "Electrical components, apparatus, or appliances being manufactured within the limits of property which is owned or leased by a manufacturer and such manufacturer's production employees are not covered by sections 326B.31 to 326B.399.\nInstallation, alteration, or repair of electrical appliance units are not covered by sections 326B.31 to 326B.399. For the purposes of this section, \"electrical appliance units\" means all electrical and fossil fuel appliances that use electricity including, but not limited to, furnaces, water heaters, stoves, clothes washers, dryers, and dishwashers. The installation of electrical wiring to an electrical appliance unit is covered by sections 326B.31 to 326B.399.\nPlanning, laying out, and installation of heating, ventilating, air conditioning, or refrigeration units are not covered by sections 326B.31 to 326B.399. For purposes of this section, heating, ventilating, air conditioning, or refrigeration units include, but are not limited to, air conditioning units, air conditioning evaporators, air conditioning condensers, air conditioning and refrigeration chillers, boilers, furnaces, air handling units, rooftop units, humidifiers, ice makers, and supermarket, ice arena, and bar/restaurant equipment. The installation of electrical wiring to the unit is covered by sections 326B.31 to 326B.399.\nPlanning, laying out, alteration, replacement, or repair of heating, ventilating, air conditioning, or refrigeration equipment, and associated devices, controls, and wiring including wiring in or on the equipment, are not covered by sections 326B.31 to 326B.399 when the work is performed by an employee of a heating, ventilating, air conditioning, or refrigeration contractor provided that the employee performing the work has received a certificate of completion from a heating, ventilating, air conditioning, or refrigeration apprenticeship program approved by the state of Minnesota or any class of personal license issued by the commissioner. Employees registered in an approved heating, ventilating, air conditioning, or refrigeration program may design, plan, alter, replace, or repair heating, ventilating, air conditioning, or refrigeration equipment, devices, and controls including wiring in or on the equipment, under the direction of an employee who has a certificate of completion from an approved program or any class of personal license issued by the commissioner. The installation of electrical wiring to the unit is covered by sections 326B.31 to 326B.399.",
	"repealed": false
}