{
	"id": "308A.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.311",
	"title": "308A.311 ELECTION OF DIRECTORS.",
	"text": "Directors shall be elected for the term, at the time, and in the manner provided in this section and the bylaws.\nDirectors shall be elected at the regular members' meeting for the terms of office prescribed in the bylaws. Except for directors elected at district meetings, all directors shall be elected at the regular members' meeting.\n(a) A cooperative with districts or other local units may elect directors on a district or local unit basis if provided in the bylaws.\n(b) The directors may be nominated or elected at district meetings if provided in the bylaws. Directors who are nominated at district meetings shall be elected at the annual regular members' meeting by vote of the members of the entire membership, unless the bylaws provide that directors who are nominated at district meetings are to be elected by vote of the members of the district at the annual regular members' meeting.\n(a) A member may not vote by mail or electronic means for a director unless mail or electronic voting is authorized for election of directors by the articles or bylaws.\n(b) The ballot shall be in a form prescribed by the board.\n(c) If the vote is by mail, the member shall mark the ballot for the candidate chosen and mail the ballot to the cooperative in a sealed plain envelope inside another envelope bearing the member's name.\n(d) The member may vote by electronic means if the cooperative is able to authenticate that it is the cooperative member who is casting the vote.\n(e) If the ballot of the member is received by the cooperative on or before the date of the regular members' meeting, the ballot shall be accepted and counted as the vote of the absent member.\nIf voting by mail or by electronic means is authorized by the articles or the bylaws of a telephone cooperative, a member may vote by mail or by electronic means for the director in the manner prescribed in the articles or bylaws. The mail voting shall be by secret ballot.\nIf a member of a cooperative is a family farm corporation defined in section 500.24, subdivision 2, clause (c), or an authorized farm corporation defined in section 500.24, subdivision 2, clause (d), the member may elect or appoint an individual stockholder of the farm corporation residing on or actively operating the farm to be eligible for election as a director to the board.\nIf a member of a cooperative is not a natural person, family farm corporation, or an authorized farm corporation and the bylaws do not provide otherwise, the member may appoint or elect one or, for a cooperative constituted entirely of other cooperatives or associations, one or more natural persons to be eligible for election as a director to the board.",
	"repealed": false
}