{
	"id": "260C.219",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.219",
	"title": "260C.219 AGENCY RESPONSIBILITIES FOR PARENTS AND CHILDREN IN PLACEMENT.",
	"text": "(a) When a child is in foster care, the responsible social services agency shall make diligent efforts to identify, locate, and, where appropriate, offer services to both parents of the child.\n(b) The responsible social services agency shall assess whether a noncustodial or nonadjudicated parent is willing and capable of providing for the day-to-day care of the child temporarily or permanently. An assessment under this paragraph may include, but is not limited to, obtaining information under section 260C.209. If after assessment, the responsible social services agency determines that a noncustodial or nonadjudicated parent is willing and capable of providing day-to-day care of the child, the responsible social services agency may seek authority from the custodial parent or the court to have that parent assume day-to-day care of the child. If a parent is not an adjudicated parent, the responsible social services agency shall require the nonadjudicated parent to cooperate with paternity establishment procedures as part of the case plan.\n(c) If, after assessment, the responsible social services agency determines that the child cannot be in the day-to-day care of either parent, the agency shall:\n(1) prepare an out-of-home placement plan addressing the conditions that each parent must meet before the child can be in that parent's day-to-day care; and\n(2) provide a parent who is the subject of a background study under section 260C.209 15 days' notice that it intends to use the study to recommend against putting the child with that parent, and the court shall afford the parent an opportunity to be heard concerning the study.\nThe results of a background study of a noncustodial parent shall not be used by the agency to determine that the parent is incapable of providing day-to-day care of the child unless the agency reasonably believes that placement of the child into the home of that parent would endanger the child's health, safety, or welfare.\n(d) If, after the provision of services following an out-of-home placement plan under this subdivision, the child cannot return to the care of the parent from whom the child was removed or who had legal custody at the time the child was placed in foster care, the agency may petition on behalf of a noncustodial parent to establish legal custody with that parent under section 260C.515, subdivision 4. If paternity has not already been established, it may be established in the same proceeding in the manner provided for under chapter 257.\n(e) The responsible social services agency may be relieved of the requirement to locate and offer services to both parents by the juvenile court upon a finding of good cause after the filing of a petition under section 260C.141.\nThe responsible social services agency shall give notice to the parent or guardian of each child in foster care, other than a child in voluntary foster care for treatment under chapter 260D, of the following information:\n(1) that the child's placement in foster care may result in termination of parental rights or an order permanently placing the child out of the custody of the parent, but only after notice and a hearing as required under this chapter and the juvenile court rules;\n(2) time limits on the length of placement and of reunification services, including the date on which the child is expected to be returned to and safely maintained in the home of the parent or parents or placed for adoption or otherwise permanently removed from the care of the parent by court order;\n(3) the nature of the services available to the parent;\n(4) the consequences to the parent and the child if the parent fails or is unable to use services to correct the circumstances that led to the child's placement;\n(5) the first consideration for placement with relatives;\n(6) the benefit to the child in getting the child out of foster care as soon as possible, preferably by returning the child home, but if that is not possible, through a permanent legal placement of the child away from the parent;\n(7) when safe for the child, the benefits to the child and the parent of maintaining visitation with the child as soon as possible in the course of the case and, in any event, according to the visitation plan under this section; and\n(8) the financial responsibilities and obligations, if any, of the parent or parents for the support of the child during the period the child is in foster care.\nThe responsible social services agency shall inform a parent considering voluntary placement of a child under section 260C.227 of the following information:\n(1) the parent and the child each has a right to separate legal counsel before signing a voluntary placement agreement, but not to counsel appointed at public expense;\n(2) the parent is not required to agree to the voluntary placement, and a parent who enters a voluntary placement agreement may at any time request that the agency return the child. If the parent so requests, the child must be returned within 24 hours of the receipt of the request;\n(3) evidence gathered during the time the child is voluntarily placed may be used at a later time as the basis for a petition alleging that the child is in need of protection or services or as the basis for a petition seeking termination of parental rights or other permanent placement of the child away from the parent;\n(4) if the responsible social services agency files a petition alleging that the child is in need of protection or services or a petition seeking the termination of parental rights or other permanent placement of the child away from the parent, the parent would have the right to appointment of separate legal counsel and the child would have a right to the appointment of counsel and a guardian ad litem as provided by law, and that counsel will be appointed at public expense if they are unable to afford counsel; and\n(5) the timelines and procedures for review of voluntary placements under section 260C.212, subdivision 3, and the effect the time spent in voluntary placement on the scheduling of a permanent placement determination hearing under sections 260C.503 to 260C.521.\nWhen an agency accepts a child for placement, the agency shall determine whether the child has had a physical examination by or under the direction of a licensed physician within the 12 months immediately preceding the date when the child came into the agency's care. If there is documentation that the child has had an examination within the last 12 months, the agency is responsible for seeing that the child has another physical examination within one year of the documented examination and annually in subsequent years. If the agency determines that the child has not had a physical examination within the 12 months immediately preceding placement, the agency shall ensure that the child has an examination within 30 days of coming into the agency's care and once a year in subsequent years.\nRegardless of whether a child is under state guardianship, if a child leaves foster care by reason of having attained the age of majority under state law, the child must be given at no cost a copy of the child's social and medical history, as described in section 260C.212, subdivision 15, including the child's health and education report.\n(a) When a child enters foster care or moves to a new foster care placement, the responsible social services agency should attempt to coordinate a phone call between the foster parent or facility and the child's parent or legal guardian to establish a connection and encourage ongoing information sharing between the child's parent or legal guardian and the foster parent or facility; and to provide an opportunity to share any information regarding the child, the child's needs, or the child's care that would facilitate the child's adjustment to the foster home, promote stability, reduce the risk of trauma, or otherwise improve the quality of the child's care.\n(b) The responsible social services agency should attempt to coordinate the phone call in paragraph (a) as soon as practicable after the child arrives at the placement but no later than 72 hours after the child's placement. If the responsible social services agency determines that the phone call is not in the child's best interests, or if the agency is unable to identify, locate, or contact the child's parent or legal guardian despite reasonable efforts, or despite active efforts if the child is an American Indian child, the agency may delay the phone call until up to 48 hours after the agency determines that the phone call is in the child's best interests, or up to 48 hours after the child's parent or legal guardian is located or becomes available for the phone call. The responsible social services agency is not required to attempt to coordinate the phone call if placing the phone call poses a danger to the mental or physical health of the child or foster parent.\n(c) The responsible social services agency shall document the date and time of the phone call in paragraph (a), its efforts to coordinate the phone call, its efforts to identify, locate, or find availability for the child's parent or legal guardian, any determination of whether the phone call is in the child's best interests, and any reasons that the phone call did not occur, including any danger to the child's or foster parent's mental or physical health.\n(a) The responsible social services agency shall coordinate a prenatal alcohol exposure screening for any child who enters foster care as soon as practicable but no later than 45 days after the removal of the child from the child's home, if the agency has determined that the child has not previously been screened or identified as prenatally exposed to alcohol.\n(b) The responsible social services agency shall ensure that the screening is conducted in accordance with:\n(1) existing prenatal alcohol exposure screening best practice guidelines; and\n(2) the criteria developed and provided to the responsible social services agency by the statewide organization that focuses solely on prevention and intervention with fetal alcohol spectrum disorder and that receives funding under the appropriation for fetal alcohol spectrum disorder in Laws 2007, chapter 147, article 19, section 4, subdivision 2.",
	"repealed": false
}