{
	"id": "18D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/18D.01",
	"title": "18D.01 DEFINITIONS.",
	"text": "The definitions in chapters 18B, 18C, and 18F apply to this chapter.\nThe definitions in this section apply to this chapter.\n\"Agricultural chemical\" means a pesticide as defined under chapter 18B or a fertilizer, agricultural liming material, plant amendment, or soil amendment as defined under chapter 18C.\n\"Contaminated media\" means any soil, water, sediment, debris, or other material which contains an agricultural chemical at a concentration that may cause unreasonable adverse effects on the environment and is not the result of a legal use, as determined by the commissioner.\n\"Corrective action\" means an action taken to minimize, eliminate, or clean up an incident.\n\"Hazardous waste\" means a substance identified or listed as hazardous waste in the rules adopted under section 116.07, subdivision 4.\n\"Incident\" means a flood, fire, tornado, transportation accident, storage container rupture, portable container rupture, leak, spill, emission, discharge, escape, disposal, or other event that releases or immediately threatens to release an agricultural chemical accidentally or otherwise into the environment, and may cause unreasonable adverse effects on the environment. Incident does not include a release resulting from the normal use of a product or practice in accordance with law.\n\"Owner of real property\" means a person who is in possession of, has the right of control, or controls the use of real property, including without limitation a person who may be a fee owner, lessee, renter, tenant, lessor, contract for deed vendee, licensor, licensee, or occupant.\n\"Person\" means an individual, firm, corporation, partnership, association, trust, joint stock company, or unincorporated organization, the state, a state agency, or a political subdivision.\n\"Provision of this chapter\" means a provision of this chapter, chapter 18B, 18C, 18F, or a rule adopted under those chapters.\n\"Responsible party\" means a person who at the time of an incident has custody of, control of, or responsibility for a pesticide, fertilizer, pesticide or fertilizer container, or pesticide or fertilizer rinsate.",
	"repealed": false
}