{
	"id": "260C.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.221",
	"title": "260C.221 RELATIVE SEARCH AND ENGAGEMENT; PLACEMENT CONSIDERATION.",
	"text": "(a) The responsible social services agency shall exercise due diligence to identify and notify adult relatives, as defined in section 260C.007, subdivision 27, and current caregivers of a child's sibling, prior to placement or within 30 days after the child's removal from the parent, regardless of whether a child is placed in a relative's home, as required under subdivision 2. The relative search required by this section shall be comprehensive in scope.\n(b) The relative search required by this section shall include both maternal and paternal adult relatives of the child; all adult grandparents; all legal parents, guardians, or custodians of the child's siblings; and any other adult relatives suggested by the child's parents, subject to the exceptions due to family violence in subdivision 5, paragraph (b). The search shall also include getting information from the child in an age-appropriate manner about who the child considers to be family members and important friends with whom the child has resided or had significant contact. The relative search required under this section must fulfill the agency's duties under the Indian Child Welfare Act regarding active efforts to prevent the breakup of the Indian family under United States Code, title 25, section 1912(d), and to meet placement preferences under United States Code, title 25, section 1915.\n(c) The responsible social services agency has a continuing responsibility to search for and identify relatives of a child and send the notice to relatives that is required under subdivision 2, unless the court has relieved the agency of this duty under subdivision 5, paragraph (e).\n(a) The agency may provide oral or written notice to a child's relatives. In the child's case record, the agency must document providing the required notice to each of the child's relatives. The responsible social services agency must notify relatives:\n(1) of the need for a foster home for the child, the option to become a placement resource for the child, the order of placement that the agency will consider under section 260C.212, subdivision 2, paragraph (a), and the possibility of the need for a permanent placement for the child;\n(2) of their responsibility to keep the responsible social services agency and the court informed of their current address in order to receive notice in the event that a permanent placement is sought for the child and to receive notice of the permanency progress review hearing under section 260C.204. A relative who fails to provide a current address to the responsible social services agency and the court forfeits the right to receive notice of the possibility of permanent placement and of the permanency progress review hearing under section 260C.204, until the relative provides a current address to the responsible social services agency and the court. A decision by a relative not to be identified as a potential permanent placement resource or participate in planning for the child shall not affect whether the relative is considered for placement of, or as a permanency resource for, the child with that relative at any time in the case, and shall not be the sole basis for the court to rule out the relative as the child's placement or permanency resource;\n(3) that the relative may participate in the care and planning for the child, as specified in subdivision 3, including that the opportunity for such participation may be lost by failing to respond to the notice sent under this subdivision;\n(4) of the family foster care licensing and adoption home study requirements, including how to complete an application and how to request a variance from licensing standards that do not present a safety or health risk to the child in the home under section 142B.10 and supports that are available for relatives and children who reside in a family foster home;\n(5) of the relatives' right to ask to be notified of any court proceedings regarding the child, to attend the hearings, and of a relative's right to be heard by the court as required under section 260C.152, subdivision 5;\n(6) that regardless of the relative's response to the notice sent under this subdivision, the agency is required to establish permanency for a child, including planning for alternative permanency options if the agency's reunification efforts fail or are not required; and\n(7) that by responding to the notice, a relative may receive information about participating in a child's family and permanency team if the child is placed in a qualified residential treatment program as defined in section 260C.007, subdivision 26d.\n(b) The responsible social services agency shall send the notice required under paragraph (a) to relatives who become known to the responsible social services agency, except for relatives that the agency does not contact due to safety reasons under subdivision 5, paragraph (b). The responsible social services agency shall continue to send notice to relatives notwithstanding a court's finding that the agency has made reasonable efforts to conduct a relative search.\n(c) The responsible social services agency is not required to send the notice under paragraph (a) to a relative who becomes known to the agency after an adoption placement agreement has been fully executed under section 260C.613, subdivision 1. If the relative wishes to be considered for adoptive placement of the child, the agency shall inform the relative of the relative's ability to file a motion for an order for adoptive placement under section 260C.607, subdivision 6.\n(a) A relative who responds to the notice under subdivision 2 has the opportunity to participate in care and planning for a child, which must not be limited based solely on the relative's prior inconsistent participation or nonparticipation in care and planning for the child. Care and planning for a child may include but is not limited to:\n(1) participating in case planning for the child and child's parent, including identifying services and resources that meet the individualized needs of the child and child's parent. A relative's participation in case planning may be in person, via phone call, or by electronic means;\n(2) identifying the strengths and needs of the child and child's parent;\n(3) asking the responsible social services agency to consider the relative for placement of the child according to subdivision 4;\n(4) acting as a support person for the child, the child's parents, and the child's current caregiver;\n(5) supervising visits;\n(6) providing respite care for the child and having vacation visits with the child;\n(7) providing transportation;\n(8) suggesting other relatives who may be able to participate in the case plan or that the agency may consider for placement of the child. The agency shall send a notice to each relative identified by other relatives according to subdivision 2, paragraph (b), unless a relative received this notice earlier in the case;\n(9) helping to maintain the child's familiar and regular activities and contact with the child's friends and relatives, including providing supervision of the child at family gatherings and events; and\n(10) participating in the child's family and permanency team if the child is placed in a qualified residential treatment program as defined in section 260C.007, subdivision 26d.\n(b) The responsible social services agency shall make reasonable efforts to contact and engage relatives who respond to the notice required under this section. Upon a request by a relative or party to the proceeding, the court may conduct a review of the agency's reasonable efforts to contact and engage relatives who respond to the notice. If the court finds that the agency did not make reasonable efforts to contact and engage relatives who respond to the notice, the court may order the agency to make reasonable efforts to contact and engage relatives who respond to the notice in care and planning for the child.\n(a) The responsible social services agency shall consider placing a child with a relative under this section without delay and when the child:\n(1) enters foster care;\n(2) must be moved from the child's current foster setting;\n(3) must be permanently placed away from the child's parent; or\n(4) returns to foster care after permanency has been achieved for the child.\n(b) The agency shall consider placing a child with relatives:\n(1) in the order specified in section 260C.212, subdivision 2, paragraph (a); and\n(2) based on the child's best interests using the factors in section 260C.212, subdivision 2.\n(c) The agency shall document how the agency considered relatives in the child's case record.\n(d) Any relative who requests to be a placement option for a child in foster care has the right to be considered for placement of the child according to section 260C.212, subdivision 2, paragraph (a), unless the court finds that placing the child with a specific relative would endanger the child, sibling, parent, guardian, or any other family member under subdivision 5, paragraph (b).\n(e) When adoption is the responsible social services agency's permanency goal for the child, the agency shall consider adoptive placement of the child with a relative in the order specified under section 260C.212, subdivision 2, paragraph (a).\n(a) A responsible social services agency may disclose private data, as defined in section 13.02 and chapter 260E, to relatives of the child for the purpose of locating and assessing a suitable placement and may use any reasonable means of identifying and locating relatives including the Internet or other electronic means of conducting a search. The agency shall disclose data that is necessary to facilitate possible placement with relatives and to ensure that the relative is informed of the needs of the child so the relative can participate in planning for the child and be supportive of services to the child and family.\n(b) If the child's parent refuses to give the responsible social services agency information sufficient to identify the maternal and paternal relatives of the child, the agency shall ask the juvenile court to order the parent to provide the necessary information and shall use other resources to identify the child's maternal and paternal relatives. If a parent makes an explicit request that a specific relative not be contacted or considered for placement due to safety reasons, including past family or domestic violence, the agency shall bring the parent's request to the attention of the court to determine whether the parent's request is consistent with the best interests of the child. The agency shall not contact the specific relative when the juvenile court finds that contacting or placing the child with the specific relative would endanger the parent, guardian, child, sibling, or any family member. Unless section 260C.139 applies to the child's case, a court shall not waive or relieve the responsible social services agency of reasonable efforts to:\n(1) conduct a relative search;\n(2) notify relatives;\n(3) contact and engage relatives in case planning; and\n(4) consider relatives for placement of the child.\n(c) Notwithstanding chapter 13, the agency shall disclose data to the court about particular relatives that the agency has identified, contacted, or considered for the child's placement for the court to review the agency's due diligence.\n(d) At a regularly scheduled hearing not later than three months after the child's placement in foster care and as required in sections 260C.193 and 260C.202, the agency shall report to the court:\n(1) the agency's efforts to identify maternal and paternal relatives of the child and to engage the relatives in providing support for the child and family, and document that the relatives have been provided the notice required under subdivision 2; and\n(2) the agency's decision regarding placing the child with a relative as required under section 260C.212, subdivision 2. If the responsible social services agency decides that relative placement is not in the child's best interests at the time of the hearing, the agency shall inform the court of the agency's decision, including:\n(i) why the agency decided against relative placement of the child; and\n(ii) the agency's efforts to engage relatives as required under subdivision 3 to support family connections for the child.\n(e) When the court is satisfied that the agency has exercised due diligence to identify relatives and provide the notice required in subdivision 2, the court may find that the agency made reasonable efforts to conduct a relative search to identify and provide notice to adult relatives as required under section 260.012, paragraph (e), clause (3). A finding under this paragraph does not relieve the responsible social services agency of the ongoing duty to contact, engage, and consider relatives under this section nor is it a basis for the court to rule out any relative from being a foster care or permanent placement option for the child. The agency has the continuing responsibility to:\n(1) involve relatives who respond to the notice in planning for the child; and\n(2) continue considering relatives for the child's placement while taking the child's short- and long-term permanency goals into consideration, according to the requirements of section 260C.212, subdivision 2.\n(f) At any time during the course of juvenile protection proceedings, the court may order the agency to reopen the search for relatives when it is in the child's best interests.\n(g) If the court is not satisfied that the agency has exercised due diligence to identify relatives and provide the notice required in subdivision 2, the court may order the agency to continue its search and notice efforts and to report back to the court.\n(h) When the agency determines that it is necessary to prepare for permanent placement determination proceedings, or in anticipation of filing a termination of parental rights petition, the agency shall send notice to relatives who responded to a notice under this section sent at any time during the case, any adult with whom the child is currently residing, any adult with whom the child has resided for one year or longer in the past, and any adults who have maintained a relationship or exercised visitation with the child as identified in the agency case plan. The notice must state that a permanent home is sought for the child and that the individuals receiving the notice may indicate to the agency their interest in providing a permanent home. The notice must state that within 30 days of receipt of the notice an individual receiving the notice must indicate to the agency the individual's interest in providing a permanent home for the child or that the individual may lose the opportunity to be considered for a permanent placement. A relative's failure to respond or timely respond to the notice is not a basis for ruling out the relative from being a permanent placement option for the child, should the relative request to be considered for permanent placement at a later date.",
	"repealed": false
}