{
	"id": "253B.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.212",
	"title": "253B.212 COMMITMENT; RED LAKE BAND OF CHIPPEWA INDIANS; WHITE EARTH BAND OF OJIBWE.",
	"text": "The Direct Care and Treatment executive board may contract with and receive payment from the Indian Health Service of the United States Department of Health and Human Services for the care and treatment of those members of the Red Lake Band of Chippewa Indians who have been committed by tribal court order to the Indian Health Service for care and treatment of mental illness, developmental disability, or chemical dependency. The contract shall provide that the Indian Health Service may not transfer any person for admission to a state-operated treatment program unless the commitment procedure utilized by the tribal court provided due process protections similar to those afforded by sections 253B.051 to 253B.10.\nThe Direct Care and Treatment executive board may contract with and receive payment from the Indian Health Service of the United States Department of Health and Human Services for the care and treatment of those members of the White Earth Band of Ojibwe Indians who have been committed by tribal court order to the Indian Health Service for care and treatment of mental illness, developmental disability, or chemical dependency. The tribe may also contract directly with the executive board for treatment of those members of the White Earth Band who have been committed by tribal court order to the White Earth Department of Health for care and treatment of mental illness, developmental disability, or chemical dependency. The contract shall provide that the Indian Health Service and the White Earth Band shall not transfer any person for admission to a state-operated treatment program unless the commitment procedure utilized by the tribal court provided due process protections similar to those afforded by sections 253B.051 to 253B.10.\nThe Direct Care and Treatment executive board may contract with and receive payment from the Indian Health Service of the United States Department of Health and Human Services for the care and treatment of those members of any federally recognized Indian tribe within the state, who have been committed by tribal court order to the Indian Health Service for care and treatment of mental illness, developmental disability, or chemical dependency. The tribe may also contract directly with the executive board for treatment of those members of any federally recognized Indian tribe within the state who have been committed by tribal court order to the respective tribal Department of Health for care and treatment of mental illness, developmental disability, or chemical dependency. The contract shall provide that the Indian Health Service and any federally recognized Indian tribe within the state shall not transfer any person for admission to a state-operated treatment program unless the commitment procedure utilized by the tribal court provided due process protections similar to those afforded by sections 253B.051 to 253B.10.\n(a) When, under an agreement entered into pursuant to subdivision 1, 1a, or 1b, the Indian Health Service or the placing Tribe applies to a state-operated treatment program for admission of a person committed to the jurisdiction of the health service by the Tribal court due to mental illness, developmental disability, or chemical dependency, the executive board may treat the patient with the consent of the Indian Health Service or the placing Tribe.\n(b) A person admitted to a state-operated treatment program pursuant to this section has all the rights accorded by section 253B.03. In addition, treatment reports, prepared in accordance with the requirements of section 253B.12, subdivision 1, shall be filed with the Indian Health Service or the placing Tribe within 60 days of commencement of the patient's stay at the program. A subsequent treatment report shall be filed with the Indian Health Service or the placing Tribe within six months of the patient's admission to the program or prior to discharge, whichever comes first. Provisional discharge or transfer of the patient may be authorized by the head of the program only with the consent of the Indian Health Service or the placing Tribe. Discharge from the program to the Indian Health Service or the placing Tribe may be authorized by the head of the state-operated treatment program after notice to and consultation with the Indian Health Service or the placing Tribe.",
	"repealed": false
}