{
	"id": "127A.353",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.353",
	"title": "127A.353 SCHOOL TRUST LANDS DIRECTOR.",
	"text": "The school trust lands director shall be appointed by the governor. The commissioner of natural resources shall provide human resources, payroll, accounting, procurement, and other similar administrative services to the school trust lands director. The director's appointment is subject to the advice and consent of the senate.\nThe governor shall select the school trust lands director on the basis of outstanding professional qualifications and knowledge of finance, business practices, minerals, forest and real estate management, and the fiduciary responsibilities of a trustee to the beneficiaries of a trust. The school trust lands director serves in the unclassified service for a term of four years. The governor may remove the school trust lands director for cause. If a director resigns or is removed for cause, the governor shall appoint a director for the remainder of the term.\nCompensation of the school trust lands director shall be established under chapter 15A.\n(a) The school trust lands director shall:\n(1) act in a fiduciary capacity for trust beneficiaries in accordance with the principles under section 127A.351;\n(2) evaluate the school trust land asset position;\n(3) determine the estimated current and potential market value of school trust lands;\n(4) advise and provide recommendations to the governor on school trust land management policies and other policies that may affect the goal of the permanent school fund under section 127A.31;\n(5) advise and provide recommendations to the Executive Council and Land Exchange Board on all matters regarding school trust lands presented to either body;\n(6) advise and provide recommendations to the commissioner of natural resources on managing school trust lands, including but not limited to advice and recommendations on:\n(i) Department of Natural Resources school trust land management plans;\n(ii) leases of school trust lands;\n(iii) royalty agreements on school trust lands;\n(iv) land sales and exchanges;\n(v) cost certification; and\n(vi) revenue generating options;\n(7) serve as temporary trustee of school trust lands for school trust lands subject to proposed or active eminent domain proceedings;\n(8) serve as temporary trustee of school trust lands pursuant to section 94.342, subdivision 5;\n(9) submit to the Legislative Permanent School Fund Commission for review an annual budget and management plan for the director that includes proposed legislative changes that will improve the asset allocation of the school trust lands;\n(10) develop and implement a ten-year strategic plan and a 25-year framework for management of school trust lands, in conjunction with the commissioner of natural resources, that is updated every five years, with goals to:\n(i) retain core real estate assets;\n(ii) increase the value of the real estate assets and the cash flow from those assets;\n(iii) rebalance the portfolio in assets with high performance potential and the strategic disposal of selected assets;\n(iv) establish priorities for management actions;\n(v) balance revenue enhancement and resource stewardship; and\n(vi) advance strategies on school trust lands to capitalize on ecosystem services markets; and\n(11) keep the beneficiaries, governor, legislature, and the public informed about the work of the director by reporting to the Legislative Permanent School Fund Commission in a public meeting at least once during each calendar quarter.\n(b) In carrying out the duties under paragraph (a), the school trust lands director may:\n(1) direct and control money appropriated to the director;\n(2) establish job descriptions and employ staff within the limitations of money appropriated to the director;\n(3) enter into interdepartmental agreements with any other state agency;\n(4) enter into joint powers agreements under chapter 471;\n(5) evaluate and initiate real estate development projects on school trust lands in conjunction with the commissioner of natural resources and with the advice of the Legislative Permanent School Fund Commission to generate long-term economic return to the permanent school fund; and\n(6) submit recommendations on strategies for school trust land leases, sales, or exchanges to the commissioner of natural resources and the Legislative Permanent School Fund Commission.",
	"repealed": false
}