{
	"id": "192A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.02",
	"title": "192A.02 PERSONS SUBJECT TO THIS CODE; JURISDICTION.",
	"text": "(a) This code applies to all members of the state military forces as defined by section 190.05.\n(b) Subject matter jurisdiction is established if a nexus exists between an offense, either military or nonmilitary, and the state military force.\nThis code applies to a member of the military when the member is in a status provided for by United States Code, title 32, a regulation adopted pursuant to United States Code, title 32, or in state active service. This military service includes:\n(1) travel to and from the inactive duty training site of the member, pursuant to orders or regulations;\n(2) intervals between consecutive periods of inactive duty training on the same day, pursuant to orders or regulations; and\n(3) intervals between inactive duty training on consecutive days, pursuant to orders or regulations.\n(a) Courts-martial have primary jurisdiction of purely military offenses listed in section 192A.021. Except for crimes designated as purely military offenses in section 192A.021, a proper civilian tribunal has primary jurisdiction over an act or omission that violates both this code and local criminal law, foreign or domestic. In such cases a court-martial may be initiated only after the civilian authority has declined or dismissed charges, provided jeopardy has not attached. Jurisdiction over attempted crimes, conspiracy crimes, and accessory crimes must be determined by the underlying offense pursuant to section 192A.021.\n(b) If an act or omission is subject to trial by court-martial and prosecution by one or more civil tribunals, foreign or domestic, the determination of which nation, state, or agency will exercise jurisdiction is a matter for the nations, states, and agencies concerned, and is not a right of the suspect or accused.\n(c) The provisions of this chapter conferring jurisdiction over persons shall not be construed as depriving military commissions or other military tribunals of concurrent jurisdiction in respect to offenders or offenses that by statute or by law of war may be tried by such military commissions or other military tribunals.\nThe jurisdiction of the military courts and boards established by this code are presumed and the burden of proof rests on any person seeking to challenge those courts or boards of jurisdiction in any action or proceeding.",
	"repealed": false
}