{
	"id": "116J.555",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.555",
	"title": "116J.555 PRIORITIES.",
	"text": "(a) The legislature expects that applications for grants will exceed the available appropriations and the agency will be able to provide grants to only some of the applicant development authorities.\n(b) If applications for grants for qualified sites exceed the available appropriations, the agency shall make grants for sites that, in the commissioner's judgment, provide the highest return in public benefits for the public costs incurred and that meet all the requirements provided by law. In making this judgment, the commissioner shall consider the following factors:\n(1) the recommendations or ranking of projects by the commissioner of the Pollution Control Agency regarding the potential threat to public health and the environment that would be reduced or eliminated by completion of each of the response action plans;\n(2) the potential increase in the property tax base of the local taxing jurisdictions, considered relative to the fiscal needs of the jurisdictions, that will result from developments that will occur because of completion of each of the response action plans;\n(3) the social value to the community of the cleanup and redevelopment of the site, including the importance of development of the proposed public facilities on each of the sites;\n(4) the probability that each site will be cleaned up without use of government money in the reasonably foreseeable future by considering but not limited to the current market value of the site versus the cleanup cost;\n(5) the amount of cleanup costs for each site; and\n(6) the amount of the commitment of municipal or other local resources to pay for the cleanup costs.\nThe factors are not listed in a rank order of priority; rather the commissioner may weigh each factor, depending upon the facts and circumstances, as the commissioner considers appropriate. The commissioner may consider other factors that affect the net return of public benefits for completion of the response action plan. The commissioner, notwithstanding the listing of priorities and the goal of maximizing the return of public benefits, shall make grants that distribute available money to sites both within and outside of the metropolitan area. The commissioner shall provide a written statement of the supporting reasons for each grant. Unless sufficient applications are not received for qualifying sites outside of the metropolitan area, at least 35 percent of the money provided as grants must be made for sites located outside of the metropolitan area.\n(a) In making grants, the commissioner shall establish semiannual application deadlines in which grants will be authorized from all or part of the available appropriations of money in the account.\n(b) The commissioner shall annually report to the committees of the senate and house of representatives with jurisdiction over environment and natural resources finance on the status of the cleanup projects undertaken under grants made under the programs. The commissioner shall include in the annual report information on the cleanup and development activities undertaken for the grants made in that and previous fiscal years. The commissioner shall make this report no later than 120 days after the end of the fiscal year.",
	"repealed": false
}