{
	"id": "144.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.059",
	"title": "144.059 PALLIATIVE CARE ADVISORY COUNCIL.",
	"text": "The Palliative Care Advisory Council shall consist of 18 public members.\n(a) The commissioner shall appoint, in the manner provided in section 15.0597, 18 public members, including the following:\n(1) two physicians, of which one is certified by the American Board of Hospice and Palliative Medicine;\n(2) two registered nurses or advanced practice registered nurses, of which one is certified by the National Board for Certification of Hospice and Palliative Nurses;\n(3) one care coordinator experienced in working with people with serious or chronic illness and their families;\n(4) one spiritual counselor experienced in working with people with serious or chronic illness and their families;\n(5) three licensed health professionals, such as complementary and alternative health care practitioners, dietitians or nutritionists, pharmacists, or physical therapists, who are neither physicians nor nurses, but who have experience as members of a palliative care interdisciplinary team working with people with serious or chronic illness and their families;\n(6) one licensed social worker experienced in working with people with serious or chronic illness and their families;\n(7) four patients or personal caregivers experienced with serious or chronic illness;\n(8) one representative of a health plan company;\n(9) one physician assistant that is a member of the American Academy of Hospice and Palliative Medicine; and\n(10) two members from any of the categories described in clauses (1) to (9).\n(b) Council membership must include, where possible, representation that is racially, culturally, linguistically, geographically, and economically diverse.\n(c) The council must include at least six members who reside outside Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Mille Lacs, Ramsey, Scott, Sherburne, Sibley, Stearns, Washington, or Wright Counties.\n(d) To the extent possible, council membership must include persons who have experience in palliative care research, palliative care instruction in a medical or nursing school setting, palliative care services for veterans as a provider or recipient, or pediatric care.\n(e) Council membership must include health professionals who have palliative care work experience or expertise in palliative care delivery models in a variety of inpatient, outpatient, and community settings, including acute care, long-term care, or hospice, with a variety of populations, including pediatric, youth, and adult patients.\nMembers of the council shall serve for a term of three years and may be reappointed. Members shall serve until their successors have been appointed.\nThe commissioner or the commissioner's designee shall provide meeting space and administrative services for the council.\nAt the council's first meeting, and biannually thereafter, the members shall elect a chair and a vice-chair whose duties shall be established by the council.\nThe council shall meet at least twice yearly.\nPublic members of the council serve without compensation or reimbursement for expenses.\n(a) The council shall consult with and advise the commissioner on matters related to the establishment, maintenance, operation, and outcomes evaluation of palliative care initiatives in the state.\n(b) By February 15 of each year, the council shall submit to the chairs and ranking minority members of the committees of the senate and the house of representatives with primary jurisdiction over health care a report containing:\n(1) the advisory council's assessment of the availability of palliative care in the state;\n(2) the advisory council's analysis of barriers to greater access to palliative care; and\n(3) recommendations for legislative action, with draft legislation to implement the recommendations.\n(c) The Department of Health shall publish the report each year on the department's website.\nThe council is subject to the requirements of chapter 13D.\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]",
	"repealed": false
}