{
	"id": "169A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.41",
	"title": "169A.41 PRELIMINARY SCREENING TEST.",
	"text": "When a peace officer has reason to believe from the manner in which a person is driving, operating, controlling, or acting upon departure from a motor vehicle, or has driven, operated, or controlled a motor vehicle, that the driver may be violating or has violated section 169A.20 (driving while impaired), 169A.31 (alcohol-related school bus or Head Start bus driving), or 169A.33 (underage drinking and driving), or an alcohol-related violation of section 221.0314 or 221.605 committed by a driver of a commercial vehicle, the officer may require the driver to provide a sample of the driver's breath for a preliminary screening test using a device approved by the commissioner for this purpose.\nThe results of this preliminary screening test must be used for the purpose of deciding whether an arrest should be made and whether to require the tests authorized in section 169A.51 (chemical tests for intoxication), but must not be used in any court action except the following:\n(1) to prove that a test was properly required of a person pursuant to section 169A.51, subdivision 1;\n(2) in a civil action arising out of the operation or use of the motor vehicle;\n(3) in an action for license reinstatement under section 171.19;\n(4) in a prosecution for a violation of section 169A.20, subdivision 2 (driving while impaired; test refusal);\n(5) in a prosecution or juvenile court proceeding concerning a violation of section 169A.33 (underage drinking and driving), or 340A.503, subdivision 1, paragraph (a), clause (2) (underage alcohol consumption);\n(6) in a prosecution under section 169A.31 (alcohol-related school or Head Start bus driving), or 171.30 (limited license);\n(7) in a prosecution for a violation of a restriction on a driver's license under section 171.09, which provides that the license holder may not use or consume any amount of alcohol or a controlled substance; or\n(8) in a prosecution for a violation of Code of Federal Regulations, title 49, part 392, as adopted in sections 221.0314, subdivision 6, and 221.605.\nFollowing the screening test additional tests may be required of the driver pursuant to the provisions of section 169A.51 (chemical tests for intoxication).\n[Repealed, 2006 c 260 art 2 s 20]",
	"repealed": false
}