{
	"id": "515B.1-116",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.1-116",
	"title": "515B.1-116 RECORDING.",
	"text": "(a) A declaration, bylaws, a supplemental declaration, any amendment to a declaration, supplemental declaration, or bylaws, and any other instrument affecting a common interest community shall be entitled to be recorded. In those counties which have a tract index, the county recorder shall enter the declaration in the tract index for each unit or other tract affected. The county recorder shall not enter the declaration in the tract index for lands described as additional real estate, unless such lands are added to the common interest community pursuant to section 515B.2-111. The registrar of titles shall file the declaration in accordance with section 508.351 or 508A.351. The registrar of titles shall not file the declaration upon certificates of title for lands described as additional real estate, unless such lands are added to the common interest community pursuant to section 515B.2-111.\n(b) The recording officer shall upon request promptly assign a number (CIC number) to a common interest community to be formed or to a common interest community resulting from the merger of two or more common interest communities.\n(c) Documents recorded pursuant to this chapter shall in the case of registered land be filed, and references to the recording of documents shall mean filed in the case of registered land.\n(d) Except as provided in section 515B.2-109, 515B.2-112, 515B.2-114, or 515B.2-124, if a recorded document relating to a common interest community or a master association purports to require a certain vote or signatures approving any restatement or amendment of the document by a certain number or percentage of unit owners or secured parties, and if the amendment or restatement is to be recorded, an affidavit of the president or secretary of the association stating that the required vote or signatures have been obtained shall be attached to the document to be recorded and shall constitute prima facie evidence of the representations contained therein.\n(e) Except as permitted under this subsection, a recording officer shall not file or record a declaration creating a new common interest community, unless the county treasurer has certified that the property taxes payable in the current year for the real estate included in the proposed common interest community have been paid. This certification is in addition to the certification for delinquent taxes required by section 272.12. In the case of preexisting common interest communities, the recording officer shall accept, file, and record the following instruments, without requiring a certification as to the current or delinquent taxes on any of the units in the common interest community: (i) a declaration or amended declaration subjecting the common interest community to this chapter; (ii) a declaration changing the form of a common interest community pursuant to section 515B.2-123; or (iii) an amendment to or restatement of the declaration, bylaws, or CIC plat; provided, that if the declaration, amendment, or restatement changes the boundaries of an existing tax parcel, then the recording officer shall require a certification as to the payment of current and delinquent taxes on any tax parcel the boundaries of which are changed.",
	"repealed": false
}