{
	"id": "144.9505",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9505",
	"title": "144.9505 CREDENTIALING OF LEAD FIRMS AND PROFESSIONALS.",
	"text": "(a) Fees collected under this section shall be deposited into the state treasury and credited to the state government special revenue fund.\n(b) Persons shall not advertise or otherwise present themselves as lead supervisors, lead workers, lead inspectors, lead risk assessors, lead sampling technicians, lead project designers, renovation firms, or lead firms unless they have licenses or certificates issued by the commissioner under this section.\n(c) The fees required in this section for inspectors, risk assessors, and certified lead firms are waived for state or local government employees performing services for or as an assessing agency.\n(d) Individual residential property owners or an adult individual who is related to the property owner who performs regulated lead work on the residence are exempt from the licensure and firm certification requirements of this section. Notwithstanding the provisions of paragraphs (a) to (c), this exemption does not apply when the regulated lead work is a renovation performed for compensation, when a child with an elevated blood level has been identified in the residence or the building in which the residence is located, or when the residence is occupied by one or more individuals who are not related to the property owner, as defined under section 245A.02, subdivision 13.\nBefore an individual performs regulated lead work as a worker, the individual shall first obtain a license from the commissioner. No license shall be issued unless the individual shows evidence of successfully completing a training course in lead hazard control. The commissioner shall specify the course of training and testing requirements and shall charge a $50 fee annually for the license. License fees are nonrefundable and must be submitted with each application. The license must be carried by the individual and be readily available for review by the commissioner and other public health officials charged with the health, safety, and welfare of the state's citizens.\nBefore an individual performs regulated lead work as a supervisor, the individual shall first obtain a license from the commissioner. No license shall be issued unless the individual shows evidence of experience and successful completion of a training course in lead hazard control. The commissioner shall specify the course of training, experience, and testing requirements and shall charge a $50 fee annually for the license. License fees are nonrefundable and must be submitted with each application. The license must be carried by the individual and be readily available for review by the commissioner and other public health officials charged with the health, safety, and welfare of the state's citizens.\nBefore an individual performs lead inspection services, the individual shall first obtain a license from the commissioner. No license shall be issued unless the individual shows evidence of successfully completing a training course in lead inspection. The commissioner shall specify the course of training and testing requirements and shall charge a $50 fee annually for the license. License fees are nonrefundable and must be submitted with each application. The license must be carried by the individual and be readily available for review by the commissioner and other public health officials charged with the health, safety, and welfare of the state's citizens.\nBefore an individual performs lead risk assessor services, the individual shall first obtain a license from the commissioner. No license shall be issued unless the individual shows evidence of experience and successful completion of a training course in lead risk assessment. The commissioner shall specify the course of training, experience, and testing requirements and shall charge a $100 fee annually for the license. License fees are nonrefundable and must be submitted with each application. The license must be carried by the individual and be readily available for review by the commissioner and other public health officials charged with the health, safety, and welfare of the state's citizens.\nBefore an individual performs lead project designer services, the individual shall first obtain a license from the commissioner. No license shall be issued unless the individual shows evidence of experience and successful completion of a training course in lead project design. The commissioner shall specify the course of training, experience, and testing requirements and shall charge a $100 fee annually for the license. License fees are nonrefundable and must be submitted with each application. The license must be carried by the individual and be readily available for review by the commissioner and other public health officials charged with the health, safety, and welfare of the state's citizens.\n[Repealed by amendment, 2015 c 71 art 8 s 32]\nA person who performs or employs individuals to perform regulated lead work, with the exception of renovation, must obtain certification as a lead firm. The certificate must be in writing, contain an expiration date, be signed by the commissioner, and give the name and address of the person to whom it is issued. A lead firm certificate is valid for one year. The certification fee is $100, is nonrefundable, and must be submitted with each application. The lead firm certificate or a copy of the certificate must be readily available at the worksite for review by the contracting entity, the commissioner, and other public health officials charged with the health, safety, and welfare of the state's citizens.\nA person who performs or employs individuals to perform renovation for compensation must obtain certification as a renovation firm. The certificate must be in writing, contain an expiration date, be signed by the commissioner, and give the name and address of the person to whom it is issued. A renovation firm certificate is valid for two years. The certification fee is $100, is nonrefundable, and must be submitted with each application. The renovation firm certificate or a copy of the certificate must be readily available at the worksite for review by the contracting entity, the commissioner, and other public health officials charged with the health, safety, and welfare of the state's citizens.\nBefore a person provides training to lead workers, lead supervisors, lead inspectors, lead risk assessors, lead project designers, lead sampling technicians, and lead renovators, the person shall first obtain a permit from the commissioner. The permit must be in writing, contain an expiration date, be signed by the commissioner, and give the name and address of the person to whom it is issued. A training course permit is valid for two years. Training course permit fees shall be nonrefundable and must be submitted with each application in the amount of $500 for an initial training course, $250 for renewal of a permit for an initial training course, $250 for a refresher training course, and $125 for renewal of a permit of a refresher training course.\n[Repealed, 2001 c 205 art 1 s 33,43]\nMS 2022 [Repealed, 2023 c 70 art 3 s 83]\n(a) At least five working days before starting work at each regulated lead worksite, the person performing the regulated lead work shall give written notice to the commissioner and the appropriate community health board.\n(b) This provision does not apply to lead hazard screen, lead inspection, lead risk assessment, lead sampling technician, renovation, or lead project design activities.\n[Repealed, 2001 c 205 art 1 s 33,43]\nA contracting entity intending to have regulated lead work performed for its benefit shall include in the specifications and contracts for the work a requirement that the work be performed by contractors and subcontractors licensed by the commissioner under sections 144.9501 to 144.9512 and according to rules adopted by the commissioner related to regulated lead work. No contracting entity shall allow regulated lead work to be performed for its benefit unless the contracting entity has seen that the person has a valid license or certificate. A contracting entity's failure to comply with this subdivision does not relieve a person from any responsibility under sections 144.9501 to 144.9512.",
	"repealed": false
}