{
	"id": "383E.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/383E.24",
	"title": "383E.24 SUBORDINATE GOVERNMENTAL SERVICE DISTRICTS.",
	"text": "It is the purpose of this section to provide a means by which the county of Anoka as a unit of general local government can effectively provide and finance various governmental services for its residents.\n\"Subordinate service district\" means a compact and contiguous district within the county in which one or more governmental services or additions to countywide services are provided by the county and financed from revenues secured from within that district.\nNotwithstanding any provision of law requiring uniform property tax rates on real or personal property within the county, the county of Anoka may establish subordinate service districts to provide and finance any governmental service or function which it is otherwise authorized to undertake.\nThe county board of commissioners of the county of Anoka may establish a subordinate service district in a portion of the county by adoption of an appropriate resolution. Before the adoption of such a resolution, the county board shall hold a public hearing on the question of whether or not a subordinate service district shall be established. The resolution shall specify the service or services to be provided within the subordinate taxing district and shall specify the territorial boundaries of the district.\n(a) A petition signed by five percent of the qualified voters within any portion of the county may be submitted to the county board requesting the establishment of a subordinate county service district to provide any service or services which the county is otherwise authorized by law to provide. The petition shall include the territorial boundaries of the proposed service district and shall specify the types of services to be provided therein.\n(b) Upon receipt of the petition, and verification of the signatures thereon by the county auditor, the county board shall, within 30 days following verification, hold a public hearing on the question of whether or not the requested subordinate service district shall be established.\n(c) Within 30 days following the holding of a public hearing, the county board, by resolution, shall approve or disapprove the establishment of the requested subordinate county service district. A resolution approving the creation of the subordinate service district may contain amendments or modifications of the district's boundaries or functions as set forth in the petition.\nUpon passage of a resolution authorizing the creation of a subordinate county service district, the county board shall cause to be published once in the official newspapers the resolution. The resolution shall include a general description of the territory to be included within the district, the type of service or services to be undertaken in the district, a statement of the means by which the service or services will be financed, and a designation of the county agency or officer who will be responsible for supervising the provision of the service or services. The service district shall be deemed established 30 days after publication or at such later date as may be specified in the resolution.\n(a) Upon receipt of a petition signed by five percent of the qualified voters within the territory of the proposed service district prior to the effective date of its creation as specified in subdivision 6, the creation shall be held in abeyance pending a referendum vote of all qualified electors residing within the boundaries of the proposed service district.\n(b) The county board shall make arrangements for the holding of a special election on a date authorized by section 205.10, subdivision 3a, and within the boundaries of the proposed taxing district. The question to be submitted and voted upon by the qualified voters within the territory of the proposed service district shall be phrased substantially as follows:\n\"Shall a subordinate service district be established in order to provide (service or services to be provided) financed by (revenue sources)?\"\n(c) If a majority of those voting on the question favor creation of the proposed subordinate service district, the district shall be deemed created upon certification of the vote by the county auditor. The county auditor shall administer the election.\nThe county board, on its own motion or pursuant to petition, may enlarge any existing subordinate county service district pursuant to the procedures specified in subdivisions 4 to 7. Only qualified voters residing in the district to be added shall be eligible to participate in the election; provided that if five percent of the qualified voters residing in the existing service district petition to participate therein, all qualified voters residing in the proposed service district shall be eligible.\nUpon adoption of the next annual budget following the creation of a subordinate county service district, the county board shall include in such budget appropriate provisions for the operation of the subordinate service district including, as appropriate, a property tax levied only on property within the boundaries of the subordinate taxing district or by levy of a service charge against the users of such service within the district, or by any combination thereof.\nUpon receipt of a petition signed by ten percent of the qualified voters within the territory of the subordinate service district requesting the withdrawal of the service district from the provisions of this section, or pursuant to its own resolution, the county board shall make arrangements for the holding of a special election not less than 30 nor more than 90 days after receipt of such a petition within the boundaries of the service district. The question to be submitted and voted upon by the qualified voters within the territory of the service district shall be phrased substantially as follows:\n\"Shall the subordinate service district heretofore established be withdrawn and the service or services of the county as provided for such service district be discontinued?\"\nIf a majority of those voting on the question favor the withdrawal and discontinuance of such services, the service district shall be deemed withdrawn and the services of the county shall be discontinued upon certification of the vote by the county auditor. The county auditor shall administer the election.",
	"repealed": false
}