{
	"id": "216B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.10",
	"title": "216B.10 ACCOUNTING.",
	"text": "The commission shall establish a system of accounts to be kept by public utilities subject to its jurisdiction. A public utility which maintains its accounts in accordance with the system of accounts prescribed by a federal agency or authority shall be deemed to be in compliance with the system of accounts prescribed by the commission. Where optional accounting is prescribed by a federal agency or authority, the commission may prescribe which option is to be followed.\nEvery public utility engaged directly or indirectly in any other business than that of the production, transmission or furnishing of natural gas or electric service shall, if required by the commission, keep and render separately to the commission in like manner and form the accounts of all the other business, in which case all the provisions of Laws 1974, chapter 429 shall apply to the books, accounts, papers, and records of the other business.\nEvery public utility is required to keep and render its books, accounts, papers, and records accurately and faithfully in the manner and form prescribed by the commission, and to comply with all directions of the commission relating to these books, accounts, papers, and records.\nThe commission may require any public utility to file annual reports in the form and content, having regard for the provisions of this section, as the commission may require, and special reports concerning any matter about which the commission is authorized to inquire or to keep itself informed. The commission may require the reports to be verified. The basic financial statements in the annual report of a public utility may, at the direction of the public utilities commission, be examined by an independent certified public accountant and the accountant's opinion thereof included in the annual report filed with the commission.\nThe commission may require the examination and audit of all accounts, and all items shall be allocated to the accounts in the manner prescribed by the commission.\n[Repealed, 1981 c 142 s 3]",
	"repealed": false
}