{
	"id": "68A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/68A.01",
	"title": "68A.01 REAL ESTATE TITLE INSURANCE COMPANIES.",
	"text": "[Repealed, 1969 c 7 s 30]\nBefore issuing any policy or other contract of guaranty or insurance, every real estate title insurer shall set apart and keep separate a guaranty fund of $100,000 or an amount equal to two-fifths of its capital stock whichever is the greater. The guaranty fund shall be invested according to law.\nThe securities in which the guaranty fund is invested shall be duly deposited with the commissioner in accordance with section 60A.10, subdivision 4, and the commissioner's certificate thereof procured, as provided by law. This deposit shall be maintained unimpaired and the principal of the fund shall be applied only to the payments of losses and expenses by reason of its guaranty and insurance contracts, with the right to the company to collect the income thereof and to substitute other like securities of equal amount and value from time to time. In the case of a foreign insurer, the deposit may be made with the commissioner of the domicile state of such foreign insurer and that commissioner's certificate thereof shall be accepted by the commissioner.\nAfter the investment of such portion of its capital stock as hereinbefore provided and the deposit of the securities in its guaranty fund as aforesaid the remainder of its capital stock and funds may be invested in such securities, records, and equipment as the board of directors or the board of trustees of the company shall determine to be suitable for the transaction of its business, unless otherwise limited by this chapter.\nIn addition to the powers now possessed, these companies are authorized to make abstracts of title to real property for compensation.\nAn investment in a title plant or plants in an amount equal to the actual cost must be allowed as an admitted asset for title insurers. The aggregate amount of the investment must not exceed the lesser of 20 percent of admitted assets or 40 percent of surplus to policyholders, both as required to be shown on the statutory balance sheet of the insurer for its most recently filed statement with the commissioner. If the amount of the investment exceeds the limits in this subdivision, the excess amount must be recorded as a nonadmitted asset.",
	"repealed": false
}