{
	"id": "638.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/638.15",
	"title": "638.15 COMMISSION RECOMMENDATION.",
	"text": "(a) When recommending whether to grant clemency, the commission must consider any factors that the commission deems appropriate, including but not limited to:\n(1) the nature, seriousness, and circumstances of the applicant's crime; the applicant's age at the time of the crime; and the time that has elapsed between the crime and the application;\n(2) the successful completion or revocation of previous probation, parole, supervised release, or conditional release;\n(3) the number, nature, and circumstances of the applicant's other criminal convictions;\n(4) the extent to which the applicant has demonstrated rehabilitation through postconviction conduct, character, and reputation;\n(5) the extent to which the applicant has accepted responsibility, demonstrated remorse, and made restitution to victims;\n(6) whether the sentence is clearly excessive in light of the applicant's crime and criminal history and any sentence received by an accomplice and with due regard given to:\n(i) any plea agreement;\n(ii) the sentencing judge's views; and\n(iii) the sentencing ranges established by law;\n(7) whether the applicant was convicted before August 1, 2023, of a violation of section 609.19, subdivision 1, clause (1), under the theory of liability for crimes of another and, if so, whether the applicant:\n(i) was charged with a violation of section 609.185, paragraph (a), clause (3), and:\n(A) thereafter pled guilty to a violation of section 609.19, subdivision 1, clause (1);\n(B) did not cause the death of a human being; and\n(C) did not intentionally aid, advise, hire, counsel, or conspire with or otherwise procure another with the intent to cause the death of a human being; or\n(ii) was charged with a violation of section 609.19, subdivision 2, and:\n(A) thereafter pled guilty to a violation of section 609.19, subdivision 1, clause (1);\n(B) did not cause the death of a human being; and\n(C) was not a major participant, as defined in section 609.05, subdivision 2a, paragraph (c), in the underlying felony or did not act with extreme indifference to human life;\n(8) whether the applicant's age or medical status indicates that it is in the best interest of society that the applicant receive clemency;\n(9) the applicant's asserted need for clemency, including family needs and barriers to housing or employment created by the conviction;\n(10) for an applicant under the department's custody, the adequacy of the applicant's reentry plan;\n(11) the amount of time already served by the applicant and the availability of other forms of judicial or administrative relief;\n(12) the extent to which there is credible evidence indicating that the applicant is or may be innocent of the crime for which they were convicted; and\n(13) if provided by the applicant, the applicant's demographic information, including race, ethnicity, gender, disability status, and age.\n(b) Unless an applicant knowingly omitted past criminal convictions on the application, the commission or the board must not prejudice an applicant for failing to identify past criminal convictions.\n(a) At a meeting under section 638.14, the commission may recommend without a commission hearing that the board deny a commutation application without a board hearing if:\n(1) the applicant is challenging the conviction or sentence through court proceedings;\n(2) the applicant has failed to exhaust all available state court remedies for challenging the conviction or sentence; or\n(3) the commission determines that the matter should first be considered by the parole authority.\n(b) A commission recommendation to deny an application under paragraph (a) must be sent to the board along with the application.\nWhen making its recommendation on an application, the commission must consider any statement provided by a victim or law enforcement agency.\n(a) Before the board's next meeting at which the clemency application may be considered, the commission must send to the board:\n(1) the application;\n(2) the commission's recommendation on whether the board should grant or deny clemency;\n(3) the commission's recommendation on whether the board should or should not hold a hearing on the application;\n(4) any recording of the commission's meeting related to the application; and\n(5) all statements from victims and law enforcement agencies.\n(b) No later than 14 calendar days after its dated recommendation, the commission must notify the applicant in writing of its recommendations under this subdivision.",
	"repealed": false
}