{
	"id": "282.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.011",
	"title": "282.011 CLASSIFICATION AND SALE.",
	"text": "Any lands which have become the absolute property of the state through forfeiture for nonpayment of taxes and which have been classified by the county board as conservation lands under the provisions of section 282.01, or have been classified as nonagricultural lands under the provisions of section 282.14, or any such lands which shall hereafter be so classified, may be designated by the county board of the county in which such lands lie, by resolution duly adopted, as appropriate and primarily suitable for either specific conservation purposes or for auxiliary forest lands. Any resolution so adopted, together with a list of the lands involved shall be forwarded to the commissioner of natural resources who shall promptly approve or disapprove the whole or any part thereof. The commissioner shall thereupon make a certificate showing the lands approved, transmit the same to the county auditor who shall record the same. Lands so designated and so approved shall thereupon be appraised and the whole, or any part thereof, may be offered for sale and sold in the same manner as provided for the sale of lands classified as nonconservation lands under section 282.01, or as agricultural lands under section 282.14, as the case may be, according to the status of such lands upon forfeiture. The right to a deed of conveyance to such property accorded the purchaser at any such sale shall be conditioned upon the lands being placed in an auxiliary forest or used for designated conservation purposes as designated by the resolution of the county board.\nThe condition as to the placing of land into an auxiliary forest or for use for designated conservation purposes shall be a condition precedent. Any deed of conveyance of lands so placed shall be upon a form approved by the attorney general but such conveyance shall not be a fee determinable nor contain any conditions therein other than a reservation of the minerals and mineral rights to the state for its own use, or in trust for the appropriate taxing district as the case may be, according to the status of the land upon forfeiture. The land so placed, however, shall be subject to the requirements for withdrawal of lands from an auxiliary forest contained in section 88.49, subdivision 9. The procedure contained in that section shall also be applicable, so far as possible, to lands designated for conservation purposes other than an auxiliary forest.\nThe commissioner of revenue shall, if requested by the purchaser or the county attorney of the county where all or a portion of the land is situated, deliver the deed to the county attorney for use under Minnesota Statutes 2014, section 88.48, subdivision 5, but such delivery shall not be considered delivery to the purchaser. The county attorney shall be instructed when taking the transferral of the deed that said deed shall not be delivered to the purchaser unless the land involved is accepted as and placed into an auxiliary forest.\nAll deeds executed and delivered by the state pursuant to this section before the effective date of Laws 1955, chapter 389, containing conditions subsequent or conveying determinable fees, shall at the request of the purchaser, be returned to the commissioner who is herewith empowered to issue a new deed pursuant to subdivision 2.",
	"repealed": false
}