{
	"id": "3.987",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.987",
	"title": "3.987 LOCAL IMPACT NOTES FOR STATE-MANDATED ACTIONS.",
	"text": "The Legislative Budget Office shall coordinate the development of a local impact note for any proposed legislation upon request of the chair or the ranking minority member of either legislative Tax, Finance, or Ways and Means Committee. Upon receipt of a request to prepare a local impact note, the office must notify the authors of the proposed legislation that the request has been made. The local impact note must be made available to the public upon request. If the action is among the exceptions listed in section 3.988, a local impact note need not be requested nor prepared. The office shall make a reasonable and timely estimate of the local fiscal impact on each type of political subdivision that would result from the proposed legislation. The office may require any political subdivision or the commissioner of an administrative agency of the state to supply in a timely manner any information determined to be necessary to determine local fiscal impact. The political subdivision, its representative association, or commissioner shall convey the requested information to the office with a signed statement to the effect that the information is accurate and complete to the best of its ability. The political subdivision, its representative association, or commissioner, when requested, shall update its determination of local fiscal impact based on actual cost or revenue figures, improved estimates, or both. Upon completion of the note, the office must provide a copy to the authors of the proposed legislation and to the chair and ranking minority member of each committee to which the proposed legislation is referred.\nBefore a committee hearing on a bill that seeks to impose program or financial mandates on political subdivisions, the chair or ranking minority member of the committee may request that the author must provide the committee with a note that gives appropriate responses to the following guidelines. The note must state and list:\n(1) the policy goals that are sought to be attained and any performance standards that are to be imposed on political subdivisions;\n(2) any performance standards that will allow political subdivisions flexibility and innovation of method in achieving those goals;\n(3) the process by which each standard governs input such as staffing and other administrative aspects of the program;\n(4) the sources of additional revenue, in addition to existing funding for similar programs, that are directly linked to imposition of the mandates that will provide adequate and stable funding for their requirements;\n(5) the reasons why financial incentives or voluntary compliance would not yield the equity, efficiency, or desired level of statewide uniformity in the proposed program;\n(6) what input has been obtained to ensure that the implementing agencies have the capacity to carry out the delegated responsibilities; and\n(7) the efforts put forth, if any, to involve political subdivisions in the creation or development of the proposed mandate.\n[Repealed, 1998 c 389 art 16 s 36]\nExcept as specifically provided by this article, nothing in this article restricts or eliminates the authority of the state to create or impose programs by law upon political subdivisions.",
	"repealed": false
}