{
	"id": "17.4991",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4991",
	"title": "17.4991 DISEASE TRANSMISSION.",
	"text": "(a) The licensee may apply to the commissioner for designation of all or a portion of a facility as a standard, containment, or quarantine facility on forms prescribed by the commissioner as part of the license application or separately.\n(b) By 15 business days after an application is submitted, the commissioner must notify the applicant if there are any deficiencies in the application. By 30 business days after a complete application is submitted, the commissioner shall approve or deny the designation requested. A denial must include an assessment of the actual risk to wildlife populations at the particular site. A containment designation must be approved if the facility meets the disinfection requirements of subdivision 2 and complies with section 17.4982, subdivision 8.\n(a) Containment facilities must disinfect effluent prior to discharge to public waters. The effluent required to be disinfected includes water used by a containment facility in the production of the aquatic life of concern, waste or mortalities from the aquatic life of concern, and live forage or commercial feed discarded from the containment facility. Runoff from precipitation and excess water from natural springs, wells, or other sources that is not used in the production of aquatic life is not effluent to be disinfected.\n(b) The disinfection must minimize the potential release of disease pathogens to wildlife susceptible to the pathogens based on a reasonable risk assessment. Disinfection treatment processes may include chlorination or other processes. If chlorine disinfection is utilized, a measurable residual level of 1.0 parts per million of active chlorine in the effluent must be maintained for one hour of retention time. The effluent must be sufficiently dechlorinated to prevent toxic adverse impacts to wildlife after discharge to public waters.\n(c) A disinfection treatment process must ensure uninterrupted effluent treatment in the event of electrical power failure, a primary system failure, or other similar events that would cause treatment interruptions.\n(d) The effluent disinfection process must be sited, designed, and operated in a manner that allows inspection by the commissioner at all times to determine whether adequate effluent disinfection is maintained.\n(e) The commissioner may prescribe reasonable documentation of daily monitoring of treatment system performance to be included in the licensee's annual report. The records must be available for daily inspection by the commissioner during normal business hours and maintained for three years.\n(a) An aquatic farm propagating salmonids, catfish, or species on the VHS-susceptible-species list and having an effluent discharge from the aquatic farm into public waters must have a fish health inspection conducted at least once every 12 months by a certified fish health inspector. Testing must be conducted according to laboratory methods of the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases, published by the International Office of Epizootics (OIE).\n(b) An aquatic farm propagating any species on the VHS susceptible list and having an effluent discharge from the aquatic farm into public waters must test for VHS virus using the guidelines of the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases. The commissioner may, by written order published in the State Register, prescribe alternative testing time periods and methods from those prescribed in the Fish Health Blue Book or the OIE Diagnostic Manual if the commissioner determines that biosecurity measures will not be compromised. These alternatives are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The commissioner must provide reasonable notice to affected parties of any changes in testing requirements.\n(c) Results of fish health inspections must be provided to the commissioner for all fish that remain in the state. All data used to prepare and issue a fish health certificate must be maintained for three years by the issuing fish health inspector, approved laboratory, or accredited veterinarian.\n(d) A health inspection fee must be charged based on each lot of fish sampled. The fee by check or money order payable to the Department of Natural Resources must be prepaid or paid at the time a bill or notice is received from the commissioner that the inspection and processing of samples is completed.\n(e) Upon receipt of payment and completion of inspection, the commissioner shall notify the operator and issue a fish health certificate. The certification must be made according to the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases by a person certified as a fish health inspector.\n(f) All aquatic life in transit or held at transfer stations within the state may be inspected by the commissioner. This inspection may include the collection of stock for purposes of pathological analysis. Sample size necessary for analysis will follow guidelines listed in the Fish Health Blue Book or the Diagnostic Manual for Aquatic Animal Diseases.\n(g) Salmonids, catfish, or species on the VHS susceptible list must have a fish health inspection before being transported from a containment facility, unless the fish are being transported directly to an outlet for processing or other food purposes or unless the commissioner determines that an inspection is not needed. A fish health inspection conducted for this purpose need only be done on the lot or lots of fish that will be transported. The commissioner must conduct a fish health inspection requested for this purpose within five working days of receiving written notice. Salmonids and catfish may be immediately transported from a containment facility to another containment facility once a sample has been obtained for a health inspection or once the five-day notice period has expired.\nIf emergency diseases exist, the commissioner may order the aquatic life in the facility to be impounded, confiscated, sold, or destroyed and the facility disinfected. The commissioner shall make every effort to allow disposed aquatic life to be sold for market if there is no imminent danger of a significant adverse impact on natural fish populations or of escape of the pathogen to public waters.\n(a) Aquaculture therapeutics must be registered and labeled in accordance with rules adopted by the commissioner of agriculture relating to drugs and feed additives.\n(b) The Department of Agriculture may not require registration of those aquaculture therapeutics designated as low regulatory priority by the United States Food and Drug Administration.",
	"repealed": false
}