{
	"id": "500.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.14",
	"title": "500.14 FUTURE ESTATES CONSTRUED; VALIDITY; CREATING INSTRUMENTS.",
	"text": "Unless a different intent is effectively manifested, whenever property is limited upon the death of any person without \"heirs\" or \"heirs of the body\" or \"issue\" general or special, or \"descendants\" or \"offspring\" or \"children\" or any such relative described by other terms, the limitation is to take effect only when that person dies not having such relative living at the time of the person's death, or in gestation and born alive thereafter, and is not a limitation to take effect upon the indefinite failure of such relatives; nor, unless a different intent is effectively manifested, does the limitation mean that death without such relative is restricted in time to the lifetime of the creator of the interest.\nTwo or more future estates may also be created, to take effect in the alternative, so that if the first in order fails to vest the next in succession shall be substituted for it, and take effect accordingly.\nNo future estate, otherwise valid, shall be void on the ground of the probability or improbability of the contingency on which it is limited to take effect.\nWhen a remainder is limited to the heirs, or heirs of the body, of a person to whom a life estate in the same premises is given, the persons who, on the termination of the life estate, are the heirs or heirs of the body of such tenant for life shall be entitled to take as purchasers, by virtue of the remainder so limited to them. No conveyance, transfer, devise, or bequest of an interest, legal or equitable, in real or personal property, shall fail to take effect by purchase because limited to a person or persons, howsoever described, who would take the same interest by descent or distribution.\nWhen a future estate is limited to heirs, or issue, or children, posthumous children shall be entitled to take in the same manner as if living at the death of their parent.\nA future estate, depending on the contingency of the death of any person without heirs or issue or children, shall be defeated by the birth of a posthumous child of such person capable of taking by descent.",
	"repealed": false
}