{
	"id": "163.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.11",
	"title": "163.11 POWERS RELATING TO HIGHWAYS.",
	"text": "County highways may be established, altered, vacated, or revoked by resolution of the county board. Any public highway within the county, other than a trunk highway, municipal state-aid street, or county state-aid highway, may be taken over as a county highway by resolution of the county board.\nThe resolution shall contain a description of the highway. In the case of a newly established highway or the alteration of a highway, the resolution shall also contain a description of the several tracts of land through which the highway passes, the names of all persons known by the board to be the owners and occupants of each tract, and a description of the right-of-way, if any, needed therefor from each tract and the interest or estate therein to be acquired.\nAll lands or properties needed for the establishment, location, relocation, construction, reconstruction, improvement, and maintenance of a county highway may be acquired by purchase, gift, or eminent domain proceedings as provided in chapter 117 and acts supplemental thereto, or as in section 163.12, subdivisions 1 to 10.\nWhen a newly established, relocated, or altered county highway is opened for travel which takes the place of and serves the same purpose as any portion of another county highway, the county board may vacate any such portion of the other highway by resolution. The board shall cause personal service of the resolution to be made upon each occupant of land through which the vacated portions passed and shall also post notice of the resolution for at least ten days. A copy of the resolution together with proof of service and affidavit of posting shall be filed in the county auditor's office. Within 30 days after the service, any person claiming to be damaged by the vacation may appeal to the district court of the county for a determination of damages by serving notice of the appeal upon the county board and filing same with proof of service in the office of the court administrator of the district court. The appeal shall state the nature and the amount of damages claimed. It shall be tried in the same manner as an appeal from an award in eminent domain proceedings.\nA county board that has vacated a county highway under subdivision 4 may designate, as part of the vacating resolution, the former county highway as a county cartway. A highway designated as a county cartway is a county highway for purposes of this chapter, but the county board may not expend money from its road and bridge fund on the maintenance or improvement of a county cartway unless the county board determines that the expenditure is in the public interest. With the exception of the process provided in subdivision 5a, a county highway right-of-way that has been vacated, extinguished, or otherwise removed from the county highway system may not revert to a town.\nThe county board, by resolution, may revoke any county highway. The highway shall thereupon revert to the town in which it is located; provided that any such revoked highway or portion thereof lying within the corporate limits of any city shall become a street of such city. Roads or streets or any portion thereof so revoked and turned over to the town or city may be vacated by the town or city in the same manner as other town roads or city streets are vacated. If the vacation occurs within one year after the revocation by the county, damages occasioned by the vacation shall be paid by the county out of its road and bridge fund. No award of damages shall be made by the town or city for such vacation without the concurrence of the county board, and no action brought to recover damages for the vacation shall be settled or otherwise disposed of without the consent of the county board. The county board may defend any action brought to recover damages for the vacation in the same manner and to the same extent as in a proceeding to vacate a county highway.\nBefore adopting a resolution revoking a county highway that would revert in whole or in part to a town, the county board shall fix a date, time and place of hearing in the town where the highway is located to consider the revocation. Not less than 30 days before the hearing, the county board shall serve notice of the hearing by certified mail on each member of the town board of supervisors. At the hearing the town board and all interested persons shall be entitled to be heard and express their views on the proposed reversion of the highway to the town. After the hearing the county board may adopt a resolution revoking the highway. The resolution revoking the highway shall not be effective until the following conditions are met:\n(1) the county has completed repairs or improvements on the highway that are necessary to meet the county standards for a comparable road in the county in which the town is located; and\n(2) the county has properly recorded with the county recorder all county interest in real estate used for the highway.\nA county highway that is revoked by a county board to a town under this section shall be maintained by the county for a period of two years from the date of revocation.\nAny prior action taken by any county board revoking any county highway and turning over such highway to any township as a town road is hereby recognized and confirmed.\n(a) The county board may by resolution and without other action pursuant to this section or other law disclaim and extinguish a county interest in a county highway if:\n(1) the interest is not a fee interest;\n(2) the interest was established more than 40 years earlier;\n(3) the interest is not recorded with the county recorder;\n(4) no highway improvement has been constructed on a right-of-way affected by the interest; and\n(5) no highway maintenance on a right-of-way affected by the interest has occurred within the last 40 years.\n(b) The resolution shall be filed and recorded with the county auditor and recorder, and with the local governing body of any organized township or municipality.\nNot less than 30 days before the hearing on any resolution to vacate, disclaim, or extinguish a county highway or an interest in a county highway that terminates at or abuts upon any public water, the county board shall serve notice of the hearing by certified mail on the commissioner of natural resources. The notice under this subdivision is for notification purposes only and does not create a right of intervention by the commissioner of natural resources.\nNotwithstanding subdivision 5, the county board may transfer jurisdiction and ownership of a county highway to another road authority, an agency of the United States, an agency of the state, or to an Indian tribe upon agreement between the county and the authority, agency, or tribe to which the transfer is being made. Subdivision 5a provides the exclusive method of county highway reversion to towns.",
	"repealed": false
}