{
	"id": "88.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.52",
	"title": "88.52 CUTTING TIMBER; TAXATION.",
	"text": "The merchantable timber shall either be cut, or the yield tax hereinbefore mentioned shall be paid upon its value as standing timber, at the expiration of the period fixed in the contract for the duration of the auxiliary forest; or at the expiration of any renewal of the contract.\nWhen any timber growing or standing in any auxiliary forest is suitable for merchantable forest products, the commissioner shall, at the written request of the owner, a copy of which shall at the time be filed in the office of the county auditor, make an examination of the timber and designate for the owner the kind and number of trees most suitable to be cut in the judgment of the commissioner. The cutting and removal of designated trees must be in accordance with the instructions of the commissioner. The commissioner shall inspect the cutting or removal and determine whether it or the manner of its performance constitute a violation of the terms of the contract creating the auxiliary forest or of the applicable laws, or of the instructions of the commissioner relative to the cutting and removal. Any such violation is ground for cancellation of the contract by the commissioner; otherwise the contract continues in force for the remainder of the period stated in the contract, regardless of the cutting and removal. Within 90 days after the completion of any cutting or removal operation, the commissioner shall make a report of findings and transmit copies of the report to the county auditor and the surveyor general.\n(a) Upon filing of the owner's written request as provided in subdivision 2, the director of forestry, with the county board or the county land commissioner, shall determine within 30 days the kinds, quantities, and value on the stump of the timber proposed to be cut.\nBefore the cutting is to begin, the director of forestry shall file with the county auditor a report showing the kinds, quantities, and value of the timber proposed to be cut or removed and approved by the director of forestry for cutting within two years after the date of approval of the report by the director of forestry. The county auditor shall assess and levy the estimated yield tax thereon, make proper record of this assessment and levy in the auditor's office, and notify the owner of the auxiliary forest of the tax amount. The owner shall, before any timber in the forest is cut or removed, give a bond payable to the state of Minnesota, or a deposit in cash with the county treasurer, in the amount required by the report, and not less than 150 percent of the amount of the levy, conditioned for the payment of all taxes on the timber to be cut or removed. Upon receipt of notification from the county auditor that the bond or cash requirement has been deposited, the director of forestry will issue a cutting permit in accordance with the report. The owner shall keep an accurate count or scale of all timber cut. On or before April 15 following issuance of the cutting permit, and on or before April 15 of each succeeding year in which any merchantable wood products were cut on auxiliary forest lands prior to the termination of the permit, the owner of the timber covered by the permit shall file with the director of forestry a sworn statement, submitted in duplicate on a form prepared by the director of forestry, one copy of which must be transmitted to the county auditor, specifying the quantity and value of each variety of timber and kind of product cut during the preceding year ending on March 31, as shown by the scale or measurement made on the ground as cut, skidded, or loaded as the case may be. If no such scale or measurement was made on the ground, an estimate must be made and corrected by the first scale or measurement made in the due course of business. The correction must at once be filed with the director of forestry who shall immediately transmit it to the county auditor. On or before May 15 following the filing of the sworn statement covering the quantity and value of timber cut under an authorized permit, the auditor shall assess and levy a yield (severance) tax, according to Minnesota Statutes 2014, section 88.51, subdivision 2, of the timber cut during the year ending on March 31 preceding the date of assessing and levying this tax. This tax is payable and must be paid to the county treasurer on or before the following May 31. Copies of the yield (severance) tax assessment and of the yield (severance) tax payment must be filed with the director of forestry and the county auditor. Except as otherwise provided, all yield (severance) taxes herein provided for must be levied and collected, and payment, with penalties and interest, enforced in the same manner as taxes imposed under section 88.51, subdivision 1, and must be credited to the funds of the taxing districts affected in the proportion of their interests in the taxes on the land producing the yield (severance) tax. On deeming it necessary, the director of forestry may order an inspection of any or all cutting areas within an auxiliary forest and may require the owner of the auxiliary forest to produce for inspection by the director of forestry any or all cutting records pertaining to timber cutting operations within an auxiliary forest for the purpose of determining the accuracy of scale or measurement reports, and if intentional error in scale or measurement reports is found to exist, shall levy and assess a tax triple the yield (severance) tax on the stumpage value of the timber cut in excess of the quantity and value reported.\n(b) The following alternative method of assessing and paying annually the yield tax on an auxiliary forest is to be available to an auxiliary forest owner upon application and upon approval of the county board of the county within which the auxiliary forest is located.\nFor auxiliary forests entered under this paragraph, the county auditor shall assess and levy the yield tax by multiplying the acreage of each legal description included within the auxiliary forest by the acre quantity of the annual growth by species, calculated in cords, or in thousands of feet board measure Minnesota standard log scale rule, whichever is more reasonably usable, for the major species found in each type by the from year-to-year appraised stumpage prices for each of these species, used by the Division of Forestry, Department of Natural Resources, in selling trust fund timber located within the district in which the auxiliary forest is located. The assessed value of the annual growth of the auxiliary forest, thus determined, is subject to a ten percent of stumpage value yield tax, payable annually on or before May 31. In all other respects the assessment, levying and collection of the yield tax, as provided for in this subdivision must follow the procedures specified in paragraph (a).\nForest owners operating under this paragraph are subject to all other provisions of the auxiliary forest law except the provisions of paragraph (a) that are in conflict with this paragraph. Penalties for intentional failure by the owner to report properly the quantity and value of the annual growth upon an auxiliary forest entered under this paragraph and for failure to pay the yield tax when due are the same as the penalties specified in other subdivisions of this law for like failure to abide by its provisions.\nTo qualify for the assessment and levying of the yield tax by this method, the owner of the forest requesting this method of taxation must submit a map or maps and a tabulation in acres and in quantity of growth by legal descriptions showing the division of the area covered by the auxiliary forest for which this method of taxation is requested into the following forest types, namely: white and red pine; jack pine; aspen-birch; spruce-balsam fir; black spruce; tamarack; cedar; upland hardwoods; lowland hardwoods; upland brush and grass (temporarily nonproductive); lowland brush (temporarily nonproductive); and permanently nonproductive (open bogs, stagnant swamps, rock outcrops, flowage, etc.). Definition of these types and determination of the average rate or rates of growth (in cords or thousand feet, board measure, Minnesota standard log scale rule, whichever is more logically applicable for each of them) must be made by the director of the Division of Forestry, Minnesota Department of Natural Resources, with the advice and assistance of the land commissioner of the county in which the auxiliary forest is located; the director of the United States Forest Service's North Central Forest Experiment Station; and the director of the School of Forestry, University of Minnesota. Before the approval of the application of the owner of an auxiliary forest to have the auxiliary forest taxed under provisions of this paragraph is submitted to the county board, the distribution between types of the area as shown on the maps and in the tabulations submitted by the owner of the auxiliary forest must be examined and their accuracy determined by the director of the Division of Forestry, Department of Natural Resources, with the assistance of the county board of the county in which the auxiliary forest is located.\nDuring the life of the auxiliary forest, contract timber cutting operations within the various types shown upon the type map accepted as a part of the approved auxiliary forest application do not bring about a reclassification of the forest types shown upon that map or those maps until after the passage of ten years following the termination of the timber cutting operations and then only upon proof of a change in type.\nThe owner of any land or timber upon which a yield tax is assessed and levied as provided in this section may, within 15 days after mailing of notice of the amount of the tax, file with the county auditor a demand for hearing on the tax before the county board. The county auditor shall thereupon fix a date of hearing, which must be held within 30 days after the filing of the demand, and mail to the owner notice of the time and place of the hearing. The owner may appear at the meeting and present evidence and argument as to the amount of the tax and as to any related matter. The county board shall determine whether the tax as levied is proper in amount and make its order. The county auditor shall mail to the owner a notice of the order. If the amount of the tax is increased or reduced by the order, the county auditor shall make a supplemental assessment and levy, as in this subdivision provided.\nThroughout the life of any auxiliary forest, the accruing yield tax constitutes and is a first and prior lien upon all the merchantable timber and forest products growing or grown thereon; and, if not paid when due, this yield tax, together with penalties and interest as otherwise provided by law and all expenses of collecting same, continues to be a lien upon the timber and forest products however much changed in form or otherwise improved until the yield tax is fully paid. The lien may be foreclosed and the property subject to the lien dealt with by action in the name of the state, brought by the county attorney at the request of the county auditor.\nTimber cut from an auxiliary forest by an owner and used by the owner for fuel, fencing, or building on land occupied by the owner which is within or contiguous to the auxiliary forest where cut is exempt from the yield tax, and, as to timber so cut and used, the requirements of subdivisions 1 and 2 do not apply. The owner shall, prior to cutting, file with the county auditor, on a form prepared by the commissioner, a statement showing the quantity of each kind of forest products proposed to be cut and the purposes for which the products will be used.",
	"repealed": false
}