{
	"id": "256B.0947",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0947",
	"title": "256B.0947 INTENSIVE REHABILITATIVE MENTAL HEALTH SERVICES.",
	"text": "Subject to federal approval, medical assistance covers medically necessary, intensive nonresidential rehabilitative mental health services when the services are provided by an entity meeting the standards in this section. The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner, using instruments and protocols approved by the commissioner.\nFor purposes of this section, the following terms have the meanings given them.\n(a) \"Intensive nonresidential rehabilitative mental health services\" means child rehabilitative mental health services as defined in section 256B.0943, except that these services are provided by a multidisciplinary staff using a total team approach consistent with assertive community treatment, as adapted for youth, and are directed to recipients who are eight years of age or older and under 21 years of age who require intensive services to prevent admission to an inpatient psychiatric hospital or placement in a residential treatment facility or who require intensive services to step down from inpatient or residential care to community-based care.\n(b) \"Co-occurring mental illness and substance use disorder\" means a dual diagnosis of at least one form of mental illness and at least one substance use disorder. Substance use disorders include alcohol or drug abuse or dependence, excluding nicotine use.\n(c) \"Standard diagnostic assessment\" means the assessment described in section 245I.10, subdivision 6.\n(d) \"Medication education services\" means services provided individually or in groups, which focus on:\n(1) educating the client and client's family or significant nonfamilial supporters about mental illness and symptoms;\n(2) the role and effects of medications in treating symptoms of mental illness; and\n(3) the side effects of medications.\nMedication education is coordinated with medication management services and does not duplicate it. Medication education services are provided by physicians, pharmacists, or registered nurses with certification in psychiatric and mental health care.\n(e) \"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n(f) \"Provider agency\" means a for-profit or nonprofit organization established to administer an assertive community treatment for youth team.\n(g) \"Substance use disorders\" means one or more of the disorders defined in the diagnostic and statistical manual of mental disorders, current edition.\n(h) \"Transition services\" means:\n(1) activities, materials, consultation, and coordination that ensures continuity of the client's care in advance of and in preparation for the client's move from one stage of care or life to another by maintaining contact with the client and assisting the client to establish provider relationships;\n(2) providing the client with knowledge and skills needed posttransition;\n(3) establishing communication between sending and receiving entities;\n(4) supporting a client's request for service authorization and enrollment; and\n(5) establishing and enforcing procedures and schedules.\n(i) \"Treatment team\" means all staff who provide services to recipients under this section.\n(j) \"Family peer specialist\" means a staff person who is qualified under section 256B.0616.\nAn eligible recipient is an individual who:\n(1) is eight years of age or older and under 21 years of age;\n(2) is diagnosed with a serious mental illness or co-occurring mental illness and substance use disorder, for which intensive nonresidential rehabilitative mental health services are needed;\n(3) has received a level of care assessment as defined in section 245I.02, subdivision 19, that indicates a need for intensive integrated intervention without 24-hour medical monitoring and a need for extensive collaboration among multiple providers;\n(4) has received a functional assessment as defined in section 245I.02, subdivision 17, that indicates functional impairment and a history of difficulty in functioning safely and successfully in the community, school, home, or job; or who is likely to need services from the adult mental health system during adulthood; and\n(5) has had a recent standard diagnostic assessment that documents that intensive nonresidential rehabilitative mental health services are medically necessary to ameliorate identified symptoms and functional impairments and to achieve individual transition goals.\n(a) Intensive nonresidential rehabilitative mental health services, supports, and ancillary activities that are covered by a single daily rate per client must include the following, as needed by the individual client:\n(1) individual, family, and group psychotherapy;\n(2) individual, family, and group skills training, as defined in section 256B.0943, subdivision 1, paragraph (u);\n(3) crisis planning as defined in section 245.4871, subdivision 9a;\n(4) medication management provided by a physician, an advanced practice registered nurse with certification in psychiatric and mental health care, or a physician assistant;\n(5) mental health case management as provided in section 256B.0625, subdivision 20;\n(6) medication education services as defined in this section;\n(7) care coordination by a client-specific lead worker assigned by and responsible to the treatment team;\n(8) psychoeducation of and consultation and coordination with the client's biological, adoptive, or foster family and, in the case of a youth living independently, the client's immediate nonfamilial support network;\n(9) clinical consultation to a client's employer or school or to other service agencies or to the courts to assist in managing the mental illness or co-occurring disorder and to develop client support systems;\n(10) coordination with, or performance of, crisis intervention and stabilization services as defined in section 256B.0624;\n(11) transition services;\n(12) co-occurring substance use disorder treatment as defined in section 245I.02, subdivision 11; and\n(13) housing access support that assists clients to find, obtain, retain, and move to safe and adequate housing. Housing access support does not provide monetary assistance for rent, damage deposits, or application fees.\n(b) The provider shall ensure and document the following by means of performing the required function or by contracting with a qualified person or entity: client access to crisis intervention services, as defined in section 256B.0624, and available 24 hours per day and seven days per week.\n(a) The intensive nonresidential rehabilitative mental health services provider agency shall have a contract with the commissioner to provide intensive transition youth rehabilitative mental health services.\n(b) The commissioner shall develop performance evaluation criteria for providers, including county providers, and may require applicants and providers to submit documentation as needed to allow the commissioner to determine whether the criteria are met.\n(a) Services must meet the standards in this section and chapter 245I as required in section 245I.011, subdivision 5.\n(b) The treatment team must have specialized training in providing services to the specific age group of youth that the team serves. An individual treatment team must serve youth who are: (1) at least eight years of age or older and under 16 years of age, or (2) at least 14 years of age or older and under 21 years of age.\n(c) The treatment team for intensive nonresidential rehabilitative mental health services comprises both permanently employed core team members and client-specific team members as follows:\n(1) Based on professional qualifications and client needs, clinically qualified core team members are assigned on a rotating basis as the client's lead worker to coordinate a client's care. The core team must comprise at least four full-time equivalent direct care staff and must minimally include:\n(i) a mental health professional who serves as team leader to provide administrative direction and treatment supervision to the team;\n(ii) an advanced-practice registered nurse with certification in psychiatric or mental health care or a board-certified child and adolescent psychiatrist, either of which must be credentialed to prescribe medications;\n(iii) a mental health certified peer specialist who is qualified according to section 245I.04, subdivision 10, and is also a former children's mental health consumer; and\n(iv) a co-occurring disorder specialist who meets the requirements under section 256B.0622, subdivision 7a, paragraph (a), clause (4), who will provide or facilitate the provision of co-occurring disorder treatment to clients.\n(2) The core team may also include any of the following:\n(i) additional mental health professionals;\n(ii) a vocational specialist;\n(iii) an educational specialist with knowledge and experience working with youth regarding special education requirements and goals, special education plans, and coordination of educational activities with health care activities;\n(iv) a child and adolescent psychiatrist who may be retained on a consultant basis;\n(v) a clinical trainee qualified according to section 245I.04, subdivision 6;\n(vi) a mental health practitioner qualified according to section 245I.04, subdivision 4;\n(vii) a case management service provider, as defined in section 245.4871, subdivision 4;\n(viii) a housing access specialist; and\n(ix) a family peer specialist as defined in subdivision 2, paragraph (j).\n(3) A treatment team may include, in addition to those in clause (1) or (2), ad hoc members not employed by the team who consult on a specific client and who must accept overall clinical direction from the treatment team for the duration of the client's placement with the treatment team and must be paid by the provider agency at the rate for a typical session by that provider with that client or at a rate negotiated with the client-specific member. Client-specific treatment team members may include:\n(i) the mental health professional treating the client prior to placement with the treatment team;\n(ii) the client's current substance use counselor, if applicable;\n(iii) a lead member of the client's individualized education program team or school-based mental health provider, if applicable;\n(iv) a representative from the client's health care home or primary care clinic, as needed to ensure integration of medical and behavioral health care;\n(v) the client's probation officer or other juvenile justice representative, if applicable; and\n(vi) the client's current vocational or employment counselor, if applicable.\n(d) The treatment supervisor shall be an active member of the treatment team and shall function as a practicing clinician at least on a part-time basis. The treatment team shall meet with the treatment supervisor at least weekly to discuss recipients' progress and make rapid adjustments to meet recipients' needs. The team meeting must include client-specific case reviews and general treatment discussions among team members. Client-specific case reviews and planning must be documented in the individual client's treatment record.\n(e) The staffing ratio must not exceed ten clients to one full-time equivalent treatment team position.\n(f) The treatment team shall serve no more than 80 clients at any one time. Should local demand exceed the team's capacity, an additional team must be established rather than exceed this limit.\n(g) Nonclinical staff shall have prompt access in person or by telephone to a mental health practitioner, clinical trainee, or mental health professional. The provider shall have the capacity to promptly and appropriately respond to emergent needs and make any necessary staffing adjustments to ensure the health and safety of clients.\n(h) The intensive nonresidential rehabilitative mental health services provider shall participate in evaluation of the assertive community treatment for youth (Youth ACT) model as conducted by the commissioner, including the collection and reporting of data and the reporting of performance measures as specified by contract with the commissioner.\n(i) A regional treatment team may serve multiple counties.\nThe standards in this subdivision apply to intensive nonresidential rehabilitative mental health services.\n(a) The treatment team must use team treatment, not an individual treatment model.\n(b) Services must be available at times that meet client needs.\n(c) Services must be age-appropriate and meet the specific needs of the client.\n(d) The level of care assessment as defined in section 245I.02, subdivision 19, and functional assessment as defined in section 245I.02, subdivision 17, must be updated at least every six months or prior to discharge from the service, whichever comes first.\n(e) The treatment team must complete an individual treatment plan for each client, according to section 245I.10, subdivisions 7 and 8, and the individual treatment plan must:\n(1) be completed in consultation with the client's current therapist and key providers and provide for ongoing consultation with the client's current therapist to ensure therapeutic continuity and to facilitate the client's return to the community. For clients under the age of 18, the treatment team must consult with parents and guardians in developing the treatment plan;\n(2) if a need for substance use disorder treatment is indicated by validated assessment:\n(i) identify goals, objectives, and strategies of substance use disorder treatment;\n(ii) develop a schedule for accomplishing substance use disorder treatment goals and objectives; and\n(iii) identify the individuals responsible for providing substance use disorder treatment services and supports; and\n(3) provide for the client's transition out of intensive nonresidential rehabilitative mental health services by defining the team's actions to assist the client and subsequent providers in the transition to less intensive or \"stepped down\" services.\n(f) The treatment team shall actively and assertively engage the client's family members and significant others by establishing communication and collaboration with the family and significant others and educating the family and significant others about the client's mental illness, symptom management, and the family's role in treatment, unless the team knows or has reason to suspect that the client has suffered or faces a threat of suffering any physical or mental injury, abuse, or neglect from a family member or significant other.\n(g) For a client age 18 or older, the treatment team may disclose to a family member, other relative, or a close personal friend of the client, or other person identified by the client, the protected health information directly relevant to such person's involvement with the client's care, as provided in Code of Federal Regulations, title 45, part 164.502(b). If the client is present, the treatment team shall obtain the client's agreement, provide the client with an opportunity to object, or reasonably infer from the circumstances, based on the exercise of professional judgment, that the client does not object. If the client is not present or is unable, by incapacity or emergency circumstances, to agree or object, the treatment team may, in the exercise of professional judgment, determine whether the disclosure is in the best interests of the client and, if so, disclose only the protected health information that is directly relevant to the family member's, relative's, friend's, or client-identified person's involvement with the client's health care. The client may orally agree or object to the disclosure and may prohibit or restrict disclosure to specific individuals.\n(h) The treatment team shall provide interventions to promote positive interpersonal relationships.\n(a) Payment for services in this section must be based on one daily encounter rate per provider inclusive of the following services received by an eligible client in a given calendar day: all rehabilitative services, supports, and ancillary activities under this section, staff travel time to provide rehabilitative services under this section, and crisis response services under section 256B.0624.\n(b) Payment must not be made to more than one entity for each client for services provided under this section on a given day. If services under this section are provided by a team that includes staff from more than one entity, the team shall determine how to distribute the payment among the members.\n(c) The commissioner shall establish regional cost-based rates for entities that will bill medical assistance for nonresidential intensive rehabilitative mental health services. In developing these rates, the commissioner shall consider:\n(1) the cost for similar services in the health care trade area;\n(2) actual costs incurred by entities providing the services;\n(3) the intensity and frequency of services to be provided to each client;\n(4) the degree to which clients will receive services other than services under this section; and\n(5) the costs of other services that will be separately reimbursed.\n(d) The rate for a provider must not exceed the rate charged by that provider for the same service to other payers.\n(e) Effective for the rate years beginning on and after January 1, 2024, rates must be annually adjusted for inflation using the Centers for Medicare and Medicaid Services Medicare Economic Index, as forecasted in the third quarter of the calendar year before the rate year. The inflation adjustment must be based on the 12-month period from the midpoint of the previous rate year to the midpoint of the rate year for which the rate is being determined.\n[See Note.]\n(a) The rate for intensive rehabilitative mental health services does not include medical assistance payment for services in clauses (1) to (7). Services not covered under this paragraph may be billed separately:\n(1) inpatient psychiatric hospital treatment;\n(2) partial hospitalization;\n(3) children's mental health day treatment services;\n(4) physician services outside of care provided by a psychiatrist serving as a member of the treatment team;\n(5) medical assistance room and board rate, as defined in section 256B.056, subdivision 5d;\n(6) home and community-based waiver services; and\n(7) other mental health services identified in the child's individualized education program.\n(b) The following services are not covered under this section and are not eligible for medical assistance payment while youth are receiving intensive rehabilitative mental health services:\n(1) mental health residential treatment; and\n(2) mental health behavioral aide services, as defined in section 256B.0943, subdivision 1, paragraph (l).\nThe commissioner shall establish and administer treatment teams with consideration given to regional distribution. Providers shall apply directly to the commissioner for enrollment and must be reimbursed at rates established by contract. The commissioner shall perform the program review.\nThe commissioner shall publish prior authorization criteria and standards to be used for intensive nonresidential rehabilitative mental health services, as provided in section 256B.0625, subdivision 25.",
	"repealed": false
}