{
	"id": "290.9727",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.9727",
	"title": "290.9727 TAX ON CERTAIN BUILT-IN GAINS.",
	"text": "For an S corporation electing S corporation status pursuant to section 1362 of the Internal Revenue Code after December 31, 1986, and having a recognized built-in gain as defined in section 1374 of the Internal Revenue Code, there is imposed a tax on the taxable income of such S corporation, as defined in this section, at the rate prescribed by section 290.06, subdivision 1. This subdivision does not apply to any corporation having an S election in effect for each of its taxable years. An S corporation and any predecessor corporation must be treated as one corporation for purposes of the preceding sentence.\nIn the case of the transfer of assets from a C corporation to an S corporation as described in section 1374(d)(8) of the Internal Revenue Code, a tax is imposed on the taxable income of the S corporation, as defined in this section, at the rate prescribed in section 290.06, subdivision 1.\nFor purposes of this section, taxable income means taxable net income less the deduction for net operating loss carryforwards as provided by this section.\nFor purposes of this section, taxable net income means the lesser of:\n(1) the recognized built-in gains of the S corporation for the taxable year, as determined under section 1374 of the Internal Revenue Code, subject to the modifications provided in section 290.0135, that are allocable to this state under section 290.17, 290.191, or 290.20; or\n(2) the amount of the S corporation's federal taxable income, as determined under section 1374(d)(4) of the Internal Revenue Code, subject to the provisions of sections 290.0131 to 290.0135, that is allocable to this state under section 290.17, 290.191, or 290.20.\nA net operating loss carryforward, as determined under section 290.095, arising in a taxable year before the corporation elected S corporation status, shall be allowed as a deduction against the lesser of the amounts referred to in subdivision 3, clauses (1) and (2). For purposes of determining the amount of any such loss that may be carried to later taxable years, the lesser of the amounts referred to in subdivision 3, clauses (1) and (2), shall be treated as taxable income.\nAny credit carryforward allowed under this chapter and arising in a taxable year in which the corporation was a C corporation is allowed as a credit against the tax imposed by this section.",
	"repealed": false
}