{
	"id": "142E.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.09",
	"title": "142E.09 REPORTING AND PAYMENTS.",
	"text": "The commissioner shall specify requirements for reports under the authority provided in section 142A.03, subdivision 2, paragraph (o).\nThe commissioner shall make monthly payments on a reimbursement basis for expenditures reported outside of the electronic system used to administer child care assistance. Payments may be withheld if monthly reports are incomplete or untimely.\nThe county and designated administering agency shall submit a biennial child care fund plan to the commissioner. The commissioner shall establish the dates by which the county must submit the plans. The plan shall include:\n(1) a description of strategies to coordinate and maximize public and private community resources, including school districts, health care facilities, government agencies, neighborhood organizations, and other resources knowledgeable in early childhood development, in particular to coordinate child care assistance with existing community-based programs and service providers including child care resource and referral programs, early childhood family education, school readiness, Head Start, local interagency early intervention committees, special education services, early childhood screening, and other early childhood care and education services and programs to the extent possible, to foster collaboration among agencies and other community-based programs that provide flexible, family-focused services to families with young children and to facilitate transition into kindergarten. The county must describe a method by which to share information, responsibility, and accountability among service and program providers;\n(2) a description of procedures and methods to be used to make copies of the proposed state plan reasonably available to the public, including members of the public particularly interested in child care policies such as parents, child care providers, culturally specific service organizations, child care resource and referral programs, interagency early intervention committees, potential collaborative partners and agencies involved in the provision of care and education to young children, and allowing sufficient time for public review and comment; and\n(3) information as requested by the department to ensure compliance with the child care fund statutes and rules promulgated by the commissioner.\nThe commissioner shall notify counties within 90 days of the date the plan is submitted whether the plan is approved or the corrections or information needed to approve the plan. The commissioner shall withhold a county's allocation until it has an approved plan. Plans not approved by the end of the second quarter after the plan is due may result in a 25 percent reduction in allocation. Plans not approved by the end of the third quarter after the plan is due may result in a 100 percent reduction in the allocation to the county. Counties are to maintain services despite any reduction in their allocation due to plans not being approved.",
	"repealed": false
}