{
	"id": "62Q.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.075",
	"title": "62Q.075 LOCAL PUBLIC ACCOUNTABILITY AND COLLABORATION PLAN.",
	"text": "[Repealed by amendment, 2001 c 171 s 1]\nBeginning October 31, 2004, all health maintenance organizations shall file a plan every four years with the commissioner of health describing the actions the health maintenance organization intends to take to contribute to achieving one or more high priority public health goals. This plan must be jointly developed in collaboration with the local public health units, and other community organizations providing health services within the same service area as the health maintenance organization. Local government units with responsibilities and authority defined under chapter 145A may designate individuals to participate in the collaborative planning with the health maintenance organization to provide expertise and represent community needs and goals as identified under chapter 145A. Every other year, beginning October 31, 2002, all health maintenance organizations shall file reports updating progress on the four-year collaboration plan.\nThe plan must address the following:\n(1) specific measurement strategies and a description of any activities which contribute to one or more high priority public health goals;\n(2) description of the process by which the health maintenance organization will coordinate its activities with the community health boards, and other relevant community organizations servicing the same area;\n(3) documentation indicating that local public health units and local government unit designees were involved in the development of the plan; and\n(4) documentation of compliance with the plan filed previously, including data on the previously identified progress measures.\nUpon receipt of the plan, the commissioner of health shall provide a copy to the local community health boards, and other relevant community organizations within the health maintenance organization's service area. After reviewing the plan, these community groups may submit written comments on the plan to the commissioner of health and may advise the commissioner of the health maintenance organization's effectiveness in assisting to achieve high priority public health goals. The plan may be reviewed by the county boards, or city councils acting as a community health board in accordance with chapter 145A, within the health maintenance organization's service area to determine whether the plan is consistent with the goals and objectives of the plans required under chapter 145A and whether the plan meets the needs of the community. The county board, or applicable city council, may also review and make recommendations on the availability and accessibility of services provided by the health maintenance organization. The county board, or applicable city council, may submit written comments to the commissioner of health, and may advise the commissioner of the health maintenance organization's effectiveness in assisting to meet the needs and goals as defined under the responsibilities of chapter 145A. Copies of these written comments must be provided to the health maintenance organization. The plan and any comments submitted must be filed with the information clearinghouse to be distributed to the public.",
	"repealed": false
}