{
	"id": "156.077",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.077",
	"title": "156.077 LICENSED VETERINARY TECHNICIANS.",
	"text": "(a) The board shall issue a license to practice as a veterinary technician to an applicant who satisfies the requirements in this section and those imposed by the board in rule. A licensed veterinary technician may practice veterinary technology. A person may not use the title \"veterinary technician\" or the abbreviation \"LVT\" unless licensed by the board.\n(b) The board may adopt by rule additional or temporary alternative licensure requirements or definitions for veterinary technician titles.\nApplication for a license to practice veterinary technology in this state shall be made to the board on a form furnished by the board and accompanied by evidence satisfactory to the board that the applicant is at least 18 years of age, is of good moral character, and has:\n(1) graduated from a veterinary technology program accredited or approved by the American Veterinary Medical Association or Canadian Veterinary Medical Association;\n(2) received a passing score for the Veterinary Technician National Examination;\n(3) received a passing score for the Minnesota Veterinary Technician Jurisprudence Examination; and\n(4) completed a criminal background check.\nA completed application must contain the following information and material:\n(1) the application fee set by the board, which is not refundable if permission to take the jurisprudence examination is denied for good cause;\n(2) proof of graduation from a veterinary technology program accredited or approved by the American Veterinary Medical Association or Canadian Veterinary Medical Association;\n(3) affidavits from at least two licensed veterinarians and three adults who are not related to the applicant that establish how long, when, and under what circumstances the references have known the applicant and any other facts that may enable the board to determine the applicant's qualifications; and\n(4) if the applicant has served in the armed forces, a copy of the applicant's discharge papers.\n(a) The board shall consider an application for licensure submitted by a person before July 1, 2031, if the person provides evidence satisfactory to the board that the person:\n(1) is a certified veterinary technician in good standing with the Minnesota Veterinary Medical Association; or\n(2) has at least 4,160 hours actively engaged in the practice of veterinary technology within the previous five years.\n(b) Each applicant under this subdivision must also submit to the board affidavits from at least two licensed veterinarians and three adults who are not related to the applicant that establish how long, when, and under what circumstances the references have known the applicant and any other facts that may enable the board to determine the applicant's qualifications.",
	"repealed": false
}