{
	"id": "515B.3-104",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-104",
	"title": "515B.3-104 TRANSFER OF SPECIAL DECLARANT RIGHTS; SPECIAL DECLARANT RIGHTS TRANSFERRED BEFORE AUGUST 1, 2010.",
	"text": "(a) A special declarant right created or reserved under this chapter may be voluntarily transferred only by a separate instrument evidencing the transfer recorded in every county in which any part of the common interest community is located. The separate instrument shall be recorded against all units in the common interest community, or in the case of a cooperative, against the real estate owned by the cooperative, or in the case of a condominium on registered land, the instrument must be filed pursuant to section 508.351, subdivision 3, or 508A.351, subdivision 3. The instrument may provide for the conveyance of less than all of the special declarant rights, and is not effective unless executed by the transferor and transferee. A deed in lieu of foreclosure, or other conveyance arising out of a foreclosure or cancellation, shall not be deemed a voluntary transfer within the meaning of this section.\n(b) Upon the voluntary transfer of any special declarant right, the liability of a transferor declarant is as follows:\n(1) A transferor is not relieved of any obligation or liability arising before the transfer and remains liable for warranty obligations imposed on the transferor by this chapter. Lack of privity does not deprive any unit owner of standing to maintain an action to enforce any obligation of the transferor.\n(2) If a successor to any special declarant right is an affiliate of a declarant, the transferor is jointly and severally liable with the successor for any obligations or liabilities of the successor relating to the common interest community.\n(3) If a transferor retains any special declarant rights, but transfers other special declarant rights to a successor who is not an affiliate of the declarant, the transferor is liable for any obligations or liabilities imposed on a declarant by this chapter or by the declaration relating to the retained special declarant rights and arising before or after the transfer.\n(4) A transferor has no liability for any act or omission or any breach of a contractual or warranty obligation arising from the exercise of a special declarant right by a successor declarant who is not an affiliate of the transferor.\n(c) Upon the voluntary transfer of any special declarant right, the liability of a successor declarant is as follows:\n(1) A successor to any special declarant right who is an affiliate of a declarant is subject to all obligations and liabilities imposed on the transferor by this chapter or the declaration.\n(2) A successor to any special declarant right who is not an affiliate of a declarant is subject to all obligations and liabilities imposed by this chapter or by the declaration, except:\n(i) misrepresentations by any previous declarant;\n(ii) warranty obligations on improvements made by any previous declarant, or made before the common interest community was created;\n(iii) breach of any fiduciary obligation by any previous declarant or the declarant's appointees to the board;\n(iv) any liability or obligation imposed on the transferor as a result of the transferor's acts or omissions after the transfer; and\n(v) any liability arising out of a special declarant right which was not transferred as provided in subsection (a).\n(d) In case of foreclosure of a mortgage or cancellation of a contract for deed or other security interest (or conveyance in lieu thereof), sale by a trustee under an agreement creating a security interest, tax sale, judicial sale, or sale under bankruptcy code or receivership proceedings, of any units or additional real estate, or interest therein, owned by a declarant, a person acquiring title to the property or interests succeeds to all special declarant rights related to the property or interests held by that declarant and acquired by it unless (i) the mortgage instrument or other instrument creating the security interest, (ii) the instrument conveying title, or (iii) a separate instrument signed by the person and recorded within 60 days after the person acquires title to the property or interests, provides for transfer of less than all special declarant rights. The separate instrument need be recorded only against the title to the units or interests other than those being acquired under this subsection, or in the case of a cooperative, against the real estate owned by the cooperative. The declarant shall cease to have or exercise any special declarant rights which are transferred. If the person has limited the transfer of certain special declarant rights as provided in this subsection, then it and its successor's liability shall be limited, as follows:\n(1) If the person or its successor limits its rights and liabilities only to maintain models, sales office and signs, and if that party is not an affiliate of a declarant, it is not subject to any liability or obligations as a declarant, except the obligation to provide a disclosure statement and any liability arising from that obligation, and it may not exercise any other special declarant rights.\n(2) If the person or its successor is not an affiliate of a declarant, it may declare its intention in a recorded instrument as provided in subsection (a) to acquire all special declarant rights and hold those rights solely for transfer to another person. Thereafter, until the special declarant rights are transferred to a person acquiring title to any unit owned by the successor, or until a separate instrument is recorded permitting exercise of all of those rights, that successor may not exercise any of those rights other than the right to control the board of directors in accordance with the provisions of section 515B.3-103 for the duration of any period of declarant control. So long as any successor may not exercise its special declarant rights under this subsection, it is not subject to any liability or obligation as a declarant other than liability for its acts and omissions under section 515B.3-103.\n(e) Any attempted exercise by a purported successor to a special declarant right which is not transferred as provided in this section is void, and any purported successor attempting to exercise that right shall be liable for any damages arising out of its actions.\n(f) Nothing in this section shall subject any successor to a special declarant right to any claims against or other obligations of a transferor declarant, other than claims and obligations arising under this chapter, or the declaration or bylaws.\n(g) This section applies only to transfers of special declarant rights that are effective before August 1, 2010.",
	"repealed": false
}