{
	"id": "473.412",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.412",
	"title": "473.412 METRO TRANSIT CLEANING AND REPAIR STANDARDS; REPORT REQUIRED.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Cleaning\" means the removal of litter, refuse, food, glass, bodily fluids, offensive odors, or other debris.\n(c) \"Graffiti\" has the meaning given in section 617.90, subdivision 1.\n(d) \"Transit station\" means a wholly or partially enclosed structure provided for public use as a waiting area in conjunction with light rail transit, bus rapid transit, or regular route transit and includes any property, structures, fixtures, equipment, appurtenances, improvements, heating elements, lighting, fare collection, or any other property that is owned, leased, held, or used for the purpose of providing and supporting public transit.\n(e) \"Transit vehicle\" means light rail transit trains, bus rapid transit vehicles, buses servicing regular route intervals, or any other vehicle owned or operated by a public entity for the purpose of providing public transit.\n(f) \"Vandalism\" means a person defacing, marring, damaging, removing, injuring, displacing, destroying, or tampering with any transit facility or transit vehicle equipment, property, structures, fixtures, or appurtenances.\n(a) The Metropolitan Council must adopt standards on cleanliness and repair of transit vehicles and stations. To the extent practicable, the standards must address:\n(1) cleaning requirements for transit stations and vehicles operated by the council;\n(2) a strategy for discovering and removing vandalism, graffiti, or other defacement to transit stations or vehicles operated by the council;\n(3) a proposal for the timely repair of damage to transit stations and transit vehicle fixtures, structures, or other property used for the purpose of supporting public transit; and\n(4) any other cleanliness standards necessary to provide a quality ridership experience for all transit users.\n(b) The Metropolitan Council must provide information on the council's website on how the council solicits public feedback on cleanliness and rider experience at transit stations and on transit vehicles. The council must post conspicuous notice of the public feedback options at each light rail transit station and bus rapid transit station operated by the council.\n(a) By October 1, 2024, and every year thereafter, the Metropolitan Council must report to the chairs and ranking minority members of the legislative committees with jurisdiction over transit policy and finance on transit cleanliness and the ridership experience.\n(b) The report under paragraph (a) must provide information on the council's cleanliness standards required under subdivision 2, including whether the council adopted new cleanliness standards or revisions to current cleanliness standards. A report prepared under this subdivision must include information gathered from the required public feedback on cleanliness and rider experience required in subdivision 2, paragraph (b). The council must consider and recommend revisions to cleanliness standards based on the collection of public feedback and must summarize feedback received by the council in the report.\n(c) A report submitted under this subdivision must include:\n(1) the total expenditures for cleaning and repairing transit stations and transit vehicles;\n(2) the frequency, type, and location of repairs;\n(3) whether specific transit stations needed a higher proportion of cleaning or repairs and detail the council's strategy to resolve identified and persistent concerns at those locations;\n(4) recommendations to address workforce challenges for the implementation and maintenance of cleanliness and repair standards adopted by the council, including whether the council maintained agreements with third-party services for cleaning and repair;\n(5) whether the council has adopted preventative measures against vandalism or graffiti; and\n(6) any recommendations for additions to the transit rider code of conduct under section 473.4065 or the transit rider investment program under section 473.4075.",
	"repealed": false
}