{
	"id": "204B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.07",
	"title": "204B.07 NOMINATING PETITIONS.",
	"text": "A nominating petition may consist of one or more separate pages each of which shall state:\n(a) the office sought;\n(b) the candidate's name and residence address, including street and number if any; and\n(c) the candidate's political party or political principle expressed in not more than three words. No candidate who files for a partisan office by nominating petition shall use the term \"nonpartisan\" as a statement of political principle or the name of the candidate's political party. No part of the name of a major political party may be used to designate the political party or principle of a candidate who files for a partisan office by nominating petition, except that the word \"independent\" may be used to designate the party or principle. A candidate who files an affidavit of candidacy to fill a vacancy in nomination for a nonpartisan office pursuant to section 204B.13, shall not state any political principle or the name of any political party on the petition.\nThis subdivision does not apply to candidates for presidential elector or alternate nominated by major political parties. Major party candidates for presidential elector or alternate are certified under section 208.03. Other presidential electors or alternates are nominated by petition pursuant to this section. On petitions nominating presidential electors or alternates, the names of the candidates for president and vice-president shall be added to the political party or political principle stated on the petition. One petition may be filed to nominate a slate of presidential electors equal in number to the number of electors to which the state is entitled and an alternate for each elector nominee.\nNo nominating petition shall contain the name of more than one candidate except a petition jointly nominating individuals for governor and lieutenant governor or nominating a slate of presidential electors.\nFollowing the information required by subdivisions 1 and 2 and before the space for signing, each separate page that is part of the petition shall include an oath in the following form:\n\"I solemnly swear (or affirm) that I know the contents and purpose of this petition, that I do not intend to vote at the primary election for the office for which this nominating petition is made, and that I signed this petition of my own free will.\"\nNotarization or certification of the signatures on a nominating petition is not required. Immediately after the signature, the signer shall write on the petition the signer's residence address including street and number, if any, and mailing address if different from residence address.\nAn official with whom petitions are filed shall make sample forms for nominating petitions available upon request.\nAn individual who, in signing a nominating petition, makes a false oath is guilty of perjury.",
	"repealed": false
}