{
	"id": "273.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.072",
	"title": "273.072 AGREEMENTS FOR JOINT ASSESSMENT.",
	"text": "Any county and any city or town lying wholly or partially within the county and constituting a separate assessment district may, by agreement entered into under section 471.59, provide for the assessment of property in the municipality or town by the county assessor. Any two or more cities or towns constituting separate assessment districts may enter into an agreement under section 471.59 for the assessment of property in the contracting units by the assessor of one of the units or by an assessor who is jointly employed.\nThe agreement may provide for the abolition of the office of local assessor in any contracting unit when the assessment of property within it is to be made under the agreement by another assessor. In such case, the office of assessor in that unit shall cease to exist upon the date fixed in the agreement but not before the end of the term of the incumbent, if serving for a fixed term, or when an earlier vacancy occurs.\nWhen the agreement provides for joint employment of an assessor, the assessor shall be appointed and removed in a manner and shall hold office for such term as is provided in the agreement, notwithstanding charter or other statutory provisions for election or appointment of an assessor for a prescribed term.\nIf the agreement is for an indefinite term, it may be terminated on six months notice by either party. Upon the termination of the agreement, whether for a fixed or indefinite term, any office of assessor abolished as a result of the agreement shall be automatically reestablished and shall be filled as provided by applicable law or charter.\nAny amount paid to the county for personal services of the county assessor under such an agreement shall be paid into the general revenue fund of the county.\nAgreements made under this section have no effect upon the powers and duties of local boards of review and equalization.",
	"repealed": false
}