{
	"id": "280.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/280.38",
	"title": "280.38 LANDS BID IN FOR THE STATE; ATTACHMENTS.",
	"text": "When any parcel of land is bid in for the state, until the land be redeemed, the sale shall not operate as a payment of the amount for which the same is sold, but at any time after such sale the county auditor may make and file with the court administrator where the judgment is entered an affidavit stating the date of the sale, the amount for which such parcel was bid in for the state, and the amount of all subsequent delinquent taxes, that there has been no redemption, and that the land is rented, in whole or in part, and produces rent, and giving the names of the persons paying rent. Upon presentation of such affidavit, the judge or court commissioner for the county shall endorse thereon an order directing an attachment to issue to attach the rents of such lands. The court administrator shall thereupon issue a writ directing the sheriff to attach the rents accruing for such land from any person, and to collect therefrom the amount for which the same was bid in for the state, and the amount of all subsequent delinquent taxes, stating such amount and the date of sale, with penalties and interest accruing thereon, and the sheriff's fees, and $1 for the costs of the affidavit and attachment. The sheriff shall serve such writ by serving a copy thereof on each tenant or person in possession of such land paying rent therefor, or for any part thereof, and such service shall operate as an attachment of all rents accruing from the person served. The sheriff shall receive such rents as they become due, and may bring suit in the sheriff's own name to collect the same, and shall pay into the county treasury the amount collected. No payment of rents by any person so served after such service, or prior thereto for the purpose of defeating such attachment, shall be valid against such attachment. The court administrator shall be allowed for issuing the writ, including the filing of the affidavit, order of allowance, writ, and return, 50 cents, to be paid to the administrator by the county in which the taxes are levied; provided, that in counties whose population exceeds 150,000 such fees shall be paid into the county treasury to the use of the county. The sheriff shall be allowed for serving the writ and collecting the money the same fees as are allowed by law upon an execution in a civil action; and, if the sheriff brings suit, such additional compensation as the court may allow, not exceeding one-half of the fees allowed by law for like services in ordinary cases.\nIf, at any time while the sheriff is collecting such rent, the lease upon such property shall expire, or, if the sheriff has once commenced to collect such rent and the property becomes vacant, the county auditor may lease the property upon five days' notice to the owner, subject to the approval of the district court.\nAt any time while the sheriff is collecting the rent under any lease, no modification of the lease between the owner and the tenant shall be valid unless approved by the district court upon five days' notice to the county auditor.\nThe collection of such rent under this statute shall not be a bar to the county auditor selling the land at a forfeited tax sale under the present laws or any laws hereafter enacted.\nIn case any unplatted land is bid in for the state and is cropped upon a share agreement with the owner, or by a trespasser, the owner's share of such crop; or, in case of a trespasser, all or any part of such crops, may be attached and collected in the same manner as rents and applied upon delinquent taxes. The term \"crops\" shall include hay and grass. In case there is no agreement for rent, or in case of an occupant or trespasser on the unplatted land without any agreement for rent, then the attachment shall attach to and bind all of the grass, hay, and crops produced on such lands; provided, that the district court may, upon application by such occupant, upon ten days' notice to the owner and the county auditor, and a showing by the occupant to the satisfaction of the court that the occupancy was not a willful trespass, release to such occupant the excess of such crops over and above the owner's or landlord's share of the grass, hay, and crops of such premises as determined by the court. Such application must be made not later than 60 days after the date of the service of the writ of attachment upon such occupant, and if not made within such time it shall be considered that such occupant has waived all right and claim to such crops. The county auditor may give to the owner or person entitled to the possession of such unplatted land during the crop season at least ten days' notice, in writing, by mail or otherwise, specifying the time and place at which application will be made to the district court for an order permitting the leasing of such land, and the district court may, if it deems it to be for the best interest of such person and of the public, make an order fixing the terms upon which such lease may be made by the county auditor, in the name of the county. The county auditor may then execute, in the name of the county, such lease in writing as the court shall order. No such lease shall be for a longer term than the current crop season. If the name or address of such person is unknown to the county auditor, such notice may be given by one publication in a legal newspaper in the county. If the owner or person entitled to such possession shall show to the court an intent to lease such unplatted land or make a contract for cropping the same upon shares, the court may make such order as it deems best to provide for an attachment of all or a part of the rents or crop share of such person and for applying the same upon the delinquent taxes. In any proceeding for the collection of rents on unplatted land on which the taxes have been bid in by the state, the court may, upon motion, order that payment, when made as to any part or the whole, be paid to the county treasurer to apply upon taxes. The owner of such unplatted properties may make application to the district court for release from applying all or a portion of such rents upon such taxes upon showing, by reason of the condition, cost of upkeep of the property, or other cause, undue hardship upon such owner or detriment to such property. The provisions affecting unplatted lands shall not apply to lands or real estate actually used or occupied by the owner thereof.\nThe county board may allow additional clerk hire to the county auditor for work in making such leases, which leases shall be made in the name of the county, and the county shall have the right to bring suit for unpaid rents under such leases and to bring the necessary actions to secure evictions of tenants to whom it has leased.\nAttachments, leases, and proceedings issued and made pursuant to this section shall not be deemed unfinished business that may be retained by the sheriff at expiration of the sheriff's term, as provided by section 387.10.\nThe right of the county auditor to sell the land at the forfeited tax sale, shall continue until all delinquent taxes described in the writ of attachment are paid.",
	"repealed": false
}