{
	"id": "245.4712",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4712",
	"title": "245.4712 COMMUNITY SUPPORT AND DAY TREATMENT SERVICES.",
	"text": "(a) County boards must provide or contract for sufficient community support services within the county to meet the needs of adults with serious and persistent mental illness who are residents of the county. Adults may be required to pay a fee according to section 245.481. The community support services program must be designed to improve the ability of adults with serious and persistent mental illness to:\n(1) find and maintain competitive employment;\n(2) handle basic activities of daily living;\n(3) participate in leisure time activities;\n(4) set goals and plans; and\n(5) obtain and maintain appropriate living arrangements.\nThe community support services program must also be designed to reduce the need for and use of more intensive, costly, or restrictive placements both in number of admissions and length of stay.\n(b) Community support services are those services that are supportive in nature and not necessarily treatment oriented, and include:\n(1) conducting outreach activities such as home visits, health and wellness checks, and problem solving;\n(2) connecting people to resources to meet their basic needs;\n(3) finding, securing, and supporting people in their housing;\n(4) attaining and maintaining health insurance benefits;\n(5) assisting with job applications, finding and maintaining employment, and securing a stable financial situation;\n(6) fostering social support, including support groups, mentoring, peer support, and other efforts to prevent isolation and promote recovery; and\n(7) educating about mental illness, treatment, and recovery.\n(c) Community support services shall use all available funding streams. The county shall maintain the level of expenditures for this program, as required under section 245.4835. County boards must continue to provide funds for those services not covered by other funding streams and to maintain an infrastructure to carry out these services. The county is encouraged to fund evidence-based practices such as Individual Placement and Supported Employment and Illness Management and Recovery.\n(d) The commissioner shall collect data on community support services programs, including, but not limited to, demographic information such as age, sex, race, the number of people served, and information related to housing, employment, hospitalization, symptoms, and satisfaction with services.\n(a) Day treatment services must be developed as a part of the community support services available to adults with serious and persistent mental illness residing in the county. Adults may be required to pay a fee according to section 245.481. Day treatment services must be designed to:\n(1) provide a structured environment for treatment;\n(2) provide support for residing in the community;\n(3) prevent placement in settings that are more intensive, costly, or restrictive than necessary and appropriate to meet client need;\n(4) coordinate with or be offered in conjunction with a local education agency's special education program; and\n(5) operate on a continuous basis throughout the year.\n(b) An adult day treatment program must comply with medical assistance requirements in section 256B.0671, subdivision 3.\n(c) County boards may request a waiver from including day treatment services if they can document that:\n(1) an alternative plan of care exists through the county's community support services for clients who would otherwise need day treatment services;\n(2) day treatment, if included, would be duplicative of other components of the community support services; and\n(3) county demographics and geography make the provision of day treatment services cost ineffective and infeasible.\nThe county board must offer to help adults with serious and persistent mental illness in applying for state and federal benefits, including Supplemental Security Income, medical assistance, Medicare, general assistance, and Minnesota supplemental aid. The help must be offered as part of the community support program available to adults with serious and persistent mental illness for whom the county is financially responsible and who may qualify for these benefits.",
	"repealed": false
}