{
	"id": "61A.282",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.282",
	"title": "61A.282 INVESTMENTS IN NAME OF COMPANY OR NOMINEE AND PROHIBITIONS.",
	"text": "A company's investments shall be held in its corporate name or its nominee name, except that:\n(a) Investments may be held in the name of a clearing corporation or of a custodian bank or in the name of the nominee of either under the following conditions:\n(1) The clearing corporation, custodian bank, or nominee must be legally authorized to hold the particular investment for the account of others;\n(2) Where the investment is evidenced by a certificate and held in the name of a custodian bank or the nominee of a custodian bank, a written agreement shall provide that certificates so deposited shall at all times be kept separate and apart from other deposits with the depository, so that at all times they may be identified as belonging solely to the company making the deposit; or\n(3) Where a clearing corporation is to act as depository, the investment may be merged or held in bulk in the clearing corporation's name, or in the name of its nominee, together with any other investments deposited with the clearing corporation by any other person, if a written agreement provides that adequate evidence of the deposit will be obtained and retained by the company or a custodian bank.\nAs used in this subdivision, the term \"custodian bank\" means a bank or trust company licensed by the United States or any state thereof.\n(b) A company may participate, through a bank or trust company which is a member of the Federal Reserve System, in the Federal Reserve's book-entry system, if the records of the member bank or trust company at all times show that the investments are held for the company and/or for specific accounts of the company.\n(c) If an investment consists of an individual interest in a pool of obligations, or of a fractional interest in a single obligation, the certificate of participation or interest, or the confirmation of participation or interest in the investment, shall be held in the manner set forth in paragraph (a) or held in the name of the company.\n(d) Where an investment is not evidenced by a certificate, except as provided in paragraph (b), adequate evidence of the company's investment shall be obtained from the issuer or its transfer or recording agent and retained by the company, a custodian bank, or clearing corporation. Adequate evidence, for purposes of this section, shall mean a written receipt or other verification issued by the depository or issuer or a custodian bank which shows that the investment is held for the company. Transfers of ownership of investments held as described in paragraphs (a)(3), (b), and (c) may be evidenced by bookkeeping entry on the books of the issuer of the investment or its transfer or recording agent or the clearing corporation without physical delivery of certificates, if any, evidencing the company's investment.\n(e) Investments or cash posted as collateral or variation margin (other than initial margin amounts) in connection with qualified financial contracts, as defined in section 60B.03, subdivision 22, are not subject to this subdivision.\nA company may loan securities held by it under this chapter to a broker-dealer registered under the Securities and Exchange Act of 1934 or to a bank which is a member of the Federal Reserve System, under the following conditions:\n(a) The market value of loaned securities outstanding at any one time, excluding securities held in a separate account established pursuant to section 61A.14, subdivision 1, shall not exceed 40 percent of the company's admitted assets as of the December 31 immediately preceding.\n(b) The company is limited to no more than two percent of its admitted assets as of the December 31 immediately preceding being subject to lending of securities with any one borrower.\n(c) Each loan must be evidenced by a written agreement which provides:\n(1) that the loan will be fully collateralized by cash or obligations issued or guaranteed by the United States or an agency or an instrumentality thereof, and that the collateral will be adjusted each business day during the term of the loan to maintain the required collateral in the event of market value changes in the loaned securities or collateral;\n(2) that the loan may be terminated by the company at any time, and that the borrower must return the loaned securities or their equivalent within five business days after termination;\n(3) that the company has the right to retain the collateral or to use the collateral to purchase securities equivalent to the loaned securities if the borrower defaults under the terms of the agreement; and\n(4) that the borrower remains liable for any losses and expenses, not covered by the collateral, which are incurred by the company due to default.\nNo officer, director, or member of any committee passing on investments shall borrow any of the funds, or become, directly or indirectly, liable as a surety or endorser for or on account of loans thereof to others, or receive for personal use any fee, brokerage, commission, gift or other consideration for, or on account of, any loan made by or on behalf of the company.",
	"repealed": false
}