{
	"id": "134.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.201",
	"title": "134.201 REGIONAL LIBRARY DISTRICT.",
	"text": "Regional public library districts may be established under this section in the areas of the existing Great River Regional Library System and the East Central Regional Library System. The geographic boundaries shall be those established by the commissioner of education under section 134.34, subdivision 3.\nA regional public library district may be formed by:\n(1) approval of a majority of the city councils and boards of county commissioners of the cities and counties that finance regional public library system services and represent a majority of the population to be served; or\n(2) a majority of those voting on the issue in the entire area to be served by the district in a referendum called after petitions for the referendum have been filed in each of the local governmental units. Petitions must be signed by eligible voters in a number not less than five percent of the number of persons who voted in the last general election in each city and county that is a party to the system contract or agreement.\nA city that is not participating in a regional public library system may join the district by majority vote of the city council or by referendum under clause (2) and with the approval of the board of the regional public library district.\nA regional public library district may be terminated at any time after the district has been in operation for three years. The procedure for termination is the same as that for creation under subdivision 2, clause (2).\n(a) If the district is formed under subdivision 2, clause (1), the board of the public regional library district shall be composed of one county commissioner or the commissioner's designee from each county in the district's service area and one elected member from each county for each ten percent or a major fraction of the district's population. A majority of the members of the board must be elected members.\n(b) If the district is formed under subdivision 2, clause (2), the board of the regional library district shall be composed of one member elected from each county in the district's service area and one member elected from each county for each ten percent or a major fraction of the district's population.\n(c) Elected board members shall be elected at large from a county at a November election. Board members elected shall assume office on the following January 2. The term of a member shall be four years, with the terms of an initial board to expire in two years for one-half of the members. The board shall organize itself under section 134.11, subdivision 1. The board has the powers and duties set forth in section 134.11, subdivision 2.\nThe board may levy for operation of public library service. This levy shall replace levies for operation of public library service by cities and counties authorized in section 134.07. The amount levied shall be spread on the net tax capacity of all taxable property in the district at a uniform tax rate.\n(a) The maximum amount that may be levied by a board under this section is the greater of:\n(1) the statewide average local support per capita for public library services for the most recent reporting period available, as certified by the commissioner of education, multiplied by the population of the district according to the most recent estimate of the state demographer or the Metropolitan Council; or\n(2) the total amount provided by participating counties and cities under section 134.34, subdivision 4, during the year preceding the first year of operation.\n(b) For its first year of operation, the board shall levy an amount not less than the total dollar amount provided by participating cities and counties during the preceding year under section 134.34, subdivision 4.\nA regional public library district that meets federal and state requirements for a regional library basic system support grant is eligible to receive a grant. A regional library basic system support grant shall not be made to a regional public library district if the district board reduces its levy for operation of public library service below the amount of the levy in the preceding year.\nIn addition to the levy authorized in subdivision 5 and all other levies authorized for cities and counties, a city or county served by a library district may levy for the construction, acquisition, maintenance, and utilities costs of library buildings. The board of a district may issue bonds, with an election, according to chapter 475 or levy under this section a special capital levy for capital improvements for a library building. A district may purchase or lease a building to be used for library purposes from a city or county.\nThe board of a district may borrow money and issue tax anticipation certificates as needed to provide library services or for library buildings.\nIf a regional public library system is reorganized into a regional public library district there will be a transition period. The transition period shall begin at the time the regional public library system board adopts a resolution that recommends formation of a district to its participants and that sets an effective date for the establishment of the district. During the transition period participating counties and cities must fund public library services under their existing contracts, and planning for administrative changes may occur. The regional public library system board shall continue until the district board members assume their duties, at which time the transition period ends.\nUpon assumption of responsibilities by the regional public library district board, the regional public library system assets, liabilities, and existing contracts, including contracts negotiated under chapter 179A, shall become the assets, liabilities, and contracts of the regional public library district board.",
	"repealed": false
}