{
	"id": "147E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/147E.10",
	"title": "147E.10 PROTECTED TITLES.",
	"text": "(a) No individual may use the title \"registered naturopathic doctor,\" \"naturopathic doctor,\" \"doctor of naturopathic medicine,\" or use, in connection with the individual's name, the letters \"R.N.D.\" or \"N.M.D.,\" or any other titles, words, letters, abbreviations, or insignia indicating or implying that the individual is a registered naturopathic doctor unless the individual has been registered as a registered naturopathic doctor according to this chapter.\n(b) After July 1, 2009, individuals who are registered under this chapter and who represent themselves as practicing naturopathic medicine by use of a term in paragraph (a) shall conspicuously display the registration in the place of practice.\nNothing in this chapter may be construed to prohibit or to restrict:\n(1) the practice of a profession by individuals who are licensed, certified, or registered under other laws of this state and are performing services within their authorized scope of practice;\n(2) the provision of the complementary and alternative healing methods and treatments, including naturopathy, as described in chapter 146A;\n(3) the practice of naturopathic medicine by an individual licensed, registered, or certified in another state and employed by the government of the United States while the individual is engaged in the performance of duties prescribed by the laws and regulations of the United States;\n(4) the practice by a naturopathic doctor duly licensed, registered, or certified in another state, territory, or the District of Columbia when incidentally called into this state for consultation with a Minnesota licensed physician or Minnesota registered naturopathic doctor; or\n(5) individuals not registered by this chapter from the use of individual modalities which comprise the practice of naturopathic medicine.\nA person violating subdivision 1 is guilty of a misdemeanor.",
	"repealed": false
}