{
	"id": "142F.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.301",
	"title": "142F.301 COMMUNITY ACTION AGENCIES.",
	"text": "A community action agency is a political subdivision of the state, a combination of political subdivisions, a public agency, or a private nonprofit agency which has the authority under its applicable charter or laws to receive funds under section 142F.30 to support community action programs as described in section 142F.302 and which was designated as an eligible entity under the Community Services Block Grant Act, Public Law 97-35, section 673(1), 95 Stat. 357, 512 (1981), as amended by, Act of October 30, 1984, Public Law 98-558, section 202, 98 Stat. 2878, 2884 (1984). For purposes of this subdivision, \"eligible entity\" also means any community action agency which qualified under all federal and state regulations applicable during the period from 1981 to September 30, 1984.\nTo obtain recognition by the governor a community action agency must be designated by a political subdivision having jurisdiction over the entire area to be served by the agency. To designate a community action agency, the political subdivision must hold a public hearing, pass a resolution to designate, and file a \"notice of intent to designate\" and eligibility documents with the state office of economic opportunity for final review and authorization for a new community action agency.\nEach community action agency shall administer its community action programs through a community action board consisting of 15 to 51 members.\n(a) One-third of the members of the board shall be elected public officials, currently holding office, or their representatives.\n(b) At least one-third of the members shall be persons chosen in accordance with democratic selection procedures adequate to assure that they are representative of the poor in the area served.\n(c) The other members shall be officials or members of business, industry, labor, religious, welfare, education, or other major groups and interests in the community. Each member of the board selected to represent a specific geographic area within a community must reside in the area represented.\n(d) The public community action agency shall have an administering board which meets the requirements of this subdivision.\n(e) The statewide migrant seasonal farmworker organization known as the Minnesota Migrant Council and Indian reservations carrying out community action programs are exempt from the board composition requirements of this subdivision.\nIf a community action agency places responsibility for major policy determinations with respect to the character, funding, extent, and administration of and budgeting for programs to be carried on in a particular geographic area within the community in a subsidiary board, council, or similar agency, that board, council, or agency shall be broadly representative of the area.\nEach community action agency shall consult neighborhood based organizations composed of residents of the area or members of the groups served to assist the agency in the planning, conduct, and evaluation of components of the community action program.\nA community action agency shall:\n(a) Plan systematically for an effective community action program; develop information as to the problems and causes of poverty in the community; determine how much and how effectively assistance is being provided to deal with those problems and causes; and establish priorities among projects, activities and areas as needed for the best and most efficient use of resources;\n(b) Encourage agencies engaged in activities related to the community action program to plan for, secure, and administer assistance available under section 142F.30 or from other sources on a common or cooperative basis; provide planning or technical assistance to those agencies; and generally, in cooperation with community agencies and officials, undertake actions to improve existing efforts to reduce poverty, such as improving day-to-day communications, closing service gaps, focusing resources on the most needy, and providing additional opportunities to low-income individuals for regular employment or participation in the programs or activities for which those community agencies and officials are responsible;\n(c) Initiate and sponsor projects responsive to needs of the poor which are not otherwise being met, with particular emphasis on providing central or common services that can be drawn upon by a variety of related programs, developing new approaches or new types of services that can be incorporated into other programs, and filling gaps pending the expansion or modification of those programs;\n(d) Establish effective procedures by which the poor and area residents concerned will be enabled to influence the character of programs affecting their interests, provide for their regular participation in the implementation of those programs, and provide technical and other support needed to enable the poor and neighborhood groups to secure on their own behalf available assistance from public and private sources;\n(e) Join with and encourage business, labor and other private groups and organizations to undertake, together with public officials and agencies, activities in support of the community action program which will result in the additional use of private resources and capabilities, with a view to developing new employment opportunities, stimulating investment that will have a measurable impact on reducing poverty among residents of areas of concentrated poverty, and providing methods by which residents of those areas can work with private groups, firms, and institutions in seeking solutions to problems of common concern.\nCommunity action agencies, migrant and seasonal farmworker organizations, and the Indian reservations, may enter into cooperative purchasing agreements and self-insurance programs with local units of government. Nothing in this section expands or limits the current private or public nature of a local community action agency.\n(f) Adopt policies that require the agencies to refer area residents and community action program constituents to education programs that increase literacy, improve parenting skills, and address the needs of children from families in poverty. These programs include, but are not limited to, early childhood family education programs, adult basic education programs, and other lifelong learning opportunities. The agencies and agency programs, including Head Start, shall collaborate with child care and other early childhood education programs to ensure smooth transitions to work for parents.\nAgencies defined by this section shall be considered among local providers of outreach services and activities for all antipoverty efforts.\nFederal antipoverty categorical funds consolidated into block grants to the state of Minnesota shall be designated by the state for antipoverty purposes.",
	"repealed": false
}