{
	"id": "142F.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.10",
	"title": "142F.10 SNAP EMPLOYMENT AND TRAINING PROGRAM.",
	"text": "The commissioner shall implement a Supplemental Nutrition Assistance Program (SNAP) employment and training program that meets the SNAP employment and training participation requirements of the United States Department of Agriculture governed by Code of Federal Regulations, title 7, section 273.7. The commissioner shall operate a SNAP employment and training program in which SNAP recipients elect to participate. In order to receive SNAP assistance beyond the time limit, unless residing in an area covered by a time-limit waiver governed by Code of Federal Regulations, title 7, section 273.24, nonexempt SNAP recipients who do not meet federal SNAP work requirements must participate in an employment and training program. In addition to county and Tribal agencies that administer SNAP, the commissioner may contract with third-party providers for SNAP employment and training services.\nCounty or Tribal agencies that administer SNAP shall inform adult SNAP recipients about employment and training services and providers in the recipient's area. County or Tribal agencies that administer SNAP may elect to subcontract with a public or private entity approved by the commissioner to provide SNAP employment and training services.\nIn addition to any other duties imposed by law, the commissioner shall:\n(1) supervise the administration of SNAP employment and training services to county, Tribal, and contracted agencies under this section and Code of Federal Regulations, title 7, section 273.7;\n(2) disburse money allocated and reimbursed for SNAP employment and training services to county, Tribal, and contracted agencies;\n(3) accept and supervise the disbursement of any funds that may be provided by the federal government or other sources for SNAP employment and training services;\n(4) cooperate with other agencies, including any federal agency or agency of another state, in all matters concerning the powers and duties of the commissioner under this section;\n(5) coordinate with the commissioner of employment and economic development to deliver employment and training services statewide;\n(6) work in partnership with counties, tribes, and other agencies to enhance the reach and services of a statewide SNAP employment and training program; and\n(7) identify eligible nonfederal funds to earn federal reimbursement for SNAP employment and training services.\nUnless residing in an area covered by a time-limit waiver, nonexempt SNAP recipients must meet federal SNAP work requirements to receive SNAP assistance beyond the time limit.\n(a) The United States Department of Agriculture annually allocates SNAP employment and training funds to the commissioner of children, youth, and families for the operation of the SNAP employment and training program.\n(b) The United States Department of Agriculture authorizes the disbursement of SNAP employment and training reimbursement funds to the commissioner of children, youth, and families for the operation of the SNAP employment and training program.\n(c) Except for funds allocated for state program development and administrative purposes or designated by the United States Department of Agriculture for a specific project, the commissioner of children, youth, and families shall disburse money allocated for federal SNAP employment and training to counties and tribes that administer SNAP based on a formula determined by the commissioner that includes but is not limited to the county's or tribe's proportion of adult SNAP recipients as compared to the statewide total.\n(d) The commissioner of children, youth, and families shall disburse federal funds that the commissioner receives as reimbursement for SNAP employment and training costs to the state agency, county, tribe, or contracted agency that incurred the costs being reimbursed.\n(e) The commissioner of children, youth, and families may reallocate unexpended money disbursed under this section to county, Tribal, or contracted agencies that demonstrate a need for additional funds.",
	"repealed": false
}