{
	"id": "173.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/173.04",
	"title": "173.04 SCENIC AREA; SCENIC EASEMENT; FEDERAL FUNDS.",
	"text": "[Repealed, 1975 c 61 s 26]\nThe commissioner of transportation may by rules issued pursuant to chapter 14 establish scenic areas adjacent to the interstate or primary highways. Such scenic areas shall be located outside of the then existing boundaries of cities, and shall not include areas then zoned for commercial or industrial purposes. These scenic areas may include in part but shall not be limited to areas containing national, state or local parks, historic sites and monuments, and picnic, rest, or recreation areas maintained by the public. Permits for legally existing advertising devices not in violation of this chapter shall be granted until such devices are paid for, but no new advertising devices may be erected within the area after the scenic area has been established by rule. If the state or any local unit of government legitimately zones all or any part of a scenic area for commercial or industrial use in accordance with customary usage in the state, then such area or that part thereof shall cease to be a scenic area. A scenic area will exist when the rights thereto have been acquired by the state.\nThe commissioner of transportation may acquire scenic easements in scenic areas to preserve the natural scenic beauty of that area and its visibility from the highway, and the rights so acquired may require the removal, by the owner of the land, of any structure necessary to accomplish these purposes. Advertising devices shall be removed only in accordance with this chapter, and the commissioner shall not require the removal of residences, farm buildings or other buildings of a substantial nature. Whenever practicable, the scenic easements acquired herein shall provide that the land may be used for agricultural, horticultural, forest, grazing, residential, or other purposes not inconsistent with the scenic purposes for which the easement was acquired.\nAny scenic area established under this section may extend such distance beyond the edge of the right-of-way of an interstate or primary highway as the commissioner shall determine is reasonably necessary for the fulfillment of the purposes and objectives of sections 173.01 to 173.11.\nIn establishing such scenic areas along any interstate or primary highway, the commissioner of transportation shall, whenever practicable, comply with federal law and federal rules and regulations relating to billboard control on any interstate or primary highway, and is authorized to do all necessary acts and things, including, but not limited to, entering into binding agreements with the United States or any of its agencies or departments to the end that the objectives stated in United States Code, title 23, section 131, section 319, or any other applicable federal statute, and the rules and regulations promulgated pursuant thereto, be accomplished in such scenic areas, and that federal participation in the cost of acquiring the necessary easements for such scenic areas be obtained in as many instances as possible.\nThe commissioner of transportation has the authority to do all things necessary to obtain any federal money that may be available for the planning, establishing, and acquiring of scenic areas and scenic easements along any interstate or primary highway.",
	"repealed": false
}