{
	"id": "504B.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.271",
	"title": "504B.271 TENANT'S PERSONAL PROPERTY REMAINING IN PREMISES.",
	"text": "(a) If a tenant abandons rented premises, the landlord may take possession of the tenant's personal property remaining on the premises, and shall store and care for the property. The landlord has a claim against the tenant for reasonable costs and expenses incurred in removing the tenant's property and in storing and caring for the property.\n(b) The landlord may sell or otherwise dispose of the property 28 days after the landlord receives actual notice of the abandonment, or 28 days after it reasonably appears to the landlord that the tenant has abandoned the premises, whichever occurs last.\n(c) The landlord may apply a reasonable amount of the proceeds of a sale to the removal, care, and storage costs and expenses or to any claims authorized pursuant to section 504B.178, subdivision 3, paragraphs (a) and (b). Any remaining proceeds of any sale shall be paid to the tenant upon written demand.\n(d) Prior to a sale, the landlord shall make reasonable efforts to notify the tenant of the sale at least 14 days prior to the sale, by personal service in writing or sending written notification of the sale by first class and certified mail to the tenant's last known address or usual place of abode, if known by the landlord, and by posting notice of the sale in a conspicuous place on the premises at least two weeks prior to the sale. If notification by mail is used, the 14-day period shall be deemed to start on the day the notices are deposited in the United States mail.\nIf a landlord, an agent, or other person acting under the landlord's direction or control, in possession of a tenant's personal property, fails to allow the tenant to retake possession of the property within 24 hours after written demand by the tenant or the tenant's duly authorized representative or within 48 hours, exclusive of weekends and holidays, after written demand by the tenant or a duly authorized representative when the landlord, the landlord's agent or person acting under the landlord's direction or control has removed and stored the personal property in accordance with subdivision 1 in a location other than the premises, the tenant shall recover from the landlord punitive damages in an amount not to exceed twice the actual damages or $1,000, whichever is greater, in addition to actual damages and reasonable attorney's fees.\nIn determining the amount of punitive damages the court shall consider (1) the nature and value of the property; (2) the effect the deprivation of the property has had on the tenant; (3) if the landlord, an agent, or other person acting under the landlord's direction or control unlawfully took possession of the tenant's property; and (4) if the landlord, an agent, or other person under the landlord's direction or control acted in bad faith in failing to allow the tenant to retake possession of the property.\nThe provisions of this subdivision do not apply to personal property which has been sold or otherwise disposed of by the landlord in accordance with subdivision 1, or to landlords who are housing authorities, created, or authorized to be created by sections 469.001 to 469.047, and their agents and employees, in possession of a tenant's personal property, except that housing authorities must allow the tenant to retake possession of the property in accordance with this subdivision.\nIf the landlord, an agent, or other person acting under the landlord's direction or control has unlawfully taken possession of a tenant's personal property the landlord shall be responsible for paying the cost and expenses relating to the removal, storage, or care of the property.\nThe remedies provided in this section are in addition to and shall not limit other rights or remedies available to landlords and tenants. Any provision, whether oral or written, of any lease or other agreement, whereby any provision of this section is waived by a tenant, is contrary to public policy and void. The provisions of this section also apply to occupants and owners of residential real property which is the subject of a mortgage foreclosure or contract for deed cancellation and as to which the period for redemption or reinstatement of the contract has expired.",
	"repealed": false
}