{
	"id": "168.1259",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1259",
	"title": "168.1259 MINNESOTA PROFESSIONAL SPORTS TEAM PHILANTHROPY PLATES.",
	"text": "For purposes of this section, \"Minnesota professional sports team\" means one of the following teams while its home stadium is located in Minnesota: Minnesota Vikings, Minnesota Timberwolves, Minnesota Lynx, Minnesota Wild, Minnesota Twins, or Minnesota United.\n(a) The commissioner must issue Minnesota professional sports team philanthropy plates to an applicant who:\n(1) is a registered owner of a passenger automobile, noncommercial one-ton pickup truck, motorcycle, or recreational vehicle;\n(2) pays an additional fee in the amount specified for special plates under section 168.12, subdivision 5;\n(3) pays the registration tax required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes a minimum of $30 annually to the professional sports team philanthropy account; and\n(6) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(b) Minnesota professional sports team philanthropy plates may be personalized according to section 168.12, subdivision 2a.\nAt the request of a Minnesota professional sports team or the team's foundation, the commissioner must, in consultation with the team or foundation, adopt a suitable plate design. Each design must incorporate the requesting foundation's marks and colors or directly relate to a charitable purpose as provided in subdivision 5. The commissioner may design a single plate that incorporates the marks and colors of all organizations that have requested a plate.\nOn application to the commissioner and payment of a transfer fee of $5, special plates issued under this section may be transferred to another motor vehicle if the subsequent vehicle is:\n(1) qualified under subdivision 2, paragraph (a), clause (1), to bear the special plates; and\n(2) registered to the same individual to whom the special plates were originally issued.\n(a) Contributions collected under subdivision 2, paragraph (a), clause (5), must be deposited in the Minnesota professional sports team philanthropy account, which is established in the special revenue fund. Money in the account is annually appropriated to the commissioner of public safety. This appropriation is first for the annual cost of administering the account funds, and the remaining funds are for distribution to the foundations, or as provided in this subdivision, in the proportion that each plate design bears to the total number of Minnesota professional sports team philanthropy plates issued for that year. Proceeds from a plate that includes the marks and colors of all participating organizations must be divided evenly between all foundations and charitable purposes.\n(b) The proceeds must only be used by:\n(1) a Minnesota professional sports team foundation for philanthropic or charitable purposes; or\n(2) the Minnesota United professional sports team through a designation that the funds are for the Minnesota Loon Restoration Project.\n(c) The commissioner must annually transfer funds designated under paragraph (b), clause (2), from the Minnesota professional sports team philanthropy account to the Minnesota critical habitat private sector matching account under section 84.943 for purposes of the Minnesota Loon Restoration Project.",
	"repealed": false
}