{
	"id": "61A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.03",
	"title": "61A.03 REQUIRED PROVISIONS; LIFE INSURANCE POLICIES.",
	"text": "No policy of life insurance may be issued in this state or by a life insurance company organized under the laws of this state unless it contains the following provisions:\n(a) Premium. A provision that all premiums are payable in advance either at the home office of the company, or to an agent of the company, upon delivery of a receipt signed by one or more officers named in the policy and countersigned by the agent, but a policy may contain a provision that the policy itself is a receipt for the first premium;\n(b) Grace period. A provision for a one month grace period for the payment of every premium after the first, during which the insurance will continue in force. The provision may subject the late payment to a finance charge and contain a stipulation that if the insured dies during the grace period, the overdue premium will be deducted in any settlement under the policy;\n(c) Entire contract. A provision that the policy constitutes the entire contract between the parties and is incontestable after it has been in force during the lifetime of the insured for two years from its date, except for nonpayment of premiums and except for violations of the conditions of the policy relating to naval and military services in time of war; that at the option of the company, provisions relative to benefits in the event of total and permanent disability and provisions which grant additional insurance specifically against death by accident, may be excepted; and that a special form of policy may be issued on the life of a person employed in an occupation classified by the company as extra hazardous or as leading to hazardous employment, which provides that service in certain designated occupations may reduce the company's liability under the policy to a certain designated amount not less than the full policy reserve;\n(d) Representations and warranties. A provision that, in the absence of fraud, all statements made by the insured are representations and not warranties, and that no statement voids the policy unless it is contained in a written application and a copy of the application is endorsed upon or attached to the policy when issued;\n(e) Misstatement of age. A provision that if the age of the insured is understated the amount payable under the policy will be the amount the premium would have purchased at the correct age;\n(f) Dividends on participating policies. A provision that the policy will participate in the surplus of the company and that, beginning not later than the end of the third policy year, the company will annually determine and account for the portion of the divisible surplus accruing on the policy, and that the owner of the policy has the right, each year after the fifth, to have the current dividend arising from the participation paid in cash. If the policy provides other dividend options, it must specify which option is effective if the owner of the policy does not elect an option. The provision may condition any dividends payable during the first five years of the policy upon the payment of the next ensuing annual premium. This provision is not required in nonparticipating policies, in policies issued on under-average lives, or in insurance in exchange for lapsed or surrendered policies;\n(g) Policy loans. A provision (1) that after three full years' premiums have been paid, the company at any time while the policy is in force, will advance, on proper assignment of the policy, and on the sole security thereof, at a specified rate of interest, not to exceed eight percent per annum, or at an adjustable rate of interest as otherwise provided for in this section, a sum equal to, or, at the option of the owner of the policy, less than the loan value thereof; (2) that the loan value is the cash surrender value thereof at the end of the current policy year; (3) that the loan, unless made to pay premiums, may be deferred for not more than six months after the application for it is made; (4) that the company will deduct from the loan value any existing indebtedness on the policy and any unpaid balance of the premium for current policy year, and may collect interest in advance on the loan to the end of the current policy year; (5) that the failure to repay an advance or to pay interest does not void the policy unless the total indebtedness thereon to the company equals or exceeds the loan value at the time of the failure, nor until one month after notice has been mailed by the company to the last known address of the insured and of the assignee of record at the home office of the company; and (6) that no condition other than those provided in this section will be exacted as a prerequisite to an advance. This provision is not required in term insurance;\n(h) Reinstatement. A provision that if, in event of default in premium payments, the nonforfeiture value of the policy is applied to the purchase of other insurance, and if that insurance is in force and the original policy has not been surrendered to the company and canceled, the policy may be reinstated within three years after the default upon evidence of insurability satisfactory to the company and payment of arrears of premiums with interest;\n(i) Payment of claims. A provision that, when a policy becomes a claim by the death of the insured, settlement will be made within two months after receipt of due proof of death;\n(j) Settlement option. A table showing the amount of installments in which the policy may provide its proceeds may be payable;\n(k) Description of policy. A title on the face and on the back of the policy briefly and correctly describing the policy in bold letters stating its general character, dividend periods, and other particulars, so that the holder will not be able to mistake the nature and scope of the contract;\n(l) Form number. A form number in the lower left-hand corner of the first page of each form, including riders and endorsements.\nAny of the foregoing provisions or portions thereof relating to premiums not applicable to single premium policies must not be incorporated therein.\n(a) A life insurance policy which provides for policy loans must contain a provision concerning maximum policy loan interest rates as follows:\n(1) a provision permitting a maximum interest rate of not more than eight percent per annum; or\n(2) a provision permitting an adjustable maximum interest rate established from time to time by the life insurer as permitted by this subdivision.\n(b) No life insurer may issue policies with a policy loan provision providing for an adjustable maximum interest rate under paragraph (a), clause (2), unless the insurer also makes available policies with a policy loan provision providing for a fixed rate of interest under paragraph (a), clause (1).\n(c) The rate of interest charged on a policy loan made under paragraph (a), clause (2), may not exceed the higher of the following:\n(1) the rate used to compute the cash surrender values under the policy during the applicable period plus one percent per annum; or\n(2) the monthly average of the composite yield on seasoned corporate bonds as published by Moody's Investors Service, Incorporated, or any successor thereto, for the calendar month ending two months before the date on which the rate is determined. If the monthly average is no longer published, the commissioner shall substitute a substantially similar average by rule.\n(d) If the maximum rate of interest is determined pursuant to paragraph (a), clause (2), the policy must contain a provision setting forth the frequency at which the rate is to be determined for that policy.\n(e) The maximum rate referred to in paragraph (d) must be determined at regular intervals at least once every 12 months, but not more frequently than once in any three-month period. At the intervals specified in the policy:\n(1) the rate being charged may be increased whenever the increase as determined under paragraph (c) would increase that rate by one-half percent or more per annum; and\n(2) the rate being charged must be reduced whenever the reduction as determined under paragraph (c) would decrease that rate by one-half percent or more per annum.\n(f) The life insurer shall:\n(1) notify the policyholder at the time a policy loan, other than a premium loan, is made, of the initial rate of interest on the loan, that the interest rate on the loan is adjustable and that the policyholder will be notified of any increase in the interest rate;\n(2) notify the policyholder with respect to premium loans of the initial rate of interest on the loan as soon as it is reasonably practical to do so after making the initial loan. Notice need not be given to the policyholder when a further premium loan is added, except as provided in clause (3);\n(3) send reasonable advance notice of any increase in the rate to the policyholder with loans; and\n(4) include in the notices required by this paragraph the substance of the pertinent provisions of paragraphs (a) and (d), a summary of the plan required by paragraph (h), and the effect of the policy loan on the policyholder's net cost of insurance per $1,000 of coverage based on that plan.\n(g) The loan value of the policy must be determined in a manner consistent with section 61A.24 or 61A.245, but no policy may terminate as the sole result of a change in the interest rate during that policy year, and the life insurer shall maintain coverage during that policy year until the time at which it would otherwise have terminated if there had been no change during that policy year.\n(h) Prior to offering insurance policies with an adjustable policy loan interest rate or offering to add a provision for an adjustable policy loan interest rate to existing policyholders, the insurer shall file a written plan setting forth the manner in which policyholders will receive a reasonable benefit in the form of price reductions, increased amounts of insurance, or increased dividends from the increased earnings of the insurer resulting from the use of the adjustable rate and, if applicable, the effect of a policy loan on dividends and dividend rates. A summary of this plan must be made available upon request to each policyholder and must be provided to each applicant for a policy before the initial premium is received.\n(i) The pertinent provisions of paragraphs (a) and (e) must be set forth in substance in the policies to which they apply.\n(j) For the purposes of this subdivision:\n(1) The rate of interest on policy loans permitted under this subdivision includes the interest rate charged on reinstatement of policy loans for the period during and after any lapse of a policy.\n(2) The term \"policy loan\" includes any premium loan made under a policy to pay one or more premiums that were not paid to the life insurer as they fell due.\n(3) The term \"policyholder\" includes the owner of the policy or the person designated to pay premiums as shown on the records of the life insurer.\n(4) The term \"policy\" includes certificates issued by a fraternal benefit society and annuity contracts which provide for policy loans.\nNo life insurer subject to this section is required to file more than one policy with a policy loan provision providing for a fixed rate of interest.\nThe provisions of subdivision 2 do not apply to any insurance policy issued before January 1, 1984, unless the insurer provides the policyholder with a summary of the plan required by subdivision 2, paragraph (h), and thereafter the policyholder agrees in writing to the applicability of those provisions. Upon election of policies providing adjustable policy loan interest rates, the cash surrender values of any policies subject to the provisions of this section shall be determined in accordance with section 61A.24 or 61A.245 at the time of the election. The provisions of subdivision 2 shall not apply to any insurance policy that the commissioner determines provides insufficient benefits to the policyholder to justify loan interest rates in excess of those provided in subdivision 1.\nNeither section 334.01 nor any other law of this state which regulates rates of interest applies to policy loans governed by this section.\nThe commissioner may adopt rules pursuant to chapter 14 to further implement and administer the provisions of this section.",
	"repealed": false
}