{
	"id": "216B.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.091",
	"title": "216B.091 MONTHLY REPORTS.",
	"text": "(a) Each public utility must report the following data on residential customers to the commission monthly, in a format determined by the commission:\n(1) number of customers;\n(2) number and total amount of accounts past due;\n(3) average customer past due amount;\n(4) total revenue received from the low-income home energy assistance program and other sources contributing to the bills of low-income persons;\n(5) average monthly bill;\n(6) total sales revenue;\n(7) total write-offs due to uncollectible bills;\n(8) number of disconnection notices mailed;\n(9) number of accounts disconnected for nonpayment;\n(10) number of accounts reconnected to service; and\n(11) number of accounts that remain disconnected, grouped by the duration of disconnection, as follows:\n(i) 1-30 days;\n(ii) 31-60 days; and\n(iii) more than 60 days.\n(b) Monthly reports for October through April must also include the following data:\n(1) number of cold weather protection requests;\n(2) number of payment arrangement requests received and granted;\n(3) number of right to appeal notices mailed to customers;\n(4) number of reconnect request appeals withdrawn;\n(5) number of occupied heat-affected accounts disconnected for 24 hours or more for electric and natural gas service separately;\n(6) number of occupied non-heat-affected accounts disconnected for 24 hours or more for electric and gas service separately;\n(7) number of customers granted cold weather rule protection;\n(8) number of customers disconnected who did not request cold weather rule protection; and\n(9) number of customers disconnected who requested cold weather rule protection.\n(c) The data reported under paragraphs (a) and (b) is presumed to be accurate upon submission and must be made available through the commission's electronic filing system. A monthly report must be filed with the commission no later than 45 days after the last day of the month for which data is reported.",
	"repealed": false
}