{
	"id": "507.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.49",
	"title": "507.49 CERTIFICATE OF CUSTODIANSHIP.",
	"text": "(a) A custodian or the owner of property held in a custodianship, at any time after execution or creation of a custodianship instrument, may execute a certificate of custodianship that sets forth less than all of the provisions of the custodial instrument and any amendments to the instrument. The certificate of custodianship may be used for purposes of selling, conveying, pledging, mortgaging, leasing, or transferring title to any interest in real or personal property. The certificate of custodianship must include:\n(1) the name of the custodianship, if one is given;\n(2) the date of the custodianship instrument;\n(3) the name of each owner of property held in the custodianship;\n(4) the name of each original custodian;\n(5) the name and address of each custodian empowered to act under the custodianship instrument at the time of execution of the certificate;\n(6) the following statement: \"The custodians are authorized by the instrument to sell, convey, pledge, mortgage, lease, or transfer title to any interest in real or personal property, except as limited by the following: (if none, so indicate)\";\n(7) any other custodianship provisions the custodians or owners of property held in the custodianship include; and\n(8) a statement as to whether the custodianship instrument has terminated or been revoked.\n(b) The certificate of custodianship must be upon the representation of the custodians or the owners of property held in the custodianship that the statements contained in the certificate of custodianship are true and correct and that there are no other provisions in the custodianship instrument or amendments to it that limit the powers of the custodianship to sell, convey, pledge, mortgage, lease, or transfer title to interests in real or personal property. The signature of the custodians or the owners of property held in the custodianship must be under oath before a notary public or other official authorized to administer oaths.\nA certificate of custodianship executed under subdivision 1 may be recorded in the office of the county recorder for any county or in the office of the registrar of titles with respect to registered land described in the certificate of custodianship or any attachment to it. When it is recorded in a county where real property is situated, or in the case of personal property, when it is presented to a third party, the certificate of custodianship serves to document the existence of the custodianship, the identity of the custodians, the powers of the custodians and any limitations on those powers, and other matters the certificate of custodianship sets out, as though the full custodianship instrument had been recorded, filed, or presented. Until amended or revoked under subdivision 3, or until the full custodianship instrument is recorded or presented, a certificate of custodianship is prima facie proof as to the matters contained in it, and any party may rely upon the continued effectiveness of the certificate.\n(a) Amendment or revocation of a certificate of custodianship may be made only by a written instrument executed by a custodian or an owner of property held in the custodianship. Amendment or revocation of a certificate of custodianship is not effective as to a party unless that party has actual notice of the amendment or revocation.\n(b) For purposes of this subdivision, \"actual notice\" means that a written instrument of amendment or revocation has been received by the party or, in the case of real property, that either a written instrument of amendment or revocation has been received by the party or that a written instrument of amendment or revocation containing the legal description of the real property has been recorded in the office of the county recorder or in the office of the registrar of titles where the real property is situated.\n(a) Subdivisions 1 to 3 apply to custodianship instruments whenever created or executed.\n(b) Subdivisions 1 to 3 apply only to custodianships established under a federal law or under a statute of this or any other state. Subdivisions 1 to 3 do not apply to custodianships governed by chapter 527 or by the similar laws of another state.",
	"repealed": false
}