{
	"id": "97C.825",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.825",
	"title": "97C.825 LAKE OF THE WOODS AND RAINY LAKE FISHING.",
	"text": "The commissioner may not issue a new commercial fishing license that allows netting of game fish on Lake of the Woods and Rainy Lake.\nThe following rules and restrictions shall apply to all commercial fishing operations conducted in Lake of the Woods and Rainy Lake unless otherwise changed by rule of the commissioner under authority of section 97A.045, subdivision 4:\n(1) Any fish, except largemouth bass, smallmouth bass, rock bass, muskellunge, crappies, sturgeon, and sunfish, may be taken subject to all other restrictions contained in the game and fish laws.\n(2) Pound net mesh and staked trap net mesh may not be less than 2-1/2 inches nor more than four inches stretch measure in the pound or crib.\n(3) Gill net mesh may not be less than four inches stretch measure, and may not be more than 30 meshes in width.\n(4) Fyke net mesh may not be less than 2-1/2 inches nor more than four inches stretch measure in the pot or crib. Fyke nets may not have a hoop or opening more than six feet in height, wings more than 100 feet in length, nor a lead more than 400 feet in length.\n(5) Submerged trap net mesh may not be less than 2-1/2 inches nor more than three inches stretch measure in the heart, pot, or crib. A submerged trap net may not have a pot or crib exceeding 150 square feet in area, a lead exceeding 300 feet in length, nor a pot or lead exceeding 12 feet in depth.\nA person may not operate more than six pound nets, 4,000 feet of gill nets, eight submerged trap nets, ten fyke or staked trap nets, or one pound net station.\nNets may only be set at a place consented to by the commissioner.\n(a) The maximum amount of nets permitted to be licensed shall be:\n(1) in Lake of the Woods, 50-pound nets, 160 submerged trap nets, and 80 fyke or staked trap nets; and\n(2) in Rainy Lake, 20-pound nets.\n(b) Commercial fishing may be prohibited in the Minnesota portions of international waters when it is prohibited in the international waters by Canadian authorities.\n[Repealed, 2005 c 146 s 52]\n[Repealed, 2005 c 146 s 52]\n[Repealed, 2005 c 146 s 52]\n[Repealed, 2005 c 146 s 52]\nThe commissioner may require a person licensed to take fish for commercial purposes in the waters covered by this section to take eggs for propagation purposes when it can be done in connection with the licensed commercial fishing. The eggs must be taken under rules prescribed by the commissioner.",
	"repealed": false
}