{
	"id": "256P.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.10",
	"title": "256P.10 SIX-MONTH REPORTING.",
	"text": "Assistance units that qualify for child care assistance programs under chapter 142E, assistance units that qualify for Minnesota supplemental aid under chapter 256D, and assistance units that qualify for housing support under chapter 256I and also receive Supplemental Security Income are exempt from this section.\n(a) Every six months, an assistance unit that qualifies for the Minnesota family investment program under chapter 142G, an assistance unit that qualifies for general assistance under chapter 256D with an earned income of $100 per month or greater, or an assistance unit that qualifies for housing support under chapter 256I with an earned income of $100 per month or greater is subject to six-month reviews. The initial reporting period may be shorter than six months in order to align with other programs' reporting periods.\n(b) An assistance unit that qualifies for the Minnesota family investment program or an assistance unit that qualifies for general assistance with an earned income of $100 per month or greater must complete household report forms as required by the commissioner for redetermination of benefits.\n(c) An assistance unit that qualifies for housing support with an earned income of $100 per month or greater must complete household report forms as prescribed by the commissioner to provide information about earned income.\n(d) An assistance unit that qualifies for housing support and also receives assistance through the Minnesota family investment program is subject to the requirements of this section for purposes of the Minnesota family investment program but not for housing support.\n(e) An assistance unit covered by this section must submit a household report form in compliance with the provisions in section 256P.04, subdivision 11.\n(f) An assistance unit covered by this section may choose to report changes under this section at any time.\n(a) An agency must terminate benefits when the assistance unit fails to submit the household report form before the end of the six-month review period. If the assistance unit submits the household report form within 30 days of the termination of benefits and remains eligible, benefits must be reinstated and made available retroactively for the full benefit month.\n(b) When an assistance unit is determined to be ineligible for assistance according to this section and chapter 256D, 256I, or 256J, the agency must terminate assistance.",
	"repealed": false
}