{
	"id": "462.358",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.358",
	"title": "462.358 OFFICIAL CONTROLS: SUBDIVISION REGULATION; DEDICATION.",
	"text": "MS 1978 [Repealed, 1980 c 566 s 35]\nTo protect and promote the public health, safety, and general welfare, to provide for the orderly, economic, and safe development of land, to preserve agricultural lands, to promote the availability of housing affordable to persons and families of all income levels, and to facilitate adequate provision for transportation, water, sewage, storm drainage, schools, parks, playgrounds, and other public services and facilities, a municipality may by ordinance adopt subdivision regulations establishing standards, requirements, and procedures for the review and approval or disapproval of subdivisions. The regulations may contain varied provisions respecting, and be made applicable only to, certain classes or kinds of subdivisions. The regulations shall be uniform for each class or kind of subdivision.\nA municipality may by resolution extend the application of its subdivision regulations to unincorporated territory located within two miles of its limits in any direction but not in a town which has adopted subdivision regulations; provided that where two or more noncontiguous municipalities have boundaries less than four miles apart, each is authorized to control the subdivision of land equal distance from its boundaries within this area.\nMS 1978 [Repealed, 1980 c 566 s 35]\nThe standards and requirements in the regulations may address without limitation: the size, location, grading, and improvement of lots, structures, public areas, streets, roads, trails, walkways, curbs and gutters, water supply, storm drainage, lighting, sewers, electricity, gas, and other utilities; the planning and design of sites; access to solar energy; and the protection and conservation of floodplains, shore lands, soils, water, vegetation, energy, air quality, and geologic and ecologic features. The regulations shall require that subdivisions be consistent with the municipality's official map if one exists and its zoning ordinance, and may require consistency with other official controls and the comprehensive plan. The regulations may prohibit certain classes or kinds of subdivisions in areas where prohibition is consistent with the comprehensive plan and the purposes of this section, particularly the preservation of agricultural lands. The regulations may prohibit, restrict or control development for the purpose of protecting and assuring access to direct sunlight for solar energy systems. The regulations may prohibit the issuance of permits or approvals for any tracts, lots, or parcels for which required subdivision approval has not been obtained.\nThe regulations may permit the municipality to condition its approval on the construction and installation of sewers, streets, electric, gas, drainage, and water facilities, and similar utilities and improvements or, in lieu thereof, on the receipt by the municipality of a cash deposit, certified check, irrevocable letter of credit, bond, or other financial security in an amount and with surety and conditions sufficient to assure the municipality that the utilities and improvements will be constructed or installed according to the specifications of the municipality. Sections 471.345 and 574.26 do not apply to improvements made by a subdivider or a subdivider's contractor.\nA municipality may require that an applicant establish an escrow account or other financial security for the purpose of reimbursing the municipality for direct costs relating to professional services provided during the review, approval and inspection of the project. A municipality may only charge the applicant a rate equal to the value of the service to the municipality. Services provided by municipal staff or contract professionals must be billed at an established rate.\nWhen the applicant vouches, by certified letter to the municipality, that the conditions required by the municipality for approval under this subdivision have been satisfied, the municipality has 30 days to release and return to the applicant any and all financial securities tied to the requirements. If the municipality fails to release and return the letters of credit within the 30-day period, any interest accrued will be paid to the applicant. If the municipality determines that the conditions required for approval under this subdivision have not been satisfied, the municipality must send written notice within seven business days upon receipt of the certified letter indicating to the applicant which specific conditions have not been met. The municipality shall require a maintenance or performance bond from any subcontractor that has not yet completed all remaining requirements of the municipality.\nThe regulations may permit the municipality to condition its approval on compliance with other requirements reasonably related to the provisions of the regulations and to execute development contracts embodying the terms and conditions of approval. The municipality may enforce such agreements and conditions by appropriate legal and equitable remedies.\n(a) The regulations may require that a reasonable portion of the buildable land, as defined by municipal ordinance, of any proposed subdivision be dedicated to the public or preserved for public use as streets, roads, sewers, electric, gas, and water facilities, stormwater drainage and holding areas or ponds and similar utilities and improvements, parks, recreational facilities as defined in section 471.191, playgrounds, trails, wetlands, or open space. The requirement must be imposed by ordinance or under the procedures established in section 462.353, subdivision 4a.\n(b) If a municipality adopts the ordinance or proceeds under section 462.353, subdivision 4a, as required by paragraph (a), the municipality must adopt a capital improvement budget and have a parks and open space plan or have a parks, trails, and open space component in its comprehensive plan subject to the terms and conditions in this paragraph and paragraphs (c) to (i).\n(c) The municipality may choose to accept a cash fee as set by ordinance from the applicant for some or all of the new lots created in the subdivision, based on the average fair market value of the unplatted land for which park fees have not already been paid that is, no later than at the time of final approval or under the city's adopted comprehensive plan, to be served by municipal sanitary sewer and water service or community septic and private well as authorized by state law. For purposes of redevelopment on developed land, the municipality may choose to accept a cash fee based on fair market value of the land no later than the time of final approval. \"Fair market value\" means the value of the land as determined by the municipality annually based on tax valuation or other relevant data. If the municipality's calculation of valuation is objected to by the applicant, then the value shall be as negotiated between the municipality and the applicant, or based on the market value as determined by the municipality based on an independent appraisal of land in a same or similar land use category.\n(d) In establishing the portion to be dedicated or preserved or the cash fee, the regulations shall give due consideration to the open space, recreational, or common areas and facilities open to the public that the applicant proposes to reserve for the subdivision.\n(e) The municipality must reasonably determine that it will need to acquire that portion of land for the purposes stated in this subdivision as a result of approval of the subdivision.\n(f) Cash payments received must be placed by the municipality in a special fund to be used only for the purposes for which the money was obtained.\n(g) Cash payments received must be used only for the acquisition and development or improvement of parks, recreational facilities, playgrounds, trails, wetlands, or open space based on the approved park systems plan. Cash payments must not be used for ongoing operation or maintenance of parks, recreational facilities, playgrounds, trails, wetlands, or open space.\n(h) The municipality must not deny the approval of a subdivision based solely on an inadequate supply of parks, open spaces, trails, or recreational facilities within the municipality.\n(i) Previously subdivided property from which a park dedication has been received, being resubdivided with the same number of lots, is exempt from park dedication requirements. If, as a result of resubdividing the property, the number of lots is increased, then the park dedication or per-lot cash fee must apply only to the net increase of lots.\n(a) There must be an essential nexus between the fees or dedication imposed under subdivision 2b and the municipal purpose sought to be achieved by the fee or dedication. The fee or dedication must bear a rough proportionality to the need created by the proposed subdivision or development.\n(b) If a municipality is given written notice of a dispute over a proposed fee in lieu of dedication before the municipality's final decision on an application, a municipality must not condition the approval of any proposed subdivision or development on an agreement to waive the right to challenge the validity of a fee in lieu of dedication.\n(c) An application may proceed as if the fee had been paid, pending a decision on the appeal of a dispute over a proposed fee in lieu of dedication, if (1) the person aggrieved by the fee puts the municipality on written notice of a dispute over a proposed fee in lieu of dedication, (2) prior to the municipality's final decision on the application, the fee in lieu of dedication is deposited in escrow, and (3) the person aggrieved by the fee appeals under section 462.361, within 60 days of the approval of the application. If such an appeal is not filed by the deadline, or if the person aggrieved by the fee does not prevail on the appeal, then the funds paid into escrow must be transferred to the municipality.\nMS 1978 [Repealed, 1980 c 566 s 35]\nThe regulations may require that any subdivision creating parcels, tracts, or lots, shall be platted. The regulations shall require that all subdivisions which create five or more lots or parcels which are 2-1/2 acres or less in size shall be platted. The regulations shall not conflict with the provisions of chapter 505 but may address subjects similar and additional to those in that chapter.\nThe regulations shall include provisions regarding the content of applications for proposed subdivisions, the preliminary and final review and approval or disapproval of applications, and the coordination of such reviews with affected political subdivisions and state agencies. Subdivisions including lands abutting upon any existing or proposed trunk highway, county road or highway, or county state-aid highway shall also be subject to review. The regulations may provide for the consolidation of the preliminary and final review and approval or disapproval of subdivisions. Preliminary or final approval may be granted or denied for parts of subdivision applications. The regulations may delegate the authority to review proposals to the planning commission, but final approval or disapproval shall be the decision of the governing body of the municipality unless otherwise provided by law or charter. A municipality must approve a preliminary plat that meets the applicable standards and criteria contained in the municipality's zoning and subdivision regulations unless the municipality adopts written findings based on a record from the public proceedings why the application shall not be approved. The regulations shall require that a public hearing shall be held on all subdivision applications prior to preliminary approval, unless otherwise provided by law or charter. The hearing shall be held following publication of notice of the time and place thereof in the official newspaper at least ten days before the day of the hearing. At the hearing, all persons interested shall be given an opportunity to make presentations. A subdivision application shall be preliminarily approved or disapproved within 120 days following delivery of an application completed in compliance with the municipal ordinance by the applicant to the municipality, unless an extension of the review period has been agreed to by the applicant. When a division or subdivision to which the regulations of the municipality do not apply is presented to the city, the clerk of the municipality shall within ten days certify that the subdivision regulations of the municipality do not apply to the particular division.\nIf the municipality or the responsible agency of the municipality fails to preliminarily approve or disapprove an application within the review period, the application shall be deemed preliminarily approved, and upon demand the municipality shall execute a certificate to that effect. Following preliminary approval the applicant may request final approval by the municipality, and upon such request the municipality shall certify final approval within 60 days if the applicant has complied with all conditions and requirements of applicable regulations and all conditions and requirements upon which the preliminary approval is expressly conditioned either through performance or the execution of appropriate agreements assuring performance. If the municipality fails to certify final approval as so required, and if the applicant has complied with all conditions and requirements, the application shall be deemed finally approved, and upon demand the municipality shall execute a certificate to that effect. After final approval a subdivision may be filed or recorded.\nFor one year following preliminary approval and for two years following final approval, unless the subdivider and the municipality agree otherwise, no amendment to a comprehensive plan or official control shall apply to or affect the use, development density, lot size, lot layout, or dedication or platting required or permitted by the approved application. Thereafter, pursuant to its regulations, the municipality may extend the period by agreement with the subdivider and subject to all applicable performance conditions and requirements, or it may require submission of a new application unless substantial physical activity and investment has occurred in reasonable reliance on the approved application and the subdivider will suffer substantial financial damage as a consequence of a requirement to submit a new application. In connection with a subdivision involving planned and staged development, a municipality may by resolution or agreement grant the rights referred to herein for such periods of time longer than two years which it determines to be reasonable and appropriate.\nMS 1980 [Repealed, 1982 c 415 s 3]\nA person conveying a new parcel of land which, or the plat for which, has not previously been filed or recorded, and which is part of or would constitute a subdivision to which adopted municipal subdivision regulations apply, shall attach to the instrument of conveyance either: (a) recordable certification by the clerk of the municipality that the subdivision regulations do not apply, or that the subdivision has been approved by the governing body, or that the restrictions on the division of taxes and filing and recording have been waived by resolution of the governing body of the municipality in this case because compliance will create an unnecessary hardship and failure to comply will not interfere with the purpose of the regulations; or (b) a statement which names and identifies the location of the appropriate municipal offices and advises the grantee that municipal subdivision and zoning regulations may restrict the use or restrict or prohibit the development of the parcel, or construction on it, and that the division of taxes and the filing or recording of the conveyance may be prohibited without prior recordable certification of approval, nonapplicability, or waiver from the municipality. In any action commenced by a buyer of such a parcel against the seller thereof, the misrepresentation of or the failure to disclose material facts in accordance with this subdivision shall be grounds for damages. If the buyer establishes a right to damages, a district court hearing the matter may in its discretion also award to the buyer an amount sufficient to pay all or any part of the costs incurred in maintaining the action, including reasonable attorney fees, and an amount for punitive damages not exceeding five per centum of the purchase price of the land.\n(a) In a municipality in which subdivision regulations are in force and have been filed or recorded as provided in this section, no conveyance of land to which the regulations are applicable shall be filed or recorded, if the land is described in the conveyance by metes and bounds or by reference to an unapproved registered land survey made after April 21, 1961 or to an unapproved plat made after such regulations become effective.\n(b) The foregoing provision does not apply to a conveyance if the land described:\n(1) was a separate parcel of record April 1, 1945 or the date of adoption of subdivision regulations under Laws 1945, chapter 287, whichever is the later, or of the adoption of subdivision regulations pursuant to a home rule charter, or\n(2) was the subject of a written agreement to convey entered into prior to such time, or\n(3) was a separate parcel of not less than 2-1/2 acres in area and 150 feet in width on January 1, 1966, or\n(4) was a separate parcel of not less than five acres in area and 300 feet in width on July 1, 1980, or\n(5) is a single parcel of commercial or industrial land of not less than five acres and having a width of not less than 300 feet and its conveyance does not result in the division of the parcel into two or more lots or parcels, any one of which is less than five acres in area or 300 feet in width, or\n(6) is a single parcel of residential or agricultural land of not less than 20 acres and having a width of not less than 500 feet and its conveyance does not result in the division of the parcel into two or more lots or parcels, any one of which is less than 20 acres in area or 500 feet in width.\n(c) In any case in which compliance with the foregoing restrictions will create an unnecessary hardship and failure to comply does not interfere with the purpose of the subdivision regulations, the platting authority may waive such compliance by adoption of a resolution to that effect and the conveyance may then be filed or recorded.\n(d) Any owner or agent of the owner of land who conveys a lot or parcel in violation of the provisions of this subdivision shall forfeit and pay to the municipality a penalty of not less than $100 for each lot or parcel so conveyed.\n(e) A municipality may enjoin such conveyance or may recover such penalty by a civil action in any court of competent jurisdiction.\nExcept as otherwise provided by this section all electric and gas distribution lines or piping, roadways, curbs, walks and other similar improvements shall be constructed only on a street, alley, or other public way or easement which is designated on an approved plat, or properly indicated on the official map of the municipality, or which has otherwise been approved by the governing body. When a municipality has adopted an official map, no permit for the erection of any building shall be issued unless the building is to be located upon a parcel of land abutting on a street or highway which has been designated upon an approved plat or on the official map or which has been otherwise approved by the governing body, and unless the buildings conform to the established building line. This limitation on issuing permits shall not apply to planned developments approved by the governing body pursuant to its zoning ordinance. No permit shall be issued for the construction of a building on any lot or parcel conveyed in violation of the provisions of this section.\nSubdivision regulations may provide for a procedure for varying the regulations as they apply to specific properties where an unusual hardship on the land exists, but variances may be granted only upon the specific grounds set forth in the regulations. Unusual hardship includes, but is not limited to, inadequate access to direct sunlight for solar energy systems.\nThe governing body of a municipality may vacate any publicly owned utility easement or boulevard reserve or any portion thereof, which are not being used for sewer, drainage, electric, telegraph, telephone, gas and steam purposes or for boulevard reserve purposes, in the same manner as vacation proceedings are conducted for streets, alleys and other public ways under a home rule charter or other provisions of law.\nA boulevard reserve means an easement established adjacent to a dedicated street for the purpose of establishing open space adjacent to the street and which area is designated on the recorded plat as \"boulevard reserve\".\nNothing in this section is to be construed as a limitation on the authority of municipalities which have not adopted subdivision regulations to approve plats under any other provision of law.\nSubdivision regulations adopted by municipalities may apply to parcels which are taken from existing parcels of record by metes and bounds descriptions, and the governing body or building authority may deny the issuance of permits or approvals, building permits issued under sections 326B.101 to 326B.194, or other permits or approvals to any parcels so divided, pending compliance with subdivision regulations.\nNothing in this section shall be construed to require a municipality to regulate subdivisions or to regulate all subdivisions which it is authorized to regulate by this section.\nFor the purposes of this subdivision, a \"development application\" means subdivision, planned unit development, site plan, or other similar type action. If a municipality, in approving a development application that provides all or a portion of the units for persons and families of low and moderate income, so proposes, the applicant may request that provisions authorized by clauses (1) to (4) will apply to housing for persons of low and moderate income, subject to agreement between the municipality and the applicant:\n(1) establishing sales prices or rents for housing affordable to low- and moderate-income households;\n(2) establishing maximum income limits for initial and subsequent purchasers or renters of the affordable units;\n(3) establishing means, including, but not limited to, equity sharing, or similar activities, to maintain the long-term affordability of the affordable units; and\n(4) establishing a land trust agreement to maintain the long-term affordability of the affordable units.\nClauses (1) to (3) shall not apply for more than 20 years from the date of initial occupancy except where public financing or subsidy requires longer terms.",
	"repealed": false
}