{
	"id": "62J.823",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.823",
	"title": "62J.823 HOSPITAL PRICING TRANSPARENCY.",
	"text": "This section may be cited as the \"Hospital Pricing Transparency Act.\"\nFor the purposes of this section, \"estimate\" means the actual price expected to be billed to the individual or to the individual's health plan company based on the specific diagnostic-related group code or specific procedure code or codes, reflecting any known discounts the individual would receive.\nAny hospital, as defined in section 144.696, subdivision 3, and outpatient surgical center, as defined in section 144.696, subdivision 4, shall provide a written estimate of the cost of a specific service or stay upon the request of a patient, a doctor, an advanced practice registered nurse, a physician assistant, or the patient's representative. The request must include:\n(1) the health coverage status of the patient, including the specific health plan or other health coverage under which the patient is enrolled, if any; and\n(2) at least one of the following:\n(i) the specific diagnostic-related group code;\n(ii) the name of the procedure or procedures to be performed;\n(iii) the type of treatment to be received; or\n(iv) any other information that will allow the hospital or outpatient surgical center to determine the specific diagnostic-related group or procedure code or codes.\n(a) An estimate provided by the hospital or outpatient surgical center must contain:\n(1) the method used to calculate the estimate;\n(2) the specific diagnostic-related group or procedure code or codes used to calculate the estimate, and a description of the diagnostic-related group or procedure code or codes that is reasonably understandable to a patient; and\n(3) a statement indicating that the estimate, while accurate, may not reflect the actual billed charges and that the final bill may be higher or lower depending on the patient's specific circumstances.\n(b) The estimate may be provided in any method that meets the needs of the patient and the hospital or outpatient surgical center, including electronically; however, a paper copy must be provided if specifically requested.",
	"repealed": false
}