{
	"id": "256R.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.02",
	"title": "256R.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in this section have the meanings given unless otherwise provided for in this chapter.\n\"Active beds\" means licensed beds that are not currently in layaway status.\n\"Activities costs\" means the costs for the salaries and wages of the supervisor and other activities workers, associated fringe benefits and payroll taxes, supplies, services, and consultants.\n\"Administrative costs\" means the identifiable costs for administering the overall activities of the nursing home. These costs include salaries and wages of the administrator, assistant administrator, business office employees, security guards, purchasing and inventory employees, and associated fringe benefits and payroll taxes, fees, contracts, or purchases related to business office functions, licenses, permits except as provided in the external fixed costs category, employee recognition, travel including meals and lodging, all training except as specified in subdivision 17, voice and data communication or transmission, office supplies, property and liability insurance and other forms of insurance except insurance that is a fringe benefit under subdivision 22, personnel recruitment, legal services, accounting services, management or business consultants, data processing, information technology, website, central or home office costs, business meetings and seminars, postage, fees for professional organizations, subscriptions, security services, nonpromotional advertising, board of directors fees, working capital interest expense, bad debts, bad debt collection fees, and costs incurred for travel and lodging for persons employed by a Minnesota-registered supplemental nursing services agency as defined in section 144A.70, subdivision 6.\n\"Allowed costs\" means the amounts reported by the facility which are necessary for the operation of the facility and the care of residents and which are reviewed by the Department of Human Services for accuracy; reasonableness, in accordance with the requirements set forth in title XVIII of the federal Social Security Act and the interpretations in the provider reimbursement manual; and compliance with this chapter and generally accepted accounting principles. All references to costs in this chapter shall be assumed to refer to allowed costs, unless otherwise specified.\n\"Applicable credit\" means a receipt or expense reduction as a result of a purchase discount, rebate, refund, allowance, public grant, beauty shop income, guest meals income, adjustment for overcharges, insurance claims settlement, recovered bad debts, or any other adjustment or income reducing the costs claimed by a nursing facility.\n\"Assessment reference date\" has the meaning given in section 144.0724, subdivision 2, paragraph (a).\n\"Capital assets\" means a nursing facility's buildings, fixed equipment, land improvements, leasehold improvements, and all additions to or replacements of those assets used directly for resident care.\n\"Case mix classification\" refers to resident reimbursement case mix classifications described in section 144.0724.\n\"Case mix index\" has the meaning given in section 144.0724, subdivision 2, paragraph (b).\n\"Centers for Medicare and Medicaid Services\" means the federal agency, in the United States Department of Health and Human Services that administers Medicaid, also referred to as \"CMS.\"\n\"Commissioner\" means the commissioner of human services unless specified otherwise.\n\"Consulting agreement\" means any agreement the purpose of which is for a central, affiliated, or corporate office to advise, counsel, recommend, or suggest to the owner or operator of the nonrelated nursing facility measures and methods for improving the operations of the nursing facility.\n\"Cost to limit ratio\" means a facility's total care-related cost per day divided by its total care-related payment rate limit.\n\"Desk audit\" means the establishment of the payment rate based on the commissioner's review and analysis of required reports, supporting documentation, and work sheets submitted by the nursing facility.\n\"Dietary costs\" means the costs for the salaries and wages of the dietary supervisor, dietitians, chefs, cooks, dishwashers, and other employees assigned to the kitchen and dining room, and associated fringe benefits and payroll taxes. Dietary costs also includes the salaries or fees of dietary consultants, dietary supplies, and food preparation and serving.\n\"Direct care costs\" means costs for the wages of nursing administration, direct care registered nurses, licensed practical nurses, certified nursing assistants, trained medication aides, employees conducting training in resident care topics and associated fringe benefits and payroll taxes; services from a Minnesota-registered supplemental nursing services agency up to the maximum allowable charges under section 144A.74, excluding associated lodging and travel costs; supplies that are stocked at nursing stations or on the floor and distributed or used individually, including, but not limited to: rubbing alcohol or alcohol swabs, applicators, cotton balls, incontinence pads, disposable ice bags, dressings, bandages, water pitchers, tongue depressors, disposable gloves, enemas, enema equipment, personal hygiene soap, medication cups, diapers, sanitary products, disposable thermometers, hypodermic needles and syringes, drugs not payable on a separate fee schedule by the medical assistance program or any other payer, and clinical software costs specific to the provision of nursing care to residents, such as electronic charting systems; costs of materials used for resident care training, and training courses outside of the facility attended by direct care staff on resident care topics; and costs for nurse consultants, pharmacy consultants, and medical directors. Salaries and payroll taxes for nurse consultants who work out of a central office must be allocated proportionately by total resident days or by direct identification to the nursing facilities served by those consultants.\n\"Employer health insurance costs\" means:\n(1) premium expenses for group coverage;\n(2) actual expenses incurred for self-insured plans, including actual claims paid, stop-loss premiums, and plan fees. Actual expenses incurred for self-insured plans does not include allowances for future funding unless the plan meets the Medicare requirements for reporting on a premium basis when the Medicare regulations define the actual costs; and\n(3) employer contributions to employer-sponsored individual coverage health reimbursement arrangements as provided by Code of Federal Regulations, title 45, section 146.123, employee health reimbursement accounts, and health savings accounts.\n\"External fixed costs\" means costs related to the nursing home surcharge under section 256.9657, subdivision 1; licensure fees under section 144.122; family advisory council fee under section 144A.33; scholarships under section 256R.37; planned closure rate adjustments under section 256R.40; consolidation rate adjustments under section 144A.071, subdivisions 4c, paragraph (a), clauses (5) and (6), and 4d; single-bed room incentives under section 256R.41; property taxes, special assessments, and payments in lieu of taxes; employer health insurance costs; quality improvement incentive payment rate adjustments under section 256R.39; performance-based incentive payments under section 256R.38; special dietary needs under section 256R.51; Public Employees Retirement Association employer costs; and border city rate adjustments under section 256R.481.\n\"Facility average case mix index\" or \"CMI\" means a numerical score that describes the relative resource use for all residents within the case mix classification system prescribed by the commissioner based on an assessment of each resident. The facility average CMI shall be computed as the standardized days divided by the sum of the facility's resident days. The case mix indices used shall be based on the system prescribed in section 256R.17.\n\"Field audit\" means the examination, verification, and review of the financial records, statistical records, and related supporting documentation on the nursing home and any related organization.\n\"Fringe benefit costs\" means the costs for group life, dental, workers' compensation, short- and long-term disability, long-term care insurance, accident insurance, supplemental insurance, legal assistance insurance, profit sharing, child care costs, health insurance costs not covered under subdivision 18, including costs associated with part-time employee family members or retirees, and pension and retirement plan contributions, except for the Public Employees Retirement Association costs.\n\"Generally accepted accounting principles\" means the body of pronouncements adopted by the American Institute of Certified Public Accountants regarding proper accounting procedures, guidelines, and rules.\n\"Housekeeping costs\" means the costs for the salaries and wages of the housekeeping supervisor, housekeepers, and other cleaning employees and associated fringe benefits and payroll taxes. It also includes the cost of housekeeping supplies, including, but not limited to, cleaning and lavatory supplies and contract services.\n\"Identifiable cost\" means a cost that can be directly identified with a specific nursing facility or can be directly identified with an activity or function.\n\"Interim payment rates\" means the total operating and external fixed costs payment rates determined by anticipated costs and resident days reported on an interim cost report as described in section 256R.27.\n\"Laundry costs\" means the costs for the salaries and wages of the laundry supervisor and other laundry employees, associated fringe benefits, and payroll taxes. It also includes the costs of linen and bedding, the laundering of resident clothing, laundry supplies, and contract services.\n\"Leave day\" means any calendar day during which the recipient leaves the facility and is absent overnight, and all subsequent, consecutive calendar days. An overnight absence from the facility of less than 23 hours does not constitute a leave day. Nevertheless, if the recipient is absent from the facility to participate in active programming of the facility under the personal direction and observation of facility staff, the day shall not be considered a leave day regardless of the number of hours of the recipient's absence. For purposes of this subdivision, \"calendar day\" means the 24-hour period ending at midnight.\n\"Licensee\" means the individual or organization listed on the form issued by the Minnesota Department of Health under chapter 144A or sections 144.50 to 144.56.\n\"Maintenance and plant operations costs\" means the costs for the salaries and wages of the maintenance supervisor, engineers, heating-plant employees, and other maintenance employees and associated fringe benefits and payroll taxes. It also includes identifiable costs for maintenance and operation of the building and grounds, including, but not limited to, fuel, electricity, plastic waste bags, medical waste and garbage removal, water, sewer, supplies, tools, repairs, and minor equipment not requiring capitalization under Medicare guidelines.\n\"Management agreement\" means an agreement in which one or more of the following criteria exist:\n(1) the central, affiliated, or corporate office has or is authorized to assume day-to-day operational control of the nursing facility for any six-month period within a 24-month period. \"Day-to-day operational control\" means that the central, affiliated, or corporate office has the authority to require, mandate, direct, or compel the employees of the nursing facility to perform or refrain from performing certain acts, or to supplant or take the place of the top management of the nursing facility. \"Day-to-day operational control\" includes the authority to hire or terminate employees or to provide an employee of the central, affiliated, or corporate office to serve as administrator of the nursing facility;\n(2) the central, affiliated, or corporate office performs or is authorized to perform two or more of the following: the execution of contracts; authorization of purchase orders; signature authority for checks, notes, or other financial instruments; requiring the nursing facility to use the group or volume purchasing services of the central, affiliated, or corporate office; or the authority to make annual capital expenditures for the nursing facility exceeding $50,000, or $500 per licensed bed, whichever is less, without first securing the approval of the nursing facility board of directors;\n(3) the central, affiliated, or corporate office becomes or is required to become the licensee under applicable state law;\n(4) the agreement provides that the compensation for services provided under the agreement is directly related to any profits made by the nursing facility; or\n(5) the nursing facility entering into the agreement is governed by a governing body that meets fewer than four times per year, that does not publish notice of its meetings, or that does not keep formal records of its proceedings.\n\"Medical assistance program\" means the program which reimburses the cost of health care provided to eligible recipients pursuant to chapters 256B and 256R, and United States Code, title 42, section 1396, et seq.\n\"Minimum data set\" has the meaning given in section 144.0724, subdivision 2, paragraph (d).\n\"Minor equipment\" means equipment that does not qualify as either fixed equipment or depreciable movable equipment as defined in section 256R.261.\n\"Nursing facility\" or \"facility\" means a facility with a medical assistance provider agreement that is licensed as a nursing home under chapter 144A or as a boarding care home under sections 144.50 to 144.56.\n\"Other care-related costs\" means the sum of activities costs, other direct care costs, raw food costs, therapy costs, and social services costs.\n\"Other direct care costs\" means the costs for the salaries and wages and associated fringe benefits and payroll taxes of mental health workers, religious personnel, and other direct care employees not specified in the definition of direct care costs.\n\"Other operating costs\" means the sum of administrative costs, dietary costs, housekeeping costs, laundry costs, and maintenance and plant operation costs.\n\"Payroll taxes\" means the costs for the employer's share of the FICA and Medicare withholding tax, and state and federal unemployment compensation taxes.\n\"Prior system operating cost payment rate\" means the operating cost payment rate in effect on December 31, 2015, under Minnesota Rules and Minnesota Statutes, inclusive of health insurance, plus property insurance costs from external fixed costs, minus any rate increases allowed under Minnesota Statutes 2015 Supplement, section 256B.441, subdivision 55a.\n\"Private paying resident\" means a nursing facility resident who is not a medical assistance recipient and whose payment rate is not established by another third party, including the veterans administration or Medicare.\n\"Public accountant\" means a certified public accountant or certified public accounting firm licensed in accordance with chapter 326A.\n\"Rate year\" means the 12-month period beginning on January 1.\n\"Raw food costs\" means the cost of food provided to nursing facility residents and the allocation of dietary credits. Also included are special dietary supplements used for tube feeding or oral feeding, such as elemental high nitrogen diet.\n\"Real estate taxes\" means the real estate tax liability shown on the annual property tax statements of the nursing facility for the reporting period. The term does not include personnel costs or fees for late payment.\n(a) \"Related organization\" means a person that furnishes goods or services to a nursing facility and that is a close relative of a nursing facility, an affiliate of a nursing facility, a close relative of an affiliate of a nursing facility, or an affiliate of a close relative of an affiliate of a nursing facility. As used in this subdivision, paragraphs (b) to (e) apply.\n(b) \"Affiliate\" means a person that directly, or indirectly through one or more intermediaries, controls or is controlled by, or is under common control with another person.\n(c) \"Person\" means an individual, a corporation, a partnership, an association, a trust, an unincorporated organization, or a government or political subdivision.\n(d) \"Close relative of an affiliate of a nursing facility\" means an individual whose relationship by blood, marriage, or adoption to an individual who is an affiliate of a nursing facility is no more remote than first cousin.\n(e) \"Control\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with\" means the possession, direct or indirect, of the power to direct or cause the direction of the management, operations, or policies of a person, whether through the ownership of voting securities, by contract, or otherwise.\n\"Reporting period\" means the one-year period beginning on October 1 and ending on the following September 30 during which incurred costs are accumulated and then reported on the statistical and cost report. If a facility is reporting for an interim or settle-up period, the reporting period beginning date may be a date other than October 1. An interim or settle-up report must cover at least five months, but no more than 17 months, and must always end on September 30.\n\"Resident day\" means a day for which nursing services are rendered and billable, or a day for which a bed is held and billed. The day of admission is considered a resident day, regardless of the time of admission. The day of discharge is not considered a resident day, regardless of the time of discharge.\nMS 2022 [Repealed, 2024 c 127 art 59 s 57]\n\"Salaries and wages\" means amounts earned by and paid to employees or on behalf of employees to compensate for necessary services provided. Salaries and wages include accrued vested vacation and accrued vested sick leave pay.\n\"Settle-up payment rates\" means the total operating and external fixed costs payment rates determined by actual allowable costs and resident days reported on a settle-up cost report as described under section 256R.27.\n\"Social services costs\" means the costs for the salaries and wages of the supervisor and other social work employees, associated fringe benefits and payroll taxes, supplies, services, and consultants. This category includes the cost of those employees who manage and process admission to the nursing facility.\n\"Special assessments\" means the actual special assessments and related interest paid during the reporting period that are not voluntary costs. The term does not include personnel costs, fees for late payment, or special assessments for projects that are reimbursed in the property rate.\n\"Stakeholders\" means individuals and representatives of organizations interested in long-term care, including nursing homes, consumers, and labor unions.\n\"Standardized days\" means the sum of resident days by case mix classification multiplied by the case mix index for each classification. When a facility has resident days at a penalty classification, these days shall be reported as resident days at the case mix classification established immediately after the penalty period, if available, and otherwise, at the case mix classification in effect before the penalty began.\n\"Statistical and cost report\" means the forms supplied by the commissioner for annual reporting of nursing facility expenses and statistics, including instructions and definitions of items in the report.\n\"Therapy costs\" means any costs related to therapy services provided to residents that are not separately billable from the daily operating rate.\n\"Vested\" means the existence of a legally fixed unconditional right to a present or future benefit.\n\"Working capital debt\" means debt incurred to finance nursing facility operating costs. Working capital debt does not include debt incurred to acquire or refinance a capital asset.\n\"Working capital interest expense\" means the interest expense incurred on working capital debt during the reporting period.",
	"repealed": false
}