{
	"id": "152.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.01",
	"title": "152.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of this chapter, shall be given the meanings subjoined to them.\nThe term \"drug\" includes all medicines and preparations recognized in the United States Pharmacopoeia or National Formulary and any substance or mixture of substances intended to be used for the cure, mitigation, or prevention of disease of either humans or other animals.\nMS 1967 [Repealed, 1969 c 933 s 22]\n\"Administer\" means to deliver by, or pursuant to the lawful order of a practitioner a single dose of a controlled substance to a patient or research subject by injection, inhalation, ingestion, or by any other immediate means.\n\"Cocaine\" means coca leaves and any salt, compound, derivative, or preparation of coca leaves, including cocaine and ecgonine, the salts and isomers of cocaine and ecgonine, and the salts of their isomers and any salt, compound, derivative, or preparation thereof that is chemically equivalent or identical with any of those substances, except decocainized coca leaves or extraction of coca leaves, which extractions do not contain cocaine or ecgonine.\nMS 1967 [Repealed, 1969 c 933 s 22]\n\"Controlled substance\" means a drug, substance, or immediate precursor in Schedules I through V of section 152.02. The term shall not include distilled spirits, wine, malt beverages, intoxicating liquors or tobacco.\n[Repealed, 1971 c 937 s 22]\n\"Hallucinogen\" means any hallucinogen listed in section 152.02, subdivision 2, paragraph (d), or Minnesota Rules, part 6800.4210, item C, except marijuana and Tetrahydrocannabinols.\nThe term \"pharmacist intern\" means a natural person, a graduate of the College of Pharmacy, University of Minnesota, or other pharmacy college, approved by the board, or a person satisfactorily progressing toward the degree in pharmacy required for licensure, registered by the state Board of Pharmacy, for the purpose of obtaining practical experience as a requirement for licensure as a pharmacist or a qualified applicant, awaiting licensure.\n\"Manufacture,\" in places other than a pharmacy, means and includes the production, cultivation, quality control, and standardization by mechanical, physical, chemical, or pharmaceutical means, packing, repacking, tableting, encapsulating, labeling, relabeling, filling, or by other process, of drugs.\n\"Dispense\" means to deliver one or more doses of a controlled substance in a suitable container, properly labeled, for subsequent administration to, or use by a patient or research subject.\n(a) \"Marijuana\" means:\n(1) cannabis plants;\n(2) cannabis flower;\n(3) cannabis concentrate;\n(4) cannabis products;\n(5) cannabis seed; or\n(6) a mixture containing any tetrahydrocannabinol or artificially derived cannabinoid in a concentration that exceeds 0.3 percent as measured by weight.\n(b) Marijuana does not include:\n(1) the mature stalks of a cannabis plant;\n(2) fiber from such stalks;\n(3) any other compound, manufacture, salt, derivative, mixture, or preparation of such mature stalks, except the resin extracted therefrom, fiber, oil, or cake;\n(4) oil or cake made from the seeds of a cannabis plant;\n(5) the sterilized seed of a cannabis plant which is incapable of germination; or\n(6) industrial hemp as defined in section 18K.02, subdivision 3.\n\"Mixture\" means a preparation, compound, mixture, or substance containing a controlled substance, regardless of purity except as provided in subdivision 16; sections 152.021, subdivision 2, paragraph (b); 152.022, subdivision 2, paragraph (b); and 152.023, subdivision 2, paragraph (b).\n\"Narcotic drug\" means any of the following, whether produced directly or indirectly by extraction from substances of vegetable origin, or independently by means of chemical synthesis, or by a combination of extraction and chemical synthesis:\n(1) opium, coca leaves, opiates, and methamphetamine;\n(2) a compound, manufacture, salt, derivative, or preparation of opium, coca leaves, opiates, or methamphetamine;\n(3) a substance, and any compound, manufacture, salt, derivative, or preparation thereof, which is chemically identical with any of the substances referred to in clauses (1) and (2), except that the words \"narcotic drug\" as used in this chapter shall not include decocainized coca leaves or extracts of coca leaves, which extracts do not contain cocaine or ecgonine.\n\"Opiate\" means any dangerous substance having an addiction forming or addiction sustaining liability similar to morphine or being capable of conversion into a drug having such addiction forming or addiction sustaining liability.\n\"Opium poppy\" means the plant of the species Papaver somniferum L., except the seeds thereof.\n\"Park zone\" means an area designated as a public park by the federal government, the state, a local unit of government, a park district board, a park and recreation board in a city of the first class, or a federally recognized Indian Tribe. \"Park zone\" includes the area within 300 feet or one city block, whichever distance is greater, of the park boundary.\n\"Person\" includes every individual, copartnership, corporation or association of one or more individuals.\n\"Poppy straw\" means all parts, except the seeds, of the opium poppy, after mowing.\n\"School zone\" means:\n(1) any property owned, leased, or controlled by a school district or an organization operating a nonpublic school, as defined in section 123B.41, subdivision 9, where an elementary, middle, secondary school, secondary vocational center or other school providing educational services in grade one through grade 12 is located, or used for educational purposes, or where extracurricular or cocurricular activities are regularly provided;\n(2) the area surrounding school property as described in clause (1) to a distance of 300 feet or one city block, whichever distance is greater, beyond the school property; and\n(3) the area within a school bus when that bus is being used to transport one or more elementary or secondary school students.\n\"Immediate precursor\" means a substance which the state Board of Pharmacy has found to be and by rule designates as being the principal compound commonly used or produced for use, and which is an immediate chemical intermediary used or likely to be used in the manufacture of a controlled substance, the control of which is necessary to prevent, curtail, or limit such manufacture.\n\"Sell\" means:\n(1) to sell, give away, barter, deliver, exchange, distribute or dispose of to another, or to manufacture; or\n(2) to offer or agree to perform an act listed in clause (1); or\n(3) to possess with intent to perform an act listed in clause (1).\n\"Small amount\" as applied to marijuana means 42.5 grams or less. This provision shall not apply to the resinous form of marijuana. The weight of fluid used in a water pipe may not be considered in determining a small amount except in cases where the marijuana is mixed with four or more fluid ounces of fluid.\nA \"subsequent controlled substance conviction\" means that before commission of the offense for which the person is convicted under this chapter, the person was convicted of a violation of section 152.021 or 152.022, including an attempt or conspiracy, or was convicted of a similar offense by the United States or another state, provided that ten years have not elapsed since discharge from sentence.\n[Repealed, 1994 c 636 art 2 s 69]\n(a) Except as otherwise provided in paragraph (b), \"drug paraphernalia\" means all equipment, products, and materials of any kind, except those items used in conjunction with permitted uses of controlled substances under this chapter or the Uniform Controlled Substances Act, which are knowingly or intentionally used primarily in (1) manufacturing a controlled substance, (2) injecting, ingesting, inhaling, or otherwise introducing into the human body a controlled substance, or (3) enhancing the effect of a controlled substance.\n(b) \"Drug paraphernalia\" does not include the possession, manufacture, delivery, or sale of: (1) hypodermic syringes or needles or any instrument or implement which can be adapted for subcutaneous injections; or (2) products that detect the presence of fentanyl or a fentanyl analog in a controlled substance.\n\"Public housing zone\" means any public housing project or development administered by a local housing agency, plus the area within 300 feet of the property's boundary, or one city block, whichever distance is greater.\n\"Unlawfully\" means selling or possessing a controlled substance in a manner not authorized by law.\n\"Orphan drug\" means a drug for a disease or condition which is rare in the United States and has been designated as an orphan drug by the Secretary of Health and Human Services as provided in the Orphan Drug Act, Public Law 92-414, as amended.\n\"Drug treatment facility\" means any facility in which a residential rehabilitation program licensed under chapter 245G or Minnesota Rules, parts 9530.6510 to 9530.6590, is located, and includes any property owned, leased, or controlled by the facility.\n(a) Except as provided in paragraph (b), \"analog\" means a substance, the chemical structure of which is substantially similar to the chemical structure of a controlled substance in Schedule I or II:\n(1) that has a stimulant, depressant, or hallucinogenic effect on the central nervous system that is substantially similar to or greater than the stimulant, depressant, or hallucinogenic effect on the central nervous system of a controlled substance in Schedule I or II; or\n(2) with respect to a particular person, if the person represents or intends that the substance have a stimulant, depressant, or hallucinogenic effect on the central nervous system that is substantially similar to or greater than the stimulant, depressant, or hallucinogenic effect on the central nervous system of a controlled substance in Schedule I or II.\n(b) \"Analog\" does not include:\n(1) a controlled substance;\n(2) any substance for which there is an approved new drug application under the Federal Food, Drug, and Cosmetic Act; or\n(3) with respect to a particular person, any substance, if an exemption is in effect for investigational use, for that person, as provided by United States Code, title 21, section 355, and the person is registered as a controlled substance researcher as required under section 152.12, subdivision 3, to the extent conduct with respect to the substance is pursuant to the exemption and registration.\nEach of the following is an \"aggravating factor\":\n(1) the defendant, within the previous ten years, has been convicted of a violent crime, as defined in section 609.1095, subdivision 1, paragraph (d), other than a violation of a provision under this chapter, including an attempt or conspiracy, or was convicted of a similar offense by the United States or another state;\n(2) the offense was committed for the benefit of a gang under section 609.229;\n(3) the offense involved separate acts of sale or possession of a controlled substance in three or more counties;\n(4) the offense involved the transfer of controlled substances across a state or international border and into Minnesota;\n(5) the offense involved at least three separate transactions in which controlled substances were sold, transferred, or possessed with intent to sell or transfer;\n(6) the circumstances of the offense reveal the offender to have occupied a high position in the drug distribution hierarchy;\n(7) the defendant used a position or status to facilitate the commission of the offense, including positions of trust, confidence, or fiduciary relationships;\n(8) the offense involved the sale of a controlled substance to a person under the age of 18 or a vulnerable adult as defined in section 609.232, subdivision 11;\n(9) the defendant or an accomplice manufactured, possessed, or sold a controlled substance in a school zone, park zone, correctional facility, or drug treatment facility; or\n(10) the defendant or an accomplice possessed equipment, drug paraphernalia, documents, or money evidencing that the offense involved the cultivation, manufacture, distribution, or possession of controlled substances in quantities substantially larger than the minimum threshold amount for the offense.\nAs used in sections 152.021 to 152.025, \"fentanyl\" includes fentanyl, carfentanil, and any fentanyl analogs and fentanyl-related substances listed in section 152.02, subdivisions 2 and 3.\n\"Artificially derived cannabinoid\" has the meaning given in section 342.01, subdivision 6.\n\"Cannabis concentrate\" has the meaning given in section 342.01, subdivision 15.\n\"Cannabis flower\" has the meaning given in section 342.01, subdivision 16.\n\"Cannabis plant\" has the meaning given in section 342.01, subdivision 19.\n\"Cannabis product\" has the meaning given in section 342.01, subdivision 20.\n\"Edible cannabis product\" has the meaning given in section 342.01, subdivision 31.\n\"Hemp-derived consumer product\" has the meaning given in section 342.01, subdivision 37.\n\"Lower-potency hemp edible\" has the meaning given in section 342.01, subdivision 50.",
	"repealed": false
}