{
	"id": "116J.6595",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.6595",
	"title": "116J.6595 CANNABIS INDUSTRY NAVIGATION GRANTS.",
	"text": "The commissioner of employment and economic development shall establish CanNavigate, a program to award grants to eligible organizations to help individuals navigate the regulatory structure of the legal cannabis industry.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Eligible organization\" means any organization capable of helping individuals navigate the regulatory structure of the legal cannabis industry, particularly individuals facing barriers to education or employment, and may include educational institutions, nonprofit organizations, private businesses, community groups, units of local government, or partnerships between different types of organizations.\n(d) \"Industry\" means the legal cannabis industry in the state of Minnesota.\n(e) \"Program\" means the CanNavigate grant program.\n(f) \"Social equity applicant\" means a person who meets the qualification requirements in section 342.17.\n(a) Grant money awarded to eligible organizations may be used for both developing technical assistance resources relevant to the regulatory structure of the legal cannabis industry and for providing technical assistance or navigation services to individuals.\n(b) The commissioner must award grants to eligible organizations through a competitive grant process.\n(c) To receive grant money, an eligible organization must submit a written application to the commissioner, using a form developed by the commissioner, explaining the organization's ability to assist individuals in navigating the regulatory structure of the legal cannabis industry, particularly individuals facing barriers to education or employment.\n(d) An eligible organization's grant application must also include:\n(1) a description of the proposed technical assistance or navigation services, including the types of individuals targeted for assistance;\n(2) any evidence of the organization's past success in providing technical assistance or navigation services to individuals, particularly individuals who live in areas where long-term residents are eligible to be social equity applicants;\n(3) an estimate of the cost of providing the technical assistance;\n(4) the sources and amounts of any nonstate money or in-kind contributions that will supplement grant money, including any amounts that individuals will be charged to receive assistance; and\n(5) any additional information requested by the commissioner.\n(e) In awarding grants under this subdivision, the commissioner shall give weight to applications from organizations that demonstrate a history of successful technical assistance or navigation services, particularly for individuals facing barriers to education or employment. The commissioner shall also give weight to applications where the proposed technical assistance will serve areas where long-term residents are eligible to be social equity applicants. To the extent practicable, the commissioner shall fund technical assistance for a variety of sectors in the legal cannabis industry, including both processing and retail sectors.\nThe commissioner shall make extensive efforts to publicize these grants, including through partnerships with community organizations, particularly those organizations located in areas where long-term residents are eligible to be social equity applicants.\nBy January 15, 2024, and each January 15 thereafter, the commissioner must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over economic development that details awards given through the CanNavigate program and the use of grant money, including any measures of success toward helping individuals navigate the regulatory structure of the legal cannabis industry.",
	"repealed": false
}