{
	"id": "270C.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.33",
	"title": "270C.33 COMMISSIONER ASSESSMENT PROCEDURES.",
	"text": "All orders and decisions of the commissioner, or any subordinates, respecting any tax, assessment, or other obligation, must be in writing and entered into the records of the commissioner.\n(a) At the same time that notice of an assessment, determination, or order, of the commissioner is given to a taxpayer, the taxpayer must be given a written notice that:\n(1) describes the taxpayer's appeal rights;\n(2) lists the amounts of tax, interest, additions to tax, and penalties due; and\n(3) explains the basis for the assessment.\n(b) Failure to provide all the required information does not invalidate the assessment, determination, or order for purposes of satisfying statutory notice requirements if the assessment, determination, or order contains sufficient information to advise the taxpayer that an assessment has been made.\nIf a taxpayer fails to file a return, the commissioner, from information in the commissioner's possession or obtainable by the commissioner, may make and file a return for the taxpayer, or may issue an order of assessment under subdivision 4.\n(a) The commissioner may issue an order of assessment in any of the following circumstances:\n(1) the commissioner determines that the correct amount of tax is different than that assessed on a return filed with the commissioner;\n(2) no return has been filed and the commissioner determines the amount of tax that should have been assessed;\n(3) the commissioner determines that the correct amount of a refundable credit is different than the amount claimed by a taxpayer. For purposes of this subdivision, \"refundable credit\" means a refund benefit or credit due a person that is unrelated to the person's liability for a tax. \"Refundable credit\" does not include estimated tax payments or withholding taxes. An assessment for an overpayment of a refundable credit may be collected in the same manner as a tax collected by the commissioner;\n(4) the commissioner determines the correct amount of a tax that the taxpayer is not required to assess by a return filed with the commissioner; and\n(5) the commissioner determines that a penalty other than a penalty for late payment of tax, late filing of a return, or failure to pay tax by electronic means should be imposed, and the penalty is not included on an order of assessment made under clauses (1) to (4).\n(b) An order of assessment must be in writing.\n(c) An order of assessment must be signed by the commissioner or a delegate, or have their facsimile signature, if the change in tax, excluding penalties and interest, exceeds $1,000.\n(d) An order of assessment is final when made but, as applicable, is reviewable administratively under section 270C.35, or appealable to Tax Court under chapter 271.\nNo collection action can be taken on an order of assessment, or any other order imposing a liability, including the filing of liens under section 270C.63, and no late payment penalties may be imposed when a return has been filed for the tax type and period upon which the order is based, during the appeal period of an order. The appeal period of an order ends: (1) 60 days after the notice date designated by the commissioner on the order; (2) if an administrative appeal is filed under section 270C.35, 60 days after the notice date designated by the commissioner on the written determination of the administrative appeal; (3) if an appeal to Tax Court is filed under chapter 271, when the decision of the Tax Court is made; or (4) if an appeal to Tax Court is filed and the appeal is based upon a constitutional challenge to the tax, 60 days after final determination of the appeal. This subdivision does not apply to a jeopardy assessment under section 270C.36, or a jeopardy collection under section 270C.36.\nA return or assessment of tax made by the commissioner is prima facie correct and valid. The taxpayer has the burden of establishing its incorrectness or invalidity in any related action or proceeding.\nThe commissioner, on examining returns for more than one year or period, may issue one order covering the period under examination that reflects the aggregate refund or additional tax due.\nAn assessment of tax made by the commissioner, sent postage prepaid by United States mail to the taxpayer at the taxpayer's last known address, or sent by electronic mail to the taxpayer's last known electronic mailing address as provided for in section 325L.08, is sufficient even if the taxpayer is deceased or is under a legal disability, or, in the case of a corporation, has terminated its existence, unless the commissioner has been provided with a new address by a party authorized to receive notices of assessment. Notice of an assessment is sufficient if it is sent on or before the notice date designated by the commissioner on the assessment.\nA taxpayer shall have the right at any time, whether or not an order has been issued, to sign and deliver to the commissioner a written consent to a change in tax liability that waives the requirement of any additional notice and all rights to an administrative appeal and appeal to Tax Court concerning the assessment and collection of any part or all of the tax liability.",
	"repealed": false
}