{
	"id": "13.7191",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.7191",
	"title": "13.7191 MISCELLANEOUS INSURANCE DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside chapter 13. Those sections classify insurance data as other than public, place restrictions on access to government data, or involve data sharing.\nAccess to proceedings and records of summary proceedings by the commissioner of commerce against insurers and judicial review of such proceedings is governed by section 60B.14, subdivisions 1, 2, and 3.\n(a) Powers of commissioner. The commissioner may share data with the board of the Minnesota Insurance Guaranty Association as provided by section 60C.14, subdivision 2.\n(b) Insurer financial condition data. Recommendations on the financial condition of an insurer submitted to the commissioner of commerce by the Insurance Guaranty Association are classified under section 60C.15.\nDisclosure of information obtained by the commissioner of commerce under section 60D.18, 60D.19, or 60D.20 is governed by section 60D.22.\nData on insurers supervised by the commissioner of commerce under chapter 60G are classified under section 60G.03, subdivision 1.\n(a) Licensing; termination. Access to data on insurance producer terminations held by the commissioner of commerce is governed by section 60K.51.\n(b) Data sharing. Sharing of licensing and investigative data on insurance producers is governed by section 60K.52.\nCertain data submitted to the commissioner of commerce by a life and health guaranty association are classified under section 61B.28, subdivision 2.\nData relating to suspension or revocation of a solicitor's or agent's license are classified under section 62C.17, subdivision 4.\n(a) Financial statements. Unaudited financial statements submitted to the commissioner by a health maintenance organization are classified under section 62D.08, subdivision 6.\n(b) Examinations. Data obtained by the commissioner of health in the course of an examination of the affairs of a health maintenance organization are classified under section 62D.14, subdivisions 1 and 4a.\n(c) Disclosure. Disclosure of certain information held by health maintenance organizations is governed by section 62D.145.\n(d) Access to data. Data obtained by any person or committee conducting a review of a health maintenance organization or a participating entity is authorized by section 62D.22, subdivision 10.\n(e) Filings and reports. Filings, reports, and other data required under sections 62D.10 to 62D.30 are classified under section 62D.23.\nThe terms and conditions of certain preferred provider agreements are classified under section 62E.13, subdivision 11.\n[Repealed, 2001 c 215 s 41]\n(a) Health carrier data. Data received by the commissioner from health carriers under chapter 62L are classified under section 62L.10, subdivision 3.\n(b) Small employer reinsurance association data. Patient identifying data held by the reinsurance association are classified under section 62L.16, subdivision 6.\n(a) Data sharing. Data sharing involving utilization review organizations are governed by section 62M.04, subdivision 5.\n(b) Confidentiality of data. Confidentiality of certain data obtained by a utilization review organization is governed by section 62M.08.\n(a) Minnesota Risk Adjustment Association. Data privacy issues concerning the Minnesota Risk Adjustment Association are governed by section 62Q.03, subdivision 9.\n(b) Essential community provider. Data on applications for designation as an essential community provider are classified under section 62Q.19, subdivision 2.\n(c) Audits conducted by independent organizations. Data provided by an independent organization related to an audit report are governed by section 62Q.37, subdivision 8.\nClassification and sharing of data of MNsure is governed by section 62V.06.\nThe classification of certain information disclosures to the commissioner of commerce by a health carrier is governed by section 62K.07, subdivision 1, paragraph (c).\nThe sharing of data on automobile thefts between law enforcement and prosecutors and insurers is governed by section 65B.82.\nMS 2022 [Repealed, 2023 c 25 s 190]\nAccess to ratemaking data is governed by section 79.096.\n(a) Self-Insurers' Advisory Committee. Data received by the Self-Insurers' Advisory Committee from the commissioner are classified under section 79A.02, subdivision 2.\n(b) Self-insurers' security fund. Disclosure of certain data received by the self-insurers' security is governed by section 79A.09, subdivision 4.\n(c) Commercial self-insurers' security fund. Disclosure of certain data received by the commercial self-insurers' security fund is governed by section 79A.26, subdivision 4.\n(d) Self-insurers' security fund and the board of trustees. The security fund and its board of trustees are governed by section 79A.16.\n(e) Commercial self-insurance group security fund. The commercial self-insurance group security fund and its board of trustees are governed by section 79A.28.\nInformation and materials provided to the Nationwide Multistate Licensing System and Registry or shared with state and regulatory officials with mortgage industry oversight authority are governed by section 58A.14.\nCertain reports and recommendations made by a broker association to the commissioner of commerce regarding the financial condition of any eligible surplus lines insurer are classified under section 60A.208, subdivision 7.\nCertain data submitted to the commissioner of commerce by the Surplus Lines Association of Minnesota are classified under section 60A.2085, subdivision 8.\nCertain data obtained during background checks of applicants for a resident adjuster license are classified under section 72B.041, subdivision 2.\nAccess to data related to the standard valuation law is governed by section 61A.25, subdivision 13.\nData provided pursuant to the certification of a reinsurer is governed by section 60A.0921, subdivision 2, paragraph (g).\nAccess to Minnesota Comprehensive Health Association data related to the Minnesota premium security plan is governed by section 62E.23, subdivision 6.\nWorkers' compensation insurance coverage data reported to or collected by the Department of Labor and Industry is classified and limited under section 176.185, subdivision 11.",
	"repealed": false
}