{
	"id": "475.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.54",
	"title": "475.54 MATURITIES; REDEMPTION.",
	"text": "Except as provided in subdivision 3, 5a, 15, or 17, or as expressly authorized in another law, all obligations of each issue shall mature or be subject to mandatory sinking fund redemption in installments, the first not later than three years and the last not later than 30 years from the date of the issue; or 40 years or the useful life of the asset, whichever is less, for essential community facilities financed or guaranteed by the United States Department of Agriculture and municipal water and wastewater treatment systems. No amount of principal of the issue payable in any calendar year shall exceed an amount equal to the smallest amount payable in any preceding calendar year ending three years or more after the issue date multiplied:\n(1) by five, in the case of obligations maturing not later than 25 years from the date of issue; and\n(2) by six, in the case of obligations maturing 25 years or later from the date of issue.\nA serial maturity schedule conforming to subdivision 1 may be established for each new issue of obligations of a municipality, or the governing body may in its discretion adjust such schedule so that the combined maturities of the new issue and any other designated issue or issues will conform to subdivision 1, provided that all such issues are general obligations or all are payable from a common fund. Notwithstanding the provisions of any other general or special law, any school district having an outstanding state loan or loans, if it issues and sells bonds on the public market for any purpose other than refunding such loans, or refunding outstanding bonds as provided in this subdivision shall adjust the schedule of the maturities thereof so that the total amount of principal and interest to become due on these bonds and on all other bonds of the school district, during each of the 30 fiscal or calendar years next following, will be as nearly equal as practicable, provided that the annual amounts of maturing principal may be fixed at multiples of $5,000. A school district which has an outstanding state loan or loans may refund outstanding bonds, provided that the school loan committee established in section 126C.67 approves such refunding. The committee shall approve refunding outstanding bonds only if such refunding results in lower annual debt service payments than the district made prior to the refunding.\nObligations payable solely from a special fund, for payment of which the full faith and credit of the issuer is not pledged, may mature at any time or times within 30 years from date of issue, (40 years or the useful life of the asset, whichever is less, if for municipal water and wastewater treatment systems and essential community facilities financed or guaranteed by the United States Department of Agriculture) if the receipts pledged to the fund are estimated by the governing body to be sufficient and are irrevocably appropriated first to pay annual or semiannual interest on all obligations payable from the fund and to provide such reserve as may be agreed upon for the security of interest payments, and then to retire a specified portion of the principal in each year according to a schedule of redemption and prepayment which conforms to the requirements for the maturity schedule of other obligations in subdivision 1.\nAny obligation may be issued reserving the right of redemption and payment thereof prior to maturity, at par and accrued interest or at such premium and at such time or times as shall be determined by the governing body. Notice of the call of any prepayable obligation shall be published in a daily or weekly periodical published in a Minnesota city of the first class, or its metropolitan area, which circulates throughout the state and furnishes financial news as a part of its service; provided that published notice of the call need not be given if the obligation is in registered form and notice has been mailed to the registered holder of the obligation. When any such obligation has been validly called for redemption in accordance with its terms, and the principal thereof and all interest thereon to the date of redemption have been paid or deposited with the paying agent, interest thereon shall cease; provided that no obligation issued subsequent to July 1, 1967, shall be deemed validly called for redemption unless the notice herein required has been published or so mailed prior to the date fixed for its redemption. If actual notice of the call has been given through a different means of communication, the holder of an obligation may waive published or mailed notice.\nMS 1969 [Repealed, 1971 c 903 s 6]\nAny obligation may be issued giving its owner the right to tender, or the municipality to demand tender of, the obligation to the municipality or another person designated by it, for purchase at a specified time or times, if the municipality has first entered into an agreement with a suitable financial institution obligating the financial institution to provide funds on a timely basis for purchase of bonds tendered. The obligation shall not be deemed to mature on any tender date, within the meaning of subdivision 1, and the purchase of a tendered obligation shall not be deemed a payment or discharge of the obligation by the municipality. Obligations tendered for purchase may be remarketed by or on behalf of the municipality or any other purchaser. The municipality may enter into agreements deemed appropriate to provide for the purchase and remarketing of tendered obligations, including provisions under which undelivered obligations may be deemed tendered for purchase and new obligations may be substituted for them, provisions for the payment of charges of tender agents, remarketing agents, and financial institutions extending lines of credit or letters of credit assuring repurchase, and for reimbursement of advances under letters of credit, which charges and reimbursements may be paid from the proceeds of the obligations or from tax and other revenues appropriated for the payment and security of the obligations, and similar or related provisions.\nMS 1969 [Repealed, 1971 c 903 s 6]\nAny obligation issued as part of a series in a principal amount of $25,000,000 or more may be payable in currency other than currency of the United States if at the time of issue of the obligation the municipality enters into an agreement with a bank or dealer described in section 118A.06, that provides for payments to the municipality in the foreign currency at the times and in the amounts necessary to pay principal and interest on the obligations when due and payable in the foreign currency and corresponding payments by the municipality in United States currency of a determinate amount or amounts and at the times the agreement specifies. For purposes of chapter 475, the outstanding amount of the municipality's obligations payable in a foreign currency is the principal component of all remaining payments to be made by the municipality in United States currency under the agreement and the amount or rate of interest on the obligations is the interest component of the payments.\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nMS 1969 [Repealed, 1971 c 903 s 6]\nFor purposes of determining the amount of principal that may be payable in any calendar year under subdivision 1, any principal payment obligation secured by an investment, the face amount of which is equal to or greater than the amount of principal, may be disregarded if the investment matures or is callable by the holder thereof on or before the maturity date of the principal.\nA municipality may enter into an agreement for an exchange of interest rates pursuant to this subdivision if the agreement either is with or is guaranteed by a party whose equivalent obligations are rated A+ or better by a nationally recognized rating agency. A municipality with outstanding obligations or a municipality which has determined to issue obligations it is authorized to issue may agree to pay sums equal to interest at a fixed rate or at a variable rate determined pursuant to a formula set out in the agreement on an amount not exceeding the outstanding principal amount of the obligations at the time of payment, in exchange for an agreement by the counterparty to pay sums equal to interest on a like amount at a fixed rate or a variable rate determined pursuant to a formula set out in the agreement or to provide for an interest rate cap or floor. The agreement to pay the counterparty is not an obligation of the municipality as defined in section 475.51, subdivision 3. For purposes of calculation of a debt service levy, determination of a rate of interest on a special assessment or other calculation based on the rate of interest on an obligation, a municipality which has entered into an interest rate swap agreement described in this subdivision may determine to treat the amount or rate of interest on the obligation as the net rate or amount of interest payable after giving effect to the swap agreement. Subject to any applicable bond covenants, the municipality may pledge to the payment of amounts due or to become due under the swap agreement, including termination payments, sources of payment pledged or available to pay debt service on the obligations with respect to which the swap agreement was made or from any other available source of the municipality. A municipality may issue obligations under section 475.67 to provide for any payment, including a termination payment, due or to become due under a swap agreement.\nObligations payable primarily from a source other than ad valorem taxes may mature at any time or times within 30 years after the date of issue, if the governing body estimates that the primary source of payment is sufficient to pay when due the principal of and interest on the obligations and if the primary source of payment is irrevocably appropriated to payment of the obligations.",
	"repealed": false
}