{
	"id": "216C.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.435",
	"title": "216C.435 DEFINITIONS; PACE LOAN PROGRAMS.",
	"text": "For the purposes of sections 216C.435 to 216C.437, the following terms have the meanings given them.\n\"Authority\" means a housing and redevelopment authority or economic development authority created pursuant to section 469.003, 469.004, or 469.091, a port authority pursuant to section 469.049, 469.1082, or special law, or another entity authorized by law to exercise the powers of an authority created pursuant to one of those sections. Authority does not include a residential PACE administrator.\n\"City\" means a home rule charter or statutory city.\n\"Energy improvements\" means:\n(1) any new construction, renovation, or retrofitting of qualifying commercial real property to improve energy efficiency that: (i) is permanently affixed to the property; and (ii) results in a net reduction in energy consumption or greenhouse gas emissions, as documented in an energy audit based on the amount of future energy saved or emissions avoided;\n(2) any renovation or retrofitting of qualifying residential real property that is permanently affixed to the property and is eligible to receive an incentive through a program offered by the electric or natural gas utility that provides service under section 216B.241 to the property or is otherwise determined to be an eligible energy improvement by the commissioner under section 216B.241, subdivision 1d, paragraph (a);\n(3) permanent installation of new or upgraded electrical circuits and related equipment to enable electrical vehicle charging; or\n(4) a solar voltaic or solar thermal energy system attached to, installed within, or proximate to a building that generates electrical or thermal energy from a renewable energy source that has been documented in an energy audit or renewable energy system feasibility study, along with the estimated amount of related renewable energy production.\n\"Commercial PACE loan contractor\" means a person or entity that installs eligible improvements financed under a commercial PACE loan program.\n\"Commercial PACE loan program\" means a financing program established under section 216C.436.\n\"Commissioner\" means the commissioner of commerce.\n\"Eligible improvement\" means one or more energy improvements, resiliency improvements, or water improvements made to qualifying real property.\n\"Energy audit\" means a formal evaluation of the energy consumption of a building by a certified energy auditor, whose certification is approved by the commissioner, for the purpose of identifying appropriate energy improvements that could be made to the building and including an estimate of the effective useful life, the reduction of energy consumption, and the related avoided greenhouse gas emissions resulting from the proposed eligible improvements.\nMS 2016 [Repealed, 2018 c 155 s 38]\n\"Homeowner\" means an owner of qualifying residential real property. Homeowner includes all the persons on the deed having a legal interest in the property and all persons on the mortgage or note.\n\"Implementing entity\" means the local government or an authority designated by the local government by resolution to implement and administer programs described in sections 216C.436 and 216C.437. Implementing entity does not include a residential PACE administrator.\n\"Local government\" means a city, county, or town.\n\"Multifamily residential dwelling\" means a residential dwelling containing five or more units intended for use as a residence by tenants or lessees of the owner.\n\"PACE\" means property assessed clean energy.\n\"Qualifying commercial real property\" means a multifamily residential dwelling, a commercial or industrial building, or farmland, as defined in section 216C.436, subdivision 1b, that the implementing entity has determined, after review of an energy audit, renewable energy system feasibility study, water improvement study, resiliency improvement study, or agronomic assessment, as defined in section 216C.436, subdivision 1b, can benefit from installing eligible improvements or land and water improvements, as defined in section 216C.436, subdivision 1b. Qualifying commercial real property includes new construction.\n\"Qualifying residential real property\" means a single-family residential dwelling, or other residential dwelling of four or fewer units, that the implementing entity has determined can be benefited by installation of cost-effective energy improvements.\n\"Renewable energy\" means energy produced by means of solar thermal, solar photovoltaic, wind, or geothermal resources.\n\"Renewable energy system feasibility study\" means a written study, conducted by a contractor trained to perform that analysis, for the purpose of determining the feasibility of installing a renewable energy system in a building, including an estimate of the effective useful life, the production of renewable energy, and any related avoided greenhouse gas emissions of the proposed renewable energy system.\n\"Residential PACE administrator\" means an entity with which the implementing entity contracts to administer all or part of a residential PACE loan program. For purposes of this subdivision, \"administer\" includes, but is not limited to, the performance of any or all of the following acts, whether directly or through an agent:\n(1) marketing, offering, selling, facilitating, or financing, in whole or in part, a residential PACE loan;\n(2) facilitating, arranging, or contracting for the installation of the cost-effective energy improvements financed through a residential PACE loan; or\n(3) offering any other service to an implementing entity in connection with the offering or provision of a residential PACE loan or operating a residential PACE program.\n\"Residential PACE loan contract\" means the legal agreement for the financing and installation of cost-effective energy improvements under the residential PACE program.\n\"Residential PACE contractor\" means a person or entity that installs cost-effective energy improvements financed, in whole or in part, by a PACE loan.\n\"Residential PACE lien\" means the encumbrance on the qualifying residential real property created by the special assessment as provided in section 216C.437, subdivision 28.\n\"Residential PACE loan\" means the extension of financing that is offered to pay for the installation of cost-effective energy improvements on a homeowner's qualifying residential real property and is repayable by the homeowner through a special assessment as provided under section 216C.437, subdivision 28.\n\"Residential PACE loan program\" means the financing program established under section 216C.437.\n\"Resiliency improvement\" means one or more installations or modifications to eligible commercial real property that are designed to improve a property's resiliency by improving the eligible real property's:\n(1) structural integrity for seismic events;\n(2) indoor air quality;\n(3) durability to resist wind, fire, and flooding;\n(4) ability to withstand an electric power outage;\n(5) stormwater control measures, including structural and nonstructural measures to mitigate stormwater runoff;\n(6) ability to mitigate the impacts of extreme temperatures; or\n(7) ability to mitigate greenhouse gas embodied emissions from the eligible real property.\n\"Resiliency improvement feasibility study\" means a written study, conducted by a contractor trained to perform the analysis, that:\n(1) determines the feasibility of installing a resiliency improvement;\n(2) documents the improved resiliency capabilities of the property; and\n(3) estimates the effective useful life of the proposed resiliency improvements.\n\"Solar photovoltaic\" has the meaning given in section 216C.06, subdivision 16, and must meet the requirements of section 216C.25.\n\"Solar thermal\" has the meaning given to \"qualifying solar thermal project\" in section 216B.2411, subdivision 2, paragraph (e).\n\"Vulnerable adult\" means any person 18 years of age or older who:\n(1) receives services from a home care provider required to be licensed under sections 144A.43 to 144A.482, or from a person or organization that offers, provides, or arranges for personal care assistance services under the medical assistance program as authorized under section 256B.0625, subdivision 19a, 256B.0651, 256B.0653, 256B.0654, 256B.0659, or 256B.85;\n(2) possesses a physical or mental infirmity or other physical, mental, or emotional dysfunction that impairs the individual's ability to provide adequately for the individual's own care without assistance, including the provision of food, shelter, clothing, health care, or supervision;\n(3) possesses a physical or mental infirmity or other physical, mental, or emotional dysfunction that impairs the individual's ability to knowingly contract or otherwise protect the individual's own self-interest; or\n(4) identifies as having dementia or Alzheimer's disease, or who exhibits behaviors that a reasonable person would suspect indicates the adult has Alzheimer's disease or other dementia.\n\"Water improvement\" means one or more installations or modifications to qualifying commercial real property that are designed to improve water efficiency or water quality by:\n(1) reducing water consumption;\n(2) improving the quality, potability, or safety of water for the qualifying property; or\n(3) conserving or remediating water, in whole or in part, on qualifying real property.\n\"Water improvement feasibility study\" means a written study, conducted by a contractor trained to perform the analysis, that:\n(1) determines the appropriate water improvements that could be made to the building; and\n(2) estimates the effective useful life, the reduction of water consumption, and any improvement in water quality resulting from the proposed water improvements.",
	"repealed": false
}