{
	"id": "116.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.99",
	"title": "116.99 SMALL BUSINESS AIR-QUALITY COMPLIANCE ADVISORY COUNCIL.",
	"text": "A Small Business Air-Quality Compliance Assistance Advisory Council is established within the agency.\nThe council has the following duties:\n(1) rendering advisory opinions on the effectiveness of the program, difficulties encountered, and degree and severity of enforcement;\n(2) preparing periodic reports on matters relating to the program as requested by appropriate federal and state agencies;\n(3) reviewing information for sources to ensure the information is complete, comprehensive, and understandable to the lay person; and\n(4) other duties it finds appropriate to comply with applicable federal or state air quality laws and regulations.\nThe council consists of the following members:\n(1) two members appointed by the governor who represent the general public and are not owners or representatives of owners who are small business stationary sources;\n(2) the commissioner or the commissioner's designee, who shall represent the agency;\n(3) four members appointed by the legislature who are owners or representatives of owners of small business stationary sources; and\n(4) the commissioner of employment and economic development or the commissioner's designee.\nThe majority and minority leaders of the house of representatives and the senate shall each appoint one of the members listed in clause (3).\nThe membership terms, compensation, and removal of council members are governed by section 15.0575, except that subdivision 5 does not apply.\nThe council shall select its chair by a majority vote.\nThe council may set its own agenda and work program, consistent with the requirements of the Clean Air Act, after consultation with the commissioner and the small business ombudsman established by this chapter.\nThe commissioner shall allocate and administer the funds reasonably necessary to cover the operational costs of the council.\nThe commissioner shall provide staff services reasonably required by the council.",
	"repealed": false
}