{
	"id": "462.398",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.398",
	"title": "462.398 TERMINATION OF COMMISSION.",
	"text": "Any combination of counties or municipalities representing a majority of the population of the region for which a commission exists may petition the governor by formal resolution stating that the existence of the commission is no longer in the public welfare and interest and is not needed to accomplish the purposes of the Regional Development Act. For purposes of this section the population of a county does not include the population of a municipality within the county. Any formal resolution adopted by the governing body of a county or municipality for the termination of a commission shall be effective for a period of one year for the purpose of determining the requisite population of the region needed to petition the governor.\nWithin 35 days of the filing of the petition, the governor or designee shall fix a time and place within the region for a hearing. The director shall give notice of the hearing by publication once each week for two successive weeks before the date of the hearing in a legal newspaper in each of the counties which the commission represents. The hearing shall be conducted by members of the commission. If the commission determines that the existence of the commission is no longer in the public welfare and interest and that it is not needed to accomplish the purposes of the Regional Development Act, the commission shall recommend to the governor or designee that the governor or designee terminate the commission. Within 60 days after receipt of the recommendation, the governor or designee shall terminate the commission by giving notice of the termination to all government units within the region for which the commission was established. Unless otherwise provided by this subdivision, the hearing shall be in accordance with sections 14.001 to 14.69.\nThe governor or designee shall not accept a petition for termination more than once in 30 months for each regional development commission.",
	"repealed": false
}