{
	"id": "148F.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.165",
	"title": "148F.165 CLIENT WELFARE.",
	"text": "A client has the right to have, and a counselor has the responsibility to provide, a nontechnical explanation of the nature and purpose of the counseling procedures to be used and the results of tests administered to the client. The counselor shall establish procedures to be followed if the explanation is to be provided by another individual under the direction of the counselor.\nThe client bill of rights required by section 144.652 shall be prominently displayed on the premises of the professional practice or provided as a handout to each client. The document must state that consumers of alcohol and drug counseling services have the right to:\n(1) expect that the provider meets the minimum qualifications of training and experience required by state law;\n(2) examine public records maintained by the Board of Behavioral Health and Therapy that contain the credentials of the provider;\n(3) report complaints to the Board of Behavioral Health and Therapy;\n(4) be informed of the cost of professional services before receiving the services;\n(5) privacy as defined and limited by law and rule;\n(6) be free from being the object of unlawful discrimination while receiving counseling services;\n(7) have access to their records as provided in sections 144.92 and 148F.135, subdivision 1, except as otherwise provided by law;\n(8) be free from exploitation for the benefit or advantage of the provider;\n(9) terminate services at any time, except as otherwise provided by law or court order;\n(10) know the intended recipients of assessment results;\n(11) withdraw consent to release assessment results, unless the right is prohibited by law or court order or was waived by prior written agreement;\n(12) a nontechnical description of assessment procedures; and\n(13) a nontechnical explanation and interpretation of assessment results, unless this right is prohibited by law or court order or was waived by prior written agreement.\nThe provider shall treat the client as an individual and not impose on the client any stereotypes of behavior, values, or roles related to human diversity.\nThe provider shall not misuse the relationship with a client due to a relationship with another individual or entity.\nThe provider shall not exploit the professional relationship with a client for the provider's emotional, financial, sexual, or personal advantage or benefit. This prohibition extends to former clients who are vulnerable or dependent on the provider.\nA provider shall not engage in any sexual behavior with a client including:\n(1) sexual contact, as defined in section 604.20, subdivision 7; or\n(2) any physical, verbal, written, interactive, or electronic communication, conduct, or act that may be reasonably interpreted to be sexually seductive, demeaning, or harassing to the client.\nA provider shall not engage in any sexual behavior as described in subdivision 6 within the two-year period following the date of the last counseling service to a former client. This prohibition applies whether or not the provider has formally terminated the professional relationship. This prohibition extends indefinitely for a former client who is vulnerable or dependent on the provider.\nA provider shall disclose to the client the provider's preferences for choice of treatment or outcome and shall present other options for the consideration or choice of the client.\nA provider shall make a prompt and appropriate referral of the client to another professional when requested to make a referral by the client.",
	"repealed": false
}