{
	"id": "326B.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.42",
	"title": "326B.42 DEFINITIONS.",
	"text": "For purposes of sections 326B.41 to 326B.49, the terms defined in this section have the meanings given to them.\n\"Contractor\" means a person who performs or offers to perform any plumbing work, with or without compensation, who is licensed as a contractor by the commissioner. Contractor includes plumbing contractors and restricted plumbing contractors.\nA \"backflow prevention rebuilder\" is an individual who is qualified by training prescribed by the Plumbing Board and possesses a master or journeyworker plumber's license to engage in the testing, maintenance, and rebuilding of reduced pressure zone type backflow prevention assemblies as regulated by the Plumbing Code.\nA \"backflow prevention tester\" is an individual who is qualified by training prescribed by the Plumbing Board to engage in the testing of reduced pressure zone type backflow prevention assemblies as regulated by the Plumbing Code.\n\"Commercial chemical dispensing system\" means a method of dispensing and diluting concentrated chemical solution in a commercial setting.\n\"Commercial dishwashing machine\" means a machine designed for commercial use to clean and sanitize plates, glasses, cups, bowls, utensils, and trays by applying sprays of detergent solution, with or without blasting media granules, and a sanitizing final rinse and the backflow prevention installed complies with ANSI/ASSE 1004 or is certified to National Sanitization Foundation (NSF) 3.\nThe term \"direct supervision,\" with respect to direct supervision of a plumber's apprentice or registered unlicensed individual by a master, restricted master, journeyworker, or restricted journeyworker plumber, means that:\n(1) at all times while the plumber's apprentice or registered unlicensed individual is performing plumbing work, the supervising plumber is present at the location where the plumber's apprentice or registered unlicensed individual is working;\n(2) the supervising plumber is physically present and immediately available to the plumber's apprentice or registered unlicensed individual at all times for assistance and direction;\n(3) any form of electronic supervision does not meet the requirement of physically present;\n(4) the supervising plumber actually reviews the plumbing work performed by the plumber's apprentice or registered unlicensed individual before the plumbing is operated; and\n(5) the supervising plumber is able to and does determine that all plumbing work performed by the plumber's apprentice or registered unlicensed individual is performed in compliance with the plumbing code.\nMS 2007 Supp [Renumbered subd 5]\nA \"journeyworker plumber\" is an individual, other than a master plumber, who, as a principal occupation, is engaged as an employee of, or is otherwise working under the direction of, a master plumber in the practical installation of plumbing.\nMS 2007 Supp [Renumbered subd 7]\nA \"master plumber\" is an individual who is skilled in the planning, superintending, and the practical installation of plumbing, who is otherwise lawfully qualified to contract for plumbing and installations and to conduct the business of plumbing and who is familiar with the laws and rules governing the same.\nThe term \"municipality\" shall have the meaning given to it in section 326B.103, subdivision 9.\nA \"plumber's apprentice\" is any individual who is employed in the practical installation of plumbing under an apprenticeship agreement approved by the department under section 178.07.\n\"Plumbing code\" means Minnesota Rules, chapter 4714.\n\"Plumbing contractor\" means a licensed contractor whose responsible individual is a licensed master plumber.\nA contractor's \"responsible individual\" means the licensed master plumber or licensed restricted master plumber designated in writing by the contractor in the contractor's license application, or in another manner acceptable to the commissioner, as the individual responsible for the contractor's compliance with sections 326B.41 to 326B.49, all rules adopted under these sections and sections 326B.50 to 326B.59, and all orders issued under section 326B.082.\n\"Restricted plumbing contractor\" means a licensed contractor whose responsible individual is a licensed restricted master plumber.",
	"repealed": false
}