{
	"id": "142G.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.30",
	"title": "142G.30 CALCULATING ASSISTANCE PAYMENTS.",
	"text": "A county agency must use prospective budgeting to calculate the assistance payment amount for the first two months for an applicant who has not received assistance in this state for at least one payment month preceding the first month of payment under a current application. Notwithstanding subdivision 3, paragraph (a), clause (2), a county agency must use prospective budgeting for the first two months for a person who applies to be added to an assistance unit. Prospective budgeting is not subject to overpayments or underpayments unless fraud is determined under section 256.98.\n(a) The county agency must apply the income received or anticipated in the first month of MFIP eligibility against the need of the first month. The county agency must apply the income received or anticipated in the second month against the need of the second month.\n(b) When the assistance payment for any part of the first two months is based on anticipated income, the county agency must base the initial assistance payment amount on the information available at the time the initial assistance payment is made.\n(c) The county agency must determine the assistance payment amount for the first two months of MFIP eligibility by budgeting both recurring and nonrecurring income for those two months.\n[See Note.]\nThe county agency must use retrospective budgeting to calculate the monthly assistance payment amount after the payment for the first two months has been made under subdivision 1.\n[See Note.]\nNotwithstanding subdivision 1, the county agency must use retrospective budgeting to calculate the monthly assistance payment amount for the first two months under paragraphs (a) and (b).\n(a) The county agency must use retrospective budgeting to determine the amount of the assistance payment in the first two months of MFIP eligibility:\n(1) when an assistance unit applies for assistance for the same month for which assistance has been interrupted, the interruption in eligibility is less than one payment month, the assistance payment for the preceding month was issued in this state, and the assistance payment for the immediately preceding month was determined retrospectively; or\n(2) when a person applies in order to be added to an assistance unit, that assistance unit has received assistance in this state for at least the two preceding months, and that person has been living with and has been financially responsible for one or more members of that assistance unit for at least the two preceding months.\n(b) Except as provided in clauses (1) to (4), the county agency must use retrospective budgeting and apply income received in the budget month by an assistance unit and by a financially responsible household member who is not included in the assistance unit against the MFIP standard of need or family wage level to determine the assistance payment to be issued for the payment month.\n(1) When a source of income ends prior to the third payment month, that income is not considered in calculating the assistance payment for that month. When a source of income ends prior to the fourth payment month, that income is not considered when determining the assistance payment for that month.\n(2) When a member of an assistance unit or a financially responsible household member leaves the household of the assistance unit, the income of that departed household member is not budgeted retrospectively for any full payment month in which that household member does not live with that household and is not included in the assistance unit.\n(3) When an individual is removed from an assistance unit because the individual is no longer a minor child, the income of that individual is not budgeted retrospectively for payment months in which that individual is not a member of the assistance unit, except that income of an ineligible child in the household must continue to be budgeted retrospectively against the child's needs when the parent or parents of that child request allocation of their income against any unmet needs of that ineligible child.\n(4) When a person ceases to have financial responsibility for one or more members of an assistance unit, the income of that person is not budgeted retrospectively for the payment months which follow the month in which financial responsibility ends.\n[See Note.]\nThe county agency must recalculate the assistance payment when an assistance unit experiences a significant change, as defined in section 142G.02, resulting in a reduction in the gross income received in the payment month from the gross income received in the budget month. The county agency must issue a supplemental assistance payment based on the county agency's best estimate of the assistance unit's income and circumstances for the payment month. Supplemental assistance payments that result from significant changes are limited to two in a 12-month period regardless of the reason for the change. Notwithstanding any other statute or rule of law, supplementary assistance payments shall not be made when the significant change in income is the result of receipt of a lump sum, receipt of an extra paycheck, business fluctuation in self-employment income, or an assistance unit member's participation in a strike or other labor action.\n[See Note.]",
	"repealed": false
}