{
	"id": "609.2244",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2244",
	"title": "609.2244 PRESENTENCE DOMESTIC ABUSE INVESTIGATIONS.",
	"text": "A presentence domestic abuse investigation must be conducted and a report submitted to the court by the corrections agency responsible for conducting the investigation when:\n(1) a defendant is convicted of an offense described in section 518B.01, subdivision 2;\n(2) a defendant is arrested for committing an offense described in section 518B.01, subdivision 2, but is convicted of another offense arising out of the same circumstances surrounding the arrest; or\n(3) a defendant is convicted of a violation against a family or household member of: (a) an order for protection under section 518B.01; (b) a harassment restraining order under section 609.748; (c) section 609.79, subdivision 1; or (d) section 609.713, subdivision 1.\n(a) The Department of Corrections shall establish minimum standards for the report, including the circumstances of the offense, impact on the victim, the defendant's prior record, characteristics and history of alcohol and chemical use problems, and amenability to domestic abuse programs. The report is classified as private data on individuals as defined in section 13.02, subdivision 12. Victim impact statements are confidential.\n(b) The report must include:\n(1) a recommendation on any limitations on contact with the victim and other measures to ensure the victim's safety;\n(2) a recommendation for the defendant to enter and successfully complete domestic abuse programming and any aftercare found necessary by the investigation, including a specific recommendation for the defendant to complete a domestic abuse counseling program or domestic abuse educational program under section 518B.02;\n(3) a recommendation for chemical dependency evaluation and treatment as determined by the evaluation whenever alcohol or drugs were found to be a contributing factor to the offense;\n(4) recommendations for other appropriate remedial action or care or a specific explanation why no level of care or action is recommended; and\n(5) consequences for failure to abide by conditions set up by the court.\nA domestic abuse investigation required by this section must be conducted by the local Corrections Department or the commissioner of corrections. The corrections agent shall have access to any police reports or other law enforcement data relating to the current offense or previous offenses that are necessary to complete the evaluation. A corrections agent conducting an investigation under this section may not have any direct or shared financial interest or referral relationship resulting in shared financial gain with a treatment provider. An appointment for the defendant to undergo the investigation must be made by the court, a court services probation officer, or court administrator as soon as possible.\n[Repealed, 1Sp2001 c 8 art 10 s 20]",
	"repealed": false
}