{
	"id": "198.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/198.33",
	"title": "198.33 PRIVACY OF RESIDENTS; SEARCH AND SEIZURE LIMITED TO CRIMINAL WARRANT.",
	"text": "Residents of the Minnesota veterans homes have the right to a legitimate expectation of privacy in their persons and property against unreasonable searches and seizures. A search of a resident's room or property may be conducted only when necessary to protect the residents from weapons, illegal drugs, or alcohol, if possession is prohibited by the commissioner, and is subject to the following:\n(a) Prior to conducting a search of a resident's room or property, the administrator or the administrator's designee shall provide written authorization to conduct the search. This authorization must identify the resident whose room or property is to be searched, state the nature of the risk to the health or safety of that resident or to other individuals in the home, set forth the facts which establish that the risk exists and the source of those facts, and particularly describe the area to be searched and the property to be seized. A separate authorization must be completed for each resident whose room or property is to be searched.\n(b) The resident shall be informed of the reasons necessitating a search of the room or property and shall be present during the conduct of the search if the resident requests to be present. A copy of the written authorization to conduct the search must be given to the resident.\n(c) If property or other items are taken, a written receipt describing the property or items taken must be given to the resident.\n(d) The provisions of this section do not restrict the entry by employees of the home into a resident's room or into areas where the personal possessions of residents are stored for the purpose of providing care or services to the resident or for housekeeping and maintenance purposes. The provisions of this section do not apply to inspections conducted by governmental agencies for the purpose of assessing compliance with state or federal laws and regulations.\n(e) Unauthorized searches or seizures by employees of the Minnesota veterans homes may be grounds for dismissal.\nThe Minnesota veterans homes may not require a resident to waive protection against unreasonable searches and seizures as a condition of eligibility for admission or continuing residence at a home. A search conducted under a waiver obtained in violation of this section is an unlawful search and seizure and the person aggrieved may move the district court for return of the property under section 626.21.",
	"repealed": false
}