{
	"id": "82B.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.195",
	"title": "82B.195 STANDARDS OF CONDUCT.",
	"text": "In addition to an act compelled or prohibited by this chapter, an appraiser must act according to the standards of professional appraisal practice defined in section 82B.021, subdivision 26.\nIn addition to the requirements of the standards of professional appraisal practice as defined by section 82B.021, subdivision 26, an appraiser must, prior to performing any appraisal service which requires licensing pursuant to this chapter, disclose in writing to the person contracting for the appraisal service the information identified in clause (4). In addition, an appraiser must prepare a written disclosure providing the information identified in clauses (1) to (13). The written disclosure must be included as part of the final written appraisal report. As specified in this subdivision, an appraiser must:\n(1) disclose who has employed the appraiser;\n(2) disclose who the appraisal is rendered for, if not the person who employed the appraiser;\n(3) disclose the purpose of the appraisal, including an explanation of the difference between the appraisal being given and an appraisal of fee simple market valuation;\n(4) disclose any conflict of interest or situation which might reasonably be perceived to be a conflict of interest which must include, but not be limited to, the following situations:\n(i) whether the appraiser has any ownership interest in the subject property or contiguous properties;\n(ii) whether there is an ownership interest by a spouse, parent, or child of the appraiser in the property or contiguous properties; and\n(iii) whether the appraiser has a continuing business relationship with one of the parties, for example, any part-time or full-time employment of the appraiser, spouse, children living at home, or dependent children.\nFailure to promptly give notification of a conflict must be considered a violation of the standards of professional appraisal practice;\n(5) disclose that the appraisal is a reevaluation and identify the areas of difference between the two appraisals and the justification for the changes;\n(6) disclose any facts concerning the valuation needed for loan purposes or similar information that was provided to the appraiser before or during the appraisal;\n(7) disclose that the appraiser has not performed appraisals of the type requested or for the type of property to be appraised as a regular part of the appraiser's business in the preceding five-year period, provided that if the appraiser asserts qualification by training or related experience to perform the appraisal, the appraiser must set forth the training or experience and how it is applicable to the appraisal;\n(8) disclose the license classification of the appraiser and the types of appraisals that the appraiser is authorized to conduct under the licensure;\n(9) disclose any lack of experience or training that would affect the ability of the appraiser to perform the appraisal or could cause rejection of the appraisal by the party requiring the appraisal;\n(10) disclose any appraisal on the same property made by the appraiser in the last three years;\n(11) disclose all pertinent assumptions upon which a valuation based upon income from the property is derived such as expected occupancy rates, rental rates, construction of future improvements, roads, or highways; and\n(12) disclose any other fact or circumstance that could bring the reliability of the appraisal or the impartiality of the appraiser into question.\nIn addition to the requirements of subdivisions 1 and 2, an appraiser must:\n(1) not knowingly make any of the following unacceptable appraisal practices:\n(i) include inaccurate or misleading factual data about the subject neighborhood, site, improvements, or comparable sales;\n(ii) fail to comment on negative factors with respect to the subject neighborhood, subject property, or proximity of the subject property to adverse influences;\n(iii) unless otherwise disclosed in the appraisal report, use comparables in the valuation process that the appraiser has not at least personally inspected from the exterior by driving by them;\n(iv) select and use inappropriate comparable sales or fail to use comparables that are physically and by location the most similar to the subject property;\n(v) use data, particularly comparable sales data, that was provided by parties who have a financial interest in the sale or financing of the subject property without the appraiser's verification of the information from a disinterested source. For example, it would be inappropriate for an appraiser to use comparable sales provided by the builder of the subject property or a real estate broker who is handling the sale of the subject property, unless the appraiser verifies the accuracy of the data provided through another source. If a signed HUD Settlement Statement is used for this verification, the appraiser must also verify the sale data with the buyer or county records. The appraiser must also make an independent investigation to determine that the comparable sales provided were the best ones available;\n(vi) use adjustments to the comparable sales that do not reflect the market's reaction to the differences between the subject property and the comparables, or fail to make adjustments when they are clearly indicated;\n(vii) develop a valuation conclusion that is based either partially or completely on factors identified in chapter 363A, including race, color, creed, religion, sex, gender identity, marital status, status with regard to public assistance, disability, sexual orientation, familial status of the owner or occupants of nearby property, or national origin of either the prospective owners or occupants of the properties in the vicinity of the subject property; or\n(viii) develop a valuation conclusion that is not supported by available market data;\n(2) provide a resume, current within six months of the date it is provided, to anyone who employs the appraiser, indicating all professional degrees and licenses held by the appraiser; and\n(3) reject any request by the person who has employed the appraiser that is in conflict with the requirements of Minnesota law or this chapter and withdraw from the appraisal assignment if the employing party persists in the request.\nFailure to comply with the provisions of this section is a prohibited practice under section 82B.20, subdivision 2, clause (17).\nWhen providing an evaluation, a licensed real estate appraiser is not required to comply with the Uniform Standards of Professional Appraisal Practice.",
	"repealed": false
}