{
	"id": "518.003",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.003",
	"title": "518.003 DEFINITIONS.",
	"text": "For the purposes of this chapter and chapter 518A, the following terms have the meanings provided in this section unless the context clearly requires otherwise.\n[Renumbered subd 9]\nUnless otherwise agreed by the parties:\n(a) \"Legal custody\" means the right to determine the child's upbringing, including education, health care, and religious training.\n(b) \"Joint legal custody\" means that both parents have equal rights and responsibilities, including the right to participate in major decisions determining the child's upbringing, including education, health care, and religious training.\n(c) \"Physical custody and residence\" means the routine daily care and control and the residence of the child.\n(d) \"Joint physical custody\" means that the routine daily care and control and the residence of the child is structured between the parties.\n(e) Wherever used in this chapter, the term \"custodial parent\" or \"custodian\" means the person who has the physical custody of the child at any particular time.\n(f) \"Custody determination\" means a court decision and court orders and instructions providing for the custody of a child, including parenting time, but does not include a decision relating to child support or any other monetary obligation of any person.\n(g) \"Custody proceeding\" includes proceedings in which a custody determination is one of several issues, such as an action for dissolution, divorce, or separation, and includes proceedings involving children who are in need of protection or services, domestic abuse, and paternity.\n\"Maintenance\" means an award made in a dissolution or legal separation proceeding of payments from the future income or earnings of one spouse for the support and maintenance of the other.\n\"Marital property\" means property, real or personal, including vested public or private pension plan benefits or rights, acquired by the parties, or either of them, to a dissolution, legal separation, or annulment proceeding at any time during the existence of the marriage relation between them, or at any time during which the parties were living together as spouses under a purported marriage relationship which is annulled in an annulment proceeding, but prior to the date of valuation under section 518.58, subdivision 1. All property acquired by either spouse subsequent to the marriage and before the valuation date is presumed to be marital property regardless of whether title is held individually or by the spouses in a form of co-ownership such as joint tenancy, tenancy in common, tenancy by the entirety, or community property. Each spouse shall be deemed to have a common ownership in marital property that vests not later than the time of the entry of the decree in a proceeding for dissolution or annulment. The extent of the vested interest shall be determined and made final by the court pursuant to section 518.58. If a title interest in real property is held individually by only one spouse, the interest in the real property of the nontitled spouse is not subject to claims of creditors or judgment or tax liens until the time of entry of the decree awarding an interest to the nontitled spouse. The presumption of marital property is overcome by a showing that the property is nonmarital property.\n\"Nonmarital property\" means property real or personal, acquired by either spouse before, during, or after the existence of their marriage, which\n(a) is acquired as a gift, bequest, devise or inheritance made by a third party to one but not to the other spouse;\n(b) is acquired before the marriage;\n(c) is acquired in exchange for or is the increase in value of property which is described in clauses (a), (b), (d), and (e);\n(d) is acquired by a spouse after the valuation date; or\n(e) is excluded by a valid antenuptial contract.\n\"Mediation\" means a process in which an impartial third party facilitates an agreement between two or more parties in a proceeding.\n\"Parenting time\" means the time a parent spends with a child regardless of the custodial designation regarding the child.\n\"Pension plan benefits or rights\" means a benefit or right from a public or private pension plan accrued to the end of the month in which marital assets are valued, as determined under the terms of the laws or other plan document provisions governing the plan, including section 356.30.\n\"Private pension plan\" means a plan, fund, or program maintained by an employer or employee organization that provides retirement income to employees or results in a deferral of income by employees for a period extending to the termination of covered employment or beyond.\n\"Public pension plan\" means a pension plan or fund specified in section 356.20, subdivision 2, or 356.30, subdivision 3, the deferred compensation plan specified in section 352.965, or any retirement or pension plan or fund, including a supplemental retirement plan or fund, established, maintained, or supported by a governmental subdivision or public body whose revenues are derived from taxation, fees, assessments, or from other public sources.\n\"Residence\" means the place where a party has established a permanent home from which the party has no present intention of moving.",
	"repealed": false
}