{
	"id": "50.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/50.085",
	"title": "50.085 POWERS.",
	"text": "Every savings bank incorporated pursuant to or operating under this chapter shall be a body corporate; shall have all the powers enumerated, authorized, and permitted by this chapter and other applicable law; shall have other rights, privileges, and powers as may be incidental to or reasonably necessary or appropriate for the accomplishment of the objects and purposes of the savings bank; and shall have those powers possessed by corporations organized under chapter 302A.\nA savings bank may borrow money and issue its obligations for the borrowed money, including, but not limited to, obligations, bonds, notes, or other debt securities, except as otherwise provided by this chapter or by rules of the commissioner of commerce. An obligation, bond, note, or other debt security may include a written provision subordinating the debt to claims of other creditors or of depositors. Borrowings may be secured by property of the savings bank.\nA savings bank may become a member of, purchase stock or securities in, deposit money with, deal with, make reasonable payments or contributions to, or comply with any other conditions of membership or credit from any corporation or agency of the United States or of this state, or of any other organization to the extent the corporation, agency, or organization assists in furthering or facilitating the saving bank's purposes, powers, or community responsibilities.\nA savings bank may make, sell, purchase, invest in, and participate or otherwise deal in loans and installment sale contracts and other forms of indebtedness, and take any manner of security for the loans and contracts. A savings bank may also acquire and lease or participate in the acquisition and leasing of personal property.\nA savings bank may acquire deposits in the form of demand accounts, checking accounts, negotiable order of withdrawal accounts, savings accounts, time deposits, money market deposit accounts, treasury tax and loan accounts, and other types of deposits, and pay interest or dividends on those accounts, except that interest or dividends must not be paid on demand deposit accounts. No capital stock savings bank shall accept deposits in a sum exceeding 30 times the amount of its capital stock and its actual surplus.\nA savings bank may obtain and maintain insurance of its deposit accounts by the Federal Deposit Insurance Corporation or any other federal agency established for the purpose of insuring deposit accounts in savings banks.\nA savings bank may maintain and let safes, boxes, or other receptacles for the safekeeping of personal property upon agreed-upon terms and conditions. This subdivision does not supersede any inconsistent provision of statute.\nA savings bank may issue drafts and similar instruments drawn on the savings bank to aid in effecting withdrawals and for other purposes of the savings bank; accept for payment at a future date drafts drawn upon it by its customers; and issue, advise, or confirm letters of credit authorizing holders to draw drafts upon it or its correspondents.\nA savings bank may act as fiscal agent of the United States, and, when so designated by the Secretary of Treasury, perform, under regulations the secretary prescribes, all reasonable duties as fiscal agent of the United States as the secretary may require; and act as agent for any instrumentality of the United States and as agent of this state and any instrumentality of it.\nA savings bank may service loans and investments for others.\n(a) A savings bank located and doing business in any place where the population does not exceed 5,000 inhabitants as shown by the last preceding decennial census may, directly or through a subsidiary, subject to any rules adopted by the commissioner, act as an agent for any property-casualty, life, or other insurance company authorized by the commissioner to do business in this state. Except as provided in paragraph (c), a savings bank may not directly or through a subsidiary act as an agent for any property-casualty, life, or other insurance company in any place where the population exceeds 5,000 inhabitants as shown by the last preceding decennial census.\n(b) To the extent allowed under paragraphs (a) and (c), a savings bank or its subsidiary may solicit or sell insurance and collect premiums on policies issued by the insurance company and may receive for these services the fees and commissions agreed upon between the savings bank and the insurance company.\n(c) A savings bank may, directly or through a subsidiary, act as an agent for any property-casualty, life, or other insurance company in a place where the population exceeds 5,000 inhabitants as shown by the last preceding decennial census, if:\n(1) the savings bank is a direct or indirect subsidiary of a state or federal savings association or of a state or federal savings association holding company that, prior to August 1, 1995, had a license from the commissioner to solicit or sell insurance of the type in question, or directly or indirectly controlled a subsidiary that held such a license; or\n(2) the savings bank is a successor to a state or federal savings association as a result of merger, charter conversion, or otherwise, which association, prior to August 1, 1995, held a license from the commissioner to solicit or sell insurance of the type in question, or directly or indirectly controlled a subsidiary that held such a license.\nA savings bank may act as trustee or custodian of a self-employed retirement plan under the federal Self-Employed Individuals Tax Retirement Act of 1962, as amended, and of an individual retirement account under the federal Employee Retirement Income Security Act of 1974, as amended, to the same extent permitted for state banks under section 48.15. All funds held in a fiduciary capacity by the savings bank under the authority of this subdivision may be commingled and consolidated for appropriate purposes of investment if records reflecting each separate beneficial interest are maintained by the fiduciary unless the responsibility is lawfully assumed by another appropriate party.\nA savings bank may engage in an escrow business.\nUpon application to and approval by the commissioner of commerce, a savings bank may act as trustee, executor, administrator, personal representative, conservator, custodian, guardian, or in any other fiduciary capacity in which state banks, trust companies, or other corporations are permitted to act, and receive reasonable compensation for it. A savings bank that has qualified and obtained a certificate, as provided in section 48.37, may use in its corporate name or title, in addition to the words \"savings bank\" or other words permitted by law, the words \"trust\" or \"trust company,\" and may display and make use of signs, symbols, tokens, letterheads, cards, circulars, and advertising stating or indicating that it is authorized to transact the business authorized by those sections, and a savings bank using the words \"trust\" or \"trust company\" is not required to use the word \"state\" in its corporate name. A savings bank may not invest, pursuant to section 50.1465, in a corporation that engages in activities described in this subdivision, without first obtaining the approval of the commissioner of commerce.\nIn addition to the authority conferred in subdivision 2, a savings bank may pledge, hypothecate, assign or transfer, or create a lien upon or charge against its assets to secure: (1) public funds, including money or deposits of the United States or any instrumentality of it and of this state or any instrumentality of it; (2) money or deposits of a trustee in bankruptcy; (3) money borrowed in good faith from other banks, trust companies, financial institutions, or any financial agency created by act of Congress; (4) the acquisition of real estate to be carried as an asset as provided in section 47.10; (5) a liability that arises from a transfer of a direct obligation of, or obligations that are fully guaranteed as to principal and interest by, the United States government or an agency of it that the savings bank is obligated to repurchase; (6) money and deposits held in escrow; (7) money and deposits if acting as a corporate fiduciary; and (8) treasury tax and loan accounts as provided in section 50.171.\nA savings bank may provide data processing services to others and act as a custodian of records for others on a for-profit basis and utilize data processing services and place records of the savings bank for storage and safekeeping with another person for a fee.\nA savings bank may directly or indirectly acquire, place, and operate, or participate in the acquisition, placement, and operation of, electronic financial terminals and transmission facilities, in accordance with the requirements of sections 47.61 to 47.74.\nA savings bank may exercise the powers that are specifically enumerated by law for banks authorized to do business under chapter 48.\n(a) In addition to other investments authorized by law and the powers conferred by this chapter, and subject to the regulation of the commissioner of commerce, a savings bank may, directly or through a subsidiary, undertake any activities, exercise any powers, or make any investments that any state bank or national bank located or doing business in this state may undertake, exercise, or make as of August 1, 1995.\n(b) The commissioner may authorize a savings bank to undertake any activities, exercise any powers, or make any investments that become authorized activities, powers, or investments after August 1, 1995, for any state bank or national bank located or doing business in this state.\n(c) Subject to rules adopted by the commissioner, and subject to the investment limits in section 50.1465, a subsidiary of a savings bank may undertake any activities, exercise any powers, or make any investments not authorized for any state bank or national bank but authorized as of August 1, 1995, for any state bank or national bank subsidiary located and doing business in this state.\n(d) The commissioner may authorize a subsidiary of a savings bank to undertake any activities, exercise any powers, or make any investments that become authorized activities, powers, or investments after August 1, 1995, for any state bank or national bank subsidiary located and doing business in this state.\n(e) The commissioner at any time may limit any activity, power, or investment for any savings bank or savings bank subsidiary under this subdivision or section 50.1465, subdivision 1, clauses (2) and (3), for supervisory, legal, or safety and soundness reasons. A savings bank aggrieved by an action of the commissioner under this subdivision may appeal the action, and the proceedings shall be conducted pursuant to sections 14.63 to 14.69.",
	"repealed": false
}