{
	"id": "256.043",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.043",
	"title": "256.043 OPIATE EPIDEMIC RESPONSE FUND.",
	"text": "(a) The opiate epidemic response fund is established in the state treasury. The commissioner of management and budget shall establish within the opiate epidemic response fund two accounts: (1) a registration and license fee account; and (2) a settlement account. Beginning in fiscal year 2021, for each fiscal year, the fund shall be administered according to this section.\n(b) The commissioner of management and budget shall deposit into the registration and license fee account the registration fee assessed by the Board of Pharmacy under section 151.066 and the license fees identified in section 151.065, subdivision 7, paragraphs (b) and (c).\n(c) The commissioner of management and budget shall deposit into the settlement account any money received by the state resulting from a settlement agreement or an assurance of discontinuance entered into by the attorney general of the state, or a court order in litigation brought by the attorney general of the state, on behalf of the state or a state agency, related to alleged violations of consumer fraud laws in the marketing, sale, or distribution of opioids in this state or other alleged illegal actions that contributed to the excessive use of opioids, pursuant to section 16A.151, subdivision 2, paragraph (f).\n[Repealed by amendment, 2020 c 115 art 3 s 15]\n(a) The appropriations in paragraphs (b) to (n) shall be made from the registration and license fee account on a fiscal year basis in the order specified.\n(b) The appropriations specified in Laws 2019, chapter 63, article 3, section 1, paragraphs (b), (f), (g), and (h), as amended by Laws 2020, chapter 115, article 3, section 35, shall be made accordingly.\n(c) $100,000 is appropriated to the commissioner of human services for grants for opiate antagonist distribution. Grantees may utilize funds for opioid overdose prevention, community asset mapping, education, and opiate antagonist distribution.\n(d) $2,000,000 is appropriated to the commissioner of human services for grants to Tribal nations and five urban Indian communities for traditional healing practices for American Indians and to increase the capacity of culturally specific providers in the behavioral health workforce.\n(e) $400,000 is appropriated to the commissioner of human services for competitive grants for opioid-focused Project ECHO programs.\n(f) $277,000 in fiscal year 2024 and $321,000 each year thereafter is appropriated to the commissioner of human services to administer the funding distribution and reporting requirements in paragraph (o).\n(g) $3,000,000 in fiscal year 2025 and $3,000,000 each year thereafter is appropriated to the commissioner of human services for safe recovery sites start-up and capacity building grants under section 254B.18.\n(h) $395,000 in fiscal year 2024 and $415,000 each year thereafter is appropriated to the commissioner of human services for the opioid overdose surge alert system under section 245.891.\n(i) $300,000 is appropriated to the commissioner of management and budget for evaluation activities under section 256.042, subdivision 1, paragraph (c).\n(j) $261,000 is appropriated to the commissioner of human services for the provision of administrative services to the Opiate Epidemic Response Advisory Council and for the administration of the grants awarded under paragraph (n).\n(k) $126,000 is appropriated to the Board of Pharmacy for the collection of the registration fees under section 151.066.\n(l) $672,000 is appropriated to the commissioner of public safety for the Bureau of Criminal Apprehension. Of this amount, $384,000 is for drug scientists and lab supplies and $288,000 is for special agent positions focused on drug interdiction and drug trafficking.\n(m) After the appropriations in paragraphs (b) to (l) are made, 50 percent of the remaining amount is appropriated to the commissioner of children, youth, and families for distribution to county social service agencies and Tribal social service agency initiative projects authorized under section 256.01, subdivision 14b, to provide prevention and child protection services to children and families who are affected by addiction. The commissioner shall distribute this money proportionally to county social service agencies and Tribal social service agency initiative projects through a formula based on intake data from the previous three calendar years related to substance use and out-of-home placement episodes where parental drug abuse is a reason for the out-of-home placement. County social service agencies and Tribal social service agency initiative projects receiving funds from the opiate epidemic response fund must annually report to the commissioner on how the funds were used to provide prevention and child protection services, including measurable outcomes, as determined by the commissioner. County social service agencies and Tribal social service agency initiative projects must not use funds received under this paragraph to supplant current state or local funding received for child protection services for children and families who are affected by addiction.\n(n) After the appropriations in paragraphs (b) to (m) are made, the remaining amount in the account is appropriated to the commissioner of human services to award grants as specified by the Opiate Epidemic Response Advisory Council in accordance with section 256.042, unless otherwise appropriated by the legislature.\n(o) Beginning in fiscal year 2022 and each year thereafter, funds for county social service agencies and Tribal social service agency initiative projects under paragraph (m) and grant funds specified by the Opiate Epidemic Response Advisory Council under paragraph (n) may be distributed on a calendar year basis.\n(p) Notwithstanding section 16A.28, subdivision 3, funds appropriated in paragraphs (c), (d), (e), (g), (m), and (n) are available for three years after the funds are appropriated.\n(a) The appropriations in paragraphs (b) to (e) shall be made from the settlement account on a fiscal year basis in the order specified.\n(b) If the balance in the registration and license fee account is not sufficient to fully fund the appropriations specified in subdivision 3, paragraphs (b) to (l), an amount necessary to meet any insufficiency shall be transferred from the settlement account to the registration and license fee account to fully fund the required appropriations.\n(c) $209,000 in fiscal year 2023 and $239,000 in fiscal year 2024 and subsequent fiscal years are appropriated to the commissioner of human services for the administration of grants awarded under paragraph (e). $276,000 in fiscal year 2023 and $151,000 in fiscal year 2024 and subsequent fiscal years are appropriated to the commissioner of human services to collect, collate, and report data submitted and to monitor compliance with reporting and settlement expenditure requirements by grantees awarded grants under this section and municipalities receiving direct payments from a statewide opioid settlement agreement as defined in section 256.042, subdivision 6.\n(d) After any appropriations necessary under paragraphs (b) and (c) are made, an amount equal to the calendar year allocation to Tribal social service agency initiative projects under subdivision 3, paragraph (m), is appropriated from the settlement account to the commissioner of children, youth, and families for distribution to Tribal social service agency initiative projects to provide child protection services to children and families who are affected by addiction. The requirements related to proportional distribution, annual reporting, and maintenance of effort specified in subdivision 3, paragraph (m), also apply to the appropriations made under this paragraph.\n(e) After making the appropriations in paragraphs (b), (c), and (d), the remaining amount in the account is appropriated to the commissioner of human services to award grants as specified by the Opiate Epidemic Response Advisory Council in accordance with section 256.042.\n(f) Funds for Tribal social service agency initiative projects under paragraph (d) and grant funds specified by the Opiate Epidemic Response Advisory Council under paragraph (e) may be distributed on a calendar year basis.\n(g) Notwithstanding section 16A.28, subdivision 3, funds appropriated in paragraphs (d) and (e) are available for three years after the funds are appropriated.\nMS 2022 [Repealed, 2024 c 125 art 3 s 20; 2024 c 127 art 48 s 20]",
	"repealed": false
}