{
	"id": "299F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.04",
	"title": "299F.04 ORIGIN OF FIRE INVESTIGATED; COMPUTERIZED ARSON DATA.",
	"text": "The chief of the fire department of each city in which a fire department is established, and the mayor of each city in which no fire department exists, and the president of the statutory city board of each statutory city in which no fire department exists, and the town clerk of each town without the limits of any city or statutory city, shall investigate, or cause to be investigated, the cause, origin, and circumstances of each fire occurring in the city, statutory city or town by which property has been destroyed or damaged when the damage exceeds $100, except that all fires of unknown origin shall be reported, and shall especially make investigation as to whether the fire was the result of carelessness, accident, or design.\nThe investigation shall be begun within two days of the occurrence of the fire and the state fire marshal shall have the right to coordinate the investigation on deeming it necessary.\nThe officer making investigation of fires occurring in cities, statutory cities and towns shall forthwith notify the state fire marshal and shall, within one week of the occurrence of the fire, furnish to the state fire marshal a written statement of all the facts relating to the cause and origin of the fire and such further information as may be called for by the blanks furnished by the state fire marshal. The state fire marshal shall keep a record of all fires occurring in the state, together with all facts, statistics, and circumstances, including the origin of the fires, which may be determined by the investigation provided by this chapter. These statistics shall be at all times open to public inspection.\n[Repealed, 2014 c 212 art 3 s 1]\nThe state fire marshal may conduct further investigation necessary to establish reasonable grounds to believe that a violation of Minnesota Statutes 1976, sections 609.561 to 609.576, has occurred.\n(a) As used in this subdivision, \"chief officer\" means the city fire marshal or chief officer of a law enforcement agency's arson investigation unit in a city of the first class.\n(b) The officer making investigation of a fire resulting in a human death shall immediately notify either the state fire marshal or a chief officer. The state fire marshal or chief officer may conduct an investigation to establish the origin and cause regarding the circumstance of the death. If the chief officer undertakes the investigation, the officer shall promptly notify the state fire marshal of the investigation and, after the investigation is completed, shall forward a copy of the investigative report to the state fire marshal. Unless the investigating officer does so, the state fire marshal or chief officer shall immediately notify the appropriate coroner or medical examiner of a human death occurring as a result of a fire. The coroner or medical examiner shall perform an autopsy in the case of a human death as provided in section 390.11, subdivision 2a, or 390.32, subdivision 2a, as appropriate.",
	"repealed": false
}