{
	"id": "16A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.14",
	"title": "16A.14 ALLOTMENT AND ENCUMBRANCE SYSTEM.",
	"text": "The commissioner may set an allotment period shorter than and not extending beyond the fiscal year.\nSubdivision 1 does not apply for allotments of appropriations for permanent improvements, including acquisition of real property.\nThe allotment and encumbrance system applies to all appropriations and funds except as provided in subdivisions 2a, 2b, and 2c.\nThe allotment and encumbrance system does not apply to:\n(1) appropriations for the courts or the legislature;\n(2) payment of unemployment benefits; and\n(3) transactions within the defined contribution funds administered by the Minnesota State Retirement System.\nWith permanent improvement contracts and transactions for the acquisition of real estate, equipment, repair, rehabilitation, appurtenances or utility systems to be used for public purposes, the commissioner may do away with periodic allotments as impractical and make rules to ensure the proper application and encumbering of funds.\nContingent appropriations for the governor and the attorney general are not subject to allotment. They are subject to the prescriptions in this chapter relating to spending and encumbering of funds.\nAn appropriation to an agency may not be made available for spending in the next allotment period until the agency has met all the requirements related to the policies and procedures of the Minnesota accounting and procurement system. A spending plan shall be submitted by July 31 to the commissioner on the commissioner's form. The spending plan must certify that: the amount required for each activity is accurate and is consistent with legislative intent; revenue estimates are reasonable; and the plan is structurally balanced, with all legal restrictions on spending having been met for the purpose for which money is to be spent.\nThe commissioner shall approve the estimated amount for expenditure if the spending plan is within the amount and purpose of the appropriation. In doing so, the commissioner must keep in mind the probable needs of the agency for the rest of the term of the appropriation, and whether there is a need for the appropriation in the next allotment period. Otherwise the commissioner shall modify the spending plan and the allotment to conform with the appropriation and the future needs of the agency. The commissioner shall act promptly on a spending plan. The commissioner shall notify an agency of its allotments at least five days before an allotment period. Allotments to an agency for an appropriation term may not exceed the amount appropriated for that term.\nAfter approval, the commissioner may modify a spending plan for cause. An agency may apply for and must be notified of the modification. The modification may not result in a deficit or an undue reduction of funds to meet future agency needs.",
	"repealed": false
}