{
	"id": "325F.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.28",
	"title": "325F.28 MATERIAL MUST BE RENOVATED.",
	"text": "No person shall remake or renovate any article of bedding unless all the material to be used in such remade or renovated bedding shall first be thoroughly sterilized and disinfected by the methods set out herein, or by any other approved sterilization method:\n(1) Dry heat of a temperature of not less than 160 degrees centigrade temperature for not less than one hour. (A thermometer for registering the temperature visible from the outside of the room shall be provided where dry heat is used);\n(2) Live steam, with subsequent drying of the material over steam coils with a pressure of not less than 20 pounds of steam for 20 minutes. (A gauge for registering steam pressure visible from the outside of the room shall be provided where steam under pressure is used and valved outlets shall be provided near the bottom and also the top of the room in cases where streaming steam is used);\n(3) Formaldehyde and sulphur concurrently in a moist atmosphere for a period of not less than ten hours. Formaldehyde gas shall be generated from the use of one pint of formaldehyde solution, 37 percent to each 1,000 cubic feet of air space, or through the use of any of the high class commercial fumigators which generate an equivalent quantity of gas. Sulphur shall be from the burning of three pounds of sulphur for each 1,000 cubic feet of air space. The moist atmosphere shall be produced by thorough sprinkling of the floor of the room with warm water just prior to the process of disinfection.\nThe room shall be provided with a separate air inlet and also an exhaust connection, and shall be equipped with tight dampers or closure gates which can be operated from the outside of the room. Rooms for disinfection of bedding materials shall be made gas or steam tight. Shelving for loose bedding materials shall be of lattice or other open construction.\nSolid shelves of a type to prevent passage of gas through the materials shall not be permitted.",
	"repealed": false
}