{
	"id": "84.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.86",
	"title": "84.86 RULES; ACCIDENT REPORTS.",
	"text": "(a) With a view of achieving maximum use of snowmobiles consistent with protection of the environment the commissioner of natural resources shall adopt rules in the manner provided by chapter 14, for the following purposes:\n(1) registration of snowmobiles;\n(2) use of snowmobiles insofar as game and fish resources are affected;\n(3) use of snowmobiles on public lands and waters, or on grant-in-aid trails;\n(4) uniform signs to be used by the state, counties, and cities, which are necessary or desirable to control, direct, or regulate the operation and use of snowmobiles;\n(5) specifications relating to snowmobile mufflers; and\n(6) a comprehensive snowmobile information and safety education and training program that includes but is not limited to preparing and disseminating snowmobile information and safety advice to the public, training snowmobile operators, and issuing snowmobile safety certificates to snowmobile operators who successfully complete the snowmobile safety education and training course.\n(b) For the purpose of administering the program under paragraph (a), clause (6), and to defray expenses of training and certifying snowmobile operators, the commissioner shall collect a fee from each person who receives the youth or adult training. The commissioner shall collect a fee, to include a $1 issuing fee for licensing agents, for issuing a duplicate snowmobile safety certificate. The commissioner shall establish both fees in a manner that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the services. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. The fees may be established by the commissioner notwithstanding section 16A.1283. The fees, except for the issuing fee for licensing agents under this subdivision, shall be deposited in the snowmobile trails and enforcement account in the natural resources fund and the amount thereof, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, and issuing fees collected by the commissioner, is appropriated annually to the Enforcement Division of the Department of Natural Resources for administering the programs. In addition to the fee established by the commissioner, instructors may charge each person any fee paid by the instructor for the person's online training course and up to the established fee amount for class materials and expenses. The commissioner shall cooperate with private organizations and associations, private and public corporations, and local governmental units in furtherance of the program established under paragraph (a), clause (6). School districts may cooperate with the commissioner and volunteer instructors to provide space for the classroom portion of the training. The commissioner shall consult with the commissioner of public safety in regard to training program subject matter and performance testing that leads to the certification of snowmobile operators.\n(c) The operator of any snowmobile involved in an accident resulting in injury requiring medical attention or hospitalization to or death of any person or total damage to an extent of $500 or more, shall forward a written report of the accident to the commissioner on a form prescribed by the commissioner. If the operator is killed or is unable to file a report due to incapacitation, any peace officer investigating the accident shall file the accident report within ten business days.\nThe commissioner of public safety may adopt rules not inconsistent herewith in the manner provided by chapter 14, regulating the use of snowmobiles on streets and highways.",
	"repealed": false
}