{
	"id": "403.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.025",
	"title": "403.025 911 EMERGENCY TELECOMMUNICATIONS SYSTEM REQUIRED.",
	"text": "Each county shall operate and maintain a 911 emergency telecommunications system.\nThe digits 911, so designated by the Federal Communications Commission, must be the primary emergency telephone number within the system. A public safety agency may maintain a separate secondary backup number for emergency calls and shall maintain a separate number for nonemergency telephone calls.\nThe 911 systems may be multijurisdictional and regional in character provided that design and implementation are preceded by cooperative planning on a county-by-county basis with local public safety agencies.\nEvery owner and operator of a wire-line or wireless circuit switched or packet-based telecommunications system connected to the public switched telephone network shall design and maintain the system to dial the 911 number without charge to the caller.\nEvery owner and operator of a wireless telecommunications system shall design and maintain the system to dial the 911 number without charge to the caller.\nEvery pay phone owner and operator shall permit dialing of the 911 number without coin and without charge to the caller.\nEvery owner and operator of a multistation or private branch exchange (PBX) multiline telephone system shall design and maintain the system to dial the 911 number without charge to the caller.\n(a) The state shall contract with the county or other governmental agencies operating public safety answering points and with the appropriate wire-line telecommunications service providers or other entities determined by the commissioner to be capable of providing effective and efficient components of the 911 system for the operation, maintenance, enhancement, and expansion of the 911 system.\n(b) The contract language or subsequent amendments to the contract must include a description of the services to be furnished to the county or other governmental agencies operating public safety answering points. The contract language or subsequent amendments must include the terms of compensation based on the effective tariff or price list filed with the Public Utilities Commission or the prices agreed to by the parties.\n(c) The contract language or subsequent amendments to contracts between the parties must contain a provision for resolving disputes.",
	"repealed": false
}