{
	"id": "11A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.16",
	"title": "11A.16 PERMANENT SCHOOL FUND.",
	"text": "Pursuant to article XI, section 8, of the Constitution of the state of Minnesota, there is hereby established a permanent school fund which shall be a continuation of the permanent school fund in existence on January 1, 1980.\nThe permanent school fund shall consist of the proceeds derived from the school lands, the swamp lands and the internal improvement lands granted to the state and all cash and investments credited to the permanent school fund, to the swamp land fund and to the internal improvement land fund.\nThe permanent school fund shall be managed by the commissioner of management and budget.\nThe permanent school fund shall be invested by the state board subject to the provisions of section 11A.24.\nAs of the end of each fiscal year, the state board shall calculate the investment income earned by the permanent school fund. The investment income earned by the fund shall equal the amount of interest on debt securities, dividends on equity securities, and interest earned on certified monthly earnings prior to the transfer to the Department of Education. Gains and losses arising from the sale of securities shall be apportioned as follows:\n(a) If the sale of securities results in a net gain during a fiscal year, the gain shall be apportioned in equal installments over the next ten fiscal years to offset net losses in those years. If any portion of an installment is not needed to recover subsequent losses identified in paragraph (b) it shall be added to the principal of the fund.\n(b) If the sale of securities results in a net loss during a fiscal year, the net loss shall be recovered first from the gains in paragraph (a) apportioned to that fiscal year. If these gains are insufficient, any remaining net loss shall be recovered from interest and dividend income in equal installments over the following ten fiscal years.\nNotwithstanding provisions of section 11A.12, the income of the permanent school fund as calculated pursuant to subdivision 5, shall be credited to the permanent school fund, and transferred to the school endowment fund as needed for payments made pursuant to section 127A.32.",
	"repealed": false
}