{
	"id": "473.763",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.763",
	"title": "473.763 COMMUNITY OWNERSHIP.",
	"text": "The legislature determines that:\n(1) a professional baseball franchise is an important asset to the state of Minnesota and ensuring that a franchise remains in Minnesota is an important public purpose;\n(2) providing broad-based local ownership of a Major League Baseball franchise develops trust among fans, taxpayers, and the team, and helps ensure this important asset will remain in the state;\n(3) providing community ownership of a professional baseball franchise ensures that the financial benefits of any increased value of the franchise will accrue to those members of the community who own the franchise; and\n(4) enacting legislation providing for community ownership indicates to Major League Baseball continuing support for professional baseball in Minnesota.\nSubject to the rules of Major League Baseball, the governor and the Metropolitan Sports Facilities Commission must attempt to facilitate the formation of a corporation to acquire the baseball franchise and to identify an individual private managing owner of the corporation. The corporation formed to acquire the franchise shall have a capital structure in compliance with all of the following provisions:\n(1) there may be two classes of capital stock: common stock and preferred stock. Both classes of stock must give holders voting rights with respect to any relocation or voluntary contraction of the franchise;\n(2) the private managing owner must own no less than 25 percent and no more than 35 percent of the common stock. For purposes of this restriction, shares of common stock owned by the private managing owner include shares of common stock owned by any related taxpayer as defined in section 1313(c) of the Internal Revenue Code of 1986, as amended. Other than the rights of all other holders of common stock and preferred stock with respect to relocation or voluntary contraction of the franchise, the private managing owner must control all aspects of the operation of the corporation;\n(3) other than the private managing owner, no individual or entity may own more than five percent of the common stock of the corporation;\n(4) at least 50 percent of the ownership of the common stock must be sold to members of the general public in a general solicitation and a person or entity must not own more than one percent of common stock of the corporation; and\n(5) the articles of incorporation, bylaws, and other governing documents must provide that the franchise may not move outside of the state or agree to voluntary contraction without approval of at least 75 percent of the shares of common stock and at least 75 percent of the shares of preferred stock. Notwithstanding any law to the contrary, these 75 percent approval requirements shall not be amended by the shareholders or by any other means.\nExcept as specifically provided by Laws 2006, chapter 257, no state agency may spend money from any state fund for the purpose of generating revenue under this subdivision or for the purpose of providing operating support or defraying operating losses of a professional baseball franchise.",
	"repealed": false
}