{
	"id": "128D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/128D.11",
	"title": "128D.11 SCHOOL DISTRICT BONDS.",
	"text": "As used in this section the word \"project\" shall mean any proposed new or enlarged school building site, any proposed new school building or any proposed new addition to a school building, and \"undertaking\" shall mean any other purpose for which bonds may be issued as authorized in this section.\nSubject to the limitations of subdivisions 7 to 10, the special independent school district of Minneapolis may issue and sell bonds with the approval of 53 percent of the electors voting on the question at a general school district election or at a school district election held at the same time and place within the district as a state general or primary election, as determined by the board of education.\nSubject to the provisions of subdivisions 7 to 10, the school district may also by a two-thirds majority vote of all the members of its board of education and without any election by the voters of the district, issue and sell in each calendar year general obligation bonds of the district in an amount not to exceed 5-1/10 per cent of the net tax capacity of the taxable property in the district (plus, for calendar years 1990 to 2003, an amount not to exceed $7,500,000, and for calendar year 2004 and later, an amount not to exceed $15,000,000; with an additional provision that any amount of bonds so authorized for sale in a specific year and not sold can be carried forward and sold in the year immediately following).\nAll bonds of the school district shall be payable in not more than 30 years.\nThe proceeds of the sale of the bonds shall be used only for the rehabilitating, remodeling, expanding, and equipping of existing school buildings and for the acquisition of sites, construction, and equipping of new school buildings, and for acquisition and betterment purposes.\nThe provisions of this section shall apply to the issuance and sale of the bonds and to the purposes for which the bonds may be issued notwithstanding any provisions to the contrary in any other existing law relating thereto.\nThe special independent school district shall not be subject to any charter limitations with respect to bonded indebtedness but shall be subject only to the limits on bonded indebtedness of independent school districts under section 475.53, subdivision 4, and to the additional limitations in subdivisions 8 to 10.\nThe school district shall not be subject to a net debt in excess of 144 percent of the net tax capacity of all taxable property therein.\nThe net debt of the school district for the purposes of this limitation is the amount of bonds less the amount of all money and the face value of all securities then held as a sinking fund for the payment of such bonds, and shall not include school aid and tax anticipation certificates of indebtedness not in default or bonds issued to pay pension fund liabilities under section 475.52, subdivision 6.\n(a) No election shall be held on a proposed issue of bonds unless the board has submitted to the city planning commission a statement of the location and general description, so far as then known, of any project proposed to be constructed or acquired from the proceeds of such bonds with a request for preliminary approval of each such project as being in accordance with the comprehensive plan of the city of Minneapolis. The commission may state its preliminary approval or disapproval of the projects included in such statement within 60 days after receipt thereof, and failure so to do shall be deemed to signify preliminary approval of such projects. In the event the commission shall disapprove any proposed project included in the statement, a vote of at least six members of the board of education shall be required for the adoption of a resolution submitting the proposed bond issue to the electors. Notwithstanding the preliminary approval of any project as herein provided, such project shall be resubmitted to the city planning commission at the time and in the manner specified in paragraph (b). The location and nature of each project shall be determined by the board of education and reviewed by the city planning commission at the time, with reference to the circumstances then existing. Nothing herein shall prevent the revision or elimination of any project previously given preliminary approval or the substitution of another project therefor, by the procedure specified in paragraph (b), if considered necessary by the board to fulfill its responsibilities for public education, and for the construction of school facilities so far as possible in accordance with the comprehensive city plan, provided however no such revision, elimination, or substitution shall be made unless approved by unanimous vote of all members of the board of education. Notwithstanding anything to the contrary contained in this act no election shall be held on a proposed issue of bonds on a date earlier than 60 days after preliminary approval or disapproval by the city planning commission.\n(b) The school district shall not expend the proceeds of bonds for any purpose provided for in subdivisions 1 to 6 requiring approval of the city planning commission unless a proposed resolution stating the location and general description of the project or undertaking shall have been submitted to the city planning commission for consideration of the proposed project or undertaking as being in accordance with the comprehensive plan of the city of Minneapolis. The commission may state its approval or disapproval of the proposed project or undertaking within 60 days thereafter. A failure on the part of the commission to state its disapproval within 60 days after receipt of such resolution shall be deemed an approval. In the event the commission shall disapprove any proposed project or undertaking, a unanimous vote of the members of the board of education shall be required for the adoption of the resolution.",
	"repealed": false
}