{
	"id": "462A.222",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.222",
	"title": "462A.222 LOW-INCOME HOUSING CREDITS.",
	"text": "The agency shall reserve a portion of the annual state ceiling for low-income housing credits provided under section 42 of the Internal Revenue Code of 1986, as amended, to (1) cities with a population of at least 50,000 that have a housing and redevelopment authority; (2) cities located in three or more counties that have a housing and redevelopment authority; and (3) counties with a population of 100,000 or more that have a housing and redevelopment authority. A city or county is eligible to receive a reserved portion of the state ceiling under this subdivision if it submits a written request to the agency within 45 days after June 2, 1987, to act as a designated housing credit agency as provided in section 42 of the Internal Revenue Code of 1986, as amended. A city or county may designate its housing and redevelopment authority as the agency to receive reserved low-income housing credits on behalf of the city or county. The city of Minneapolis or the city of Saint Paul may designate the Minneapolis/Saint Paul Housing Finance Board to receive reserved low-income housing credits on behalf of each city.\nThe agency shall divide the annual per capita amount used in determining the state ceiling for low-income housing tax credits provided under section 42 of the Internal Revenue Code of 1986, as amended, into a metropolitan pool and a greater Minnesota pool. The metropolitan pool shall serve the metropolitan area. The greater Minnesota pool shall serve the remaining counties of the state. The percentage of the annual per capita amount allotted to each pool must be determined as follows:\n(a) The percentage set-aside for projects involving a qualified nonprofit organization as provided in section 42 of the Internal Revenue Code of 1986, as amended, must be deducted from the annual per capita amount used in determining the state ceiling.\n(b) Of the remaining amount, the metropolitan pool must be allotted a percentage equal to the metropolitan counties' percentage of the total number of state recipients of the Minnesota family investment program, general assistance, Minnesota supplemental aid, and Supplemental Security Income in the state, as reported annually by the Department of Human Services. The greater Minnesota pool must be allotted the amount remaining after the metropolitan pool's percentage has been allotted.\nThe set-aside for qualified nonprofit organizations must be divided between the two regional pools in the same percentage as determined for the credit amounts above.\nThe agency shall reserve to each eligible city and county a percentage amount from the appropriate regional pool equal to the city's or county's percentage share of the total population of the counties comprising the pool and multiplied, in 1990 by 1.25. After calendar year 1990, the agency shall allocate tax credits among eligible cities and counties based on the distribution plan established under subdivision 4. For purposes of this subdivision, the state demographer shall provide population estimates to the agency.\n(a) Projects will be awarded tax credits in two competitive rounds on an annual basis. The date for applications for each round must be determined by the agency. No allocating agency may award tax credits prior to the application dates established by the agency.\n(b) Each allocating agency must meet the requirements of section 42(m) of the Internal Revenue Code of 1986, as amended through December 31, 1989, for the allocation of tax credits and the selection of projects.\n(c) For projects that are eligible for an allocation of credits pursuant to section 42(h)(4) of the Internal Revenue Code of 1986, as amended, tax credits may only be allocated if the project satisfies the requirements of the allocating agency's qualified allocation plan. For projects that are eligible for an allocation of credits pursuant to section 42(h)(4) of the Internal Revenue Code of 1986, as amended, for which the agency is the issuer of the bonds for the project, or the issuer of the bonds for the project is located outside the jurisdiction of a city or county that has received reserved tax credits, the applicable allocation plan is the agency's qualified allocation plan.\n(d) To maximize the resources available for and increase the supply of affordable housing in Minnesota by leveraging the benefits to Minnesota from the use of tax-exempt bonds to finance multifamily housing and to allow local units of government more flexibility to address specific affordable housing needs in their communities, the agency shall make residential rental housing projects financed with an allocation of tax-exempt bonds under chapter 474A the highest strategic priority for tax credits under the agency's qualified allocation plan under section 42(m)(1)(D) of the Internal Revenue Code of 1986, as amended.\n(e) For applications submitted for the first round, an allocating agency may allocate tax credits only to the following types of projects:\n(1) in the metropolitan area:\n(i) new construction or substantial rehabilitation of projects in which, for the term of the extended use period, at least 75 percent of the total tax credit units are single-room occupancy, efficiency, or one bedroom units and which are affordable by households whose income does not exceed 30 percent of the median income;\n(ii) new construction or substantial rehabilitation family housing projects that are not restricted to persons who are 55 years of age or older and in which, for the term of the extended use period, at least 75 percent of the tax credit units contain two or more bedrooms and at least one-third of the 75 percent contain three or more bedrooms; or\n(iii) substantial rehabilitation projects in neighborhoods targeted by the city for revitalization;\n(2) outside the metropolitan area, projects which meet a locally identified housing need and which are in short supply in the local housing market as evidenced by credible data submitted with the application;\n(3) projects that are not restricted to persons of a particular age group and in which, for the term of the extended use period, a percentage of the units are set aside and rented to persons:\n(i) with a serious and persistent mental illness as defined in section 245.462, subdivision 20, paragraph (c);\n(ii) with a developmental disability as defined in United States Code, title 42, section 6001, paragraph (5), as amended through December 31, 1990;\n(iii) who have been assessed as drug dependent persons as defined in section 254A.02, subdivision 5, and are receiving or will receive care and treatment services provided by an approved treatment program as defined in section 254A.02, subdivision 2;\n(iv) with a brain injury as defined in section 256B.093, subdivision 4, paragraph (a); or\n(v) with permanent physical disabilities that substantially limit one or more major life activities, if at least 50 percent of the units in the project are accessible as provided under Minnesota Rules, chapter 1340;\n(4) projects, whether or not restricted to persons of a particular age group, which preserve existing subsidized housing, if the use of tax credits is necessary to prevent conversion to market rate use or to remedy physical deterioration of the project which would result in loss of existing federal subsidies; or\n(5) projects financed by the Farmers Home Administration, or its successor agency, which meet statewide distribution goals.\n(f) Before the date for applications for the final round, the allocating agencies other than the agency shall return all uncommitted and unallocated tax credits to a unified pool for allocation by the agency on a statewide basis.\n(g) Unused portions of the state ceiling for low-income housing tax credits reserved to cities and counties for allocation may be returned at any time to the agency for allocation.\n(h) If an allocating agency determines, at any time after the initial commitment or allocation for a specific project, that a project is no longer eligible for all or a portion of the low-income housing tax credits committed or allocated to the project, the credits must be transferred to the agency to be reallocated pursuant to the procedures established in paragraphs (f) to (h); provided that if the tax credits for which the project is no longer eligible are from the current year's annual ceiling and the allocating agency maintains a waiting list, the allocating agency may continue to commit or allocate the credits until not later than the date of applications for the final round, at which time any uncommitted credits must be transferred to the agency.\n(a) By October 1, 1990, the Metropolitan Council, in consultation with the agency and representatives of local government and housing and redevelopment authorities, shall develop and submit to the agency a plan for allocating tax credits in 1991 and thereafter in the metropolitan area, based on regional housing needs and priorities. The agency may amend the distribution plan after consultation with the Metropolitan Council, representatives of local governments, and housing and redevelopment authorities.\n(b) By October 1, 1990, the agency, in consultation with representatives of local government and housing and redevelopment authorities, shall develop a plan for allocating tax credits in 1991 and thereafter in greater Minnesota, based on regional housing needs and priorities. The agency may amend the distribution plan after consultation with representatives of local governments and housing and redevelopment authorities.\n(c) In preparing the distribution plans, the Metropolitan Council and the agency shall estimate the number of households in the metropolitan area and in greater Minnesota, respectively, who are paying more than 50 percent of their income for rent and the cost of providing sufficient rental or other assistance so that no household pays more than 50 percent of its income for rent. In addition, the Metropolitan Council and the agency shall identify the nature and scope of existing programs which primarily serve families at 60 percent of the median income and individuals at 30 percent of the median income.",
	"repealed": false
}