{
	"id": "115A.412",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.412",
	"title": "115A.412 WASTE COMPOSITION; INFORMATION REQUIRED.",
	"text": "(a) Every three years, beginning in 2029, the commissioner must direct the owners and operators at 20 percent of each of the following facility types to perform a waste composition study:\n(1) mixed municipal solid waste land disposal facilities;\n(2) industrial solid waste land disposal facilities;\n(3) demolition debris land disposal facilities;\n(4) transfer stations that annually transfer more than 5,000 tons of waste to a facility outside Minnesota; and\n(5) other facilities identified by the commissioner.\n(b) The waste composition study must be performed at the sole expense of each owner or operator as directed by the commissioner.\n(c) When selecting facilities for waste composition studies, the commissioner must rotate the participants so that, over time, the studies cover the entirety of the facilities identified under paragraph (a). The commissioner must determine the time frame for each study in the three-year cycle. The owner or operator of each selected facility must complete the study within one year of being notified by the commissioner of selection to perform a waste composition study.\n(a) The commissioner must:\n(1) determine the sampling methods to be used and the categories of materials to be sampled for waste composition studies; and\n(2) provide the sampling methods and any additional requirements identified by the commissioner to each owner or operator directed to perform a study.\n(b) The sampling methods must include the number of samples to be taken, the size or weight of each sample, the duration of a sampling event, the sampling interval, and any additional methods identified by the commissioner. The categories of materials to be sampled must include categories and subcategories identified by the commissioner to represent the materials present at each facility.\n(c) Resource recovery facilities required to do waste sorts required under air rules adopted under section 116.07 must use the study requirements developed under this section when conducting waste composition analysis to meet the rule requirements.\n(d) The commissioner must obtain input from counties, cities, and owners or operators of waste facilities before finalizing the sampling methods and requirements. The commissioner must consider cost effectiveness and data quality when determining the sampling methods.\nWithin six months after completing a waste composition study required under this section, the owner or operator of a facility must submit the raw data and results of the study to the commissioner in a form and manner prescribed by the commissioner.\nAfter each three-year cycle, the commissioner must compile and summarize the waste composition data received under subdivision 3. The commissioner must make the summary information available to the public.\n(a) The commissioner may conduct additional waste composition studies at facilities described in subdivision 1.\n(b) Upon request of the commissioner for purposes of determining compliance with this section, a person must furnish to the commissioner any information that the person has or may reasonably obtain.\n(c) The owner or operator of a facility shall allow access upon reasonable notice to authorized agency staff for the purpose of conducting waste composition studies.",
	"repealed": false
}