{
	"id": "47.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.30",
	"title": "47.30 SAVINGS ASSOCIATION MAY CONVERT INTO SAVINGS BANK.",
	"text": "Any capital stock savings association organized and existing under and by virtue of the laws of this state may amend its articles of incorporation so as to convert itself into a savings bank, by complying with the following requirements and procedure:\nA meeting of the shareholders shall be held upon not less than 15 days' written notice to each shareholder, served either personally or by mail prepaid, directed to the shareholder's last known post office address according to the records of the association, stating the time, place and purpose of such meeting.\nAt such meeting, the shareholders may by two-thirds vote (according to the book value of said shares) of those present in person or by proxy pass a resolution declaring their intention to convert such association into a savings bank and setting forth the names of the proposed first board of directors. A copy of the minutes of such meeting verified by the affidavit of the chair and the secretary of the meeting, shall be filed in the office of the Department of Commerce within ten days after the meeting. Such copy, when so filed, shall be evidence of the holding of such meeting and of the action taken.\nAn application for a certificate authorizing a savings bank to transact business, in the form required by sections 46.041 and 46.046, shall be submitted to, considered and acted upon by the Department of Commerce in the same manner and by the same standards as applications are submitted, considered and acted upon under sections 46.041, 46.044, 46.046, and 50.01. The fees required by section 46.041 shall be paid and the amendments proposed to the articles of incorporation and bylaws shall be included as part of the application.\nIf the Department of Commerce grants the application, the certificate of authorization (charter) shall be issued as provided by section 46.041, and the articles of incorporation may then be amended so as to convert the savings association into a savings bank by following the procedure prescribed for amending articles of incorporation of savings associations: Provided, that the proposed amended articles shall contain the names of, and be signed by, the proposed first board of directors.\n[Repealed, 1995 c 171 s 70]\nUpon receipt of the fees required for filing and recording amended articles of incorporation of savings associations, the commissioner of commerce shall record the amended articles of incorporation and certify that fact thereon, whereupon the conversion of such savings association into a savings bank shall become final and complete and thereafter the signers of said amended articles and their successors shall be a corporation, and have the powers and be subject to the duties and obligations prescribed by the laws of this state applicable to savings banks.\n[Repealed, 1995 c 171 s 70]\nThe resulting savings bank shall as soon as practicable and within such time not extending beyond three years from the date the conversion becomes final and complete and by such methods as the commissioner of commerce shall direct, cause its organization, its securities and investments, the character of its business, and the methods of transacting the same to conform to the laws applicable to savings banks.",
	"repealed": false
}