{
	"id": "148B.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.53",
	"title": "148B.53 REQUIREMENTS FOR LICENSURE.",
	"text": "(a) To be licensed as a licensed professional counselor (LPC), an applicant must provide evidence satisfactory to the board that the applicant:\n(1) is at least 18 years of age;\n(2) is of good moral character;\n(3) has completed a master's or doctoral degree program in counseling or a related field, as determined by the board based on the criteria in paragraph (b), that includes a minimum of 48 semester hours or 72 quarter hours and a supervised field experience of not fewer than 700 hours that is counseling in nature;\n(4) has submitted to the board a plan for supervision during the first 2,000 hours of professional practice or has submitted proof of supervised professional practice that is acceptable to the board; and\n(5) has demonstrated competence in professional counseling by passing the National Counseling Exam (NCE) administered by the National Board for Certified Counselors, Inc. (NBCC) or an equivalent national examination as determined by the board, and ethical, oral, and situational examinations if prescribed by the board.\n(b) The degree described in paragraph (a), clause (3), must be from a counseling program recognized by the Council for Accreditation of Counseling and Related Education Programs (CACREP) or from an institution of higher education that is accredited by a regional accrediting organization recognized by the Council for Higher Education Accreditation (CHEA). Specific academic course content and training must include course work in each of the following subject areas:\n(1) the helping relationship, including counseling theory and practice;\n(2) human growth and development;\n(3) lifestyle and career development;\n(4) group dynamics, processes, counseling, and consulting;\n(5) assessment and appraisal;\n(6) social and cultural foundations, including multicultural issues;\n(7) principles of etiology, treatment planning, and prevention of mental and emotional disorders and dysfunctional behavior;\n(8) family counseling and therapy;\n(9) research and evaluation; and\n(10) professional counseling orientation and ethics.\n(c) To be licensed as a professional counselor, a Minnesota licensed psychologist need only show evidence of licensure from the Minnesota Board of Psychology and is not required to comply with paragraph (a) or (b).\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under this subdivision must provide evidence of:\n(1) a current valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license issued under this subdivision is effective for one year from the initial licensure date.\n(d) During the temporary license period, the individual shall complete the licensed professional counselor application for licensure.\n(e) In order to remain licensed after the expiration of the temporary license, an individual must meet the requirements in subdivision 1, paragraphs (a) and (b).\nMS 2004 [Expired, 2003 c 118 s 7]\nNonrefundable fees are as follows:\n(1) initial license application fee for licensed professional counseling (LPC) - $150;\n(2) initial license fee for LPC - $250;\n(3) annual active license renewal fee for LPC - $250 or equivalent;\n(4) annual inactive license renewal fee for LPC - $125;\n(5) initial license application fee for licensed professional clinical counseling (LPCC) - $150;\n(6) initial license fee for LPCC - $250;\n(7) annual active license renewal fee for LPCC - $250 or equivalent;\n(8) annual inactive license renewal fee for LPCC - $125;\n(9) license renewal late fee - $100 per month or portion thereof;\n(10) copy of board order or stipulation - $10;\n(11) certificate of good standing or license verification - $25;\n(12) duplicate certificate fee - $25;\n(13) professional firm renewal fee - $25;\n(14) sponsor application for approval of a continuing education course - $60;\n(15) initial registration fee - $50;\n(16) annual registration renewal fee - $25;\n(17) approved supervisor application processing fee - $30; and\n(18) temporary license for members of the military - $250.",
	"repealed": false
}