{
	"id": "144.9512",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9512",
	"title": "144.9512 LEAD ABATEMENT PROGRAM.",
	"text": "(a) The definitions in section 144.9501 and in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of health.\nWithin the limits of the available appropriation, the commissioner shall make grants to nonprofit organizations to train workers to provide lead screening, education, outreach, and swab team services for residential property. Projects that provide Americorps funding or positions, or leverage matching funds, as part of the delivery of the services must be given priority for the grant funds.\n[Repealed by amendment, 2007 c 147 art 16 s 9]\nThe nonprofit receiving a grant under this section must ensure that all participating lead supervisors or certified firms are licensed and that all swab team workers are certified by the Department of Health under section 144.9505. The nonprofit organization may participate in the program by:\n(1) providing on-the-job training for swab team workers;\n(2) providing swab team services to meet the requirements of sections 144.9503, subdivision 4, and 144.9504, subdivision 6;\n(3) providing lead hazard reduction to meet the requirements of section 144.9501, subdivision 17;\n(4) providing lead dust cleanup equipment and materials, as described in section 144.9503, subdivision 1, to residents;\n(5) having a swab team worker instruct residents and property owners on appropriate lead control techniques, including the lead-safe directives developed by the commissioner of health;\n(6) conducting blood lead testing events including screening children and pregnant women according to Department of Health screening guidelines;\n(7) performing case management services according to Department of Health case management guidelines; or\n(8) conducting mandated risk assessments under section 144.9504, subdivision 2.\nEach worker engaged in swab team services established under this section must have blood lead concentrations below 15 micrograms of lead per deciliter of whole blood as determined by a baseline blood lead screening. The nonprofit organization receiving a grant under this section is responsible for lead screening and must ensure that all swab team workers meet the standards established in this subdivision. The nonprofit organization must use appropriate workplace procedures including following the lead-safe directives developed by the commissioner of health to reduce risk of elevated blood lead levels. The nonprofit organization and participating contractors must report all employee blood lead levels that exceed 15 micrograms of lead per deciliter of whole blood to the commissioner of health.\n[Repealed by amendment, 2007 c 147 art 16 s 9]\n[Repealed by amendment, 2007 c 147 art 16 s 9]\n[Repealed by amendment, 2007 c 147 art 16 s 9]\nAs a condition of providing swab team services under this section, the nonprofit organization may require a property owner to not increase rents on a property solely as a result of a substantial improvement made with public funds under the programs in this section.\nThe nonprofit organization that is awarded a grant under this section must prepare and submit a quarterly progress report to the commissioner beginning three months after receipt of the grant.",
	"repealed": false
}