{
	"id": "144.966",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.966",
	"title": "144.966 EARLY HEARING DETECTION AND INTERVENTION PROGRAM.",
	"text": "(a) \"Child\" means a person 18 years of age or younger.\n(b) \"False positive rate\" means the proportion of infants identified as having a significant hearing loss by the screening process who are ultimately found to not have a significant hearing loss.\n(c) \"False negative rate\" means the proportion of infants not identified as having a significant hearing loss by the screening process who are ultimately found to have a significant hearing loss.\n(d) \"Hearing screening test\" means automated auditory brain stem response, otoacoustic emissions, or another appropriate screening test approved by the Department of Health.\n(e) \"Hospital\" means a birthing health care facility or birthing center licensed in this state that provides obstetrical services.\n(f) \"Infant\" means a child who is not a newborn and has not attained the age of one year.\n(g) \"Newborn\" means an infant 28 days of age or younger.\n(h) \"Parent\" means a natural parent, stepparent, adoptive parent, guardian, or custodian of a newborn or infant.\n(a) The commissioner of health shall establish a Newborn Hearing Screening Advisory Committee to advise and assist the Department of Health; Department of Children, Youth, and Families; and the Department of Education in:\n(1) developing protocols and timelines for screening, rescreening, and diagnostic audiological assessment and early medical, audiological, and educational intervention services for children who are deaf or hard-of-hearing;\n(2) designing protocols for tracking children from birth through age three that may have passed newborn screening but are at risk for delayed or late onset of permanent hearing loss;\n(3) designing a technical assistance program to support facilities implementing the screening program and facilities conducting rescreening and diagnostic audiological assessment;\n(4) designing implementation and evaluation of a system of follow-up and tracking; and\n(5) evaluating program outcomes to increase effectiveness and efficiency and ensure culturally appropriate services for children with a confirmed hearing loss and their families.\n(b) The commissioner of health shall appoint at least one member from each of the following groups with no less than two of the members being deaf or hard-of-hearing:\n(1) a representative from a consumer organization representing culturally deaf persons;\n(2) a parent with a child with hearing loss representing a parent organization;\n(3) a consumer from an organization representing oral communication options;\n(4) a consumer from an organization representing cued speech communication options;\n(5) an audiologist who has experience in evaluation and intervention of infants and young children;\n(6) a speech-language pathologist who has experience in evaluation and intervention of infants and young children;\n(7) two primary care providers who have experience in the care of infants and young children, one of which shall be a pediatrician;\n(8) a representative from the early hearing detection intervention teams;\n(9) a representative from the Department of Education resource center for the deaf and hard-of-hearing or the representative's designee;\n(10) a representative of the Commission of the Deaf, DeafBlind and Hard of Hearing;\n(11) a representative from the Department of Human Services Deaf and Hard-of-Hearing Services Division;\n(12) one or more of the Part C coordinators from the Department of Education; the Department of Health; the Department of Children, Youth, and Families; or the Department of Human Services or the department's designees;\n(13) the Department of Health early hearing detection and intervention coordinators;\n(14) two birth hospital representatives from one rural and one urban hospital;\n(15) a pediatric geneticist;\n(16) an otolaryngologist;\n(17) a representative from the Newborn Screening Advisory Committee under this subdivision;\n(18) a representative of the Department of Education regional low-incidence facilitators;\n(19) a representative from the deaf mentor program; and\n(20) a representative of the Minnesota State Academy for the Deaf from the Minnesota State Academies staff.\nThe commissioner must complete the initial appointments required under this subdivision by September 1, 2007, and the initial appointments under clauses (19) and (20) by September 1, 2019.\n(c) The Department of Health member shall chair the first meeting of the committee. At the first meeting, the committee shall elect a chair from its membership. The committee shall meet at the call of the chair, at least four times a year. The committee shall adopt written bylaws to govern its activities. The Department of Health shall provide technical and administrative support services as required by the committee. These services shall include technical support from individuals qualified to administer infant hearing screening, rescreening, and diagnostic audiological assessments.\nMembers of the committee shall receive no compensation for their service, but shall be reimbursed as provided in section 15.059 for expenses incurred as a result of their duties as members of the committee.\n(d) By February 15, 2015, and by February 15 of the odd-numbered years after that date, the commissioner shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over health and data privacy on the activities of the committee that have occurred during the past two years.\n(e) This subdivision expires June 30, 2025.\nAll hospitals shall establish an early hearing detection and intervention (EHDI) program. Each EHDI program shall:\n(1) in advance of any hearing screening testing, provide to the newborn's or infant's parents or parent information concerning the nature of the screening procedure, applicable costs of the screening procedure, the potential risks and effects of hearing loss, and the benefits of early detection and intervention;\n(2) comply with parental election as described under section 144.125, subdivision 4;\n(3) develop policies and procedures for screening and rescreening based on Department of Health recommendations;\n(4) provide appropriate training and monitoring of individuals responsible for performing hearing screening tests as recommended by the Department of Health;\n(5) test the newborn's hearing prior to discharge, or, if the newborn is expected to remain in the hospital for a prolonged period, testing shall be performed prior to three months of age or when medically feasible;\n(6) develop and implement procedures for documenting the results of all hearing screening tests;\n(7) inform the newborn's or infant's parents or parent; primary care physician, advanced practice registered nurse, or physician assistant; and the Department of Health according to recommendations of the Department of Health of the results of the hearing screening test or rescreening if conducted, or if the newborn or infant was not successfully tested. The hospital that discharges the newborn or infant to home is responsible for the screening; and\n(8) collect performance data specified by the Department of Health.\n(a) The commissioner shall contract with a nonprofit organization to provide support and assistance to families with children who are deaf or have a hearing loss. The family support provided must include:\n(1) direct hearing loss specific parent-to-parent assistance and unbiased information on communication, educational, and medical options; and\n(2) individualized deaf or hard-of-hearing mentors who provide education, including instruction in American Sign Language as an available option.\nThe commissioner shall give preference to a nonprofit organization that has the ability to provide these services throughout the state.\n(b) Family participation in the support and assistance services is voluntary.\n(a) Notification to the parents or parent, primary care provider, and the Department of Health shall occur prior to discharge or no later than ten days following the date of testing. Notification shall include information recommended by the Department of Health and information regarding the right of the parent or legal guardian to discontinue storage of the test results and require destruction under paragraph (d).\n(b) A physician, nurse, midwife, or other health professional attending a birth outside a hospital or institution shall provide information, orally and in writing, as established by the Department of Health, to parents regarding places where the parents may have their infant's hearing screened and the importance of the screening.\n(c) The professional conducting the diagnostic procedure to confirm the hearing loss must report the results to the parents, primary care provider, and Department of Health according to the Department of Health recommendations.\n(d) The Department of Health may store hearing screening and rescreening test results for a period of time not to exceed 18 years from the infant's date of birth.\n(e) Notwithstanding paragraph (d), a parent or legal guardian may instruct the Department of Health to discontinue storing hearing screening and rescreening test results by providing a signed and dated form requesting destruction of the test results. The Department of Health shall make necessary forms available on the department's website. If a parent or legal guardian instructs the Department of Health to discontinue storing hearing screening and rescreening test results, the Department of Health shall destroy the test results within one month of receipt of the instruction or within 25 months after it received the last test result, whichever is later.\nThe Department of Health shall exercise oversight responsibility for EHDI programs, including establishing a performance data set and reviewing performance data collected by each hospital.\n(a) No physician, advanced practice registered nurse, physician assistant, or hospital shall be civilly or criminally liable for failure to conduct hearing screening testing.\n(b) No physician, midwife, nurse, physician assistant, other health professional, or hospital acting in compliance with this section shall be civilly or criminally liable for any acts conforming with this section, including furnishing information required according to this section.\nThe commissioner shall charge a fee so that the total of fees collected will approximate the costs of implementing and maintaining a system to follow up on infants and provide technical assistance, a tracking system, data management, and evaluation. The fee shall be incorporated in the fee charged under section 144.125.\nNotwithstanding anything to the contrary, nothing in this section shall be construed as constituting newborn screening activities conducted under sections 144.125 to 144.128. Data collected by or submitted to the Department of Health pursuant to this section is not genetic information for purposes of section 13.386.",
	"repealed": false
}