{
	"id": "582.039",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.039",
	"title": "582.039 MEDIATION NOTICE FOR AGRICULTURAL PROPERTY.",
	"text": "A person may not begin a proceeding under this chapter or chapter 580 to foreclose a mortgage on agricultural property subject to sections 583.20 to 583.32 that has a secured debt of more than the amount provided in section 583.24, subdivision 5, unless: (1) a mediation notice is served on the mortgagor after a default has occurred in the mortgage and a copy is served on the director and the mortgagor and mortgagee have completed mediation under sections 583.20 to 583.32; or (2) as otherwise allowed under sections 583.20 to 583.32.\nA mediation notice must contain the following notice with the blanks properly filled in.\n\"TO: ....(Name of Record Owner)....\nYOU HAVE DEFAULTED ON THE MORTGAGE OF THE AGRICULTURAL PROPERTY DESCRIBED AS ....(Size and Reasonable Location, Not Legal Description). THE AMOUNT OF THE OUTSTANDING DEBT ON THIS PROPERTY IS ....(Amount of Debt)....\nAS HOLDER OF THE MORTGAGE, ....(Name of Holder of Mortgage).... INTENDS TO FORECLOSE ON THE PROPERTY DESCRIBED ABOVE.\nYOU HAVE THE RIGHT TO HAVE THE MORTGAGE DEBT REVIEWED FOR MEDIATION. IF YOU REQUEST MEDIATION, A DEBT THAT IS IN DEFAULT WILL BE MEDIATED ONLY ONCE. IF YOU DO NOT REQUEST MEDIATION, THIS DEBT WILL NOT BE SUBJECT TO FUTURE MEDIATION IF THE SECURED PARTY ENFORCES THE DEBT.\nIF YOU PARTICIPATE IN MEDIATION, THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE WILL PROVIDE AN ORIENTATION MEETING AND A FINANCIAL ANALYST TO HELP YOU PREPARE FINANCIAL INFORMATION. IF YOU DECIDE TO PARTICIPATE IN MEDIATION, IT WILL BE TO YOUR ADVANTAGE TO ASSEMBLE YOUR FARM FINANCE AND OPERATION RECORDS AND TO CONTACT A COUNTY EXTENSION OFFICE AS SOON AS POSSIBLE. MEDIATION WILL ATTEMPT TO ARRIVE AT AN AGREEMENT FOR HANDLING FUTURE FINANCIAL RELATIONS.\nTO HAVE THE MORTGAGE DEBT REVIEWED FOR MEDIATION YOU MUST FILE A MEDIATION REQUEST WITH THE DIRECTOR WITHIN 14 DAYS AFTER YOU RECEIVE THIS NOTICE. THE MEDIATION REQUEST FORM IS AVAILABLE FROM THE DIRECTOR OF THE MINNESOTA EXTENSION SERVICE.\nFROM: ....(Name and Address of Holder of Mortgage)....\"",
	"repealed": false
}