{
	"id": "60A.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.54",
	"title": "60A.54 AUTHORIZED CONTROL LEVEL EVENT.",
	"text": "\"Authorized control level event\" means any of the following events:\n(1) the filing of an RBC report by the health organization that indicates that the health organization's total adjusted capital is greater than or equal to its mandatory control level RBC but less than its authorized control level RBC;\n(2) the notification by the commissioner to the health organization of an adjusted RBC report that indicates the event in clause (1), provided the health organization does not challenge the adjusted RBC report under section 60A.56;\n(3) if, pursuant to section 60A.56, the health organization challenges an adjusted RBC report that indicates the event in clause (1), notification by the commissioner to the health organization that the commissioner has, after a hearing, rejected the health organization's challenge;\n(4) the failure of the health organization to respond, in a manner satisfactory to the commissioner, to a corrective order, provided the health organization has not challenged the corrective order under section 60A.56; or\n(5) if the health organization has challenged a corrective order under section 60A.56 and the commissioner has, after a hearing, rejected the challenge or modified the corrective order, the failure of the health organization to respond, in a manner satisfactory to the commissioner, to the corrective order subsequent to rejection or modification by the commissioner.\nIn the event of an authorized control level event with respect to a health organization, the commissioner shall:\n(1) take such actions as are required under section 60A.53 regarding a health organization with respect to which a regulatory action level event has occurred; or\n(2) if the commissioner considers it to be in the best interests of the policyholders and creditors of the health organization and of the public, take such actions as are necessary to cause the health organization to be placed under regulatory control under chapter 60B. In the event the commissioner takes such actions, the authorized control level event is considered sufficient grounds for the commissioner to take action under chapter 60B, and the commissioner shall have the rights, powers, and duties with respect to the health organization as are set forth in chapter 60B. In the event the commissioner takes actions under this clause pursuant to an adjusted RBC report, the health organization is entitled to the protections afforded health organizations under sections 60B.11 and 60B.13 pertaining to summary proceedings.",
	"repealed": false
}