{
	"id": "237.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.51",
	"title": "237.51 TELECOMMUNICATIONS ACCESS MINNESOTA PROGRAM ADMINISTRATION.",
	"text": "(a) The commissioner of commerce shall:\n(1) administer through interagency agreement with the commissioner of human services a program to distribute telecommunications devices and interconnectivity products to eligible persons who have communication disabilities; and\n(2) contract with one or more qualified vendors that serve persons who have communication disabilities to provide telecommunications relay services.\n(b) For purposes of sections 237.51 to 237.56, the Department of Commerce and any organization with which it contracts pursuant to this section or section 237.54, subdivision 2, are not telephone companies or telecommunications carriers as defined in section 237.01.\n[Repealed, 1995 c 190 s 17]\n[Repealed, 1995 c 190 s 17]\n[Repealed, 1995 c 190 s 17]\nIn addition to any duties specified elsewhere in sections 237.51 to 237.56, the commissioner of commerce shall:\n(1) prepare the reports required by section 237.55;\n(2) administer the fund created in section 237.52; and\n(3) adopt rules under chapter 14 to implement the provisions of sections 237.50 to 237.56.\n(a) In addition to any duties specified elsewhere in sections 237.51 to 237.56, the commissioner of human services shall:\n(1) define economic hardship, special needs, and household criteria so as to determine the priority of eligible applicants for initial distribution of devices and products and to determine circumstances necessitating provision of more than one telecommunications device per household;\n(2) establish a method to verify eligibility requirements;\n(3) establish specifications for telecommunications devices and interconnectivity products to be provided under section 237.53, subdivision 3;\n(4) inform the public and specifically persons who have communication disabilities of the program;\n(5) provide devices and products based on the assessed need of eligible applicants; and\n(6) assist a person with completing an application for discounted telecommunications or Internet services.\n(b) The commissioner may establish an advisory board to advise the department in carrying out the duties specified in this section and to advise the commissioner of commerce in carrying out duties under section 237.54. If so established, the advisory board must include, at a minimum, the following persons:\n(1) at least one member who is deaf;\n(2) at least one member who has a speech disability;\n(3) at least one member who has a physical disability that makes it difficult or impossible for the person to access telecommunications services; and\n(4) at least one member who is hard-of-hearing.\n(c) The membership terms, compensation, and removal of members and the filling of membership vacancies are governed by section 15.059. Advisory board meetings shall be held at the discretion of the commissioner.\n[Repealed, 1995 c 190 s 17]",
	"repealed": false
}