{
	"id": "326B.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.121",
	"title": "326B.121 STATE BUILDING CODE; APPLICATION AND ENFORCEMENT.",
	"text": "(a) The State Building Code is the standard that applies statewide for the construction, reconstruction, alteration, repair, and use of buildings and other structures of the type governed by the code.\n(b) The State Building Code supersedes the building code of any municipality.\n(c) The State Building Code does not apply to agricultural buildings except:\n(1) with respect to state inspections required or rulemaking authorized by sections 103F.141; 216C.19, subdivision 9; and 326B.36; and\n(2) translucent panels or other skylights without raised curbs shall be supported to have equivalent load-bearing capacity as the surrounding roof.\nA municipality may by ordinance adopt an official control that requires exterior work authorized by a building permit issued in accordance with the State Building Code, to be completed within a specified number of days following issuance of the building permit. The local regulation may not require completion of exterior work earlier than 180 days following the issuance of the permit.\n(a) If, as of January 1, 2008, a municipality has in effect an ordinance adopting the State Building Code, that municipality must continue to administer and enforce the State Building Code within its jurisdiction. The municipality is prohibited from repealing its ordinance adopting the State Building Code. This paragraph does not apply to municipalities with a population of less than 2,500 according to the last federal census that are located outside of a metropolitan county, as defined in section 473.121, subdivision 4.\n(b) If a municipality is not required by paragraph (a) to administer and enforce the State Building Code, the municipality may choose to administer and enforce the State Building Code within its jurisdiction by adopting the code by ordinance.\n(c) A municipality must not by ordinance, or through development agreement, require building code provisions regulating components or systems of any structure that are different from any provision of the State Building Code. This subdivision does not prohibit a municipality from enacting or enforcing an ordinance requiring existing components or systems of any structure to be maintained in a safe and sanitary condition or in good repair, but not exceeding the standards under which the structure was built, reconstructed, or altered, or the component or system was installed, unless specific retroactive provisions for existing buildings have been adopted as part of the State Building Code. A municipality may, with the approval of the state building official, adopt an ordinance that is more restrictive than the State Building Code where geological conditions warrant a more restrictive ordinance. A municipality may appeal the disapproval of a more restrictive ordinance to the commissioner. An appeal under this subdivision is subject to the schedule, fee, procedures, cost provisions, and appeal rights set out in section 326B.139.\n(d) A city may by ordinance and with permission of the township board extend the administration and enforcement of the code to contiguous unincorporated territory not more than two miles distant from its corporate limits in any direction if the code is not already administered and enforced in the territory. Where two or more noncontiguous cities, which have elected to administer and enforce the code, have boundaries less than four miles apart, each is authorized to enforce the code on its side of a line equidistant between them. Once enforcement authority is extended extraterritorially by ordinance, the authority may continue to be exercised in the designated territory even though another city less than four miles distant later elects to enforce the code. After the extension, the city may enforce the code in the designated area to the same extent as if the property were situated within its corporate limits. Enforcement of the code in an extended area outside a city's corporate limits includes all rules, laws, and ordinances associated with administration of the code.\n(e) A city cannot commence administration and enforcement of the code outside of its jurisdiction until it has provided written notice to the commissioner, the county auditor, and the town clerk of each town in which it intends to administer and enforce the code. A public hearing on the proposed administration and enforcement must be held not less than 30 days after the notice has been provided. Administration and enforcement of the code by the city outside of its jurisdiction commences on a date determined by the city that is no less than 90 days nor more than one year after the public hearing.\n(f) A municipality may enforce the State Building Code by any means that are convenient and lawful, including entering into contracts with other municipalities under section 471.59 and with qualified individuals. The other municipalities or qualified individuals may be reimbursed by retention or remission of some or all of the building permit fee collected or by other means. If a municipality has no qualified employees of the municipality or other municipalities or qualified individuals available to carry out inspection and enforcement, the commissioner shall train and designate individuals available to carry out inspection and enforcement. The commissioner may be reimbursed for the inspection by retention or remission of some or all of the building permit fee collected or by other means.\n(g) Nothing in this subdivision prohibits a municipality from adopting ordinances relating to zoning, subdivision, or planning unless the ordinance conflicts with a provision of the State Building Code that regulates components or systems of any structure.\nIf the commissioner determines that a municipality that has adopted the State Building Code is not properly administering and enforcing the code, or if the commissioner determines that any municipality that is required by subdivision 2 to enforce any provision of the State Building Code is not properly enforcing that provision, the commissioner may have the administration and enforcement in the involved municipality undertaken by the state building official or by another building official certified by the state. The commissioner shall notify the affected municipality in writing immediately upon making the determination, and the municipality may challenge the determination as a contested case before the commissioner pursuant to the Administrative Procedure Act. In carrying out administration and enforcement under this subdivision, the commissioner shall apply any optional provision of the State Building Code adopted by the municipality. A municipality adopting any optional code provision shall notify the state building official within 30 days of its adoption. The commissioner shall determine appropriate fees to be charged for the administration and enforcement service rendered. Any cost to the state arising from the state administration and enforcement of the State Building Code shall be borne by the subject municipality where a fee has been collected by the municipality.",
	"repealed": false
}