{
	"id": "297G.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.18",
	"title": "297G.18 CIVIL PENALTIES.",
	"text": "The commissioner may recover the amount of any tax due under this chapter, as well as any interest and penalty in a civil action. The collection of a tax, interest, or penalty does not bar any prosecution under this chapter.\nIf a tax imposed by this chapter is not paid within the time specified for payment, a penalty is added to the amount required to be shown as tax. The penalty is five percent of the tax not paid on or before the date specified for payment of the tax if the failure is for not more than 30 days, with an additional penalty of five percent of the amount of tax remaining unpaid during each additional 30 days or fraction of 30 days during which the failure continues, not exceeding 15 percent in the aggregate.\nIf a taxpayer fails to make and file a return within the time prescribed, including any extension, a penalty of five percent of the amount of tax not timely paid is added to the tax. If no tax is due, a penalty of $25 is assessed for each unfiled return.\n[Repealed, 1999 c 243 art 16 s 39]\nIf part of an additional assessment is due to negligence or intentional disregard of the provisions of the applicable tax laws or rules of the commissioner, but without an intent to defraud, there must be added to the tax an amount equal to ten percent of the additional assessment.\nIf there is a pattern by a person of repeated failures to timely file returns or timely pay taxes, and written notice is given that a penalty will be imposed if such failures continue, a penalty of 25 percent of the amount of tax not timely paid as a result of each such subsequent failure is added to the tax. The penalty can be abated under the abatement authority in section 270C.34.\nIf a person files a false or fraudulent return, or attempts in any manner to evade or defeat a tax or payment of tax, there is imposed on the person a penalty equal to 50 percent of the tax due for the period to which the return related, less amounts paid by the person on the basis of the false or fraudulent return.\nThe commissioner may certify to the commissioner of public safety any failure to pay taxes when due as a violation of the statute relating to the sale of intoxicating liquor for possible revocation or suspension of license.\nA person required to file informational returns or reports that fails to do so as required by this chapter is assessed a $25 penalty for each month the return remains unfiled.\nThe penalties imposed by this section are collected and paid in the same manner as taxes.\nThe civil penalties imposed by this section are in addition to the criminal penalties imposed by this chapter.",
	"repealed": false
}