{
	"id": "181.987",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.987",
	"title": "181.987 USE OF SKILLED AND TRAINED CONTRACTOR WORKFORCES AT PETROLEUM REFINERIES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Contractor\" means a vendor that enters into or seeks to enter into a contract with an owner or operator of a petroleum refinery to perform construction, alteration, demolition, installation, repair, maintenance, or hazardous material handling work at the site of the petroleum refinery. Contractor includes all contractors or subcontractors of any tier performing work as described in this paragraph at the site of the petroleum refinery. Contractor does not include employees of the owner or operator of a petroleum refinery.\n(c) \"Registered apprenticeship program\" means an apprenticeship program registered with the Department of Labor and Industry under chapter 178 or with the United States Department of Labor Office of Apprenticeship or a recognized state apprenticeship agency under Code of Federal Regulations, title 29, parts 29 and 30.\n(d) \"Skilled and trained workforce\" means a workforce in which each employee of the contractor or subcontractor of any tier working at the site of the petroleum refinery in an apprenticeable occupation in the building and construction trades meets one of the following criteria:\n(1) is currently registered as an apprentice in a registered apprenticeship program in the applicable trade;\n(2) has graduated from a registered apprenticeship program in the applicable trade;\n(3) has completed all of the related instruction and on-the-job learning requirements needed to graduate from the registered apprenticeship program their employer participates in; or\n(4) has at least five years of experience working in the applicable trade and is currently participating in journeyworker upgrade training in a registered apprenticeship program in the applicable trade or has completed any training identified as necessary by the registered apprenticeship training program for the employee to become a qualified journeyworker in the applicable trade.\n(e) \"Petroleum refinery\" means a facility engaged in producing gasoline, kerosene, distillate fuel oils, residual fuel oil, lubricants, or other products through distillation of petroleum or through redistillation, cracking, or reforming of unfinished petroleum derivatives. Petroleum refinery includes fluid catalytic cracking unit catalyst regenerators, fluid catalytic cracking unit incinerator-waste heat boilers, fuel gas combustion devices, and indirect heating equipment associated with the refinery.\n(f) \"Apprenticeable occupation\" means any trade, form of employment, or apprenticeable occupation in the building and construction trades approved by the commissioner of labor and industry or the United States Secretary of Labor.\n(g) \"OEM\" means original equipment manufacturer and refers to organizations that manufacture or fabricate equipment for sale directly to purchasers or other resellers.\n(a) An owner or operator of a petroleum refinery shall, when contracting with contractors for the performance of construction, alteration, demolition, installation, repair, maintenance, or hazardous material handling work at the site of the petroleum refinery, require that the contractors performing that work, and any subcontractors of any tier, use a skilled and trained workforce when performing that work at the site of the petroleum refinery. The requirement to use a safe and skilled workforce under this section shall apply to each contractor and subcontractor of any tier when performing construction, alteration, demolition, installation, repair, maintenance, or hazardous material handling work at the site of the petroleum refinery.\n(b) The requirement under this subdivision applies only when each contractor and subcontractor of any tier is performing work at the site of the petroleum refinery.\n(c) The requirement under this subdivision does not apply when an owner or operator contracts with contractors or subcontractors hired to install OEM equipment and to perform OEM work to comply with equipment warranty requirements.\n(d) A contractor's workforce must meet the requirements of subdivision 1, paragraph (d), according to the following schedule:\n(1) 30 percent by January 1, 2024;\n(2) 45 percent by January 1, 2025; and\n(3) 60 percent by January 1, 2026.\n(e) If a contractor is required under a collective bargaining agreement to hire workers referred by a labor organization for the petroleum refinery worksite, and the labor organization is unable to refer sufficient workers for the contractor to comply with the applicable percentage provided in paragraph (d) within 48 hours of the contractor's request excluding Saturdays, Sundays, and holidays, the contractor shall be relieved of the obligation to comply with the applicable percentage and shall use the maximum percentage of a skilled and trained workforce that is available to the contractor from the labor organization's referral procedure. The contractor shall comply with the applicable percentage provided in paragraph (d) once the labor organization is able to refer sufficient workers for the contractor to comply with the applicable percentage.\n(f) This section shall not apply to a contractor to the extent that an emergency makes compliance with this section impracticable for the contractor because the emergency requires immediate action by the contractor to prevent harm to public health or safety or to the environment. The requirements of this section shall apply to the contractor once the emergency ends or it becomes practicable for the contractor to obtain a skilled and trained workforce for the refinery worksite, whichever occurs sooner.\n(g) An owner or operator is exempt from this section if:\n(1) the owner or operator has entered into a project labor agreement with a council of building trades labor organizations requiring participation in registered apprenticeship programs, or all contractors and subcontractors of any tier have entered into bona fide collective bargaining agreements with labor organizations requiring participation in registered apprenticeship programs; and\n(2) all contracted work at the petroleum refinery that is subject to this section is also subject to the project labor agreement or collective bargaining agreements requiring participation in such registered apprenticeship programs.\n(a) The Division of Labor Standards shall receive complaints of violations of this section. The commissioner of labor and industry shall fine an owner or operator, contractor, or subcontractor of any tier not less than $5,000 nor more than $10,000 for each violation of the requirements in this section. An owner or operator, contractor, or subcontractor of any tier shall be considered an employer for purposes of section 177.27.\n(b) An owner or operator shall be found in violation of this section, and subject to fines and other penalties, for failing to:\n(1) require a skilled and trained workforce in its contracts and subcontracts as required by subdivision 2, paragraph (a); or\n(2) enforce the requirement of use of a skilled and trained workforce as required by subdivision 2, paragraph (a).\n(c) A contractor or subcontractor shall be found in violation of this section, and subject to fines and other penalties, if the contractor or subcontractor fails to use a skilled and trained workforce as required by subdivision 2, paragraph (a).\n(d) Each shift on which a violation of this section occurs shall be considered a separate violation. This fine is in addition to any penalties provided under section 177.27, subdivision 7. In determining the amount of a fine under this subdivision, the appropriateness of the fine to the size of the violator's business and the gravity of the violation shall be considered.",
	"repealed": false
}