{
	"id": "128B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/128B.03",
	"title": "128B.03 FINANCES, INSURANCE, TRANSPORTATION.",
	"text": "This chapter does not allow the council to issue bonds, levy taxes, or borrow money.\nThe council may receive federal aid to Indians.\n[Repealed, 1991 c 265 art 3 s 40]\nThe state shall pay to the council for the support of the school all aids, revenues, and grants available to a school district as though the school were a school district. The aids, revenues, and grants include, but are not limited to, the following:\n(1) general education revenue, as defined in section 126C.10, subdivision 1, including at least compensatory revenue;\n(2) transportation revenue;\n(3) capital expenditure facilities revenue;\n(4) capital expenditure equipment revenue;\n(5) special education revenue;\n(6) English learner aid;\n(7) family connections aid;\n(8) assurance of mastery revenue;\n(9) school lunch revenue;\n(10) school milk revenue;\n(11) long-term facilities maintenance revenue;\n(12) Indian language and culture grants;\n(13) arts planning grants; and\n(14) all other aids, revenues, or grants available to a school district.\nIf there are eligibility requirements for an aid, revenue, or grant, the requirements shall be met in order to obtain the aid, revenue, or grant, except that a requirement to levy shall be waived. To compute the amount of aid, revenue, or grant requiring a levy, the amount of the levy shall be zero.\nIf a school district obtains revenue from the proceeds of a levy, the council shall be deemed to have levied and the state shall pay aid equal to the amount that would have been levied. The amount shall be approved by the commissioner of education.\nThe proceeds of any aid, grant, or revenue shall be used only as provided in the applicable statute.\nThe school board of Independent School District No. 309 must transfer to the council, to the extent permissible, any federal aids or grants which the school district is eligible for or entitled to because of:\n(1) the population in the school attendance area;\n(2) the pupils actually attending the school;\n(3) the program of the school;\n(4) the boundaries of the attendance area of the school; or\n(5) a related reason.\nThe council must have an audit done annually of the accounts of the school. The audit must be finished within one year after the year for which the audit is made.\nThe treasurer of the council must give a corporate surety bond to the state. The school board of Independent School District No. 309 must set the amount of the bond. The amount must be sufficient to protect the interest of the school district.\nThe council may buy the insurance specified in sections 122A.69 and 123B.23. The council must buy insurance to the extent required by chapter 466 and is not liable beyond the extent provided by chapter 466.\n[Repealed, 1991 c 265 art 3 s 40]",
	"repealed": false
}