{
	"id": "147.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.09",
	"title": "147.09 EXEMPTIONS.",
	"text": "Section 147.081 does not apply to, control, prevent or restrict the practice, service, or activities of:\n(1) A person who is a commissioned medical officer of, a member of, or employed by, the armed forces of the United States, the United States Public Health Service, the Veterans Administration, any federal institution or any federal agency while engaged in the performance of official duties within this state, if the person is licensed elsewhere.\n(2) A licensed physician from a state or country who is in actual consultation here.\n(3) A licensed or registered physician who treats the physician's home state patients or other participating patients while the physicians and those patients are participating together in outdoor recreation in this state as defined by section 86A.03, subdivision 3. A physician shall first register with the board on a form developed by the board for that purpose. The board shall not be required to promulgate the contents of that form by rule. No fee shall be charged for this registration.\n(4) A student practicing under the direct supervision of a preceptor while the student is enrolled in and regularly attending a recognized medical school.\n(5) A student who is in continuing training and performing the duties of an intern or resident or engaged in postgraduate work considered by the board to be the equivalent of an internship or residency in any hospital or institution approved for training by the board, provided the student has a residency permit issued by the board under section 147.0391.\n(6) A person employed in a scientific, sanitary, or teaching capacity by the state university, the Department of Education, a public or private school, college, or other bona fide educational institution, a nonprofit organization, which has tax-exempt status in accordance with the Internal Revenue Code, section 501(c)(3), and is organized and operated primarily for the purpose of conducting scientific research directed towards discovering the causes of and cures for human diseases, or the state Department of Health, whose duties are entirely of a research, public health, or educational character, while engaged in such duties; provided that if the research includes the study of humans, such research shall be conducted under the supervision of one or more physicians licensed under this chapter.\n(7) Physician assistants licensed in this state.\n(8) A doctor of osteopathic medicine duly licensed by the state Board of Osteopathy under Minnesota Statutes 1961, sections 148.11 to 148.16, prior to May 1, 1963, who has not been granted a license to practice medicine in accordance with this chapter provided that the doctor confines activities within the scope of the license.\n(9) Any person licensed by a health-related licensing board, as defined in section 214.01, subdivision 2, or registered by the commissioner of health pursuant to section 214.13, including psychological practitioners with respect to the use of hypnosis; provided that the person confines activities within the scope of the license.\n(10) A person who practices ritual circumcision pursuant to the requirements or tenets of any established religion.\n(11) A Christian Scientist or other person who endeavors to prevent or cure disease or suffering exclusively by mental or spiritual means or by prayer.\n(12) A physician licensed to practice medicine in another state who is in this state for the sole purpose of providing medical services at a competitive athletic event. The physician may practice medicine only on participants in the athletic event. A physician shall first register with the board on a form developed by the board for that purpose. The board shall not be required to adopt the contents of the form by rule. The physician shall provide evidence satisfactory to the board of a current unrestricted license in another state. The board shall charge a fee of $50 for the registration.\n(13) A psychologist licensed under section 148.907 or a social worker licensed under chapter 148D who uses or supervises the use of a penile or vaginal plethysmograph in assessing and treating individuals suspected of engaging in aberrant sexual behavior and sex offenders.\n(14) Any person issued a training course certificate or credentialed by the director of the Office of Emergency Medical Services established in chapter 144E, provided the person confines activities within the scope of training at the certified or credentialed level.\n(15) An unlicensed complementary and alternative health care practitioner practicing according to chapter 146A.",
	"repealed": false
}