{
	"id": "179A.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.102",
	"title": "179A.102 TRANSITION TO NEW BARGAINING UNIT STRUCTURE.",
	"text": "Notwithstanding the provisions of section 179A.12 or any other law, this section governs, where contrary to other law, the initial certification and decertification, if any, of exclusive representatives for the appropriate units established by section 179A.101. Subsequent to the initial certification and decertification, if any, pursuant to this section, this section does not apply.\nThe commissioner shall certify an employee organization as exclusive representative for an appropriate unit established under section 179A.101 upon a petition filed with the commissioner by the organization within 30 days of the effective date of the judicial district coming under section 480.181, subdivision 1, paragraph (b), demonstrating that the petitioner is certified pursuant to section 179A.12 as the exclusive representative of a majority of the employees included within the unit established by section 179A.101 as of that effective date. Two or more employee organizations that represent the employees in a unit established by section 179A.101 may petition jointly under this subdivision, provided that any organization may withdraw from a joint certification in favor of the remaining organizations on 30 days' notice to the remaining organizations, the employer, and the commissioner, without affecting the rights and obligations of the remaining organizations or the employer. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(a) If no exclusive representative is certified under subdivision 2, the commissioner shall certify an employee organization as exclusive representative for an appropriate unit established under section 179A.101 upon a petition filed by the organization within the time period provided in subdivision 2 demonstrating that the petitioner is certified under section 179A.12 as the exclusive representative of fewer than a majority of the employees included within the unit established by section 179A.101, if no other employee organization so certified has filed a petition within the time period provided in subdivision 2 and a majority of the employees in the unit established by section 179A.101 are represented by employee organizations under section 179A.12 on the effective date of the judicial district coming under section 480.181, subdivision 1, paragraph (b). Two or more employee organizations, each of which represents employees included in the unit established by section 179A.101, may petition jointly under this paragraph, provided that any organization may withdraw from a joint certification in favor of the remaining organizations on 30 days' notice to the remaining organizations, the employer, and the commissioner without affecting the rights and obligations of the remaining organizations or the employer. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(b) If no exclusive representative is certified under subdivision 2 or paragraph (a), and an employee organization petitions the commissioner within 90 days of the effective date of the judicial district coming under section 480.181, subdivision 1, paragraph (b), demonstrating that a majority of the employees included within a unit established by section 179A.101 wish to be represented by the petitioner, where this majority is evidenced by current dues deduction rights, signed statements from court employees in counties within the district that are not currently represented by any employee organization plainly indicating that the signatories wish to be represented for collective bargaining purposes by the petitioner rather than by any other organization, or a combination of those, the commissioner shall certify the petitioner as exclusive representative of the employees in the unit established by section 179A.101. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(c) If no exclusive representative is certified under subdivision 2 or paragraph (a) or (b), and an employee organization petitions the commissioner subsequent to the effective date of the judicial district coming under section 480.181, subdivision 1, paragraph (b), demonstrating that at least 30 percent of the employees included within a unit established by section 179A.101 wish to be represented by the petitioner, where this 30 percent is evidenced by current dues deduction rights, signed statements from court employees in counties within the district that are not currently represented by any employee organization plainly indicating that the signatories wish to be represented for collective bargaining purposes by the petitioner rather than by any other organization, or a combination of those, the commissioner shall conduct a secret ballot election to determine the wishes of the majority. The election must be conducted within 45 days of receipt or final decision on any petitions filed pursuant to subdivision 2, whichever is later. The election is governed by section 179A.12, where not inconsistent with other provisions of this section.\nThe commissioner may not consider a petition for decertification of an exclusive representative certified under this section for one year after certification. After that time a petition must be considered under the provisions of section 179A.12.\nThe terms and conditions of collective bargaining agreements covering judicial district employees in districts that come under section 480.181, subdivision 1, paragraph (b), remain in effect until a successor agreement becomes effective.\n(a) Notwithstanding the provisions of section 179A.101, the exclusive representatives of units of court employees certified prior to the effective date of the judicial district coming under section 480.181, subdivision 1, paragraph (b), remain responsible for administration of their contracts and for other contractual duties and have the right to dues and fair share fee deduction and other contractual privileges and rights until a contract is agreed upon with the state court administrator for a new unit established under section 179A.101. Exclusive representatives of court employees certified after the effective date of Laws 1999, chapter 216, article 7, section 10, in the judicial district are immediately upon certification responsible for bargaining on behalf of employees within the unit. They are also responsible for administering grievances arising under previous contracts covering employees included within the unit which remain unresolved upon agreement with the state court administrator on a contract for a new unit established under section 179A.101. Where the employer does not object, these responsibilities may be varied by agreement between the outgoing and incoming exclusive representatives. All other rights and duties of representation begin on July 1 of the year in which the state assumes the funding of court administration in the judicial district, except that exclusive representatives certified after the effective date of Laws 1999, chapter 216, article 7, section 10, shall immediately, upon certification, have the right to all employer information and all forms of access to employees within the bargaining unit which would be permitted to the current contract holder, including the rights in section 179A.07, subdivision 6. This section does not affect an existing collective bargaining contract. Incoming exclusive representatives of court employees from judicial districts that come under section 480.181, subdivision 1, paragraph (b), are immediately, upon certification, responsible for bargaining on behalf of all previously unrepresented employees assigned to their units. All other rights and duties of exclusive representatives begin on July 1 of the year in which the state assumes the funding of court administration in the judicial district.\n(b) Nothing in Laws 2001, First Special Session chapter 5, or Laws 1999, chapter 216, article 7, sections 3 to 15, prevents an exclusive representative certified after the effective dates of those provisions from assessing fair share or dues deductions immediately upon certification for employees in a unit established under section 179A.101 if the employees were unrepresented for collective bargaining purposes before that certification.",
	"repealed": false
}