{
	"id": "160.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.14",
	"title": "160.14 MARKING BOUNDARIES OF HIGHWAYS.",
	"text": "Road authorities may place and shall thereafter preserve and maintain suitable monuments or other marking devices in such manner as to clearly indicate the boundary lines of highways. The commissioner is authorized to engage the services of registered land surveyors to perform land survey work as required for location or reestablishment of section corners, establishment of the boundary of highway right-of-way together with boundary monumentation. If the commissioner employs and engages a registered land surveyor for such work the land surveyor shall be in responsible charge of the work performed by the surveyor's employees in connection with the assignment. The location of the boundary markings may be described by course distance and bearing or delineated in the same manner on a plat or map showing location of said marking devices and filed with the county recorder or registrar of titles in the county where the highways are located.\nThe road authority shall serve written notice of such markings upon abutting land owners within 30 days after the placement of the marking devices. Unless written objections are served and filed within one year thereafter, as hereinafter provided, the boundary lines of the highways as marked shall be final and conclusive.\nWithin one year after the notice, any abutting owner may serve upon the road authority signed written objections to the highway boundaries as marked, specifying wherein the owner believes the boundaries as marked to be in error. A copy thereof executed in accordance with section 507.24 shall be filed with the county recorder in the county where the highway is located. The service and filing of the objections shall preserve the rights of the abutting owner in and to the land in controversy until the boundaries of the highway are judicially determined or until agreed to by the abutting owner and the road authority.\nWithin 12 months after the service and filing of the objections, the road authority or the abutting owner shall serve and file a note of issue with the court administrator of the district court in the county in which the land is located. The court shall determine the correctness of the placing of the monuments or marking devices. Except as herein otherwise provided the procedure shall be governed by the rules governing civil actions. When the matters shall have been finally determined, the location of such monuments or markers shall be in accordance with the court decree and the determination of the location shall be final. A copy of the court decree shall be filed by the road authority with the county recorder.",
	"repealed": false
}