{
	"id": "142G.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.36",
	"title": "142G.36 VENDOR PAYMENT OF SHELTER COSTS AND UTILITIES.",
	"text": "(a) When a county is required to provide assistance to a participant in vendor form for shelter costs and utilities under this chapter or chapter 256D, the cost of utilities for a given family may be assumed to be:\n(1) the average of the actual monthly cost of utilities for that family for the prior 12 months at the family's current residence, if applicable;\n(2) the monthly plan amount, if any, set by the local utilities for that family at the family's current residence; or\n(3) the estimated monthly utility costs for the dwelling in which the family currently resides.\n(b) For purposes of this section, \"utility\" means any of the following: municipal water and sewer service; electric, gas, or heating fuel service; or wood, if that is the heating source.\n(c) In any instance where a vendor payment for rent is directed to a landlord not legally entitled to the payment, the county social services agency shall immediately institute proceedings to collect the amount of the vendored rent payment, which shall be considered a debt under section 270A.03, subdivision 5.\n(a) When a county agency is required to provide assistance to a participant in vendor payment form for shelter costs or utilities under subdivision 1, and the participant does not give the agency the information needed to pay the vendor, the county agency shall notify the participant of the intent to terminate assistance by mail at least ten days before the effective date of the adverse action.\n(b) The notice of action shall include a request for information about:\n(1) the amount of the participant's shelter costs or utilities;\n(2) the due date of the shelter costs or utilities; and\n(3) the name and address of the landlord, contract for deed holder, mortgage company, and utility vendor.\n(c) If the participant fails to provide the requested information by the effective date of the adverse action, the county must terminate the MFIP grant. If the applicant or participant verifies they do not have shelter costs or utility obligations, the county shall not terminate assistance if the assistance unit is otherwise eligible.\nThe county agency shall discontinue vendor payments for shelter costs imposed under this chapter when the vendor payment interferes with the participant's right to withhold rent due to a dispute with the participant's landlord in accordance with federal, state, or local housing laws.",
	"repealed": false
}