{
	"id": "123B.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.52",
	"title": "123B.52 CONTRACTS.",
	"text": "A contract for work or labor, or for the purchase of furniture, fixtures, or other property, except books registered under the copyright laws and information systems software, or for the construction or repair of school houses, the estimated cost or value of which shall exceed that specified in section 471.345, subdivision 3, must not be made by the school board without first advertising for bids or proposals by two weeks' published notice in the official newspaper. This notice must state the time and place of receiving bids and contain a brief description of the subject matter.\nAdditional publication in the official newspaper or elsewhere may be made as the board shall deem necessary.\nAfter taking into consideration conformity with the specifications, terms of delivery, and other conditions imposed in the call for bids, every such contract for which a call for bids has been issued must be awarded to the lowest responsible bidder, be duly executed in writing, and be otherwise conditioned as required by law. The person to whom the contract is awarded shall give a sufficient bond to the board for its faithful performance. Notwithstanding section 574.26 or any other law to the contrary, on a contract limited to the purchase of a finished tangible product, a board may require, at its discretion, a performance bond of a contractor in the amount the board considers necessary. A record must be kept of all bids, with names of bidders and amount of bids, and with the successful bid indicated thereon. A bid containing an alteration or erasure of any price contained in the bid which is used in determining the lowest responsible bid must be rejected unless the alteration or erasure is corrected as provided in this section. An alteration or erasure may be crossed out and the correction thereof printed in ink or typewritten adjacent thereto and initialed in ink by the person signing the bid. In the case of identical low bids from two or more bidders, the board may, at its discretion, utilize negotiated procurement methods with the tied low bidders for that particular transaction, so long as the price paid does not exceed the low tied bid price. In the case where only a single bid is received, the board may, at its discretion, negotiate a mutually agreeable contract with the bidder so long as the price paid does not exceed the original bid. If no satisfactory bid is received, the board may readvertise. Standard requirement price contracts established for supplies or services to be purchased by the district must be established by competitive bids. Such standard requirement price contracts may contain escalation clauses and may provide for a negotiated price increase or decrease based upon a demonstrable industrywide or regional increase or decrease in the vendor's costs. Either party to the contract may request that the other party demonstrate such increase or decrease. The term of such contracts must not exceed two years with an option on the part of the district to renew for an additional two years, except as provided in subdivision 3 or 7. Contracts for the purchase of perishable food items, except milk for school lunches and vocational training programs, in any amount may be made by direct negotiation by obtaining two or more written quotations for the purchase or sale, when possible, without advertising for bids or otherwise complying with the requirements of this section or section 471.345, subdivision 3. All quotations obtained shall be kept on file for a period of at least one year after receipt.\nEvery contract made without compliance with the provisions of this section shall be void. Except in the case of the destruction of buildings or injury thereto, where the public interest would suffer by delay, contracts for repairs may be made without advertising for bids.\nA project labor agreement is a hiring agreement that establishes wages, uniform work schedules, and rules for dispute resolution to manage construction projects that generally require, among other things, payment of union dues or fees to a labor organization or membership in or affiliation with a labor organization. A school board must adopt at a public meeting a written resolution authorizing a project labor agreement to construct or repair a facility through a contract or bid. The board must publish in the official newspaper of the district notice of the meeting at least 30 days in advance.\nAs an alternative to the procurement method described in subdivision 1, a contract for construction, building, alteration, improvement, or repair work may be awarded to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nThe board may authorize its superintendent or business manager to lease, purchase, and contract for goods and services within the budget as approved by the board. Any transaction in an amount exceeding the minimum amount for which bids are required must first be specifically authorized by the board and must fulfill all other applicable requirements in subdivision 1.\nNotwithstanding the provisions of subdivision 1 or section 471.345, a contract for the transportation of school children, or a contract for the purchase of petroleum heating fuel or fuel for vehicles may be made by direct negotiation, by obtaining two or more written quotations for the service when possible, or upon sealed bids. At least 30 days before awarding a directly negotiated contract, the district must, by published notice, request quotations for the service to be provided. All quotations obtained must be kept on file for a period of at least one year after receipt. If a contract is made by direct negotiation, all quotations must be public information. If a contract is made upon sealed bids, the procedure for advertising and awarding bids shall conform to the provisions of subdivision 1 except as otherwise provided in this subdivision. The term of such contracts must not exceed ten years.\nNotwithstanding the provisions of subdivision 1 or section 574.26, a performance bond must be required of a contractor on a contract for the transportation of school children only when deemed necessary by and at the discretion of the board. Such a performance bond must be in the amount determined by the board.\nNotwithstanding any law to the contrary, districts may, without an election, enter into contracts extending beyond the end of the fiscal year to pay the costs of removal or encapsulation of asbestos or cleanup of polychlorinated biphenyls found in school buildings or on school property.\nMembers of the board are authorized to contract with, to work for, and furnish supplies to the district subject to the provisions of section 471.87.\n(a) Notwithstanding section 471.345, governing school district contracts made upon sealed bid or otherwise complying with the requirements for competitive bidding, other provisions of this section governing school district contracts, or other law to the contrary, a school district under this subdivision may dispose of school computers, including a tablet device.\n(b) A school district may dispose of a surplus school computer and related equipment if the district disposes of the surplus property by conveying the property and title to:\n(1) another school district;\n(2) the state Department of Corrections;\n(3) the Board of Trustees of the Minnesota State Colleges and Universities;\n(4) the family of a student residing in the district whose total family income meets the federal definition of poverty; or\n(5) a charitable organization under section 501(c)(3) of the Internal Revenue Code that is registered with the attorney general's office for educational use.\n(c) If surplus school computers are not disposed of under paragraph (b), upon adoption of a written resolution of the school board, when updating or replacing school computers, including tablet devices, used primarily by students, a school district may sell or give used computers or tablets to qualifying students at the price specified in the written resolution. A student is eligible to apply to the school board for a computer or tablet under this subdivision if the student is currently enrolled in the school and intends to enroll in the school in the year following the receipt of the computer or tablet. If more students apply for computers or tablets than are available, the school must first qualify students whose families are eligible for free or reduced-price meals, and then dispose of the remaining computers or tablets by lottery.\nA contract between a school board and a food service management company that complies with Code of Federal Regulations, title 7, section 210.16, may be renewed annually after its initial term for not more than four additional years.",
	"repealed": false
}