{
	"id": "161.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.34",
	"title": "161.34 CONTRACT CLAIMS AGAINST STATE.",
	"text": "When a controversy arises out of any contract for the construction or repair of state trunk highways entered into by the commissioner or by the commissioner's authority, in respect to which controversy a party to the contract would be entitled to redress against the state, either in a court of law or equity if the state were suable, and when no claim against the state for the same redress has heretofore been made, the state hereby waives immunity from suit in connection with such controversy and confers jurisdiction on the district courts of the state to hear and try the controversy in the manner provided for the trial of causes in the district courts. Only a party to the contract shall have the right to bring action against the state.\nNo such action shall be maintained unless commenced within 90 days after the plaintiff has been furnished by the state with a final estimate under the plaintiff's contract, or, at the election of the plaintiff, within six months after the work provided for under that contract shall have been in all things completed.\nThe action shall be brought at the election of the plaintiff in the District Court of Ramsey County, or in the district court of the county where a major portion of the contract is performed, or in the district court of the county in which the plaintiff resides, or, if there be several plaintiffs residing in different counties, then in the district court of the county of the residence of any one of them. The action shall be commenced by filing a complaint with the court administrator and serving summons and copy of the complaint upon the attorney general of the state at the State Capitol. The state shall have 40 days from the date of such service within which to serve an answer upon the plaintiff, and thereafter the case shall proceed in the same manner as other actions at law in the court.\nAn appeal from any final order of judgment in the action shall lie as in other civil cases.",
	"repealed": false
}