{
	"id": "484.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.79",
	"title": "484.79 FAMILY VIOLENCE COORDINATING COUNCILS.",
	"text": "A judicial district may establish a Family Violence Coordinating Council for the purpose of promoting innovative efforts to deal with family violence issues. A coordinating council shall establish and promote interdisciplinary programs and initiatives to coordinate public and private legal and social services and law enforcement, prosecutorial, and judicial activities.\nThe chief judge shall appoint the members of a Family Violence Coordinating Council. Members must include representatives of the following groups:\n(1) judges, court administrators, and probation authorities;\n(2) domestic abuse advocates and others who provide social services to adult and child victims of domestic abuse and perpetrators of domestic abuse;\n(3) health care and mental health care providers;\n(4) law enforcement and prosecutors;\n(5) public defenders and legal aid;\n(6) educators and child protection workers; and\n(7) public officials and other public organizations.\nA Family Violence Coordinating Council shall develop a plan for coordinating activities of its membership relating to family violence issues and improving activities and services, including:\n(1) interdisciplinary training and systemic approaches to family violence issues;\n(2) identification of current weaknesses in the system and areas where additional resources are needed, and ways to improve those components;\n(3) promoting public and private partnerships in the delivery of services and the use of volunteer services;\n(4) identification of differences in approaches and needs in different demographic populations;\n(5) developing protocols for investigation and prosecution of domestic abuse, including issues related to victim cooperation and interviewing and investigative techniques;\n(6) coordination of city and county prosecutorial efforts, including standards for referral of cases, coordinated prosecutions, and cross-deputization of prosecutors;\n(7) evaluation of dismissal, conviction, and sentencing levels and practices and relationship to reported incidents of domestic abuse, cases investigated and prosecuted, and severity of abuse; and\n(8) coordination of family, juvenile, and criminal court proceedings involving family violence issues.\nA family violence coordinating council shall develop a system for evaluating the effectiveness of its initiatives and programs in improving the coordination of activities and delivery of services and shall focus on identifiable goals and outcomes. An evaluation must include data components as well as input from individuals involved in family violence activities and services, victims, and perpetrators.",
	"repealed": false
}