{
	"id": "62V.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.13",
	"title": "62V.13 EASY ENROLLMENT HEALTH INSURANCE OUTREACH PROGRAM.",
	"text": "The board, in cooperation with the commissioner of revenue, must establish the easy enrollment health insurance outreach program to:\n(1) reduce the number of uninsured Minnesotans and increase access to affordable health insurance coverage;\n(2) allow the commissioner of revenue to provide return information, at the request of the taxpayer, to MNsure to provide the taxpayer with information about the taxpayer's potential eligibility for financial assistance and health insurance enrollment options through MNsure;\n(3) allow MNsure to estimate taxpayer potential eligibility for financial assistance for health insurance coverage; and\n(4) allow MNsure to conduct targeted outreach to assist interested taxpayer households in applying for and enrolling in affordable health insurance options through MNsure, including connecting interested taxpayer households with a navigator or broker for free enrollment assistance.\nUpon receipt of and based on return information received from the commissioner of revenue under section 270B.14, subdivision 22, MNsure may make a projected assessment on whether the interested taxpayer's household may qualify for a financial assistance program for health insurance coverage.\n(a) MNsure must provide a written letter of the projected assessment under subdivision 2 to a taxpayer who indicates to the commissioner of revenue that the taxpayer is interested in obtaining information on access to health insurance.\n(b) MNsure must allow a special enrollment period for taxpayers who receive the outreach letter in paragraph (a) and are determined eligible to enroll in a qualified health plan through MNsure. The triggering event for the special enrollment period is the day the outreach letter under this subdivision is mailed to the taxpayer. An eligible individual, and their dependents, have 65 days from the triggering event to select a qualifying health plan and coverage for the qualifying health plan is effective the first day of the month after plan selection.\n(c) Taxpayers who have a member of the taxpayer's household currently enrolled in a qualified health plan through MNsure are not eligible for the special enrollment under paragraph (b).\n(d) MNsure must provide information to the general public about the easy enrollment health insurance outreach program and the special enrollment period described in this subdivision.\n(a) Projected eligibility assessments for financial assistance under this section are not appealable.\n(b) Qualification for the special enrollment period under this section is appealable to MNsure under this chapter and Minnesota Rules, chapter 7700.",
	"repealed": false
}