{
	"id": "253B.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.18",
	"title": "253B.18 PERSONS WHO ARE MENTALLY ILL AND DANGEROUS TO THE PUBLIC.",
	"text": "(a) Upon the filing of a petition alleging that a proposed patient is a person who has a mental illness and is dangerous to the public, the court shall hear the petition as provided in sections 253B.07 and 253B.08. If the court finds by clear and convincing evidence that the proposed patient is a person who has a mental illness and is dangerous to the public, it shall commit the person to a secure treatment facility or to a treatment facility or state-operated treatment program willing to accept the patient under commitment. The court shall commit the patient to a secure treatment facility unless the patient or others establish by clear and convincing evidence that a less restrictive state-operated treatment program or treatment facility is available that is consistent with the patient's treatment needs and the requirements of public safety. In any case where the petition was filed immediately following the acquittal of the proposed patient for a crime against the person pursuant to a verdict of not guilty by reason of mental illness, the verdict constitutes evidence that the proposed patient is a person who has a mental illness and is dangerous to the public within the meaning of this section. The proposed patient has the burden of going forward in the presentation of evidence. The standard of proof remains as required by this chapter. Upon commitment, admission procedures shall be carried out pursuant to section 253B.10.\n(b) Once a patient is admitted to a treatment facility or state-operated treatment program pursuant to a commitment under this subdivision, treatment must begin regardless of whether a review hearing will be held under subdivision 2.\n(a) A written treatment report shall be filed by the treatment facility or state-operated treatment program with the committing court within 60 days after commitment. If the person is in the custody of the commissioner of corrections when the initial commitment is ordered under subdivision 1, the written treatment report must be filed within 60 days after the person is admitted to the state-operated treatment program or treatment facility. The court shall hold a hearing to make a final determination as to whether the patient should remain committed as a person who has a mental illness and is dangerous to the public. The hearing shall be held within the earlier of 14 days of the court's receipt of the written treatment report, or within 90 days of the date of initial commitment or admission, unless otherwise agreed by the parties.\n(b) The court may, with agreement of the county attorney and the patient's attorney:\n(1) waive the review hearing under this subdivision and immediately order an indeterminate commitment under subdivision 3; or\n(2) continue the review hearing for up to one year.\n(c) If the court finds that the patient should be committed as a person who poses a risk of harm due to mental illness, but not as a person who has a mental illness and is dangerous to the public, the court may commit the patient as a person who poses a risk of harm due to mental illness and the court shall deem the patient not to be dangerous to the public for the purposes of subdivisions 4a to 15. Failure of the treatment facility or state-operated treatment program to provide the required treatment report at the end of the 60-day period shall not result in automatic discharge of the patient.\nIf the court finds at the final determination hearing held pursuant to subdivision 2 that the patient continues to be a person who has a mental illness and is dangerous to the public, then the court shall order commitment of the proposed patient for an indeterminate period of time. After a final determination that a patient is a person who has a mental illness and is dangerous to the public, the patient shall be transferred, provisionally discharged or discharged, only as provided in this section.\n[Repealed, 1997 c 217 art 1 s 118]\nA patient who has been committed as a person who has a mental illness and is dangerous to the public and who is confined at a secure treatment facility or has been transferred out of a secure treatment facility according to section 253B.18, subdivision 6, shall not be released on a pass unless the pass is part of a pass plan that has been approved by the medical director of the secure treatment facility. The pass plan must have a specific therapeutic purpose consistent with the treatment plan, must be established for a specific period of time, and must have specific levels of liberty delineated. The county case manager must be invited to participate in the development of the pass plan. At least ten days prior to a determination on the plan, the medical director of the secure treatment facility shall notify the designated agency, the committing court, the county attorney of the county of commitment, an interested person, the local law enforcement agency where the facility is located, the county attorney and the local law enforcement agency in the location where the pass is to occur, the petitioner, and the petitioner's counsel of the plan, the nature of the passes proposed, and their right to object to the plan. If any notified person objects prior to the proposed date of implementation, the person shall have an opportunity to appear, personally or in writing, before the medical director of the secure treatment facility, within ten days of the objection, to present grounds for opposing the plan. The pass plan shall not be implemented until the objecting person has been furnished that opportunity. Nothing in this subdivision shall be construed to give a patient an affirmative right to a pass plan.\n(a) The following patients committed to a secure treatment facility shall not be placed on pass-eligible status unless that status has been approved by the medical director of the secure treatment facility:\n(1) a patient who has been committed as a person who has a mental illness and is dangerous to the public and who:\n(i) was found incompetent to proceed to trial for a felony or was found not guilty by reason of mental illness of a felony immediately prior to the filing of the commitment petition;\n(ii) was convicted of a felony immediately prior to or during commitment as a person who has a mental illness and is dangerous to the public; or\n(iii) is subject to a commitment to the commissioner of corrections; and\n(2) a patient who has been committed as a psychopathic personality, a sexually psychopathic personality, or a sexually dangerous person.\n(b) At least ten days prior to a determination on the status, the medical director of the secure treatment facility shall notify the committing court, the county attorney of the county of commitment, the designated agency, an interested person, the petitioner, and the petitioner's counsel of the proposed status, and their right to request review by the special review board. If within ten days of receiving notice any notified person requests review by filing a notice of objection with the executive board and the head of the secure treatment facility, a hearing shall be held before the special review board. The proposed status shall not be implemented unless it receives a favorable recommendation by a majority of the special review board and approval by the executive board. The order of the executive board is appealable as provided in section 253B.19.\n(c) Nothing in this subdivision shall be construed to give a patient an affirmative right to seek pass-eligible status from the special review board.\n(a) The executive board shall establish one or more panels of a special review board. The special review board shall consist of three members experienced in the field of mental illness. One member of each special review board panel shall be a psychiatrist or a doctoral level psychologist with forensic experience and one member shall be an attorney. No member shall be affiliated with Direct Care and Treatment. The special review board shall meet at least every six months and at the call of the executive board. It shall hear and consider all petitions for a reduction in custody or to appeal a revocation of provisional discharge. Patients may be transferred by the executive board between secure treatment facilities without a special review board hearing.\nMembers of the special review board shall receive compensation and reimbursement for expenses as established by the executive board.\n(b) For purposes of this section, \"reduction in custody\" means transfer from a secure treatment facility, discharge, and provisional discharge.\n(c) The special review board must review each denied petition under subdivision 5 for barriers and obstacles preventing the patient from progressing in treatment. Based on the cases before the special review board in the previous year, the special review board shall provide to the executive board an annual summation of the barriers to treatment progress, and recommendations to achieve the common goal of making progress in treatment.\n(d) A petition filed by a person committed as a person who has a mental illness and is dangerous to the public under this section must be heard as provided in subdivision 5 and, as applicable, subdivision 13. A petition filed by a person committed as a sexual psychopathic personality or as a sexually dangerous person under chapter 253D, or committed as both a person who has a mental illness and is dangerous to the public under this section and as a sexual psychopathic personality or as a sexually dangerous person must be heard as provided in section 253D.27.\n(a) A petition for a reduction in custody or revocation of provisional discharge shall be filed with the executive board and may be filed by the patient or by the head of the treatment facility or state-operated treatment program to which the person was committed or has been transferred. A patient may not petition the special review board for six months following commitment under subdivision 3 or following the final disposition of any previous petition and subsequent appeal by the patient. The head of the state-operated treatment program or head of the treatment facility must schedule a hearing before the special review board for any patient who has not appeared before the special review board in the previous three years, and schedule a hearing at least every three years thereafter. The medical director of the secure treatment facility may petition at any time.\n(b) Fourteen days prior to the hearing, the committing court, the county attorney of the county of commitment, the designated agency, interested person, the petitioner, and the petitioner's counsel shall be given written notice by the executive board of the time and place of the hearing before the special review board. Only those entitled to statutory notice of the hearing or those administratively required to attend may be present at the hearing. The patient may designate interested persons to receive notice by providing the names and addresses to the executive board at least 21 days before the hearing. The special review board shall provide the executive board with written findings of fact and recommendations within 21 days of the hearing. The executive board shall issue an order no later than 14 days after receiving the recommendation of the special review board. A copy of the order shall be mailed to every person entitled to statutory notice of the hearing within five days after the order is signed. No order by the executive board shall be effective sooner than 30 days after the order is signed, unless the county attorney, the patient, and the executive board agree that it may become effective sooner.\n(c) The special review board shall hold a hearing on each petition prior to making its recommendation to the executive board. The special review board proceedings are not contested cases as defined in chapter 14. Any person or agency receiving notice that submits documentary evidence to the special review board prior to the hearing shall also provide copies to the patient, the patient's counsel, the county attorney of the county of commitment, the case manager, and the executive board.\n(d) Prior to the final decision by the executive board, the special review board may be reconvened to consider events or circumstances that occurred subsequent to the hearing.\n(e) In making their recommendations and order, the special review board and executive board must consider any statements received from victims under subdivision 5a.\n(a) As used in this subdivision:\n(1) \"crime\" has the meaning given to \"violent crime\" in section 609.1095, and includes criminal sexual conduct in the fifth degree and offenses within the definition of \"crime against the person\" in section 253B.02, subdivision 4e, and also includes offenses listed in section 253D.02, subdivision 8, paragraph (b), regardless of whether they are sexually motivated;\n(2) \"victim\" means a person who has incurred loss or harm as a result of a crime the behavior for which forms the basis for a commitment under this section or chapter 253D, and includes the family members, guardian, conservator, or custodian of a minor, incompetent, incapacitated, or deceased person; and\n(3) \"convicted\" and \"conviction\" have the meanings given in section 609.02, subdivision 5, and also include juvenile court adjudications, findings under Minnesota Rules of Criminal Procedure, rule 20.02, that the elements of a crime have been proved, and findings in commitment cases under this section or chapter 253D that an act or acts constituting a crime occurred or were part of their course of harmful sexual conduct.\n(b) A county attorney who files a petition to commit a person under this section or chapter 253D shall make a reasonable effort to provide prompt notice of filing the petition to any victim of a crime for which the person was convicted. In addition, the county attorney shall make a reasonable effort to promptly notify the victim of the resolution of the petition and the process for requesting notification of an individual's change in status as provided in paragraph (c).\n(c) A victim may request notification of an individual's discharge or release as provided in paragraph (d) by submitting a written request for notification to the executive director of the facility in which the individual is confined. The Department of Corrections or a county attorney who receives a request for notification from a victim under this section shall promptly forward the request to the executive director of the treatment facility in which the individual is confined.\n(d) Before provisionally discharging, discharging, granting pass-eligible status, approving a pass plan, or otherwise permanently or temporarily releasing a person committed under this section from a state-operated treatment program or treatment facility, the head of the state-operated treatment program or head of the treatment facility shall make a reasonable effort to notify any victim of a crime for which the person was convicted that the person may be discharged or released and that the victim has a right to submit a written statement regarding decisions of the medical director of the secure treatment facility, special review board, or executive board with respect to the person. To the extent possible, the notice must be provided at least 14 days before any special review board hearing or before a determination on a pass plan. Notwithstanding section 611A.06, subdivision 4, the executive board shall provide the judicial appeal panel with victim information in order to comply with the provisions of this section. The judicial appeal panel shall ensure that the data on victims remains private as provided for in section 611A.06, subdivision 4. These notices shall only be provided to victims who have submitted a written request for notification as provided in paragraph (c).\n(e) The rights under this subdivision are in addition to rights available to a victim under chapter 611A. This provision does not give a victim all the rights of a \"notified person\" or a person \"entitled to statutory notice\" under subdivision 4a, 4b, or 5 or section 253D.14.\n(a) A patient who is a person who has a mental illness and is dangerous to the public shall not be transferred out of a secure treatment facility unless it appears to the satisfaction of the executive board, after a hearing and favorable recommendation by a majority of the special review board, that the transfer is appropriate. Transfer may be to another state-operated treatment program. In those instances where a commitment also exists to the Department of Corrections, transfer may be to a facility designated by the commissioner of corrections.\n(b) The following factors must be considered in determining whether a transfer is appropriate:\n(1) the person's clinical progress and present treatment needs;\n(2) the need for security to accomplish continuing treatment;\n(3) the need for continued institutionalization;\n(4) which facility can best meet the person's needs; and\n(5) whether transfer can be accomplished with a reasonable degree of safety for the public.\n(c) If a committed person has been transferred out of a secure treatment facility pursuant to this subdivision, that committed person may voluntarily return to a secure treatment facility for a period of up to 60 days with the consent of the head of the treatment facility.\n(d) If the committed person is not returned to the original, nonsecure transfer facility within 60 days of being readmitted to a secure treatment facility, the transfer is revoked and the committed person must remain in a secure treatment facility. The committed person must immediately be notified in writing of the revocation.\n(e) Within 15 days of receiving notice of the revocation, the committed person may petition the special review board for a review of the revocation. The special review board shall review the circumstances of the revocation and shall recommend to the commissioner whether or not the revocation should be upheld. The special review board may also recommend a new transfer at the time of the revocation hearing.\n(f) No action by the special review board is required if the transfer has not been revoked and the committed person is returned to the original, nonsecure transfer facility with no substantive change to the conditions of the transfer ordered under this subdivision.\n(g) The head of the treatment facility may revoke a transfer made under this subdivision and require a committed person to return to a secure treatment facility if:\n(1) remaining in a nonsecure setting does not provide a reasonable degree of safety to the committed person or others; or\n(2) the committed person has regressed clinically and the facility to which the committed person was transferred does not meet the committed person's needs.\n(h) Upon the revocation of the transfer, the committed person must be immediately returned to a secure treatment facility. A report documenting the reasons for revocation must be issued by the head of the treatment facility within seven days after the committed person is returned to the secure treatment facility. Advance notice to the committed person of the revocation is not required.\n(i) The committed person must be provided a copy of the revocation report and informed, orally and in writing, of the rights of a committed person under this section. The revocation report must be served upon the committed person, the committed person's counsel, and the designated agency. The report must outline the specific reasons for the revocation, including but not limited to the specific facts upon which the revocation is based.\n(j) If a committed person's transfer is revoked, the committed person may re-petition for transfer according to subdivision 5.\n(k) A committed person aggrieved by a transfer revocation decision may petition the special review board within seven business days after receipt of the revocation report for a review of the revocation. The matter must be scheduled within 30 days. The special review board shall review the circumstances leading to the revocation and, after considering the factors in paragraph (b), shall recommend to the commissioner whether or not the revocation shall be upheld. The special review board may also recommend a new transfer out of a secure treatment facility at the time of the revocation hearing.\n(a) A patient who is a person who has a mental illness and is dangerous to the public shall not be provisionally discharged unless it appears to the satisfaction of the executive board, after a hearing and a favorable recommendation by a majority of the special review board, that the patient is capable of making an acceptable adjustment to open society.\n(b) The following factors are to be considered in determining whether a provisional discharge shall be recommended: (1) whether the patient's course of hospitalization and present mental status indicate there is no longer a need for treatment and supervision in the patient's current treatment setting; and (2) whether the conditions of the provisional discharge plan will provide a reasonable degree of protection to the public and will enable the patient to adjust successfully to the community.\nA provisional discharge plan shall be developed, implemented, and monitored by the designated agency in conjunction with the patient, the treatment facility or state-operated treatment program to which the person is committed, and other appropriate persons. The designated agency shall, at least quarterly, review the provisional discharge plan with the patient and submit a written report to the facility or program concerning the patient's status and compliance with each term of the provisional discharge plan.\nA provisional discharge pursuant to this section shall not automatically terminate. A full discharge shall occur only as provided in subdivision 15. The executive board shall notify the patient that the terms of a provisional discharge continue unless the patient requests and is granted a change in the conditions of provisional discharge or unless the patient petitions the special review board for a full discharge and the discharge is granted.\n(a) The head of the treatment facility or state-operated treatment program from which the person was provisionally discharged may revoke a provisional discharge if any of the following grounds exist:\n(i) the patient has departed from the conditions of the provisional discharge plan;\n(ii) the patient is exhibiting signs of a mental illness which may require in-hospital evaluation or treatment; or\n(iii) the patient is exhibiting behavior which may be dangerous to self or others.\n(b) Revocation shall be commenced by a notice of intent to revoke provisional discharge, which shall be served upon the patient, patient's counsel, and the designated agency. The notice shall set forth the grounds upon which the intention to revoke is based, and shall inform the patient of the rights of a patient under this chapter.\n(c) In all nonemergency situations, prior to revoking a provisional discharge, the head of the facility or program shall obtain a revocation report from the designated agency outlining the specific reasons for recommending the revocation, including but not limited to the specific facts upon which the revocation recommendation is based.\n(d) The patient must be provided a copy of the revocation report and informed orally and in writing of the rights of a patient under this section.\nIf an emergency exists, the head of the treatment facility or state-operated treatment program may revoke the provisional discharge and, either orally or in writing, order that the patient be immediately returned to the facility or program. In emergency cases, a revocation report shall be submitted by the designated agency within seven days after the patient is returned to the facility or program.\nAfter revocation of a provisional discharge or if the patient is absent without authorization, the head of the treatment facility or state-operated treatment program may request the patient to return to the facility or program voluntarily. The head of the treatment facility or state-operated treatment program may request a health officer or a peace officer to return the patient to the facility or program. If a voluntary return is not arranged, the head of the treatment facility or state-operated treatment program shall inform the committing court of the revocation or absence and the court shall direct a health or peace officer in the county where the patient is located to return the patient to the facility or program or to another state-operated treatment program or to another treatment facility willing to accept the patient. The expense of returning the patient to a state-operated treatment program shall be paid by the executive board unless paid by the patient or other persons on the patient's behalf.\nAny patient aggrieved by a revocation decision or any interested person may petition the special review board within seven days, exclusive of Saturdays, Sundays, and legal holidays, after receipt of the revocation report for a review of the revocation. The special review board shall schedule the matter within 30 days. The special review board shall review the circumstances leading to the revocation and shall recommend to the executive board whether or not the revocation shall be upheld. The special review board may also recommend a new provisional discharge at the time of a revocation hearing.\n(a) With the consent of the head of the treatment facility or state-operated treatment program, a patient may voluntarily return from provisional discharge for a period of up to 30 days, or up to 60 days with the consent of the designated agency. If the patient is not returned to provisional discharge status within 60 days, the provisional discharge is revoked. Within 15 days of receiving notice of the change in status, the patient may request a review of the matter before the special review board. The special review board may recommend a return to a provisional discharge status.\n(b) The treatment facility or state-operated treatment program is not required to petition for a further review by the special review board unless the patient's return to the community results in substantive change to the existing provisional discharge plan. All the terms and conditions of the provisional discharge order shall remain unchanged if the patient is released again.\n(a) A patient who is a person who has a mental illness and is dangerous to the public shall not be discharged unless it appears to the satisfaction of the executive board, after a hearing and a favorable recommendation by a majority of the special review board, that the patient is capable of making an acceptable adjustment to open society, is no longer dangerous to the public, and is no longer in need of treatment and supervision.\n(b) In determining whether a discharge shall be recommended, the special review board and executive board shall consider whether specific conditions exist to provide a reasonable degree of protection to the public and to assist the patient in adjusting to the community. If the desired conditions do not exist, the discharge shall not be granted.",
	"repealed": false
}