{
	"id": "424A.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.093",
	"title": "424A.093 RELIEF ASSOCIATIONS PAYING MONTHLY SERVICE PENSIONS.",
	"text": "(a) This section applies to any firefighters relief association specified in section 424A.091, subdivision 1, which pays or allows for an option of a monthly service pension to a retiring firefighter when at least the minimum requirements for entitlement to a service pension specified in section 424A.02, any applicable special legislation, and the articles of incorporation or bylaws of the relief association have been met. Each firefighters relief association to which this section applies shall determine the actuarial condition and funding costs of the special fund of the relief association in accordance with subdivisions 2 and 3, the financial requirements of the special fund of the relief association in accordance with subdivision 4, and the minimum obligation of the municipality with respect to the special fund of the relief association in accordance with subdivision 5.\n(b) If a firefighters relief association that previously provided a monthly benefit service pension discontinues that practice and either replaces the monthly benefit amount with a lump-sum benefit amount consistent with section 424A.02, subdivision 3, paragraph (a), clause (2), or purchases an annuity in the same amount as the monthly benefit from an insurance company licensed to do business in this state, the actuarial condition and funding costs, financial, and minimum municipal obligation requirements of section 424A.092 apply rather than this section.\nA relief association to which this section applies shall obtain an actuarial valuation showing the condition of the special fund of the relief association as of December 31, 1978, and at least as of December 31 every four years thereafter. The valuation shall be prepared in accordance with the provisions of sections 356.215, subdivision 8, and 356.216 and any applicable standards for actuarial work established by the Legislative Commission on Pensions and Retirement, except that the figure for normal cost shall be expressed as a level dollar amount, and the amortization contribution shall be the level dollar amount calculated to amortize any current unfunded accrued liability by at least the date of full funding specified in subdivision 4, clause (b). Each valuation shall be filed with the governing body of the municipality served by the fire department to which the relief association is directly associated or by the independent nonprofit firefighting corporation, as applicable, and with the state auditor, not later than July 1 of the year next following the date as of which the actuarial valuation is prepared. Any relief association which is operating under a special law which requires that actuarial valuations be obtained at least every four years and be prepared in accordance with applicable actuarial standards set forth in statute may continue to have actuarial valuations made according to the time schedule set forth in the special legislation subject to the provisions of subdivision 3.\nThe officers of the relief association shall not seek municipal ratification of any amendments to the articles of incorporation or bylaws which increase or otherwise affect the retirement coverage provided by or the service pensions or retirement benefits payable from any relief association pursuant to subdivision 6 prior to obtaining either an updated actuarial valuation including the proposed amendment or an estimate of the expected actuarial impact of the proposed amendment prepared by the actuary of the relief association.\n(a) On or before August 1 of each year, the officers of the relief association shall determine the financial requirements of the special fund of the relief association in accordance with the requirements of this subdivision.\n(b) The financial requirements of the relief association must be based on the most recent actuarial valuation of the special fund prepared in accordance with subdivision 2. If the relief association has an unfunded actuarial accrued liability as reported in the most recent actuarial valuation, the financial requirements must be determined by adding the figures calculated under paragraph (d), clauses (1), (2), and (3). If the relief association does not have an unfunded actuarial accrued liability as reported in the most recent actuarial valuation, the financial requirements must be an amount equal to the figure calculated under paragraph (d), clauses (1) and (2), reduced by an amount equal to one-tenth of the amount of any assets in excess of the actuarial accrued liability of the relief association.\n(c) The determination of whether or not the relief association has an unfunded actuarial accrued liability must be based on the current market value of assets for which a market value is readily ascertainable and the cost or book value, whichever is applicable, for assets for which no market value is readily ascertainable.\n(d) The components of the financial requirements of the relief association are the following:\n(1) The normal level cost requirement for the following year, expressed as a dollar amount, is the figure for the normal level cost of the relief association as reported in the actuarial valuation.\n(2) The amount of anticipated future administrative expenses of the special fund must be calculated by multiplying the dollar amount of the administrative expenses of the special fund for the most recent prior calendar year by the factor of 1.035.\n(3) The amortization contribution requirement to retire the current unfunded actuarial accrued liability by the established date for full funding is the figure for the amortization contribution as reported in the actuarial valuation. If there has not been a change in the actuarial assumptions used for calculating the actuarial accrued liability of the special fund, a change in the bylaws of the relief association governing the service pensions, retirement benefits, or both, payable from the special fund, or a change in the actuarial cost method used to value all or a portion of the special fund which change or changes, which by themselves, without inclusion of any other items of increase or decrease, produce a net increase in the unfunded actuarial accrued liability of the special fund, the established date for full funding is the December 31 occurring ten years later. If there has been a change in the actuarial assumptions used for calculating the actuarial accrued liability of the special fund, a change in the bylaws of the relief association governing the service pensions, retirement benefits, or both payable from the special fund or a change in the actuarial cost method used to value all or a portion of the special fund and the change or changes, by themselves and without inclusion of any other items of increase or decrease, produce a net increase in the unfunded actuarial accrued liability of the special fund within the past 20 years, the established date for full funding must be determined using the following procedure:\n(i) the unfunded actuarial accrued liability of the special fund attributable to experience losses that have occurred since the most recent prior actuarial valuation must be determined and the level annual dollar contribution needed to amortize the experience loss over a period of ten years ending on the December 31 occurring ten years later must be calculated;\n(ii) the unfunded actuarial accrued liability of the special fund must be determined in accordance with the provisions governing service pensions, retirement benefits, and actuarial assumptions in effect before an applicable change;\n(iii) the level annual dollar contribution needed to amortize this unfunded actuarial accrued liability amount by the date for full funding in effect before the change must be calculated using the interest assumption specified in section 356.215, subdivision 8, in effect before any applicable change;\n(iv) the unfunded actuarial accrued liability of the special fund must be determined in accordance with any new provisions governing service pensions, retirement benefits, and actuarial assumptions and the remaining provisions governing service pensions, retirement benefits, and actuarial assumptions in effect before an applicable change;\n(v) the level annual dollar contribution needed to amortize the difference between the unfunded actuarial accrued liability amount calculated under item (ii) and the unfunded actuarial accrued liability amount calculated under item (iv) over a period of 20 years starting December 31 of the year in which the change is effective must be calculated using the interest assumption specified in section 356.215, subdivision 8, in effect after any applicable change;\n(vi) the annual amortization contribution calculated under item (v) must be added to the annual amortization contribution calculated under items (i) and (iii);\n(vii) the period in which the unfunded actuarial accrued liability amount determined in item (iv) will be amortized by the total annual amortization contribution computed under item (vi) must be calculated using the interest assumption specified in section 356.215, subdivision 8, in effect after any applicable change, rounded to the nearest integral number of years, but which must not exceed a period of 20 years from the end of the year in which the determination of the date for full funding using this procedure is made and which must not be less than the period of years beginning in the year in which the determination of the date for full funding using this procedure is made and ending by the date for full funding in effect before the change;\n(viii) the period determined under item (vii) must be added to the date as of which the actuarial valuation was prepared and the resulting date is the new date for full funding.\n(a) The officers of the relief association shall determine the minimum obligation of the municipality with respect to the special fund of the relief association for the following calendar year on or before August 1 of each year in accordance with the requirements of this subdivision.\n(b) The minimum obligation of the municipality with respect to the special fund is an amount equal to the financial requirements of the special fund of the relief association determined under subdivision 4, reduced by the estimated amount of any fire state aid and police and firefighter retirement supplemental state aid payable under chapter 477B and section 423A.022 reasonably anticipated to be received by the municipality for transmittal to the special fund of the relief association during the following year and the amount of any anticipated contributions to the special fund required by the relief association bylaws from the active members of the relief association reasonably anticipated to be received during the following calendar year. A reasonable amount of anticipated fire state aid is an amount that does not exceed the fire state aid actually received in the prior year multiplied by the factor 1.035.\n(c) The officers of the relief association shall certify the financial requirements of the special fund of the relief association and the minimum obligation of the municipality with respect to the special fund of the relief association as determined under subdivision 4 and this subdivision by August 1 of each year. The certification must be made to the entity that is responsible for satisfying the minimum obligation with respect to the special fund of the relief association. If the responsible entity is a joint powers entity, the certification must be made in the manner specified in the joint powers agreement, or if the joint powers agreement is silent on this point, the certification must be made to the chair of the joint powers board.\n(d) The financial requirements of the relief association and the minimum municipal obligation must be included in the financial report or financial statement under section 424A.014.\n(e) The municipality shall provide for at least the minimum obligation of the municipality with respect to the special fund of the relief association by tax levy or from any other source of public revenue. The municipality may levy taxes for the payment of the minimum municipal obligation without any limitation as to rate or amount and irrespective of any limitations imposed by other provisions of law or charter upon the rate or amount of taxation until the balance of the special fund or any fund of the relief association has attained a specified level. In addition, any taxes levied under this section must not cause the amount or rate of any other taxes levied in that year or to be levied in a subsequent year by the municipality which are subject to a limitation as to rate or amount to be reduced.\n(f) If the municipality does not include the full amount of the minimum municipal obligation in its levy for any year, the officers of the relief association shall certify that amount to the county auditor, who shall spread a levy in the amount of the minimum municipal obligation on the taxable property of the municipality.\n(g) If the state auditor determines that a municipal contribution actually made in a plan year was insufficient under section 424A.091, subdivision 3, paragraph (c), clause (5), the state auditor may request from the relief association or from the city a copy of the certifications under this subdivision. The relief association or the city, whichever applies, must provide the certifications within 14 days of the date of the request from the state auditor.\n(a) The board of trustees of a relief association may adopt an amendment to the articles of incorporation or bylaws that increases the coverage, service pensions, or retirement benefits provided by the relief association only after the board of trustees has had an updated actuarial valuation including the proposed change or an estimate of the expected actuarial impact of the proposed change prepared by the actuary of the relief association.\n(b) If the special fund of a relief association to which this section applies has a deficit from full funding under subdivision 4, or if the municipality has a minimum obligation under subdivision 5, any amendment to the articles of incorporation or bylaws adopted by the board of trustees that increases the coverage, service pensions, or retirement benefits provided by the relief association is not effective until it is ratified by the governing body of the affiliated municipality or independent nonprofit firefighting corporation, as applicable. The governing body may ratify the amendment only if the relief association has delivered to the governing body the actuarial valuation or estimate described in paragraph (a), certified by an officer of the relief association.\n(c) If the special fund of a relief association to which this section applies is fully funded or has a surplus over full funding under subdivision 4, and if the municipality does not have a minimum obligation under subdivision 5, the relief association may adopt an amendment to the articles of incorporation or bylaws that increases the coverage, service pensions, or retirement benefits provided by the relief association. The amendment is effective:\n(1) if the municipality ratifies the amendment; or\n(2) without municipal ratification if the amendment satisfies paragraph (d).\n(d) An amendment satisfies this paragraph if the actuarial valuation or estimate described in paragraph (a) demonstrates that the amendment will not cause:\n(1) the amount of the resulting increase in the accrued liability of the special fund to exceed 90 percent of the amount of the surplus over full funding reported in the prior year;\n(2) an increase in the minimum obligation of the municipality for the upcoming calendar year; and\n(3) the special fund of the relief association to have a deficit from full funding under subdivision 4 on the day immediately following the adoption of the amendment.\n(e) If a relief association amends its articles of incorporation or bylaws without municipal ratification pursuant to this subdivision and, subsequent to the amendment, the minimum obligation of the municipality increases under this section, the provision that was implemented without municipal ratification is no longer effective on July 31. Any service pensions or retirement benefits payable after that date may be paid only in accordance with the articles of incorporation or bylaws as amended with municipal ratification.",
	"repealed": false
}