{
	"id": "116J.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.39",
	"title": "116J.39 OFFICE OF BROADBAND DEVELOPMENT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Broadband\" or \"broadband service\" means any service providing advanced telecommunications capability and Internet access with transmission speeds that, at a minimum, meet the Federal Communications Commission definition for broadband.\n(c) \"Local unit of government\" has the meaning given in section 116G.03, subdivision 3.\n(d) \"Office\" means the Office of Broadband Development established in subdivision 2, paragraph (a).\n(a) An Office of Broadband Development is established within the Department of Employment and Economic Development and shall remain in existence until the commissioner certifies that the state has met the broadband goals established in section 237.012. The director shall be appointed by the governor and shall serve in the unclassified service. The director must be qualified by experience and training in broadband. The office may employ staff necessary to carry out the office's duties under subdivision 4.\n(b) The purpose of the office is to encourage, foster, develop, and improve broadband within the state in order to:\n(1) drive job creation, promote innovation, and expand markets for Minnesota businesses;\n(2) serve the ongoing and growing needs of Minnesota's education systems, health care system, public safety system, industries and businesses, governmental operations, and citizens; and\n(3) improve accessibility for underserved communities and populations.\nThe office shall consist of a director of the Office of Broadband Development, as well as any staff necessary to carry out the office's duties under subdivision 4.\n(a) The office shall have the power and duty to:\n(1) serve as the central broadband planning body for the state of Minnesota;\n(2) coordinate with state, regional, local, and private entities to develop, to the maximum extent practicable, a uniform statewide broadband access and usage policy;\n(3) develop, recommend, and implement a statewide plan to encourage cost-effective broadband access, and to make recommendations for increased usage, particularly in rural and other underserved areas;\n(4) coordinate efforts, in consultation and cooperation with the commissioner of commerce, local units of government, and private entities, to meet the state's broadband goals in section 237.012;\n(5) develop, coordinate, and implement the state's broadband infrastructure development program under section 116J.391;\n(6) provide consultation services to local units of government or other project sponsors in connection with the planning, acquisition, improvement, construction, or development of any broadband deployment project;\n(7) encourage public-private partnerships to increase deployment and adoption of broadband services and applications, including recommending funding options and possible incentives to encourage investment in broadband expansion;\n(8) monitor the broadband development efforts of other states and nations in areas such as business, education, public safety, and health;\n(9) consult with the commissioner of commerce to monitor broadband-related activities at the federal level, including regulatory and policy changes and the potential impact on broadband deployment and sustainability in the state;\n(10) serve as an information clearinghouse for federal programs providing financial assistance to institutions located in rural areas seeking to obtain access to high-speed broadband service, and use this information as an outreach tool to make institutions located in rural areas that are unserved or underserved with respect to broadband service aware of the existence of federal assistance;\n(11) provide logistical and administrative support for the Governor's Broadband Task Force;\n(12) provide an annual report, as required by subdivision 5;\n(13) coordinate an ongoing collaborative effort of stakeholders to evaluate and address security, vulnerability, and redundancy issues in order to ensure the reliability of broadband networks; and\n(14) perform any other activities consistent with the office's purpose.\n(b) In carrying out its duties under this subdivision, the Office of Broadband Development shall have no authority to regulate or compel action on the part of any provider of broadband service.\n(a) Beginning January 15, 2014, and each year thereafter, the Office of Broadband Development shall report to the legislative committees with jurisdiction over broadband policy and finance on the office's activities during the previous year.\n(b) The report shall contain, at a minimum:\n(1) an analysis of the current availability and use of broadband, including average broadband speeds, within the state;\n(2) information gathered from schools, libraries, hospitals, and public safety facilities across the state, determining the actual speed and capacity of broadband currently in use and the need, if any, for increases in speed and capacity to meet current or anticipated needs;\n(3) an analysis of incumbent broadband infrastructure within the state and its ability to spur economic development;\n(4) an analysis of the degree to which new, additional, or improved broadband infrastructure would spur economic development in the state;\n(5) a summary of the office's activities in coordinating broadband infrastructure development under section 116J.391;\n(6) suggested policies, incentives, and legislation designed to accelerate the achievement of the goals under section 237.012, subdivisions 1 and 2;\n(7) any proposed legislative and policy initiatives; and\n(8) any other information requested by the legislative committees with jurisdiction over broadband policy and finance, or that the office deems necessary.\n(c) The report may be submitted electronically and is subject to section 3.195, subdivision 1.",
	"repealed": false
}