{
	"id": "245G.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.01",
	"title": "245G.01 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them.\n\"Administration of medication\" means providing a medication to a client, and includes the following tasks, performed in the following order:\n(1) checking the client's medication record;\n(2) preparing the medication for administration;\n(3) administering the medication to the client;\n(4) documenting the administration of the medication, or the reason for not administering a medication as prescribed; and\n(5) reporting information to a licensed practitioner or a nurse regarding a problem with the administration of medication or the client's refusal to take the medication, if applicable.\n\"Adolescent\" means an individual under 18 years of age.\n\"Alcohol and drug counselor\" means a person who is qualified according to section 245G.11, subdivision 5.\n\"American Society of Addiction Medicine criteria\" or \"ASAM criteria\" has the meaning provided in section 254B.01, subdivision 2a.\n\"Applicant\" has the meaning given in section 245A.02, subdivision 3.\n\"Capacity management system\" means a database maintained by the department to compile and make information available to the public about the waiting list status and current admission capability of each opioid treatment program.\n\"Central registry\" means a database maintained by the department to collect identifying information from two or more programs about an individual applying for maintenance treatment or detoxification treatment for opioid addiction to prevent an individual's concurrent enrollment in more than one program.\n\"Client\" means an individual accepted by a license holder for assessment or treatment of a substance use disorder. An individual remains a client until the license holder no longer provides or intends to provide the individual with treatment service. Client also includes the meaning of patient under section 144.651, subdivision 2.\n\"Commissioner\" means the commissioner of human services.\n\"Co-occurring disorders\" means a diagnosis of both a substance use disorder and a mental health disorder.\n\"Day of service initiation\" means the day the license holder begins the provision of a treatment service identified in section 245G.07.\n\"Department\" means the Department of Human Services.\n\"Direct contact\" has the meaning given for \"direct contact\" in section 245C.02, subdivision 11.\n\"Face-to-face\" means two-way, real-time, interactive and visual communication between a client and a treatment service provider and includes services delivered in person or via telehealth.\n[See Note.]\n\"Group counseling\" means a professionally led psychotherapeutic substance use disorder treatment that is delivered in an interactive group setting.\n\"Guest speaker\" means an individual who is not an alcohol and drug counselor qualified according to section 245G.11, subdivision 5; is not qualified according to the commissioner's list of professionals under section 245G.07, subdivision 3; and who works under the direct observation of an alcohol and drug counselor to present to clients on topics in which the guest speaker has expertise and that the license holder has determined to be beneficial to a client's recovery. Tribally licensed programs have autonomy to identify the qualifications of their guest speakers.\n\"Former student\" means a staff person that meets the requirements in section 148F.11, subdivision 2a, to practice as a former student.\n\"License\" has the meaning given in section 245A.02, subdivision 8.\n\"License holder\" has the meaning given in section 245A.02, subdivision 9.\n\"Licensed practitioner\" means an individual who is authorized to prescribe medication as defined in section 151.01, subdivision 23.\n(a) \"Licensed professional in private practice\" means an individual who:\n(1) is licensed under chapter 148F, or is exempt from licensure under that chapter but is otherwise licensed to provide alcohol and drug counseling services;\n(2) practices solely within the permissible scope of the individual's license as defined in the law authorizing licensure; and\n(3) does not affiliate with other licensed or unlicensed professionals to provide alcohol and drug counseling services.\n(b) For purposes of this subdivision, affiliate includes but is not limited to:\n(1) using the same electronic record system as another professional, except when the system prohibits each professional from accessing the records of another professional;\n(2) advertising the services of more than one professional together;\n(3) accepting client referrals made to a group of professionals;\n(4) providing services to another professional's clients when that professional is absent; or\n(5) appearing in any way to be a group practice or program.\n(c) For purposes of this subdivision, affiliate does not include:\n(1) conferring with another professional;\n(2) making a client referral to another professional;\n(3) contracting with the same agency as another professional for billing services;\n(4) using the same waiting area for clients in an office as another professional; or\n(5) using the same receptionist as another professional if the receptionist supports each professional independently.\n\"Nurse\" means an individual licensed and currently registered to practice professional or practical nursing as defined in section 148.171, subdivisions 14 and 15.\n\"Opioid treatment program\" or \"OTP\" means a program or practitioner engaged in opioid treatment of an individual that provides dispensing of an opioid agonist treatment medication, along with a comprehensive range of medical and rehabilitative services, when clinically necessary, to an individual to alleviate the adverse medical, psychological, or physical effects of an opioid addiction. OTP includes detoxification treatment, short-term detoxification treatment, long-term detoxification treatment, maintenance treatment, comprehensive maintenance treatment, and interim maintenance treatment.\n\"Paraprofessional\" means an employee, agent, or independent contractor of the license holder who performs tasks to support treatment service. A paraprofessional may be referred to by a variety of titles including but not limited to technician, case aide, or counselor assistant. If currently a client of the license holder, the client cannot be a paraprofessional for the license holder.\n\"Person-centered\" means a client actively participates in the client's treatment planning of services. This includes a client making meaningful and informed choices about the client's own goals, objectives, and the services the client receives in collaboration with the client's identified natural supports.\n[Renumbered subd 20e]\n\"Protective factors\" means the actions or efforts a person can take to reduce the negative impact of certain issues, such as substance use disorders, mental health disorders, and risk of suicide. Protective factors include connecting to positive supports in the community, a nutritious diet, exercise, attending counseling or 12-step groups, and taking appropriate medications.\n\"Skilled treatment services\" has the meaning provided in section 254B.01, subdivision 10.\n\"Staff\" or \"staff member\" means an individual who works under the direction of the license holder regardless of the individual's employment status including but not limited to an intern, consultant, individual who works part time, or individual who does not provide direct care services.\n\"Student intern\" means an individual who is enrolled in a program specializing in alcohol and drug counseling or mental health counseling at an accredited educational institution and is authorized by a licensing board to provide services under supervision of a licensed professional.\n\"Substance\" means alcohol, solvents, controlled substances as defined in section 152.01, subdivision 4, and other mood-altering substances.\n\"Substance use disorder\" has the meaning given in the current Diagnostic and Statistical Manual of Mental Disorders.\n\"Substance use disorder treatment\" means treatment of a substance use disorder, including the process of assessment of a client's needs, development of planned methods, including interventions or services to address a client's needs, provision of services, facilitation of services provided by other service providers, and ongoing reassessment by a qualified professional when indicated. The goal of substance use disorder treatment is to assist or support the client's efforts to recover from a substance use disorder.\n\"Target population\" means individuals with a substance use disorder and the specified characteristics that a license holder proposes to serve.\n\"Telehealth\" means the delivery of a substance use disorder treatment service while the client is at an originating site and the health care provider is at a distant site via telehealth as defined in section 256B.0625, subdivision 3b, and as specified in section 254B.05, subdivision 5, paragraph (f).\n[See Note.]\n\"Treatment director\" means an individual who meets the qualifications specified in section 245G.11, subdivisions 1 and 3, and is designated by the license holder to be responsible for all aspects of the delivery of treatment service.\n\"Treatment week\" means the seven-day period that the program identified in the program's policy and procedure manual as the day of the week that the treatment program week starts and ends for the purpose of identifying the nature and number of treatment services an individual receives weekly.\n\"Volunteer\" means an individual who, under the direction of the license holder, provides services or an activity to a client without compensation.",
	"repealed": false
}