{
	"id": "16B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.27",
	"title": "16B.27 GOVERNOR'S RESIDENCE.",
	"text": "The governor's residence must be used for official ceremonial functions of the state, and to provide suitable living quarters for the governor of the state.\nThe commissioner shall maintain the governor's residence in the same way as other state buildings are maintained and shall rehabilitate, decorate, and furnish the building. The decoration and furnishing shall be guided by the Governor's Residence Council.\nThe Governor's Residence Council consists of the following 19 members: the commissioner; the spouse or a designee of the governor; the executive director of the Minnesota State Arts Board; the director of the Minnesota Historical Society; a member of the senate appointed pursuant to the rules of the senate; a member of the house of representatives appointed pursuant to the rules of the house of representatives; 13 persons appointed by the governor including one in the field of higher education, one member of the American Society of Interior Designers, Minnesota Chapter, one member of the American Institute of Architects, Minnesota chapter, one member of the American Society of Landscape Architects, Minnesota Chapter, one member of the family that donated the governor's residence to the state, if available, and eight public members with four public members' terms being coterminous with the governor who appoints them. Members of the council serve without compensation. Membership terms, removal, and filling of vacancies for members appointed by the governor are governed by section 15.0575. The council shall elect a chair and a secretary from among its members.\nThe council shall develop an overall restoration plan for the governor's residence and surrounding grounds and approve alterations in the existing structure.\n(a) To maintain and improve the quality of furnishings for the public areas of the building, the council may solicit and accept donated money, furnishings, objects of art and other items the council determines may have historical value in keeping with the building's period and purpose. The gift acceptance procedures of sections 16A.013 to 16A.016 do not apply to this subdivision.\n(b) Notwithstanding sections 16A.013 to 16A.016, the council may solicit contributions for the renovation of and capital improvements to the governor's residence.\n(c) Gifts for the benefit of the governor's residence and surrounding grounds are not accepted by the state unless accepted by the council. The council shall maintain a complete inventory of all gifts and articles received.\nA nonstate entity using the governor's residence must pay the state for all direct and indirect costs associated with use of the facility.",
	"repealed": false
}