{
	"id": "277.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/277.01",
	"title": "277.01 WHEN TAX IS DELINQUENT; PENALTY.",
	"text": "Except as provided in this subdivision and subdivision 3, all unpaid personal property taxes shall be deemed delinquent on May 16 next after they become due or 21 days after the postmark date on the envelope containing the property tax statement, whichever is later, and thereupon a penalty of eight percent shall attach and be charged upon all such taxes. In the case of unpaid personal property taxes due and owing under section 272.01, subdivision 2, or 273.19, the first half shall become delinquent if not paid before May 16 or 21 days after the postmark date on the envelope containing the property tax statement, whichever is later, and the second half shall become delinquent if not paid before October 16; penalties for unpaid tax on such property are imposed under section 279.01, subdivision 1. This section shall not apply to property taxed under section 273.125, subdivision 8, paragraph (c).\nA county may provide by resolution that in the case of a property owner that has multiple personal property tax statements with the aggregate taxes exceeding $50, payments may be made in installments as provided in this subdivision.\nMS 1965 [Repealed, 1967 c 99 s 6]\nThe county treasurer may accept payments of more or less than the exact amount of a tax installment due. Payments must be applied first to the oldest installment that is due but which has not been fully paid. If the accepted payment is less than the amount due, the payment is applied first to the penalty accrued for the year or the installment being paid. Acceptance of partial payment of tax does not constitute a waiver of the minimum payment required as a condition for filing an appeal under section 278.03 or any other law, nor does it affect the order of payment of delinquent taxes under section 280.39.\nPersonal property taxes assessed upon improvements made to real property taxed under section 272.01, subdivision 2, or 273.19, if unpaid, become delinquent on May 16 or 21 days after the postmark date on the envelope containing the property tax statement, whichever is later. If the tax against the improvements exceeds $50, one-half may be paid before May 16 and the remaining one-half must be paid at any time before the following October 16, without penalty. Section 279.01, subdivision 1, otherwise governs imposition of penalties.",
	"repealed": false
}