{
	"id": "60A.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.76",
	"title": "60A.76 PURPOSE AND SCOPE.",
	"text": "Sections 60A.76 to 60A.768 apply to all individual and group accident and health insurance coverages as defined in section 60A.06, subdivision 1, paragraph (5)(a), including single premium credit disability insurance. Other credit insurance is not subject to sections 60A.76 to 60A.768.\nWhen an insurer determines that adequacy of its health insurance reserves requires reserves in excess of the minimum standards specified in sections 60A.76 to 60A.768, the increased reserves must be held and must be considered the minimum reserves for that insurer.\nWith respect to any block of contracts, or with respect to an insurer's health business as a whole, a prospective gross premium valuation is the ultimate test of reserve adequacy as of a given valuation date. The prospective gross premium valuation must take into account, for contracts in force, in a claims status, or in a continuation of benefits status on the valuation date, the present value as of the valuation date of: all expected benefits unpaid, all expected expenses unpaid, and all unearned or expected premiums, adjusted for future premium increases reasonably expected to be put into effect.\nThe prospective gross premium valuation must be performed whenever a significant doubt exists as to reserve adequacy with respect to any major block of contracts, or with respect to the insurer's health business as a whole. In the event inadequacy is found to exist, immediate loss recognition must be made and the reserves restored to adequacy. Adequate reserves, inclusive of claim, premium, and contract reserves, if any, must be held with respect to all contracts, regardless of whether contract reserves are required for such contracts under sections 60A.76 to 60A.768.\nWhenever minimum reserves, as defined in sections 60A.76 to 60A.768, exceed reserve requirements as determined by a prospective gross premium valuation, such minimum reserves remain the minimum requirement under sections 60A.76 to 60A.768.",
	"repealed": false
}