{
	"id": "325E.044",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.044",
	"title": "325E.044 PLASTIC CONTAINER LABELING.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Distributor\" means a person engaged in business that ships or transports products to retailers in this state to be sold by those retailers.\n(b) \"Labeling\" means attaching information to or embossing or printing information on a plastic container.\n(c) \"Manufacturer\" means any manufacturer offering for sale and distribution a product packaged in a container.\n(d) \"Plastic container\" means an individual, separate, plastic bottle, can, or jar with a capacity of 16 ounces or more.\nBy March 31, 1989, the board shall adopt rules requiring labeling of plastic containers. The rules adopted under this subdivision must allow a manufacturer of plastic containers, a person who places products in plastic containers, and a person who sells products in plastic containers to choose an appropriate method of labeling plastic containers. The board shall adopt rules as consistent as practicable with national industrywide plastic container coding systems. The rules may exempt plastic containers of a capacity of less than a specified minimum size from the labeling requirements.\nA person may not manufacture or bring into the state for sale in this state a plastic container that does not comply with the labeling rules adopted under subdivision 2.\n(a) After being notified that a plastic container does not comply with the rules under subdivision 2, any manufacturer or distributor who violates subdivision 3 is subject to a civil penalty of $50 for each violation up to a maximum of $500 and may be enjoined from such violations.\n(b) The attorney general may bring an action in the name of the state in a court of competent jurisdiction for recovery of civil penalties or for injunctive relief as provided in this subdivision. The attorney general may accept an assurance of discontinuance of acts in violation of subdivision 3 in the manner provided in section 8.31, subdivision 2b.",
	"repealed": false
}