{
	"id": "85B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/85B.01",
	"title": "85B.01 PURPOSE.",
	"text": "(a) The legislature determines that it is in the public interest and an objective of the state that its citizens and the citizens of the world be better informed about the importance of preserving and restoring the large freshwater lakes of the world, including Lake Superior. The legislature determines that an enhanced public awareness of the vital role which the large freshwater lakes play in the ecosystem is an essential element in a wider program to provide for the protection and preservation of these lakes. The legislature also determines that the transfer of data and scientific findings about the large freshwater lakes of the world to the policy makers and citizens of the state, our nation, and the world is essential.\n(b) The legislature determines that as the largest surface of fresh water in the world, Lake Superior can function as a focal point for transferring information about these large lakes to the policy makers and the public, and that the establishment of a facility containing appropriate exhibits and other educational features to support these objectives and the establishment of programs related to them near the shore of Lake Superior in Duluth is in the public interest and of advantage and benefit to all of the citizens of the state.\n(c) The legislature is aware that Lake Superior Center, a Minnesota nonprofit corporation, is actively engaged in the development of a program and plan to meet these objectives and is actively engaged in assembling the public and private partnership required to secure the resources, international participation, and expertise required to create a freshwater education center.\n(d) The legislature finds that objectives of sections 85B.01 to 85B.08 can best be accomplished by forming a public corporation to be known as Lake Superior Center Authority and that Lake Superior Center Authority be given the powers, rights, privileges, and immunities provided in sections 85B.01 to 85B.08, including the power to cooperate and contract with Lake Superior Center to the extent and for the purposes provided for in sections 85B.01 to 85B.08.",
	"repealed": false
}