{
	"id": "216H.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/216H.07",
	"title": "216H.07 EMISSIONS-REDUCTION ATTAINMENT; POLICY DEVELOPMENT PROCESS.",
	"text": "For the purpose of this section, \"reductions\" means the greenhouse gas emissions-reductions goals specified in section 216H.02, subdivision 1.\nThis section is intended to create a nonexclusive, regular, mandated process for the state to develop policies to attain the greenhouse gas reduction goals specified in section 216H.02.\n(a) By January 15 of each odd-numbered year, the commissioners of commerce and the Pollution Control Agency shall jointly report to the chairs and ranking minority members of the legislative committees with primary policy jurisdiction over energy and environmental issues the most recent and best available evidence identifying the level of reductions already achieved and the level necessary to achieve the reductions timetable in section 216H.02.\n(b) The report must be in easily understood nontechnical terms.\n[Repealed, 2012 c 272 s 98]\nLegislation proposed under subdivision 4 must be based on the following principles:\n(1) the greenhouse gas emissions-reduction goals specified in section 216H.02, subdivision 1, must be attained;\n(2) the reductions must be attained on a schedule that keeps pace with the reduction timetable required by section 216H.02, subdivision 1;\n(3) conservation, including ceasing some activities, doing some activities less, and doing some activities more energy efficiently, is the first choice for reduction;\n(4) public education is a key component;\n(5) all levels of government should lead by example;\n(6) strategies that may lead to economic dislocation should be phased in and should be coupled with strategies that address the dislocation; and\n(7) there must be coordination with other federal and regional greenhouse gas emissions-reduction requirements so that the state benefits and is not penalized from its reduction activities.",
	"repealed": false
}