{
	"id": "354.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.52",
	"title": "354.52 REPORTS.",
	"text": "[Repealed, 1974 c 289 s 59]\n[Repealed, 2000 c 461 art 3 s 47]\nEach employing unit must report to the executive director the amount of income earned during the previous fiscal year by each retiree for teaching service performed after retirement. This shall be done through the payroll reporting system and is based on reemployment income as defined in section 354.44, subdivision 5. Submitting the salary data through payroll reporting has the force and effect of an oath as to the correctness of the amount of postretirement reemployment income earned.\nEvery pay period, each employer shall deduct and withhold from the salary of every teacher who is a member of the fund the amount required under section 354.42. At the time of each deduction, the employer shall also furnish to each teacher a statement showing the amount of the deduction.\nAn employer shall remit all amounts due to the association and furnish a statement indicating the amount due and transmitted with any other information required by the executive director. If an amount due is not received by the association within 14 calendar days of the payroll payment, the employer shall pay interest on the amount due at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually, from the due date until the amount is received by the association. All amounts due and other employer obligations not remitted may be certified to the commissioner of management and budget who shall deduct the amount from any state aid or appropriation amount applicable to the employing unit.\n(a) An employing unit must provide the member data specified in paragraph (b) in a format prescribed by the executive director. Data changes and the dates of those changes under this subdivision must be reported to the association in a format prescribed by the executive director on an ongoing basis within 14 calendar days after the date of the end of the payroll cycle in which they occur. These data changes must be reported with the payroll cycle data under subdivision 4b.\n(b) Data on the member includes:\n(1) legal name, address, date of birth, association member number, employer-assigned employee number, and Social Security number;\n(2) association status, including, but not limited to, basic, coordinated, exempt annuitant, exempt technical college teacher, and exempt independent contractor or consultant;\n(3) employment status, including, but not limited to, full time, part time, intermittent, substitute, or part-time mobility;\n(4) employment position, including, but not limited to, teacher, superintendent, principal, administrator, or other;\n(5) employment activity, including, but not limited to, hire, termination, resumption of employment, disability, or death;\n(6) leaves of absence;\n(7) county district number assigned by the association for the employing unit;\n(8) data center identification number, if applicable;\n(9) gender;\n(10) position code; and\n(11) other information as may be required by the executive director.\nAn employing unit shall provide the following data to the association for payroll payments on an ongoing basis within 14 calendar days after the date of the payroll payment in a format prescribed by the executive director:\n(1) association member number;\n(2) employer-assigned employee number;\n(3) Social Security number;\n(4) amount of each salary deduction;\n(5) amount of salary as defined in section 354.05, subdivision 35, from which each deduction was made;\n(6) reason for payment;\n(7) the beginning and ending dates of the payroll period covered and the date of actual payment;\n(8) fiscal year of salary earnings;\n(9) total remittance amount including employee, employer, and additional employer contributions;\n(10) reemployed annuitant salary under section 354.44, subdivision 5; and\n(11) other information as may be required by the executive director.\nFor all part-time service rendered, the service credit reporting requirement in subdivision 4b for all part-time employees of the Minnesota State Colleges and Universities system must be met by the Minnesota State Colleges and Universities system reporting to the association on or before July 31 of each year the final calculation of each part-time member's service credit for the immediately preceding fiscal year based on the employee's assignments for the fiscal year.\nAn employing unit must provide annual base salary data, as defined in section 354.05, subdivision 41, to the association on or before June 30 of each fiscal year.\nThe commissioner of management and budget, the several county treasurers, and the treasurers of the various school districts and institutions to which the provisions of this chapter apply shall be officially liable for the receipt, handling, and disbursement of all moneys coming into their hands belonging to the fund and the sureties on the official bonds of each of these treasurers and the commissioner of management and budget shall be liable for such moneys the same as for all other moneys belonging to the school funds of this state.\n(a) An employing unit that does not comply with the reporting requirements under subdivision 2a, 4a, 4b, or 4d, must pay a fine of $5 per calendar day until the association receives the required data.\n(b) If the annual base salary required to be reported under subdivision 4d has not been settled or determined as of June 16, the fine commences if the annual base salary has not been reported to the association within 14 days following the settlement date.",
	"repealed": false
}