{
	"id": "18C.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.60",
	"title": "18C.60 PHOSPHOROUS TURF FERTILIZER USE RESTRICTIONS.",
	"text": "For the purpose of this section, \"turf\" means noncrop land planted in closely mowed, managed grasses including, but not limited to, residential and commercial residential property, private golf courses, and property owned by federal, state, or local units of government, including parks, recreation areas, and public golf courses. Turf does not mean pasture, hayland, hay, turf grown on turf farms, or any other form of agricultural production.\n(a) A person may not apply a fertilizer containing the plant nutrient phosphorus to turf statewide, except under conditions listed in paragraph (b).\n(b) Paragraph (a) does not apply when:\n(1) a tissue, soil, or other test by a laboratory or method approved by the commissioner and performed within the last three years indicates that the level of available phosphorus in the soil is insufficient to support healthy turf growth;\n(2) the property owner or an agent of the property owner is first establishing turf via seed or sod procedures, and only during the first growing season; or\n(3) the fertilizer containing the plant food phosphorus is used on a golf course under the direction of a person licensed, certified, or approved by an organization with an ongoing training program approved by the commissioner.\n(c) Applications of phosphorous fertilizer authorized under paragraph (b) must not exceed rates recommended by the University of Minnesota and approved by the commissioner.\nThe commissioner, in consultation with the University of Minnesota Extension Service, fertilizer industry representatives, lakes groups, and other interested or affected parties, must produce consumer information on use restrictions and recommended best practices for lawn fertilizer containing phosphorus, and on best management practices for other residential sources of phosphorus in the urban landscape. The information must be in a format and of a content suitable for posting and distribution at retail points of sale of fertilizer that contains phosphorus and is for use on turf.\nThe commissioner, in cooperation with the University of Minnesota and the University of Minnesota Extension Service, and, after consultation with representatives of the fertilizer industry, lakes groups, and other interested or affected parties, shall evaluate research needs and encourage targeted research opportunities to investigate the effects of phosphorous fertilization of turf on urban stormwater quality. The commissioner must evaluate the effectiveness of the restrictions on phosphorous fertilizers under this section and report to the legislature by January 15, 2007.",
	"repealed": false
}