{
	"id": "151.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.39",
	"title": "151.39 DISTRESSED DRUGS.",
	"text": "Distressed drugs shall mean drugs or medicines which have been subjected to accident, fire, flood, adverse temperatures, or other physical influences which could affect the potency, quality, purity, or efficacy of such drug or medicine could otherwise cause the drug or medicine to be adulterated or misbranded within the meaning of the provisions of this chapter.\nNo person shall sell, barter, vend, give away, or exchange distressed drugs until the board has determined that such drugs are not adulterated or misbranded within the meaning of this chapter.\nEvery person who owns or controls distressed drugs shall immediately notify the board of the existence of such drugs and the location thereof and the board shall promptly cause an inspection and examination to be made of such drugs.\nNo person may import distressed drugs into this state without notification to the board of the source, destination, kind and quantity of such drugs. Such drugs may not be sold or offered for sale without written approval of the board. The board shall grant such approval when the applicant has clearly demonstrated that such distressed drugs were inspected on the site within a reasonable period after the occurrence set forth in subdivision 1 by an agency of the foreign state satisfactory to the board and the furnishing of a written certification by such agency in such form as is satisfactory to the board indicating that there is no reasonable cause to believe the drugs are not adulterated or misbranded. Nothing herein shall be construed to prevent the board from exerting its authority and rights set forth in section 151.38 after such drugs have entered this state.\nThe board shall, within 30 days of such notification, indicate whether or not it has probable cause to believe that such drugs are adulterated or misbranded within the meaning of this chapter. If the board determines that no such probable cause exists, it shall furnish the owner or person having control of such drugs a written certificate to that effect. If the board has probable cause to believe that the drugs are adulterated or misbranded, it shall follow the procedure set forth in section 151.38.",
	"repealed": false
}