{
	"id": "144A.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.475",
	"title": "144A.475 ENFORCEMENT.",
	"text": "(a) The commissioner may refuse to grant a temporary license, refuse to grant a license as a result of a change in ownership, refuse to renew a license, suspend or revoke a license, or impose a conditional license if the home care provider or owner or managerial official of the home care provider:\n(1) is in violation of, or during the term of the license has violated, any of the requirements in sections 144A.471 to 144A.482;\n(2) permits, aids, or abets the commission of any illegal act in the provision of home care;\n(3) performs any act detrimental to the health, safety, and welfare of a client;\n(4) obtains the license by fraud or misrepresentation;\n(5) knowingly made or makes a false statement of a material fact in the application for a license or in any other record or report required by this chapter;\n(6) denies representatives of the department access to any part of the home care provider's books, records, files, or employees;\n(7) interferes with or impedes a representative of the department in contacting the home care provider's clients;\n(8) interferes with or impedes a representative of the department in the enforcement of this chapter or has failed to fully cooperate with an inspection, survey, or investigation by the department;\n(9) destroys or makes unavailable any records or other evidence relating to the home care provider's compliance with this chapter;\n(10) refuses to initiate a background study under section 144.057 or 245A.04;\n(11) fails to timely pay any fines assessed by the department;\n(12) violates any local, city, or township ordinance relating to home care services;\n(13) has repeated incidents of personnel performing services beyond their competency level; or\n(14) has operated beyond the scope of the home care provider's license level.\n(b) A violation by a contractor providing the home care services of the home care provider is a violation by the home care provider.\n(a) A suspension or conditional license designation may include terms that must be completed or met before a suspension or conditional license designation is lifted. A conditional license designation may include restrictions or conditions that are imposed on the provider. Terms for a suspension or conditional license may include one or more of the following and the scope of each will be determined by the commissioner:\n(1) requiring a consultant to review, evaluate, and make recommended changes to the home care provider's practices and submit reports to the commissioner at the cost of the home care provider;\n(2) requiring supervision of the home care provider or staff practices at the cost of the home care provider by an unrelated person who has sufficient knowledge and qualifications to oversee the practices and who will submit reports to the commissioner;\n(3) requiring the home care provider or employees to obtain training at the cost of the home care provider;\n(4) requiring the home care provider to submit reports to the commissioner;\n(5) prohibiting the home care provider from taking any new clients for a period of time; or\n(6) any other action reasonably required to accomplish the purpose of this subdivision and section 144A.45, subdivision 2.\n(b) A home care provider subject to this subdivision may continue operating during the period of time home care clients are being transferred to other providers.\n(a) Prior to any suspension, revocation, or refusal to renew a license, the home care provider shall be entitled to notice and a hearing as provided by sections 14.57 to 14.69. In addition to any other remedy provided by law, the commissioner may, without a prior contested case hearing, temporarily suspend a license or prohibit delivery of services by a provider for not more than 90 days, or issue a conditional license if the commissioner determines that there are level 3 violations that do not pose an imminent risk of harm to the health or safety of persons in the provider's care, provided:\n(1) advance notice is given to the home care provider;\n(2) after notice, the home care provider fails to correct the problem;\n(3) the commissioner has reason to believe that other administrative remedies are not likely to be effective; and\n(4) there is an opportunity for a contested case hearing within the 30 days unless there is an extension granted by an administrative law judge pursuant to subdivision 3b.\n(b) If the commissioner determines there are:\n(1) level 4 violations; or\n(2) violations that pose an imminent risk of harm to the health or safety of persons in the provider's care,\nthe commissioner may immediately temporarily suspend a license, prohibit delivery of services by a provider, or issue a conditional license without meeting the requirements of paragraph (a), clauses (1) to (4).\nFor the purposes of this subdivision, \"level 3\" and \"level 4\" have the meanings given in section 144A.474, subdivision 11, paragraph (b).\nWithin 15 business days of receipt of the licensee's timely appeal of a sanction under this section, other than for a temporary suspension, the commissioner shall request assignment of an administrative law judge. The commissioner's request must include a proposed date, time, and place of hearing. A hearing must be conducted by an administrative law judge pursuant to Minnesota Rules, parts 1400.8505 to 1400.8612, within 90 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause or for purposes of discussing settlement. In no case shall one or more extensions be granted for a total of more than 90 calendar days unless there is a criminal action pending against the licensee. If, while a licensee continues to operate pending an appeal of an order for revocation, suspension, or refusal to renew a license, the commissioner identifies one or more new violations of law that meet the requirements of level 3 or 4 violations as defined in section 144A.474, subdivision 11, paragraph (b), the commissioner shall act immediately to temporarily suspend the license under the provisions in subdivision 3.\n(a) Within five business days of receipt of the license holder's timely appeal of a temporary suspension or issuance of a conditional license, the commissioner shall request assignment of an administrative law judge. The request must include a proposed date, time, and place of a hearing. A hearing must be conducted by an administrative law judge pursuant to Minnesota Rules, parts 1400.8505 to 1400.8612, within 30 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause. The commissioner shall issue a notice of hearing by certified mail or personal service at least ten business days before the hearing. Certified mail to the last known address is sufficient. The scope of the hearing shall be limited solely to the issue of whether the temporary suspension or issuance of a conditional license should remain in effect and whether there is sufficient evidence to conclude that the licensee's actions or failure to comply with applicable laws are level 3 or 4 violations as defined in section 144A.474, subdivision 11, paragraph (b), or that there were violations that posed an imminent risk of harm to the health and safety of persons in the provider's care.\n(b) The administrative law judge shall issue findings of fact, conclusions, and a recommendation within ten business days from the date of hearing. The parties shall have ten calendar days to submit exceptions to the administrative law judge's report. The record shall close at the end of the ten-day period for submission of exceptions. The commissioner's final order shall be issued within ten business days from the close of the record. When an appeal of a temporary immediate suspension or conditional license is withdrawn or dismissed, the commissioner shall issue a final order affirming the temporary immediate suspension or conditional license within ten calendar days of the commissioner's receipt of the withdrawal or dismissal. The license holder is prohibited from operation during the temporary suspension period.\n(c) When the final order under paragraph (b) affirms an immediate suspension, and a final licensing sanction is issued under subdivisions 1 and 2 and the licensee appeals that sanction, the licensee is prohibited from operation pending a final commissioner's order after the contested case hearing conducted under chapter 14.\n(d) A licensee whose license is temporarily suspended must comply with the requirements for notification and transfer of clients in subdivision 5. These requirements remain if an appeal is requested.\n(a) In addition to any other remedies provided by law, the commissioner may, without a prior contested case hearing, immediately temporarily suspend a license or prohibit delivery of services by a provider for not more than 90 days, or issue a conditional license, if the commissioner determines that there are:\n(1) level 4 violations; or\n(2) violations that pose an imminent risk of harm to the health or safety of persons in the provider's care.\n(b) For purposes of this subdivision, \"level 4\" has the meaning given in section 144A.474, subdivision 11, paragraph (b).\n(c) A notice stating the reasons for the immediate temporary suspension or conditional license and informing the license holder of the right to an expedited hearing under subdivision 3b must be delivered by personal service to the address shown on the application or the last known address of the license holder. The license holder may appeal an order immediately temporarily suspending a license or issuing a conditional license. The appeal must be made in writing by certified mail or personal service. If mailed, the appeal must be postmarked and sent to the commissioner within five calendar days after the license holder receives notice. If an appeal is made by personal service, it must be received by the commissioner within five calendar days after the license holder received the order.\n(d) A license holder whose license is immediately temporarily suspended must comply with the requirements for notification and transfer of clients in subdivision 5. These requirements remain if an appeal is requested.\nTo appeal the assessment of civil penalties under section 144A.45, subdivision 2, clause (5), and an action against a license under this section, a provider must request a hearing no later than 15 days after the provider receives notice of the action.\n(a) The process of suspending, revoking, or refusing to renew a license must include a plan for transferring affected clients' care to other providers by the home care provider, which will be monitored by the commissioner. Within three calendar days of being notified of the revocation, refusal to renew, or suspension, the home care provider shall provide the commissioner, the lead agencies as defined in section 256B.0911, county adult protection and case managers, and the ombudsman for long-term care with the following information:\n(1) a list of all clients, including full names and all contact information on file;\n(2) a list of each client's representative or emergency contact person, including full names and all contact information on file;\n(3) the location or current residence of each client;\n(4) the payor sources for each client, including payor source identification numbers; and\n(5) for each client, a copy of the client's service plan, and a list of the types of services being provided.\n(b) The revocation, refusal to renew, or suspension notification requirement is satisfied by mailing the notice to the address in the license record. The home care provider shall cooperate with the commissioner and the lead agencies, county adult protection and case managers, and the ombudsman for long-term care during the process of transferring care of clients to qualified providers. Within three calendar days of being notified of the final revocation, refusal to renew, or suspension action, the home care provider must notify and disclose to each of the home care provider's clients, or the client's representative or emergency contact persons, that the commissioner is taking action against the home care provider's license by providing a copy of the revocation, refusal to renew, or suspension notice issued by the commissioner. If the provider does not comply with the disclosure requirements in this section, the commissioner shall notify the clients, client representatives, or emergency contact persons about the action being taken. Lead agencies, county adult protection and case managers, and the Office of Ombudsman for Long-Term Care may also provide this information. The revocation, refusal to renew, or suspension notice is public data except for any private data contained therein.\n(c) A home care provider subject to this subdivision may continue operating during the period of time home care clients are being transferred to other providers.\n(a) The owner and managerial officials of a home care provider whose Minnesota license has not been renewed or that has been revoked because of noncompliance with applicable laws or rules shall not be eligible to apply for nor will be granted a home care license, including other licenses under this chapter, or be given status as an enrolled personal care assistance provider agency or personal care assistant by the Department of Human Services under section 256B.0659 for five years following the effective date of the nonrenewal or revocation. If the owner and managerial officials already have enrollment status, their enrollment will be terminated by the Department of Human Services.\n(b) The commissioner shall not issue a license to a home care provider for five years following the effective date of license nonrenewal or revocation if the owner or managerial official, including any individual who was an owner or managerial official of another home care provider, had a Minnesota license that was not renewed or was revoked as described in paragraph (a).\n(c) Notwithstanding subdivision 1, the commissioner shall not renew, or shall suspend or revoke, the license of any home care provider that includes any individual as an owner or managerial official who was an owner or managerial official of a home care provider whose Minnesota license was not renewed or was revoked as described in paragraph (a) for five years following the effective date of the nonrenewal or revocation.\n(d) The commissioner shall notify the home care provider 30 days in advance of the date of nonrenewal, suspension, or revocation of the license. Within ten days after the receipt of the notification, the home care provider may request, in writing, that the commissioner stay the nonrenewal, revocation, or suspension of the license. The home care provider shall specify the reasons for requesting the stay; the steps that will be taken to attain or maintain compliance with the licensure laws and regulations; any limits on the authority or responsibility of the owners or managerial officials whose actions resulted in the notice of nonrenewal, revocation, or suspension; and any other information to establish that the continuing affiliation with these individuals will not jeopardize client health, safety, or well-being. The commissioner shall determine whether the stay will be granted within 30 days of receiving the provider's request. The commissioner may propose additional restrictions or limitations on the provider's license and require that the granting of the stay be contingent upon compliance with those provisions. The commissioner shall take into consideration the following factors when determining whether the stay should be granted:\n(1) the threat that continued involvement of the owners and managerial officials with the home care provider poses to client health, safety, and well-being;\n(2) the compliance history of the home care provider; and\n(3) the appropriateness of any limits suggested by the home care provider.\nIf the commissioner grants the stay, the order shall include any restrictions or limitation on the provider's license. The failure of the provider to comply with any restrictions or limitations shall result in the immediate removal of the stay and the commissioner shall take immediate action to suspend, revoke, or not renew the license.\nA request for a hearing must be in writing and must:\n(1) be mailed or delivered to the department or the commissioner's designee;\n(2) contain a brief and plain statement describing every matter or issue contested; and\n(3) contain a brief and plain statement of any new matter that the applicant or home care provider believes constitutes a defense or mitigating factor.\nAt any time, the applicant or home care provider and the commissioner may hold an informal conference to exchange information, clarify issues, or resolve issues.\nIn addition to any other remedy provided by law, the commissioner may bring an action in district court to enjoin a person who is involved in the management, operation, or control of a home care provider or an employee of the home care provider from illegally engaging in activities regulated by sections 144A.43 to 144A.482. The commissioner may bring an action under this subdivision in the district court in Ramsey County or in the district in which a home care provider is providing services. The court may grant a temporary restraining order in the proceeding if continued activity by the person who is involved in the management, operation, or control of a home care provider, or by an employee of the home care provider, would create an imminent risk of harm to a recipient of home care services.\nIn matters pending before the commissioner under sections 144A.43 to 144A.482, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. If a person fails or refuses to comply with a subpoena or order of the commissioner to appear or testify regarding any matter about which the person may be lawfully questioned or to produce any papers, books, records, documents, or evidentiary materials in the matter to be heard, the commissioner may apply to the district court in any district, and the court shall order the person to comply with the commissioner's order or subpoena. The commissioner of health may administer oaths to witnesses or take their affirmation. Depositions may be taken in or outside the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served on a named person anywhere in the state by an officer authorized to serve subpoenas in civil actions, with the same fees and mileage and in the same manner as prescribed by law for a process issued out of a district court. A person subpoenaed under this subdivision shall receive the same fees, mileage, and other costs that are paid in proceedings in district court.",
	"repealed": false
}