{
	"id": "446A.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.072",
	"title": "446A.072 WATER INFRASTRUCTURE FUNDING PROGRAM.",
	"text": "The authority will establish a water infrastructure funding program to provide supplemental assistance to governmental units receiving funding through the clean water revolving fund program, the drinking water revolving fund program, or the United States Department of Agriculture Rural Economic and Community Development's (USDA/RECD) Water and Waste Disposal Loans and Grants program for the predesign, design, and construction of municipal wastewater and drinking water systems, including purchase of land and easements. The purpose of the program is to assist governmental units demonstrating financial need to build cost-effective projects to address existing environmental or public health problems. To implement the program, the authority shall establish a water infrastructure fund to provide grants for the purposes authorized under title VI of the Federal Water Pollution Control Act and the federal Safe Drinking Water Act. The fund shall be credited with all investment income from the fund and all repayments of loans, grants, and penalties.\nMS 2000 [Repealed, 2002 c 393 s 91]\n(a) The authority shall provide supplemental assistance, as provided in subdivision 5a to governmental units:\n(1) whose projects are listed on the Pollution Control Agency's project priority list or the Department of Health's project priority list;\n(2) that demonstrate their projects are a cost-effective solution to an existing environmental or public health problem; and\n(3) whose projects are approved by the USDA/RECD or certified by the commissioner of the Pollution Control Agency or the Department of Health.\n(b) For a governmental unit receiving grant funding from the USDA/RECD, applications must be made to the USDA/RECD with additional information submitted to the authority as required by the authority. Eligible project costs and affordability criteria shall be determined by the USDA/RECD.\n(c) For a governmental unit not receiving grant funding from the USDA/RECD, application must be made to the authority on forms prescribed by the authority for the clean water revolving fund program or the drinking water revolving fund program with additional information as required by the authority. In accordance with section 116.182, the Pollution Control Agency or Department of Health shall:\n(1) calculate the essential project component percentage based on the portion of project costs necessary to convey or treat the existing wastewater flows and loadings or, for drinking water projects, to provide safe drinking water to meet existing needs, which must be multiplied by the total project cost to determine the eligible project cost for the program under this section; and\n(2) review and certify approved projects to the authority.\n(d) Each fiscal year the authority shall make funds available for projects based on their ranking on the Pollution Control Agency's project priority list or the Department of Health's project priority list. The authority shall reserve funds for a project when the applicant receives a funding commitment from the United States Department of Agriculture Rural Development (USDA/RECD) or the project is certified by the Pollution Control Agency or Department of Health. Funds must be reserved in an amount based on the project cost estimate submitted to the authority when the project is certified or the as-bid cost, whichever is less.\nMS 2000 [Repealed, 2002 c 393 s 91]\nMS 1997 [Repealed, 1998 c 404 s 84]\nMS 2000 [Repealed, 2002 c 393 s 91]\n(a) For a governmental unit receiving grant funding from the USDA/RECD, the authority may provide assistance in the form of a grant of up to 65 percent of the eligible grant need determined by USDA/RECD. A governmental unit may not receive a grant under this paragraph for more than $5,000,000 per project or $20,000 per existing connection, whichever is less, unless specifically approved by law.\n(b) For a governmental unit receiving a loan from the clean water revolving fund under section 446A.07, the authority may provide assistance under this section in the form of a grant if the average annual residential wastewater system cost after completion of the project would otherwise exceed 1.4 percent of the median household income of the project service area. In determining whether the average annual residential wastewater system cost would exceed 1.4 percent, the authority must consider the total costs associated with building, operating, and maintaining the wastewater system, including existing wastewater debt service, debt service on the eligible project cost, and operation and maintenance costs. Debt service costs for the proposed project are calculated based on the maximum loan term permitted for the clean water revolving fund loan under section 446A.07, subdivision 7. The amount of the grant is equal to 80 percent of the amount needed to reduce the average annual residential wastewater system cost to 1.4 percent of median household income in the project service area, to a maximum of $5,000,000 per project or $20,000 per existing connection, whichever is less, unless specifically approved by law. The eligible project cost is determined by multiplying the total project costs minus any other grants by the essential project component percentage calculated under subdivision 3, paragraph (c), clause (1). In no case may the amount of the grant exceed 80 percent of the eligible project cost.\n(c) For a governmental unit receiving a loan from the drinking water revolving fund under section 446A.081, the authority may provide assistance under this section in the form of a grant if the average annual residential drinking water system cost after completion of the project would otherwise exceed 1.2 percent of the median household income of the project service area. In determining whether the average annual residential drinking water system cost would exceed 1.2 percent, the authority must consider the total costs associated with building, operating, and maintaining the drinking water system, including existing drinking water debt service, debt service on the eligible project cost, and operation and maintenance costs. Debt service costs for the proposed project are calculated based on the maximum loan term permitted for the drinking water revolving fund loan under section 446A.081, subdivision 8, paragraph (c). The amount of the grant is equal to 80 percent of the amount needed to reduce the average annual residential drinking water system cost to 1.2 percent of median household income in the project service area, to a maximum of $5,000,000 per project or $20,000 per existing connection, whichever is less, unless specifically approved by law. The eligible project cost is determined by multiplying the total project costs minus any other grants by the essential project component percentage calculated under subdivision 3, paragraph (c), clause (1). In no case may the amount of the grant exceed 80 percent of the eligible project cost.\n(d) Notwithstanding the limits in paragraphs (a), (b), and (c), for a governmental unit receiving supplemental assistance under this section after January 1, 2002, if the authority determines that the governmental unit's construction and installation costs are significantly increased due to geological conditions of crystalline bedrock or karst areas and discharge limits that are more stringent than secondary treatment, the maximum award under this section shall not be more than $25,000 per existing connection.\nMS 2016 [Repealed by amendment, 1Sp2017 c 8 art 2 s 15]\nDisbursements of grants awarded under this section by the authority to recipients must be made for eligible project costs as incurred by the recipients, and must be made by the authority in accordance with the project financing agreement and applicable state and federal laws and rules governing the payments.\nMS 2016 [Repealed by amendment, 1Sp2017 c 8 art 2 s 15]\nA governmental unit is eligible for assistance under this section only after applying for grant funding from other sources and funding has been obtained, rejected, or the authority has determined that the potential funding is unlikely.\nSupplemental assistance may not be used to reduce the service charges of a significant industrial user that has a separate service charge agreement with the recipient, or a single user that has caused the need for the project or whose current or projected usage exceeds one-half of the current wastewater or drinking water system capacity.\nMS 2000 [Repealed, 2002 c 393 s 91]\nBy February 1 of each even-numbered year, the authority, in conjunction with the Pollution Control Agency and the Department of Health, shall prepare a report to the Finance Division of the senate Environment and Natural Resources Committee and the house of representatives Environment and Natural Resources Finance Committee on wastewater and drinking water funding assistance needs of governmental units under this section.\nEach governmental unit receiving a grant under this section shall establish a system replacement fund and shall annually deposit a minimum of $.50 per 1,000 gallons of flow for major rehabilitation, expansion, or replacement of the wastewater or drinking water system. Money must remain in the account for the life of the corresponding project loan from the authority or USDA/RECD, unless use of the fund is approved in writing by the authority for major rehabilitation, expansion, or replacement of the wastewater or drinking water system. By March 1 each year during the life of the loan, each recipient shall submit a report to the authority regarding the amount deposited and the fund balance for the prior calendar year. A recipient is not required to maintain a fund balance greater than the amount of the grant received. Failure to comply with the requirements of this subdivision shall result in the authority assessing a penalty fee to the recipient equal to one percent of the supplemental assistance amount for each year of noncompliance.\nMS 2000 [Repealed, 2002 c 393 s 91]\nA governmental unit applying for a project in an unsewered area shall include in its application to the authority a certification from the county in which the project is located that:\n(1) the project is consistent with the county comprehensive land use plan, if the county has adopted one;\n(2) the project is consistent with the county water plan, if the county has adopted one; and\n(3) the county has adopted specific land use ordinances or controls so as to meet or exceed the requirements of Minnesota Rules, part 7082.0050.",
	"repealed": false
}