{
	"id": "469.3191",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.3191",
	"title": "469.3191 BREACH OF AGREEMENTS BY BUSINESSES THAT CONTINUE TO OPERATE IN ZONE.",
	"text": "(a) A \"business in violation of its business subsidy agreement but not subject to section 469.319\" means a business that is operating in violation of the business subsidy agreement but maintains a level of operations in the zone that does not subject it to the repayment provisions of section 469.319, subdivision 1, clause (1).\n(b) A business described in paragraph (a) that does not sign a new or amended business subsidy agreement, as authorized under paragraph (h), is subject to repayment of benefits under section 469.319 from the day that it ceases to perform in the zone a substantial level of activities described in the business subsidy agreement.\n(c) A business described in paragraph (a) ceases being a qualified business after the last day that it has to meet the goals stated in the agreement.\n(d) A business is not entitled to any income tax or franchise tax benefits, including refundable credits, for any part of the year in which the business is no longer a qualified business under paragraph (c), and thereafter. A business is not eligible for sales tax benefits beginning with goods or services purchased or put to a taxable use on the day that it is no longer a qualified business under paragraph (c). Property is not exempt from tax under section 272.02, subdivision 64, for any taxes payable in the year following the year in which the business is no longer a qualified business under paragraph (c), and thereafter.\n(e) A business described in paragraph (a) that wants to resume eligibility for benefits under section 469.315 must request that the commissioner of employment and economic development determine the length of time that the business is ineligible for benefits. The commissioner shall determine the length of ineligibility by applying the proportionate level of performance under the agreement to the total duration of the zone as measured from the date that the business subsidy agreement was executed. The length of time must not be less than one full year for each tax benefit listed in section 469.315. The commissioner of employment and economic development and the appropriate local government officials shall consult with the commissioner of revenue to ensure that the period of ineligibility includes at least one full year of benefits for each tax.\n(f) The length of ineligibility determined under paragraph (e) must be applied by reducing the zone duration for the property by the duration of the ineligibility.\n(g) The zone duration of property that has been adjusted under paragraph (f) must not be altered again to permit the business additional benefits under section 469.315.\n(h) A business described in paragraph (a) becomes eligible for benefits available under section 469.315 by entering into a new or amended business subsidy agreement with the appropriate local government unit. The new or amended agreement must cover a period beginning from the date of ineligibility under the original business subsidy agreement, through the zone duration determined by the commissioner under paragraph (f). No exemption of property taxes under section 272.02, subdivision 64, is available under the new or amended agreement for property taxes due or paid before the date of the final execution of the new or amended agreement, but unpaid taxes due after that date need not be paid.\n(i) A business that violates the terms of an agreement authorized under paragraph (h) is permanently barred from seeking benefits under section 469.315 and is subject to the repayment provisions under section 469.319 effective from the day that the business ceases to operate as a qualified business in the zone under the second agreement.",
	"repealed": false
}