{
	"id": "59C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/59C.02",
	"title": "59C.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in subdivisions 2 to 11 have the meanings given them.\n\"Administrator\" means a third party other than the warrantor who is designated by the warrantor to be responsible for the administration of vehicle protection product warranties.\n\"Commissioner\" means the commissioner of commerce.\n\"Department\" means the Department of Commerce.\n\"Incidental costs\" means expenses specified in the warranty incurred by the warranty holder related to the failure of the vehicle protection product to perform as provided in the warranty. Incidental costs may include, without limitation, insurance policy deductibles, rental vehicle charges, the difference between the actual value of the stolen vehicle at the time of theft and the cost of a replacement vehicle, sales taxes, registration fees, transaction fees, and mechanical inspection fees.\n\"Service contract\" means a contract or agreement as regulated under chapter 59B.\n\"Vehicle protection product\" means a vehicle protection device, system, or service that:\n(1) is installed on or applied to a vehicle;\n(2) is designed to prevent loss or damage to a vehicle from a specific cause; and\n(3) includes a written warranty.\nFor purposes of this section, vehicle protection product includes, without limitation, alarm systems; body part marking products; steering locks; window etch products; pedal and ignition locks; fuel and ignition kill switches; and electronic, radio, and satellite tracking devices.\n\"Vehicle protection product warranty\" or \"warranty\" means, for the purposes of this chapter, a written agreement by a warrantor that provides if the vehicle protection product fails to prevent loss or damage to a vehicle from a specific cause, that the warranty holder must be paid specified incidental costs by the warrantor as a result of the failure of the vehicle protection product to perform pursuant to the terms of the warranty.\n\"Vehicle protection product warrantor\" or \"warrantor,\" for the purposes of this chapter, means a person who is contractually obligated to the warranty holder under the terms of the vehicle protection product warranty agreement. Warrantor does not include an authorized insurer providing a warranty reimbursement insurance policy.\n\"Warranty holder,\" for the purposes of this chapter, means the person who purchases a vehicle protection product or who is a permitted transferee.\n\"Warranty reimbursement insurance policy\" means a policy of insurance that is issued to the vehicle protection product warrantor to provide reimbursement to, or to pay on behalf of, the warrantor all covered contractual obligations incurred by the warrantor under the terms and conditions of the insured vehicle protection product warranties sold by the warrantor.",
	"repealed": false
}