{
	"id": "82.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.59",
	"title": "82.59 LICENSING; EXAMINATIONS AND INSTRUCTION.",
	"text": "Each applicant for a license must pass an examination conducted by the commissioner. The examinations shall be of sufficient scope to establish the competency of the applicant to act as a real estate broker or a real estate salesperson.\nNo applicant shall be eligible to take any examination if a license as a real estate broker or salesperson has been revoked in this or any other state within two years of the date of the application.\nThe commissioner shall hold examinations at such times and places as the commissioner may determine, except that said examinations will be held at least every 45 days.\n(a) The examination for a real estate broker's license shall be more exacting than that for a real estate salesperson, and shall require a higher degree of knowledge of the fundamentals of real estate practice and law.\n(b) Every application for a broker's examination shall be accompanied by proof that the applicant has had a minimum of three years of actual experience within the previous five-year period prior to application as a licensed real estate salesperson in this or in another state having comparable requirements or is, in the opinion of the commissioner, otherwise or similarly qualified by reason of education or practical experience. The applicant shall have completed educational requirements in accordance with subdivision 8.\n(c) An applicant for a limited broker's license pursuant to section 82.63, subdivision 13, shall not be required to have a minimum of three years of actual experience as a real estate person in order to obtain a limited broker's license.\n(a) The commissioner may grant a waiver of the real estate licensing experience requirement for the broker's examination to a qualified applicant for a waiver.\n(b) A qualified applicant for a waiver is an individual who:\n(1) has a degree in real estate from an accredited college or university;\n(2) is a licensed practicing attorney whose practice involves real estate law; or\n(3) is a public officer whose official duties involve real estate law or real estate transactions.\n(c) The commissioner shall grant a waiver of the real estate licensing experience requirement for the broker's examination to a qualified individual whose license lapsed or became ineffective and who applies for the waiver. The qualified individual shall not be required to pay a fee or charge for applying for the waiver or retaking the examination. The qualified individual may retake the examination under the terms of the waiver. For purposes of this paragraph, \"qualified individual\" means: (1) an active duty military member on the date of license cancellation or the date by which a timely renewal must have been made; (2) the spouse of an active duty military member on the date of license cancellation or the date by which a timely renewal must have been made; or (3) a veteran or spouse of a veteran who has left service in the two years preceding the date of license cancellation or the date by which a timely renewal must have been made, and has confirmation of an honorable or general discharge status.\nIf a waiver is granted under this paragraph, the commissioner shall not assess or retain any fine or penalty arising from the related licensing action.\n(d) A request for a waiver shall be submitted to the commissioner in writing on a form prescribed by the commissioner and be accompanied by documents necessary to evidence qualification as set forth in paragraph (b).\n(e) The waiver will lapse if the applicant fails to successfully complete the broker's examination within one year from the date of the granting of the waiver.\nA passing grade for a salesperson's and broker's examination shall be a score of 75 percent or higher on the uniform portion and a score of 75 percent or higher on the state portion of the examination.\nThe commissioner shall not accept the scores of a person who has cheated on an examination. Cheating on a real estate examination shall be grounds for denying an application for a broker's or salesperson's license.\nAn examination may be required before the reactivation of any license which has been suspended or revoked. No reexamination shall be required of any individual who has failed to cause renewal of an existing license for reasons that qualify the individual for the exemption for military service under section 326.56, subdivision 2, and no reexamination shall be required of an individual whose license has not been renewed under section 82.82, subdivision 9.\n(a) An applicant for a salesperson's license shall be required to successfully complete a course of study in the real estate field consisting of 30 hours of instruction approved by the commissioner before taking the examination specified in subdivision 1. An applicant for a salesperson's license shall be required to successfully complete an additional course of study in the real estate field consisting of 60 hours of instruction approved by the commissioner, of which three hours shall consist of training in state and federal fair housing laws, regulations, and rules, and of which two hours must consist of training in laws and regulations on agency representation and disclosure, before filing an application for the license. This subdivision does not apply to salespeople licensed in Minnesota before July 1, 1969.\n(b) An applicant for a broker's license must successfully complete a course of study in the real estate field consisting of 30 hours of instruction approved by the commissioner, of which three hours shall consist of training in state and federal fair housing laws, regulations, and rules. The course must have been completed within 12 months prior to the date of application for the broker's license.",
	"repealed": false
}