{
	"id": "142A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.22",
	"title": "142A.22 OVERPAYMENTS BECOME JUDGMENTS BY OPERATION OF LAW.",
	"text": "Any overpayment for assistance granted under chapters 142E and 142G and the Supplemental Nutrition Assistance Program (SNAP), except agency error claims, become a judgment by operation of law 90 days after the notice of overpayment is personally served upon the recipient in a manner that is sufficient under rule 4.03(a) of the Rules of Civil Procedure for district courts, or by certified mail, return receipt requested. This judgment shall be entitled to full faith and credit in this and any other state.\nThis section is limited to overpayments for which notification is issued within the time period specified under section 541.05.\nA judgment is only obtained after:\n(1) a notice of overpayment has been personally served on the recipient or former recipient in a manner sufficient under rule 4.03(a) of the Rules of Civil Procedure for district courts, or mailed to the recipient or former recipient certified mail return receipt requested; and\n(2) the time period under section 142A.20, subdivision 3, has elapsed without a request for a hearing, or a hearing decision has been rendered under section 142A.20 or 142A.27 that concludes the existence of an overpayment that meets the requirements of this section.\nThe notice of overpayment shall include the amount and cause of the overpayment, appeal rights, and an explanation of the consequences of the judgment that will be established if an appeal is not filed timely or if the administrative hearing decision establishes that there is an overpayment that qualifies for judgment.\nA judgment shall be entered and docketed under section 548.09 only after at least three months have elapsed since:\n(1) the notice of overpayment was served on the recipient pursuant to subdivision 3; and\n(2) the last time a monthly recoupment was applied to the overpayment.\nOn or after the date an unpaid overpayment becomes a judgment by operation of law under subdivision 1, the agency or public authority may file with the court administrator:\n(1) a statement identifying, or a copy of, the overpayment notice that provides for an appeal process and requires payment of the overpayment;\n(2) proof of service of the notice of overpayment;\n(3) an affidavit of default, stating the full name, occupation, place of residence, and last known post office address of the debtor; the name and post office address of the agency or public authority; the date or dates the overpayment was incurred; the program that was overpaid; and the total amount of the judgment; and\n(4) an affidavit of service of a notice of entry of judgment shall be made by first class mail at the address where the debtor was served with the notice of overpayment. Service is completed upon mailing in the manner designated.\nOverpayment judgments may be renewed by service of notice upon the debtor. Service must be by first class mail at the last known address of the debtor, with service deemed complete upon mailing in that manner designated, or in the manner provided for the service of civil process. Upon filing of the notice and proof of service, the court administrator shall administratively renew the judgment for the overpayment without any additional filing fee in the same court file as the original overpayment judgment. The judgment must be renewed in an amount equal to the unpaid principal plus the accrued unpaid interest. Overpayment judgments may be renewed multiple times until satisfied.\nNothing in this section shall be construed to impede or restrict alternative recovery methods for these overpayments or overpayments that do not meet the requirements of this section.",
	"repealed": false
}