{
	"id": "383A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.06",
	"title": "383A.06 WELFARE.",
	"text": "Ramsey County shall pay all of the costs of relief of the poor therein and be responsible for all welfare programs within the county, the cost of which is not met from federal, state or private sources.\n(a) Authority. Ramsey County is granted authority to borrow funds and pledge the credit of the county for repayment of the funds for the support of the poor; the governing body of Ramsey County may issue bonds or other evidences of indebtedness to pay therefor when authorized to do so as provided in this subdivision or the charter.\n(b) Bonds. All bonds issued pursuant to this subdivision are to be sold in the manner prescribed by chapter 475, and mature serially, the first installment of which becoming due in not more than three years and the last of which becoming due and payable in not more than ten years from the date of issue. These bonds shall bear interest at an annual rate of not to exceed six percent, payable semiannually, and the governing body of Ramsey County shall provide for the payment thereof in the manner prescribed by chapter 475, and the governing body of Ramsey County shall negotiate and sell the bonds, from time to time, in the amounts that the board of county commissioners sees fit.\nWhile any of these bonds are outstanding and unpaid, there shall be annually levied and collected a tax upon all real and personal property in Ramsey County, sufficient to pay the principal and interest of these bonds as they respectively become due and payable.\n(c) Emergency borrowing. The provisions of this subdivision requiring the submission of the question of issuing bonds for the relief of the poor to a vote of the people does not supersede any law of the state, or charter provision, permitting, in cases of emergency, the issuance of bonds or the borrowing of funds for the relief of the poor without obtaining such a vote.\nMS 1990 [Repealed, 1991 c 51 s 6]",
	"repealed": false
}