{
	"id": "162.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.14",
	"title": "162.14 APPORTIONMENT TO CITIES.",
	"text": "Upon determining the amount of money to be apportioned to each of the cities having a population of 5,000 or more, the commissioner shall forthwith send a statement of the amount to the commissioner of management and budget and to the clerk and engineer of each such city. The amount so apportioned to each city shall be paid by the state to the fiscal officer of the city out of the municipal state-aid street fund as hereinafter provided and in accordance with rules promulgated by the commissioner, not inconsistent herewith.\nMoney so apportioned to each such city shall be used for aid in the establishment, location, construction, reconstruction, improvement, and maintenance of the municipal state-aid street system within each city including the expense of sidewalks, signals and safety devices, including systems that permit an emergency vehicle operator to activate a green traffic signal for the emergency vehicle, on such system approved by the commissioner, provided that in the event of hardship or in the event that the municipal state-aid street system of any municipality is improved to the standards set forth in the commissioner's rules, and subject to the consent of the commissioner and under rules of the commissioner, a portion of the money so apportioned may be used on other streets or roads within the city. The governing body of any such city may, subject to the consent of the commissioner, and under the rules of the commissioner, use a portion of the money so apportioned on any state trunk highway or county state-aid highway within the city. The amount of money to be appropriated by such cities from other funds for use in the establishment, location, construction, reconstruction, improvement, and maintenance of the municipal state-aid street system within the city is hereby left to the direction of the individual governing bodies of the cities.\nThe proportion of each such city's annual apportionment to be used for maintenance on its respective municipal state-aid street system shall be a joint determination of the commissioner and the governing body of each city. In the event that agreement cannot be reached, the determination of the commissioner shall be final.\nWhen the governing body of any such city determines to do any construction work on any municipal state-aid street or other streets within the city upon which money apportioned out of the municipal state-aid street fund may be used as provided in subdivision 2, the governing body shall first obtain the approval of the commissioner. Thereafter, the engineer of the city shall make reports in such manner as the commissioner requires in accordance with the commissioner's rules. Upon receipt of satisfactory reports the commissioner shall certify to the commissioner of management and budget the amount of money that is eligible to be paid from the city's apportionment for the work under contract or actually completed. The commissioner of management and budget shall thereupon issue a payment in that amount payable to the fiscal officers of the city. In no event shall the payment with all other payments issued exceed the amount apportioned to the city.\nThe commissioner of management and budget shall not issue any payments as provided for in subdivision 4 without the prior certification of the commissioner.\nAny such city may make advances from any funds available to it for the purpose of expediting the construction, reconstruction, improvement, or maintenance of its municipal state-aid street system. Advances made by any such city shall be repaid out of subsequent apportionments made to such city in accordance with the commissioner's rules.",
	"repealed": false
}