{
	"id": "169.881",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.881",
	"title": "169.881 VEHICLE PLATOONS.",
	"text": "(a) A person may apply to the commissioner for approval of a plan to use a platooning system on freeways and expressways, as defined in section 160.02, on the trunk highway system. A platooning system may only be used if a plan has been approved by the commissioner. The commissioner must consult with the commissioner of public safety prior to approving the plan, regarding identifiable public safety concerns.\n(b) A plan is valid for one year from the date of issuance, unless the plan is for a shorter period of time, in which case the plan is valid for the shorter time period.\nThe plan must include but is not limited to the following information submitted in the manner prescribed by the commissioner:\n(1) total length of the vehicle platoon;\n(2) the configuration of the vehicle platoon, including spacing between vehicles;\n(3) proposed route and section of freeway or expressway;\n(4) proposed time frames the vehicle platoon will be operating;\n(5) certification that each human driver in the vehicle platoon has a valid driver's license for the type or class of vehicle being driven;\n(6) certification that the vehicle height, width, and weight limits conform to this chapter; and\n(7) vehicle identification information.\n(a) The commissioner may grant or deny a vehicle platoon plan. The approved plan may include reasonable conditions and restrictions to ensure public safety, minimize congestion, or prevent undue damage to roads or structures.\n(b) The commissioner must provide written notice to the applicant and to the commissioner of public safety if a plan is denied and must list the reasons for the denial. The commissioner must approve or deny a plan within 60 days.\nVehicle platoons must meet the following requirements:\n(1) the platoon must not include more than three vehicles;\n(2) each vehicle in the vehicle platoon must have a platooning system installed;\n(3) while platooning, each vehicle must have the platooning system engaged;\n(4) each vehicle in the vehicle platoon must have a human driver present and in the driver seat who is monitoring performance of the vehicle at all times and who holds a valid driver's license for the type or class of vehicle being driven;\n(5) each vehicle in the vehicle platoon must meet the vehicle height, width, and weight limits under this chapter;\n(6) each vehicle in the platoon must be covered by minimum liability insurance; and\n(7) each vehicle in the platoon must have a paper or electronic copy of the approved plan in the vehicle.\nNotwithstanding any other law to the contrary, a vehicle platoon must allow reasonable access for the movement of other motor vehicles to change lanes and enter or exit the roadway.",
	"repealed": false
}