{
	"id": "146A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.11",
	"title": "146A.11 COMPLEMENTARY AND ALTERNATIVE HEALTH CARE CLIENT BILL OF RIGHTS.",
	"text": "(a) All unlicensed complementary and alternative health care practitioners shall provide to each complementary and alternative health care client prior to providing treatment a written copy of the complementary and alternative health care client bill of rights. A copy must also be posted in a prominent location in the office of the unlicensed complementary and alternative health care practitioner. Reasonable accommodations shall be made for those clients who cannot read or who have communication disabilities and those who do not read or speak English. The complementary and alternative health care client bill of rights shall include the following:\n(1) the name, complementary and alternative health care title, business address, and telephone number of the unlicensed complementary and alternative health care practitioner;\n(2) the degrees, training, experience, or other qualifications of the practitioner regarding the complementary and alternative health care being provided, followed by the following statement in bold print:\n\"THE STATE OF MINNESOTA HAS NOT ADOPTED ANY EDUCATIONAL AND TRAINING STANDARDS FOR UNLICENSED COMPLEMENTARY AND ALTERNATIVE HEALTH CARE PRACTITIONERS. THIS STATEMENT OF CREDENTIALS IS FOR INFORMATION PURPOSES ONLY.\nUnder Minnesota law, an unlicensed complementary and alternative health care practitioner may not provide a medical diagnosis or recommend discontinuance of medically prescribed treatments. If a client desires a diagnosis from a licensed physician, chiropractor, or acupuncture practitioner, or services from a physician, chiropractor, nurse, osteopathic physician, physical therapist, dietitian, nutritionist, acupuncture practitioner, athletic trainer, or any other type of health care provider, the client may seek such services at any time.\";\n(3) the name, business address, and telephone number of the practitioner's supervisor, if any;\n(4) notice that a complementary and alternative health care client has the right to file a complaint with the practitioner's supervisor, if any, and the procedure for filing complaints;\n(5) the name, address, and telephone number of the office of unlicensed complementary and alternative health care practice and notice that a client may file complaints with the office;\n(6) the practitioner's fees per unit of service, the practitioner's method of billing for such fees, the names of any insurance companies that have agreed to reimburse the practitioner, or health maintenance organizations with whom the practitioner contracts to provide service, whether the practitioner accepts Medicare or medical assistance, and whether the practitioner is willing to accept partial payment, or to waive payment, and in what circumstances;\n(7) a statement that the client has a right to reasonable notice of changes in services or charges;\n(8) a brief summary, in plain language, of the theoretical approach used by the practitioner in providing services to clients;\n(9) notice that the client has a right to complete and current information concerning the practitioner's assessment and recommended service that is to be provided, including the expected duration of the service to be provided;\n(10) a statement that clients may expect courteous treatment and to be free from verbal, physical, or sexual abuse by the practitioner;\n(11) a statement that client records and transactions with the practitioner are confidential, unless release of these records is authorized in writing by the client, or otherwise provided by law;\n(12) a statement of the client's right to be allowed access to records and written information from records in accordance with sections 144.291 to 144.298;\n(13) a statement that other services may be available in the community, including where information concerning services is available;\n(14) a statement that the client has the right to choose freely among available practitioners and to change practitioners after services have begun, within the limits of health insurance, medical assistance, or other health programs;\n(15) a statement that the client has a right to coordinated transfer when there will be a change in the provider of services;\n(16) a statement that the client may refuse services or treatment, unless otherwise provided by law; and\n(17) a statement that the client may assert the client's rights without retaliation.\n(b) This section does not apply to an unlicensed complementary and alternative health care practitioner who is employed by or is a volunteer in a hospital or hospice who provides services to a client in a hospital or under an appropriate hospice plan of care. Patients receiving complementary and alternative health care services in an inpatient hospital or under an appropriate hospice plan of care shall have and be made aware of the right to file a complaint with the hospital or hospice provider through which the practitioner is employed or registered as a volunteer.\n(c) This section does not apply to a health care practitioner licensed or registered by the commissioner of health or a health-related licensing board who utilizes complementary and alternative health care practices within the scope of practice of the health care practitioner's professional license.\nPrior to the provision of any service, a complementary and alternative health care client must sign a written statement attesting that the client has received the complementary and alternative health care client bill of rights.",
	"repealed": false
}