{
	"id": "216B.2428",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2428",
	"title": "216B.2428 LIFECYCLE GREENHOUSE GAS EMISSIONS ACCOUNTING FRAMEWORK; COST-BENEFIT TEST FOR INNOVATIVE RESOURCES.",
	"text": "By June 1, 2022, the commission shall, by order, issue frameworks the commission must use to calculate lifecycle greenhouse gas emissions intensities of each innovative resource, as follows:\n(1) a general framework to compare the lifecycle greenhouse gas emissions intensities of power-to-hydrogen, strategic electrification, renewable natural gas, district energy, energy efficiency, biogas, carbon capture, and power-to-ammonia; and\n(2) a cost-benefit analytic framework to be applied to innovative resources and innovation plans filed under section 216B.2427 that the commission must use to compare the cost-effectiveness of those resources and plans. This analytic framework must take into account:\n(i) the total incremental cost of the plan or resource and the lifecycle greenhouse gas emissions avoided or reduced by the innovative resource or plan, using the framework developed under clause (1);\n(ii) additional economic costs and benefits, programmatic costs and benefits, additional environmental costs and benefits, and other costs or benefits that may be expected under a plan; and\n(iii) baseline cost-effectiveness criteria against which an innovation plan should be compared. When establishing baseline criteria, the commission must take into account options available to reduce lifecycle greenhouse gas emissions from natural gas end uses and the goals in section 216C.05, subdivision 2, clause (3), and section 216H.02, subdivision 1. To the maximum reasonable extent, the cost-benefit framework must be consistent with environmental cost values established under section 216B.2422, subdivision 3, and other calculations of the social value of greenhouse gas emissions reductions used by the commission. The commission may update frameworks established under this section as necessary.",
	"repealed": false
}