{
	"id": "103G.545",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.545",
	"title": "103G.545 DAMS AND WATER LEVEL CONTROL IN COOK, LAKE, AND ST. LOUIS COUNTIES.",
	"text": "The purpose of this section is to preserve shorelines, rapids, waterfalls, beaches, and other natural features in an unmodified state of nature.\nExcept as provided in this section, specific authority must be given by law after consideration by the legislature with regard to control structures or water levels within or bordering on the area of Cook, Lake, and St. Louis Counties designated in the Act of Congress of July 10, 1930, United States Code, title 16, section 577, before:\n(1) dams or additions to existing dams may be constructed in or across public waters;\n(2) alteration of the natural water level or volume of flowage of public waters may be made; or\n(3) an easement for flooding or overflowing or otherwise affecting state property adjacent to public waters may be granted.\nWith the written approval of the commissioner and the signed authority of the Executive Council, dams for public recreational uses or dams essential for logging or for logging reservoirs that do not exceed 100 acres in size may be constructed to temporarily maintain water levels up to but not higher than the normal high-water marks. The approval is subject to fees recommended by the commissioner, time limitation, and other conditions designed fully to protect the public interest and purpose of this section.\n(a) This section does not apply to the portion of a proposed development for waterpower purposes that was actually occupied and maintained by an applicant for a license to make the development under the terms of the federal waterpower act if the application for the license was pending on or before January 1, 1928.\n(b) The occupant may occupy and use the state lands and waters occupied on January 1, 1928, and used up to an elevation not exceeding two feet above the lowest crest of the spillway or overflow dam of the occupant as constructed on January 1, 1928, for as long as the land and water is needed for waterpower purposes. Water control structures may not be used higher than the structures used before January 1, 1928.\n(c) The occupant shall pay to the state annual compensation determined by the commissioner after investigation for the use of the state lands affected. The occupant must promptly pay the state reasonable compensation for any further damage to state lands or timber caused by waterpower development, other than is covered by the compensation paid for the use of the lands.\nAny person who willfully or knowingly violates a provision of this section or of an order made by the commissioner under this section is guilty of a gross misdemeanor.",
	"repealed": false
}