{
	"id": "237.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.70",
	"title": "237.70 DEVELOPMENT OF TELEPHONE ASSISTANCE PLAN.",
	"text": "The commission shall develop a telephone assistance plan under this section.\nThe telephone assistance plan must be statewide and apply to local service providers that provide local exchange service in Minnesota.\nThe telephone assistance plan must contain adequate provisions to enable local service providers to qualify for waiver of the federal interstate access charge and to enable eligible subscribers to take advantage of the federal matching plan.\n[Repealed, 1988 c 621 s 19]\nThe telephone assistance plan must provide telephone assistance credit for a residential household in Minnesota that is eligible for the federal Lifeline telephone service discount.\nThe telephone assistance plan may provide for telephone assistance credits to eligible households up to the amounts available under the federal matching plan. However, the credits available under the telephone assistance plan may not exceed:\n(1) more than 50 percent of the local exchange rate charged for the local exchange service provided to the household by that household's local service provider; and\n(2) the level of credits that can actually be funded in accordance with the limitations contained in subdivision 6.\nThe commission shall provide for the funding of the telephone assistance plan by assessing a uniform recurring monthly surcharge, not to exceed ten cents per access line, applicable to all classes and grades of access lines provided by each local service provider in the state.\nThe telephone assistance plan must be administered jointly by the commission, the Department of Commerce, and the local service providers in accordance with the following guidelines:\n(a) The commission and the Department of Commerce shall develop an application form that must be completed by the subscriber for the purpose of certifying eligibility for telephone assistance plan credits to the local service provider. The application must contain the applicant's Social Security number. Applicants who refuse to provide a Social Security number will be denied telephone assistance plan credits. The application form must also include a statement that the applicant household is currently eligible for one of the programs that confers eligibility for the federal Lifeline Program. The application must be signed by the applicant, certifying, under penalty of perjury, that the information provided by the applicant is true.\n(b) Each local service provider shall annually mail a notice of the availability of the telephone assistance plan to each residential subscriber in a regular billing and shall mail the application form to customers when requested.\nThe notice must state the following:\nYOU MAY BE ELIGIBLE FOR ASSISTANCE IN PAYING YOUR TELEPHONE BILL IF YOU RECEIVE BENEFITS FROM CERTAIN LOW-INCOME ASSISTANCE PROGRAMS. FOR MORE INFORMATION OR AN APPLICATION FORM PLEASE CONTACT .........\n(c) An application may be made by the subscriber, the subscriber's spouse, or a person authorized by the subscriber to act on the subscriber's behalf. On completing the application certifying that the statutory criteria for eligibility are satisfied, the applicant must return the application to the subscriber's local service provider. On receiving a completed application from an applicant, the subscriber's local service provider shall provide telephone assistance plan credits against monthly charges in the earliest possible month following receipt of the application. The applicant must receive telephone assistance plan credits until the earliest possible month following the service provider's receipt of information that the applicant is ineligible.\nIf the telephone assistance plan credit is not itemized on the subscriber's monthly charges bill for local telephone service, the local service provider must notify the subscriber of the approval for the telephone assistance plan credit.\n(d) The commission shall serve as the coordinator of the telephone assistance plan and be reimbursed for its administrative expenses from the surcharge revenue pool. As the coordinator, the commission shall:\n(1) establish a uniform statewide surcharge in accordance with subdivision 6;\n(2) establish a uniform statewide level of telephone assistance plan credit that each local service provider shall extend to each eligible household in its service area;\n(3) require each local service provider to account to the commission on a periodic basis for surcharge revenues collected by the provider, expenses incurred by the provider, not to include expenses of collecting surcharges, and credits extended by the provider under the telephone assistance plan;\n(4) require each local service provider to remit surcharge revenues to the Department of Public Safety for deposit in the fund; and\n(5) remit to each local service provider from the surcharge revenue pool the amount necessary to compensate the provider for expenses, not including expenses of collecting the surcharges, and telephone assistance plan credits. When it appears that the revenue generated by the maximum surcharge permitted under subdivision 6 will be inadequate to fund any particular established level of telephone assistance plan credits, the commission shall reduce the credits to a level that can be adequately funded by the maximum surcharge. Similarly, the commission may increase the level of the telephone assistance plan credit that is available or reduce the surcharge to a level and for a period of time that will prevent an unreasonable overcollection of surcharge revenues.\n(e) Each local service provider shall maintain adequate records of surcharge revenues, expenses, and credits related to the telephone assistance plan and shall, as part of its annual report or separately, provide the commission and the Department of Commerce with a financial report of its experience under the telephone assistance plan for the previous year. That report must also be adequate to satisfy the reporting requirements of the federal matching plan.\n(f) The Department of Commerce shall investigate complaints against local service providers with regard to the telephone assistance plan and shall report the results of its investigation to the commission.",
	"repealed": false
}