{
	"id": "256P.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.09",
	"title": "256P.09 PROSPECTIVE BUDGETING OF BENEFITS.",
	"text": "Assistance units that qualify for child care assistance programs under chapter 142E, assistance units that receive housing support under chapter 256I and are not subject to reporting under section 256P.10, and assistance units that qualify for Minnesota supplemental aid under chapter 256D are exempt from this section.\nAn agency subject to this chapter must use prospective budgeting to calculate the assistance payment amount.\nFor the purpose of determining an assistance unit's level of benefits, an agency must take into account the income already received by the assistance unit during or anticipated to be received during the application period. Income anticipated to be received only in the initial month of eligibility must only be counted in the initial month.\nAn agency must use prospective budgeting to determine the amount of the assistance unit's benefit for the eligibility period based on the best information available at the time of approval. An agency shall only count anticipated income when the participant and the agency are reasonably certain of the amount of the payment and the month in which the payment will be received. If the exact amount of the income is not known, the agency shall consider only the amounts that can be anticipated as income.\nAn increase in income shall not affect an assistance unit's eligibility or benefit amount until the next review unless otherwise required to be reported in section 256P.07. A decrease in income shall be effective on the date that the change occurs if the change is reported by the tenth of the month following the month when the change occurred. If the assistance unit does not report the change in income by the tenth of the month following the month when the change occurred, the change in income shall be effective on the date that the change was reported.",
	"repealed": false
}