{
	"id": "270C.7109",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.7109",
	"title": "270C.7109 AUTHORITY TO RELEASE LEVY AND RETURN PROPERTY.",
	"text": "The commissioner shall release a levy on all or part of the property or rights to property levied on and shall promptly notify the person on whom the levy was made that the levy has been released if: (1) the liability for which the levy was made is satisfied or has become unenforceable by lapse of time; (2) release of the levy will facilitate collection of the liability; (3) the taxpayer has entered into an installment payment agreement under section 270C.52, subdivision 2, unless the agreement provides otherwise, or unless release of the levy will jeopardize the status of the department as a secured creditor; or (4) the fair market value of the property exceeds the liability, and release of the levy on a part of the property can be made without hindering collection. In the case of tangible personal property essential in carrying on the trade or business of the taxpayer, the commissioner shall provide for an expedited determination under this subdivision. A release of levy under this subdivision does not prevent a subsequent levy on the property released.\nIf the commissioner determines that property has been wrongfully levied upon, it shall be lawful for the commissioner to return:\n(a) The specific property levied upon, at any time;\n(b) An amount of money equal to the amount of money levied upon, at any time before the expiration of nine months from the date of the levy; or\n(c) An amount of money equal to the amount of money received by the state of Minnesota from a sale of the property, at any time before the expiration of nine months from the date of the sale.\nFor purposes of clause (c), if property is declared purchased by the state of Minnesota at a sale pursuant to section 270C.7101, subdivision 5 (relating to manner and conditions of sale), the state of Minnesota shall be treated as having received an amount of money equal to the minimum price determined pursuant to section 270C.7101, subdivision 5, or, if larger, the amount received by the state of Minnesota from the resale of the property.",
	"repealed": false
}