{
	"id": "148.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.925",
	"title": "148.925 SUPERVISION.",
	"text": "For the purpose of meeting the requirements of the Minnesota Psychology Practice Act, supervision means documented in-person consultation that employs a collaborative relationship that has both facilitative and evaluative components with the goal of enhancing the professional competence and science, and practice-informed professional work of the supervisee. Supervision may include telesupervision between primary or designated supervisors and the supervisee. The supervision shall be adequate to assure the quality and competence of the activities supervised. Supervisory consultation shall include discussions on the nature and content of the practice of the supervisee, including, but not limited to, a review of a representative sample of psychological services in the supervisee's practice.\nPostdegree supervised psychological employment means required paid or volunteer work experience and postdegree training of an individual seeking to be licensed as a licensed psychologist that involves the professional oversight by a primary supervisor and satisfies the supervision requirements in the Minnesota Psychology Practice Act.\nSupervision of an applicant for licensure as a licensed psychologist shall be provided by an individual:\n(1) who is a psychologist licensed in Minnesota with a doctoral degree and competence both in supervision in the practice of psychology and in the activities being supervised;\n(2) who has a doctoral degree with a major in psychology, who is employed by a regionally accredited educational institution or is employed by a federal, state, county, or local government institution, agency, or research facility, and who has competence both in supervision in the practice of psychology and in the activities being supervised, provided the supervision is being provided and the activities being supervised occur within that regionally accredited educational institution or federal, state, county, or local government institution, agency, or research facility;\n(3) who is licensed or certified as a psychologist in another jurisdiction and who has competence both in supervision in the practice of psychology and in the activities being supervised;\n(4) who is a psychologist licensed in Minnesota who was licensed before August 1, 1991, with competence both in supervision in the practice of psychology and in the activities being supervised; or\n(5) who, in the case of a designated supervisor, is a master's or doctorally prepared mental health professional.\n[Repealed by amendment, 1Sp2017 c 6 art 11 s 46]\nSupervision of an applicant for licensure as a licensed psychologist must total 100 hours and must include two hours per week of regularly scheduled in-person consultations. For full-time experience, one hour must be with the primary supervisor on an individual basis. The remaining hour may be with a designated supervisor. The board may approve an exception to the weekly supervision requirement for a week when the supervisor was ill or otherwise unable to provide supervision. The board may prorate the two hours per week of supervision for individuals preparing for licensure on a part-time basis. Supervised psychological employment does not qualify for licensure when the supervisory consultation is not adequate as described in subdivision 1, or in the board rules. The board shall not require a supervisee to have more than two hours of supervision per week for the purpose of obtaining a license, unless the supervisee is making up missed hours as permitted by the board.\nIndividuals preparing for licensure as a licensed psychologist during their postdegree supervised psychological experience may perform any of the services specified in section 148.89, if the services are performed as part of their training.\n[Repealed by amendment, 1Sp2017 c 6 art 11 s 46]",
	"repealed": false
}