{
	"id": "306.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.90",
	"title": "306.90 CONSTRUCTION PERFORMANCE BOND.",
	"text": "Any person, firm, partnership, association, or corporation selling burial space in a mausoleum or columbarium before the mausoleum or columbarium is completed and usable shall obtain a performance bond in an amount sufficient to cover all construction costs associated with building the mausoleum or columbarium as promised at the time of sale. The bond shall be executed by an insurance company authorized to do business in Minnesota which has sufficient net worth to satisfy the amount of the bond and which has given consent to be sued in Minnesota.\nThe bond shall be in favor of the state for the benefit of any purchaser who suffers a loss due to failure of the seller to deliver the promised structure. Any person claiming against the bond may file a claim with the surety, and if the claim is not paid, may maintain an action based on the bond and recover against the surety. The attorney general may file a claim with the surety on behalf of any purchaser. The surety shall pay the amount of the claims to the attorney general for distribution to the claimants entitled to restitution and shall be relieved of liability to that extent. If the claim is not paid, the attorney general may maintain an action against the surety on behalf of the claimants.\nThe aggregate liability of the surety to all persons buying space in the mausoleum or columbarium shall not exceed the amount of the bond.\nAny person, firm, partnership, association, or corporation selling burial space in a mausoleum or columbarium before the mausoleum or columbarium is completed and usable shall file a copy of the performance bond with the county auditor of the county in which the mausoleum or columbarium will be built 30 days before the entity may sell space and begin construction. There shall be paid to the county auditor a filing fee of $15 for each copy of the bond.\nAny person, firm, partnership, association, or corporation which has begun selling burial space in a mausoleum or columbarium before the mausoleum or columbarium is complete and usable as promised at time of sale, and before August 1, 1988, shall file a copy of the performance bond 30 days after August 1, 1988, or cease all sales. The performance bond must meet the criteria in this section except that if the structure is partially completed, the bond must cover only the remaining construction costs necessary to complete the structure as promised at time of sale. There shall be paid to the county auditor a filing fee of $15 for each copy of the bond.\nThis section shall not apply to cemeteries, mausoleums, or columbariums owned and operated by a municipality, church, religious corporation, or religious association.\nAny person, firm, partnership, association, or corporation knowingly violating the provisions of this section shall be guilty of a misdemeanor and for a second offense shall be guilty of a gross misdemeanor.",
	"repealed": false
}