{
	"id": "144.4808",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4808",
	"title": "144.4808 APPREHEND AND HOLD ORDER.",
	"text": "The commissioner may make an ex parte application for an order to apprehend and hold a carrier who is not in a treatment facility if the commissioner has probable cause to believe that a carrier is:\n(1) an endangerment to the public health; and\n(2) either in imminent danger of exposing another person or persons to tuberculosis, or may flee or become unlocatable.\nThe commissioner shall file the application in the probate division of the district court of the county in which the carrier resides. The application may be filed orally by telephone or by facsimile, provided that a written application is filed within 72 hours, excluding Saturdays, Sundays, and legal holidays.\nThe court may find probable cause to apprehend and hold the carrier based upon a written statement by facsimile or oral statement by telephone from the carrier's attending physician or nurse, a public health physician or nurse, other licensed health professional, or disease prevention officer, stating the grounds and facts that demonstrate that the carrier is an endangerment to the public health, provided that an affidavit from such witness is filed with the court within 72 hours, excluding Saturdays, Sundays, and legal holidays. The court may issue an order to a peace officer or to a disease prevention officer, or both to:\n(1) apprehend and transport the carrier to a designated treatment facility, and detain the carrier until the carrier is admitted to the treatment facility; or\n(2) apprehend and isolate the carrier.\nThe order may be issued orally by telephone, or by facsimile, provided that a written order is issued within 72 hours, excluding Saturdays, Sundays, and legal holidays. The oral and written order shall contain a notice of the carrier's rights contained in section 144.4805, subdivision 3, clause (6).\nA carrier may be detained under this subdivision up to six days, excluding Saturdays, Sundays, and legal holidays. A carrier may not be released prior to the expiration of the hold authorized under this section without the express consent of the commissioner.\nIf the carrier flees or forcibly resists the peace officer or disease prevention officer, the officer may use all necessary and lawful means to apprehend, hold, transport, or isolate the carrier. This subdivision is authority for the officer to carry out the duties specified in this section. The commissioner shall provide any information and equipment necessary to protect the officer from becoming exposed to tuberculosis.\nIf the carrier does not have counsel at the time the court issues an apprehend and hold order under subdivision 2, the court shall promptly appoint counsel for the carrier.\nA disease prevention officer, peace officer, physician, licensed health professional, or treatment facility that acts in good faith under this section is immune from liability in any civil, administrative, disciplinary, or criminal action for acting under this section.",
	"repealed": false
}