{
	"id": "245C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.12",
	"title": "245C.12 BACKGROUND STUDY; TRIBAL ORGANIZATIONS.",
	"text": "For the purposes of background studies completed by tribal organizations performing licensing activities otherwise required of the commissioner under this chapter, after obtaining consent from the background study subject, tribal licensing agencies shall have access to criminal history data in the same manner as county licensing agencies and private licensing agencies under this chapter.\nTribal organizations may contract with the commissioner to obtain background study data on individuals under tribal jurisdiction related to adoptions according to section 245C.34. Tribal organizations may also contract with the commissioner to obtain background study data on individuals under tribal jurisdiction related to child foster care according to section 245C.34.\nFor the purposes of background studies completed to comply with a tribal organization's licensing requirements for individuals affiliated with a tribally licensed nursing facility, the commissioner shall obtain criminal history data from the National Criminal Records Repository in accordance with section 245C.32.\n(a) Tribal organizations may contract with the commissioner to:\n(1) conduct background studies on individuals affiliated with a child care program sponsored, managed, or licensed by a tribal organization; and\n(2) obtain background study data on individuals affiliated with a child care program sponsored, managed, or licensed by a tribal organization.\n(b) The commissioner must include a national criminal history record check in a background study conducted under paragraph (a).\n(c) A tribally affiliated child care program that does not contract with the commissioner to conduct background studies is exempt from the relevant requirements in this chapter. For a background study conducted under this subdivision to be transferable to other child care entities, the study must include all components of studies for a certified license-exempt child care center under this chapter.",
	"repealed": false
}