{
	"id": "61A.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.245",
	"title": "61A.245 STANDARD NONFORFEITURE LAW FOR INDIVIDUAL DEFERRED ANNUITIES.",
	"text": "This section shall be known as the \"Standard Nonforfeiture Law for Individual Deferred Annuities.\"\nThis section shall not apply to any reinsurance, group annuity purchased under a retirement plan or plan of deferred compensation established or maintained by an employer, including but not limited to a partnership or sole proprietorship, or by an employee organization, or by both, other than a plan providing individual retirement accounts or individual retirement annuities under section 408 of the Internal Revenue Code, as amended, premium deposit fund, variable annuity, investment annuity, immediate annuity, any deferred annuity contract after annuity payments have commenced, or reversionary annuity, nor to any contract which shall be delivered outside this state through an agent or other representative of the company issuing the contract.\n(a) In the case of contracts issued on or after the operative date specified in subdivision 12, no contract of annuity, except as stated in subdivision 2, shall be delivered or issued for delivery in this state unless it contains in substance the following provisions, or corresponding provisions which in the opinion of the commissioner are at least as favorable to the contract holder, upon cessation of payment of considerations under the contract:\n(1) that upon cessation of payment of considerations under a contract, or upon the written request of the contract owner, the company shall grant a paid-up annuity benefit on a plan stipulated in the contract of the value specified in subdivisions 5, 6, 7, 8 and 10;\n(2) if a contract provides for a lump-sum settlement at maturity, or at any other time, that upon surrender of the contract at or prior to the commencement of any annuity payments, the company shall pay in lieu of any paid-up annuity benefit a cash surrender benefit of the amount specified in subdivisions 5, 6, 8 and 10. The company may reserve the right to defer the payment of the cash surrender benefit for a period not to exceed six months after demand therefor with surrender of the contract after making a written request and receiving written approval of the commissioner. The request must address the necessity and equitability to all contract holders of the deferral;\n(3) a statement of the mortality table, if any, and interest rates used in calculating any minimum paid-up annuity, cash surrender or death benefits that are guaranteed under the contract, together with sufficient information to determine the amounts of the benefits; and\n(4) a statement that any paid-up annuity, cash surrender or death benefits that may be available under the contract are not less than the minimum benefits required by any statute of the state in which the contract is delivered and an explanation of the manner in which the benefits are altered by the existence of any additional amounts credited by the company to the contract, any indebtedness to the company on the contract or any prior withdrawals from or partial surrenders of the contract.\n(b) Notwithstanding the requirements of this subdivision, any deferred annuity contract may provide that if no considerations have been received under a contract for a period of two full years and the portion of the paid-up annuity benefit at maturity on the plan stipulated in the contract arising from considerations paid prior to that period would be less than $20 monthly, the company may at its option terminate the contract by payment in cash of the then present value of the portion of the paid-up annuity benefit, calculated on the basis of the mortality table, if any, and interest rate specified in the contract for determining the paid-up annuity benefit, and by the payment shall be relieved of any further obligation under the contract.\n(c) If a death benefit becomes payable as specified in the contract, the contract may not treat the payment of the death benefit as a surrender of the annuity contract or otherwise impose a surrender penalty.\nThe minimum values as specified in subdivisions 5, 6, 7, 8, and 10 of any paid-up annuity, cash surrender or death benefits available under an annuity contract shall be based upon minimum nonforfeiture amounts as defined in this subdivision.\n(a) The minimum nonforfeiture amount at any time at or prior to the commencement of any annuity payments shall be equal to an accumulation up to that time at rates of interest as indicated in paragraph (b) of the net considerations, as defined in this subdivision, paid prior to that time, decreased by the sum of clauses (1) through (4):\n(1) any prior withdrawals from or partial surrenders of the contract accumulated at rates of interest as indicated in paragraph (b);\n(2) an annual contract charge of $50, accumulated at rates of interest as indicated in paragraph (b);\n(3) any premium tax paid by the company for the contract and not subsequently credited back to the company, such as upon early termination of the contract, in which case this decrease must not be taken, accumulated at rates of interest as indicated in paragraph (b); and\n(4) the amount of any indebtedness to the company on the contract, including interest due and accrued.\nThe net considerations for a given contract year used to define the minimum nonforfeiture amount shall be an amount equal to 87.5 percent of the gross considerations credited to the contract during that contract year.\n(b) The interest rate used in determining minimum nonforfeiture amounts must be an annual rate of interest determined as the lesser of three percent per annum and the following, which must be specified in the contract if the interest rate will be reset:\n(1) the five-year constant maturity treasury rate reported by the Federal Reserve as of a date, or average over a period, rounded to the nearest 1/20 of one percent, specified in the contract no longer than 15 months prior to the contract issue date or redetermination date under clause (4);\n(2) reduced by 125 basis points;\n(3) where the resulting interest rate is not less than 0.15 percent; and\n(4) the interest rate shall apply for an initial period and may be redetermined for additional periods. The redetermination date, basis, and period, if any, shall be stated in the contract. The basis is the date or average over a specified period that produces the value of the five-year constant maturity treasury rate to be used at each redetermination date.\n(c) During the period or term that a contract provides substantive participation in an equity indexed benefit, it may increase the reduction described in clause (2) by up to an additional 100 basis points to reflect the value of the equity index benefit. The present value at the contract issue date, and at each redetermination date thereafter, of the additional reduction must not exceed the market value of the benefit. The commissioner may require a demonstration that the present value of the additional reduction does not exceed the market value of the benefit. Lacking such a demonstration that is acceptable to the commissioner, the commissioner may disallow or limit the additional reduction.\nAny paid-up annuity benefit available under a contract shall be such that its present value on the date annuity payments are to commence is at least equal to the minimum nonforfeiture amount on that date. The present value shall be computed using the mortality table, if any, and the interest rates specified in the contract for determining the minimum paid-up annuity benefits guaranteed in the contract.\nFor contracts which provide cash surrender benefits, the cash surrender benefits available prior to maturity shall not be less than the present value as of the date of surrender of that portion of the maturity value of the paid-up annuity benefit which would be provided under the contract at maturity arising from considerations paid prior to the time of cash surrender reduced by the amount appropriate to reflect any prior withdrawals from or partial surrenders of the contract, the present value being calculated on the basis of an interest rate not more than one percent higher than the interest rate specified in the contract for accumulating the considerations to determine the maturity value, decreased by the amount of any indebtedness to the company on the contract, including interest due and accrued, and increased by any existing additional amounts credited by the company to the contract. In no event shall any cash surrender benefit be less than the minimum nonforfeiture amount at that time. The death benefit under the contracts shall be at least equal to the cash surrender benefit.\nFor contracts which do not provide cash surrender benefits, the present value of any paid-up annuity benefit available as a nonforfeiture option at any time prior to maturity shall not be less than the present value of that portion of the maturity value of the paid-up annuity benefit provided under the contract arising from considerations paid prior to the time the contract is surrendered in exchange for, or changed to, a deferred paid-up annuity, the present value being calculated for the period prior to the maturity date on the basis of the interest rate specified in the contract for accumulating the net considerations to determine the maturity value, and increased by any existing additional amounts credited by the company to the contract. For contracts which do not provide any death benefits prior to the commencement of any annuity payments, the present values shall be calculated on the basis of the interest rate referred to in this subdivision and the mortality table specified in the contract for determining the maturity value of the paid-up annuity benefit. However, in no event shall the present value of a paid-up annuity benefit be less than the minimum nonforfeiture amount at that time.\nFor the purpose of determining the benefits calculated under subdivisions 6 and 7, in the case of annuity contracts under which an election may be made to have annuity payments commence at optional maturity dates, the maturity date shall be deemed to be the latest date for which election shall be permitted by the contract, but shall not be deemed to be later than the anniversary of the contract next following the annuitant's seventieth birthday or the tenth anniversary of the contract, whichever is later.\nAny contract which does not provide cash surrender benefits or does not provide death benefits at least equal to the minimum nonforfeiture amount prior to the commencement of any annuity payments shall include a statement in a prominent place in the contract that the benefits are not provided.\nAny paid-up annuity, cash surrender or death benefits available at any time, other than on the contract anniversary under any contract with fixed scheduled considerations, shall be calculated with allowance for the lapse of time and the payment of any scheduled considerations beyond the beginning of the contract year in which cessation of payment of considerations under the contract occurs.\nFor any contract which provides, within the same contract by rider or supplemental contract provision, both annuity benefits and life insurance benefits that are in excess of the greater of cash surrender benefits or a return of the gross considerations with interest, the minimum nonforfeiture benefits shall be equal to the sum of the minimum nonforfeiture benefits for the annuity portion and the minimum nonforfeiture benefits, if any, for the life insurance portion computed as if each portion were a separate contract. Notwithstanding the provisions of subdivisions 5, 6, 7, 8 and 10, additional benefits payable (a) in the event of total and permanent disability, (b) as reversionary annuity or deferred reversionary annuity benefits, or (c) as other policy benefits additional to life insurance, endowment, and annuity benefits, and considerations for all the additional benefits, shall be disregarded in ascertaining the minimum nonforfeiture amounts, paid-up annuity, cash surrender and death benefits that may be required by this section. The inclusion of the additional benefits shall not be required in any paid-up benefits, unless the additional benefits separately would require minimum nonforfeiture amounts, paid-up annuity, cash surrender and death benefits.\nAfter August 1, 2003, a company may elect to apply its provisions to annuity contracts on a contract form-by-contract form basis before August 1, 2005. In this instance, the operative date of Laws 2003, chapter 51, sections 10 to 14, is the date elected for the contract form. In all other instances, Laws 2003, chapter 51, sections 10 to 14, apply to annuity contracts issued by the company after August 1, 2005, which then becomes the operative date of Laws 2003, chapter 51, sections 10 to 14.",
	"repealed": false
}