{
	"id": "168.129",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.129",
	"title": "168.129 SPECIAL COLLEGIATE PLATES.",
	"text": "The commissioner shall issue special collegiate plates to an applicant who:\n(1) is a registered owner of a passenger automobile;\n(2) pays a fee as specified in section 168.12, subdivision 5, to cover the costs of handling and manufacturing the plates;\n(3) pays the registration tax required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes at least $25 annually to the scholarship account established in subdivision 6; and\n(6) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\n(a) After consultation with each participating college, university, or postsecondary system, the commissioner shall design an emblem for each special collegiate plate.\n(b) In consultation with the commissioner, a participating college or university annually shall indicate the anticipated number of plates needed.\nContributions under this section must not be refunded.\nDespite section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another passenger automobile registered to the individual to whom the special collegiate plates were issued.\nFees collected under this section do not include the contributions collected for the scholarship account.\nA scholarship account is created in the state treasury. Except for one percent that may be retained by the commissioner for administrative costs, all contributions received under this section must be deposited by the commissioner in the scholarship account. Money in the scholarship account is appropriated to the governing board of the institution to which it is attributable, as provided in subdivision 7.\nThe commissioner shall maintain a record of the number of plates issued for each postsecondary institution or system to determine the amount of scholarship funds available to that institution or system.",
	"repealed": false
}