{
	"id": "103E.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.315",
	"title": "103E.315 ASSESSING DRAINAGE BENEFITS AND DAMAGES.",
	"text": "Property owned by the state must have benefits and damages reported in the same manner as taxable lands subject to the provisions relating to conservation areas in section 103E.025.\nThe viewers shall report the benefits and damages to the state, counties, and municipalities from the proposed drainage project. The property within the jurisdiction of a municipality, whether owned by the municipality or by private parties, may be assessed as benefits and damages to the municipality.\nIf a public road or street is benefited or damaged, the state, county, or political subdivision that is the governmental unit with the legal duty of maintaining the road or street, must be assessed benefits or damages to the road or street, except that benefits and damages for bridges and culverts must be assessed to the governmental unit that has the legal duty to construct and maintain the bridge or culvert under section 103E.525.\nThe viewers shall report the benefits and damages to railways and other utilities, including benefits and damages to property used for railway or other utility purposes.\n(a) The viewers shall determine the amount of benefits to all property within the watershed, whether the property is benefited immediately by the construction of the proposed drainage project or the proposed drainage project can become an outlet for drainage, makes an outlet more accessible, or otherwise directly benefits the property. The benefits may be based on:\n(1) an increase in the current market value of property as a result of constructing the project;\n(2) an increase in the potential for agricultural production as a result of constructing the project; or\n(3) an increased value of the property as a result of a potential different land use.\n(b) Benefits and damages may be assessed only against the property benefited or damaged or an easement interest in property for the exclusive use of the surface of the property.\n(a) If the proposed drainage project furnishes an outlet to an existing drainage system and benefits the property drained by the existing system, the viewers shall equitably determine and assess:\n(1) the benefits of the proposed drainage project to each tract or lot drained by the existing drainage system;\n(2) a single amount as an outlet benefit to the existing drainage system; or\n(3) benefits on a watershed acre basis.\n(b) Assessments that conform with the provisions in this subdivision are valid. If a single sum is assessed as an outlet benefit, the lien for the assessment must be prorated on all property benefited by the existing drainage system in proportion to the benefits determined for the existing drainage system.\n(c) Within the watershed that drains to the area where a project is located, the viewers may assess outlet benefits on:\n(1) property that is responsible for increased sedimentation in downstream areas of the watershed; and\n(2) property that is responsible for increased drainage system maintenance or increased drainage system capacity because the natural drainage on the property has been altered or modified to accelerate the drainage of water from the property.\nIf part of a drainage project increases drainage capacity and the increased capacity is necessary due to increased drainage in the project watershed rather than increased drainage in a specific area, the viewers may assess benefits on property in the project watershed on a pro rata basis.\n(a) Damages to be paid may include:\n(1) the fair market value of the property required for the channel of an open ditch and the permanent strip of perennial vegetation under section 103E.021;\n(2) the diminished value of a farm due to severing a field by an open ditch;\n(3) loss of crop production during drainage project construction;\n(4) the diminished productivity or land value from increased overflow; and\n(5) costs to restore a perennial vegetative cover or structural practice existing under a federal or state conservation program adjacent to the permanent drainage system right-of-way and damaged by the drainage project.\n(b) When damages are determined to acquire or otherwise provide compensation for buffer strips or alternative riparian water quality practices previously installed as required by section 103F.48, subdivision 3, the viewers and drainage authority shall consider the land use prior to buffer strip or alternative practice installation in determining the fair market value of the property under paragraph (a), clause (1).",
	"repealed": false
}