{
	"id": "149A.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.90",
	"title": "149A.90 DEATH; REGISTRATION AND REMOVAL FROM PLACE OF DEATH.",
	"text": "(a) Except as provided in this section, a death record must be completed and filed for every known death by the mortician, funeral director, or other person lawfully in charge of the final disposition of the body.\n(b) If the body is that of an individual whose identity is unknown, the person in charge of the final disposition of the body must notify the commissioner for purposes of compliance with section 144.05, subdivision 4.\nNo person subject to regulation under this chapter shall remove or cause to be removed any dead human body from the place of death without being licensed or registered by the commissioner. Every dead human body shall be removed from the place of death by a licensed mortician or funeral director, except as provided in section 149A.01, subdivision 3.\nReferrals to the coroner or medical examiner are outlined in section 390.11.\nNo dead human body shall be removed from the place of death by a mortician, funeral director, or transfer care specialist or by a noncompensated person with the right to control the dead human body without the completion of a certificate of removal and, where possible, presentation of a copy of that certificate to the person or a representative of the legal entity with physical or legal custody of the body at the death site. The certificate of removal shall be in the format provided by the commissioner that contains, at least, the following information:\n(1) the name of the deceased, if known;\n(2) the date and time of removal;\n(3) a brief listing of the type and condition of any personal property removed with the body;\n(4) the location to which the body is being taken;\n(5) the name, business address, and license number of the individual making the removal; and\n(6) the signatures of the individual making the removal and, where possible, the individual or representative of the legal entity with physical or legal custody of the body at the death site.\nA copy of the certificate of removal shall be given, where possible, to the person or representative of the legal entity having physical or legal custody of the body at the death site. The original certificate of removal shall be retained by the individual making the removal and shall be kept on file, at the funeral establishment to which the body was taken, for a period of three calendar years following the date of the removal. If the removal was performed by a transfer care specialist not employed by the funeral establishment to which the body was taken, the transfer care specialist must retain a copy of the certificate of removal at the transfer care specialist's business address as registered with the commissioner for a period of three calendar years following the date of removal. Following this period, and subject to any other laws requiring retention of records, the funeral establishment may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of the removal of the body. At the end of this period and subject to any other laws requiring retention of records, the funeral establishment may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified in the records.\nEvery individual removing a dead human body from the place of death shall use universal precautions and otherwise exercise all reasonable precautions to minimize the risk of transmitting any communicable disease from the body. Before removal, the body shall be wrapped in a sheet or pouch that is impervious to liquids, covered in such a manner that the body cannot be viewed, and placed on a regulation ambulance cot or on an aircraft ambulance stretcher. A person with the right to control the dead human body or that person's noncompensated designee may use any appropriate cot, stretcher, or tray rigid enough to support a dead human body. Any dead human body measuring 36 inches or less in length may be removed after having been properly wrapped, covered, and encased, but does not need to be placed on an ambulance cot, aircraft ambulance stretcher, or rigid tray.\nA dead human body may be transported from the place of death by any vehicle that meets the following standards:\n(1) promotes respect for and preserves the dignity of the dead human body;\n(2) shields the body from being viewed from outside of the conveyance;\n(3) has ample enclosed area to accommodate a cot, stretcher, or rigid tray in a horizontal position;\n(4) is so designed to permit loading and unloading of the body without excessive tilting of the cot, stretcher, or rigid tray; and\n(5) if used for the transportation of more than one dead human body at one time, the vehicle must be designed so that a body or container does not rest directly on top of another body or container and that each body or container is secured to prevent the body or container from excessive movement within the conveyance. A dead human body measuring 36 inches or less in length may be transported from the place of death by passenger automobile. For purposes of this subdivision, a passenger automobile is a vehicle designed and used for carrying not more than ten persons, but excludes motorcycles and motor scooters.\nThe funeral establishment to which a dead human body is taken shall have an appropriate holding facility for storing the body while awaiting final disposition. The holding facility must be secure from access by anyone except the authorized personnel of the funeral establishment, preserve the dignity of the remains, and protect the health and safety of the funeral establishment personnel.",
	"repealed": false
}