{
	"id": "240.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.30",
	"title": "240.30 CARD CLUBS.",
	"text": "A class B licensee conducting pari-mutuel betting on horse racing at a class A racetrack may operate a card club at the racetrack and offer card playing services to patrons only if the commission has authorized the licensee to operate a card club operation under section 240.07, subdivision 3, paragraph (b), and the commission has approved the licensee's plan of operation under subdivision 6. The commission may withdraw its authorization for operation of a card club at any time for a violation of a law or rule governing card club operation.\nThe authorized licensee is responsible for conducting and supervising the card games, providing all necessary equipment, services, and personnel, and reimbursing the commission for costs related to card club regulation and enforcement.\nMS 2010 [Repealed, 2012 c 279 s 6]\nThe authorized licensee may charge patrons for card playing services by deducting and retaining money from wagers, by charging a fee based on playing time, or by any other means authorized by the commission.\n(a) The commission shall not authorize a licensee to operate a card club if the licensee has not conducted at least 50 days of live racing at a class A facility within the past 12 months or during the preceding calendar year unless the commission authorizes a shorter period as a result of an epidemic, natural disaster, flood, war, or other circumstances beyond the licensee's control that made conducting 50 days of live racing untenable for either public or equine health, welfare, or safety.\n(b) Any authorization by the commission for a shorter period under paragraph (a), must be approved in writing by the horsepersons' organization representing the majority of horsepersons racing the breed racing the majority of races at the licensee's class A facility during the preceding 12 months.\n(a) The commission shall not authorize a class B licensee to operate a card club unless the licensee has submitted, and the commission approved, a plan of operation for card playing activities. The plan must set forth all necessary details for conducting card playing activities, including, among other things:\n(1) specifying and defining all card games to be played, including all governing aspects of each game;\n(2) time and location of card playing activities;\n(3) amount and method by which participants will be charged for card playing services;\n(4) arrangements to ensure the security of card playing activities;\n(5) designation of all licensed employees of the licensee who undertake supervisory positions related to card playing activities;\n(6) internal control systems for card playing activities; and\n(7) a plan for the training of card club personnel in identification of problem gamblers and appropriate action to prevent or control problem gambling.\n(b) The licensee must prepare and make available to all customers a written manual that covers all portions of the current plan of operation. The licensee must also publish, in pamphlet form, a condensed and comprehensive version of the manual and make it available to all customers.\n(a) The licensee may amend the plan of operation only with the commission's approval. The commission may withdraw its approval of a plan of operation.\n(b) Card club activities are deemed to be relevant to the integrity of horse racing activities in Minnesota for purposes of sections 240.03; 240.06, subdivision 7; 240.08; and 240.27, subdivision 1.\n(c) A violation of a law or rule relating to card club operation or a violation of an approved plan of operation is deemed to be a violation of law or rule for purposes of section 240.22.\n(d) A violation of an approved plan of operation is deemed to be a violation of a rule of the commission for purposes of section 240.26, subdivision 3.\n(e) Card playing at a card club is deemed to be a bet at a licensed racetrack for purposes of section 240.28, subdivision 2.\nThe commission may not approve any plan of operation under subdivision 6 that exceeds any of the following limitations:\n(1) the maximum number of tables used for card playing at the card club at any one time, other than tables used for instruction, demonstrations, or poker tournament play, may not exceed 80;\n(2) except as provided in clause (3), no wager may exceed $100;\n(3) for games in which each player is allowed to make only one wager or has a limited opportunity to change that wager, no wager may exceed $300; and\n(4) no inclusion of any historical horse racing or any other form of gambling that is not expressly authorized for racetracks under this chapter.\nThe commission shall require that the licensee reimburse it for the commission's actual costs, including personnel costs, of regulating the card club. Amounts received under this subdivision must be deposited as provided in section 240.155, subdivision 1.\nThe class B licensee shall report all income generated by the card club in an annual report to the Racing Commission. The report shall also account for all costs of operation, taxes paid, amounts paid to the breeder's fund, and net profits to the class B licensee.",
	"repealed": false
}