{
	"id": "136A.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.34",
	"title": "136A.34 REVENUE REFUNDING BONDS.",
	"text": "The authority is hereby authorized to provide for the issuance of revenue bonds of the authority for the purpose of refunding any revenue bonds of the authority then outstanding, including the payment of any redemption premium thereon and any interest accrued or to accrue to the earliest or any subsequent date of redemption, purchase or maturity of such revenue bonds, and, if deemed advisable by the authority, for the additional purpose of paying all or any part of the cost of constructing and acquiring additions, improvements, extensions or enlargements of a project or any portion thereof.\nThe proceeds of any such revenue bonds issued for the purpose of refunding outstanding revenue bonds may, in the discretion of the authority, be applied to the purchase or retirement at maturity or redemption of such outstanding revenue bonds either on their earliest or any subsequent redemption date or upon the purchase or at the maturity thereof and may, pending such application be placed in escrow to such purchase or retirement at maturity or redemption on such date as may be determined by the authority.\nAny such escrowed proceeds, pending such use, may be invested and reinvested in direct obligations of the United States of America, or in certificates of deposit or time deposits secured by direct obligations of the United States of America, maturing at such time or times as shall be appropriate to assure the prompt payment, as to principal, interest and redemption premium, if any, of the outstanding revenue bonds to be so refunded. The interest, income and profits, if any, earned or realized on any such investment may also be applied to the payment of the outstanding revenue bonds to be so refunded. After the terms of the escrow have been fully satisfied and carried out, any balance of such proceeds and interest, income and profits, if any, earned or realized on the investments thereof may be returned to the authority for use by it in any lawful manner.\nThe portion of the proceeds of any such revenue bonds issued for the additional purpose of paying all or any part of the cost of constructing and acquiring additions, improvements, extensions or enlargements of a project may be invested or deposited in time deposits as provided in section 136A.32, subdivision 7.\nAll such revenue bonds shall be subject to the provisions of sections 136A.25 to 136A.42, in the same manner and to the same extent as other revenue bonds issued pursuant to sections 136A.25 to 136A.42.",
	"repealed": false
}