{
	"id": "325G.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.57",
	"title": "325G.57 REQUIREMENTS FOR AUTOMATIC RENEWAL OR CONTINUOUS SERVICE.",
	"text": "A seller making an offer for an indefinite subscription agreement must, before the consumer accepts the offer, present the offer terms in a clear and conspicuous manner to the consumer and in visual proximity, or in the case of an offer conveyed by voice, in temporal proximity, to the offer's proposal.\nA seller making an offer for an indefinite subscription agreement must, in a timely manner after the consumer accepts the offer, provide the consumer with confirmation of the consumer's acceptance of the offer, in a manner that is capable of being retained by the consumer, that includes the following:\n(1) the offer terms;\n(2) if the offer includes a free trial, information on how to cancel the free trial before the consumer pays or becomes obligated to pay for any goods or services in connection with the free trial; and\n(3) options for termination of the indefinite subscription agreement, which options must be easy to use, cost-effective, and timely for all consumers:\n(i) if a seller makes offers for an indefinite subscription agreement through an online website, a termination election as set forth in section 325G.60; and\n(ii) if a consumer enters into the indefinite subscription agreement through any means other than a toll-free telephone number, an email address, or a postal address, then an option substantially similar to, as easy to use, and as accessible as the initial means of consumer acceptance of the agreement.\nA communication of the required information through email is sufficient to meet the requirements of this subdivision.\nUpon a material change in the terms of the indefinite subscription agreement, the seller must provide to the consumer in a timely manner, and in any case prior to the implementation of the material change, a clear and conspicuous notice of the material change and provide information regarding how to terminate the agreement in a manner that is capable of being retained by the consumer. A material change in the terms of an indefinite subscription agreement in violation of this subdivision is void and unenforceable.\nA seller making an offer for an indefinite subscription agreement that includes a free trial lasting more than 30 days must, no fewer than five days and no more than 30 days before the end of any such free trial, notify the consumer of the consumer's option to cancel the free trial before the end of the trial period to avoid an obligation to pay for the goods or services.\n(a) If an indefinite subscription agreement is subject to continuous service, the seller must give the consumer written notice of the continuous service at least once per calendar year via mail or email.\n(b) The notice required under this subdivision must include the terms of the service and how to terminate or manage the service.",
	"repealed": false
}