{
	"id": "260A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/260A.05",
	"title": "260A.05 SCHOOL ATTENDANCE REVIEW BOARDS.",
	"text": "A school district or charter school may establish one or more school attendance review boards to exercise the powers and duties in this section. The school district or charter school board shall appoint the members of the school attendance review board and designate the schools within the board's jurisdiction. Members of a school attendance review board may include:\n(1) the superintendent of the school district or the superintendent's designee or charter school director or the director's designee;\n(2) a principal and one or more other school officials from within the district or charter school;\n(3) parent representatives;\n(4) representatives from community agencies that provide services for truant students and their families;\n(5) a juvenile probation officer;\n(6) school counselors and attendance officers; and\n(7) law enforcement officers.\nA school attendance review board shall prepare an annual plan to promote interagency and community cooperation and to reduce duplication of services for students with school attendance problems. The plan shall include a description of truancy procedures and services currently in operation within the board's jurisdiction, including the programs and services under section 260A.04. A board may provide consultant services to, and coordinate activities of, truancy programs and services. If a board determines that it will be unable to provide services for all truant students who are referred to it, the board shall establish procedures and criteria for determining whether to accept referrals of students or refer them for other appropriate action.\nA school attendance review board shall oversee referrals of truant students and provide appropriate intervention and services under section 260A.06. The board shall establish procedures for documenting student attendance and verifying actions and interventions with respect to truant students and their families.",
	"repealed": false
}