{
	"id": "84D.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.13",
	"title": "84D.13 ENFORCEMENT; PENALTIES.",
	"text": "Unless otherwise provided, this chapter and rules adopted under section 84D.12 may be enforced by conservation officers under sections 97A.205, 97A.211, and 97A.221 and by other licensed peace officers.\nThe authority of conservation officers and other licensed peace officers to issue civil citations is in addition to other remedies available under law, except that the state may not seek penalties under any other provision of law for the incident subject to the citation.\n(a) A person who violates a provision of sections 84D.03 or 84D.06 to 84D.11, or a rule adopted under section 84D.12, is guilty of a misdemeanor.\n(b) A person who possesses, transports, or introduces a prohibited invasive species in violation of section 84D.05 is guilty of a misdemeanor. A person who imports, purchases, sells, or propagates a prohibited invasive species in violation of section 84D.05 is guilty of a gross misdemeanor.\n(c) A person who refuses to obey an order of a peace officer or conservation officer to remove prohibited invasive species or aquatic macrophytes from any water-related equipment is guilty of a gross misdemeanor.\nAfter appropriate training, conservation officers, other licensed peace officers, and other department personnel designated by the commissioner may issue warnings or citations to a person who:\n(1) unlawfully transports prohibited invasive species or aquatic macrophytes;\n(2) unlawfully places or attempts to place into waters of the state water-related equipment that has aquatic macrophytes or prohibited invasive species attached;\n(3) intentionally damages, moves, removes, or sinks a buoy marking, as prescribed by rule, Eurasian watermilfoil;\n(4) fails to remove plugs, open valves, and drain water from water-related equipment before leaving waters of the state or when transporting water-related equipment as provided in section 84D.10, subdivision 4;\n(5) transports infested water, in violation of rule, off riparian property;\n(6) fails to comply with a decontamination order when a decontamination unit is available on site;\n(7) fails to complete decontamination of water-related equipment or to remove invasive species from water-related equipment by the date specified on a tagging notice and order; or\n(8) fails to complete the aquatic invasive species offender training course required under section 86B.13.\n(a) A civil citation issued under this section must impose the following penalty amounts:\n(1) for transporting aquatic macrophytes in violation of section 84D.09, $100;\n(2) for placing or attempting to place into waters of the state water-related equipment that has aquatic macrophytes attached, $200;\n(3) for unlawfully possessing or transporting a prohibited invasive species other than an aquatic macrophyte, $500;\n(4) for placing or attempting to place into waters of the state water-related equipment that has prohibited invasive species attached when the waters are not listed by the commissioner as being infested with that invasive species, $500;\n(5) for intentionally damaging, moving, removing, or sinking a buoy marking, as prescribed by rule, Eurasian watermilfoil, $100;\n(6) for failing to have drain plugs or similar devices removed or opened while transporting water-related equipment or for failing to remove plugs, open valves, and drain water from water-related equipment, other than marine sanitary systems, before leaving waters of the state, $100;\n(7) for transporting infested water off riparian property without a permit as required by rule, $200;\n(8) for failing to have aquatic invasive species affirmation displayed or available for inspection as provided in sections 86B.401 and 97C.301, subdivision 2a, $25;\n(9) for failing to comply with a decontamination order when a decontamination unit is available on site, $250;\n(10) for failing to complete decontamination of water-related equipment or to remove invasive species from water-related equipment by the date specified on a tagging notice and order, $250; and\n(11) for failing to complete the aquatic invasive species offender training course required under section 86B.13, $25.\n(b) A civil citation that is issued to a person who has one or more prior convictions or final orders for violations of this chapter is subject to twice the penalty amounts listed in paragraph (a).\nA civil citation may be issued to suspend, for up to a year, the watercraft license of an owner or person in control of a watercraft or trailer who refuses to submit to an inspection under section 84D.105 or who refuses to comply with a removal order given under this section.\nA civil penalty is due and a watercraft license suspension is effective 30 days after issuance of the civil citation. A civil penalty collected under this section must be paid to either:\n(1) the commissioner if the citation was issued by a conservation officer and must be credited to the invasive species account; or\n(2) the treasury of the unit of government employing the officer who issued the civil citation.\nA civil citation and penalty may be appealed under the procedures in section 116.072, subdivision 6, if the person to whom the citation was issued requests a hearing by notifying the commissioner within 15 days after receipt of the citation. If a hearing is not requested within the 15-day period, the citation becomes a final order not subject to further review.\nA person who is convicted of or subject to a final order for a violation of this chapter involving water-related equipment must successfully complete a training course as provided in section 86B.13.",
	"repealed": false
}