{
	"id": "342.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.56",
	"title": "342.56 LIMITATIONS.",
	"text": "(a) Nothing in sections 342.51 to 342.60 permits any person to engage in, and does not prevent the imposition of any civil, criminal, or other penalties for:\n(1) undertaking a task under the influence of medical cannabis flower or medical cannabinoid products that would constitute negligence or professional malpractice;\n(2) possessing or consuming medical cannabis flower or medical cannabinoid products:\n(i) on a school bus or van;\n(ii) in a correctional facility;\n(iii) in a state-operated treatment program, including the Minnesota sex offender program; or\n(iv) on the grounds of a child care facility or family or group family day care program;\n(3) vaporizing or smoking medical cannabis:\n(i) on any form of public transportation;\n(ii) where the vapor would be inhaled by a nonpatient minor or where the smoke would be inhaled by a minor; or\n(iii) in any public place, including any indoor or outdoor area used by or open to the general public or a place of employment, as defined in section 144.413, subdivision 1b; and\n(4) operating, navigating, or being in actual physical control of a motor vehicle, aircraft, train, or motorboat or working on transportation property, equipment, or facilities while under the influence of medical cannabis flower or a medical cannabinoid product.\n(b) Except for the use of medical cannabis flower or medical cannabinoid products, the vaporizing or smoking of cannabis flower, cannabis products, artificially derived cannabinoids, or hemp-derived consumer products is prohibited in a multifamily housing building, including balconies and patios appurtenant thereto. A violation of this paragraph is punishable through a civil administrative fine in an amount of $250.\n(a) Health care facilities licensed under chapter 144A; hospice providers licensed under chapter 144A; boarding care homes or supervised living facilities licensed under section 144.50; assisted living facilities under chapter 144G; facilities owned, controlled, managed, or under common control with hospitals licensed under chapter 144; and other health care facilities licensed by the commissioner of health or the commissioner of human services may adopt reasonable restrictions on the use of medical cannabis flower or medical cannabinoid products by a patient enrolled in the registry program who resides at or is actively receiving treatment or care at the facility. The restrictions may include a provision that the facility must not store or maintain a patient's supply of medical cannabis flower or medical cannabinoid products on behalf of the patient; that a patient store the patient's supply of medical cannabis flower or medicinal cannabinoid products in a locked container accessible only to the patient, the patient's designated caregiver, or the patient's parent, legal guardian, or spouse; that the facility is not responsible for providing medical cannabis for patients; and that medical cannabis flower or medical cannabinoid products are used only in a location specified by the facility or provider. Nothing in this subdivision requires facilities and providers listed in this subdivision to adopt such restrictions.\n(b) No facility or provider listed in this subdivision may unreasonably limit a patient's access to or use of medical cannabis flower or medical cannabinoid products to the extent that such use is authorized under sections 342.51 to 342.59. No facility or provider listed in this subdivision may prohibit a patient access to or use of medical cannabis flower or medical cannabinoid products due solely to the fact that cannabis is a controlled substance pursuant to the federal Uniform Controlled Substances Act. If a federal regulatory agency, the United States Department of Justice, or the federal Centers for Medicare and Medicaid Services takes one of the following actions, a facility or provider may suspend compliance with this paragraph until the regulatory agency, the United States Department of Justice, or the federal Centers for Medicare and Medicaid Services notifies the facility or provider that it may resume permitting the use of medical cannabis flower or medical cannabinoid products within the facility or in the provider's service setting:\n(1) a federal regulatory agency or the United States Department of Justice initiates enforcement action against a facility or provider related to the facility's compliance with the medical cannabis program; or\n(2) a federal regulatory agency, the United States Department of Justice, or the federal Centers for Medicare and Medicaid Services issues a rule or otherwise provides notification to the facility or provider that expressly prohibits the use of medical cannabis in health care facilities or otherwise prohibits compliance with the medical cannabis program.\n(c) An employee or agent of a facility or provider listed in this subdivision or a person licensed under chapter 144E is not violating this chapter or chapter 152 for the possession of medical cannabis flower or medical cannabinoid products while carrying out employment duties, including providing or supervising care to a patient enrolled in the registry program, or distribution of medical cannabis flower or medical cannabinoid products to a patient enrolled in the registry program who resides at or is actively receiving treatment or care at the facility or from the provider with which the employee or agent is affiliated.\nA proprietor of a family or group family day care program must disclose to parents or guardians of children cared for on the premises of the family or group family day care program, if the proprietor permits the smoking or use of medical cannabis on the premises, outside of its hours of operation. Disclosure must include posting on the premises a conspicuous written notice and orally informing parents or guardians.",
	"repealed": false
}