{
	"id": "144.064",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.064",
	"title": "144.064 THE VIVIAN ACT.",
	"text": "This section shall be known and may be cited as the \"Vivian Act.\"\nFor purposes of this section, the following terms have the meanings given them:\n(1) \"CMV\" means the human herpesvirus cytomegalovirus, also called HCMV, human herpesvirus 5, and HHV-5;\n(2) \"commissioner\" means the commissioner of health;\n(3) \"congenital CMV\" means the transmission of a CMV infection from a pregnant mother to her fetus; and\n(4) \"health care practitioner\" means a health care professional who provides prenatal or postnatal care or care to infants.\n(a) The commissioner shall make available to health care practitioners, women who may become pregnant, expectant parents, and parents of infants up-to-date and evidence-based information about congenital CMV that has been reviewed by experts with knowledge of the disease. The information shall include the following:\n(1) the recommendation to consider testing for congenital CMV if the parent or legal guardian of the infant elected not to have newborn screening performed under section 144.125, the infant failed a newborn hearing screening, or pregnancy history suggests increased risk for congenital CMV infection;\n(2) the incidence of CMV;\n(3) the transmission of CMV to pregnant women and women who may become pregnant;\n(4) birth defects caused by congenital CMV;\n(5) available preventative measures to avoid the infection of women who are pregnant or may become pregnant; and\n(6) resources available for families of children born with congenital CMV.\n(b) The commissioner shall follow existing department practice, inclusive of community engagement, to ensure that the information in paragraph (a) is culturally and linguistically appropriate for all recipients.\n(c) The commissioner shall establish an outreach program to:\n(1) educate women who may become pregnant, expectant parents, and parents of infants about CMV; and\n(2) raise awareness for CMV among health care practitioners.\n(d) The Advisory Committee on Heritable and Congenital Disorders established under section 144.1255 shall review congenital CMV for inclusion on the list of tests to be performed under section 144.125. If the committee recommends and the commissioner approves the recommendation of adding congenital CMV to the newborn screening panel, the commissioner shall publish the addition in the State Register and the per specimen fee for screening under section 144.125, subdivision 1, paragraph (c), shall be increased by $43, for a total of $220 per specimen, effective upon publication in the State Register.",
	"repealed": false
}