{
	"id": "14.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.08",
	"title": "14.08 APPROVAL OF RULE AND RULE FORM; COSTS.",
	"text": "(a) One copy of a rule adopted under section 14.26 must be submitted by the agency to the chief administrative law judge. The chief administrative law judge shall request from the revisor certified copies of the rule when it is submitted by the agency under section 14.26. Within five working days after the request for certification of the rule is received by the revisor, the revisor shall either return the rule with a certificate of approval of the form of the rule to the chief administrative law judge or notify the chief administrative law judge and the agency that the form of the rule will not be approved.\nIf the chief administrative law judge disapproves a rule, the agency may modify it and the agency shall submit one copy of the modified rule, approved as to form by the revisor, to the chief administrative law judge.\n(b) One copy of a rule adopted after a public hearing must be submitted by the agency to the chief administrative law judge. The chief administrative law judge shall request from the revisor certified copies of the rule when it is submitted by the agency. Within five working days after receipt of the request, the revisor shall either return the rule with a certificate of approval to the chief administrative law judge or notify the chief administrative law judge and the agency that the form of the rule will not be approved.\n(c) If the revisor refuses to approve the form of the rule, the revisor's notice must revise the rule so it is in the correct form.\n(d) After the agency has notified the chief administrative law judge that it has adopted the rule, the chief administrative law judge shall promptly file an electronic copy of the adopted rule in the Office of the Secretary of State. The secretary of state shall forward one copy of each rule filed to the agency, to the revisor of statutes, and to the governor.\n(e) The chief administrative law judge shall assess an agency for the actual cost of processing rules under this section. Each agency shall include in its budget money to pay the assessments. Receipts from the assessment must be deposited in the administrative hearings account established in section 14.54.",
	"repealed": false
}