{
	"id": "62W.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.15",
	"title": "62W.15 CLINICIAN-ADMINISTERED DRUGS.",
	"text": "(a) For purposes of this section, the following definition applies.\n(b) \"Clinician-administered drug\" means an outpatient prescription drug other than a vaccine that:\n(1) cannot reasonably be self-administered by the enrollee to whom the drug is prescribed or by an individual assisting the enrollee with self-administration; and\n(2) is typically administered:\n(i) by a health care provider authorized to administer the drug, including when acting under a physician's delegation and supervision; and\n(ii) in a physician's office, hospital outpatient infusion center, or other clinical setting.\n(a) A specialty pharmacy that ships a clinician-administered drug to a health care provider or pharmacy must:\n(1) comply with all federal laws regulating the shipment of drugs, including but not limited to the U.S. Pharmacopeia General Chapter 800;\n(2) in response to questions from a health care provider or pharmacy, provide access to a pharmacist or nurse employed by the specialty pharmacy 24 hours a day, 7 days a week;\n(3) allow an enrollee and health care provider to request a refill of a clinician-administered drug on behalf of an enrollee, in accordance with the pharmacy benefit manager or health carrier's utilization review procedures; and\n(4) adhere to the track and trace requirements, as defined by the federal Drug Supply Chain Security Act, United States Code, title 21, section 360eee, et seq., for a clinician-administered drug that needs to be compounded or manipulated.\n(b) For any clinician-administered drug dispensed by a specialty pharmacy selected by the pharmacy benefit manager or health carrier, the requesting health care provider or their designee must provide the requested date, approximate time, and place of delivery of a clinician-administered drug at least five business days before the date of delivery. The specialty pharmacy must require a signature upon receipt of the shipment when shipped to a health care provider.\n(c) A pharmacy benefit manager or health carrier who requires dispensing of a clinician-administered drug through a specialty pharmacy shall establish and disclose a process which allows the health care provider or pharmacy to appeal and have exceptions to the use of a specialty pharmacy when:\n(1) a drug is not delivered as specified in paragraph (b); or\n(2) an attending health care provider reasonably believes an enrollee may experience immediate and irreparable harm without the immediate, onetime use of clinician-administered drug that a health care provider or pharmacy has in stock.\n(d) A pharmacy benefit manager or health carrier shall not require a specialty pharmacy to dispense a clinician-administered drug directly to an enrollee with the intention that the enrollee will transport the clinician-administered drug to a health care provider for administration.\n(e) A pharmacy benefit manager, health carrier, health care provider, or pharmacist shall not require and may not deny the use of a home infusion or infusion site external to the enrollee's provider office or clinic to administer a clinician-administered drug when requested by an enrollee and such services are covered by the health plan and are available and clinically appropriate as determined by the health care provider and delivered in accordance with state law.",
	"repealed": false
}