{
	"id": "609.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.605",
	"title": "609.605 TRESPASS.",
	"text": "(a) The following terms have the meanings given them for purposes of this section.\n(1) \"Premises\" means real property and any appurtenant building or structure.\n(2) \"Dwelling\" means the building or part of a building used by an individual as a place of residence on either a full-time or a part-time basis. A dwelling may be part of a multidwelling or multipurpose building, or a manufactured home as defined in section 168.002, subdivision 16.\n(3) \"Construction site\" means the site of the construction, alteration, painting, or repair of a building or structure.\n(4) \"Owner or lawful possessor,\" as used in paragraph (b), clause (9), means the person on whose behalf a building or dwelling is being constructed, altered, painted, or repaired and the general contractor or subcontractor engaged in that work.\n(5) \"Posted,\" as used:\n(i) in paragraph (b), clause (4), means the placement of a sign at least 8-1/2 inches by 11 inches in a conspicuous place on the exterior of the building, or in a conspicuous place within the property on which the building is located. The sign must carry a general notice warning against trespass;\n(ii) in paragraph (b), clause (9), means the placement of a sign at least 8-1/2 inches by 11 inches in a conspicuous place on the exterior of the building that is under construction, alteration, or repair, or in a conspicuous place within the area being protected. If the area being protected is less than three acres, one additional sign must be conspicuously placed within that area. If the area being protected is three acres but less than ten acres, two additional signs must be conspicuously placed within that area. For each additional full ten acres of area being protected beyond the first ten acres of area, two additional signs must be conspicuously placed within the area being protected. The sign must carry a general notice warning against trespass; and\n(iii) in paragraph (b), clause (10), means the placement of signs that:\n(A) carry a general notice warning against trespass;\n(B) display letters at least two inches high;\n(C) state that Minnesota law prohibits trespassing on the property; and\n(D) are posted in a conspicuous place and at intervals of 500 feet or less.\n(6) \"Business licensee,\" as used in paragraph (b), clause (9), includes a representative of a building trades labor or management organization.\n(7) \"Building\" has the meaning given in section 609.581, subdivision 2.\n(b) A person is guilty of a misdemeanor if the person intentionally:\n(1) permits domestic animals or fowls under the actor's control to go on the land of another within a city;\n(2) interferes unlawfully with a monument, sign, or pointer erected or marked to designate a point of a boundary, line or a political subdivision, or of a tract of land;\n(3) trespasses on the premises of another and, without claim of right, refuses to depart from the premises on demand of the lawful possessor;\n(4) occupies or enters the dwelling or locked or posted building of another, without claim of right or consent of the owner or the consent of one who has the right to give consent, except in an emergency situation;\n(5) enters the premises of another with intent to take or injure any fruit, fruit trees, or vegetables growing on the premises, without the permission of the owner or occupant;\n(6) enters or is found on the premises of a public or private cemetery without authorization during hours the cemetery is posted as closed to the public;\n(7) returns to the property of another with the intent to abuse, disturb, or cause distress in or threaten another, after being told to leave the property and not to return, if the actor is without claim of right to the property or consent of one with authority to consent;\n(8) returns to the property of another within one year after being told to leave the property and not to return, if the actor is without claim of right to the property or consent of one with authority to consent;\n(9) enters the locked or posted construction site of another without the consent of the owner or lawful possessor, unless the person is a business licensee;\n(10) enters the locked or posted aggregate mining site of another without the consent of the owner or lawful possessor, unless the person is a business licensee; or\n(11) crosses into or enters any public or private area lawfully cordoned off by or at the direction of a peace officer engaged in the performance of official duties. As used in this clause: (i) an area may be \"cordoned off\" through the use of tape, barriers, or other means conspicuously placed and identifying the area as being restricted by a peace officer and identifying the responsible authority; and (ii) \"peace officer\" has the meaning given in section 626.84, subdivision 1. It is an affirmative defense to a charge under this clause that a peace officer permitted entry into the restricted area.\nWhoever trespasses upon the grounds of a facility providing emergency shelter services for battered women, as defined under section 611A.31, subdivision 3, or providing comparable services for sex trafficking victims, as defined under section 609.321, subdivision 7b, or of a facility providing transitional housing for battered women and their children or sex trafficking victims and their children, without claim of right or consent of one who has right to give consent, and refuses to depart from the grounds of the facility on demand of one who has right to give consent, is guilty of a gross misdemeanor.\n[Repealed, 1993 c 326 art 2 s 34]\n(a) It is a misdemeanor for a person to enter or be found in a public or nonpublic elementary, middle, or secondary school building unless the person:\n(1) is an enrolled student in, a parent or guardian of an enrolled student in, or an employee of the school or school district;\n(2) has permission or an invitation from a school official to be in the building;\n(3) is attending a school event, class, or meeting to which the person, the public, or a student's family is invited; or\n(4) has reported the person's presence in the school building in the manner required for visitors to the school.\n(b) It is a misdemeanor for a person to be on the roof of a public or nonpublic elementary, middle, or secondary school building unless the person has permission from a school official to be on the roof of the building.\n(c) It is a gross misdemeanor for a group of three or more persons to enter or be found in a public or nonpublic elementary, middle, or secondary school building unless one of the persons:\n(1) is an enrolled student in, a parent or guardian of an enrolled student in, or an employee of the school or school district;\n(2) has permission or an invitation from a school official to be in the building;\n(3) is attending a school event, class, or meeting to which the person, the public, or a student's family is invited; or\n(4) has reported the person's presence in the school building in the manner required for visitors to the school.\n(d) It is a misdemeanor for a person to enter or be found on school property within one year after being told by the school principal or the principal's designee to leave the property and not to return, unless the principal or the principal's designee has given the person permission to return to the property. As used in this paragraph, \"school property\" has the meaning given in section 152.01, subdivision 14a, clauses (1) and (3).\n(e) A school principal or a school employee designated by the school principal to maintain order on school property, who has reasonable cause to believe that a person is violating this subdivision may detain the person in a reasonable manner for a reasonable period of time pending the arrival of a peace officer. A school principal or designated school employee is not civilly or criminally liable for any action authorized under this paragraph if the person's action is based on reasonable cause.\n(f) A peace officer may arrest a person without a warrant if the officer has probable cause to believe the person violated this subdivision within the preceding four hours. The arrest may be made even though the violation did not occur in the peace officer's presence.\n(a) As used in this subdivision, \"school bus\" has the meaning given in section 169.011, subdivision 71.\n(b) As used in this subdivision, \"pupils\" means persons in grades prekindergarten through grade 12.\n(c) A person who boards a school bus when the bus is on its route or otherwise in operation, or while it has pupils on it, and who refuses to leave the bus on demand of the bus operator, is guilty of a misdemeanor.\n(a) A person is guilty of a gross misdemeanor if the person enters the posted premises of another on which cattle, bison, sheep, goats, swine, horses, poultry, farmed Cervidae, farmed Ratitae, aquaculture stock, or other species of domestic animals for commercial production are kept, without the consent of the owner or lawful occupant of the land.\n(b) \"Domestic animal,\" for purposes of this section, has the meaning given in section 609.599.\n(c) \"Posted,\" as used in paragraph (a), means the placement of a sign at least 11 inches square in a conspicuous place at each roadway entry to the premises. The sign must provide notice of a biosecurity area and wording such as: \"Biosecurity measures are in force. No entrance beyond this point without authorization.\" The sign may also contain a telephone number or a location for obtaining such authorization.\n(d) The provisions of this subdivision do not apply to employees or agents of the state or county when serving in a regulatory capacity and conducting an inspection on posted premises where domestic animals are kept.",
	"repealed": false
}