{
	"id": "60A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.51",
	"title": "60A.51 RBC REPORTS.",
	"text": "A domestic health organization shall, on or before each April 1, prepare and submit to the commissioner a report of its RBC levels as of the end of the calendar year just ended, in a form and containing the information required by the RBC instructions. In addition, a domestic health organization shall file its RBC report:\n(1) with the NAIC in accordance with the RBC instructions; and\n(2) with the insurance commissioner in any state in which the health organization is authorized to do business, if the insurance commissioner has notified the health organization of its request in writing, in which case the health organization shall file its RBC report not later than the later of:\n(i) 15 days from the receipt of notice to file its RBC report with that state; or\n(ii) the filing date.\nA health organization's RBC must be determined in accordance with the formula set forth in the RBC instructions. The formula must take the following into account, and may adjust for the covariance between, determined in each case by applying the factors in the manner set forth in the RBC instructions:\n(1) asset risk;\n(2) credit risk;\n(3) underwriting risk; and\n(4) all other business risks and such other relevant risks as are set forth in the RBC instructions.\nAn excess of capital (net worth) over the amount produced by the risk-based capital requirements contained in sections 60A.50 to 60A.592 and the formulas, schedules, and instructions referenced in sections 60A.50 to 60A.592 is desirable in the business of health insurance.\nIf a domestic health organization files an RBC report that in the judgment of the commissioner is inaccurate, then the commissioner shall adjust the RBC report to correct the inaccuracy and shall notify the health organization of the adjustment. The notice must contain a statement of the reason for the adjustment. An RBC report as so adjusted is referred to as an \"adjusted RBC report.\"",
	"repealed": false
}