{
	"id": "332B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.08",
	"title": "332B.08 BOOKS, RECORDS, AND INFORMATION.",
	"text": "Every registrant must keep, and use in the registrant's business, such books, accounts, and records, including electronic records, as will enable the commissioner to determine whether the registrant is complying with this chapter and the rules, orders, and directives adopted by the commissioner under this chapter. Every registrant must preserve such books, accounts, and records for at least six years after making the final entry on any transaction recorded therein. Examinations of the books, records, and method of operations conducted under the supervision of the commissioner shall be done at the cost of the registrant. The cost must be assessed as determined under section 46.131.\nOn or before March 15 of each calendar year, each registrant must file a report with the commissioner containing information the commissioner may require about the preceding calendar year. The report must be in a form the commissioner prescribes.\n(a) Each registrant must:\n(1) maintain and make available records and accounts that will enable each debtor to ascertain the amounts paid to the creditors, if any. A statement showing amounts received from the debtor, disbursements, if any, to each creditor, amounts that any creditor has agreed to as payment in full for any debt owed the creditor by the debtor, fees deducted by the registrant, and other information the commissioner may prescribe must be furnished by the registrant to the debtor at least monthly and, in addition, upon any cancellation or termination of the contract;\n(2) include in the statement furnished to debtors a list of all activities conducted pursuant to the contract, including the nature of communications and progress of negotiations with each creditor during the reporting period; and\n(3) prepare and retain in the file of each debtor a written analysis of the debtor's income and expenses to substantiate that the plan of payment is feasible and practicable.\n(b) Each debtor must have reasonable access, without cost, by electronic or other means, to information in the registrant's files applicable to the debtor. These statements, records, and accounts must otherwise remain confidential, except for duly authorized state and government officials, the commissioner, the attorney general, the debtor, and the debtor's representative and designees.",
	"repealed": false
}