{
	"id": "256B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.20",
	"title": "256B.20 COUNTY APPROPRIATIONS.",
	"text": "The providing of funds necessary to carry out the provisions hereof on the part of the counties and the manner of administering the funds of the counties and the state shall be as follows:\n(1) The board of county commissioners of each county shall annually set up in its budget an item designated as the county medical assistance fund and levy taxes and fix a rate therefor sufficient to produce the full amount of such item, in addition to all other tax levies and tax rate, however fixed or determined, sufficient to carry out the provisions hereof and sufficient to pay in full the county share of assistance and administrative expense for the ensuing year; and annually on or before October 10 shall certify the same to the county auditor to be entered by the auditor on the tax rolls. Such tax levy and tax rate shall make proper allowance and provision for shortage in tax collections.\n(2) Any county may transfer surplus funds from any county fund, except the sinking or ditch fund, to the general fund or to the county medical assistance fund in order to provide money necessary to pay medical assistance awarded hereunder. The money so transferred shall be used for no other purpose, but any portion thereof no longer needed for such purpose shall be transferred back to the fund from which taken.\n(3) Upon the order of the county agency the county auditor shall draw a warrant on the proper fund in accordance with the order, and the county treasurer shall pay out the amounts ordered to be paid out as medical assistance hereunder. When necessary by reason of failure to levy sufficient taxes for the payment of the medical assistance in the county, the county auditor shall carry any such payments as an overdraft on the medical assistance funds of the county until sufficient tax funds shall be provided for such assistance payments. The board of county commissioners shall include in the tax levy and tax rate in the year following the year in which such overdraft occurred, an amount sufficient to liquidate such overdraft in full.\n(4) Claims for reimbursement and reports shall be presented to the state agency by the respective counties as required under section 256.01, subdivision 2, paragraph (o). The state agency shall audit such claims and certify to the commissioner of management and budget the amounts due the respective counties without delay. The amounts so certified shall be paid within ten days after such certification, from the state treasury upon payment of the commissioner of management and budget from any money available therefor. The money available to the state agency to carry out the provisions hereof, including all federal funds available to the state, shall be kept and deposited by the commissioner of management and budget in the revenue fund and disbursed in the same manner as other state funds.",
	"repealed": false
}