{
	"id": "299C.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.092",
	"title": "299C.092 QUESTIONED IDENTITY PROCESS.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Bureau\" means the Bureau of Criminal Apprehension.\n(c) \"Questioned identity\" means an individual's identity that is associated with another person's records when the individual's identity is used by an offender in interactions with law enforcement or the offender has the same name which can lead to difficulties differentiating the individual from the offender.\n(a) When an individual is the subject of questioned identity, the individual may request a review by the bureau through its questioned identity process. Individuals must contact the bureau and provide the following:\n(1) documentation of the individual's identity through a government-issued photo identification;\n(2) documents or information that lead the individual to believe that the individual is the subject of questioned identity; and\n(3) fingerprints for identification verification purposes.\n(b) If the bureau is able to confirm that the individual is the subject of questioned identity, the bureau shall provide documentation to the individual indicating that the individual has been through the bureau's questioned identity process.\n(c) The bureau shall denote any aliases determined to be questioned identities in the criminal history system under section 299C.09 and shall work with other state and local agencies to denote aliases in arrest warrants.\n(d) The bureau shall attach a photo of the offender to arrest warrants in the bureau's warrant file if a photo is available.\n(e) Notwithstanding section 13.87, subdivision 1, paragraph (b), the bureau, in consultation with reporting criminal justice agencies, may remove an alias from a criminal history record when it determines doing so will not negatively impact a criminal justice agency's ability to identify the offender in the future. Some considerations in making the determination include but are not limited to time elapsed since the alias name was last used, frequency with which the alias was used, current incarceration status of the offender, whether it is or was the offender's name, and whether the offender is living or deceased.\n(f) Law enforcement must take into account the presence of documentation from the bureau or another law enforcement agency confirming a questioned identity when considering whether an individual has a warrant under section 299C.115 and may contact the bureau or the issuing law enforcement agency to confirm authenticity of the documentation provided by an individual.",
	"repealed": false
}