{
	"id": "142E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.08",
	"title": "142E.08 MFIP CHILD CARE ASSISTANCE PROGRAM.",
	"text": "Families eligible for child care assistance under the MFIP child care program are:\n(1) MFIP participants who are employed or in job search and meet the requirements of section 142E.12;\n(2) persons who are members of transition year families under section 142E.01, subdivision 28, and meet the requirements of section 142E.12;\n(3) MFIP families who are participating in work job search, job support, employment, or training activities as required in their employment plan, or in appeals, hearings, assessments, or orientations according to chapter 142G;\n(4) MFIP families who are participating in social services activities under chapter 142G as required in their employment plan approved according to chapter 142G;\n(5) families who are participating in services or activities that are included in an approved family stabilization plan under section 142G.75;\n(6) MFIP child-only families under section 142G.01, subdivision 8, for up to 20 hours of child care per week for children ages six and under, as recommended by the treating mental health professional as defined in section 245I.04, subdivision 2, when the child's primary caregiver has a diagnosis of a mental illness;\n(7) families who are participating in programs as required in tribal contracts under section 142E.02, subdivision 2, or 142A.20, subdivision 2;\n(8) families who are participating in the transition year extension under section 142E.01, subdivision 27;\n(9) student parents as defined under section 142E.01, subdivision 26; and\n(10) student parents who turn 21 years of age and who continue to meet the other requirements under section 142E.01, subdivision 26. A student parent continues to be eligible until the student parent is approved for basic sliding fee child care assistance or until the student parent's redetermination, whichever comes first. At the student parent's redetermination, if the student parent was not approved for basic sliding fee child care assistance, a student parent's eligibility ends following a 15-day adverse action notice.\n[See Note.]\nCounties may contract for administration of the program or may arrange for or contract for child care funds to be used by other appropriate programs, in accordance with this section and as permitted by federal law and regulations.\nCounties shall maximize their federal reimbursement under federal reimbursement programs for money spent for persons eligible under this chapter. The commissioner shall allocate any federal earnings to the county to be used to expand child care services under this chapter.",
	"repealed": false
}