{
	"id": "504B.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.321",
	"title": "504B.321 COMPLAINT AND SUMMONS.",
	"text": "(a) To bring an eviction action, the person complaining shall file a complaint with the court, stating the full name and date of birth of the person against whom the complaint is made, unless it is not known, describing the premises of which possession is claimed, stating the facts which authorize the recovery of possession, and asking for recovery thereof.\n(b) The lack of the full name and date of birth of the person against whom the complaint is made does not deprive the court of jurisdiction or make the complaint invalid.\n(c) The appearance shall be not less than seven nor more than 14 days from the day of issuing the summons, except as provided by subdivision 2.\n(d) If applicable, the person filing a complaint must attach a copy of the written notice described in subdivision 1a. The court shall dismiss an action without prejudice for failure to provide a notice as described in subdivision 1a and grant an expungement of the eviction case court file.\n(a) Before bringing an eviction action alleging nonpayment of rent or other unpaid financial obligation in violation of the lease, a landlord must provide written notice to the residential tenant specifying the basis for future eviction action. The notice must include:\n(1) the total amount due;\n(2) a specific accounting of the amount of the total due from unpaid rent, late fees, and other charges under the lease;\n(3) the name and address of the person authorized to receive rent and fees on behalf of the landlord;\n(4) the following statement: \"You have the right to seek legal help. If you can't afford a lawyer, free legal help may be available. Contact Legal Aid or visit www.LawHelpMN.org to know your rights and find your local Legal Aid office.\";\n(5) the following statement: \"To apply for financial help, contact your local county or Tribal social services office, apply online at MNBenefits.mn.gov or call the United Way toll-free information line by dialing 2-1-1 or 800-543-7709.\"; and\n(6) the following statement: \"Your landlord can file an eviction case if you do not pay the total amount due or move out within 14 days from the date of this notice. Some local governments may have an eviction notice period longer than 14 days.\"\n(b) The landlord or an agent of the landlord must deliver the notice personally or by first class mail to the residential tenant at the address of the leased premises.\n(c) If the residential tenant fails to correct the rent delinquency within 14 days of the delivery or mailing of the notice, or the number of days required by a local government rule or law if the notice period prior to an eviction required by the local government is longer than 14 days, or fails to vacate, then the landlord may bring an eviction action under subdivision 1 based on nonpayment of rent.\n(a) Receipt of the notice under subdivision 1a shall be deemed by a county or other agency requiring verification of emergency to qualify a tenant for assistance to be sufficient demonstration of an emergency situation under section 256D.06, subdivision 2, and Minnesota Rules, chapter 9500. For purposes of chapter 142G and Minnesota Rules, chapter 9500, a county agency verifies an emergency situation by receiving and reviewing a notice under this section.\n(b) When it receives a copy of the notice required by this section, the county must not:\n(1) require a tenant to provide additional verification of the emergency; or\n(2) require additional verification that the landlord will accept the funds demanded in the notice required by this section to resolve the emergency.\n(a) In an eviction action brought under section 504B.171 or on the basis that the residential tenant engages in behavior that seriously endangers the safety of other residents, or intentionally and seriously damages the property of the landlord or a tenant, the person filing the complaint shall file an affidavit stating specific facts and instances in support of why an expedited hearing is required.\n(b) The complaint and affidavit shall be reviewed by a referee or judge and scheduled for an expedited hearing only if sufficient supporting facts are stated and they meet the requirements of this paragraph.\n(c) The appearance in an expedited hearing shall be not less than five days nor more than seven days from the date the summons is issued. The summons, in an expedited hearing, shall be served upon the residential tenant within 24 hours of issuance unless the court orders otherwise for good cause shown.\n(d) If the court determines that the person seeking an expedited hearing did so without sufficient basis under the requirements of this subdivision, the court shall impose a civil penalty of up to $500 for abuse of the expedited hearing process.\n(e) The court may only consider allegations under paragraph (a) during an expedited hearing. The court may not consolidate claims heard under the expedited procedure with any additional claims, including but not limited to breach of lease, holding over under section 504B.285, or nonpayment of rent under section 504B.291.\nThe person bringing a complaint under this section must:\n(1) attach the current written lease, if any, or most recent written lease in existence, and any relevant lease addenda;\n(2) if alleging nonpayment of rent, attach a detailed, itemized accounting or statement listing the amounts;\n(3) if alleging a breach of lease, identify the clause of the lease which is the basis of the allegation, the nature of the conduct constituting the alleged breach of lease, the dates on which the alleged conduct took place, and the clause granting the right to evict based on the alleged conduct;\n(4) if alleging a violation of section 504B.171, specify the nature of the conduct constituting the alleged violation and the dates on which the alleged conduct took place;\n(5) if alleging a violation of section 504B.285, subdivision 1, attach a copy of any notice to vacate or notice to quit; and\n(6) state in the complaint whether the tenancy is affected by a federal or state housing subsidy program through project-based federal assistance payments; the Section 8 program, as defined in section 469.002, subdivision 24; the low-income housing tax credit program; or any other similar program, and include the name of the agency that administers the housing subsidy program.\nThe court shall issue a summons, commanding the person against whom the complaint is made to appear before the court on the day and at the place stated in the summons. A copy of the complaint must be attached to the summons. The summons must include, at a minimum:\n(1) the full name of the person against whom the complaint is brought;\n(2) the date, time, and location of the hearing;\n(3) information about the methods for participating in the court appearance, including, if applicable, information for appearing by telephone or computer and contact information for the court regarding remote participation;\n(4) the following statement: \"You have the right to seek legal help or request a reasonable accommodation from the court for your hearing. Contact the court as soon as possible if you need an accommodation. If you can't afford a lawyer, free legal help may be available. Contact Legal Aid or visit www.LawHelpMN.org to know your rights and find your local Legal Aid office.\";\n(5) the following statement: \"To apply for financial help, contact your local county or Tribal social services office, apply online at MNBenefits.mn.gov, or call the United Way toll-free information line by dialing 2-1-1 or 800-543-7709.\"; and\n(6) notification that a copy of the complaint is attached and has been filed with the court.\nThe court must dismiss and expunge the record of any action if the person bringing the action fails to comply with this section.\nAn eviction action is not accessible to the public until the court enters a final judgment, except that parties to the case and licensed attorneys assisting a party in the case, regardless of whether or not they are the attorney of record, shall have access to the eviction action file.",
	"repealed": false
}