{
	"id": "148E.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.43",
	"title": "148E.43 SOCIAL WORKER PARTICIPATION IN THE COMPACT.",
	"text": "(a) To be eligible for a multistate license under the terms and provisions of the Compact, an applicant, regardless of category, must:\n(1) hold or be eligible for an active, unencumbered license in the home state;\n(2) pay any applicable fees, including any state fee, for the multistate license;\n(3) submit, in connection with an application for a multistate license, fingerprints or other biometric data for the purpose of obtaining criminal history record information from the Federal Bureau of Investigation and the agency responsible for retaining that state's criminal records;\n(4) notify the home state of any adverse action, encumbrance, or restriction on any professional license taken by any member state or nonmember state within 30 days from the date the action is taken;\n(5) meet any continuing competence requirements established by the home state; and\n(6) abide by the laws, regulations, and applicable standards in the member state where the client is located at the time care is rendered.\n(b) An applicant for a clinical-category multistate license must meet all of the following requirements:\n(1) fulfill a competency requirement, which shall be satisfied by either:\n(i) passage of a clinical-category qualifying national exam;\n(ii) licensure of the applicant in their home state at the clinical category, beginning prior to such time as a qualifying national exam was required by the home state and accompanied by a period of continuous social work licensure thereafter, all of which may be further governed by the rules of the Commission; or\n(iii) the substantial equivalency of the foregoing competency requirements which the Commission may determine by rule;\n(2) attain at least a master's degree in social work from a program that is:\n(i) operated by a college or university recognized by the licensing authority; and\n(ii) accredited, or in candidacy that subsequently becomes accredited, by an accrediting agency recognized by either:\n(A) the Council for Higher Education Accreditation or its successor; or\n(B) the United States Department of Education; and\n(3) fulfill a practice requirement, which shall be satisfied by demonstrating completion of:\n(i) a period of postgraduate supervised clinical practice equal to a minimum of 3,000 hours;\n(ii) a minimum of two years of full-time postgraduate supervised clinical practice; or\n(iii) the substantial equivalency of the foregoing practice requirements which the Commission may determine by rule.\n(c) An applicant for a master's-category multistate license must meet all of the following requirements:\n(1) fulfill a competency requirement, which shall be satisfied by either:\n(i) passage of a masters-category qualifying national exam;\n(ii) licensure of the applicant in their home state at the master's category, beginning prior to such time as a qualifying national exam was required by the home state at the master's category and accompanied by a continuous period of social work licensure thereafter, all of which may be further governed by the rules of the Commission; or\n(iii) the substantial equivalency of the foregoing competency requirements which the Commission may determine by rule; and\n(2) attain at least a master's degree in social work from a program that is:\n(i) operated by a college or university recognized by the licensing authority; and\n(ii) accredited, or in candidacy that subsequently becomes accredited, by an accrediting agency recognized by either:\n(A) the Council for Higher Education Accreditation or its successor; or\n(B) the United States Department of Education.\n(d) An applicant for a bachelor's-category multistate license must meet all of the following requirements:\n(1) fulfill a competency requirement, which shall be satisfied by either:\n(i) passage of a bachelor's-category qualifying national exam;\n(ii) licensure of the applicant in their home state at the bachelor's category, beginning prior to such time as a qualifying national exam was required by the home state and accompanied by a period of continuous social work licensure thereafter, all of which may be further governed by the rules of the Commission; or\n(iii) the substantial equivalency of the foregoing competency requirements which the Commission may determine by rule; and\n(2) attain at least a bachelor's degree in social work from a program that is:\n(i) operated by a college or university recognized by the licensing authority; and\n(ii) accredited, or in candidacy that subsequently becomes accredited, by an accrediting agency recognized by either:\n(A) the Council for Higher Education Accreditation or its successor; or\n(B) the United States Department of Education.\n(e) The multistate license for a regulated social worker is subject to the renewal requirements of the home state. The regulated social worker must maintain compliance with the requirements of paragraph (a) to be eligible to renew a multistate license.\n(f) The regulated social worker's services in a remote state are subject to that member state's regulatory authority. A remote state may, in accordance with due process and that member state's laws, remove a regulated social worker's multistate authorization to practice in the remote state for a specific period of time, impose fines, and take any other necessary actions to protect the health and safety of its citizens.\n(g) If a multistate license is encumbered, the regulated social worker's multistate authorization to practice shall be deactivated in all remote states until the multistate license is no longer encumbered.\n(h) If a multistate authorization to practice is encumbered in a remote state, the regulated social worker's multistate authorization to practice may be deactivated in that state until the multistate authorization to practice is no longer encumbered.",
	"repealed": false
}