{
	"id": "299J.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/299J.13",
	"title": "299J.13 ACCESS TO INFORMATION; CLASSIFICATION OF DATA.",
	"text": "A person who the director has reason to believe is responsible for an emergency release shall, when requested by the office or an authorized agent of the office, furnish to the director any information that the person may have or may reasonably obtain that is relevant to the emergency release.\nThe director or an authorized agent, upon presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda, or data of any person who has a duty to provide information under subdivision 1; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized by sections 299J.01 to 299J.17, including obtaining information from any person who has a duty to provide the information under subdivision 1 and conducting surveys or investigations.\nExcept as otherwise provided in this subdivision, data obtained from any person under subdivision 1 or 2 is public data as defined in section 13.02. Upon certification by the subject of the data that the data relates to sales figures, processes, or methods of production unique to that person, or information that would tend to affect adversely the competitive position of that person, the director shall classify the data as private or nonpublic data as defined in section 13.02. Notwithstanding any other law to the contrary, data classified as private or nonpublic under this subdivision may be disclosed when relevant in any proceeding under sections 299J.01 to 299J.17, or to other public agencies concerned with the implementation of sections 299J.01 to 299J.17.\nReasonable and necessary expenses incurred by the director under this section, including administrative and legal expenses, may be recovered from a person who has been found liable under section 299J.07, 299J.15, or 299J.16, or any other law relating to the operation of a pipeline, in a separate action brought by the attorney general or in connection with an action under section 299J.16. The director's certification of expenses is prima facie evidence that the expenses are reasonable and necessary.",
	"repealed": false
}