{
	"id": "18B.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.135",
	"title": "18B.135 SALE OF PESTICIDES IN RETURNABLE CONTAINERS AND MANAGEMENT OF UNUSED PORTIONS.",
	"text": "(a) A person distributing, offering for sale, or selling a pesticide must accept empty pesticide containers from a pesticide end user if:\n(1) the person does not participate in a designated collection program for pesticide containers after July 1, 1994;\n(2) the empty container is prepared for disposal in accordance with label instructions and is returned to the place of purchase within the state; and\n(3) a collection site that is seasonably accessible on multiple days has not been designated either by the county board or by agreement with other counties, the agricultural chemical dealer(s) in their respective counties, or the commissioner for the public to return empty pesticide containers for the purpose of reuse or recycling or following other approved management practices for pesticide containers in the order of preference established in section 115A.02, paragraph (b), and the county or counties have notified the commissioner of their intentions annually by February 1, in writing, to manage the empty pesticide containers.\n(b) This subdivision does not prohibit the use of refillable and reusable pesticide containers.\n(c) A person who has been notified by the county or counties of the designated collection site and who sells pesticides to a pesticide end user must notify purchasers of pesticides at the time of sale of the date and location designated for disposal of empty containers.\n(d) For purposes of this section, pesticide containers do not include containers that have held sanitizers and disinfectants, containers made of metal or paper, plastic bags, bag-in-a-box, water soluble bags, and aerosol packaging, pesticides labeled primarily for use on humans or pets, or pesticides not requiring dilution or mixing.\nThe commissioner may adopt rules to implement this section, including procedures and standards prescribing the exemption of certain pesticide products and pesticide containers.",
	"repealed": false
}