{
	"id": "317A.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.021",
	"title": "317A.021 APPLICATION AND ELECTION.",
	"text": "A corporation incorporated under or governed by chapter 300, 309, or 315 that has not later become governed by Minnesota Statutes 1988, chapter 317, may elect to be governed by this chapter.\nOn or after August 1, 1989, and before January 1, 1991, a corporation incorporated under or governed by Minnesota Statutes 1988, chapter 317, may elect to become governed by this chapter.\nIf the articles of an electing corporation include a provision prohibited by this chapter, omit a provision required by this chapter, or are inconsistent with this chapter, the electing corporation shall amend its articles to conform to the requirements of this chapter. The appropriate provisions of the corporation's articles or bylaws or the law by which it was governed before the effective date of the election made under this section control the manner of adoption of the amendment.\nAn election by a corporation to become governed by this chapter must be made by resolution approved by the affirmative vote of the members with voting rights of the same proportion that is required for amendment of the articles of the corporation before the election. If there are no members with voting rights, the corporation must elect to be governed by this chapter by a resolution adopted by a majority vote of the directors entitled to vote at a meeting of the board, with proper notice given. The notice must include a statement that a purpose of the meeting is to consider an election to become governed by this chapter. The resolution, articles of amendment, if required, and a certified copy of corporate documents previously recorded with the county recorder that would be filed with the secretary of state under this chapter, must be filed with the secretary of state and are effective upon filing. If an amendment of the articles is not required, the resolution must state that the articles of the corporation conform to the requirements of this chapter.\nUpon filing an election under subdivision 4, provisions of the bylaws that are consistent with this chapter remain or become effective and provisions of the bylaws that are inconsistent with this chapter are not effective.\nFrom August 1, 1989, to December 31, 1990, a corporation may be incorporated under this chapter or under Minnesota Statutes 1988, chapter 317.\n(a) A corporation in existence on January 1, 1991, that is within the scope of this chapter and incorporated under another statute of this state, other than a corporation incorporated under chapter 300, 309, or 315 that has not later become governed by Minnesota Statutes 1988, chapter 317, is governed by this chapter as of January 1, 1991, as though the corporation had been incorporated under this chapter. The provisions of the articles and bylaws of the corporation that may be included in the articles or bylaws under this chapter remain in effect. The provisions of the articles and bylaws of the corporation that are inconsistent with this chapter are not effective as of January 1, 1991. Provisions required by this chapter to be contained in the articles that do not appear in the articles are read into them as a matter of law.\n(b) On and after January 1, 1991, a corporation that elected to reject Laws 1951, chapter 550, sections 1 to 25, that does not elect to be governed by this entire chapter is governed by sections 317A.131 to 317A.151; 317A.461; and 317A.601 to 317A.791.\nOn and after January 1, 1991, a corporation that is within the scope of this chapter may be incorporated only under this chapter.\nChapters 316, 317, and 556 do not apply to corporations.",
	"repealed": false
}