{
	"id": "214.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.04",
	"title": "214.04 SERVICES.",
	"text": "The commissioner of public safety with respect to the Board of Private Detective and Protective Agent Services; the Board of Peace Officer Standards and Training; and the commissioner of revenue with respect to the Board of Assessors, shall provide suitable offices and other space, joint conference and hearing facilities, examination rooms, and the following administrative support services: purchasing service, accounting service, advisory personnel services, consulting services relating to evaluation procedures and techniques, data processing, duplicating, mailing services, automated printing of license renewals, and such other similar services of a housekeeping nature as are generally available to other agencies of state government. Investigative services shall be provided the boards by employees of the Office of Attorney General. The commissioner of health with respect to the health-related licensing boards shall provide mailing and office supply services and may provide other facilities and services listed in this subdivision at a central location upon request of the health-related licensing boards. The commissioner of commerce with respect to the remaining non-health-related licensing boards shall provide the above facilities and services at a central location for the remaining non-health-related licensing boards. The legal and investigative services for the boards shall be provided by employees of the attorney general assigned to the departments servicing the boards. Notwithstanding the foregoing, the attorney general shall not be precluded by this section from assigning other attorneys to service a board if necessary in order to insure competent and consistent legal representation. Persons providing legal and investigative services shall to the extent practicable provide the services on a regular basis to the same board or boards.\nThe health-related licensing boards and the non-health-related licensing boards shall be required to provide compensation for the reasonable costs associated with providing the services and staff required by subdivisions 1 and 3. Transfers of funds to the account of the appropriate department as specified in subdivision 1 or the Office of Attorney General shall be made on the first day of each quarter of the biennium for services furnished during the preceding quarter, and all funds so transferred shall be deposited to the account of the appropriate department or office.\nThe governor may request that a health-related licensing board review the performance of the board's executive director. Upon receipt of the request, the board must respond by establishing a performance improvement plan or taking disciplinary or other corrective action, including dismissal. The board shall include the governor's representative as a voting member of the board in the board's discussions and decisions regarding the governor's request. The board shall report to the governor on action taken by the board, including an explanation if no action is deemed necessary.\nThe executive director of each health-related board and the executive secretary of each non-health-related board shall be the chief administrative officer for the board but shall not be a member of the board. The executive director or executive secretary shall maintain the records of the board, account for all fees received by it, supervise and direct employees servicing the board, and perform other services as directed by the board. The executive directors, executive secretaries, and other employees of the following boards shall be hired by the board, and the executive directors or executive secretaries shall be in the unclassified civil service, except as provided in this subdivision:\n(1) Dentistry;\n(2) Medical Practice;\n(3) Nursing;\n(4) Pharmacy;\n(5) Accountancy;\n(6) Architecture, Engineering, Land Surveying, Landscape Architecture, Geoscience, and Interior Design;\n(7) Barber Examiners;\n(8) Cosmetologist Examiners;\n(9) Teaching;\n(10) Peace Officer Standards and Training;\n(11) Social Work;\n(12) Marriage and Family Therapy;\n(13) Dietetics and Nutrition Practice;\n(14) Licensed Professional Counseling; and\n(15) Combative Sports Commission.\nThe executive directors or executive secretaries serving the boards are hired by those boards and are in the unclassified civil service, except for part-time executive directors or executive secretaries, who are not required to be in the unclassified service. Boards not requiring full-time executive directors or executive secretaries may employ them on a part-time basis. To the extent practicable, the sharing of part-time executive directors or executive secretaries by boards being serviced by the same department is encouraged. Persons providing services to those boards not listed in this subdivision, except executive directors or executive secretaries of the boards and employees of the attorney general, are classified civil service employees of the department servicing the board. To the extent practicable, the commissioner shall ensure that staff services are shared by the boards being serviced by the department. If necessary, a board may hire part-time, temporary employees to administer and grade examinations.\nTwo or more health-related licensing boards or two or more non-health-related licensing boards may hold joint rulemaking proceedings on proposed rules relating to similar subject matters.",
	"repealed": false
}