{
	"id": "203B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.30",
	"title": "203B.30 PROCEDURES FOR EARLY VOTING.",
	"text": "For purposes of this section, \"early voting official\" means the county auditor, city clerk, a deputy of the auditor or clerk, or an election judge.\n(a) When a voter appears in an early voting polling place, the voter must state the voter's name, address, and, if requested, the voter's date of birth to the early voting official. The early voting official must confirm that the voter's registration is current in the statewide voter registration system and that the voter has not already cast a ballot in the election. If the voter's status is challenged, the voter may resolve the challenge as provided in section 204C.12. An individual who is not registered to vote or whose name or address has changed must register in the manner provided in section 201.061, subdivision 3. A voter who has already cast a ballot in the election must not be provided with a ballot.\n(b) Each voter must sign the certification provided in section 204C.10. The signature of an individual on the voter's certificate and the issuance of a ballot to the individual is evidence of the intent of the individual to vote at that election. After the voter signs the certification, two early voting officials must initial the ballot and issue it to the voter. The voter must immediately retire to a voting station or other designated location in the polling place to mark the ballot. The voter must not take a ballot from the polling place. If the voter spoils the ballot, the voter may return it to the early voting official in exchange for a new ballot. After completing the ballot, the voter must deposit the ballot into the ballot counter and ballot box. The early voting official must immediately record that the voter has voted in the manner provided in section 203B.121, subdivision 3.\nThe early voting officials must remove and secure ballots cast during the early voting period following the procedures in section 203B.121, subdivision 5, paragraph (a). The absentee ballot board must count the ballots after the polls have closed on election day following the procedures in section 203B.121, subdivision 5, paragraph (b).",
	"repealed": false
}