{
	"id": "206.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.56",
	"title": "206.56 DEFINITIONS.",
	"text": "The definitions in chapter 200 and in this section apply to sections 206.55 to 206.90.\n\"Assistive voting technology\" means touch-activated screen, buttons, keypad, sip-and-puff input device, keyboard, earphones, or any other device used with an electronic ballot marker that assists voters to use an audio or electronic ballot display in order to cast votes.\n\"Audio ballot reader\" means an audio representation of a ballot that can be used with other assistive voting technology to permit a voter to mark votes on a nonelectronic ballot.\n\"Automatic tabulating equipment\" includes machines, resident firmware, and programmable memory units necessary to automatically examine and count votes designated on a ballot.\n\"Ballot\" includes paper ballots, ballot cards, and the paper ballot marked by an electronic marking device.\n[Repealed, 1997 c 147 s 79]\n\"Ballot card\" means a ballot which is marked so that votes may be counted by automatic tabulating equipment.\n[Repealed, 1997 c 147 s 79]\n\"Counting center\" means a place selected by the governing body of a municipality where a central count electronic voting system is used for the automatic processing and counting of ballots.\n\"Electronic ballot display\" means a graphic representation of a ballot on a computer monitor or screen on which a voter may make vote choices for candidates and questions for the purpose of marking a nonelectronic ballot.\n\"Electronic ballot marker\" means equipment that is part of an electronic voting system that uses an electronic ballot display or audio ballot reader to mark a nonelectronic ballot with votes selected by a voter.\n\"Electronic voting system\" means a system in which the voter records votes by means of marking a ballot, so that votes may be counted by automatic tabulating equipment in the polling place where the ballot is cast or at a counting center.\nAn electronic voting system includes automatic tabulating equipment; nonelectronic ballot markers; electronic ballot markers, including electronic ballot display, audio ballot reader, and devices by which the voter will register the voter's voting intent; software used to program automatic tabulators and layout ballots; computer programs used to accumulate precinct results; ballots; secrecy folders; system documentation; and system testing results.\n\"Manual marking device\" means any approved device for directly marking a ballot by hand with ink, pencil, or other substance which will enable the ballot to be tabulated by means of automatic tabulating equipment.\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]\n\"Question\" means a statement of any constitutional amendment, local ordinance, charter amendment, or other proposition being submitted to the voters at an election.\n[Repealed, 1997 c 147 s 79]\n\"User list\" means a list of the chief election officials of each county and municipality responsible for preparation of a program to be used with an electronic voting system or for administration of a counting center.\n\"Municipality\" means city, town, or school district.",
	"repealed": false
}