{
	"id": "609.224",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.224",
	"title": "609.224 ASSAULT IN THE FIFTH DEGREE.",
	"text": "Whoever does any of the following commits an assault and is guilty of a misdemeanor:\n(1) commits an act with intent to cause fear in another of immediate bodily harm or death; or\n(2) intentionally inflicts or attempts to inflict bodily harm upon another.\n(a) Whoever violates the provisions of subdivision 1 against the same victim within ten years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(b) Whoever violates the provisions of subdivision 1 within three years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(a) When a person is convicted of a violation of this section or section 609.221, 609.222, or 609.223, the court shall determine and make written findings on the record as to whether:\n(1) the defendant owns or possesses a firearm; and\n(2) the firearm was used in any way during the commission of the assault.\n(b) Except as otherwise provided in section 609.2242, subdivision 3, paragraph (c), a person is not entitled to possess a pistol if the person has been convicted after August 1, 1992, of assault in the fifth degree if the offense was committed within three years of a previous conviction under sections 609.221 to 609.224, unless three years have elapsed from the date of conviction and, during that time, the person has not been convicted of any other violation of this section. Property rights may not be abated but access may be restricted by the courts. A person who possesses a pistol in violation of this paragraph is guilty of a gross misdemeanor.\n(a) Whoever violates the provisions of subdivision 1 against the same victim within ten years of the first of any combination of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency is guilty of a felony and may be sentenced to imprisonment for not more than five years or payment of a fine of not more than $10,000, or both.\n(b) Whoever violates the provisions of subdivision 1 within three years of the first of any combination of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.",
	"repealed": false
}