{
	"id": "325G.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.53",
	"title": "325G.53 GIFT CERTIFICATES.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Gift certificate\" means a tangible record evidencing a promise, made for consideration, by the seller or issuer of the record that goods or services will be provided to the owner of the record to the value shown in the record and includes, but is not limited to, a gift card, stored-value card, store card, or a similar record or card that contains a microprocessor chip, magnetic stripe, or other means for the storage of information, and for which the value is decreased upon each use.\n(b) \"Affiliate\" of another entity means any entity directly controlling, controlled by, or under common control with the other entity.\nIt is unlawful for any person or entity to sell a gift certificate that is subject to an expiration date or a service fee of any kind, including, but not limited to, a service fee for dormancy.\nThe provisions of this section shall not apply to gift certificates:\n(1) distributed to a consumer for loyalty, promotional, award, incentive, rebate, or other similar purposes without any money or other tangible thing of value being given by the consumer in exchange for the gift certificate or gift card;\n(2) that are sold below face value or at a volume discount to employers or to nonprofit and charitable organizations for fundraising purposes;\n(3) that are debit cards or other legal access devices used to access a deposit account and that are subject to the federal disclosure rules in the Electronic Fund Transfer Act, United States Code, title 15, section 1693, et seq., and its implementing Regulation E, as amended from time to time;\n(4) issued by an employer to an employee in recognition of services performed by the employee;\n(5) issued by a federally chartered or state-chartered bank, bank and trust, savings bank, savings association, or credit union, or by an operating subsidiary or other affiliate of any of them, and that can be used at multiple sellers of goods and services, provided that the issuer discloses any expiration date and fee associated with the gift certificate; or\n(6) that are prepaid calling cards used to make wireline or wireless calls.\nThe remedies of section 8.31 apply to violations of this section.",
	"repealed": false
}