{
	"id": "124D.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.74",
	"title": "124D.74 AMERICAN INDIAN EDUCATION PROGRAMS.",
	"text": "American Indian education programs are programs in public elementary and secondary schools, nonsectarian nonpublic, community, Tribal, charter, or alternative schools enrolling American Indian children designed to:\n(1) support postsecondary preparation for American Indian pupils;\n(2) support the academic achievement of American Indian pupils;\n(3) make the curriculum relevant to the needs, interests, and cultural heritage of American Indian pupils;\n(4) provide positive reinforcement of the self-image of American Indian pupils;\n(5) develop intercultural awareness among pupils, parents, and staff; and\n(6) supplement, not supplant, state and federal educational and cocurricular programs.\nProgram services designed to increase completion and graduation rates of American Indian students must emphasize academic achievement, retention, and attendance; development of support services for staff, including in-service training and technical assistance in methods of teaching American Indian pupils; research projects, including innovative teaching approaches and evaluation of methods of relating to American Indian pupils; provision of career counseling to American Indian pupils; modification of curriculum, instructional methods, and administrative procedures to meet the needs of American Indian pupils; and instruction in American Indian language, literature, history, and culture. Districts offering programs may make contracts for the provision of program services by establishing cooperative liaisons with Tribal programs and American Indian social service agencies. These programs may also be provided as components of early childhood and family education programs.\nEnrollment in American Indian education programs must be voluntary. School districts and participating schools must make affirmative efforts to encourage participation. They shall encourage parents to visit classes or come to school for a conference explaining the nature of the program and provide visits by school staff to parents' homes to explain the nature of the program.\nTo the extent that the unique educational and culturally related academic needs of American Indian people are met and American Indian student accountability factors are the same or higher than their non-American Indian peers, a district or participating school may make provision for the voluntary enrollment of non-American Indian children in the instructional components of an American Indian education program in order that they may acquire an understanding of the cultural heritage of the American Indian children for whom that particular program is designed. However, in determining eligibility to participate in a program, priority must be given to American Indian children. American Indian children enrolled in an existing nonpublic school system may be enrolled on a shared time basis in American Indian education programs.\nAmerican Indian education programs must be located in educational settings in which regular classes in a variety of subjects are offered on a daily basis. Programs may operate on an extended day or extended year basis, including school districts, charter schools, and Tribal contract schools that offer virtual learning environments.\nA school district or participating school must not, in providing these programs, assign students to schools in a way which will have the effect of promoting segregation of students by race, sex, color, or national origin.\nIn predominantly nonverbal subjects, such as art, music, and physical education, American Indian children shall participate fully and on an equal basis with their peers in school classes provided for these subjects. Every school district or participating school shall ensure to children enrolled in American Indian education programs an equal and meaningful opportunity to participate fully with other children in all extracurricular activities. This subdivision shall not be construed to prohibit instruction in nonverbal subjects or extracurricular activities which relate to the cultural heritage of the American Indian children, or which are otherwise necessary to accomplish the objectives described in sections 124D.71 to 124D.82.\n(a) A district or participating school that conducts American Indian education programs under sections 124D.71 to 124D.82 must provide American Indian culture and language classes if: (1) at least five percent of students are American Indian students; or (2) 100 or more students are American Indian students.\n(b) For purposes of this subdivision, \"American Indian students\" means students identified by the state count of American Indian students on October 1 of the previous school year.",
	"repealed": false
}