{
	"id": "473.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.415",
	"title": "473.415 ACQUIRED SYSTEMS: COUNCIL OBLIGATION; WORKER RIGHTS.",
	"text": "If the council acquires an existing transit system, the council shall assume and observe all existing labor contracts and pension obligations. All employees of such system except executive and administrative officers who are necessary for the operation thereof by the council shall be transferred to and appointed as employees of the council for the purposes of the transit system, subject to all the rights and benefits of sections 473.405 to 473.449. Such employees shall be given seniority credit and sick leave, vacation, insurance, and pension credits in accordance with the records or labor agreements from the acquired transit system. The council shall assume the obligations of any transit system acquired by it with regard to wages, salaries, hours, working conditions, sick leave, health and welfare and pension or retirement provisions for employees. The council and the employees, through their representatives for collective bargaining purposes, shall take whatever action may be necessary to have pension trust funds presently under the joint control of the acquired system and the participating employees through their representatives transferred to the trust fund to be established, maintained and administered jointly by the council and the participating employees through their representatives. No employee of any acquired system who is transferred to a position with the council shall by reason of such transfer be placed in any worse position with respect to workers' compensation, pension, seniority, wages, sick leave, vacation, health and welfare insurance or any other benefits than the employee enjoyed as an employee of such acquired system.\nFor any employees of the former Metropolitan Transit Commission who were transferred to and appointed as employees of the commission upon completion of acquisitions of transit systems which occurred prior to the effective date of Laws 1978, chapter 538, the provisions of Laws 1978, chapter 538 shall replace the provisions of subdivision 1 relating to the pension obligations which the commission is required to assume, and the pension or retirement plan and pension trust funds which the commission is required to establish, maintain and administer. Upon compliance with the applicable provisions of Laws 1978, chapter 538, the commission shall not be deemed to have placed any employee of the commission who was transferred to and appointed as an employee of the commission upon completion of acquisitions of transit systems which occurred prior to the effective date of Laws 1978, chapter 538, in any worse position with respect to pension and related benefits than the employee of the commission enjoyed as an employee of the acquired existing transit system.\nFor any employees of the former Metropolitan Transit Commission who are transferred to and appointed as employees of the commission upon completion of acquisitions of transit systems which occur subsequent to the effective date of Laws 1978, chapter 538, those employees shall be governed by the provisions of Laws 1978, chapter 538 unless the acquisition of the transit system which employed them immediately preceding the acquisition included the acquisition of a pension trust fund under the joint control of the acquired system and the participating employees through their representatives.",
	"repealed": false
}