{
	"id": "161.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.115",
	"title": "161.115 ADDITIONAL TRUNK HIGHWAYS.",
	"text": "The following routes hereby and heretofore added to the trunk highway system by the legislature under the provisions of article 14, of the constitution adopted November 2, 1920, and as the same are herein amended, are hereby confirmed.\nBeginning at a point on Route No. 27 in Little Falls, thence extending in a northeasterly direction to a point on Route No. 1, at or near Moose Lake; affording Little Falls, Onamia, Isle, McGrath, and Moose Lake a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 4, southerly of Bemidji and thence extending in a northerly direction to a point on Route No. 11, easterly of Baudette; affording Bemidji, Waskish, Baudette, and intervening and adjacent communities a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 20, at or near Zumbrota, thence extending in an easterly direction to a point on Route No. 3; affording Zumbrota, Mazeppa, Zumbro Falls, and Wabasha a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 3, at or near Weaver, thence extending in a southwesterly direction to a point at or near Chatfield; affording Weaver, St. Charles, and Chatfield, a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 3 in Winona, thence extending in a northeasterly direction to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 43, at or near Wilson, thence extending in a southeasterly direction to a point on the line between the states of Minnesota and Iowa; affording Wilson, Houston, and Caledonia a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 43 at or near Rushford, thence extending in a westerly direction to a point on Route No. 56 at or near Hayfield; affording Rushford, Chatfield, Stewartville, and Hayfield a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 9 at or near Rushford, thence extending in a southerly direction to a point on Route No. 44 at or near Mabel.\nBeginning at a point on Route No. 20 at or near Harmony, thence extending in a southerly direction to the line between the states of Minnesota and Iowa.\nBeginning at a point on Route No. 9 southerly of Wykoff, thence extending in an easterly direction to a point on Route No. 20 at or near Preston.\nBeginning at a point on Route No. 9 easterly of Austin, thence extending in a southeasterly direction to a point on Route No. 59 easterly of LeRoy.\nBeginning at a point on Route No. 40 at or near Blooming Prairie, thence extending in a westerly direction to a point on Route No. 15; affording Blooming Prairie, Ellendale, Mapleton, and St. James a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 5 westerly of Mankato, thence extending in a northwesterly direction to a point on Route No. 15 southerly of New Ulm.\nBeginning at a point on Route No. 7 at or near Sleepy Eye, thence extending in a southerly direction to the line between the states of Minnesota and Iowa; affording Sleepy Eye, St. James, and Sherburne a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 16 at or near Windom, thence extending in a southwesterly direction to a point on the line between the states of Minnesota and Iowa at or near Bigelow; affording Windom, Worthington, and Bigelow a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on the line between the states of Minnesota and Iowa southerly of Lakefield, thence extending northerly through Lakefield to a point on Route No. 85 as herein established westerly of Windom.\nBeginning at a point on Route No. 9 southerly of Wells, thence extending in a southerly direction through Kiester to a point on the line between the states of Minnesota and Iowa.\nBeginning at a point on the line between the states of Minnesota and South Dakota, and on Route No. 9, thence extending in a northeasterly direction to a point on Route No. 12 at or near Montevideo; affording Jasper, Pipestone, Marshall, and Montevideo a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 6 at or near Pipestone, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on Route No. 6 at or near Ivanhoe, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on the line between the states of Minnesota and Iowa southerly of Adrian, thence extending in a northerly direction to a point on Route No. 88 as herein established at or near Russell; affording Adrian, Lake Wilson, and Russell a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 17 westerly of Currie, thence extending in an easterly direction to a point on Route No. 84; affording Currie and Jeffers a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 4 at or near Redwood Falls, thence extending in a southeasterly direction to a point on Route No. 70 at or near Sleepy Eye.\nBeginning at a point on Route No. 3, northerly of Hastings, thence extending in a southeasterly direction to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 94 as herein established at or near Point Douglas, thence extending in a northerly direction through Bayport and Stillwater to a point on Route No. 46 at or near Taylors Falls.\nBeginning at a point on Route No. 244 as herein established at or near Dellwood City, thence extending in a westerly direction to a point on Route No. 1 at or near White Bear Lake.\nBeginning at a point on Route No. 1 at or near Forest Lake, thence extending in an easterly direction to a point on Route No. 95 as herein established.\nBeginning at a point on Route No. 390 westerly of Forest Lake, thence extending in a northeasterly direction to a point on Route No. 1 at or near the junction of Route No. 1 and Route No. 98, thence extending in a northeasterly direction to a point on Route No. 46.\nBeginning at a point on Route No. 21 east of Le Center, thence extending in an easterly direction to a point on Route No. 21 near General Shields Lake.\nBeginning at a point on Route No. 22 at or near Gaylord, thence extending in an easterly direction to a point on Route No. 3 westerly of Red Wing; affording Gaylord, Henderson, New Prague, Northfield, Cannon Falls and Red Wing a reasonable means of communication each with the other and other places within the state.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\nBeginning at the terminus of Route No. 1 on the southerly limits of the city of St. Paul, thence extending in a northerly direction through the city of St. Paul to the point of beginning of Route No. 1 on the northerly limits of the city of St. Paul.\nBeginning at the terminus of Route No. 1 on the westerly limits of the city of Duluth, thence extending in a northeasterly direction to the point of beginning of Route No. 1 on the northerly limits of the city of Duluth.\nBeginning at the terminus of Route No. 3 on the easterly limits of the city of St. Paul, thence extending in a northwesterly direction through the cities of St. Paul and Minneapolis to the point of beginning of Route No. 3 on the westerly limits of the city of Minneapolis.\nBeginning at Washington Avenue in the city of Minneapolis, thence extending in a northeasterly direction through Minneapolis to a point at the beginning of Route No. 5 on the northerly limits of the city of Minneapolis.\nBeginning at a point on Route No. 8 in the westerly limits of the city of Duluth, thence extending in a southeasterly direction through Duluth to a point at the water's edge of St. Louis Bay and there terminating.\nBeginning at the terminus of Route No. 10 on the westerly limits of the city of Minneapolis, thence extending in an easterly direction to a point at or near Washington Avenue in the city of Minneapolis.\nBeginning at the terminus of Route No. 12 of the easterly limits of the city of St. Paul; thence extending in a westerly direction through the city of St. Paul to a point on the easterly limits of Hennepin County.\nBeginning at the terminus of Route No. 45 on the easterly limits of the city of St. Paul, thence extending into St. Paul in a southwesterly direction to connect with Route No. 102 as herein established.\nBeginning at the terminus of Route No. 50 on the southerly limits of the city of Minneapolis, thence extending through Minneapolis and northerly to a point on Route No. 2 at or near Aitkin; affording Minneapolis, Anoka, Ogilvie, Isle, and Aitkin a reasonable means of communication each with the other and other places within the state.\nBeginning at the terminus of Route No. 52 on the westerly limits of the United States Military Reservation at Fort Snelling, thence extending in a northeasterly direction through the military reservation into the city of St. Paul to connect with Route No. 102 as herein established.\nBeginning at a point on the southerly limits of the city of St. Paul, thence extending northerly to connect with Route No. 102 as herein established.\nBeginning at a point on the northerly limits of the city of St. Paul, thence extending in a southeasterly direction into St. Paul to connect with Route No. 104 as herein established.\n[Discontinued and removed]\nBeginning at a point on Route No. 102 as herein established in St. Paul thence extending in a southerly direction to a point on Route No. 1 southerly of Wescott.\nBeginning at a point on Route No. 104 as herein established in the city of Minneapolis, thence extending in a southeasterly direction to a point on Route No. 53, thence extending in a southerly direction to a point on Route No. 21 at or near Kenyon; affording Minneapolis, Mendota, Hampton, and Kenyon a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 100 as herein established easterly of New Prague, thence extending in a northeasterly direction and crossing the Mississippi River easterly of the city of South St. Paul, thence extending in a northerly direction to a point on Route No. 1 at or near White Bear.\n[See Note.]\nBeginning at a point on Route No. 45 southwesterly of Stillwater, thence extending in a westerly direction to a point on Route No. 394 in Roseville.\nBeginning at a point on Route No. 49 at or near Clara City, thence extending in an easterly direction to a point on Route No. 12 at or near Excelsior; affording Clara City, Hutchinson, and Excelsior a reasonable means of communication each with the other and other places within the state.\n[Discontinued and removed]\nBeginning at a point on Route No. 22 at or near Gaylord, thence extending in a northeasterly direction to a point on Route No. 5; affording Gaylord, Norwood, and Victoria a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 5 in Mankato, thence extending in a northwesterly direction through Nicollet to a point on Route No. 22, southerly of Gaylord.\nMS 2018 [Repealed, 1Sp2017 c 3 art 3 s 141]\nBeginning at a point on Route No. 39 at or near Wells, thence extending in a southeasterly direction to a point on Route No. 391 at or near Alden.\nBeginning at a point on Route No. 111 as herein established north of the Mississippi River, thence extending in a northerly direction to a point on Route No. 63.\nMS 1996 [Repealed, 1998 c 403 s 28]\n[Discontinued and removed]\nBeginning at the present terminus of Route No. 57 in Mantorville, thence extending in a northerly direction through Wanamingo to a point on Route No. 20.\n[Discontinued and removed]\nBeginning at a point on Route No. 3 northwesterly of Minneapolis, thence extending in a southerly direction to a point on Route No. 52.\nBeginning at a point on Route No. 37 at or near Randall, thence extending in an easterly direction to a point on Route No. 27.\nBeginning at a point on Route No. 27 at or near St. Cloud, thence extending in an easterly direction to a point on Route No. 46 at Taylors Falls; affording St. Cloud, Princeton, Cambridge, and Taylors Falls a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 5 northerly of Braham, thence extending in an easterly direction to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 5 southerly of Grasston, thence extending in a northerly direction to a point on Route No. 23.\nBeginning at a point on Route No. 28 westerly of Little Falls, thence extending in a westerly and southwesterly direction to a point on Route No. 3 at Osakis, thence extending in a general southerly direction to a point on Route No. 392; affording Little Falls, Long Prairie, and Osakis a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 8 northwesterly of Bemidji, thence extending in a northwesterly direction to a point on Route No. 11 at or near Roseau.\nBeginning at a point on Route No. 18 northwesterly of Garrison, thence extending in a northerly direction to a point on Route No. 34 at or near Remer; affording Garrison, Deerwood, Crosby, and Remer a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 19 northerly of Walker, thence extending in a northwesterly direction to a point on Route No. 4.\nBeginning at a point on Route No. 19 at or near Pine River, thence extending in a northeasterly direction to a point on Route No. 34.\nBeginning at a point on Route No. 11 at or near Baudette, thence extending in a northerly direction to Lake of the Woods.\nBeginning at a point on Route No. 28 at or near Sauk Centre, thence extending in a southerly direction to a point on Route No. 4.\nBeginning at a point on Route No. 4 at or near Paynesville, thence extending in a northwesterly direction to a point on the line between the states of Minnesota and North Dakota; affording Paynesville, Glenwood, and Elbow Lake a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 210 westerly of Sunburg, thence extending in a northerly direction to a point at or near Terrace, thence continuing in a northerly direction to a point on Route No. 142 as herein established.\nBeginning at a point on Route No. 6 at or near Madison, thence extending in a northeasterly and northerly direction to a point on Route No. 142 as herein established at or near Barrett; affording Madison, Appleton, Morris, and Barrett a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on or near Route No. 10 at or near Willmar, thence extending in a westerly direction to a point on Route No. 144 as herein established.\nBeginning at a point on Route No. 49, thence extending in a southerly direction through Maynard to a point on Route No. 12.\nBeginning at a point on Route No. 66 at or near Appleton, thence extending in a northwesterly direction to a point on Route No. 6.\nBeginning at a point on Route No. 6 at or near Ortonville, thence extending in a northwesterly direction to a point on Route No. 28.\nBeginning at a point on Route No. 148 as herein established at Ortonville, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on Route No. 12 at or near Hector, thence extending in a northerly direction to a point on Route No. 4 at or near Paynesville; affording Hector, Grove City, and Paynesville a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 24 southerly of Kimball, thence extending in a southerly direction to a point on Route No. 14 at or near Winthrop; affording Kimball, Hutchinson, and Winthrop a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 10 at or near Herman, thence extending in a northwesterly direction to a point on Route No. 3 southerly of Breckenridge.\n[Discontinued and removed]\nBeginning at a point on Route No. 6 at or near Canby, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on Route No. 12 southerly of Madison, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on Route No. 394 in the city of Minneapolis and extending in a northerly and westerly direction to a point on Route No. 62 easterly of the Great Northern Railway.\n[See Note.]\nBeginning at a point on Route No. 35 on the north side of Mille Lacs Lake, thence extending in an easterly direction to a point on Route No. 110 as herein established.\nBeginning at a point on Route No. 11 at International Falls, thence extending in an easterly direction to Black Bay.\nBeginning at a point on Route No. 5 at or near Swan River, thence extending in a northerly direction to a point on Route No. 4 at or near Little Fork; affording Swan River, Nashwauk, and Little Fork a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 35 at or near Tower, thence extending in a westerly direction to a point on Route No. 136 as herein established southerly of Red Lake.\nBeginning at a point on Route No. 58 in Red Wing, thence extending in a northerly direction to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 34 at or near Remer, thence extending in an easterly direction to a point on Route No. 8.\nBeginning at a point on Route No. 1 at or near Moose Lake, thence extending in a northerly direction to a point on Route No. 11 southerly of Orr; affording Moose Lake, Cromwell, Floodwood, Hibbing, Chisholm, and Orr a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 1, thence extending in a northerly direction through Cloquet to a point on Route No. 11.\nBeginning at a point on Route No. 8 westerly of Deer River, thence extending in a northwesterly direction to a point on Route No. 4.\nBeginning at a point on Route No. 35 at Ely, thence extending in a southeasterly direction to a point on Route No. 1.\nBeginning at a point on Route No. 11 northerly of Virginia, thence extending in a northeasterly direction to a point on Route No. 160 as herein established westerly of Tower.\nBeginning at a point on Route No. 4 near Itasca State Park, thence in a northwesterly direction to a point on Route No. 31 at Mahnomen.\nBeginning at a point on Route No. 8 at or near Bagley, thence extending in a southerly direction to a point on Route No. 168 as herein established.\nBeginning at a point on Route No. 32 at or near Thief River Falls, thence extending in an easterly direction to a point on Route No. 136 as herein established.\nBeginning at a point on Route No. 6 near St. Vincent, thence extending in a westerly direction to a point on the line between the states of Minnesota and North Dakota.\nBeginning at a point on Route No. 6 at or near Donaldson, thence extending in a westerly direction to a point on the line between the states of Minnesota and North Dakota.\nBeginning at a point on Route No. 6 at or near Warren, thence extending in a westerly direction to a point on the line between the states of Minnesota and North Dakota.\nBeginning at a point on Route No. 8 at or near Erskine, thence extending in a northwesterly direction to a point on the boundary line between United States and Canada northerly of Lancaster.\nAny portion of Route No. 174 northerly or westerly of Lancaster heretofore established as a trunk highway shall continue as a trunk highway until the commissioner of transportation shall pursuant to the authority in this section contained definitely locate Route No. 174 hereunder northerly of Lancaster. Upon the final and definite location of Route No. 174 hereunder northerly of Lancaster then any portion of Route No. 174 northerly or westerly of Lancaster heretofore established as a part of Route No. 174 and not included in any new designation hereunder shall revert to the county or subdivision thereof originally charged with the care thereof but where such road or any portion thereof so ceasing to be a trunk highway had its origin as a state trunk highway it shall become a county road unless the same lies within the corporate limits of any city in which event it shall become a street of such city.\nBeginning at a point on Route No. 8 at or near Crookston, thence extending in a southerly direction to a point on Route No. 6 northerly of Hendrum.\nBeginning at a point on Route No. 175 as herein established at or near Halstad, thence extending in a westerly direction to a point on the line between the states of Minnesota and North Dakota.\nBeginning at a point on Route No. 32 southerly of Red Lake Falls, thence extending in a southerly direction to a point on Route No. 182.\nBeginning at a point on Route No. 6 near Crookston, thence extending in a southeasterly direction to a point on Route No. 177 as herein established at or near Fertile.\nBeginning at a point on Route No. 6 at or near Ada, thence extending in a southerly direction to a point on Route No. 64 at or near Barnesville.\nBeginning at a point on Route No. 3 at or near Erdahl, thence extending in a general northerly or northeasterly direction to a point on Route No. 181 as herein established at or near Ottertail.\nBeginning at a point on Route No. 36 at or near Henning, thence extending in a northwesterly direction to a point on Route No. 2 at or near Perham.\nBeginning at a point on Route No. 30 at or near Lake Lizzie, thence extending in a westerly direction to a point on Route No. 64 at or near Barnesville.\nBeginning at a point on Route No. 36 east of Henning, thence extending in an easterly direction to a point on Route No. 2 at or near Staples.\nBeginning at a point on Route No. 29 at or near Deer Creek, thence extending in a northerly direction to a point on Route No. 2.\nBeginning at a point on Route No. 1 and Route No. 390, thence extending in a northeasterly direction to a point on Route No. 103 as herein established in Duluth.\n[See Note.]\nBeginning at a point on Route No. 110 as herein established, thence extending in an easterly direction to a point on Route No. 1 and Route No. 390; affording Isle and Finlayson a reasonable means of communication each with the other and other places within the state.\n[See Note.]\nBeginning at a point on Route No. 18 at or near Elk River, thence extending in a southerly direction to a point on Route No. 117 as herein established.\nBeginning at a point on Route No. 69 at Buffalo, thence extending in an easterly direction to a point on Route No. 110 as herein established.\nBeginning at a point on Route No. 5 southerly of Mora, thence extending in a southerly direction to a point on Route No. 132 as herein established.\nBeginning at a point on Route No. 6 at or near Wheaton, thence extending in a southwesterly direction to a point on Route No. 28 at or near Browns Valley.\nBeginning at a point on Route No. 190 as herein established southwesterly of Wheaton, thence extending in a westerly direction to a point on the line between the states of Minnesota and South Dakota.\nBeginning at a point on Route No. 1 at or near Hinckley, thence extending in an easterly direction to the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 2 at or near Motley, thence extending in a northerly direction to a point on Route No. 34 westerly of Walker.\nBeginning at a point on Route No. 117 as herein established at or near Mendota, thence extending in a northeasterly direction to a point on Route No. 102 as herein established.\nBeginning at a point on Route No. 1 at or near Albert Lea, thence extending in a southwesterly direction to a point on the line between the states of Minnesota and Iowa.\nBeginning at a point on Route No. 8 at or near Grand Rapids, thence extending in a northerly direction to a point on Route No. 160 as herein established; affording Grand Rapids and Big Fork a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 4 southerly of Park Rapids, thence extending in an easterly direction to a point on Route No. 139 as herein established easterly of Backus.\nBeginning at a point on Route No. 9 at or near LaCrescent, thence extending in a southerly direction to a point on the line between the states of Minnesota and Iowa.\nBeginning at a point on Route No. 9 at or near Austin, thence extending in a southwesterly direction to a point on the line between the states of Minnesota and Iowa.\nBeginning at a point on Route No. 4 at or near Itasca State Park, thence extending in a westerly direction to a point on Route No. 30 at or near Waubun.\nBeginning at a point on Route No. 82, as herein established, near Waldorf, thence extending in a northwesterly direction to a point on Route No. 39 at or near Mankato.\nBeginning at a point on Route No. 11 at or near Eveleth, thence extending in a northeasterly direction to a point on Route No. 35 at Gilbert.\nBeginning at a point on Route No. 11 westerly of Duluth, thence extending in a southeasterly direction through Proctor and Duluth to the water's edge of St. Louis Bay, and there terminating.\nBeginning at a point on Route No. 11, westerly of Duluth, thence extending in a southeasterly direction to a point on Route No. 103, as herein established in Duluth.\nBeginning at a point on Route No. 54, easterly of Herman, thence extending in an easterly direction to a point on Route No. 29, at or near Alexandria.\nBeginning at a point on Route No. 30, at or near Pelican Rapids, thence extending in an easterly direction to a point on Route No. 181, as herein established, southerly of Perham.\nBeginning at a point on Route No. 2, at or near Frazee, thence extending in an easterly direction to a point on Route No. 4 at or near Menahga.\nBeginning at a point on Route No. 28 at or near Starbuck, thence extending in a northerly direction to a point on Route No. 3 at or near Garfield.\nBeginning at a point on Route No. 3 at or near Becker, thence extending in a northerly direction to a point on Route No. 18, at or near Brainerd; affording Becker, Foley, Gilman, Pierz and Brainerd, a reasonable means of communication each with the other and other places within the state.\nBeginning at a point on Route No. 10 at or near Benson, thence extending in an easterly direction to a point on Route No. 4 at or near New London.\nBeginning at a point on Route No. 64 at or near Barnesville, thence extending in a southwesterly direction to a point on Route No. 3 at or near Breckenridge.\nBeginning at a point on Route No. 3 at or near Robbinsdale, thence extending in a northeasterly and easterly direction to a point on Route No. 62 easterly of New Brighton, affording necessary and reasonable means of communication to industrial areas engaged in the manufacture of essential war materials, and bringing into the Trunk Highway System an important route a portion of which has been heretofore improved with federal aid, and all which has been approved for surveys and plans with federal funds by the Public Roads Administration.\nBeginning at a point on Route No. 185 in Duluth, thence extending in an easterly direction to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Constitutional Route No. 3, now known as Trunk Highway 61 in the city of Wabasha, Minnesota, thence northerly to a point on the line between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 1, at or near Carlton; thence extending in an easterly direction to a point on Route No. 185.\nBeginning at a point on Route No. 35, at or near Hibbing; thence extending in an easterly direction to a point on Route No. 11 southerly of Eveleth.\nBeginning at a point on Route No. 159, at or near Littlefork; thence extending in an easterly direction to a point on Route No. 11.\nBeginning at a point on Route No. 11, westerly of Roseau; thence extending in a westerly direction thence in a general northerly direction to reach the international boundary near Pinecreek.\nBeginning at a point on Route No. 170 easterly of Thief River Falls; thence extending in a general northerly direction to a point on Route No. 136 westerly of Grygla.\nBeginning at a point on Route No. 175 at or near Climax; thence extending in a general northwesterly direction to a point on Route No. 8 at or near East Grand Forks; thence continuing in a general northerly direction to a point on Route No. 173 westerly of Warren; thence continuing in a general northerly direction to a point on Route No. 172 westerly of Donaldson.\nBeginning at a point on Route No. 166 in Ely; thence extending in a general northeasterly direction to a point north of the center of Section 20, Township 63 North, Range 11 West.\nMS 2020 [Repealed, 1Sp2019 c 3 art 3 s 132]\nBeginning at a point in or adjacent to Leonard; thence extending in a westerly direction to a point on Route No. 65.\nMS 2004 [Repealed, 2005 c 7 s 1]\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 142]\nBeginning at a point in Section 10, Township 140 North, Range 34 West; thence extending in a general southerly direction to a point on Route No. 34.\nMS 2012 [Repealed, 2012 c 287 art 3 s 57]\nMS 2014 [Repealed, 2015 c 75 art 2 sec 50]\nBeginning at a point on Route No. 64 southerly of Barnesville; thence extending in a general easterly direction to a point on Route No. 30, at or near Pelican Rapids.\nBeginning at a point on Route No. 6, at or near Moorhead; thence extending in a general westerly direction to a point on the boundary between the states of Minnesota and North Dakota.\n[Discontinued and removed]\nMS 1994 [Repealed, 1996 c 456 s 24]\nMS 2000 [Repealed, 2001 c 213 s 29]\nBeginning at a point on Route No. 138 westerly of Laporte; thence extending in a general southerly direction to a point on Route No. 34, at or near Akeley.\nMS 2012 [Repealed, 2013 c 127 s 66]\n[Discontinued and removed]\nMS 2020 [Repealed, 2020 c 100 s 26]\nBeginning at a point on Route No. 3 westerly of Albany; thence extending in a general northerly direction to a point at or near Upsala; thence continuing in a northerly direction to a point on Route No. 28 westerly of Little Falls.\nBeginning at a point on Route No. 27, at or near Sauk Rapids; thence extending in a general southwesterly direction crossing the Mississippi River; thence continuing in a general southerly direction to a point on Route No. 3 at or near St. Cloud.\nBeginning at a point on Route No. 69, at or near Annandale; thence extending in a general northerly direction to a point on Route No. 3.\nBeginning at a point in or adjacent to St. Michael; then extending in a general easterly direction to a point on Route No. 392.\nMS 2008 [Repealed, 2006 c 234 s 8]\nBeginning at a point on Route No. 95 southerly of Route No. 46; thence extending in a general southeasterly direction to a point on the boundary between the states of Minnesota and Wisconsin.\nBeginning at a point on Route No. 1 southerly of White Bear Lake; thence extending in a general easterly and northerly direction to a point at or near Mahtomedi; thence continuing in a general northerly direction to a point on Route No. 96.\n[See Note.]\nBeginning at a point at or near the junction of Route No. 3 and Route No. 20; thence extending in a general westerly direction to a point on Route No. 50.\nBeginning at a point in or adjacent to Nerstrand; thence extending in a general northerly direction to a point westerly of Dennison; thence continuing in a general northwesterly direction to a point on Route No. 1 at or near Northfield.\nBeginning at a point on Route No. 59 southerly of Zumbro Falls; thence extending in a general easterly direction to a point on Route No. 42 at or near Plainview.\nBeginning at a point in or adjacent to Altura; thence extending in a general easterly direction to a point in or adjacent to Rollingstone; thence continuing in a general easterly direction to a point on Route No. 3.\n[Discontinued and removed, 1989 c 169 s 1]\nBeginning at a point on Route No. 9, at or near Lanesboro; thence extending in a general northerly direction to a point on Route No. 77.\nBeginning at a point on Route No. 1, at or near Clarks Grove; thence extending in a general easterly direction to a point on Route No. 40.\nBeginning at a point on Route No. 9 westerly of Austin; thence extending northeasterly to a point on Route No. 40 northerly of the south line of Section 34, Township 103 North, Range 18 West, Mower County, Minnesota; thence extending southeasterly to a point on Route No. 9 in or near Austin; thence extending easterly along Route No. 9 to a point in or near Austin and thence southerly and westerly to a point on Route No. 40 in or near Austin.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 133]\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 134]\nBeginning at a point on Route No. 5, at or near Winnebago; thence extending in a general easterly direction to a point on Route No. 39, at or near Wells.\nMS 2014 [Repealed, 2013 c 127 s 67; 2014 c 287 s 23]\nBeginning at a point in or adjacent to Hanska; thence extending in an easterly direction to a point on Route No. 15.\nMS 2012 [Repealed, 2012 c 287 art 3 s 58]\nBeginning at a point on Statutory Route No. 100, at or near Henderson; thence extending in a general southeasterly direction to a point at or near Le Sueur.\nBeginning at a point on Route No. 5 southwesterly of Shakopee, thence extending in a northerly direction to a point on proposed Route No. 12, thence extending in a northeasterly direction to a point on Route No. 5 at or near Edina.\nMS 1994 [Repealed, 1996 c 456 s 24]\nMS 2008 [Repealed, 2007 c 23 s 2]\nBeginning at a point in or adjacent to Ceylon; thence extending in a general northerly direction to a point on Route No. 391 westerly of Fairmont.\n[See Note.]\nBeginning at a point in or adjacent to Round Lake; thence extending in a general northerly direction to a point on Route No. 391 easterly of Worthington.\n[See Note.]\nBeginning at a point on Route No. 85 northeasterly of Bigelow; thence extending in a southerly direction to a point on the boundary between the states of Minnesota and Iowa.\nMS 2004 [Repealed, 1Sp2003 c 22 s 3]\nBeginning at a point in or adjacent to Iona; thence extending in a general northerly direction to a point on Route No. 17, at or near Slayton.\n[See Note.]\nMS 2004 [Repealed, 2005 c 5 s 1]\nBeginning at a point on Route No. 88, at or southerly of Jasper; thence extending in a westerly direction to a point on the boundary between the states of Minnesota and South Dakota.\nBeginning at a point in or adjacent to Hills; thence extending in a general easterly direction to a point on Route No. 6.\nBeginning at a point on the boundary between the states of Minnesota and South Dakota near the northwest corner of Section 30, Township 113 North, Range 46 West; thence extending in an easterly and southerly direction to a point in or adjacent to Hendricks; thence continuing in a southerly direction to a point on Route No. 90.\nBeginning at a point on Route No. 14 northerly of Milroy; thence extending in a southerly and easterly direction to a point on Route No. 4 south of Redwood Falls; thence continuing in an easterly direction to a point on Route No. 93, in or adjacent to Morgan.\nMS 2004 [Repealed, 1Sp2003 c 22 s 3]\nMS 2022 [Repealed, 2023 c 68 art 5 s 53]\nMS 2016 [Repealed, 2015 c 75 art 2 s 51]\nBeginning at a point on the boundary line between the states of Minnesota and South Dakota westerly of Marietta, thence extending in an easterly direction to a point in or adjacent to Marietta, thence extending in a general easterly direction to a point on Route No. 6.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 135]\nRoute No. 278. [Discontinued and removed]\nBeginning at a point on Route No. 384 in Minneapolis, thence extending in a general southerly direction across the Minnesota River to a point at 138th Street in Apple Valley.\nBeginning at a point on St. Anthony Avenue in St. Paul; thence extending in a general northerly direction to a point on Route No. 63, at or near New Brighton.\nBeginning at a point on Route No. 203 in Duluth, at or near its westerly junction with Route No. 103; thence extending in a northeasterly direction through Duluth to a point on Route No. 103 in the northeasterly portion of Duluth.\nBeginning at a point on Route No. 5, at or near Jordan; thence extending in a general northeasterly direction to a point on Route No. 117 westerly of Spring Lake.\nBeginning at a point on Route No. 30, at or near Waubun; thence extending in a general westerly direction to a point on Route No. 177.\nBeginning at a point on Route No. 121, at or near Waconia; thence extending in a southerly direction to a point on Route No. 12.\n[Discontinued and removed]\nBeginning at a point on Route No. 196, at or near Marcell; thence extending in a westerly direction to a point on Route No. 61.\nBeginning at a point on Route No. 28, at or near Grey Eagle; thence extending in a general northwesterly direction to a point on Route No. 4.\nMS 2014 [Repealed, 1998 c 403 s 28]\nBeginning at a point on Route No. 1 at or near Moose Lake; thence extending in a general southeasterly direction to a point at or in the grounds of the Moose Lake Regional Treatment Center.\nMS 2010 [Repealed, 2009 c 28 s 1]\nMS 2010 [Repealed, 2012 c 287 art 3 s 59]\nBeginning at a point on Route No. 3 in Red Wing; thence extending in a general southerly and easterly direction through the grounds of the Minnesota State Training School for Boys to a point on Route No. 3 in Red Wing.\nMS 2008 [Repealed, 2009 c 28 s 2]\nMS 2008 [Repealed, 2006 c 234 s 8]\nMS 2008 [Repealed, 2008 c 350 art 1 s 89]\n[Discontinued and removed, 1988 c 565 s 4]\nMS 2010 [Repealed, 2010 c 265 s 2]\nBeginning at a point on Route No. 21 in the city of Faribault; thence extending in a southerly direction to a point on Route No. 323.\n[See Note.]\nBeginning at a point on Route No. 21 in the city of Faribault; thence extending in a general northerly direction to a point at or in the grounds of the Minnesota State Academy for the Deaf.\n[See Note.]\nMS 1994 [Repealed, 1996 c 456 s 24]\nBeginning at a point on Route No. 3; thence extending in a general westerly direction to the main entrance of the Minnesota State Reformatory for Men.\nMS 2004 [Repealed, 1Sp2003 c 22 s 3]\n[Discontinued and removed]\nBeginning at a point on Route No. 38 at or near Montevideo; thence extending in an easterly direction to connect with Route No. 49 easterly of Montevideo.\nMS 2000 [Repealed, 2001 c 213 s 29]\nBeginning at a point on Route No. 35 at or near Gilbert; thence extending in a general northeasterly direction to a point on Route No. 35 at or near Biwabik.\nBeginning at a point on Constitutional Route No. 8 at or near East Grand Forks; thence extending in a general westerly direction to a point on the boundary between the states of North Dakota and Minnesota.\nBeginning at a point on Constitutional Route No. 11 westerly of Fox; thence running in a general northerly direction to a point on Statutory Route No. 218 at or near Ross.\nMS 2012 [Repealed, 2014 c 287 s 26]\nBeginning at a point on Route No. 11 at or near Roseau, thence extending in a northerly direction to a point on the boundary line between the State of Minnesota and the Province of Manitoba, Canada.\nBeginning at a point on Route No. 289 at or near the entrance to the Moose Lake State Hospital, thence extending in an easterly direction to a point on Route No. 390.\n[Discontinued and removed]\nBeginning at a point on Route No. 11 at or near Warroad, thence extending in a northerly direction to a point on the boundary between the State of Minnesota and the Province of Manitoba, Canada.\nBeginning at a point on Route No. 110 southerly of St. Francis, thence extending in a general easterly direction to a point on Route No. 5, thence extending in a general easterly direction to a point on Route No. 1 at or near Forest Lake, provided, however, that such route shall not be established, constructed or marked until receipt by the adjutant general of Minnesota of the authority from the proper federal agency to proceed with the acquisition of land for the construction of the proposed Bethel airport affording Bethel Airport a reasonable means of communication with other places within the state.\nBeginning at a point on Route No. 158 in International Falls, thence extending in a general northerly direction to the boundary line between the State of Minnesota and the Province of Ontario, Canada.\nBeginning at a point on Route No. 3 at or near Hastings, thence extending in a southeasterly direction to a point on Route No. 3 at or near Red Wing.\nBeginning at a point on Route No. 220 westerly of Stephen in Marshall County, thence extending in a westerly direction to the boundary line between the state of Minnesota and the state of North Dakota.\n[Discontinued and removed]\nBeginning at a point on Route No. 6 in the city of Ortonville; thence in a general northwesterly direction to a point on Route No. 148 in Ortonville.\nBeginning at a point on Route No. 116, easterly of Nerstrand; thence extending in a general westerly direction to a point on Route No. 246 in or adjacent to Nerstrand.\nBeginning at a point on Route No. 22 in Eden Valley, thence extending in a general northerly direction, so as to run easterly of Horse Shoe Lake, to a point on Route No. 23 in Richmond.\nMS 2000 [Repealed, 2001 c 213 s 29]\nBeginning at a point on Route No. 298 at or near the intersection of Route No. 298 and Barron Road; thence extending westerly, southerly and northeasterly to a point on Route No. 298.\n[See Note.]\nBeginning at a point on Route No. 6 in Hallock; thence extending in a general westerly direction following generally the location of present County State-Aid Highway 3 to a point on the boundary line between the state of Minnesota and the state of North Dakota.\nBeginning at a point on Constitutional Route No. 11 in Baudette, thence extending in a northerly and northeasterly direction to the boundary line between the state of Minnesota and the Province of Ontario, Canada.\nMS 1994 [Repealed, 1996 c 456 s 24]\n[Discontinued and removed]\nBeginning at a point on Route No. 6 in Hallock; thence extending in a general easterly direction to a point on Route No. 174, northerly of Lake Bronson.\nBeginning at a point on Route No. 144 in or near Morris; thence extending in an easterly direction into and through the grounds of the West Central School and Experiment Station of the University of Minnesota and terminating at the east boundary thereof.\nBeginning at a point on Route No. 7 westerly of Lamberton; thence extending into and through the grounds of the Southwest Experiment Station of the University of Minnesota; thence back to a point on Route No. 7.\nMS 1994 [Repealed, 1996 c 455 art 3 s 34]\nMS 2010 [Repealed, 2011 c 34 s 1]\nBeginning at a point on Route 392 in Hennepin County, thence extending in a generally easterly direction to a point on Route 394 in Anoka or Ramsey county.\nBeginning at a point on Route No. 116 at or near Inver Grove Heights; thence extending in a general northerly direction to a point near Kellogg Boulevard East in St. Paul.\nMS 2008 [Repealed, 2008 c 350 art 1 s 89]\nBeginning at a point on Route No. 2 at or near Dilworth; thence extending in a general southerly direction following generally the location of present County State-Aid Highway 11 to a point on Route No. 392.\nFrom a point on Route No. 2 in the city of Brainerd thence extending southwesterly to its intersection with new, marked Trunk Highway 371 as signed on May 30, 2001.\nBeginning at a point on Route No. 7 easterly of Rochester and thence extending in a southerly direction to a point on Route No. 391.\nBeginning at a point on Route No. 45, thence extending easterly to a point on the boundary line between the states of Minnesota and Wisconsin.\nBeginning at a point at or near the entrance of the Upper Sioux Agency State Park; thence extending in a generally northwesterly direction to a point on Route No. 67 at or near Granite Falls.\nBeginning at a point on Route No. 1 at Sandstone, thence extending in a generally easterly direction to a point at or near the east bank of the Kettle River.\n[See Note.]",
	"repealed": false
}