{
	"id": "85.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.32",
	"title": "85.32 STATE WATER TRAILS.",
	"text": "(a) The commissioner of natural resources is authorized in cooperation with local units of government and private individuals and groups when feasible to manage state water trails on the Lake Superior water trail under section 85.0155 and on the following rivers, which have historic, recreational, and scenic values: Little Fork, Big Fork, Minnesota, St. Croix, Snake, Mississippi, Red Lake, Cannon, Straight, Des Moines, Crow Wing, St. Louis, Pine, Rum, Kettle, Cloquet, Root, Zumbro, Pomme de Terre within Swift County, Watonwan, Cottonwood, Whitewater, Chippewa from Benson in Swift County to Montevideo in Chippewa County, Long Prairie, Red River of the North, Sauk, Otter Tail, Redwood, Blue Earth, Cedar, Shell Rock, Vermilion in St. Louis County, north fork of the Crow, and south fork of the Crow. The commissioner may map and sign points of interest, public water access sites, portages, camp sites, and dams, rapids, waterfalls, and other serious hazards that are dangerous to canoe, kayak, and watercraft travelers. The commissioner may maintain passageway for watercraft on state water trails.\n(b) Notwithstanding section 10.49, the segment of the St. Croix River Water Trail between Wild River State Park and William O'Brien State Park is designated and named the Walter F. Mondale Scenic Riverway.\nThe commissioner may, in cooperation with local units of government as provided in subdivision 1, acquire land by purchase, grant, gift, devise, exchange, lease or easement for camp sites, rest areas, river accesses and portages. The acquisition of any parcel of land pursuant to this subdivision shall not exceed 20 acres, unless it will or should require a land survey or a larger parcel will be in the best interest of the state, in which case the commissioner may acquire land not to exceed 40 acres or unless specifically authorized by the executive council. The commissioner may also develop and be responsible for the maintenance of campsites, rest areas, river accesses, and portages on the areas acquired, or in cooperation with local units of government, organizations, or individuals, along those rivers designated in subdivision 1.\nAreas acquired by easement or lease or areas designated and marked under this section shall not be subject to the provisions of section 160.06.",
	"repealed": false
}