{
	"id": "144G.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.13",
	"title": "144G.13 BACKGROUND STUDIES OF LICENSE APPLICANTS.",
	"text": "(a) Before the commissioner issues a provisional license, issues a license as a result of an approved change of ownership, or renews a license, a managerial official or a natural person who is an owner with direct ownership interest is required to undergo a background study under section 144.057. No person may be involved in the management, operation, or control of an assisted living facility if the person has been disqualified under chapter 245C. For the purposes of this section, managerial officials subject to the background study requirement are individuals who provide direct contact. Nothing in this section shall be construed to prohibit the facility from requiring self-disclosure of criminal conviction information.\n(b) The commissioner shall not issue a license if any controlling individual, including a managerial official, has been unsuccessful in having a background study disqualification set aside under section 144.057 and chapter 245C.\n(c) Termination of staff in good faith reliance on information or records obtained under this section regarding a confirmed conviction does not subject the assisted living facility to civil liability or liability for unemployment benefits.\n(a) If the individual requests reconsideration of a disqualification under section 144.057 or chapter 245C and the commissioner sets aside or rescinds the disqualification, the individual is eligible to be involved in the management, operation, or control of the facility.\n(b) If an individual has a disqualification under section 245C.15, subdivision 1, and the disqualification is affirmed, the individual's disqualification is barred from a set aside, and the individual must not be involved in the management, operation, or control of the facility.\nData collected under this section shall be classified as private data on individuals under section 13.02, subdivision 12.",
	"repealed": false
}