{
	"id": "151.741",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.741",
	"title": "151.741 INSULIN MANUFACTURER REGISTRATION FEE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Board\" means the Minnesota Board of Pharmacy under section 151.02.\n(c) \"Manufacturer\" means a manufacturer licensed under section 151.252 and engaged in the manufacturing of prescription insulin.\n(a) The board shall assess each manufacturer an annual registration fee of $100,000, except as provided in paragraph (b). The board shall notify each manufacturer of this requirement beginning November 1, 2024, and each November 1 thereafter.\n(b) A manufacturer may request an exemption from the annual registration fee. The board shall exempt a manufacturer from the annual registration fee if the manufacturer can demonstrate to the board, in the form and manner specified by the board, that gross revenue from sales of prescription insulin produced by that manufacturer and sold or delivered within or into Minnesota was less than five percent of the total gross revenue from sales of prescription insulin produced by all manufacturers and sold or delivered within or into Minnesota in the previous calendar year.\n(a) Each manufacturer must pay the registration fee by March 1, 2025, and by each March 1 thereafter. In the event of a change in ownership of the manufacturer, the new owner must pay the registration fee that the original owner would have been assessed had the original owner retained ownership. The board may assess a late fee of ten percent per month or any portion of a month that the registration fee is paid after the due date.\n(b) The registration fee, including any late fees, must be deposited in the insulin safety net program account.\nThe insulin safety net program account is established in the special revenue fund in the state treasury. Money in the account is appropriated each fiscal year to:\n(1) the MNsure board in an amount sufficient to carry out assigned duties under section 151.74, subdivision 7; and\n(2) the Board of Pharmacy in an amount sufficient to cover costs incurred by the board in assessing and collecting the registration fee under this section and in administering the insulin safety net program under section 151.74.\n(a) The insulin repayment account is established in the special revenue fund in the state treasury. Money in the account is appropriated each fiscal year to the commissioner of administration to reimburse manufacturers for insulin dispensed under the insulin safety net program in section 151.74, in accordance with section 151.74, subdivisions 3, paragraph (h), and 6, paragraph (h), and to cover costs incurred by the commissioner in providing these reimbursement payments.\n(b) By June 30, 2025, and each June 30 thereafter, the commissioner of administration shall certify to the commissioner of management and budget the total amount expended in the prior fiscal year for:\n(1) reimbursement to manufacturers for insulin dispensed under the insulin safety net program in section 151.74, in accordance with section 151.74, subdivisions 3, paragraph (h), and 6, paragraph (h); and\n(2) costs incurred by the commissioner of administration in providing the reimbursement payments described in clause (1).\n(c) The commissioner of management and budget shall transfer from the health care access fund to the special revenue fund, beginning July 1, 2025, and each July 1 thereafter, an amount equal to the amount to which the commissioner of administration certified pursuant to paragraph (b).\nIf subdivisions 2 and 3, or the application of subdivisions 2 and 3 to any person or circumstance, are held invalid for any reason in a court of competent jurisdiction, the invalidity of subdivisions 2 and 3 does not affect other provisions of this act, and the commissioner of management and budget shall annually transfer from the health care access fund to the insulin safety net program account an amount sufficient to implement subdivision 4.",
	"repealed": false
}