{
	"id": "116L.362",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.362",
	"title": "116L.362 GRANTS.",
	"text": "(a) The commissioner shall make grants to eligible organizations for programs to provide education and training services to targeted youth. The purpose of these programs is to provide specialized training and work experience for targeted youth who have not been served effectively by the current educational system. The programs are to include a work experience component with work projects that result in the rehabilitation, improvement, or construction of (1) residential units for the homeless; (2) improvements to the energy efficiency and environmental health of residential units and other green jobs purposes; (3) facilities to support community garden projects; or (4) education, social service, or health facilities which are owned by a public agency or a private nonprofit organization.\n(b) Eligible facilities must principally provide services to homeless or low income individuals and families, and include the following:\n(1) Head Start or day care centers, including playhouses or similar incidental structures;\n(2) homeless, battered women, or other shelters;\n(3) transitional housing and tiny houses;\n(4) youth or senior citizen centers;\n(5) community health centers; and\n(6) community garden facilities.\nTwo or more eligible organizations may jointly apply for a grant. The commissioner shall administer the grant program.\nInterested eligible organizations must apply to the commissioner for the grants. The advisory committee must review the applications and provide to the commissioner a list of recommended eligible organizations that the advisory committee determines meet the requirements for receiving a grant. The total grant award for any program may not exceed $150,000 per year. In awarding grants, the advisory committee and the commissioner must give priority to:\n(1) continuing and expanding effective programs by providing grant money to organizations that are operating or have operated a successful program that meets the program purposes under section 116L.364; and\n(2) distributing programs throughout the state through start-up grants for programs in areas that are not served by an existing program.\nTo receive a grant under this section, the eligible organization must match the grant money with at least an equal amount of nonstate money. The commissioner must verify that the eligible organization has matched the grant money. Nothing in this subdivision shall prevent an eligible organization from applying for and receiving grants for more than one program. A grant received by an eligible organization from the federal Youthbuild Project under United States Code, title 42, section 5091, is nonstate money and may be used to meet the state match requirement. State grant money awarded under this section may be used by grantee organizations for match requirements of a federal Youthbuild Project.",
	"repealed": false
}