{
	"id": "624.714",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.714",
	"title": "624.714 CARRYING OF WEAPONS WITHOUT PERMIT; PENALTIES.",
	"text": "[Repealed, 2003 c 28 art 2 s 35; 2005 c 83 s 1]\nA person, other than a peace officer, as defined in section 626.84, subdivision 1, who carries, holds, or possesses a pistol in a motor vehicle, snowmobile, or boat, or on or about the person's clothes or the person, or otherwise in possession or control in a public place, as defined in section 624.7181, subdivision 1, paragraph (c), without first having obtained a permit to carry the pistol is guilty of a gross misdemeanor. A person who is convicted a second or subsequent time is guilty of a felony.\n(a) The holder of a permit to carry must have the permit card and a driver's license, state identification card, or other government-issued photo identification in immediate possession at all times when carrying a pistol and must display the permit card and identification document upon lawful demand by a peace officer, as defined in section 626.84, subdivision 1. A violation of this paragraph is a petty misdemeanor. The fine for a first offense must not exceed $25. Notwithstanding section 609.531, a firearm carried in violation of this paragraph is not subject to forfeiture.\n(b) A citation issued for violating paragraph (a) must be dismissed if the person demonstrates, in court or in the office of the arresting officer, that the person was authorized to carry the pistol at the time of the alleged violation.\n(c) Upon the request of a peace officer, a permit holder must write a sample signature in the officer's presence to aid in verifying the person's identity.\n(d) Upon the request of a peace officer, a permit holder shall disclose to the officer whether or not the permit holder is currently carrying a firearm.\n(a) Applications by Minnesota residents for permits to carry shall be made to the county sheriff where the applicant resides. Nonresidents, as defined in section 171.01, subdivision 42, may apply to any sheriff.\n(b) Unless a sheriff denies a permit under the exception set forth in subdivision 6, paragraph (a), clause (3), a sheriff must issue a permit to an applicant if the person:\n(1) has training in the safe use of a pistol;\n(2) is at least 21 years old and a citizen or a permanent resident of the United States;\n(3) completes an application for a permit;\n(4) is not prohibited from possessing a firearm under the following sections:\n(i) 518B.01, subdivision 14;\n(ii) 609.224, subdivision 3;\n(iii) 609.2242, subdivision 3;\n(iv) 609.749, subdivision 8;\n(v) 624.713;\n(vi) 624.719;\n(vii) 629.715, subdivision 2;\n(viii) 629.72, subdivision 2; or\n(ix) any federal law; and\n(5) is not listed in the criminal gang investigative data system under section 299C.091.\n(c) A permit to carry a pistol issued or recognized under this section is a state permit and is effective throughout the state.\n(d) A sheriff may contract with a police chief to process permit applications under this section. If a sheriff contracts with a police chief, the sheriff remains the issuing authority and the police chief acts as the sheriff's agent. If a sheriff contracts with a police chief, all of the provisions of this section will apply.\n(a) An applicant must present evidence that the applicant received training in the safe use of a pistol within one year of the date of an original or renewal application. Training may be demonstrated by:\n(1) employment as a peace officer in the state of Minnesota within the past year; or\n(2) completion of a firearms safety or training course providing basic training in the safe use of a pistol and conducted by a certified instructor.\n(b) Basic training must include:\n(1) instruction in the fundamentals of pistol use;\n(2) successful completion of an actual shooting qualification exercise; and\n(3) instruction in the fundamental legal aspects of pistol possession, carry, and use, including self-defense and the restrictions on the use of deadly force.\n(c) The certified instructor must issue a certificate to a person who has completed a firearms safety or training course described in paragraph (b). The certificate must be signed by the instructor and attest that the person attended and completed the course.\n(d) A person qualifies as a certified instructor if the person is certified as a firearms instructor within the past five years by an organization or government entity that has been approved by the Department of Public Safety in accordance with the department's standards.\n(e) A sheriff must accept the training described in this subdivision as meeting the requirement in subdivision 2, paragraph (b), for training in the safe use of a pistol. A sheriff may also accept other satisfactory evidence of training in the safe use of a pistol.\n(a) Applications for permits to carry must be an official, standardized application form, adopted under section 624.7151, and must set forth in writing only the following information:\n(1) the applicant's name, residence, telephone number, if any, and driver's license number or state identification card number;\n(2) the applicant's sex, date of birth, height, weight, and color of eyes and hair, and distinguishing physical characteristics, if any;\n(3) the township or statutory city or home rule charter city, and county, of all Minnesota residences of the applicant in the last five years, though not including specific addresses;\n(4) the township or city, county, and state of all non-Minnesota residences of the applicant in the last five years, though not including specific addresses;\n(5) a statement that the applicant authorizes the release to the sheriff of commitment information about the applicant maintained by the commissioner of human services or any similar agency or department of another state where the applicant has resided, to the extent that the information relates to the applicant's eligibility to possess a firearm; and\n(6) a statement by the applicant that, to the best of the applicant's knowledge and belief, the applicant is not prohibited by law from possessing a firearm.\n(b) The statement under paragraph (a), clause (5), must comply with any applicable requirements of Code of Federal Regulations, title 42, sections 2.31 to 2.35, with respect to consent to disclosure of alcohol or drug abuse patient records.\n(c) An applicant must submit to the sheriff an application packet consisting only of the following items:\n(1) a completed application form, signed and dated by the applicant;\n(2) an accurate photocopy of the certificate described in subdivision 2a, paragraph (c), that is submitted as the applicant's evidence of training in the safe use of a pistol; and\n(3) an accurate photocopy of the applicant's current driver's license, state identification card, or the photo page of the applicant's passport.\n(d) In addition to the other application materials, a person who is otherwise ineligible for a permit due to a criminal conviction but who has obtained a pardon or expungement setting aside the conviction, sealing the conviction, or otherwise restoring applicable rights, must submit a copy of the relevant order.\n(e) Applications must be submitted in person.\n(f) The sheriff may charge a new application processing fee in an amount not to exceed the actual and reasonable direct cost of processing the application or $100, whichever is less. Of this amount, $10 must be submitted to the commissioner and deposited into the general fund.\n(g) This subdivision prescribes the complete and exclusive set of items an applicant is required to submit in order to apply for a new or renewal permit to carry. The applicant must not be asked or required to submit, voluntarily or involuntarily, any information, fees, or documentation beyond that specifically required by this subdivision. This paragraph does not apply to alternate training evidence accepted by the sheriff under subdivision 2a, paragraph (d).\n(h) Forms for new and renewal applications must be available at all sheriffs' offices and the commissioner must make the forms available on the Internet.\n(i) Application forms must clearly display a notice that a permit, if granted, is void and must be immediately returned to the sheriff if the permit holder is or becomes prohibited by law from possessing a firearm. The notice must list the applicable state criminal offenses and civil categories that prohibit a person from possessing a firearm.\n(j) Upon receipt of an application packet and any required fee, the sheriff must provide a signed receipt indicating the date of submission.\n(a) The sheriff must check, by means of electronic data transfer, criminal records, histories, and warrant information on each applicant through the Minnesota Crime Information System and the National Instant Criminal Background Check System. The sheriff shall also make a reasonable effort to check other available and relevant federal, state, or local record-keeping systems. The sheriff must obtain commitment information from the commissioner of human services as provided in section 246C.15 or, if the information is reasonably available, as provided by a similar statute from another state.\n(b) When an application for a permit is filed under this section, the sheriff must notify the chief of police, if any, of the municipality where the applicant resides. The police chief may provide the sheriff with any information relevant to the issuance of the permit.\n(c) The sheriff must conduct a background check by means of electronic data transfer on a permit holder through the Minnesota Crime Information System and the National Instant Criminal Background Check System at least yearly to ensure continuing eligibility. The sheriff may also conduct additional background checks by means of electronic data transfer on a permit holder at any time during the period that a permit is in effect.\n[Repealed, 2003 c 28 art 2 s 35; 2005 c 83 s 1]\n(a) The sheriff must, within 30 days after the date of receipt of the application packet described in subdivision 3:\n(1) issue the permit to carry;\n(2) deny the application for a permit to carry solely on the grounds that the applicant failed to qualify under the criteria described in subdivision 2, paragraph (b); or\n(3) deny the application on the grounds that there exists a substantial likelihood that the applicant is a danger to self or the public if authorized to carry a pistol under a permit.\n(b) Failure of the sheriff to notify the applicant of the denial of the application within 30 days after the date of receipt of the application packet constitutes issuance of the permit to carry and the sheriff must promptly fulfill the requirements under paragraph (c). To deny the application, the sheriff must provide the applicant with written notification and the specific factual basis justifying the denial under paragraph (a), clause (2) or (3), including the source of the factual basis. The sheriff must inform the applicant of the applicant's right to submit, within 20 business days, any additional documentation relating to the propriety of the denial. Upon receiving any additional documentation, the sheriff must reconsider the denial and inform the applicant within 15 business days of the result of the reconsideration. Any denial after reconsideration must be in the same form and substance as the original denial and must specifically address any continued deficiencies in light of the additional documentation submitted by the applicant. The applicant must be informed of the right to seek de novo review of the denial as provided in subdivision 12.\n(c) Upon issuing a permit to carry, the sheriff must provide a laminated permit card to the applicant by first class mail unless personal delivery has been made. Within five business days, the sheriff must submit the information specified in subdivision 7, paragraph (a), to the commissioner for inclusion solely in the database required under subdivision 15, paragraph (a). The sheriff must transmit the information in a manner and format prescribed by the commissioner.\n(d) Within five business days of learning that a permit to carry has been suspended or revoked, the sheriff must submit information to the commissioner regarding the suspension or revocation for inclusion solely in the databases required or permitted under subdivision 15.\n(e) Notwithstanding paragraphs (a) and (b), the sheriff may suspend the application process if a charge is pending against the applicant that, if resulting in conviction, will prohibit the applicant from possessing a firearm.\n(f) A sheriff shall not deny an application for a permit to carry solely because the applicant is a patient enrolled in the registry program and uses medical cannabis flower or medical cannabinoid products for a qualifying medical condition or because the person is 21 years of age or older and uses adult-use cannabis flower, adult-use cannabis products, lower-potency hemp edibles, or hemp-derived consumer products.\n(a) Permits to carry must be on an official, standardized permit card adopted by the commissioner, containing only the name, residence, and driver's license number or state identification card number of the permit holder, if any.\n(b) The permit card must also identify the issuing sheriff and state the expiration date of the permit. The permit card must clearly display a notice that a permit, if granted, is void and must be immediately returned to the sheriff if the permit holder becomes prohibited by law from possessing a firearm.\n(c) A permit to carry a pistol issued under this section expires five years after the date of issue. It may be renewed in the same manner and under the same criteria which the original permit was obtained, subject to the following procedures:\n(1) no earlier than 90 days prior to the expiration date on the permit, the permit holder may renew the permit by submitting to the appropriate sheriff the application packet described in subdivision 3 and a renewal processing fee not to exceed the actual and reasonable direct cost of processing the application or $75, whichever is less. Of this amount, $5 must be submitted to the commissioner and deposited into the general fund. The sheriff must process the renewal application in accordance with subdivisions 4 and 6; and\n(2) a permit holder who submits a renewal application packet after the expiration date of the permit, but within 30 days after expiration, may renew the permit as provided in clause (1) by paying an additional late fee of $10.\n(d) The renewal permit is effective beginning on the expiration date of the prior permit to carry.\n(a) Within 30 days after changing permanent address, or within 30 days of having lost or destroyed the permit card, the permit holder must notify the issuing sheriff of the change, loss, or destruction. Failure to provide notification as required by this subdivision is a petty misdemeanor. The fine for a first offense must not exceed $25. Notwithstanding section 609.531, a firearm carried in violation of this paragraph is not subject to forfeiture.\n(b) After notice is given under paragraph (a), a permit holder may obtain a replacement permit card by paying $10 to the sheriff. The request for a replacement permit card must be made on an official, standardized application adopted for this purpose under section 624.7151, and, except in the case of an address change, must include a notarized statement that the permit card has been lost or destroyed.\n(a) The permit to carry is void at the time that the holder becomes prohibited by law from possessing a firearm, in which event the holder must return the permit card to the issuing sheriff within five business days after the holder knows or should know that the holder is a prohibited person. If the sheriff has knowledge that a permit is void under this paragraph, the sheriff must give notice to the permit holder in writing in the same manner as a denial. Failure of the holder to return the permit within the five days is a gross misdemeanor unless the court finds that the circumstances or the physical or mental condition of the permit holder prevented the holder from complying with the return requirement.\n(b) When a permit holder is convicted of an offense that prohibits the permit holder from possessing a firearm, the court must take possession of the permit, if it is available, and send it to the issuing sheriff.\n(c) The sheriff of the county where the application was submitted, or of the county of the permit holder's current residence, may file a petition with the district court therein, for an order revoking a permit to carry on the grounds set forth in subdivision 6, paragraph (a), clause (3). An order shall be issued only if the sheriff meets the burden of proof and criteria set forth in subdivision 12. If the court denies the petition, the court must award the permit holder reasonable costs and expenses, including attorney fees.\n(d) A permit revocation must be promptly reported to the issuing sheriff.\nWhenever a person is charged with an offense that would, upon conviction, prohibit the person from possessing a firearm, the prosecuting attorney must ascertain whether the person is a permit holder under this section. If the person is a permit holder, the prosecutor must notify the issuing sheriff that the person has been charged with a prohibiting offense. The prosecutor must also notify the sheriff of the final disposition of the case.\nA permit to carry is not required of a person:\n(1) to keep or carry about the person's place of business, dwelling house, premises or on land possessed by the person a pistol;\n(2) to carry a pistol from a place of purchase to the person's dwelling house or place of business, or from the person's dwelling house or place of business to or from a place where repairing is done, to have the pistol repaired;\n(3) to carry a pistol between the person's dwelling house and place of business;\n(4) to carry a pistol in the woods or fields or upon the waters of this state for the purpose of hunting or of target shooting in a safe area; or\n(5) to transport a pistol in a motor vehicle, snowmobile or boat if the pistol is unloaded, contained in a closed and fastened case, gunbox, or securely tied package.\nA person who gives or causes to be given any false material information in applying for a permit to carry, knowing or having reason to know the information is false, is guilty of a gross misdemeanor.\nA person shall not be restricted as to the number of pistols the person may carry.\nA sheriff may immediately issue an emergency permit to a person if the sheriff determines that the person is in an emergency situation that may constitute an immediate risk to the safety of the person or someone residing in the person's household. A person seeking an emergency permit must complete an application form and must sign an affidavit describing the emergency situation. An emergency permit applicant does not need to provide evidence of training. An emergency permit is valid for 30 days, may not be renewed, and may be revoked without a hearing. No fee may be charged for an emergency permit. An emergency permit holder may seek a regular permit under subdivision 3 and is subject to the other applicable provisions of this section.\n(a) Any person aggrieved by denial or revocation of a permit to carry may appeal by petition to the district court having jurisdiction over the county or municipality where the application was submitted. The petition must list the sheriff as the respondent. The district court must hold a hearing at the earliest practicable date and in any event no later than 60 days following the filing of the petition for review. The court may not grant or deny any relief before the completion of the hearing. The record of the hearing must be sealed. The matter must be heard de novo without a jury.\n(b) The court must issue written findings of fact and conclusions of law regarding the issues submitted by the parties. The court must issue its writ of mandamus directing that the permit be issued and order other appropriate relief unless the sheriff establishes by clear and convincing evidence:\n(1) that the applicant is disqualified under the criteria described in subdivision 2, paragraph (b); or\n(2) that there exists a substantial likelihood that the applicant is a danger to self or the public if authorized to carry a pistol under a permit. Incidents of alleged criminal misconduct that are not investigated and documented may not be considered.\n(c) If an applicant is denied a permit on the grounds that the applicant is listed in the criminal gang investigative data system under section 299C.091, the person may challenge the denial, after disclosure under court supervision of the reason for that listing, based on grounds that the person:\n(1) was erroneously identified as a person in the data system;\n(2) was improperly included in the data system according to the criteria outlined in section 299C.091, subdivision 2, paragraph (b); or\n(3) has demonstrably withdrawn from the activities and associations that led to inclusion in the data system.\n(d) If the court grants a petition brought under paragraph (a), the court must award the applicant or permit holder reasonable costs and expenses including attorney fees.\nThe district court may order suspension of the application process for a permit or suspend the permit of a permit holder as a condition of release pursuant to the same criteria as the surrender of firearms under section 629.715. A permit suspension must be promptly reported to the issuing sheriff. If the permit holder has an out-of-state permit recognized under subdivision 16, the court must promptly report the suspension to the commissioner for inclusion solely in the database under subdivision 15, paragraph (a).\nA permit to carry a pistol is not required of any officer of a state adult correctional facility when on guard duty or otherwise engaged in an assigned duty.\n(a) A sheriff must not maintain records or data collected, made, or held under this section concerning any applicant or permit holder that are not necessary under this section to support a permit that is outstanding or eligible for renewal under subdivision 7, paragraph (b). Notwithstanding section 138.163, sheriffs must completely purge all files and databases by March 1 of each year to delete all information collected under this section concerning all persons who are no longer current permit holders or currently eligible to renew their permit.\n(b) Paragraph (a) does not apply to records or data concerning an applicant or permit holder who has had a permit denied or revoked under the criteria established in subdivision 2, paragraph (b), clause (1), or subdivision 6, paragraph (a), clause (3), for a period of six years from the date of the denial or revocation.\n(a) The commissioner must maintain an automated database of persons authorized to carry pistols under this section that is available 24 hours a day, seven days a week, only to law enforcement agencies, including prosecutors carrying out their duties under subdivision 8a, to verify the validity of a permit.\n(b) The commissioner may maintain a separate automated database of denied applications for permits to carry and of revoked permits that is available only to sheriffs performing their duties under this section containing the date of, the statutory basis for, and the initiating agency for any permit application denied or permit revoked for a period of six years from the date of the denial or revocation.\n(c) The commissioner may contract with one or more vendors to implement the commissioner's duties under this section.\n(a) The commissioner must annually establish and publish a list of other states that have laws governing the issuance of permits to carry weapons that are not similar to this section. The list must be available on the Internet. A person holding a carry permit from a state not on the list may use the license or permit in this state subject to the rights, privileges, and requirements of this section.\n(b) Notwithstanding paragraph (a), no license or permit from another state is valid in this state if the holder is or becomes prohibited by law from possessing a firearm.\n(c) Any sheriff or police chief may file a petition under subdivision 12 seeking an order suspending or revoking an out-of-state permit holder's authority to carry a pistol in this state on the grounds set forth in subdivision 6, paragraph (a), clause (3). An order shall only be issued if the petitioner meets the burden of proof and criteria set forth in subdivision 12. If the court denies the petition, the court must award the permit holder reasonable costs and expenses including attorney fees. The petition may be filed in any county in the state where a person holding a license or permit from another state can be found.\n(d) The commissioner must, when necessary, execute reciprocity agreements regarding carry permits with jurisdictions whose carry permits are recognized under paragraph (a).\n(a) A person carrying a firearm on or about his or her person or clothes under a permit or otherwise who remains at a private establishment knowing that the operator of the establishment or its agent has made a reasonable request that firearms not be brought into the establishment may be ordered to leave the premises. A person who fails to leave when so requested is guilty of a petty misdemeanor. The fine for a first offense must not exceed $25. Notwithstanding section 609.531, a firearm carried in violation of this subdivision is not subject to forfeiture.\n(b) As used in this subdivision, the terms in this paragraph have the meanings given.\n(1) \"Reasonable request\" means a request made under the following circumstances:\n(i) the requester has prominently posted a conspicuous sign at every entrance to the establishment containing the following language: \"(INDICATE IDENTITY OF OPERATOR) BANS GUNS IN THESE PREMISES.\"; or\n(ii) the requester or the requester's agent personally informs the person that guns are prohibited in the premises and demands compliance.\n(2) \"Prominently\" means readily visible and within four feet laterally of the entrance with the bottom of the sign at a height of four to six feet above the floor.\n(3) \"Conspicuous\" means lettering in black arial typeface at least 1-1/2 inches in height against a bright contrasting background that is at least 187 square inches in area.\n(4) \"Private establishment\" means a building, structure, or portion thereof that is owned, leased, controlled, or operated by a nongovernmental entity for a nongovernmental purpose.\n(c) The owner or operator of a private establishment may not prohibit the lawful carry or possession of firearms in a parking facility or parking area.\n(d) The owner or operator of a private establishment may not prohibit the lawful carry or possession of firearms by a peace officer, as defined in section 626.84, subdivision 1, paragraph (c), within the private establishment or deny the officer access thereto, except when specifically authorized by statute. The owner or operator of the private establishment may require the display of official credentials issued by the agency that employs the peace officer prior to granting the officer entry into the private establishment.\n(e) This subdivision does not apply to private residences. The lawful possessor of a private residence may prohibit firearms, and provide notice thereof, in any lawful manner.\n(f) A landlord may not restrict the lawful carry or possession of firearms by tenants or their guests.\n(g) Notwithstanding any inconsistent provisions in section 609.605, this subdivision sets forth the exclusive criteria to notify a permit holder when otherwise lawful firearm possession is not allowed in a private establishment and sets forth the exclusive penalty for such activity.\n(h) This subdivision does not apply to a security guard acting in the course and scope of employment. The owner or operator of a private establishment may require the display of official credentials issued by the company, which must be licensed by the Private Detective and Protective Agent Services Board, that employs the security guard and the guard's permit card prior to granting the guard entrance into the private establishment.\n(a) An employer, whether public or private, may establish policies that restrict the carry or possession of firearms by its employees while acting in the course and scope of employment. Employment related civil sanctions may be invoked for a violation.\n(b) A public postsecondary institution regulated under chapter 136F or 137 may establish policies that restrict the carry or possession of firearms by its students while on the institution's property. Academic sanctions may be invoked for a violation.\n(c) Notwithstanding paragraphs (a) and (b), an employer or a postsecondary institution may not prohibit the lawful carry or possession of firearms in a parking facility or parking area.\nNeither a sheriff, police chief, any employee of a sheriff or police chief involved in the permit issuing process, nor any certified instructor is liable for damages resulting or arising from acts with a firearm committed by a permit holder, unless the person had actual knowledge at the time the permit was issued or the instruction was given that the applicant was prohibited by law from possessing a firearm.\n(a) By March 1, 2004, and each year thereafter, the commissioner must report to the legislature on:\n(1) the number of permits applied for, issued, suspended, revoked, and denied, further categorized by the age, sex, and zip code of the applicant or permit holder, since the previous submission, and in total;\n(2) the number of permits currently valid;\n(3) the specific reasons for each suspension, revocation, and denial and the number of reversed, canceled, or corrected actions;\n(4) without expressly identifying an applicant, the number of denials or revocations based on the grounds under subdivision 6, paragraph (a), clause (3), the factual basis for each denial or revocation, and the result of an appeal, if any, including the court's findings of fact, conclusions of law, and order;\n(5) the number of convictions and types of crimes committed since the previous submission, and in total, by individuals with permits including data as to whether a firearm lawfully carried solely by virtue of a permit was actually used in furtherance of the crime;\n(6) to the extent known or determinable, data on the lawful and justifiable use of firearms by permit holders; and\n(7) the status of the segregated funds reported to the commissioner under subdivision 21.\n(b) Sheriffs and police chiefs must supply the Department of Public Safety with the basic data the department requires to complete the report under paragraph (a). Sheriffs and police chiefs may submit data classified as private to the Department of Public Safety under this paragraph.\n(c) Copies of the report under paragraph (a) must be made available to the public at the actual cost of duplication.\n(d) Nothing contained in any provision of this section or any other law requires or authorizes the registration, documentation, collection, or providing of serial numbers or other data on firearms or on firearms' owners.\nFees collected by sheriffs under this section and not forwarded to the commissioner must be used only to pay the direct costs of administering this section. Fee money may be used to pay the costs of appeals of prevailing applicants or permit holders under subdivision 8, paragraph (c); subdivision 12, paragraph (e); and subdivision 16, paragraph (c). Fee money may also be used to pay the reasonable costs of the county attorney to represent the sheriff in proceedings under this section. The revenues must be maintained in a segregated fund. Fund balances must be carried over from year to year and do not revert to any other fund. As part of the information supplied under subdivision 20, paragraph (b), by January 31 of each year, a sheriff must report to the commissioner on the sheriff's segregated fund for the preceding calendar year, including information regarding:\n(1) nature and amount of revenues;\n(2) nature and amount of expenditures; and\n(3) nature and amount of balances.\nThis section may be cited as the Minnesota Citizens' Personal Protection Act of 2003. The legislature of the state of Minnesota recognizes and declares that the second amendment of the United States Constitution guarantees the fundamental, individual right to keep and bear arms. The provisions of this section are declared to be necessary to accomplish compelling state interests in regulation of those rights. The terms of this section must be construed according to the compelling state interest test. The invalidation of any provision of this section shall not invalidate any other provision.\nThis section sets forth the complete and exclusive criteria and procedures for the issuance of permits to carry and establishes their nature and scope. No sheriff, police chief, governmental unit, government official, government employee, or other person or body acting under color of law or governmental authority may change, modify, or supplement these criteria or procedures, or limit the exercise of a permit to carry.\nExcept when acting under the authority of other law, it is a misdemeanor for a person required to register by section 243.166 to carry a pistol whether or not the carrier possesses a permit to carry issued under this section. If an action prohibited by this subdivision is also a violation of another law, the violation may be prosecuted under either law.",
	"repealed": false
}