{
	"id": "83.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.27",
	"title": "83.27 INQUIRY AND EXAMINATION.",
	"text": "The commissioner may investigate any subdivision required to be registered under sections 83.20 to 83.42, 83.43 and 83.44 for the purpose of verifying statements contained in the application for registration or the public offering statement. For the purpose of such investigation, the commissioner may:\n(a) use and rely upon any relevant information or data concerning a subdivision obtained by the commissioner from the Federal Housing Administration, the United States Veterans Administration, or any state or federal agency having supervisory duties over real estate subdivisions which are comparable to those of the commissioner;\n(b) require the subdivider to submit reports prepared by an independent licensed or registered engineer concerning any hazard to which, in the opinion of the commissioner, any subdivision offered for disposition is subject, or concerning any other factor which affects the utility of lots, units, parcels, or interests within the subdivision and may require evidence of compliance to remove or minimize all hazards stated by competent engineering reports;\n(c) conduct an on-site inspection of each subdivision. The subdivider shall defray all actual and necessary expenses incurred by the inspector in the course of the inspection;\n(d) conduct an annual on-site reinspection of each subdivision for each of the three years after registration and thereafter make periodic on-site inspections. The developer shall defray all actual and necessary expenses incurred by the inspector in the course of such inspection;\n(e) require the subdivider to deposit the expenses to be incurred in any inspection or reinspection, in advance, based upon an estimate by the commissioner of the expenses likely to be incurred. All such deposits shall be paid into the state treasury and credited to the commissioner's investigation fund, from which fund the commissioner shall have power to make disbursements to pay such expenses. Any unexpended portion shall be refunded. On field examinations made by the commissioner or the commissioner's employee away from the office of the commissioner a per diem of $10 for each such person may be charged in addition to the actual expenses. Where additional technical, expert, or special services are used, the actual cost of such services may be charged in addition to actual expenses;\n(f) where an on-site inspection of any subdivision has been made under sections 83.20 to 83.42, 83.43 and 83.44, an inspection of additional subdivided lands for which a subsequent application for registration is filed may be made.",
	"repealed": false
}