{
	"id": "79A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.10",
	"title": "79A.10 ASSUMPTION OF WORKERS' COMPENSATION OBLIGATIONS OF INSOLVENT SELF-INSURER.",
	"text": "Upon order of the commissioner pursuant to section 79A.04, subdivision 10, the security fund shall assume the workers' compensation obligations of an insolvent private self-insurer.\nNotwithstanding subdivision 1, the security fund shall not be liable for the payment of any penalties assessed for any act or omission on the part of any person other than the security fund or its appointed administrator, including, but not limited to, the penalties provided in chapter 176 unless the security fund or its appointed administrator would be subject to penalties under chapter 176 as the result of the actions of the security fund or its administrator.\nThe security fund shall be a party in interest in all proceedings involving compensation claims against an insolvent self-insurer whose compensation obligations have been paid or assumed by the security fund. The security fund shall have the same rights and defenses as the insolvent private self-insurer, including, but not limited to, all of the following:\n(1) to appear, defend, and appeal claims;\n(2) to receive notice of, investigate, adjust, compromise, settle, and pay claims; and\n(3) to investigate, handle, and deny claims.\nNotwithstanding anything in this chapter or chapter 176 to the contrary, in the event that the self-insurers' security fund assumes the obligations of any bankrupt or insolvent private self-insurer pursuant to this section, then the proceeds of any surety bond, Workers' Compensation Reinsurance Association, specific excess insurance or aggregate excess insurance policy, and any special compensation fund payment or second injury fund or supplementary benefit reimbursements shall be paid to the self-insurers' security fund instead of the bankrupt or insolvent private self-insurer or its successor in interest. No special compensation fund reimbursements shall be made to the security fund unless the special compensation fund assessments pursuant to section 176.129 are paid and the reports required thereunder are made to the special compensation fund.",
	"repealed": false
}