{
	"id": "211B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.33",
	"title": "211B.33 PRIMA FACIE REVIEW.",
	"text": "The chief administrative law judge must randomly assign an administrative law judge to review the complaint. Within one business day after the complaint was filed with the office, when practicable, but never longer than three business days, the administrative law judge must make a preliminary determination for its disposition.\n(a) If the administrative law judge determines that the complaint does not set forth a prima facie violation of chapter 211A or 211B, the administrative law judge must dismiss the complaint.\n(b) If the administrative law judge determines that the complaint sets forth a prima facie violation of a provision of chapter 211A or 211B and that the complaint was filed within 60 days before the primary or special election or within 90 days before the general election to which the complaint relates, the administrative law judge, on request of any party, must conduct an expedited probable cause hearing under section 211B.34.\n(c) If the administrative law judge determines that the complaint sets forth a prima facie violation of chapter 211A or 211B, and was not filed within 60 days before the primary or special election or 90 days before the general election to which the complaint relates, the administrative law judge must schedule an evidentiary hearing under section 211B.35.\nThe office must notify all parties of the determination made under subdivision 2. If the complaint is scheduled for hearing, the notice must identify the time and place of the hearing and inform all parties that they may submit evidence, affidavits, documentation, and argument for consideration by the administrative law judge.\nThe chief administrative law judge may direct that two or more complaints be joined for disposition if the chief administrative law judge determines that the allegations in each complaint are of the same or similar character, are based on the same act or failure to act, or are based on two or more acts or failures to act constituting parts of a common scheme or plan. If one complaint contains two or more allegations, the chief administrative law judge may separate the allegations, if they are not of the same or similar character, if they are not based on the same act or failure to act, or if they are not based on two or more acts or failures to act constituting parts of a common scheme or plan. If the chief administrative law judge separates the allegations in a complaint, the assigned administrative law judge or judges may make separate recommendations under subdivision 2 for each allegation.",
	"repealed": false
}