{
	"id": "125A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.51",
	"title": "125A.51 PLACEMENT OF CHILDREN WITHOUT DISABILITIES; EDUCATION AND TRANSPORTATION.",
	"text": "The responsibility for providing instruction and transportation for a pupil without a disability who has a short-term or temporary physical or emotional illness or disability, as determined by the standards of the commissioner, and who is temporarily placed for care and treatment for that illness or disability, must be determined as provided in this section.\n(a) The school district of residence of the pupil is the district in which the pupil's parent or guardian resides. If there is a dispute between school districts regarding residency, the district of residence is the district designated by the commissioner.\n(b) When parental rights have been terminated by court order, the legal residence of a child placed in a residential or foster facility for care and treatment is the district in which the child resides.\n(c) Before the placement of a pupil for care and treatment, the district of residence must be notified and provided an opportunity to participate in the placement decision. When an immediate emergency placement is necessary and time does not permit resident district participation in the placement decision, the district in which the pupil is temporarily placed, if different from the district of residence, must notify the district of residence of the emergency placement within 15 days of the placement. When a nonresident district makes an emergency placement without first consulting with the resident district, the resident district has up to five business days after receiving notice of the emergency placement to request an opportunity to participate in the placement decision, which the placing district must then provide.\n(d) When a pupil without a disability is temporarily placed for care and treatment in a day program and the pupil continues to live within the district of residence during the care and treatment, the district of residence must provide instruction and necessary transportation to and from the care and treatment program for the pupil. The resident district may establish reasonable restrictions on transportation, except if a Minnesota court or agency orders the child placed at a day care and treatment program and the resident district receives a copy of the order, then the resident district must provide transportation to and from the program unless the court or agency orders otherwise. Transportation shall only be provided by the resident district during regular operating hours of the resident district. The resident district may provide the instruction at a school within the district of residence; at the pupil's residence; through an authorized online learning program provided by the pupil's resident district, district of open enrollment under section 124D.03, or charter school of enrollment under section 124E.11 if the child, or the child's parent or guardian for a pupil under the age of 18, agrees to that form of instruction; or, in the case of a placement outside of the resident district, in the district in which the day treatment program is located by paying tuition to that district. The district of placement may contract with a facility to provide instruction by teachers licensed by the Professional Educator Licensing and Standards Board.\n(e) When a pupil without a disability is temporarily placed in a residential program for care and treatment, the district in which the pupil is placed must provide instruction for the pupil and necessary transportation while the pupil is receiving instruction, and in the case of a placement outside of the district of residence, the nonresident district must bill the district of residence for the actual cost of providing the instruction for the regular school year and for summer school, excluding transportation costs. If a pupil's district of residence, district of open enrollment under section 124D.03, or charter school of enrollment under section 124E.11 is authorized to provide online learning instruction under state statutes, the district in which the pupil is placed may utilize that online learning program in fulfilling its responsibility to provide instruction under this section if the child, or the child's parent or guardian for a pupil under the age of 18, agrees to that form of instruction.\n(f) Notwithstanding paragraph (e), if the pupil is homeless and placed in a public or private homeless shelter, then the district that enrolls the pupil under section 120A.20, subdivision 2, paragraph (b), shall provide the transportation, unless the district that enrolls the pupil and the district in which the pupil is temporarily placed agree that the district in which the pupil is temporarily placed shall provide transportation. When a pupil without a disability is temporarily placed in a residential program outside the district of residence, the administrator of the court placing the pupil must send timely written notice of the placement to the district of residence. The district of placement may contract with a residential facility to provide instruction by teachers licensed by the Professional Educator Licensing and Standards Board. For purposes of this section, the state correctional facilities operated on a fee-for-service basis are considered to be residential programs for care and treatment.\n(g) The district of residence must include the pupil in its residence count of pupil units and pay tuition as provided in section 123A.488 to the district providing the instruction. Transportation costs must be paid by the district providing the transportation and the state must pay transportation aid to that district. For purposes of computing state transportation aid, pupils governed by this subdivision must be included in the disabled transportation category if the pupils cannot be transported on a regular school bus route without special accommodations.",
	"repealed": false
}