{
	"id": "62I.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.02",
	"title": "62I.02 MINNESOTA JOINT UNDERWRITING ASSOCIATION.",
	"text": "The Minnesota Joint Underwriting Association is created to provide insurance coverage to any person or entity unable to obtain insurance through ordinary methods if the insurance is required by statute, ordinance, or otherwise required by law, or is necessary to earn a livelihood or conduct a business and serves a public purpose. Prudent business practice or mere desire to have insurance coverage is not a sufficient standard for the association to offer insurance coverage to a person or entity. For purposes of this subdivision, directors' and officers' liability insurance is considered to be a business necessity and not merely a prudent business practice. The association shall be specifically authorized to provide insurance coverage to day care providers, foster parents, foster homes, developmental achievement centers, group homes, rehabilitation facilities for mentally, emotionally, or physically disabled persons, and for liquor liability. In addition, the association shall provide medical malpractice insurance coverage to a licensed health care provider unable to obtain this insurance through ordinary methods who practices or provides professional services within Minnesota and obtains at least 60 percent of gross revenues from patients who are residents of Minnesota. The association shall not offer environmental pollution liability, product liability insurance, and completed operations insurance. The association shall not offer coverage for activities that are conducted substantially outside the state of Minnesota unless the insurance is required by statute, ordinance, or otherwise required by Minnesota law. Every insurer licensed to write property and casualty insurance and personal injury liability insurance in this state shall be a member of the association as a condition to obtaining and retaining a license to write insurance in this state.\nThe association shall have a board of directors composed of 15 persons chosen as follows: seven persons elected by members of the association, one of whom must be a representative of medical malpractice insurers, and one of whom must be a representative of personal injury liability insurers; four public members, as defined in section 214.02, appointed by the commissioner; and four members, appointed by the commissioner representing groups to whom coverage has been extended by the association, one of whom must be a licensed health care provider. If at any time no coverage is currently extended by the association, then either additional public members may be appointed to fill these four positions or, at the option of the commissioner, representatives from groups who had previously been covered by the association may serve as directors. The terms of the members shall be four years. Terms may be staggered so that no more than six members are appointed or elected every two years. Members may serve until their successors are appointed or elected.\nThe authorization to issue insurance to day care providers, foster parents, foster homes, developmental activity centers, group homes, and rehabilitation facilities for mentally, emotionally, or physically disabled persons is valid for a period of two years from the date it was made. The issuance of insurance for these groups and other classes of business is reauthorized for additional two-year periods unless deactivated under the process pursuant to sections 62I.21 and 62I.22.\nPolicies and contracts of coverage issued under this section for the purposes of providing liquor liability insurance must contain the usual and customary provisions of liability insurance policies, and must contain at least the minimum coverage required by section 340A.409, subdivision 1, or the local governing unit.\nFor the purposes of administration and assessment, the association shall be divided into three separate accounts:\n(1) the property and casualty insurance account;\n(2) the personal injury liability insurance account-liquor; and\n(3) the personal injury liability insurance account-medical malpractice.\n[Repealed by amendment, 2017 c 34 s 1]",
	"repealed": false
}