{
	"id": "256B.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.77",
	"title": "256B.77 COORDINATED SERVICE DELIVERY SYSTEM FOR PERSONS WITH DISABILITIES.",
	"text": "(a) The commissioner of human services, in cooperation with county authorities, shall develop and implement a demonstration project to create a coordinated service delivery system in which the full medical assistance benefit set for persons with a disability eligible for medical assistance is provided and funded on a capitated basis. The demonstration period shall be a minimum of three years.\n(b) Each demonstration site shall, under county authority, establish a local group to assist the commissioner in planning, designing, implementing, and evaluating the coordinated service delivery system in their area. This local group shall include county agencies, providers, consumers, family members, advocates, tribal governments, a local representative of labor, and advocacy organizations, and may include health plan companies. Consumers, families, and consumer representatives must be involved in the planning, implementation, and evaluation processes for the demonstration project.\nFor the purposes of this section, the following terms have the meanings given:\n(a) \"Acute care\" means hospital, physician, and other health and dental services covered in the medical assistance benefit set that are not specified in the intergovernmental contract or service delivery contract as continuing care services.\n(b) \"Additional services\" means services developed and provided through the county administrative entity or service delivery organization, which are in addition to the medical assistance benefit set.\n(c) \"Advocate\" means an individual who:\n(1) has been authorized by the enrollee or the enrollee's legal representative to help the enrollee understand information presented and to speak on the enrollee's behalf, based on directions and decisions by the enrollee or the enrollee's legal representative; and\n(2) represents only the enrollee and the enrollee's legal representative.\n(d) \"Advocacy organization\" means an organization whose primary purpose is to advocate for the needs of persons with disabilities.\n(e) \"Alternative services\" means services developed and provided through the county administrative entity or service delivery organization that are not part of the medical assistance benefit set.\n(f) \"Commissioner\" means the commissioner of human services.\n(g) \"Continuing care\" means any services, including long-term support services, covered in the medical assistance benefit set that are not specified in the intergovernmental contract or service delivery contract as acute care.\n(h) \"County administrative entity\" means the county administrative structure defined and designated by the county authority to implement the demonstration project under the direction of the county authority.\n(i) \"County authority\" means the board of county commissioners or a single entity representing multiple boards of county commissioners.\n(j) \"Demonstration period\" means the period of time during which county administrative entities or service delivery organizations will provide services to enrollees.\n(k) \"Demonstration site\" means the geographic area in which eligible individuals may be included in the demonstration project.\n(l) \"Department\" means the Department of Human Services.\n(m) \"Emergency\" means a condition that if not immediately treated could cause a person serious physical or mental disability, continuation of severe pain, or death. Labor and delivery is an emergency if it meets this definition.\n(n) \"Enrollee\" means an eligible individual who is enrolled in the demonstration project.\n(o) \"Informed choice\" means a voluntary decision made by the enrollee or the enrollee's legal representative, after becoming familiar with the alternatives, and having been provided sufficient relevant written and oral information at an appropriate comprehension level and in a manner consistent with the enrollee's or the enrollee's legal representative's primary mode of communication.\n(p) \"Informed consent\" means the written agreement, or an agreement as documented in the record, by a competent enrollee, or an enrollee's legal representative, who:\n(1) has the capacity to make reasoned decisions based on relevant information;\n(2) is making decisions voluntarily and without coercion; and\n(3) has knowledge to make informed choice.\n(q) \"Intergovernmental contract\" means the agreement between the commissioner and the county authority.\n(r) \"Legal representative\" means an individual who is legally authorized to provide informed consent or make informed choices on a person's behalf. A legal representative may be one of the following individuals:\n(1) the parent of a minor who has not been emancipated;\n(2) a court-appointed guardian or conservator of a person who is 18 years of age or older, in areas where legally authorized to make decisions;\n(3) a guardian ad litem or special guardian or conservator, in areas where legally authorized to make decisions;\n(4) legal counsel if so specified by the person; or\n(5) any other legally authorized individual.\nThe county administrative entity is prohibited from acting as legal representative for any enrollee, as long as the provisions of subdivision 15 are funded.\n(s) \"Life domain areas\" include, but are not limited to: home, family, education, employment, social environment, psychological and emotional health, self-care, independence, physical health, need for legal representation and legal needs, financial needs, safety, and cultural identification and spiritual needs.\n(t) \"Medical assistance benefit set\" means the services covered under this chapter and accompanying rules which are provided according to the definition of medical necessity in Minnesota Rules, part 9505.0175, subpart 25.\n(u) \"Outcome\" means the targeted behavior, action, or status of the enrollee that can be observed and or measured.\n(v) \"Personal support plan\" means a document agreed to and signed by the enrollee and the enrollee's legal representative, if any, which describes:\n(1) the assessed needs and strengths of the enrollee;\n(2) the outcomes chosen by the enrollee or their legal representative;\n(3) the amount, type, setting, start date, duration, and frequency of services and supports authorized by the county administrative entity or service delivery organization to achieve the chosen outcomes;\n(4) a description of needed services and supports that are not the responsibility of the county administrative entity or service delivery organization and plans for addressing those needs;\n(5) plans for referring to and coordinating between all agencies or individuals providing needed services and supports;\n(6) the use of regulated treatment; and\n(7) the transition of a child to the adult service system.\n(w) \"Regulated treatment\" means any behaviorally altering medication of any classification or any aversive or deprivation procedure as defined in rules or statutes applicable to eligible individuals.\n(x) \"Service delivery contract\" means the agreement between the commissioner or the county authority and the service delivery organization in those areas in which the county authority has provided written approval.\n(y) \"Service delivery organization\" means an entity that is licensed as a health maintenance organization under chapter 62D or a community integrated service network under chapter 62N and is under contract with the commissioner or a county authority to participate in the demonstration project. If authorized in contract by the commissioner or the county authority, a service delivery organization participating in the demonstration project shall have the duties, responsibilities, and obligations defined under subdivisions 8, 9, 18, and 19.\n(z) \"Urgent situation\" means circumstances in which care is needed as soon as possible, usually within 24 hours, to protect the health of an enrollee.\nA county authority that elects to participate in a demonstration project for people with disabilities under this section is not required to obtain a certificate of authority under chapter 62D or 62N. A county authority that elects to participate in a demonstration project for people with disabilities under this section must assure the commissioner of health that the requirements of chapters 62D and 62N, and section 256B.692, subdivision 2, are met. All enforcement and rulemaking powers available under chapters 62D, 62J, 62M, 62N, and 62Q are granted to the commissioner of health with respect to the county authorities that contract with the commissioner to purchase services in a demonstration project for people with disabilities under this section.\nThe commissioner, in consultation with county authorities, shall request any authority from the United States Department of Health and Human Services that is necessary to implement the demonstration project under the medical assistance program; and authority to combine Medicaid and Medicare funding for service delivery to eligible individuals who are also eligible for Medicare, only if this authority does not preclude county authority participation under the waiver. Implementation of these programs may begin without authority to include Medicare funding. The commissioner may authorize county authorities to begin enrollment of eligible individuals upon federal approval but no earlier than July 1, 1998.\nThe commissioner shall designate up to two demonstration sites with the approval of the county authority. Demonstration sites may include one county or a multicounty group. At least one of the sites shall implement a model specifically addressing the needs of eligible individuals with physical disabilities. By February 1, 1998, the commissioner and the county authorities shall submit to the chairs of the senate Committee on Health and Family Security and the house of representatives Committee on Health and Human Services a phased enrollment plan to ensure an orderly transition which protects the health and safety of enrollees and ensures continuity of services.\n(a) The commissioner may execute an intergovernmental contract with any county authority that demonstrates the ability to arrange for and coordinate services for enrollees covered under this section according to the terms and conditions specified by the commissioner. With the written consent of the county authority, the commissioner may issue a request for proposals for service delivery organizations to provide portions of the medical assistance benefit set not contracted for by the county authority. County authorities that do not contract for the full medical assistance benefit set must ensure coordination with the entities responsible for the remainder of the covered services.\n(b) No less than 90 days before the intergovernmental contract is executed, the county authority shall submit to the commissioner an initial proposal on how it will address the areas listed in this subdivision and subdivisions 1, 7, 8, 9, 12, 18, and 19. The county authority shall submit to the commissioner annual reports describing its progress in addressing these areas.\n(c) Each county authority shall develop policies to address conflicts of interest, including public guardianship and representative payee issues.\n(d) Each county authority shall annually evaluate the effectiveness of the service coordination provided according to subdivision 12 and shall take remedial or corrective action if the service coordination does not fulfill the requirements of that subdivision.\nThe commissioner, in consultation with the county authority, shall develop a process for enrolling eligible individuals in the demonstration project. A county or counties may limit enrollment in the demonstration project to one or more of the disability populations described in subdivision 7a, paragraph (b). Enrollment into county administrative entities and service delivery organizations shall be conducted according to the terms of the federal waiver. Enrollment of eligible individuals under the demonstration project may be phased in with approval of the commissioner. The commissioner shall ensure that eligibility for medical assistance and enrollment for the person are determined by individuals outside of the county administrative entity.\n(a) Persons are eligible for the demonstration project as provided in this subdivision.\n(b) \"Eligible individuals\" means those persons living in the demonstration site who are eligible for medical assistance and are disabled based on a disability determination under section 256B.055, subdivisions 7 and 12, or who are eligible for medical assistance and have been diagnosed as having:\n(1) serious and persistent mental illness as defined in section 245.462, subdivision 20;\n(2) severe emotional disturbance as defined in section 245.4871, subdivision 6; or\n(3) developmental disability, or being a person with a developmental disability as defined in section 252A.02, or a related condition as defined in section 256B.02, subdivision 11.\nOther individuals may be included at the option of the county authority based on agreement with the commissioner.\n(c) Eligible individuals include individuals in excluded time status, as defined in chapter 256G. Enrollees in excluded time at the time of enrollment shall remain in excluded time status as long as they live in the demonstration site and shall be eligible for 90 days after placement outside the demonstration site if they move to excluded time status in a county within Minnesota other than their county of financial responsibility.\n(d) A person who is a sexual psychopathic personality as defined in section 253D.02, subdivision 15, or a sexually dangerous person as defined in section 253D.02, subdivision 16, is excluded from enrollment in the demonstration project.\n(a) Beginning on or after July 1, 1999, for American Indian recipients of medical assistance who are required to enroll with a county administrative entity or service delivery organization under subdivision 7, medical assistance shall cover health care services provided at American Indian health services facilities and facilities operated by a tribe or tribal organization under funding authorized by United States Code, title 25, sections 450f to 450n, or title III of the Indian Self-Determination and Education Assistance Act, Public Law 93-638, if those services would otherwise be covered under section 256B.0625. Payments for services provided under this subdivision shall be made on a fee-for-service basis, and may, at the option of the tribe or tribal organization, be made according to rates authorized under sections 256.969, subdivision 16, and 256B.0625, subdivision 34. Implementation of this purchasing model is contingent on federal approval.\n(b) The commissioner of human services, in consultation with tribal governments, shall develop a plan for tribes to assist in the enrollment process for American Indian recipients enrolled in the demonstration project for people with disabilities under this section. This plan also shall address how tribes will be included in ensuring the coordination of care for American Indian recipients between Indian health service or tribal providers and other providers.\n(c) For purposes of this subdivision, \"American Indian\" has the meaning given to persons to whom services will be provided for in Code of Federal Regulations, title 42, section 36.12.\n(a) The county administrative entity shall meet the requirements of this subdivision, unless the county authority or the commissioner, with written approval of the county authority, enters into a service delivery contract with a service delivery organization for any or all of the requirements contained in this subdivision.\n(b) The county administrative entity shall enroll eligible individuals regardless of health or disability status.\n(c) The county administrative entity shall provide all enrollees timely access to the medical assistance benefit set. Alternative services and additional services are available to enrollees at the option of the county administrative entity and may be provided if specified in the personal support plan. County authorities are not required to seek prior authorization from the department as required by the laws and rules governing medical assistance.\n(d) The county administrative entity shall cover necessary services as a result of an emergency without prior authorization, even if the services were rendered outside of the provider network.\n(e) The county administrative entity shall authorize necessary and appropriate services when needed and requested by the enrollee or the enrollee's legal representative in response to an urgent situation. Enrollees shall have 24-hour access to urgent care services coordinated by experienced disability providers who have information about enrollees' needs and conditions.\n(f) The county administrative entity shall accept the capitation payment from the commissioner in return for the provision of services for enrollees.\n(g) The county administrative entity shall maintain internal grievance and complaint procedures, including an expedited informal complaint process in which the county administrative entity must respond to verbal complaints within ten calendar days, and a formal grievance process, in which the county administrative entity must respond to written complaints within 30 calendar days.\n(h) The county administrative entity shall provide a certificate of coverage, upon enrollment, to each enrollee and the enrollee's legal representative, if any, which describes the benefits covered by the county administrative entity, any limitations on those benefits, and information about providers and the service delivery network. This information must also be made available to prospective enrollees. This certificate must be approved by the commissioner.\n(i) The county administrative entity shall present evidence of an expedited process to approve exceptions to benefits, provider network restrictions, and other plan limitations under appropriate circumstances.\n(j) The county administrative entity shall provide enrollees or their legal representatives with written notice of their appeal rights under subdivision 16, and of ombudsman and advocacy programs under subdivisions 13 and 14, at the following times: upon enrollment, upon submission of a written complaint, when a service is reduced, denied, or terminated, or when renewal of authorization for ongoing service is refused.\n(k) The county administrative entity shall determine immediate needs, including services, support, and assessments, within 30 calendar days after enrollment, or within a shorter time frame if specified in the intergovernmental contract.\n(l) The county administrative entity shall assess the need for services of new enrollees within 60 calendar days after enrollment, or within a shorter time frame if specified in the intergovernmental contract, and periodically reassess the need for services for all enrollees.\n(m) The county administrative entity shall ensure the development of a personal support plan for each person within 60 calendar days of enrollment, or within a shorter time frame if specified in the intergovernmental contract, unless otherwise agreed to by the enrollee and the enrollee's legal representative, if any. Until a personal support plan is developed and agreed to by the enrollee, enrollees must have access to the same amount, type, setting, duration, and frequency of covered services that they had at the time of enrollment unless other covered services are needed. For an enrollee who is not receiving covered services at the time of enrollment and for enrollees whose personal support plan is being revised, access to the medical assistance benefit set must be assured until a personal support plan is developed or revised. If an enrollee chooses not to develop a personal support plan, the enrollee will be subject to the network and prior authorization requirements of the county administrative entity or service delivery organization 60 days after enrollment. An enrollee can choose to have a personal support plan developed at any time. The personal support plan must be based on choices, preferences, and assessed needs and strengths of the enrollee. The service coordinator shall develop the personal support plan, in consultation with the enrollee or the enrollee's legal representative and other individuals requested by the enrollee. The personal support plan must be updated as needed or as requested by the enrollee. Enrollees may choose not to have a personal support plan.\n(n) The county administrative entity shall ensure timely authorization, arrangement, and continuity of needed and covered supports and services.\n(o) The county administrative entity shall offer service coordination that fulfills the responsibilities under subdivision 12 and is appropriate to the enrollee's needs, choices, and preferences, including a choice of service coordinator.\n(p) The county administrative entity shall contract with schools and other agencies as appropriate to provide otherwise covered medically necessary medical assistance services as described in an enrollee's individual family support plan, as described in sections 125A.26 to 125A.48, or individualized education program, as described in chapter 125A.\n(q) The county administrative entity shall develop and implement strategies, based on consultation with affected groups, to respect diversity and ensure culturally competent service delivery in a manner that promotes the physical, social, psychological, and spiritual well-being of enrollees and preserves the dignity of individuals, families, and their communities.\n(r) When an enrollee changes county authorities, county administrative entities shall ensure coordination with the entity that is assuming responsibility for administering the medical assistance benefit set to ensure continuity of supports and services for the enrollee.\n(s) The county administrative entity shall comply with additional requirements as specified in the intergovernmental contract.\n(t) To the extent that alternatives are approved under subdivision 17, county administrative entities must provide for the health and safety of enrollees and protect the rights to privacy and to provide informed consent.\n(u) Prepaid health plans serving counties with a nonprofit community clinic or community health services agency must contract with the clinic or agency to provide services to clients who choose to receive services from the clinic or agency, if the clinic or agency agrees to payment rates that are competitive with rates paid to other health plan providers for the same or similar services.\nFor purposes of this paragraph, \"nonprofit community clinic\" includes, but is not limited to, a community mental health center as defined in sections 245.62 and 256B.0625, subdivision 5.\n(a) The commissioner may require all eligible individuals to obtain services covered under this chapter through county authorities. Enrollees shall be given choices among a range of available providers with expertise in serving persons of their age and with their category of disability. If the county authority is also a provider of services covered under the demonstration project, other than service coordination, the enrollee shall be given the choice of at least one other provider of that service. The commissioner shall ensure that all enrollees have continued access to medically necessary covered services.\n(b) The commissioner must ensure that a set of enrollee safeguards in the categories of access, choice, comprehensive benefits, access to specialist care, disclosure of financial incentives to providers, prohibition of exclusive provider contracting and gag clauses, legal representation, guardianship, representative payee, quality, rights and appeals, privacy, data collection, and confidentiality are in place prior to enrollment of eligible individuals.\n(c) If multiple service delivery organizations are offered for acute or continuing care within a demonstration site, enrollees shall be given a choice of these organizations. A choice is required if the county authority operates its own health maintenance organization, community integrated service network, or similar plan. Enrollees shall be given opportunities to change enrollment in these organizations within 12 months following initial enrollment into the demonstration project and shall also be offered an annual open enrollment period, during which they are permitted to change their service delivery organization.\n(d) Enrollees shall have the option to change their primary care provider once per month.\n(e) The commissioner may waive the choice of provider requirements in paragraph (a) or the choice of service delivery organization requirements in paragraph (c) if the county authority can demonstrate that, despite reasonable efforts, no other provider of the service or service delivery organization can be made available within the cost and quality requirements of the demonstration project.\n(a) The commissioner shall pay a capitation payment to the county authority and, when applicable under subdivision 6, paragraph (a), to the service delivery organization for each medical assistance eligible enrollee. The commissioner shall develop capitation payment rates for the initial contract period for each demonstration site in consultation with an independent actuary, to ensure that the cost of services under the demonstration project does not exceed the estimated cost for medical assistance services for the covered population under the fee-for-service system for the demonstration period. For each year of the demonstration project, the capitation payment rate shall be based on 96 percent of the projected per person costs that would otherwise have been paid under medical assistance fee-for-service during each of those years. Rates shall be adjusted within the limits of the available risk adjustment technology, as mandated by section 62Q.03. In addition, the commissioner shall implement appropriate risk and savings sharing provisions with county administrative entities and, when applicable under subdivision 6, paragraph (a), service delivery organizations within the projected budget limits. Capitation rates shall be adjusted, at least annually, to include any rate increases and payments for expanded or newly covered services for eligible individuals. The initial demonstration project rate shall include an amount in addition to the fee-for-service payments to adjust for underutilization of dental services. Any savings beyond those allowed for the county authority, county administrative entity, or service delivery organization shall be first used to meet the unmet needs of eligible individuals.\n(b) The commissioner shall monitor and evaluate annually the effect of the discount on consumers, the county authority, and providers of disability services. Findings shall be reported and recommendations made, as appropriate, to ensure that the discount effect does not adversely affect the ability of the county administrative entity or providers of services to provide appropriate services to eligible individuals, and does not result in cost shifting of eligible individuals to the county authority.\n(c) For risk-sharing to occur under this subdivision, the aggregate fee-for-service cost of covered services provided by the county administrative entity under this section must exceed the aggregate sum of capitation payments made to the county administrative entity under this section. The county authority is required to maintain its current level of nonmedical assistance spending on enrollees. If the county authority spends less in nonmedical assistance dollars on enrollees than it spent the year prior to the contract year, the amount of underspending shall be deducted from the aggregate fee-for-service cost of covered services. The commissioner shall then compare the fee-for-service costs and capitation payments related to the services provided for the term of this contract. The commissioner shall base its calculation of the fee-for-service costs on application of the medical assistance fee schedule to services identified on the county administrative entity's encounter claims submitted to the commissioner. The aggregate fee-for-service cost shall not include any third-party recoveries or cost-avoided amounts.\nIf the commissioner finds that the aggregate fee-for-service cost is greater than the sum of the capitation payments, the commissioner shall settle according to the following schedule:\n(1) For the first contract year for each project, the commissioner shall pay the county administrative entity 50 percent of the difference between the sum of the capitation payments and 100 percent of projected fee-for-service costs. For aggregate fee-for-service costs in excess of 100 percent of projected fee-for-service costs, the commissioner shall pay 25 percent of the difference between the aggregate fee-for-service costs and the projected fee-for-service costs, up to 104 percent of the projected fee-for-service costs. The county administrative entity shall be responsible for all costs in excess of 104 percent of projected fee-for-service costs.\n(2) For the second contract year for each project, the commissioner shall pay the county administrative entity 37.5 percent of the difference between the sum of the capitation payments and 100 percent of projected fee-for-service costs. The county administrative entity shall be responsible for all costs in excess of 100 percent of projected fee-for-service costs.\n(3) For the third contract year for each project, the commissioner shall pay the county administrative entity 25 percent of the difference between the sum of the capitation payments and 100 percent of projected fee-for-service costs. The county administrative entity shall be responsible for all costs in excess of 100 percent of projected fee-for-service costs.\n(4) For the fourth and subsequent contract years for each project, the county administrative entity shall be responsible for all costs in excess of the capitation payments.\n(d) In addition to other payments under this subdivision, the commissioner may increase payments by up to 0.25 percent of the projected per-person costs that would otherwise have been paid under medical assistance fee-for-service. The commissioner may make the increased payments to:\n(1) offset rate increases for regional treatment services under subdivision 22 which are higher than were expected by the commissioner when the capitation was set at 96 percent; and\n(2) implement incentives to encourage appropriate, high quality, efficient services.\nThe county authority may integrate other local, state, and federal funding sources with medical assistance funding. The commissioner's approval is required for integration of state and federal funds but not for local funds. During the demonstration project period, county authorities must maintain the level of local funds expended during the previous calendar year for populations covered in the demonstration project. Excluding the state share of Medicaid payments, state appropriations for state-operated services shall not be integrated unless specifically approved by the legislature. The commissioner may approve integration of other state and federal funding if the intergovernmental contract includes assurances that the people who would have been served by these funds will receive comparable or better services. The commissioner may withdraw approval for integration of state and federal funds if the county authority does not comply with these assurances. If the county authority chooses to integrate funding, it must comply with the reporting requirements of the commissioner, as specified in the intergovernmental contract, to account for federal and state Medicaid expenditures and expenditures of local funds. The commissioner, upon the request and concurrence of a county authority, may transfer state grant funds that would otherwise be made available to the county authority to provide continuing care for enrollees to the medical assistance account and, within the limits of federal authority and available federal funding, the commissioner shall adjust the capitation based on the amount of this transfer.\n(a) For purposes of this section, \"service coordinator\" means an individual selected by the enrollee or the enrollee's legal representative and authorized by the county administrative entity or service delivery organization to work in partnership with the enrollee to develop, coordinate, and in some instances, provide supports and services identified in the personal support plan. Service coordinators may only provide services and supports if the enrollee is informed of potential conflicts of interest, is given alternatives, and gives informed consent. Eligible service coordinators are individuals age 18 or older who meet the qualifications as described in paragraph (b). Enrollees, their legal representatives, or their advocates are eligible to be service coordinators if they have the capabilities to perform the activities and functions outlined in paragraph (b). Providers licensed under chapter 245A to provide residential services, or providers who are providing housing support services under chapter 256I, may not act as service coordinator for enrollees for whom they provide residential services. This does not apply to providers of short-term detoxification services. Each county administrative entity or service delivery organization may develop further criteria for eligible vendors of service coordination during the demonstration period and shall determine whom it contracts with or employs to provide service coordination. County administrative entities and service delivery organizations may pay enrollees or their advocates or legal representatives for service coordination activities.\n(b) The service coordinator shall act as a facilitator, working in partnership with the enrollee to ensure that their needs are identified and addressed. The level of involvement of the service coordinator shall depend on the needs and desires of the enrollee. The service coordinator shall have the knowledge, skills, and abilities to, and is responsible for:\n(1) arranging for an initial assessment, and periodic reassessment as necessary, of supports and services based on the enrollee's strengths, needs, choices, and preferences in life domain areas;\n(2) developing and updating the personal support plan based on relevant ongoing assessment;\n(3) arranging for and coordinating the provisions of supports and services, including knowledgeable and skilled specialty services and prevention and early intervention services, within the limitations negotiated with the county administrative entity or service delivery organization;\n(4) assisting the enrollee and the enrollee's legal representative, if any, to maximize informed choice of and control over services and supports and to exercise the enrollee's rights and advocate on behalf of the enrollee;\n(5) monitoring the progress toward achieving the enrollee's outcomes in order to evaluate and adjust the timeliness and adequacy of the implementation of the personal support plan;\n(6) facilitating meetings and effectively collaborating with a variety of agencies and persons, including attending individual family service plan and individualized education program meetings when requested by the enrollee or the enrollee's legal representative;\n(7) soliciting and analyzing relevant information;\n(8) communicating effectively with the enrollee and with other individuals participating in the enrollee's plan;\n(9) educating and communicating effectively with the enrollee about good health care practices and risk to the enrollee's health with certain behaviors;\n(10) having knowledge of basic enrollee protection requirements, including data privacy;\n(11) informing, educating, and assisting the enrollee in identifying available service providers and accessing needed resources and services beyond the limitations of the medical assistance benefit set covered services; and\n(12) providing other services as identified in the personal support plan.\n(c) For the demonstration project, the qualifications and standards for service coordination in this section shall replace comparable existing provisions of existing statutes and rules governing case management for eligible individuals.\n(d) The provisions of this subdivision apply only to the demonstration sites designated by the commissioner under subdivision 5. All other demonstration sites must comply with laws and rules governing case management services for eligible individuals in effect when the site begins the demonstration project.\nEnrollees shall have access to ombudsman services established in section 256B.6903, and advocacy services provided by the ombudsman for mental health and developmental disabilities established in sections 245.91 to 245.97. The managed care ombudsman and the ombudsman for mental health and developmental disabilities shall coordinate services provided to avoid duplication of services. For purposes of the demonstration project, the powers and responsibilities of the Office of Ombudsman for Mental Health and Developmental Disabilities, as provided in sections 245.91 to 245.97 are expanded to include all eligible individuals, health plan companies, agencies, and providers participating in the demonstration project.\nIn addition to ombudsman services, enrollees shall have access to advocacy services on a local or regional basis. The purpose of external advocacy includes providing individual advocacy services for enrollees who have complaints or grievances with the county administrative entity, service delivery organization, or a service provider; assisting enrollees to understand the service delivery system and select providers and, if applicable, a service delivery organization; and understand and exercise their rights as an enrollee. External advocacy contractors must demonstrate that they have the expertise to advocate on behalf of eligible individuals and are independent of the commissioner, county authority, county administrative entity, service delivery organization, or any service provider within the demonstration project.\nThese advocacy services shall be provided through the ombudsman for mental health and developmental disabilities directly, or under contract with private, nonprofit organizations, with funding provided through the demonstration project. The funding shall be provided annually to the ombudsman's office. Funding for external advocacy shall be provided through general fund appropriations. This funding is in addition to the capitation payment available under subdivision 10.\nEach county authority with enrollees under public guardianship shall develop a plan to discharge all those public guardianships and establish appropriate private alternatives during the demonstration period.\nThe commissioner shall provide county authorities with funding for public guardianship alternatives during the first year of the demonstration project based on a proposal to establish private alternatives for a specific number of enrollees under public guardianship. Funding in subsequent years shall be based on the county authority's performance in achieving discharges of public guardianship and establishing appropriate alternatives. The commissioner may establish fiscal incentives to encourage county activity in this area. For each year of the demonstration period, an appropriation is available to the commissioner based on 0.2 percent of the projected per-person costs that would otherwise have been paid under medical assistance fee-for-service for that year. This funding is in addition to the capitation payment available under subdivision 10.\nEnrollees have the appeal rights specified in section 256.045. Enrollees may request the conciliation process as outlined under section 256.045, subdivision 4a. If an enrollee appeals in writing to the state agency on or before the latter of the effective day of the proposed action or the tenth day after they have received the decision of the county administrative entity or service delivery organization to reduce, suspend, terminate, or deny continued authorization for ongoing services which the enrollee had been receiving, the county administrative entity or service delivery organization must continue to authorize services at a level equal to the level it previously authorized until the state agency renders its decision.\nThe commissioner may approve alternatives to administrative rules if the commissioner determines that appropriate alternative measures are in place to protect the health, safety, and rights of enrollees and to assure that services are of sufficient quality to produce the outcomes described in the personal support plans. Prior approved waivers, if needed by the demonstration project, shall be extended. The commissioner shall not waive the rights or procedural protections under sections 245.825; 245.91 to 245.97; 252.41, subdivision 9; 256B.092, subdivision 10; and 626.557; and chapter 260E or procedures for the monitoring of psychotropic medications. Prohibited practices as defined in statutes and rules governing service delivery to eligible individuals are applicable to services delivered under this demonstration project.\nEach county authority and service delivery organization, and their contracted providers, shall submit information as required by the commissioner in the intergovernmental contract or service delivery contract, including information about complaints, appeals, outcomes, costs, including spending on services, service utilization, identified unmet needs, services provided, rates of out-of-home placement of children, institutionalization, commitments, number of public guardianships discharged and alternatives to public guardianship established, the use of emergency services, and enrollee satisfaction. This information must be made available to enrollees and the public. A county authority under an intergovernmental contract and a service delivery organization under a service delivery contract to provide services must provide the most current listing of the providers who are participating in the plan. This listing must be provided to enrollees and be made available to the public. The commissioner, county authorities, and service delivery organizations shall also make all contracts and subcontracts related to the demonstration project available to the public.\nCounty authorities and service delivery organizations participating in this demonstration project shall provide information to the department as specified in the intergovernmental contract or service delivery contract for the purpose of project evaluation. This information may include both process and outcome evaluation measures across areas that shall include enrollee satisfaction, service delivery, service coordination, individual outcomes, and costs. An independent evaluation of each demonstration site shall be conducted prior to expansion of the demonstration project to other sites.\nThe county administrative entity or service delivery organization may limit any reimbursement to providers not employed by or under contract with the county administrative entity or service delivery organization to the medical assistance rates paid by the commissioner of human services to providers for services to recipients not participating in the demonstration project.\nFor services that are outside of the medical assistance benefit set for enrollees in excluded time status, the county of financial responsibility must negotiate the provisions and payment of services with the county of service prior to the provision of services.\nThe county administrative entity or service delivery organization is financially responsible for all services for enrollees covered by the medical assistance benefit set and ordered by the court under the Minnesota Commitment Act, chapter 253B. The county authority shall seek input from the county administrative entity or service delivery organization in giving the court information about services the enrollee needs and least restrictive alternatives. The court order for services is deemed to comply with the definition of medical necessity in Minnesota Rules, part 9505.0175. The financial responsibility of the county administrative entity or service delivery organization for regional treatment center services to an enrollee while committed to the regional treatment center is limited to 45 days following commitment. Voluntary hospitalization for enrollees at regional treatment centers must be covered by the county administrative entity or service delivery organization if deemed medically necessary by the county administrative entity or service delivery organization. The regional treatment center shall not accept a voluntary admission of an enrollee without the authorization of the county administrative entity or service delivery organization. An enrollee will maintain enrollee status while receiving treatment under the Minnesota Commitment Act or voluntary services in a regional treatment center. For enrollees committed to the regional treatment center longer than 45 days, the commissioner of human services may adjust the aggregate capitation payments, as specified in the intergovernmental contract or service delivery contract.\n[Repealed, 2007 c 133 art 2 s 13]\n[Repealed, 2002 c 277 s 34]\nIf any subdivision of this section is not approved by the United States Department of Health and Human Services, the commissioner, with the approval of the county authority, retains the authority to implement the remaining subdivisions.\nWhen the commissioner contracts under subdivisions 1 and 6, paragraph (a), with the joint powers board for the southern Minnesota health initiative (SMHI) to participate in the demonstration project for persons with disabilities under subdivision 5, the commissioner shall also require health plans serving counties participating in the southern Minnesota health initiative under this section to contract with the southern Minnesota Health Initiative Joint Powers Board to provide covered mental health and substance use disorder services for the nonelderly/nondisabled persons who reside in one of the counties and who are required or elect to participate in the prepaid medical assistance program. Enrollees may obtain covered mental health and substance use disorder services through the SMHI or through other health plan contractors. Participation of the nonelderly/nondisabled with the SMHI is voluntary. The commissioner shall identify a monthly per capita payment amount that health plans are required to pay to the SMHI for all nonelderly/nondisabled recipients who choose the SMHI for their mental health and substance use disorder services.\nDemonstration sites designated under subdivision 5, with the permission of an eligible individual, may implement the provisions of subdivision 12 beginning 60 calendar days prior to an individual's enrollment. This implementation may occur prior to the enrollment of eligible individuals, but is restricted to eligible individuals.",
	"repealed": false
}