{
	"id": "116.182",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.182",
	"title": "116.182 FINANCIAL ASSISTANCE PROGRAM.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Agency\" means the Pollution Control Agency.\n(c) \"Authority\" means the Public Facilities Authority established in section 446A.03.\n(d) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(e) \"Essential project components\" means those components of a wastewater disposal system that are necessary to convey or treat a municipality's existing wastewater flows and loadings.\n(f) \"Municipality\" means a county, home rule charter or statutory city, town, the Metropolitan Council, an Indian tribe or an authorized Indian tribal organization; or any other governmental subdivision of the state responsible by law for the prevention, control, and abatement of water pollution in any area of the state.\n(g) \"Outstanding international resource value waters\" are the surface waters of the state in the Lake Superior Basin, other than class 7 waters and those waters designated as outstanding resource value waters.\n(h) \"Outstanding resource value waters\" are those that have high water quality, wilderness characteristics, unique scientific or ecological significance, exceptional recreation value, or other special qualities that warrant special protection.\nThis section governs the commissioner's certification of projects seeking financial assistance under section 103F.725, subdivision 1a; 446A.07; 446A.072; or 446A.073.\nThe commissioner shall review a municipality's proposed project to determine whether it meets the criteria in this section and the rules adopted under this section. The review must include a determination of the essential project components for wastewater treatment projects.\n[Repealed, 2014 c 248 s 19]\nThe commissioner shall certify to the authority each approved project, including for wastewater treatment projects a statement of the essential project components and associated costs.\nThe agency shall adopt rules for the administration of the financial assistance program. For wastewater treatment projects, the rules must include:\n(1) application requirements;\n(2) criteria for the ranking of projects in order of priority based on factors including the type of project and the degree of environmental impact, and scenic and wild river standards; and\n(3) criteria for determining essential project components.\nAs the projects in the programs specified under section 116.18, except the program under subdivision 3c of that section, are completed, any amounts remaining from appropriations for the programs are appropriated to the authority for the wastewater infrastructure funding program in section 446A.072, provided this use of the funds does not violate applicable provisions of any bond or note resolutions, indentures, or other instruments, contracts, or agreements associated with the source of the funds.",
	"repealed": false
}