{
	"id": "471.697",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.697",
	"title": "471.697 FINANCIAL REPORTS; FILING; CITIES, TOWNS OF 2,500.",
	"text": "In any city with a population of more than 2,500 according to the latest federal census, or town with a population of more than 2,500 according to the latest federal census with an annual revenue of (1) $670,500 or more in 2004, or (2) $670,500 adjusted for inflation using the annual implicit price deflator for state and local expenditures as published by the United States Department of Commerce in 2005 and after, the city clerk, chief financial officer, town clerk, or town clerk-treasurer shall:\n(a) Prepare a financial report covering the city's or town's operations including operations of municipal hospitals and nursing homes, liquor stores, and public utility commissions during the preceding fiscal year after the close of the fiscal year. Cities shall publish the report or a summary of the report, in a form as prescribed by the state auditor, in a qualified newspaper of general circulation in the city or, if there is none, post copies in three of the most public places in the city, no later than 30 days after the report is due in the office of the state auditor. The report shall contain financial statements and disclosures which present the city's or town's financial position and the results of city or town operations in conformity with generally accepted accounting principles. The report shall include such information and be in such form as may be prescribed by the state auditor;\n(b) File the financial report in the clerk's or financial officer's office for public inspection and present it to the city council or town board after the close of the fiscal year. One copy of the financial report shall be furnished to the state auditor after the close of the fiscal year; and\n(c) Submit to the state auditor audited financial statements which have been attested to by a certified public accountant, public accountant, or the state auditor within 180 days after the close of the fiscal year, except that the state auditor may upon request of a city or town and a showing of inability to conform, extend the deadline. The state auditor may accept this report in lieu of the report required in clause (b). A copy of the audited financial statement along with any management letter or other written findings or comments by the auditor must be provided to each city council member and the mayor, or to each town board member, no later than 30 days after the report is required to be submitted to the state auditor and presented at a scheduled meeting of the city council or town board prior to October 31 of the year in which the report is submitted to the state auditor.\nA municipal hospital or nursing home established before June 6, 1979, whose fiscal year is not a calendar year on August 1, 1980, is not subject to this subdivision but shall submit to the state auditor a detailed statement of its financial affairs audited by a certified public accountant, a public accountant or the state auditor no later than 120 days after the close of its fiscal year. It may also submit a summary financial report for the calendar year.\nThe state auditor shall continue to audit cities of the first class pursuant to section 6.49, subject to the authority in section 6.49 for certain cities of the first class to have audits performed by a certified public accountant firm.",
	"repealed": false
}