{
	"id": "145D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/145D.02",
	"title": "145D.02 DATA REPORTING OF CERTAIN HEALTH CARE TRANSACTIONS.",
	"text": "(a) This section applies to all transactions where:\n(1) the health care entity involved in the transaction has average revenue between $10,000,000 and $80,000,000 per year; or\n(2) the transaction will result in an entity projected to have average revenue between $10,000,000 per year and $80,000,000 per year once the entity is operating at full capacity.\n(b) A health care entity must provide the following data to the commissioner at least 30 days before the proposed completion date of the transaction, or within ten business days of the date the parties first reasonably anticipate entering into the transaction if the expected completion is within less than 30 days, in the form and manner determined by the commissioner:\n(1) the entities involved in the transaction;\n(2) the leadership, ownership structures, and business relationship of the entities involved in the transaction, including all board members, managing partners, member managers, and officers;\n(3) the services provided by each entity and the operating and nonoperating revenue for each entity by location, for the last three years;\n(4) the primary service area for each location;\n(5) the proposed service area for each location;\n(6) the current relationships between the entities and the affected health care providers and practices, the locations of affected health care providers and practices, the services provided by affected health care providers and practices, and the proposed relationships between the entities and the affected health care providers and practices;\n(7) the terms of the transaction agreement or agreements;\n(8) potential areas of expansion, whether in existing markets or new markets;\n(9) plans to close facilities, reduce workforce, or reduce or eliminate services;\n(10) the number of full-time equivalent positions at each location before and after the transaction by job category, including administrative and contract positions; and\n(11) any other information relevant to evaluating the transaction that is requested by the commissioner.\n(c) If the commissioner determines that information required from the health care entity under this section has not been provided, the commissioner may notify the entity of the necessary information within 30 days of the health care entity's initial submission of the notice. The health care entity must provide such additional information to the commissioner within 14 days of the commissioner's request.\n(d) Data provided to or collected by the commissioner under this section are private data on individuals or nonpublic data, as defined in section 13.02. The commissioner may share with the attorney general, according to section 13.05, subdivision 9, any not public data, as defined in section 13.02, subdivision 8a, held by the commissioner to aid in the investigation and review of the transaction, and the attorney general must maintain this data with the same classification according to section 13.03, subdivision 4, paragraph (c).\n(e) A health care entity is exempt from reporting under this section if the health care entity is required to submit information to the attorney general and commissioner under section 145D.01, subdivision 2.\n(f) The commissioner shall use data collected under this section to analyze the number of health care transactions in Minnesota and the potential impact these transactions may have on equitable access to or the cost and quality of health care services, and develop recommendations for the legislature on improvements to the law.",
	"repealed": false
}