{
	"id": "289A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.56",
	"title": "289A.56 INTEREST ON OVERPAYMENTS.",
	"text": "When interest is due on an overpayment under this section, it must be computed at the rate specified in section 270C.405.\nInterest must be paid on an overpayment refunded or credited to the taxpayer from the date of payment of the tax until the date the refund is paid or credited. For purposes of this subdivision, the prepayment of tax made by withholding of tax at the source or payment of estimated tax before the due date is considered paid on the last day prescribed by law for the payment of the tax by the taxpayer. A return filed before the due date is considered as filed on the due date.\nWhen the amount of tax withheld at the source or paid as estimated tax or allowable as other refundable credits, or withheld from compensation of entertainers, exceeds the tax shown on the original return by $10, the amount refunded bears interest from 90 days after (1) the due date of the return of the taxpayer, or (2) the date on which the original return is filed, whichever is later, until the date the refund is paid to the taxpayer. Where the amount to be refunded is less than $10, no interest is paid. However, to the extent that the basis for the refund is a net operating loss carryback, interest is computed only from the end of the taxable year in which the loss occurs.\nWhen a refund is due for overpayments of withholding tax, entertainer withholding tax, or withholding from payments to out-of-state contractors, interest is computed from the date of payment to the date the refund is paid or credited. For purposes of this subdivision, the date of payment is the later of the date the tax was finally due or was paid.\nFor the purposes of computing interest on estate tax refunds, interest is paid from the later of the date of overpayment, the date the estate tax return is due, or the date the original estate tax return is filed to the date the refund is paid.\nFor purposes of computing interest on sales and use tax refunds, interest is paid from the date of payment to the date the refund is paid or credited, if the refund claim includes a detailed schedule reflecting the tax periods covered in the claim. If the refund claim submitted does not include a detailed schedule reflecting the tax periods covered in the claim, interest is computed from the date the claim was filed.\nNotwithstanding subdivision 3, for refunds payable under sections 297A.75, subdivision 1, and 289A.50, subdivision 2a, interest is computed from 90 days after the refund claim is filed with the commissioner.\nIn the case of a refund allowed under section 297A.90, subdivision 3, interest is allowed only from the date on which the person has both registered as a retailer and filed a claim for refund.\nWhen a claimant is owed a property tax refund under chapter 290A, the unpaid refund bears interest after September 29, or 60 days after the refund claim was made, whichever is later, until the date the refund is paid.\n[Repealed, 2014 c 308 art 9 s 94]\nNotwithstanding subdivision 3, for refunds payable under section 469.1734, subdivision 6, interest is computed from 90 days after the refund claim is filed with the commissioner.",
	"repealed": false
}