{
	"id": "424A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.02",
	"title": "424A.02 DEFINED BENEFIT RELIEF ASSOCIATIONS; SERVICE PENSIONS.",
	"text": "(a) A defined benefit relief association, when its articles of incorporation or bylaws so provide, may pay out of the assets of its special fund a defined benefit service pension to each of its members who: (1) separates from active service with the fire department; (2) reaches age 50; (3) completes at least five years of active service as an active member of the fire department to which the relief association is associated; (4) completes at least five years of active membership with the relief association before separation from active service; and (5) complies with any additional conditions as to age, service, and membership that are prescribed by the bylaws of the relief association. A service pension computed under this section may be prorated monthly for fractional years of service as the bylaws or articles of incorporation of the relief association so provide. The bylaws or articles of incorporation may define a \"month,\" but the definition must require a calendar month to have at least 16 days of active service. If the bylaws or articles of incorporation do not define a \"month,\" a \"month\" is a completed calendar month of active service measured from the member's date of entry to the same date in the subsequent month. The service pension earned by a firefighter under this chapter and the articles of incorporation and bylaws of the firefighters relief association may be paid whether or not the municipality or independent nonprofit firefighting corporation to which the relief association is associated qualifies for the receipt of fire state aid under chapter 477B.\n(b) In the case of a member who has completed at least five years of active service as an active member of the fire department to which the relief association is associated on the date that the relief association is established and incorporated, the requirement that the member complete at least five years of active membership with the relief association before separation from active service may be waived by the board of trustees of the relief association if the member completes at least five years of inactive membership with the relief association before the date of the payment of the service pension. During the period of inactive membership, the member is not entitled to receive disability benefit coverage, is not entitled to receive additional service credit toward computation of a service pension, and is considered to have the status of a person entitled to a deferred service pension under subdivision 7.\n(c) No municipality, independent nonprofit firefighting corporation, or joint powers entity may delegate the power to take final action in setting a service pension or ancillary benefit amount or level to the board of trustees of the relief association or to approve in advance a service pension or ancillary benefit amount or level equal to the maximum amount or level that this chapter would allow rather than a specific dollar amount or level.\nIf the articles of incorporation or bylaws of a defined benefit relief association provide a vesting schedule that satisfies the requirements of this subdivision, the relief association may pay a reduced service pension to a retiring member. For purposes of this section, \"vests,\" \"vesting,\" or \"vested\" means a nonforfeitable, unconditional, or legally enforceable right. A member vests in the member's accrued service pension in accordance with the vesting schedule set forth in the relief association's articles of incorporation or bylaws. Provided a member meets the minimum age and service requirements of subdivision 1, the member is entitled to the member's accrued service pension, but only to the extent vested as provided in the vesting schedule set forth in the articles of incorporation or bylaws. In no event may the articles of incorporation or bylaws:\n(1) require that a member have more than 20 years of active service to become 100 percent vested in the member's accrued service pension; or\n(2) provide for a larger vesting percentage than is provided in the following schedule with respect to the completed number of years of active service indicated in the schedule:\nMS 2021 Supp [Repealed, 2022 c 65 art 4 s 26]\nMS 2021 Supp [Repealed, 2022 c 65 art 4 s 26]\nMS 2021 Supp [Repealed, 2022 c 65 art 4 s 26]\n(a) Except as provided in paragraph (b) and section 424B.22, subdivision 4, a defined benefit relief association may not set in its bylaws a service pension amount above the following maximum amounts:\n(1) for a defined benefit relief association in which the governing bylaws provide for a monthly service pension, the maximum monthly service pension amount per month for each year of service credited is the lesser of $100 or the maximum monthly service pension amount that could be adopted by the relief association as a bylaws amendment that satisfies section 424A.093, subdivision 6, paragraph (d); and\n(2) for a defined benefit relief association in which the governing bylaws provide for a lump-sum service pension, the maximum lump-sum service pension amount for each year of service credited is the lesser of $15,000 or the maximum lump-sum service pension amount that could be adopted by the relief association as a bylaws amendment that satisfies section 424A.092, subdivision 6, paragraph (e).\n(b) A defined benefit relief association may set in its bylaws a service pension amount that is not greater than the maximum amounts in clause (1) or (2), as applicable, but only if the service pension amount has been ratified by the municipality.\n(1) For a defined benefit relief association that pays a monthly service pension, the maximum monthly service pension amount per month for each year of service credited is $100.\n(2) For a defined benefit relief association that pays a lump-sum service pension, the maximum lump-sum service pension amount for each year of service credited is $15,000.\n(c) The method of calculating service pensions must be applied uniformly for all years of active service. Credit must be given for all years of active service, unless the bylaws of the relief association provide that service credit is not given for:\n(1) years of active service in excess of caps on service credit; or\n(2) years of active service earned by a former member who:\n(i) has ceased duties as a volunteer firefighter and paid on-call firefighter with the fire department before becoming vested under subdivision 2; and\n(ii) has not resumed active service with the fire department and active membership in the relief association for a period as defined in the relief association's bylaws, of not less than five years.\n(a) If a defined benefit relief association pays a service pension greater than the applicable maximum service pension amount under subdivision 3, the state auditor must notify the relief association that the service pension paid is greater than the applicable maximum service pension and that the penalty under this subdivision will be imposed, unless the relief association reduces the service pension amount to an amount that is not greater than the applicable maximum service pension amount and recovers the overpaid service pension. If the service pension amount is not reduced and the overpayment is not recovered, the state auditor must:\n(1) disqualify the municipality or the independent nonprofit firefighting corporation associated with the relief association from receiving fire state aid by making the appropriate notification to the municipality and the commissioner of revenue, with the disqualification applicable for the next apportionment and payment of fire state aid; and\n(2) order the treasurer of the applicable relief association to recover the amount of the overpaid service pension or pensions from any retired firefighter who received an overpayment.\n(b) Fire state aid amounts from disqualified municipalities for the period of disqualifications under paragraph (a), clause (1), must be credited to the amount of fire insurance premium tax proceeds available for the next subsequent fire state aid apportionment.\n(c) The amount of any overpaid service pension recovered under paragraph (a), clause (2), must be credited to the amount of fire insurance premium tax proceeds available for the next subsequent fire state aid apportionment.\n(d) The determination of the state auditor that a relief association has paid a service pension greater than the applicable maximum must be made on the basis of the information filed by the relief association and the municipality with the state auditor under this chapter and any other relevant information that comes to the attention of the state auditor. The determination of the state auditor is final. An aggrieved municipality, relief association, or person may appeal the determination under section 480A.06.\n(e) The state auditor may certify, upon learning that a relief association overpaid a service pension based on an error in the maximum service pension calculation, the municipality or independent nonprofit firefighting corporation associated with the relief association for fire state aid if (1) there is evidence that the error occurred in good faith, and (2) the relief association has initiated recovery of any overpayment amount. Notwithstanding paragraph (c), all overpayments recovered under this paragraph must be credited to the relief association's special fund.\n[Repealed, 2009 c 169 art 10 s 58]\n[Repealed, 1999 c 222 art 11 s 1]\n[Repealed, 2009 c 169 art 10 s 58]\n(a) A member of a defined benefit relief association is entitled to a deferred service pension if the member separates from active service and membership and has completed the minimum service and membership requirements in subdivision 1. The requirement that a member separate from active service and membership is waived for persons who have discontinued their volunteer firefighter and paid on-call firefighter duties and who are employed on a part-time or full-time basis under section 424A.015, subdivision 1.\n(b) The deferred service pension is payable when the former member reaches at least age 50, or at least the minimum age specified in the bylaws governing the relief association if that age is greater than age 50, and when the former member makes a valid written application.\n(c) A defined benefit relief association that provides a lump-sum service pension governed by subdivision 2c may, when its governing bylaws so provide, credit interest on the deferred lump-sum service pension during the period of deferral. If provided for in the bylaws, interest must be credited in one of the following manners:\n(1) at the investment performance rate actually earned on that portion of the assets if the deferred benefit amount is invested by the relief association in a separate account established and maintained by the relief association;\n(2) at the investment performance rate actually earned on that portion of the assets if the deferred benefit amount is invested in a separate investment vehicle held by the relief association; or\n(3) at an interest rate of up to five percent, compounded annually, as set by the board of trustees.\n(d) Any change in the interest rate set by the board of trustees under paragraph (c), clause (3), must be ratified by the governing body of the municipality or joint powers entity served by the fire department to which the relief association is directly associated, or by the independent nonprofit firefighting corporation, as applicable.\n(e) Interest under paragraph (c), clause (3), is credited beginning on the January 1 next following the date on which the deferred service pension interest rate as set by the board of trustees was ratified by the governing body of the municipality or joint powers entity served by the fire department to which the relief association is directly associated, or by the independent nonprofit firefighting corporation, as applicable.\n(f) Unless the bylaws of a relief association that has elected to credit interest or additional investment performance on deferred lump-sum service pensions under paragraph (c) specifies a different interest or additional investment performance method, including the interest or additional investment performance period starting date and ending date, the interest or additional investment performance on a deferred service pension is creditable as follows:\n(1) for a relief association that has elected to credit interest or additional investment performance under paragraph (c), clause (1) or (3), beginning on the first day of the month next following the date on which the member separates from active service and membership and ending on the last day of the month immediately before the month in which the deferred member commences receipt of the deferred service pension; or\n(2) for a relief association that has elected to credit interest or additional investment performance under paragraph (c), clause (2), beginning on the date that the member separates from active service and membership and ending on the date that the separate investment vehicle is valued immediately before the date on which the deferred member commences receipt of the deferred service pension.\n(g) For a deferred service pension that is transferred to a separate account established and maintained by the relief association or separate investment vehicle held by the relief association, the deferred member bears the full investment risk subsequent to transfer and in calculating the accrued liability of the firefighters relief association that pays a lump-sum service pension, the accrued liability for deferred service pensions is equal to the separate relief association account balance or the fair market value of the separate investment vehicle held by the relief association.\n(a) A defined benefit relief association, if the governing bylaws so provide, may pay, at the option of the intended recipient and in lieu of a single payment of a lump-sum service pension or survivor benefit, a lump-sum service pension or survivor benefit in installments.\n(b) The election of installment payments is irrevocable and must be made by the intended recipient in writing and filed with the secretary of the relief association no later than 30 days before the commencement of payment of the service pension or survivor benefit. The amount of the installment payments must be determined in any reasonable manner provided for in the governing bylaws, but the total amount of installment payments may not exceed the single payment service pension amount plus interest at an annual rate of five percent on the amount of delayed payments for the period during which payment was delayed.\n[Repealed, 2009 c 169 art 10 s 58]\n[Repealed, 2009 c 169 art 10 s 58]\nA defined benefit relief association and the Bloomington Fire Department Relief Association may only pay ancillary benefits that would constitute an authorized disbursement as specified in section 424A.05 subject to the following requirements or limitations:\n(1) with respect to a defined benefit relief association in which governing bylaws provide solely for a lump-sum service pension to a retiring member, or provide a retiring member the choice of either a lump-sum service pension or a monthly service pension and the lump-sum service pension was chosen, no ancillary benefit may be paid to any former member or paid to any person on behalf of any former member after the former member (i) terminates active service with the fire department and active membership in the relief association; and (ii) commences receipt of a service pension as authorized under this section; and\n(2) with respect to any defined benefit relief association, no ancillary benefit paid or payable to any member, to any former member, or to any person on behalf of any member or former member, may exceed in amount the total earned service pension of the member or former member. The total earned service pension must be calculated by multiplying the service pension amount specified in the bylaws of the relief association at the time of death or disability, whichever applies, by the years of service credited to the member or former member. The years of service must be determined as of (i) the date the member or former member became entitled to the ancillary benefit; or (ii) the date the member or former member died entitling a survivor or the estate of the member or former member to an ancillary benefit. The ancillary benefit must be calculated without regard to whether the member had attained the minimum amount of service and membership credit specified in the governing bylaws. For active members, the amount of a permanent disability benefit or a survivor benefit must be equal to the member's total earned service pension except that the bylaws of a defined benefit relief association may provide for the payment of a survivor benefit in an amount not to exceed five times the yearly service pension amount specified in the bylaws on behalf of any member who dies before having performed five years of active service in the fire department with which the relief association is affiliated. For deferred members, the amount of a permanent disability benefit or a survivor benefit must be calculated using the service pension amount in effect on the date specified in section 424A.015, subdivision 6, unless the bylaws of the relief association specify a different service pension amount to be used for the calculation.\n(3)(i) If a lump sum survivor or death benefit is payable under the articles of incorporation or bylaws, the benefit must be paid:\n(A) as a survivor benefit to the surviving spouse of the deceased firefighter;\n(B) as a survivor benefit to the surviving children of the deceased firefighter if no surviving spouse;\n(C) as a survivor benefit to a designated beneficiary of the deceased firefighter if no surviving spouse or surviving children; or\n(D) as a death benefit to the estate of the deceased active or deferred firefighter if no surviving children and no beneficiary designated.\n(ii) If there are no surviving children, the surviving spouse may waive, in writing, wholly or partially, the spouse's entitlement to a survivor benefit.\n(4)(i) If a monthly benefit survivor or death benefit is payable under the articles of incorporation or bylaws, the benefit must be paid:\n(A) as a survivor benefit to the surviving spouse of the deceased firefighter;\n(B) as a survivor benefit to the surviving children of the deceased firefighter if no surviving spouse;\n(C) as a survivor benefit to a designated beneficiary of the deceased firefighter if no surviving spouse or surviving children; or\n(D) as a death benefit to the estate of the deceased active or deferred firefighter if no surviving spouse, no surviving children, and no beneficiary designated.\n(ii) If there are no surviving children, the surviving spouse may waive, in writing, wholly or partially, the spouse's entitlement to a survivor benefit.\n(iii) For purposes of this clause, if the relief association bylaws authorize a monthly survivor benefit payable to a designated beneficiary, the relief association bylaws may limit the total survivor benefit amount payable.\n(5) For purposes of this section, for a monthly benefit firefighters relief association or for a combination lump-sum and monthly benefit firefighters relief association where a monthly benefit service pension has been elected by or a monthly benefit is payable with respect to a firefighter, a designated beneficiary must be a natural person. For purposes of this section, for a lump-sum firefighters relief association or for a combination lump-sum and monthly benefit firefighters relief association where a lump-sum service pension has been elected by or a lump-sum benefit is payable with respect to a firefighter, a trust created under chapter 501C may be a designated beneficiary. If a trust is payable to the surviving children organized under chapter 501C as authorized by this section and there is no surviving spouse, the survivor benefit may be paid to the trust, notwithstanding a requirement of this section to the contrary.\nNotwithstanding any provision of general or special law to the contrary, a defined benefit relief association paying a monthly service pension may provide a postretirement increase to retired members and ancillary benefit recipients of the relief association if (1) the relief association adopts an appropriate bylaw amendment; and (2) the bylaw amendment is approved by the municipality pursuant to subdivision 10 and section 424A.093, subdivision 6. The postretirement increase is applicable only to retired members and ancillary benefit recipients receiving a monthly service pension or monthly ancillary benefit as of the effective date of the bylaw amendment. The authority to provide a postretirement increase to retired members and ancillary benefit recipients of a relief association contained in this subdivision supersedes any prior special law authorization relating to the provision of postretirement increases.\n[Repealed, 2009 c 169 art 10 s 58]\n(a) Each defined benefit relief association to which this section applies must file a revised copy of its governing bylaws with the state auditor upon the adoption of any amendment to its governing bylaws by the relief association or upon the approval of any amendment to its governing bylaws granted by the governing body of the municipality served by the fire department to which the relief association is directly associated or by the independent nonprofit firefighting corporation, as applicable. Failure of the relief association to file a copy of the bylaws or any bylaw amendments with the state auditor disqualifies the municipality from the distribution of any future fire state aid until this filing requirement has been completed.\n(b) If the special fund of the relief association does not have a surplus over full funding under section 424A.092, subdivision 3, paragraph (c), clause (5), or 424A.093, subdivision 4, and if the municipality is required to provide financial support to the special fund of the relief association under section 424A.092 or 424A.093, no bylaw amendment which would affect the amount of, the manner of payment of, or the conditions for qualification for service pensions or ancillary benefits or disbursements other than administrative expenses authorized under section 424A.05, subdivision 3b, payable from the special fund of the relief association is effective until it has been ratified as required under section 424A.092, subdivision 6, or 424A.093, subdivision 6. If the special fund of the relief association has a surplus over full funding under section 424A.092, subdivision 3, or 424A.093, subdivision 4, and if the municipality is not required to provide financial support to the special fund under this section, the relief association may adopt or amend without municipal ratification its articles of incorporation or bylaws which increase or otherwise affect the service pensions or ancillary benefits payable from the special fund if authorized under section 424A.092, subdivision 6, or 424A.093, subdivision 6.\n(c) If the relief association pays only a lump-sum pension, the financial requirements are to be determined by the board of trustees following the preparation of an estimate of the expected increase in the accrued liability and annual accruing liability of the relief association attributable to the change. If the relief association pays a monthly benefit service pension, the financial requirements are to be determined by the board of trustees following either an updated actuarial valuation including the proposed change or an estimate of the expected actuarial impact of the proposed change prepared by the actuary of the relief association. If a relief association adopts or amends its articles of incorporation or bylaws without municipal ratification under this subdivision, and, subsequent to the amendment or adoption, the financial requirements of the special fund under this section are such so as to require financial support from the municipality, the provision which was implemented without municipal ratification is no longer effective without municipal ratification, and any service pensions or ancillary benefits payable after that date must be paid only in accordance with the articles of incorporation or bylaws as amended or adopted with municipal ratification.\n[Repealed, 2000 c 461 art 16 s 13]\nNotwithstanding the requirements of subdivision 1 or any other law, a member of a fire department which is disbanded upon formation of a fire district to serve substantially the same geographic area, who serves as an active firefighter with the new district fire department, and is a member of the district firefighters defined benefit relief association is entitled to a nonforfeitable service pension from the new relief association upon completion of a combined total of 20 years active service in the disbanded and the new departments. The amount of the service pension is based upon years of service in the new department only and must be in an amount equal to the accrued liability for the appropriate years of service calculated in accordance with section 424A.092, subdivision 2.\nMS 2016 [Repealed, 2018 c 211 art 14 s 33]",
	"repealed": false
}