{
	"id": "145.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.925",
	"title": "145.925 SEXUAL AND REPRODUCTIVE HEALTH SERVICES GRANTS.",
	"text": "(a) It is the goal of the state to increase access to sexual and reproductive health services for people who experience barriers, whether geographic, cultural, financial, or other, in access to such services. The commissioner of health shall administer grants to facilitate access to sexual and reproductive health services for people of reproductive age, particularly those from populations that experience barriers to these services.\n(b) The commissioner of health shall coordinate with other efforts at the local, state, or national level to avoid duplication and promote complementary efforts in sexual and reproductive health service promotion among people of reproductive age.\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]\nFor purposes of this section, \"sexual and reproductive health services\" means services that promote a state of complete physical, mental, and social well-being in relation to sexuality, reproduction, and the reproductive system and its functions and processes, and not merely the absence of disease or infirmity. These services must be provided in accord with nationally recognized standards and include but are not limited to sexual and reproductive health counseling, voluntary and informed decision-making on sexual and reproductive health, information on and provision of contraceptive methods, sexual and reproductive health screenings and treatment, pregnancy testing and counseling, and other preconception services.\n(a) The commissioner of health shall award grants to eligible community organizations, including nonprofit organizations, community health boards, and Tribal communities in rural and metropolitan areas of the state to support, sustain, expand, or implement reproductive and sexual health programs for people of reproductive age to increase access to and availability of medically accurate sexual and reproductive health services.\n(b) The commissioner of health shall establish application scoring criteria to use in the evaluation of applications submitted for award under this section. These criteria shall include but are not limited to the degree to which applicants' programming responds to demographic factors relevant to paragraph (f) and subdivision 1, paragraph (a).\n(c) When determining whether to award a grant or the amount of a grant under this section, the commissioner of health may identify and stratify geographic regions based on the region's need for sexual and reproductive health services. In this stratification, the commissioner may consider data on the prevalence of poverty and other factors relevant to a geographic region's need for sexual and reproductive health services.\n(d) The commissioner of health may consider geographic and Tribal communities' representation in the award of grants.\n(e) Current recipients of funding under this section shall not be afforded priority over new applicants.\n(f) Grant funds shall be used to support new or existing sexual and reproductive health programs that provide person-centered, accessible services; that are culturally and linguistically appropriate, inclusive of all people, and trauma-informed; that protect the dignity of the individual; and that ensure equitable, quality services consistent with nationally recognized standards of care. These services shall include:\n(1) education and outreach on medically accurate sexual and reproductive health information;\n(2) contraceptive counseling, provision of contraceptive methods, and follow-up;\n(3) screening, testing, and treatment of sexually transmitted infections and other sexual or reproductive concerns; and\n(4) referral and follow-up for medical, financial, mental health, and other services in accord with a service recipient's needs.\nExcept as provided in sections 144.341 and 144.342, any person employed to provide family planning services who is paid in whole or in part from funds provided under this section who advises an abortion or sterilization to any unemancipated minor shall, following such a recommendation, so notify the parent or guardian of the reasons for such an action.\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]\nThe request of any person for sexual and reproductive health services or the refusal to accept any service shall in no way affect the right of the person to receive public assistance, public health services, or any other public service. Nothing in this section shall abridge the right of the person to make decisions concerning sexual and reproductive health, nor shall any person be required to state a reason for refusing any offer of sexual and reproductive health services.\nAll information gathered by any agency, entity, or individual conducting programs in sexual and reproductive health is private data on individuals within the meaning of section 13.02, subdivision 12. For any person or entity meeting the definition of a \"provider\" under section 144.291, subdivision 2, paragraph (i), all sexual and reproductive health services information provided to, gathered about, or received from a person under this section is also subject to the Minnesota Health Records Act, in sections 144.291 to 144.298.\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]\nMS 2022 [Repealed by amendment, 2023 c 70 art 4 s 61]",
	"repealed": false
}