{
	"id": "354A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.36",
	"title": "354A.36 PERMANENT DISABILITY BENEFITS.",
	"text": "Any coordinated member who is vested, who has an average salary of at least $75 per month, and who has become totally and permanently disabled shall be entitled to a disability benefit. If the disabled coordinated member's allowable service credit has not been continuous, at least two years of the required allowable service shall be required to have been rendered subsequent to the last interruption in service.\nThe disability benefit shall begin to accrue from the later of either 90 days following the commencement of the permanent disability or the first day of the month following the date on which the written application for the disability benefit has been filed with the board, but payment shall not begin to accrue until any salary which is received by the disabled coordinated member for either annual or sick leave during the period of disability ceases.\nThe coordinated permanent disability benefit is an amount equal to the normal coordinated retirement annuity computed under section 354A.31, subdivision 4, based on allowable service credited to the date of disability but without any reduction for the commencement of the benefit prior to the attainment of normal retirement age or age 62 with at least 30 years of service credit as specified in section 354A.31, subdivision 6.\nA disabled coordinated member may elect to receive the normal disability benefit or an optional annuity as provided in section 354A.32. The election of an optional annuity shall be made prior to commencement of payment of the disability benefit and shall be effective 30 days after receipt of the election or the date on which the disability benefit begins to accrue, whichever occurs later. Upon becoming effective, the optional annuity shall begin to accrue on the same date as provided for the disability benefit.\n(a) The board of the teachers retirement fund association shall make the final determination of the existence of a permanent and total disability. The board shall have the coordinated member examined by at least two medical experts. After making a required examination, each medical expert shall make a written report to the board concerning the coordinated member, which shall include an opinion of the medical expert as to whether or not the member is permanently and totally disabled within the meaning of section 354A.011, subdivision 14. The board shall also obtain a written statement from the employer as to whether or not the coordinated member was terminated or separated from active employment due to a disability which is deemed by the employer to reasonably prevent further service by the member to the employer and which caused the coordinated member not to be entitled to further compensation from the employer for services rendered by the member. If, after consideration of the reports of the medical experts and any medical adviser retained by the board under subdivision 4a, the employer statement, and any evidence presented by the member or any other interested parties, the board determines that the coordinated member is totally and permanently disabled within the meaning of section 354A.011, subdivision 14, the board shall grant the coordinated member a disability benefit. A member who is placed on a leave of absence without compensation as a result of the disability is not barred from receiving a disability benefit under this section.\n(b) The executive director shall reject an application for disability benefits under section 354A.36 if the member is applying only because an employer-sponsored provider of private disability insurance benefits requires the application and the member would not have applied for disability benefits in the absence of the requirement. The member shall submit a copy of the disability insurance policy that requires an application for disability benefits from the plan if the member wishes to assert that the application is only being submitted because of the disability insurance policy requirement.\nThe executive director may contract with an independent medical expert or an accredited organization specializing in disability determinations to serve as a medical adviser to the board. The medical adviser shall review all expert reports based on any examinations performed in order to determine whether a coordinated member is totally and permanently disabled as defined in section 354A.011, subdivision 14. The medical adviser shall also investigate all health and medical statements and certificates by or on behalf of a member in connection with a disability benefit and shall report in writing to the board, setting forth any conclusions and recommendations on all matters referred to the medical adviser. The board shall have sole discretion to select the appropriate licensed medical professional or organization to serve as the medical adviser.\nThe coordinated disability benefit shall be reduced by any amounts received or receivable by a coordinated member from the school district under applicable workers' compensation laws.\nAt least once each year during the first five years following the granting of a disability benefit to a coordinated member and at least once in every three-year period thereafter, the board may require the disability benefit recipient to undergo an expert examination. The examination must be made by a medical expert engaged by the board, in its sole discretion. The medical expert conducting the examination shall make a written report to the board concerning the disability benefit recipient and the recipient's disability, including a statement of the medical expert's opinion as to whether or not the member remains permanently and totally disabled within the meaning of section 354A.011, subdivision 14. If the board determines from consideration of the medical expert's report that the disability benefit recipient is no longer permanently and totally disabled or that the benefit recipient is engaged or able to engage in a gainful occupation, unless the disability benefit recipient is partially employed under subdivision 7, then further disability benefit payments from the fund must be discontinued within 60 days of the determination by the board. The discontinuation of disability benefits must occur immediately if the disability recipient is reinstated to the district payroll following sick leave.\nIf a disability benefit recipient resumes gainful employment but the compensation from the employment is less than the recipient's salary at the date of disability or the salary paid currently to positions similar to the position which the recipient held at the date of disability, the recipient shall be entitled to a disability benefit from the board in an amount which when added to the compensation for the partial reemployment does not exceed the lower of the recipient's salary at the date of disability or the salary paid currently to positions similar to the position which the recipient held at the date of disability, and does not in any event exceed the disability benefit originally computed pursuant to subdivision 3.\nIf a disability benefit recipient refuses to submit to a medical examination as provided in subdivision 6, then further disability benefit payments from the fund shall be discontinued and all rights of the recipient to a disability benefit shall be revoked by the board.\nAny disability benefit recipient who resumes active teaching service in the district in which the teachers retirement fund association is located shall also resume making employee contributions to the fund pursuant to section 354A.12, subdivision 1.\nNo person shall be entitled to receive both a disability benefit under this section and a retirement annuity under section 354A.31. If a disability benefit recipient remains totally and permanently disabled upon attaining normal retirement age, the disability benefit shall terminate and the former disability benefit recipient shall be deemed to be on retirement status. If the former disability benefit recipient had elected an optional annuity pursuant to subdivision 3a, the recipient shall receive an annuity in accordance with the terms of the optional annuity previously elected, or if the recipient had not elected an optional annuity pursuant to subdivision 3a, the recipient shall be entitled either to receive a retirement annuity in an amount equal to the greater of either a single life retirement annuity calculated pursuant to section 354A.31 or the disability benefit paid to the recipient immediately prior to the recipient's attaining normal retirement age or elect either a single life retirement annuity as provided in this section or an actuarial equivalent optional form retirement annuity as provided in section 354A.32. Election of an optional annuity shall be made prior to the person attaining normal retirement age. If an optional annuity is elected, the election shall be effective on the date on which the person attains the normal retirement age and the optional annuity shall begin to accrue on the first day of the month next following the month in which the person attains normal retirement age.",
	"repealed": false
}