{
	"id": "62K.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.12",
	"title": "62K.12 QUALITY ASSURANCE AND IMPROVEMENT.",
	"text": "(a) All health carriers offering an individual health plan or small group health plan must have a written internal quality assurance and improvement program that, at a minimum:\n(1) provides for ongoing evaluation of the quality of health care provided to its enrollees;\n(2) periodically reports the evaluation of the quality of health care to the health carrier's governing body;\n(3) follows policies and procedures for the selection and credentialing of network providers that is consistent with community standards;\n(4) conducts focused studies directed at problems, potential problems, or areas with potential for improvements in care;\n(5) conducts enrollee satisfaction surveys and monitors oral and written complaints submitted by enrollees or members; and\n(6) collects and reports Health Effectiveness Data and Information Set (HEDIS) measures and conducts other quality assessment and improvement activities as directed by the commissioner of health.\n(b) The commissioner of health shall submit a report to the chairs and ranking minority members of senate and house of representatives committees with primary jurisdiction over commerce and health policy by February 15, 2015, with recommendations for specific quality assurance and improvement standards for all Minnesota health carriers. The recommended standards must not require duplicative data gathering, analysis, or reporting by health carriers.\nA health carrier that rents a provider network is exempt from this section, unless it is part of a holding company as defined in section 60D.15 that in aggregate exceeds ten percent market share in either the individual or small group market in Minnesota.\nA health carrier that has obtained accreditation through the URAC for network management; quality improvement; credentialing; member protection; and utilization management, or has achieved an excellent or commendable level ranking from the National Committee for Quality Assurance (NCQA), shall be deemed to meet the requirements of subdivision 1. Proof of accreditation must be submitted to the commissioner of health in a form prescribed by the commissioner. The commissioner may adopt rules to recognize similar accreditation standards from any entity recognized by the United States Department of Health and Human Services for accreditation of health insurance issuers or health plans.\nThe commissioner of health shall enforce this section.",
	"repealed": false
}