{
	"id": "28A.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.085",
	"title": "28A.085 REINSPECTION FEES.",
	"text": "The commissioner may charge a reinspection fee for each reinspection of a food handler that:\n(1) is found with a major violation of requirements in chapter 28, 29, 30, 31, 31A, 32D, 33, or 34, or rules adopted under one of those chapters; or\n(2) fails to correct equipment and facility deficiencies as required in rules adopted under chapter 28, 29, 30, 31, 31A, 32D, or 34.\nThe first reinspection of a firm with gross food sales under $1,000,000 must be assessed at $150. The fee for a firm with gross food sales over $1,000,000 is $200. The fee for a subsequent reinspection of a firm for the same violation is 50 percent of their current license fee or $300, whichever is greater. The establishment must be issued written notice of violations with a reasonable date for compliance listed on the notice. An initial inspection relating to a complaint is not a reinspection.\nA food handler that requires a reinspection due to adulteration or misbranded foods that result in a food being recalled from commerce may be assessed for reasonable and direct reinspection costs incurred by the commissioner, including personnel, travel, laboratory analysis, and attorney general costs. Reinspection related to floods, earthquakes, storms, accidental fires, and power outages are excluded. The commissioner, upon request of the food handler, shall provide, within a reasonable time, an estimate of the anticipated cost for resolving the food safety emergency.\nUnless an appeal is filed under subdivision 5, a food handler must pay all fees and assessments in the manner and timing requested by the commissioner. If a timely appeal is requested, the fees and assessments are stayed until a decision on the appeal is issued by the hearing officer. A license may not be renewed until all fees and penalties under this chapter are paid.\nA food handler reinspection account is established in the agricultural fund. All reinspection fees and assessments collected must be deposited in the state treasury and are credited to the food handler reinspection account. Money in the account, including interest accrued, is appropriated to the commissioner to pay the expenses relating to reinspections conducted under the chapters listed in subdivision 1.\nFood handlers may appeal reinspection fees and assessments to the department hearing officer within 30 days of receipt of the notice of fee assessment. The appeal must be submitted to the commissioner in writing.",
	"repealed": false
}