{
	"id": "340A.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.301",
	"title": "340A.301 MANUFACTURERS, BREWERS, AND WHOLESALERS LICENSES.",
	"text": "No person may directly or indirectly manufacture or sell at wholesale intoxicating liquor, or 3.2 percent malt liquor without obtaining an appropriate license from the commissioner, except where otherwise provided in this chapter. A manufacturer's license includes the right to import. A licensed brewer may sell the brewer's products at wholesale only if the brewer has been issued a wholesaler's license. The commissioner shall issue a wholesaler's license to a brewer only if (1) the commissioner determines that the brewer was selling the brewer's own products at wholesale in Minnesota on January 1, 1991, or (2) the brewer has acquired a wholesaler's business or assets under subdivision 9, paragraph (c) or (d). A licensed wholesaler of intoxicating malt liquor may sell 3.2 percent malt liquor at wholesale without an additional license.\n(a) Licenses under this section may be issued only to a person who:\n(1) is of good moral character and repute;\n(2) is 21 years of age or older;\n(3) has not had a license issued under this chapter revoked within five years of the date of license application, or to any person who at the time of the violation owns any interest, whether as a holder of more than five percent of the capital stock of a corporation licensee, as a partner or otherwise, in the premises or in the business conducted thereon, or to a corporation, partnership, association, enterprise, business, or firm in which any such person is in any manner interested; and\n(4) has not been convicted within five years of the date of license application of a felony, or of a willful violation of a federal or state law, or local ordinance governing the manufacture, sale, distribution, or possession for sale or distribution of alcoholic beverages. The Alcohol and Gambling Enforcement Division may require that fingerprints be taken and may forward the fingerprints to the Federal Bureau of Investigation for purposes of a criminal history check.\n(b) In order to determine if an individual has a felony or willful violation of federal or state law governing the manufacture, sale, distribution, or possession for sale or distribution of an alcoholic beverage, the applicant for a license to manufacture or sell at wholesale must provide the commissioner with their signed, written informed consent to conduct a background check. The commissioner may query the Minnesota criminal history repository for records on the applicant. If the commissioner conducts a national criminal history record check, the commissioner must obtain fingerprints from the applicant and forward them and the required fee to the superintendent of the Bureau of Criminal Apprehension. The superintendent may exchange the fingerprints with the Federal Bureau of Investigation for purposes of obtaining the applicant's national criminal history record information. The superintendent shall return the results of the national criminal history records check to the commissioner for the purpose of determining if the applicant is qualified to receive a license.\nAn application for a license under this section must be made to the commissioner on a form the commissioner prescribes and must be accompanied by the fee specified in subdivision 6. If an application is denied, $100 of the amount of any fee exceeding that amount shall be retained by the commissioner to cover costs of investigation.\nThe commissioner may not issue a license under this section to a person who has not filed a bond with corporate surety, or cash, or United States government bonds payable to the state. The proof of financial responsibility must be approved by the commissioner before the license is issued. The bond must be conditioned on the licensee obeying all laws governing the business and paying when due all taxes, fees, penalties and other charges, and must provide that it is forfeited to the state on a violation of law. This subdivision does not apply to a Minnesota farm winery, licensed under section 340A.315, that is in existence as of January 1, 2010. Bonds must be in the following amounts:\nLicenses issued under this section are valid for one year except that to coordinate expiration dates initial licenses may be issued for a shorter period.\nThe annual fees for licenses under this section are as follows:\nIf a business licensed under this section is destroyed, or damaged to the extent that it cannot be carried on, or if it ceases because of the death or illness of the licensee, the commissioner may refund the license fee for the balance of the license period to the licensee or to the licensee's estate.\n[Renumbered subd 7]\nMS 2014 [Repealed by amendment, 2015 c 9 art 1 s 7]\nMS 2014 [Repealed by amendment, 2015 c 9 art 1 s 7]\nMS 2014 [Repealed by amendment, 2015 c 9 art 1 s 7]\n[Renumbered subd 8]\nAny person engaged in the purchase, sale, or use for any purpose other than personal consumption of intoxicating alcoholic beverages or ethyl alcohol shall obtain the appropriate regulatory permit and identification card from the commissioner as provided in this subdivision. The fee for each permit, other than one issued to a state or federal agency, is $35 and must be submitted together with the appropriate application form provided by the commissioner. Identification cards and permits must be issued for a period coinciding with that of the appropriate state or municipal license and are not transferable. In instances where there is no annual license period, cards and permits expire one year after the date of issuance. The authority to engage in the purchase, sale, or use granted by the card or permit may be revoked by the commissioner upon evidence of a violation by the holder of such a card or permit of any of the provisions of this chapter or any rule of the commissioner made pursuant to law.\n[Renumbered subd 9]\n[Renumbered subd 10]\n(a) Except as provided in this subdivision, a holder of a license as a manufacturer, brewer, importer, or wholesaler may not have any ownership, in whole or in part, in a business holding a retail intoxicating liquor or 3.2 percent malt liquor license. The commissioner may not issue a license under this section to a manufacturer, brewer, importer, or wholesaler if a retailer of intoxicating liquor has a direct or indirect interest in the manufacturer, brewer, importer, or wholesaler. A manufacturer or wholesaler of intoxicating liquor may use or have property rented for retail intoxicating liquor sales only if the manufacturer or wholesaler has owned the property continuously since November 1, 1933. A retailer of intoxicating liquor may not use or have property rented for the manufacture or wholesaling of intoxicating liquor.\n(b) Except as provided in subdivision 9, no brewer as defined in subdivision 9 or importer may have any interest, in whole or in part, directly or indirectly, in the license, business, assets, or corporate stock of a licensed malt liquor wholesaler.\n(c) A winery holding a license under subdivision 6, paragraph (b), that produces and sells, including sales from the winery's premises, no more than 2,500 barrels or its metric equivalent of cider made from apples in a calendar year may own or have an interest in a wholesaler that sells only the winery's apple-based cider products. The winery eligible to own or have an interest in a wholesaler under this subdivision must provide the commissioner with an affidavit stating that no existing wholesaler is available to represent and distribute the winery's apple-based cider to retail license holders, and detailing the actions taken by the winery in pursuing a distribution contract for the cider product.\n[Renumbered subd 11]\n(a) A brewer may financially assist a wholesaler of malt liquor through participation in a limited partnership in which the brewer is the limited partner and the wholesaler is the general partner. A limited partnership authorized in this paragraph may not exist for more than ten years from the date of its creation, and may not, directly or indirectly, be recreated, renewed, or extended beyond that date.\n(b) A brewer may financially assist a malt liquor wholesaler and collateralize the financing by taking a security interest in the inventory and assets, other than the corporate stock, of the wholesaler. A financial agreement authorized by this paragraph may not be in effect for more than ten years from the date of its creation and may not be directly or indirectly extended or renewed.\n(c) A brewer who, after creation of a financial agreement authorized by paragraph (b), or after creation of a limited partnership authorized in paragraph (a), acquires legal or equitable title to the wholesaler's business which was the subject of the agreement or limited partnership, or to the business assets, must divest the business or its assets within two years of the date of acquiring them. A malt liquor wholesaler whose business or assets are acquired by a brewer as described in this paragraph may not enter into another such financial agreement, or participate in another such limited partnership, for 20 years from the date of the acquisition of the business or assets.\n(d) A brewer may have an interest in the business, assets, or corporate stock of a malt liquor wholesaler as a result of (1) a judgment against the wholesaler arising out of a default by the wholesaler or (2) acquisition of title to the business, assets, or corporate stock as a result of a written request of the wholesaler. A brewer may maintain ownership of or an interest in the business, assets, or corporate stock under this paragraph for not more than two years and only for the purpose of facilitating an orderly transfer of the business to an owner not affiliated with the brewer.\n(e) A brewer may continue to maintain an ownership interest in a malt liquor wholesaler if it owned the interest on January 1, 1991.\n(f) A brewer that was legally selling the brewer's own products at wholesale in Minnesota on January 1, 1991, may continue to sell those products at wholesale in the area where it was selling those products on that date.\n(g) A brewer that manufactures no more than 20,000 barrels of malt liquor or its metric equivalent in a calendar year may own or have an interest in a malt liquor wholesaler that sells only the brewer's products, provided that a brewer that manufactures between 20,000 and 25,000 barrels in any calendar year shall be permitted to continue to own or have an interest in a malt liquor wholesaler that sells only the brewer's products if: (1) that malt liquor wholesaler distributes no more than 20,000 barrels per calendar year; and (2) the brewer has not manufactured 25,000 barrels in any calendar year. Notwithstanding the foregoing, a brewer that manufactured between 20,000 and 25,000 barrels in 2012 shall be permitted to continue to own or have an interest in a malt liquor wholesaler that sells only the brewer's products until that brewer manufactures 25,000 barrels in a calendar year.\n(h) When the commissioner issues a license to a malt liquor wholesaler described in paragraph (a) or (b), the commissioner may issue the license only to the entity which is actually operating the wholesale business and may not issue the license to a brewer that is a limited partner under paragraph (a) or providing financial assistance under paragraph (b) unless the brewer has acquired a wholesaler's business or assets under paragraph (c) or (d).\n(i) For purposes of this subdivision and subdivision 8, paragraph (b), \"brewer\" means:\n(1) a holder of a license to manufacture malt liquor;\n(2) an officer, director, agent, or employee of such a license holder; and\n(3) an affiliate of such a license holder, regardless of whether the affiliation is corporate or by management, direction, or control.\nA licensed brewer or brew pub may without an additional license sell malt liquor to employees or retired former employees, in amounts of not more than 768 fluid ounces in a week for off-premise consumption only. A collector of commemorative bottles, those terms are as defined in section 297G.01, subdivisions 4 and 5, may sell them to another collector without a license. It is also lawful for a collector of beer cans to sell unopened cans of a brand which has not been sold commercially for at least two years to another collector without obtaining a license. The amount sold to any one collector in any one month shall not exceed 768 fluid ounces. A licensed manufacturer of wine containing not more than 25 percent alcohol by volume nor less than 51 percent wine made from Minnesota-grown agricultural products may sell at on-sale or off-sale wine made on the licensed premises without a further license.\n(a) Nothing in this chapter requires a license for the natural fermentation of fruit juices or brewing of beer in the home for family use.\n(b) Naturally fermented fruit juices or beer made under this subdivision may be removed from the premises where made for use at organized affairs, exhibitions, or competitions, including, but not limited to, homemaker's contests, tastings, or judging.\n(c) For purposes of this subdivision, \"tastings\" means an event where the general public may sample unlicensed naturally fermented fruit juices or beer.\n(d) Beverages produced pursuant to this subdivision may be sampled or used in tastings provided that the beverage is made and transported in containers and equipment that shall not allow the migration of toxic substances.\n(e) Public notice meeting the requirements of this paragraph must be given in writing or signage at any tasting. The notice shall include disclosure that the unlicensed naturally fermented fruit juices or beer being offered is homemade and not subject to state inspection, and may be consumed by persons over the age of 21 at their own risk. The notice must include the name and address of the person who processed and bottled the beverage.\n(f) Naturally fermented fruit juices or beer removed under this subdivision may not be sold or offered for sale.\n3.2 percent malt liquor, as defined under section 340A.101, subdivision 19, may be sold with a label that states \"MAX 3.2% ALC/WT\" or equivalent, on the side of the can or bottle, and does not require a similar disclosure on the can top or bottom. The commissioner shall establish standards to implement this requirement.",
	"repealed": false
}