{
	"id": "124D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.03",
	"title": "124D.03 ENROLLMENT OPTIONS PROGRAM.",
	"text": "(a) An enrollment options program is established to enable any pupil to attend a school or program in a district in which the pupil does not reside, subject to the limitations in this section.\n(b) A district may refuse to allow a pupil who is expelled under section 121A.45 to enroll during the term of the expulsion if the student was expelled for:\n(1) possessing a dangerous weapon, as defined by United States Code, title 18, section 930, paragraph (g)(2), at school or a school function;\n(2) possessing or using an illegal drug at school or a school function;\n(3) selling or soliciting the sale of a controlled substance while at school or a school function; or\n(4) committing a third-degree assault as described in section 609.223, subdivision 1.\n(a) A board may, by resolution, limit the enrollment of nonresident pupils in its schools or programs according to this section to a number not less than the lesser of:\n(1) one percent of the total enrollment at each grade level in the district; or\n(2) the number of district residents at that grade level enrolled in a nonresident district according to this section.\n(b) A district that limits enrollment of nonresident pupils under paragraph (a) shall report to the commissioner by July 15 on the number of nonresident pupils denied admission due to the limitations on the enrollment of nonresident pupils.\n(a) In order that a pupil may attend a school or program in a nonresident district, the pupil's parent or guardian must submit an application to the nonresident district. The pupil's application must identify a reason for enrolling in the nonresident district. The parent or guardian of a pupil must submit a signed application by January 15 for initial enrollment beginning the following school year. The application must be on a form provided by the Department of Education. A particular school or program may be requested by the parent. Once enrolled in a nonresident district, the pupil may remain enrolled and is not required to submit annual or periodic applications. If the student moves to a new resident district, the student retains the seat in the nonresident district, but must submit a new enrollment options form to update the student's information. To return to the resident district or to transfer to a different nonresident district, the parent or guardian of the pupil must provide notice to the resident district or apply to a different nonresident district by January 15 for enrollment beginning the following school year.\n(b) A school district may require a nonresident student enrolled in a program under section 125A.13, or in a preschool program, except for a program under section 142D.07 or 142D.08, to follow the application procedures under this subdivision to enroll in kindergarten. A district must allow a nonresident student enrolled in a program under section 142D.07 or 142D.08 to remain enrolled in the district when the student enters kindergarten without submitting annual or periodic applications, unless the district terminates the student's enrollment under subdivision 12.\n(a) This subdivision applies to a transfer into or out of a district that has an achievement and integration plan approved by the commissioner of education under sections 124D.861 and 124D.862.\n(b) An application to transfer may be submitted at any time for enrollment beginning at any time.\n(c) A pupil enrolled in a nonresident district under an achievement and integration plan approved by the commissioner of education is not required to make annual or periodic application for enrollment but may remain enrolled in the same district. A pupil may transfer to the resident district at any time.\n(d) Subdivision 2 applies to a transfer into or out of a district with an achievement and integration plan.\nA district shall notify the parent or guardian in writing by February 15 or within 90 days for applications submitted after January 15 in the case of achievement and integration district transfers whether the application has been accepted or rejected. If an application is rejected, the district must state in the notification the reason for rejection. The parent or guardian must notify the nonresident district by March 1 or within ten business days whether the pupil intends to enroll in the nonresident district. Notice of intent to enroll in the nonresident district obligates the pupil to attend the nonresident district during the following school year, unless the boards of the resident and the nonresident districts agree in writing to allow the pupil to transfer back to the resident district. If the pupil's parents or guardians change residence to another district, the student does not lose the seat in the nonresident district but the parent or guardian must complete an updated enrollment options form. If a parent or guardian does not notify the nonresident district by the January 15 deadline, if it applies, the pupil may not enroll in that nonresident district during the following school year, unless the boards of the resident and nonresident district agree otherwise. The nonresident district must notify the resident district by March 15 or 30 days later of the pupil's intent to enroll in the nonresident district. The same procedures apply to a pupil who applies to transfer from one participating nonresident district to another participating nonresident district.\nIf a school district has more applications than available seats at a specific grade level, it must hold an impartial lottery following the January 15 deadline to determine which students will receive seats. The district must give priority to enrolling siblings of currently enrolled students, students whose applications are related to an approved integration and achievement plan, children of the school district's staff, and students residing in that part of a municipality, defined under section 469.1812, subdivision 3, where:\n(1) the student's resident district does not operate a school building;\n(2) the municipality is located partially or fully within the boundaries of at least five school districts;\n(3) the nonresident district in which the student seeks to enroll operates one or more school buildings within the municipality; and\n(4) no other nonresident, independent, special, or common school district operates a school building within the municipality.\nThe process for the school district lottery must be established in school district policy, approved by the school board, and posted on the school district's website.\nThe board must adopt, by resolution, specific standards for acceptance and rejection of applications. Standards may include the capacity of a program, excluding special education services; class; or school building. The school board may not reject applications for enrollment in a particular grade level if the nonresident enrollment at that grade level does not exceed the limit set by the board under subdivision 2. Standards may not include previous academic achievement, athletic or other extracurricular ability, disabling conditions, proficiency in the English language, previous disciplinary proceedings, or the student's district of residence, except where the district of residence is directly included in an enrollment options strategy included in an approved achievement and integration program.\nNotwithstanding subdivision 3, the following pupil application procedures apply:\n(a) Upon agreement of the resident and nonresident districts, a pupil may submit an application to a nonresident district after January 15 for enrollment beginning the following school year.\n(b) If, as a result of entering into, modifying, or terminating an agreement between boards, a pupil is assigned after December 1 to a different school for enrollment beginning at any time, the pupil, the pupil's siblings, or any other pupil residing in the pupil's residence may submit an application to a nonresident district at any time before July 1 for enrollment beginning the following school year.\n(c) A pupil who becomes a resident of a district after December 1 may submit an application to a nonresident district on January 15 or any time after that date for enrollment beginning any time before the following December 1.\n(d) If the commissioner of education and the commissioner of human rights determine that the policies, procedures, or practices of a district are in violation of Title VI of the Civil Rights Act of 1964 (Public Law 88-352) or chapter 363A, any pupil in the district may submit an application to a nonresident district at any time for enrollment beginning at any time.\nFor exceptions under this subdivision, the applicant, the applicant's parent or guardian, the district of residence, and the district of attendance must observe, in a prompt and efficient manner, the application and notice procedures in subdivisions 3 and 5, except that the application and notice deadlines do not apply.\nIf requested by the parent of a pupil, the nonresident district shall provide transportation within the district.\nThe resident district is not required to provide or pay for transportation between the pupil's residence and the border of the nonresident district. A parent may be reimbursed by the nonresident district for the costs of transportation from the pupil's residence to the border of the nonresident district if the pupil is from a family whose income is at or below the poverty level, as determined by the federal government. The reimbursement may not exceed the pupil's actual cost of transportation or 15 cents per mile traveled, whichever is less. Reimbursement may not be paid for more than 250 miles per week.\nAt the time a nonresident district notifies a parent or guardian that an application has been accepted under subdivision 4 or 5, the nonresident district must provide the parent or guardian with the following information regarding the transportation of nonresident pupils under section 123B.88, subdivision 6.\nA nonresident district shall accept credits toward graduation that were awarded by another district. The nonresident district shall award a diploma to a nonresident pupil if the pupil meets its graduation requirements.\nA district shall make information about the district, schools, programs, policies, and procedures available to all interested people.\nAdjustments to general education aid for the resident and nonresident districts shall be made according to section 127A.47, subdivision 7.\nA district may terminate the enrollment of a nonresident student enrolled under this section or section 124D.08 at the end of a school year if the student meets the definition of a habitual truant under section 260C.007, subdivision 19, the student has been provided appropriate services under chapter 260A, and the student's case has been referred to juvenile court. A district may also terminate the enrollment of a nonresident student over the age of 17 enrolled under this section if the student is absent without lawful excuse for one or more periods on 15 school days and has not lawfully withdrawn from school under section 120A.22, subdivision 8.",
	"repealed": false
}