{
	"id": "453A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/453A.02",
	"title": "453A.02 DEFINITIONS.",
	"text": "The terms defined in this section have the following meanings whenever used in sections 453A.01 to 453A.12 unless the context requires otherwise.\n\"Agency agreement\" means the written agreement between or among two or more cities establishing a municipal gas agency.\n\"City\" means a city organized and existing under the laws of Minnesota or a city charter adopted pursuant thereto, and authorized by such laws or charter to engage in the local distribution and sale of gas, provided that any city so engaged on January 1, 1979 is authorized to continue such distribution and sale, and every city now or hereafter so authorized may exercise, either individually or as a member of a municipal gas agency, all of the powers granted in sections 453A.01 to 453A.12.\nCity also includes a city organized and existing under the laws of another state or a city charter adopted pursuant thereto which participates in a municipal gas agency with Minnesota cities.\n\"City council\" means the city council or other similar board, commission or body within a city which is charged by law or its charter with the general control of the city's governmental affairs.\n\"Gas\" means either natural or synthetic gas, including propane, manufactured, methane from coal beds, geothermal gas, or any mixture thereof, whether in gaseous or liquid form, or any by-product resulting therefrom.\n\"Exploration\" means the processes, properties, activities and facilities used for the discovery of deposits of gas and the study and implementation of enhanced gas recovery methods.\n\"Production\" means the physical activities, processes, properties and facilities for development, manufacture, synthesis, production, coal gasification, extraction, gathering or storage of gas or conversion of one form of gas to another.\n\"Transmission\" means the transfer of gas from its acquisition site to, between or among cities or municipal gas agencies or other persons with whom they may contract, but does not include distribution, except where incidental or necessary to transmission.\n\"Storage\" means any process, properties, activities or facilities used to hold, store or maintain gas.\n\"Distribution\" means the conveyance of gas to the end users.\n\"Governing body,\" with respect to a city, means the city council or, if another board, commission, or body is empowered by law or its charter or by resolution of the city council to establish and regulate rates and charges for the distribution of gas within the city, such board, commission, or body shall be deemed to be the \"governing body\"; provided, however, that when the levy of a tax or the incurring of an obligation payable from taxes or any other action of such board, commission, or body requires the concurrence, approval, or independent action of the city council or another body under the city's charter or any other law, such action shall not be exercised under sections 453A.01 to 453A.12 until such concurrence or approval is received or such independent action is taken; and provided further, that the concurrence of the city council or other elected body charged with the general management of a city shall be required, prior to the adoption by the city of any resolution approving an agency agreement or any amendment thereto.\n\"Municipal gas agency\" means a separate political subdivision and municipal corporation created by agreement between or among two or more cities pursuant to section 453A.03 to exercise any of the powers of acquisition, construction, reconstruction, operation, repair, extension, or improvement of exploration, production, storage and transmission projects or the acquisition of any interest therein or any right to part or all of the capacity or use thereof.\n\"Person\" means a natural person, a public agency, or a private corporation, firm, partnership, cooperative association, or business trust of any nature whatsoever, organized and existing under the laws of any state, of the United States or of any other country or political subdivision thereof and shall also include other countries and their political subdivisions, departments, agencies and instrumentalities.\n\"Project\" means any plant, works, system, facilities, and real and personal property of any nature whatsoever, together with all parts thereof and appurtenances thereto, used or useful in the exploration, production, storage, transmission, purchase, sale, exchange, or interchange of gas or any interest therein or capacity or use thereof.\n\"Public agency\" means any city or other municipal corporation, political subdivision, governmental unit, or public corporation created by or pursuant to the laws of this state or of another state or of the United States; and any state or the United States, and any person, board, or other body declared by the laws of any state or the United States to be a department, agency, or instrumentality thereof.\n\"Real property\" means lands, mineral rights, structures, franchises, and interests in land, including but not limited to lands under water, riparian rights, fees simple absolute, lesser interests such as easements, rights-of-way, uses, leases, licenses, and all other incorporeal hereditaments, legal and equitable estates, interests, and rights, including rights to minerals, fuel and water, terms of years, liens on real property by way of judgments, mortgages, or otherwise, and claims for damage to real property.",
	"repealed": false
}