{
	"id": "161.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.36",
	"title": "161.36 FEDERAL AID.",
	"text": "The commissioner may cooperate with the government of the United States and any agency or department thereof in the construction, improvement, enhancement, and maintenance of transportation in the state of Minnesota and may comply with the provisions of the laws of the United States and any regulations made thereunder for the expenditure of federal moneys.\nThe commissioner may accept federal moneys and other moneys, either public or private, for and in behalf of the state of Minnesota or any governmental subdivision thereof, or any nonpublic organization, for the construction, improvement, enhancement, or maintenance of transportation upon such terms and conditions as are or may be prescribed by the laws of the United States and any regulations made thereunder, and is authorized to act as an agent of that governmental subdivision or nonpublic organization upon its request in accepting the moneys in its behalf for transportation purposes, in acquiring right-of-way therefor, and in contracting for the construction, improvement, enhancement, or maintenance of transportation financed either in whole or in part by federal moneys. The governing body of any such subdivision or nonpublic organization is authorized to designate the commissioner as its agent for such purposes and to enter into an agreement with the commissioner prescribing the terms and conditions of the agency in accordance herewith and with federal laws and regulations.\nThe commissioner may act as the agent of any political subdivision of the state, or any nonpublic organization, as provided herein, for the construction of transportation toward the construction of which no federal aid is available in the event that the construction adjoins, is connected, or in the judgment of the commissioner can be best and most economically performed in connection with construction upon which federal aid is available and upon which the commissioner is then acting as agent.\nAll contracts for the construction, improvement, enhancement, or maintenance of transportation made by the commissioner as the agent of any governmental subdivision, or any nonpublic organization, shall be made pursuant to the laws of Minnesota governing the making of contracts for the construction, improvement, enhancement, and maintenance of transportation on the trunk highway system of the state; provided, where the construction, improvement, enhancement, or maintenance of any transportation is financed wholly with federal moneys, the commissioner as the agent of the governmental subdivision or nonpublic organization may let contracts in the manner prescribed by the federal authorities acting under the laws of the United States and any regulations made thereunder, notwithstanding any state law to the contrary.\nAll funds accepted for disbursement by the commissioner pursuant to this section shall be deposited in the state treasury and, unless otherwise prescribed by the authority from which the funds are received, kept in separate accounts designated according to the purposes for which the funds were made available and held by the state in trust for those purposes. All funds are appropriated for the purposes for which the funds are made available to be expended in accordance with this section and with federal laws and regulations. The commissioner may, whether acting for the state of Minnesota or as the agent of any of its governmental subdivisions or when requested by the United States government or any agency or department of the United States government, disburse funds for the designated purposes, but this shall not preclude any other authorized method of disbursement. For the purpose of providing sufficient funds in the accounts established pursuant to this subdivision to meet expenditure requirements occurring before federal or other public or private reimbursements, the commissioner of management and budget, at the request of the commissioner, may borrow from available balances of the county state-aid highway fund or the municipal state-aid street fund. The terms and conditions of any loans shall be determined by the commissioner of management and budget. The amount borrowed shall not exceed in the aggregate the amount of federal aid allotted to the construction of roads and bridges under the jurisdiction of governmental subdivisions and under project appropriation by the federal government. When there is sufficient money in the account that received the loan, the commissioner of management and budget shall transfer from that account to the other public fund the amount so loaned.\nNothing in this section shall be construed as creating any personal liability upon the commissioner or in any way authorizing the commissioner to create any liability on the part of the state of Minnesota when acting as the agent of any governmental subdivision thereof, or when acting at the request of the United States.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]",
	"repealed": false
}