{
	"id": "297A.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.71",
	"title": "297A.71 CONSTRUCTION EXEMPTIONS.",
	"text": "The gross receipts from the sale of, and storage, distribution, use, or consumption of the tangible personal property contained in this section are specifically exempted from the taxes imposed by this chapter. Building materials, equipment, and supplies and other items exempt under this section are exempt regardless of whether purchased by the owner or a contractor, subcontractor, or builder.\n[Repealed, 1Sp2001 c 5 art 12 s 95]\nBuilding materials and supplies for constructing or improving an adult or juvenile correctional facility by a county, home rule charter city, or statutory city are exempt if the project is mandated by state or federal law, rule, or regulation. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2014 c 308 art 9 s 94]\nBuilding materials and supplies for construction of a facility that includes a business incubator and industrial park are exempt if the facility:\n(1) is owned and operated by a nonprofit charitable organization that qualifies for tax exemption under section 501(c)(3) of the Internal Revenue Code;\n(2) is used for the development of nonretail businesses, offering access to equipment, space, services, and advice to the tenant businesses, for the purpose of encouraging economic development and job creation in the area served by the organization, and emphasizes development of businesses that manufacture products from materials found in the waste stream, or manufacture alternative energy and conservation systems, or make use of emerging environmental technologies;\n(3) includes in its structure systems of material and energy exchanges that use waste products from one industrial process as sources of energy and material for other processes; and\n(4) makes use of solar and wind energy technology and incorporates salvaged materials in its construction.\nA limited liability company also qualifies for exemption under this subdivision if (1) it consists of a sole member that would qualify for the exemption, and (2) the items purchased qualify for the exemption.\n[Repealed, 2014 c 308 art 9 s 94]\nBuilding materials and supplies for constructing, equipping, or modifying a district heating and cooling system cogeneration facility are exempt if the facility:\n(1) utilizes wood waste as a primary fuel source; and\n(2) satisfies the requirements of the biomass mandate in section 216B.2424, subdivision 5.\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2014 c 308 art 9 s 94]\nBuilding materials to be used in the construction or remodeling of a residence are exempt when the construction or remodeling is financed in whole or in part by the United States in accordance with United States Code, title 38, sections 2101 to 2105. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\nElevators and building materials used to install or construct chair lifts, ramps, and elevators are exempt, if they are authorized by a physician and installed in or attached to the owner's homestead. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\nBuilding materials and supplies for constructing an agriculture processing facility as defined in section 469.1811 in which the total capital investment in the processing facility is expected to exceed $100,000,000 are exempt. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied, and then refunded in the manner provided in section 297A.75.\nBuilding materials, equipment, and supplies used for the construction of the following mineral production facilities are exempt.\nThe mineral production facilities that qualify for this exemption are:\n(1) a value added iron products plant, which may be either a new plant or a facility incorporated into an existing plant that produces iron upgraded to a minimum of 75 percent iron content or any iron alloy with a total minimum metallic content of 90 percent;\n(2) a facility used for the manufacture of fluxed taconite pellets as defined in section 298.24;\n(3) a new capital project that has a total cost of over $40,000,000 that is directly related to production, cost, or quality at an existing taconite facility that does not qualify under clause (1) or (2); and\n(4) a new mine or minerals processing plant for any mineral subject to the gross proceeds tax imposed under section 298.015.\nThe tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied, and then refunded in the manner provided in section 297A.75.\n[Repealed, 1Sp2001 c 5 art 12 s 95]\n[Repealed, 1Sp2001 c 5 art 12 s 9; 2002 c 377 art 3 s 24]\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2014 c 308 art 9 s 94]\nMS 2006 [Expired]\n[Repealed, 2014 c 308 art 9 s 94]\nMS 2004 [Expired]\nBuilding materials and equipment sold to, or stored, used, or consumed by, a nonprofit organization are exempt if:\n(1) the materials and equipment are used or incorporated into modifying an existing residential structure to make it accessible to persons with a disability; and\n(2) the materials and equipment used in the modification would qualify for an exemption under either subdivision 11 or 12 if made by the current owner of the residence.\nFor purposes of this subdivision, \"nonprofit organization\" means any nonprofit corporation, society, association, foundation, or institution organized and operated exclusively for charitable, religious, educational, or civic purposes; or a veterans' group exempt from federal taxation under section 501(c), clause (19), of the Internal Revenue Code.\n(a) Purchases of materials and supplies used or consumed in and equipment incorporated into the construction, improvement, or expansion of qualified low-income housing projects are exempt from the tax imposed under this chapter if the owner of the qualified low-income housing project is:\n(1) the public housing agency or housing and redevelopment authority of a political subdivision;\n(2) an entity exercising the powers of a housing and redevelopment authority within a political subdivision;\n(3) a limited partnership in which the sole or managing general partner is an authority under clause (1) or an entity under clause (2), (4), or (5);\n(4) a nonprofit corporation subject to the provisions of chapter 317A, and qualifying under section 501(c)(3) or 501(c)(4) of the Internal Revenue Code of 1986, as amended;\n(5) a limited liability company if it consists of a sole member that is an entity under clause (4); or\n(6) an owner entity, as defined in Code of Federal Regulations, title 24, part 941.604, for a qualified low-income housing project described in paragraph (b), clause (5).\nThis exemption applies regardless of whether the purchases are made by the owner of the facility or a contractor.\n(b) For purposes of this exemption, \"qualified low-income housing project\" means:\n(1) a housing or mixed use project in which at least 20 percent of the residential units are qualifying low-income rental housing units as defined in section 273.128;\n(2) a federally assisted low-income housing project financed by a mortgage insured or held by the United States Department of Housing and Urban Development under United States Code, title 12, section 1701s, 1715l(d)(3), 1715l(d)(4), or 1715z-1; United States Code, title 42, section 1437f; the Native American Housing Assistance and Self-Determination Act, United States Code, title 25, section 4101 et seq.; or any similar successor federal low-income housing program;\n(3) a qualified low-income housing project as defined in United States Code, title 26, section 42(g), meeting all of the requirements for a low-income housing credit under section 42 of the Internal Revenue Code regardless of whether the project actually applies for or receives a low-income housing credit;\n(4) a project that will be operated in compliance with Internal Revenue Service revenue procedure 96-32; or\n(5) a housing or mixed use project in which all or a portion of the residential units are subject to the requirements of section 5 of the United States Housing Act of 1937.\n(c) For a project, a portion of which is not used for low-income housing units, the amount of purchases that are exempt under this subdivision must be determined by multiplying the total purchases, as specified in paragraph (a), by the ratio of:\n(1) the total gross square footage of units subject to the income limits under section 273.128, the financing for the project, the federal low-income housing tax credit, revenue procedure 96-32, or section 5 of the United States Housing Act of 1937, as applicable to the project; and\n(2) the total gross square footage of all units in the project.\n(d) The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied, and then refunded in the manner provided in section 297A.75.\n[Expired]\nMS 2006 [Expired]\n[Expired]\n[Expired]\n[Expired]\n[Expired]\nMS 2006 [Expired]\n[Repealed, 2006 c 257 s 23]\n[Repealed, 2014 c 308 art 9 s 94]\nMS 2008 [Expired, 2005 1Sp2003 art 5 s 14; 2006 c 259 art 3 s 5]\nMaterials and supplies used or consumed in, and equipment incorporated into, the construction, improvement, or expansion of a waste-to-energy resource recovery facility are exempt if the facility uses biomass or mixed municipal solid waste as a primary fuel to generate steam or electricity.\nMaterials and supplies used or consumed in, and equipment incorporated into, the construction, improvement, or expansion of electric generation and related facilities used pursuant to a joint power purchase agreement to meet the biomass energy mandate in section 216B.2424 are exempt if the owner or owners of the facilities are a municipal electric utility or utilities or a joint venture of municipal electric utilities. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded under section 297A.75.\nMS 2006 [Expired]\nMS 2008 [Expired, 2006 c 247 s 12]\nMS 2012 [Expired]\nMS 2008 [Expired, 2006 c 259 art 3 s 2; 2010 c 389 art 4 s 7]\nMaterials and supplies used or consumed in, and equipment incorporated into, the construction or improvement of the Central Corridor light rail transit line and associated facilities including, but not limited to, stations, park-and-ride facilities, and maintenance facilities, are exempt. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75. Refunds must not be applied for or issued until after July 1, 2009.\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2016 c 158 art 1 s 215]\nMS 2020 [Expired, 2012 c 299 art 1 s 6]\n(a) Materials and supplies used or consumed in and equipment incorporated into the construction or improvement of a capital project funded partially or wholly under section 297A.9905 are exempt, provided that the project has a total construction cost of at least $40,000,000 within a 24-month period.\n(b) Materials and supplies used or consumed in and equipment incorporated into the construction, remodeling, expansion, or improvement of an ice arena or other buildings or facilities owned and operated by the city of Plymouth are exempt. For purposes of this paragraph, \"facilities\" include municipal streets and facilities associated with streets including but not limited to lighting, curbs and gutters, and sidewalks. The total amount of refund on all building materials, supplies, and equipment that the city may apply for under this paragraph is $2,500,000.\n(c) The tax on purchases exempt under paragraph (a) and paragraph (b) must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\nMS 2022 [Repealed, 2024 c 85 s 115]\n[Repealed, 2016 c 158 art 1 s 215]\n[Repealed, 2016 c 158 art 1 s 215]\nMaterials and supplies used in, and equipment incorporated into, the construction and improvement of publicly owned buildings and infrastructure included in the development plan adopted under section 469.43, and financed with public funds, are exempt.\n[See Note.]\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\n(a) Building materials and supplies used in, and equipment incorporated into, the construction or replacement of real property that is located in Melrose affected by the fire on September 8, 2016, are exempt.\n(b) For sales and purchases made for the periods of (1) after September 30, 2016, and before July 1, 2017, and (2) after December 31, 2018, and before July 1, 2019, the tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n[See Note.]\n(a) Building materials and supplies used or consumed in, and equipment incorporated into, the construction or replacement of real property affected by, and capital equipment to replace equipment destroyed in, the fire on March 11, 2018, in the city of Mazeppa are exempt. The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75. For purposes of this subdivision, \"capital equipment\" includes durable equipment used in a restaurant for food storage, preparation, and serving.\n(b) The exemption under this subdivision applies to sales and purchases made after March 11, 2018, and before January 1, 2025. Notwithstanding section 289A.40, a claim for refund may be filed until June 1, 2028.\n(a) Materials and supplies used in and equipment incorporated into the construction, reconstruction, upgrade, expansion, or remodeling of the following local government owned facilities are exempt:\n(1) a new fire station, which includes firefighting, emergency management, public safety training, and other public safety facilities in the city of Monticello if materials, supplies, and equipment are purchased after January 31, 2019, and before January 1, 2022;\n(2) a new fire station, which includes firefighting and public safety training facilities and public safety facilities, in the city of Inver Grove Heights if materials, supplies, and equipment are purchased after June 30, 2018, and before January 1, 2021;\n(3) a fire station and police station, including access roads, lighting, sidewalks, and utility components, on or adjacent to the property on which the fire station or police station are located that are necessary for safe access to and use of those buildings, in the city of Minnetonka if materials, supplies, and equipment are purchased after May 23, 2019, and before January 1, 2022;\n(4) the school building in Independent School District No. 414, Minneota, if materials, supplies, and equipment are purchased after January 1, 2018, and before January 1, 2021;\n(5) a fire station in the city of Mendota Heights, if materials, supplies, and equipment are purchased after December 31, 2018, and before January 1, 2021; and\n(6) a Dakota County law enforcement collaboration center, also known as the Safety and Mental Health Alternative Response Training (SMART) Center, if materials, supplies, and equipment are purchased after June 30, 2019, and before July 1, 2021.\n(b) The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n(c) The total refund for the project listed in paragraph (a), clause (3), must not exceed $850,000.\n(a) Materials and supplies used or consumed in and equipment incorporated into the construction, remodeling, expansion, or improvement of a fire station or police station, including related facilities, owned and operated by a local government, as defined in section 297A.70, subdivision 2, paragraph (d), are exempt.\n(b) For purposes of this subdivision, \"related facilities\" includes access roads, lighting, sidewalks, and utility components on or adjacent to the property on which the fire station or police station is located that are necessary for safe access to and use of those buildings.\n(c) The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n(a) Materials and supplies used or consumed in and equipment incorporated into the construction, reconstruction, or improvement of a facility located in Minnesota that produces or blends sustainable aviation fuel, as defined in section 41A.30, subdivision 1, is exempt.\n(b) The tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner as provided for projects under section 297A.75, subdivision 1, clause (1).\n(c) For a project, a portion of which is not used to produce or blend sustainable aviation fuel, the amount of purchases that are exempt under this subdivision must be determined by multiplying the total purchases, as specified in paragraph (a), by the ratio of:\n(1) the capacity to generate sustainable aviation fuel either through production or blending; and\n(2) the capacity to generate all fuels.\n(d) This subdivision expires July 1, 2034. The expiration does not affect refunds due for sales and purchases made prior to July 1, 2034.\n[See Note.]",
	"repealed": false
}