{
	"id": "559.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/559.17",
	"title": "559.17 MORTGAGE NOT A CONVEYANCE; MORTGAGEE CANNOT POSSESS.",
	"text": "A mortgage of real property is not to be deemed a conveyance, so as to enable the owner of the mortgage to recover possession of the real property without a foreclosure, except as permitted in subdivision 2. The enforcement of an assignment of rents of the type described in subdivision 2 shall not be deemed prohibited by this subdivision, nor because a foreclosure sale under the mortgage has extinguished all or part of the mortgage debt.\nA mortgagor may assign, as additional security for the debt secured by the mortgage, the rents and profits from the mortgaged real property, if the mortgage:\n(1) was executed, modified or amended subsequent to August 1, 1977;\n(2) secured an original principal amount of $100,000 or more or is a lien upon residential real estate containing more than four dwelling units; and\n(3) is not a lien upon property which was:\n(i) entirely homesteaded as agricultural property; or\n(ii) residential real estate containing four or fewer dwelling units where at least one of the units is homesteaded. The assignment may be enforced, but only against the nonhomestead portion of the mortgaged property, as follows:\n(a) if, by the terms of an assignment, a receiver is to be appointed upon the occurrence of some specified event, and a showing is made that the event has occurred, the court shall, without regard to waste, adequacy of the security, or solvency of the mortgagor, appoint a receiver who shall, with respect to the excess cash remaining after application as provided in section 576.25, subdivision 5, apply it as prescribed by the assignment. If the assignment so provides, the receiver shall apply the excess cash in the manner set out herein from the date of appointment through the entire redemption period from any foreclosure sale. Subject to the terms of the assignment, the receiver shall have the powers and duties as set forth in section 576.25, subdivision 5; or\n(b) if no provision is made for the appointment of a receiver in the assignment or if by the terms of the assignment a receiver may be appointed, the assignment shall be binding upon the assignor unless or until a receiver is appointed without regard to waste, adequacy of the security or solvency of the mortgagor, but only in the event of default in the terms and conditions of the mortgage, and only in the event the assignment requires the holder thereof to apply the rents and profits received as provided in section 576.25, subdivision 5, or, as to an assignment executed prior to August 1, 2012, as provided in Minnesota Statutes 2010, section 576.01, subdivision 2, in which case the same shall operate against and be binding upon the occupiers of the premises from the date of recording by the holder of the assignment in the office of the county recorder or the office of the registrar of titles for the county in which the property is located of a notice of default in the terms and conditions of the mortgage and service of a copy of the notice upon the occupiers of the premises. The holder of the assignment shall apply the rents and profits received in accordance with the terms of the assignment, and, if the assignment so provides, for the entire redemption period from any foreclosure sale. A holder of an assignment who enforces it in accordance with this clause shall not be deemed to be a mortgagee in possession with attendant liability.\nNothing contained herein shall prohibit the right to reinstate the mortgage debt granted pursuant to section 580.30, nor the right to redeem granted pursuant to sections 580.23 and 581.10, and any excess cash, as that term is used herein, collected by the receiver under clause (a), or any rents and profits taken by the holder of the assignment under clause (b), shall be credited to the amount required to be paid to effect a reinstatement or redemption.\n(a) An assignment of rents and profits under this section, whether in the mortgage or in a separate instrument, shall expire:\n(1) with respect to the rents and profits from all of the mortgaged property, when an action or proceeding to foreclose the mortgage is barred by section 541.03, or upon recording in the office of the county recorder or in the office of the registrar of titles of the county where the mortgaged property is located, of a satisfaction of the mortgage or a certificate of release complying with section 507.401 in lieu of a satisfaction of the mortgage; or\n(2) with respect to the rents and profits from a portion of the mortgaged property, upon recording in the office of the county recorder or the registrar of titles of the county where that portion of the mortgaged property is located, of a release of that portion of the mortgaged property from the lien of the mortgage, or a certificate of release complying with section 507.401 in lieu of a release of that portion of the mortgaged property.\nNo separate reassignment of the rents and profits or satisfaction or release of the assignment is required.\n(b) An assignment of a mortgage, whether or not the mortgage mentions an assignment of rents and profits, is sufficient to assign both the mortgage and the assignment of rents and profits permitted by this subdivision which secures the debt secured by the mortgage, and no separate assignment of the assignment of rents and profits shall be required.",
	"repealed": false
}