{
	"id": "473.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.25",
	"title": "473.25 LIVABLE COMMUNITIES CRITERIA AND GUIDELINES.",
	"text": "(a) The council shall establish criteria for uses of the fund provided in section 473.251 that are consistent with and promote the purposes of this article and the policies of the Metropolitan Development Guide adopted by the council including, but not limited to:\n(1) helping to change long-term market incentives that adversely impact creation and preservation of living-wage jobs in the fully developed area;\n(2) creating incentives for developing communities to include a full range of housing opportunities;\n(3) creating incentives to preserve and rehabilitate affordable housing in the fully developed area; and\n(4) creating incentives for all communities to implement compact and efficient development.\n(b) The council shall establish guidelines for the livable community demonstration account for projects that the council would consider funding with either grants or loans. The guidelines must provide that the projects will:\n(1) interrelate development or redevelopment and transit;\n(2) interrelate affordable housing and employment growth areas;\n(3) intensify land use that leads to more compact development or redevelopment;\n(4) involve development or redevelopment that mixes incomes of residents in housing, including introducing or reintroducing higher value housing in lower income areas to achieve a mix of housing opportunities; or\n(5) encourage public infrastructure investments which connect urban neighborhoods and suburban communities, attract private sector redevelopment investment in commercial and residential properties adjacent to the public improvement, and provide project area residents with expanded opportunities for private sector employment.\n(c) The council shall establish guidelines governing who may apply for a grant or loan from the fund, providing priority for proposals using innovative partnerships between government, private for-profit, and nonprofit sectors.\n(d) The council shall prepare an annual plan for distribution of the fund based on the criteria for project and applicant selection.\n(e) The council shall prepare and submit to the legislature, as provided in section 3.195, an annual report on the metropolitan livable communities fund. The report must include information on the amount of money in the fund, the amount distributed, to whom the funds were distributed and for what purposes, and an evaluation of the effectiveness of the projects funded in meeting the policies and goals of the council. The report may make recommendations to the legislature on changes to Laws 1995, chapter 255.",
	"repealed": false
}