{
	"id": "308C.602",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.602",
	"title": "308C.602 TITLE TO MEMBERSHIP IN THE COOPERATIVE.",
	"text": "(a) Title to membership in a cooperative governed by this chapter may be held by:\n(1) a natural person who satisfies the member restrictions set forth in this chapter;\n(2) a natural person who does not satisfy the restrictions set forth in this chapter but who purchases a membership interest for a natural person who satisfies the restrictions set forth in this chapter and who is a member of the cooperative and shall, for purposes of this section, be referred to as a \"third-party purchaser\";\n(3) a natural person who is the trustee of a trust, except as prohibited, limited, or otherwise provided by the cooperative. If title to a membership interest is held by a trustee of a trust, a beneficiary of the trust must be a natural person who satisfies the restriction set forth in this chapter and who exercises the right of occupancy appurtenant to membership. In order to apply for membership in the cooperative following the death of a member or members who occupied the cooperative under the trust's title, a successor beneficiary of the trust must satisfy the restriction structure set forth in this chapter. The cooperative may require successor beneficiaries who did not occupy the dwelling unit with the deceased cooperative member or members to offer the membership interest back to the cooperative for sale pursuant to any cooperative right of first refusal, cooperative purchase option, or other membership sale requirements or restrictions established by the cooperative in its bylaws or through the cooperative's policies, rules, or regulations;\n(4) an adult natural person remainderman, subject to a life estate retained by a natural person who satisfies the restrictions set forth in this chapter and who exercises the right of occupancy appurtenant to membership in the dwelling unit, except as prohibited, limited, or otherwise provided by the bylaws. In order to apply for membership in the cooperative following the death of the life tenant member or members of the cooperative, a remainderman must satisfy the age restriction structure set forth in this chapter for membership in the cooperative. Following the death of the life tenant member, a cooperative may require a remainderman to offer the membership interest back to the cooperative for sale pursuant to any cooperative right of first refusal, cooperative purchase option, or other membership sale requirements or restrictions established by the cooperative in its bylaws or through the cooperative's policies, rules, or regulations;\n(5) transfer on death (TOD) beneficiaries upon the death of a member in the cooperative and in accordance with the Minnesota Uniform TOD Security Registration Act, sections 524.6-301, et. seq., except as prohibited, limited, or otherwise provided by the cooperative. A natural person who, as a TOD beneficiary, becomes the title holder of a membership interest in the cooperative following the death of a member must satisfy the restriction structure set forth in this chapter in order to apply for membership in the cooperative. A cooperative may require a TOD beneficiary who becomes the title holder of a membership interest in the cooperative following the death of a member to offer the membership interest back to the cooperative for sale pursuant to any cooperative right of first refusal, cooperative purchase option, or other membership sale requirements or restrictions the cooperative may have developed in its bylaws or through the cooperative's policies, rules, or regulations; and\n(6) with respect to nonoccupant membership interest, any person as defined by this chapter.\n(b) In each instance in which title to a membership interest is held by a trustee, remainderman, or third-party purchaser who purchases a membership interest for a member who will occupy the cooperative, the trustee, remainderman, or third-party purchaser shall agree to abide by the cooperative's articles, bylaws, occupancy agreement or proprietary lease of the member, and rules, policies, and regulations of the cooperative, and shall not, by virtue of their status of holding title to the membership interest, have any voting rights that a member of the cooperative would otherwise have by reason of being the holder of a membership certificate. All voting rights shall be vested solely with the member who occupies the cooperative.",
	"repealed": false
}