{
	"id": "473.407",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.407",
	"title": "473.407 METROPOLITAN TRANSIT POLICE.",
	"text": "The council may appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), and establish a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), known as the Metropolitan Transit Police, to police its transit property and routes, to carry out investigations, and to make arrests under sections 629.30 and 629.34. The jurisdiction of the law enforcement agency is limited to offenses relating to council transit property, equipment, employees, and passengers. The jurisdiction of the Metropolitan Transit Police shall include traffic lanes designed for bus or transit use, freeway or expressway shoulders in the seven-county metropolitan area used by authorized transit buses and Metro Mobility buses under section 169.306, and high-occupancy vehicle lanes used by transit buses. Upon request from, or under an agreement with, any law enforcement agency and subject to the availability of its personnel and other resources, the Metropolitan Transit Police may exercise general law enforcement agency authority to assist any law enforcement agency in implementing or carrying out law enforcement activities, programs, or initiatives. If the commissioner of transportation contracts with the Metropolitan Council for operation of commuter rail facilities under section 174.90, the jurisdiction of the Metropolitan Transit Police extends to offenses relating to the operation, property, facilities, equipment, employees, and passengers of the commuter rail facilities located in and outside of the metropolitan area.\nThe initial processing of a person arrested by the transit police for an offense within the agency's jurisdiction is the responsibility of the transit police unless otherwise directed by the law enforcement agency with primary jurisdiction. A subsequent investigation is the responsibility of the law enforcement agency of the jurisdiction in which the crime was committed unless the law enforcement agency authorizes the transit police to assume the subsequent investigation. At the request of the primary jurisdiction, the transit police may assist in a subsequent investigation being carried out by the primary jurisdiction. Persons arrested for violations which the transit police determine are not within the agency's jurisdiction must be referred to the appropriate local law enforcement agency for further investigation or disposition.\nThe transit police must develop a policy for notifying the law enforcement agency with primary jurisdiction when it has initiated surveillance or investigation of any person within the jurisdiction of that agency. The council shall train all of its peace officers regarding the application of this policy.\nThe regional administrator shall appoint a peace officer employed full time to be the chief law enforcement officer and to be responsible for the management of the metropolitan transit police. The chief law enforcement officer shall possess the necessary police and management experience to manage a law enforcement agency. The chief law enforcement officer may appoint, discipline, and discharge all transit police personnel. All police managerial and supervisory personnel must be full-time employees of the Metropolitan Transit Police. Supervisory personnel must be on duty and available any time transit police are on duty. The chief law enforcement officer may not hire part-time peace officers as defined in section 626.84, subdivision 1, paragraph (d), except that the chief may appoint peace officers to work on a part-time basis not to exceed 30 full-time equivalents. A part-time officer must maintain an active peace officer license with the officer's full-time law enforcement employer.\nSubdivision 4 does not apply to part-time officers employed by the Metropolitan Council Transit Police prior to January 1, 1998, who were full-time employees of another police department upon the date the officer was hired by the Metropolitan Council Transit Police and who subsequently voluntarily separated from the full-time position before January 1, 1998.\n(a) The council shall ensure that all emergency vehicles used by transit police are equipped with radios capable of receiving and transmitting on the same frequencies utilized by the law enforcement agencies that have primary jurisdiction.\n(b) When the transit police receive an emergency call they shall notify the public safety agency with primary jurisdiction and coordinate the appropriate response.\n(c) Transit police officers shall notify the primary jurisdictions of their response to any emergency.\nExcept as otherwise provided in this section, the transit police shall comply with all statutes and administrative rules relating to the operation and management of a law enforcement agency.",
	"repealed": false
}