{
	"id": "256G.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/256G.09",
	"title": "256G.09 DETERMINING FINANCIAL RESPONSIBILITY.",
	"text": "If upon investigation the local agency decides that the application or commitment was not filed in the county of financial responsibility as defined by this chapter, but that the applicant is otherwise eligible for assistance, it shall send a copy of the application or commitment claim, together with the record of any investigation it has made, to the county it believes is financially responsible. The copy and record must be sent within 60 days of the date the application was approved or the claim was paid. The first local agency shall provide assistance to the applicant until financial responsibility is transferred under this section.\nThe county receiving the transmittal has 30 days to accept or reject financial responsibility. A failure to respond within 30 days establishes financial responsibility by the receiving county.\n(a) If the county receiving the transmittal does not believe it is financially responsible, it should provide to the commissioner of human services and the initially responsible county a statement of all facts and documents necessary for the commissioner to make the requested determination of financial responsibility. The submission must clearly state the program area in dispute and must state the specific basis upon which the submitting county is denying financial responsibility.\n(b) The initially responsible county then has 15 calendar days to submit its position and any supporting evidence to the commissioner. The absence of a submission by the initially responsible county does not limit the right of the commissioner of human services or Direct Care and Treatment executive board to issue a binding opinion based on the evidence actually submitted.\n(c) A case must not be submitted until the local agency taking the application or making the commitment has made an initial determination about eligibility and financial responsibility, and services have been initiated. This paragraph does not prohibit the submission of closed cases that otherwise meet the applicable statute of limitations.\n(a) Except as provided in paragraph (b) for matters under the jurisdiction of the Direct Care and Treatment executive board, the commissioner shall then promptly decide any question of financial responsibility as outlined in this chapter and make an order referring the application to the local agency of the proper county for further action. Further action may include reimbursement by that county of assistance that another county has provided to the applicant under this subdivision. The commissioner shall decide disputes within 60 days of the last county evidentiary submission and shall issue an immediate opinion.\n(b) For disputes regarding financial responsibility relating to matters under the jurisdiction of the direct care and treatment executive board, the commissioner shall promptly issue an advisory opinion on any question of financial responsibility as outlined in this chapter and recommend to the executive board an order referring the application to the local agency of the proper county for further action. Further action may include reimbursement by that county of assistance that another county has provided to the applicant under this subdivision. The commissioner shall provide an advisory opinion and recommended order to the executive board within 30 days of the last county evidentiary submission. The executive board shall decide to accept or reject the commissioner's advisory opinion and recommended order within 60 days of the last county evidentiary submission and shall issue an immediate opinion stating the reasons for accepting or rejecting the commissioner's recommendation.\n(c) The commissioner may make any investigation it considers proper before making a decision or a recommendation to the executive board. The commissioner may prescribe rules it considers necessary to carry out this subdivision except that the commissioner must not create rules purporting to bind the executive board's decision on any advisory opinion or recommended order under paragraph (b).\n(d) Except as provided in paragraph (e) for matters under the jurisdiction of the executive board, the order of the commissioner binds the local agency involved and the applicant or recipient. That agency shall comply with the order unless reversed on appeal as provided in section 256.045, subdivision 7. The agency shall comply with the order pending the appeal.\n(e) For disputes regarding financial responsibility relating to matters under the jurisdiction of the Direct Care and Treatment executive board, the order of the executive board binds the local agency involved and the applicant or recipient. That agency shall comply with the order of the executive board unless the order is reversed on appeal as provided in section 256.045, subdivision 7. The agency shall comply with the order of the executive board pending the appeal.\nA local agency that is aggrieved by the order of the department may appeal the opinion to the district court of the county responsible for furnishing assistance or services by serving a written copy of a notice of appeal on the commissioner and any adverse party of record within 30 days after the date the department issued the opinion, and by filing the original notice and proof of service with the court administrator of district court. Service may be made personally or by mail. Service by mail is complete upon mailing.\nThe commissioner may elect to become a party to the proceedings in district court. The court may consider the matter in or out of chambers and shall take no new or additional evidence.\nAfter the department issues an opinion in any submission under this section, the service or assistance covered by the submission must be provided or paid pending or during an appeal to the district court.",
	"repealed": false
}