{
	"id": "84A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.20",
	"title": "84A.20 COUNTY ACTION TO SET OFF AREAS.",
	"text": "The powers in this section are granted for the purpose of:\n(1) vesting and revesting the state with title to lands suitable primarily for the development of forests and the prevention of forest fires, and for experimenting in and practically advancing afforestation and reforestation;\n(2) impounding, controlling, and regulating the waters of meandered lakes and the flow of natural streams in the state; or\n(3) other state purposes.\n(a) The board of county commissioners of any county may by resolution propose to the state that one or more areas in the county be taken over by the state for afforestation, reforestation, flood control projects, or other state purposes. The projects are to be managed, controlled, and used for the purposes in subdivision 1 on lands to be acquired by the state within the projects, as set forth in sections 84A.20 to 84A.30. The county board may propose this if the county contains lands suitable for the purposes in subdivision 1.\n(b) The area taken over must include lands that have been assessed for all or part of the cost of the establishment and construction of public drainage ditches under state law, and on which the assessments or installments are delinquent. A certified copy of the county board's resolution must be filed with the department and considered and acted upon by the department. If approved by the department, it must then be submitted to, considered, and acted upon by the executive council. If approved by the Executive Council, the proposition must be formally accepted by the governor. Acceptance must be communicated in writing to and filed with the county auditor.\nState lands that have been sold as provided by law and for which certificates of sale have been issued are taxable lands within the meaning of this section. If the taxes against the lands or the interest of the purchaser in them are delinquent, they are delinquent within the meaning of subdivision 2 until the title of the certificate holder has been terminated by the commissioner in accordance with section 92.16.",
	"repealed": false
}