{
	"id": "221.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.131",
	"title": "221.131 CARRIER VEHICLE REGISTRATION; FEES, IDENTIFICATION CARD.",
	"text": "Permits issued under section 221.121 are effective for a 12-month period. A permit holder must renew the permit annually by registration of the vehicles operated under authority of that permit as required by subdivision 2. A permit holder has one annual renewal date encompassing all of the permits held by the holder.\n(a) This subdivision applies only to holders of household goods mover permits and motor carriers of passengers.\n(b) A permit holder or motor carrier of passengers shall pay an annual registration fee of $75 on each vehicle, including pickup and delivery vehicles, operated by the carrier under authority of the permit or certificate of registration during the 12-month period or fraction of the 12-month period. Trailers and semitrailers used by a permit holder in combination with power units may not be counted as vehicles in the computation of fees under this section if the permit holder pays the fees for power units.\n(c) The commissioner shall furnish a distinguishing annual identification card for each vehicle or power unit for which a fee has been paid. The identification card must at all times be carried in the vehicle or power unit to which it has been assigned. An identification card may be reassigned to another vehicle or power unit upon application of the carrier and payment of a transfer fee of $10. An identification card issued under this section is valid only for the period for which the permit or certificate of registration is effective.\n(d) A fee of $10 is charged for the replacement of an unexpired identification card that has been lost.\n(e) The proceeds of the fees collected under this subdivision must be deposited in the trunk highway fund.\n[Repealed, 2009 c 64 s 57]\nCertificated passenger carriers shall pay an annual registration fee of $40 for each vehicle, including pickup and delivery vehicles, operated during a calendar year. The commissioner shall issue distinguishing identification cards as provided in subdivision 2.\nThe department may issue to carriers subject to subdivision 2 or 3 special \"floater\" identification cards up to a maximum of five per motor carrier. Floater cards may be freely transferred between vehicles that have evidence of being inspected under section 221.0252, subdivision 3, paragraph (a), clause (2), within the previous 12 months, or have a current Commercial Vehicle Safety Alliance decal, and that are used under short-term leases by the motor carrier. The motor carrier shall pay a fee of $100 for each floater card issued.\nThe provisions of this section are limited by applicable federal law.\n[Repealed by amendment, 1995 c 265 art 2 s 23]\n[Repealed by amendment, 1995 c 265 art 2 s 23]",
	"repealed": false
}