{
	"id": "103E.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.261",
	"title": "103E.261 PRELIMINARY HEARING.",
	"text": "When the preliminary survey report is filed, the auditor shall promptly notify the drainage authority. The drainage authority in consultation with the auditor shall set a time, by order, not more than 30 days after the date of the order, for a hearing on the preliminary survey report. At least ten days before the hearing, the drainage authority after consulting with the auditor shall give notice by mail of the time and location of the hearing to the petitioners, owners of property, and political subdivisions likely to be affected by the proposed drainage project in the preliminary survey report.\nThe engineer shall attend the preliminary hearing and provide necessary information. The petitioners and all other interested parties may appear and be heard. The commissioner's advisory report on the preliminary plan must be publicly read and included in the record of proceedings.\n(a) The drainage authority shall first examine the petition and determine if it meets the legal requirements.\n(b) If the petition does not meet the legal requirements of this chapter, the hearing shall be adjourned until a specified date by which the petitioners must resubmit the petition. The petition must be referred back to the petitioners who, by unanimous action, may amend the petition. The petitioners may obtain signatures of additional property owners as added petitioners.\n(c) When the hearing is reconvened, if the petition is not resubmitted or does not meet the legal requirements, the proceedings must be dismissed.\n(a) The drainage authority shall dismiss the proceedings if it determines that:\n(1) the proposed drainage project is not feasible;\n(2) the adverse environmental impact is greater than the public benefit and utility after considering the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1, and the engineer has not reported a plan to make the proposed drainage project feasible and acceptable;\n(3) the proposed drainage project is not of public benefit or utility; or\n(4) the outlet is not adequate.\n(b) If the proceedings are dismissed, any other action on the proposed drainage project must begin with a new petition.\n(a) The drainage authority shall state, by order, its findings and any changes that must be made in the proposed drainage project from those outlined in the petition, including changes necessary to minimize or mitigate adverse impact on the environment, if it determines that:\n(1) the proposed drainage project outlined in the petition, or modified and recommended by the engineer, is feasible;\n(2) there is necessity for the proposed drainage project;\n(3) the proposed drainage project will be of public benefit and promote the public health, after considering the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1; and\n(4) the outlet is adequate.\n(b) Changes may be stated by describing them in general terms or filing a map that outlines the changes in the proposed drainage project with the order. The order and accompanying documents must be filed with the auditor.\nIf the outlet is an existing drainage system, the drainage authority may determine that the outlet is adequate and obtain permission to use the existing drainage system as an outlet. The drainage authority shall assign a number to the proposed drainage project and proceed under section 103E.401 to act in behalf of the proposed drainage project.\n(a) For all further proceedings, the order modifies the petition and the order must be considered with the petition.\n(b) The findings and order of the drainage authority at the preliminary hearing are conclusive only for the signatures and legal requirements of the petition, the nature and extent of the proposed plan, and the need for a detailed survey, and only for the persons or parties shown by the preliminary survey report as likely to be affected by the proposed drainage project. All questions related to the practicability and necessity of the proposed drainage project are subject to additional investigation and consideration at the final hearing.",
	"repealed": false
}