{
	"id": "31.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.101",
	"title": "31.101 RULES; HEARINGS; UNIFORMITY WITH FEDERAL LAW.",
	"text": "The commissioner may promulgate and amend rules for the efficient administration and enforcement of the Minnesota Food Law. The rules when applicable must conform, insofar as practicable and consistent with state law, with those promulgated under the federal law. This rulemaking authority is in addition to that in sections 31.10, 31.11, and 31.12. Rules adopted under this section may be amended by the commissioner under chapter 14, subject to the limitation in subdivision 7.\nHearings authorized or required by law must be conducted by the commissioner or an officer, agent, or employee the commissioner designates for the purpose.\nFederal pesticide chemical regulations adopted under authority of the Federal Insecticide, Fungicide and Rodenticide Act, as provided by United States Code, title 7, chapter 6, are the pesticide chemical rules in this state.\nFederal food additive regulations, as provided by Code of Federal Regulations, title 21, parts 170 to 199, are the food additive rules in this state.\nFederal color additive regulations, as provided by Code of Federal Regulations, title 21, parts 70 to 82, are the color additive rules in this state.\nFederal special dietary use regulations, as provided by Code of Federal Regulations, title 21, parts 104 and 105, are the special dietary use rules in this state.\nFederal regulations adopted under the Fair Packaging and Labeling Act, as provided by United States Code, title 15, sections 1451 to 1461, are the rules in this state. The commissioner may not adopt amendments to these rules or adopt other rules which are contrary to the labeling requirements for the net quantity of contents required pursuant to section 4 of the Fair Packaging and Labeling Act and the regulations adopted under that act.\nApplicable federal regulations including recodification contained in Code of Federal Regulations, title 21, parts 0-1299, Food and Drugs, not otherwise adopted herein, also are adopted as food rules of this state.\nFederal regulations, as provided by Code of Federal Regulations, title 50, parts 260 to 267, are incorporated as part of the fishery products rules in this state for state inspections performed under a cooperative agreement with the United States Department of Commerce, National Marine Fisheries Service.\nFederal regulations, as provided by Code of Federal Regulations, title 9, part 301, et seq., are incorporated as part of the meat and poultry rules in this state.\nFederal regulations, as provided by Code of Federal Regulations, title 7, parts 51 and 52, are incorporated as part of the rules in this state.\nFederal grading and inspection standards for manufacturing dairy plants and products, as provided by Code of Federal Regulations, title 7, part 58, subparts B-W, are adopted as the dairy grade rules and manufacturing plant standards in this state.",
	"repealed": false
}