{
	"id": "176.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.106",
	"title": "176.106 ADMINISTRATIVE CONFERENCE.",
	"text": "All determinations by the commissioner or compensation judge pursuant to section 176.102, 176.103, 176.135, or 176.136 shall be in accordance with the procedures contained in this section. For medical disputes under sections 176.135 and 176.136, the commissioner shall have jurisdiction to hold an administrative conference and issue decisions and orders under this section if the amount in dispute at the time the medical request is filed is $7,500 or less. The $7,500 limit does not apply if the medical issue to be determined is whether a charge for a service, article, or supply is excessive under section 176.136, subdivision 1, 1a, 1b, or 1c, and corresponding Minnesota Rules.\nAny party may request an administrative conference by filing a request on a form prescribed by the commissioner.\nThe matter shall be scheduled for an administrative conference within 60 days after receipt of the request for a conference, except that an administrative conference on a rehabilitation issue under section 176.102 must be held within 21 days, unless the issue involves only fees for rehabilitation services that have already been provided or there is good cause for holding the conference later than 21 days. If there is a rehabilitation plan in effect, the qualified rehabilitation consultant must continue to provide reasonable services under the plan until the date the conference was initially scheduled to be held. Notice of the conference shall be served on all parties no later than 14 days prior to the conference, unless the commissioner or compensation judge determines that a conference shall not be held. The commissioner or compensation judge may order an administrative conference before the commissioner's designee whether or not a request for conference is filed.\nThe commissioner or compensation judge may refuse to hold an administrative conference and refer the matter for a settlement or pretrial conference or may certify the matter to the Office of Administrative Hearings for a full hearing before a compensation judge.\nAll parties shall appear either personally, by telephone, by electronic means, by representative, or by written submission. The commissioner's designee or compensation judge shall determine the method of appearance and issues in dispute based upon the information available at the conference.\nUnless the matter is referred for other proceedings under subdivision 3, a written decision shall be issued by the commissioner or compensation judge determining all issues considered at the conference or if a conference was not held, based on the written submissions. Disputed issues of fact shall be determined by a preponderance of the evidence. The decision must be issued within 30 days after the close of the conference or if no conference was held, within 60 days after receipt of the request for conference. The decision must include a statement indicating the right to request a de novo hearing before a compensation judge and how to initiate the request.\nAt a conference, if the insurer does not provide a specific reason for nonpayment of the items in dispute, the commissioner or compensation judge may assess a penalty of $300 payable to the commissioner for deposit in the assigned risk safety account, unless it is determined that the reason for the lack of specificity was the failure of the insurer, upon timely request, to receive information necessary to remedy the lack of specificity. This penalty is in addition to any penalty that may be applicable for nonpayment.\n(a) Any party aggrieved by the decision of the commissioner or compensation judge may request a formal de novo hearing by filing the request with the office and serving the request on all parties no later than 30 days after the decision. When a compensation judge issues the administrative decision under subdivision 5, the formal de novo hearing must be held before a compensation judge other than the compensation judge who presided over the administrative conference.\n(b) Except where the only issues to be determined pursuant to this section involve liability for past treatment or services that will not affect entitlement to ongoing or future proposed treatment or services under section 176.102 or 176.135, the hearing at the office must be held on the first date that all parties are available, but not later than 60 days after the request for hearing is filed. Following the hearing, the compensation judge must issue the decision within 30 days.\n(c) A decision of the compensation judge issued under this subdivision is appealable pursuant to section 176.421.\nThe commissioner does not have authority to make determinations relating to medical or rehabilitation benefits when there is a genuine dispute over whether the injury initially arose out of and in the course of employment.\nIf initial liability for an injury has been admitted or established and an issue subsequently arises regarding causation between the employee's condition and the work injury, the commissioner or compensation judge may make the subsequent causation determination subject to de novo hearing by a compensation judge as provided in subdivision 7.",
	"repealed": false
}