{
	"id": "97C.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.205",
	"title": "97C.205 TRANSPORTING AND STOCKING FISH.",
	"text": "(a) Except on the water body where taken, a person may not transport a live fish in a quantity of water sufficient to keep the fish alive, unless the fish:\n(1) is being transported under an aquaculture license as authorized under sections 17.4985 and 17.4986;\n(2) is being transported for a fishing contest weigh-in under section 97C.081;\n(3) is a minnow being transported under section 97C.505 or 97C.515;\n(4) is being transported by a commercial fishing license holder under section 97C.821; or\n(5) is being transported as otherwise authorized in this section or as prescribed for certifiable diseases under sections 17.46 to 17.4999.\n(b) The commissioner may adopt rules to allow and regulate:\n(1) the transportation of fish and fish eggs; and\n(2) the stocking of waters with fish or fish eggs.\n(c) The commissioner must allow the possession of fish on special management or experimental waters to be prepared as a meal on the ice or on the shore of that water body if the fish:\n(1) were lawfully taken;\n(2) have been packaged by a licensed fish packer; and\n(3) do not otherwise exceed the statewide possession limits.\n(d) The commissioner shall prescribe rules designed to encourage local sporting organizations to propagate game fish by using rearing ponds. The rules must:\n(1) prescribe methods to acquire brood stock for the ponds by seining public waters;\n(2) allow the sporting organizations to own and use seines and other necessary equipment; and\n(3) prescribe methods for stocking the fish in public waters that give priority to the needs of the community where the fish are reared and the desires of the organization operating the rearing pond.\n(e) A person age 16 or under may, for purposes of display in a home aquarium, transport largemouth bass, smallmouth bass, yellow perch, rock bass, black crappie, white crappie, bluegill pumpkinseed, green sunfish, orange spotted sunfish, and black, yellow, and brown bullheads taken by angling, except as otherwise ordered by the commissioner upon documentation of an emergency fish disease in Minnesota waters, as defined in section 17.4982, subdivision 9. No more than four of each species may be transported at any one time, and any individual fish can be no longer than ten inches in total length. The commissioner may, by written order published in the State Register, prohibit transportation of live fish under this paragraph to help prevent spread of an emergency fish disease documented to occur in Minnesota waters. The order is exempt from the rulemaking provisions of chapter 14 and section 14.386 does not apply.",
	"repealed": false
}