{
	"id": "514.982",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.982",
	"title": "514.982 MEDICAL ASSISTANCE LIEN NOTICE.",
	"text": "A medical assistance lien notice must be dated and must contain:\n(1) the full name, last known address, and last four digits of the Social Security number of the medical assistance recipient;\n(2) a statement that medical assistance payments have been made to or for the benefit of the medical assistance recipient named in the notice, specifying the first date of eligibility for benefits;\n(3) a statement that all interests in real property owned by the persons named in the notice may be subject to or affected by the rights of the agency to be reimbursed for medical assistance benefits; and\n(4) the legal description of the real property upon which the lien attaches, and whether the property is registered property.\nAny notice, release, or other document required to be filed under sections 514.980 to 514.985 must be recorded or filed in the office of the county recorder or registrar of titles, as appropriate, in the county where the real property is located. Notwithstanding section 386.77, the agency shall pay the applicable filing fee for any document filed under sections 514.980 to 514.985. An attestation, certification, or acknowledgment is not required as a condition of filing. If the property described in the medical assistance lien notice is registered property, the registrar of titles shall record it on the certificate of title for each parcel of property described in the lien notice. If the property described in the medical assistance lien notice is abstract property, the recorder shall file the medical assistance lien in the county's grantor-grantee indexes and any tract indexes the county maintains for each parcel of property described in the lien notice. The recorder shall return recorded medical assistance lien notices for abstract property to the agency at no cost. If the agency provides a duplicate copy of a medical assistance lien notice for registered property, the registrar of titles shall show the recording data for the medical assistance lien notice on the copy and return it to the agency at no cost. The filing or mailing of any notice, release, or other document under sections 514.980 to 514.985 is the responsibility of the agency.",
	"repealed": false
}