{
	"id": "135A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.25",
	"title": "135A.25 TEXTBOOK DISCLOSURE, PRICING, AND ACCESS.",
	"text": "This section may be cited as the Textbook Disclosure, Pricing, and Access Act.\n(a) Beginning January 1, 2009, any publisher that sells or distributes course material for classroom use in a postsecondary institution must make the following available in an easily accessible manner to faculty, bookstores, and postsecondary institutions in Minnesota:\n(1) the title, edition, author, and International Standard Book Number (ISBN) or other easily identifiable information for all course materials;\n(2) the undiscounted price at which the course materials are available to a bookstore;\n(3) the formats, including bundled and unbundled, in which those course materials are offered and the undiscounted prices of the various components, both sold separately or packaged together;\n(4) a summary of revisions between current and previous editions of course materials; and\n(5) the return policy for course material, including any penalties or conditions for returns.\n(b) Any publisher that sells or distributes course material for classroom use in a postsecondary institution must make all bundled course material available to bookstores and postsecondary institutions in an unbundled form, or must provide notice if unbundled material is not available.\n(c) Disclosure under this section is not required for mass-market and trade books that are not published, marketed, or sold primarily for classroom use in or by postsecondary institutions.\n(d) Nothing in this section shall be construed to limit any existing academic freedom or rights of faculty members to determine the most appropriate course material for the courses they teach.\nPublic postsecondary institutions must develop educational materials considering the recommendations in studies by the Minnesota Office of Higher Education and others and at least annually convene and sponsor meetings and workshops, and provide educational strategies for faculty, students, administrators, institutions, and bookstores to inform all interested parties on strategies for reducing the costs of course materials for students attending postsecondary institutions.\nFor private postsecondary institutions, the Minnesota Office of Higher Education must develop educational materials considering the recommendations by the Minnesota Office of Higher Education and others and at least annually convene and sponsor meetings and workshops and provide educational strategies for faculty, students, administrators, institutions, and bookstores to inform all interested parties on strategies for reducing the costs of course materials for students attending postsecondary institutions.\nThe University of Minnesota and private colleges are encouraged to comply with the requirements under section 136F.58, subdivisions 2, 2a, and 3.",
	"repealed": false
}