{
	"id": "161.3207",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.3207",
	"title": "161.3207 CONSTRUCTION MANAGER/GENERAL CONTRACTOR CONTRACTS; DEFINITIONS.",
	"text": "The terms used in sections 161.3207 to 161.3209 have the meanings given them in this section.\n\"Acceptance\" means an action of the commissioner authorizing the execution of a construction manager/general contractor contract.\n\"Commissioner\" means the commissioner of transportation.\n\"Construction manager/general contractor\" means a proprietorship, partnership, limited liability partnership, joint venture, corporation, any type of limited liability company, professional corporation, or any legal entity selected by the commissioner to act as a construction manager to manage the construction process, which includes, but is not limited to, responsibility for the price, schedule, and execution of preconstruction services or the workmanship of construction performed according to section 161.3209, or both.\n\"Construction manager/general contractor contract\" means a contract for construction of a project between a construction manager/general contractor and the commissioner, which must include terms providing for a price, construction schedule, and workmanship of the construction performed. The construction manager/general contractor contract may include provisions for incremental price contracts for specific work packages, additional work performed, contingencies, or other contract provisions that will allow the commissioner to negotiate time and cost changes to the contract.\n\"Past performance\" or \"experience\" does not include the exercise or assertion of a person's legal rights.\n\"Preconstruction services\" means all non-construction-related services that a construction manager/general contractor is allowed to perform before execution of a construction manager/general contractor contract or work package.\n\"Preconstruction services contract\" means a contract under which a construction manager/general contractor is paid on the basis of the actual cost to perform the work specified in the contract plus an amount for overhead and profit for all preconstruction services.\n\"Project\" means any project selected by the commissioner as a construction manager/general contractor project under section 161.3208.\n\"Request for proposals\" or \"RFP\" means the document or publication soliciting proposals for a construction manager/general contractor contract.\n\"Request for qualifications\" or \"RFQ\" means a document or publication used to prequalify and short-list potential construction managers/general contractors.\n\"Work package\" means the scope of work for a defined portion of a project. A defined portion includes construction services on any project aspect, including procuring materials or services.",
	"repealed": false
}