{
	"id": "524.5-417",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-417",
	"title": "524.5-417 GENERAL POWERS AND DUTIES OF CONSERVATOR.",
	"text": "(a) A conservator shall be subject to the control and direction of the court at all times and in all things.\n(b) The court shall grant to a conservator only those powers necessary to provide for the demonstrated needs of the person subject to conservatorship.\n(c) The court may appoint a conservator if it determines that all the powers and duties listed in this section are needed to provide for the needs of the person subject to conservatorship. The court may also appoint a conservator if it determines that a conservator is necessary to provide for the needs of the person subject to conservatorship through the exercise of some, but not all, of the powers and duties listed in this section. The duties and powers of a conservator include, but are not limited to:\n(1) the duty to pay the reasonable charges for the support, maintenance, and education of the person subject to conservatorship in a manner suitable to the station in life of the person subject to conservatorship and the value of the estate. Nothing herein contained shall release parents from obligations imposed by law for the support, maintenance, and education of their children. The conservator has no duty to pay for these requirements out of personal funds. Wherever possible and appropriate, the conservator should meet these requirements through governmental benefits or services to which the person subject to conservatorship is entitled, rather than from the estate of the person subject to conservatorship. Failure to satisfy the needs and requirements of this section shall be grounds for removal, but the conservator shall have no personal or monetary liability;\n(2) the duty to pay out of the estate of the person subject to conservatorship all lawful debts of the person subject to conservatorship and the reasonable charges incurred for the support, maintenance, and education of the spouse and dependent children of the person subject to conservatorship and, upon order of the court, pay such sum as the court may fix as reasonable for the support of any person unable to earn a livelihood who is legally entitled to support from the person subject to conservatorship;\n(3) the duty to possess and manage the estate, collect all debts and claims in favor of the person subject to conservatorship, or, with the approval of the court, compromise them, institute suit on behalf of the person subject to conservatorship and represent the person subject to conservatorship in expungement proceedings, harassment proceedings, and all civil court proceedings, including but not limited to restraining orders, orders for protection, name changes, conciliation court, housing court, family court, probate court and juvenile court; and invest all funds not currently needed for the debts and charges named in clauses (1) and (2) and the management of the estate, in accordance with the provisions of sections 48A.07, subdivision 6, 501C.0901, and 524.5-423, or as otherwise ordered by the court. The standard of a fiduciary shall be applicable to all investments by a conservator. A conservator shall also have the power to purchase certain contracts of insurance as provided in section 50.14, subdivision 14, clause (b);\n(4) where a person subject to conservatorship has inherited an undivided interest in real estate, the court, on a showing that it is for the best interest of the person subject to conservatorship, may authorize an exchange or sale of the interest of the person subject to conservatorship or a purchase by the person subject to conservatorship of any interest other heirs may have in the real estate, subject to the procedures and notice requirements of section 524.5-418;\n(5) the power to approve or withhold approval of any contract, except for necessities, which the person subject to conservatorship may make or wish to make;\n(6) the power to apply on behalf of the person subject to conservatorship for any assistance, services, or benefits available to the person subject to conservatorship through any unit of government; and\n(7) the power to establish an ABLE account for the person subject to conservatorship. The conservator may exercise all powers over the ABLE account for the benefit of the person subject to conservatorship and shall direct investment of the ABLE accounts property in accordance with the provisions of sections 48A.07, subdivision 6, 501C.0901, and 524.5-423, or as otherwise ordered by the court. The standard of a fiduciary shall be applicable to all ABLE account investments by a conservator.\n(d) The conservator shall have the power to revoke, suspend, or terminate all or any part of a durable power of attorney of which the person subject to conservatorship is the principal with the same power the principal would have if the principal were not incapacitated. If a durable power of attorney is in effect, a decision of the conservator takes precedence over that of an attorney-in-fact.\n(e) Transaction set aside. If a person subject to conservatorship has made a financial transaction or gift or entered into a contract during the two-year period before establishment of the conservatorship, the conservator may petition for court review of the transaction, gift, or contract. If the court finds that the person subject to conservatorship was incapacitated or subject to duress, coercion, or undue influence when the transaction, gift, or contract was made, the court may declare the transaction, gift, or contract void except as against a bona fide transferee for value and order reimbursement or other appropriate relief. This paragraph does not affect any other right or remedy that may be available to the person subject to conservatorship with respect to the transaction, gift, or contract.\n(f) After the filing of the petition, a certificate of the district court certified to that fact may be filed for record with the Minnesota secretary of state in the same manner as provided in section 336.9-501. The certificate shall state that a petition is pending and the name and address of the person for whom a conservator is sought. If a conservator is appointed on the petition, and if the conservatorship order removes or restricts the right of the person subject to conservatorship to transfer property or to contract, then all contracts except for necessaries, and all transfers of personal property, tangible or intangible, including, but not limited to, cash or securities transfers at banks, brokerage houses, or other financial institutions, or transfers of cash or securities, made by the person subject to conservatorship after the filing and before the termination of the conservatorship shall be voidable.\n(g) Unless otherwise ordered by the court, if the person subject to conservatorship shall at any time during the continuance of the conservatorship be employed, the wages or salary for employment of the person subject to conservatorship shall not be a part of the conservatorship estate and the wages and salaries shall be paid to the person subject to conservatorship and shall be subject to the control of the person subject to conservatorship to the same extent as if the conservatorship did not exist. The conservator shall not have to account for the wages and salary.",
	"repealed": false
}