{
	"id": "3A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/3A.03",
	"title": "3A.03 CONTRIBUTIONS.",
	"text": "(a) Every member of the legislature shall contribute nine percent of total salary.\n(b) The contribution must be made by payroll deduction and must be paid into the state treasury and deposited in the general fund.\n(c) The director must record the periodic contributions of each member of the legislature and must credit each contribution to the member's account.\n(a) A former member who has made contributions under subdivision 1 and who is no longer a member of the legislature is entitled to receive, upon written application to the executive director on a form prescribed by the executive director, a refund from the general fund of all contributions credited to the member's account with interest computed as provided in section 352.22, subdivision 2.\n(b) The refund of contributions as provided in paragraph (a) terminates all rights of a former member of the legislature and the survivors of the former member under this chapter.\n(c) If the former member of the legislature again becomes a member of the legislature after having taken a refund as provided in paragraph (a), the member is a member of the unclassified employees retirement program of the Minnesota State Retirement System.\n(d) However, the member may reinstate the rights and credit for service previously forfeited under this chapter if the member repays all refunds taken, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually, from the date on which the refund was taken to the date on which the refund is repaid. Repayment must be made as provided in section 352.23, paragraph (d).\n(e) A member of the legislature who has received a refund from any of the retirement plans specified in section 356.311, paragraph (b), may repay the refund to the respective plan under such terms and conditions consistent with the law governing the retirement plan if the law governing the plan permits the repayment of refunds. If the total amount to be repaid, including principal and interest exceeds $2,000, repayment may be made in three equal installments over a period of 18 months, with the interest accrued during the period of the repayment added to the final installment.\n(f) No person may be required to apply for or to accept a refund.\n(a) The legislators retirement fund, a special retirement fund, is created within the state treasury. The legislators retirement fund must be credited with any investment proceeds on the assets of the retirement fund.\n(b) The payment of annuities under section 3A.115, paragraph (b), is appropriated from the legislators retirement fund.\n(c) The legislators retirement fund may receive transfers of general fund proceeds.",
	"repealed": false
}