{
	"id": "144.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.56",
	"title": "144.56 STANDARDS.",
	"text": "The state commissioner of health shall, in the manner prescribed by law, adopt and enforce reasonable rules and standards under sections 144.50 to 144.56 which the commissioner finds to be necessary and in the public interests and may rescind or modify them from time to time as may be in the public interest, insofar as such action is not in conflict with any provision thereof.\nIn the public interest the commissioner of health, by such rules and standards, may regulate and establish minimum standards as to the construction, equipment, maintenance, and operation of the institutions insofar as they relate to sanitation and safety of the buildings and to the health, treatment, comfort, safety, and well-being of the persons accommodated for care. Construction as used in this subdivision means the erection of new buildings or the alterations of or additions to existing buildings commenced after April 7, 1951.\nThe commissioner shall not adopt any rule which unconditionally prohibits double beds in a boarding care home. The commissioner may adopt rules setting criteria for when double beds will be allowed.\nThe commissioner shall not adopt or enforce any rule that limits:\n(1) a certified boarding care home from providing nursing services in accordance with the home's Medicaid certification; or\n(2) a noncertified boarding care home registered under chapter 144D from providing home care services in accordance with the home's registration.\n(a) A boarding care home must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in CDC's Morbidity and Mortality Weekly Report (MMWR). This program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, residents, and volunteers. The Department of Health shall provide technical assistance regarding implementation of the guidelines.\n(b) Written compliance with this subdivision must be maintained by the boarding care home.\nThe commissioner of health shall, with the advice of the commissioner of human services, prescribe such general rules for the conduct of all institutions receiving maternity patients as shall be necessary to effect the purposes of all laws of the state relating to maternity patients and newborn infants so far as the same are applicable.\nThe commissioner of health may classify the institutions licensed under sections 144.50 to 144.56 on the basis of the type of care provided and may prescribe separate rules and minimum standards for each class.",
	"repealed": false
}