{
	"id": "501B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.31",
	"title": "501B.31 CHARITABLE TRUSTS.",
	"text": "No charitable trust is invalid because of indefiniteness or uncertainty of the object of the trust or of its beneficiaries designated in the instrument creating the trust or because the trust violates a statute or rule against perpetuities. No charitable trust may prevent or limit the free alienation of the title to any of the trust estate by the trustee in the administration of the trust, except as may be permitted under existing or subsequent statutes.\nA charitable trust must be liberally construed by the courts so that the intentions of the donor are carried out when possible, and the trust must not fail solely because the donor has imperfectly outlined the purpose and object of the charity or the method of administration. If the district court of the proper county determines that the purpose and object of the donor's charity are imperfectly expressed, the method of administration is incomplete or imperfect, or circumstances have so changed since the execution of the instrument creating the trust as to render impracticable, inexpedient, or impossible a literal compliance with the terms of the instrument, the court may, upon the petition of the trustee under section 501C.0202, make an order directing that the trust must be administered or expended in a manner the court determines will, as nearly as possible, accomplish the general purposes of the instrument and the object and intention of the donor without regard to, and free from any specific restriction, limitation, or direction it contains.\nNothing in this section impairs, limits, or abridges the operation and efficacy of the whole or any part of a statute that authorizes the creation of a corporation for charitable purposes or that permits a municipal corporation to act as trustee for a public or charitable purpose. Nothing in subdivisions 1 to 3 of this section applies to a gift, bequest, devise, or trust made, created, or arising by or under the provisions of the will of a person who died before April 15, 1927.\n(a) This subdivision applies to a gift or trust made or created by a living person before April 15, 1927, or a gift, bequest, devise, or trust made or created by or under the will of a person who died before April 15, 1927.\n(b) If a gift, trust, or devise has been made for a charitable, benevolent, educational, religious, or other public use or trust, or upon a condition, limitation, or restriction of any kind, the property given, entrusted, or devised may be used only for that use or trust and in accordance with the condition, limitation, or restriction. The grantee, devisee, trustee, or other holder of property may petition the court under section 501C.0202 for determination of the legal rights and relationship of the holder, the public, the grantor, and the grantor's heirs, representatives, or assigns in and to the property.\n(c) If the court determines that circumstances have so changed since the execution of the instrument as to render impracticable, inexpedient, or impossible a literal compliance with the terms or conditions of the instrument, but the terms and purposes of the instrument may be substantially performed, the court may order that the terms of the instrument be performed and the property be administered or expended in a manner that will, in the judgment of the court, as nearly as possible, accomplish the general purposes of the instrument and the intention of the grantor without regard to, and free from any, specific restriction, limitation, condition, or direction contained in the instrument.\nIn cases arising under this section, the attorney general must be given notice of any court proceedings pursuant to section 501C.0203. The attorney general shall represent the beneficial interests in those cases and shall enforce affected trusts.",
	"repealed": false
}