{
	"id": "462A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.04",
	"title": "462A.04 HOUSING FINANCE AGENCY.",
	"text": "There is created a public body corporate and politic to be known as the \"Minnesota Housing Finance Agency,\" which shall perform the governmental functions and exercise the sovereign powers delegated to it in this chapter in furtherance of the public policies and purposes declared in section 462A.02. The agency shall consist of the state auditor and six public members appointed by the governor with advice and consent of the senate. No more than three public members shall reside in the area of jurisdiction of the Metropolitan Council as provided in section 473.123, subdivision 1, and no more than one public member shall reside in any one of the development regions established under the provisions of sections 462.381 to 462.396. Each member shall hold office until a successor has been appointed and has qualified. A certificate of appointment or reappointment of any member shall be conclusive evidence of the due and proper appointment of the member.\nThe membership terms, compensation, removal of members, and filling of vacancies for the public members on the agency shall be as provided in section 15.0575.\nMS 1974 [Repealed, 1976 c 134 s 79]\nMS 1974 [Repealed, 1976 c 134 s 79]\nThe chair of the board of directors shall be designated by the governor from among the public members appointed.\nMS 1974 [Repealed, 1976 c 134 s 79]\nThe management and control of the agency shall be vested solely in the members in accordance with the provisions of this chapter.\nThe powers of the agency shall be vested in the members thereof in office from time to time and a majority of the members of the agency constitutes a quorum for the purpose of conducting its business and exercising its powers and for all other purposes, notwithstanding the existence of any vacancies. Action may be taken by the agency upon a vote of a majority of the members present.\n(a) The agency shall be under the administrative control of a commissioner which office is established. The commissioner shall be appointed by the governor under the provisions of section 15.06.\n(b) The commissioner may appoint a deputy director. The commissioner may further appoint such permanent and temporary employees as the commissioner deems necessary subject to the approval of the commissioner of management and budget. All permanent employees of the agency, except the commissioner, deputy director, and additional positions established pursuant to section 43A.08, subdivision 1a, are in the classified civil service. Notwithstanding any other provision of law to the contrary, any approved complement established by law for the agency shall not be reduced as a result of vacancies in approved positions. No additional deputy commissioner positions may be created.\nThe approved complement of the Minnesota Housing Finance Agency may be increased up to three unclassified positions for the purposes of Laws 1979, chapter 306, sections 1 to 16.\nThe members and officers of the agency shall not be liable personally, either jointly or severally, for any debt or obligation created or incurred by the agency.",
	"repealed": false
}