{
	"id": "142G.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.90",
	"title": "142G.90 DIVERSIONARY WORK PROGRAM.",
	"text": "(a) The Personal Responsibility and Work Opportunity Reconciliation Act of 1996, Public Law 104-193, establishes block grants to states for temporary assistance for needy families (TANF). TANF provisions allow states to use TANF dollars for nonrecurrent, short-term diversionary benefits. The diversionary work program established on July 1, 2003, is Minnesota's TANF program to provide short-term diversionary benefits to eligible recipients of the diversionary work program.\n(b) The goal of the diversionary work program is to provide short-term, necessary services and supports to families which will lead to unsubsidized employment, increase economic stability, and reduce the risk of those families needing longer term assistance, under the Minnesota family investment program (MFIP).\n(c) When a family unit meets the eligibility criteria in this section, the family must receive a diversionary work program grant and is not eligible for MFIP.\n(d) A family unit is eligible for the diversionary work program for a maximum of four consecutive months. During the four consecutive months, family maintenance needs as defined in subdivision 2, shall be vendor paid, up to the cash portion of the MFIP standard of need for the same size household. To the extent there is a balance available between the amount paid for family maintenance needs and the cash portion of the transitional standard, a personal needs allowance of up to $70 per DWP recipient in the family unit shall be issued. The personal needs allowance payment plus the family maintenance needs shall not exceed the cash portion of the MFIP standard of need. Counties may provide supportive and other allowable services funded by the MFIP consolidated fund under section 142G.76 to eligible participants during the four-month diversionary period.\n[See Note.]\nThe terms used in this section have the following meanings.\n(a) \"Diversionary Work Program (DWP)\" means the program established under this section.\n(b) \"Employment plan\" means a plan developed by the job counselor and the participant which identifies the participant's most direct path to unsubsidized employment, lists the specific steps that the caregiver will take on that path, and includes a timetable for the completion of each step. For participants who request and qualify for a family violence waiver in section 142G.56, subdivision 3, an employment plan must be developed by the job counselor, the participant, and a person trained in domestic violence and follow the employment plan provisions in section 142G.56, subdivision 3. Employment plans under this section shall be written for a period of time not to exceed four months.\n(c) \"Employment services\" means programs, activities, and services in this section that are designed to assist participants in obtaining and retaining employment.\n(d) \"Family maintenance needs\" means current housing costs including rent; manufactured home lot rental costs, or monthly principal, interest, insurance premiums, and property taxes due for mortgages or contracts for deed; association fees required for homeownership; utility costs for current month expenses of gas and electric, garbage, water and sewer; and a flat rate of $35 for telephone services.\n(e) \"Family unit\" means a group of people applying for or receiving DWP benefits together. For the purposes of determining eligibility for this program, the composition of the family unit is determined according to section 142G.17, subdivisions 1 to 4.\n(f) \"Minnesota family investment program (MFIP)\" means the assistance program as defined in section 142G.02, subdivision 63.\n(g) \"Personal needs allowance\" means an allowance of up to $70 per month per DWP unit member to pay for expenses such as household products and personal products.\n(h) \"Work activities\" means allowable work activities as defined in section 142G.70, subdivision 11.\n(i) \"Caregiver\" means the caregiver as defined in section 142G.02, subdivision 12.\n[See Note.]\n(a) Except for the categories of family units listed in clauses (1) to (9), all family units who apply for cash benefits and who meet MFIP eligibility as required in sections 142G.11 to 142G.15 are eligible and must participate in the diversionary work program. Family units or individuals that are not eligible for the diversionary work program include:\n(1) child only cases;\n(2) single-parent family units that include a child under 12 months of age. A parent is eligible for this exception once in a parent's lifetime;\n(3) family units with a minor parent without a high school diploma or its equivalent;\n(4) family units with an 18- or 19-year-old caregiver without a high school diploma or its equivalent who chooses to have an employment plan with an education option;\n(5) family units with a caregiver who received DWP benefits within the 12 months prior to the month the family applied for DWP, except as provided in paragraph (c);\n(6) family units with a caregiver who received MFIP within the 12 months prior to the month the family applied for DWP;\n(7) family units with a caregiver who received 60 or more months of TANF assistance;\n(8) family units with a caregiver who is disqualified from the work participation cash benefit program, DWP, or MFIP due to fraud; and\n(9) single-parent family units where a parent is receiving family and medical leave benefits under chapter 268B.\n(b) A two-parent family must participate in DWP unless both caregivers meet the criteria for an exception under paragraph (a), clauses (1) through (5), or the family unit includes a parent who meets the criteria in paragraph (a), clause (6), (7), or (8).\n(c) Once DWP eligibility is determined, the four months run consecutively. If a participant leaves the program for any reason and reapplies during the four-month period, the county must redetermine eligibility for DWP.\n[See Note.]\n(a) To be eligible for DWP, an applicant must comply with the requirements of paragraphs (b) to (d).\n(b) Applicants and participants must cooperate with the requirements of the child support enforcement program but will not be charged a fee under section 518A.51.\n(c) The applicant must provide each member of the family unit's Social Security number to the county agency. This requirement is satisfied when each member of the family unit cooperates with the procedures for verification of numbers, issuance of duplicate cards, and issuance of new numbers which have been established jointly between the Social Security Administration and the commissioner.\n(d) Before DWP benefits can be issued to a family unit, the caregiver must, in conjunction with a job counselor, develop and sign an employment plan. In two-parent family units, both parents must develop and sign employment plans before benefits can be issued. Supplemental Nutrition Assistance Program (SNAP) and health care benefits are not contingent on the requirement for a signed employment plan.\n[See Note.]\nThe eligibility date for the diversionary work program begins on the date of application or on the date that diversionary work program eligibility criteria are met, whichever is later. The county agency must inform an applicant of the application submission requirements in section 256P.04, subdivision 1a. The county agency must inform the applicant that any delay in submitting the application will reduce the benefits paid for the month of application. The county agency must inform a person that an application may be submitted before the person has an interview appointment. Upon receipt of a signed application, the county agency must stamp the date of receipt on the face of the application. The applicant may withdraw the application at any time prior to approval by giving written or oral notice to the county agency. The county agency must follow the notice requirements in section 142G.05, subdivision 3, when issuing a notice confirming the withdrawal.\n[See Note.]\nUpon receipt of the application, the county agency must determine if the applicant may be eligible for other benefits as required in sections 142G.05, subdivision 4, and 142G.19, subdivisions 1 and 4. The county must screen and the applicant must apply for other benefits as required under section 142G.20, subdivision 2. The county must also follow the provisions in section 142G.05, subdivision 5, clause (2).\n[See Note.]\n(a) The interview to determine financial eligibility for the diversionary work program must be conducted within five working days of the receipt of the cash application form. During the intake interview, the financial worker must discuss:\n(1) the goals, requirements, and services of the diversionary work program;\n(2) the availability of child care assistance. If child care is needed, the worker must obtain a completed application for child care from the applicant before the interview is terminated. The same day the application for child care is received, the application must be forwarded to the appropriate child care worker. For purposes of eligibility for child care assistance under chapter 142E, DWP participants shall be eligible for the same benefits as MFIP recipients; and\n(3) if the applicant has not requested SNAP benefits and health care assistance on the application, the county agency shall, during the interview process, talk with the applicant about the availability of these benefits.\n(b) The county shall follow section 142G.26, subdivision 2, paragraph (b), clauses (1) and (2), when an applicant or a recipient of DWP has a person who is a member of more than one assistance unit in a given payment month.\n(c) If within 30 days the county agency cannot determine eligibility for the diversionary work program, the county must deny the application and inform the applicant of the decision according to the notice provisions in section 142G.21. A family unit is eligible for a fair hearing under section 142G.45.\n[See Note.]\n(a) A county agency must only require verification of information necessary to determine DWP eligibility and the amount of the payment. The applicant or participant must document the information required or authorize the county agency to verify the information. The applicant or participant has the burden of providing documentary evidence to verify eligibility. The county agency shall assist the applicant or participant in obtaining required documents when the applicant or participant is unable to do so.\n(b) A county agency must not request information about an applicant or participant that is not a matter of public record from a source other than county agencies, the Department of Children, Youth, and Families, or the United States Department of Health and Human Services without the person's prior written consent. An applicant's signature on an application form constitutes consent for contact with the sources specified on the application. A county agency may use a single consent form to contact a group of similar sources, but the sources to be contacted must be identified by the county agency prior to requesting an applicant's consent.\n(c) Factors to be verified shall follow section 256P.04, subdivisions 4 and 5. Except for personal needs, family maintenance needs must be verified before the expense can be allowed in the calculation of the DWP grant.\n[See Note.]\nThe asset limits and exclusions in section 256P.02 apply to applicants and participants of DWP. All payments, as described in section 256P.06, subdivision 3, must be counted as income to determine eligibility for the diversionary work program. The agency shall treat income as outlined in section 142G.31, except for subdivision 6. The initial income test and the disregards in section 142G.16, subdivision 1, shall be followed for determining eligibility for the diversionary work program.\n[See Note.]\n(a) The amount of cash benefits that a family unit is eligible for under the diversionary work program is based on the number of persons in the family unit, the family maintenance needs, personal needs allowance, and countable income. The county agency shall evaluate the income of the family unit that is requesting payments under the diversionary work program. Countable income means gross earned and unearned income not excluded or disregarded under MFIP. The same disregards for earned income that are allowed under MFIP are allowed for the diversionary work program.\n(b) The DWP grant is based on the family maintenance needs for which the DWP family unit is responsible plus a personal needs allowance. Housing and utilities, except for telephone service, shall be vendor paid. Unless otherwise stated in this section, actual housing and utility expenses shall be used when determining the amount of the DWP grant.\n(c) The maximum monthly benefit amount available under the diversionary work program is the difference between the family unit's needs under paragraph (b) and the family unit's countable income not to exceed the cash portion of the MFIP transitional standard as defined in sections 142G.02, subdivision 95, and 142G.17, subdivision 5, for the family unit's size.\n(d) Once the county has determined a grant amount, the DWP grant amount will not be decreased if the determination is based on the best information available at the time of approval and shall not be decreased because of any additional income to the family unit. The grant must be increased if a participant later verifies an increase in family maintenance needs or family unit size. The minimum cash benefit amount, if income and asset tests are met, is $10. Benefits of $10 shall not be vendor paid.\n(e) When all criteria are met, including the development of an employment plan as described in subdivision 14 and eligibility exists for the month of application, the amount of benefits for the diversionary work program retroactive to the date of application is as specified in section 142G.32, subdivision 1, paragraph (b).\n(f) Any month during the four-month DWP period that a person receives a DWP benefit directly or through a vendor payment made on the person's behalf, that person is ineligible for MFIP or any other TANF cash assistance program except for benefits defined in section 142G.76, subdivision 2, clause (1).\nIf during the four-month period a family unit that receives DWP benefits moves to a county that has not established a diversionary work program, the family unit may be eligible for MFIP the month following the last month of the issuance of the DWP benefit.\n[See Note.]\n(a) All DWP caregivers, except caregivers who meet the criteria in paragraph (d), are required to participate in DWP employment services. Except as specified in paragraphs (b) and (c), employment plans under DWP must, at a minimum, meet the requirements in section 142G.51, subdivision 1.\n(b) A caregiver who is a member of a two-parent family that is required to participate in DWP who would otherwise be ineligible for DWP under subdivision 3 may be allowed to develop an employment plan under section 142G.56, subdivision 2, that may contain alternate activities and reduced hours.\n(c) A participant who is a victim of family violence shall be allowed to develop an employment plan under section 142G.56, subdivision 3. A claim of family violence must be documented by the applicant or participant by providing a sworn statement which is supported by collateral documentation in section 142G.53, paragraph (b).\n(d) One parent in a two-parent family unit is not required to have an employment plan if that parent:\n(1) receives family and medical leave benefits under chapter 268B; or\n(2) has a natural born child under 12 months of age until the child reaches 12 months of age unless the family unit has already used the exclusion under section 142G.52, subdivision 2, or the previously allowed child under age one exemption under Minnesota Statutes 2002, section 256J.56, paragraph (a), clause (5).\n(e) The provision in paragraph (d) ends the first full month after the child reaches 12 months of age. This provision is allowable only once in a caregiver's lifetime. In a two-parent household, only one parent shall be allowed to use this category.\n(f) The participant and job counselor must meet in the month after the month the child reaches 12 months of age to revise the participant's employment plan. The employment plan for a family unit that has a child under 12 months of age that has already used the exclusion in section 142G.52 must be tailored to recognize the caregiving needs of the parent.\n[See Note.]\n(a) If at any time during the DWP application process or during the four-month DWP eligibility period, it is determined that a participant is unlikely to benefit from the diversionary work program, the county shall convert or refer the participant to MFIP as specified in paragraph (d). Participants who are determined to be unlikely to benefit from the diversionary work program must develop and sign an employment plan.\n(b) A participant who meets the eligibility requirements under section 142G.75, subdivision 3, must be considered to be unlikely to benefit from DWP, provided the necessary documentation is available to support the determination.\n(c) In a two-parent family unit, if one parent is determined to be unlikely to benefit from the diversionary work program, the family unit must be converted or referred to MFIP.\n(d) A participant who is determined to be unlikely to benefit from the diversionary work program shall be converted to MFIP and, if the determination was made within 30 days of the initial application for benefits, no additional application form is required. A participant who is determined to be unlikely to benefit from the diversionary work program shall be referred to MFIP and, if the determination is made more than 30 days after the initial application, the participant must submit a program change request form. The county agency shall process the program change request form by the first of the following month to ensure that no gap in benefits is due to delayed action by the county agency. In processing the program change request form, the county must follow section 142G.10, subdivision 2, except that the county agency shall not require additional verification of the information in the case file from the DWP application unless the information in the case file is inaccurate, questionable, or no longer current.\n(e) The county shall not request a combined application form for a participant who has exhausted the four months of the diversionary work program, has continued need for cash and food assistance, and has completed, signed, and submitted a program change request form within 30 days of the fourth month of the diversionary work program. The county must process the program change request according to section 142G.10, subdivision 2, except that the county agency shall not require additional verification of information in the case file unless the information is inaccurate, questionable, or no longer current. When a participant does not request MFIP within 30 days of the diversionary work program benefits being exhausted, a new combined application form must be completed for any subsequent request for MFIP.\n[See Note.]\nWithin one working day of determination that the applicant is eligible for the diversionary work program, but before benefits are issued to or on behalf of the family unit, the county shall refer all caregivers to employment services. The referral to the DWP employment services must be in writing and must contain the following information:\n(1) notification that, as part of the application process, applicants are required to develop an employment plan or the DWP application will be denied;\n(2) the employment services provider name and phone number;\n(3) the immediate availability of supportive services, including, but not limited to, child care, transportation, and other work-related aid; and\n(4) the rights, responsibilities, and obligations of participants in the program, including, but not limited to, the grounds for good cause, the consequences of refusing or failing to participate fully with program requirements, and the appeal process.\n[See Note.]\nAs soon as possible, but no later than ten working days of being notified that a participant is financially eligible for the diversionary work program, the employment services provider shall provide the participant with an opportunity to meet to develop an initial employment plan. Once the initial employment plan has been developed and signed by the participant and the job counselor, the employment services provider shall notify the county within one working day that the employment plan has been signed. The county shall issue DWP benefits within one working day after receiving notice that the employment plan has been signed.\n[See Note.]\n(a) Except as specified in paragraphs (b) to (d), employment activities listed in section 142G.70, subdivision 11, are allowable under the diversionary work program.\n(b) Work activities under section 142G.70, subdivision 11, clause (5), shall be allowable only when in combination with approved work activities under section 142G.70, subdivision 11, clauses (1) to (4), and shall be limited to no more than one-half of the hours required in the employment plan.\n(c) In order for an English as a second language (ESL) class to be an approved work activity, a participant must:\n(1) be below a spoken language proficiency level of SPL6 or its equivalent, as measured by a nationally recognized test; and\n(2) not have been enrolled in ESL for more than 24 months while previously participating in MFIP or DWP. A participant who has been enrolled in ESL for 20 or more months may be approved for ESL until the participant has received 24 total months.\n(d) Work activities under section 142G.70, subdivision 11, clause (6), shall be allowable only when the training or education program will be completed within the four-month DWP period. Training or education programs that will not be completed within the four-month DWP period shall not be approved.\n[See Note.]\nA family unit that includes a participant who fails to comply with DWP employment service or child support enforcement requirements, without good cause as defined in sections 142G.71 and 518A.81, shall be disqualified from the diversionary work program. The county shall provide written notice as specified in section 142G.21 to the participant prior to disqualifying the family unit due to noncompliance with employment service or child support. The disqualification does not apply to SNAP or health care benefits.\n[See Note.]\nA participant who fails to comply with the requirements of the diversionary work program may claim good cause for reasons listed in sections 142G.71, subdivision 1, clauses (1) to (14); and 518A.81. The county shall not impose a disqualification if good cause exists.\n[See Note.]\nA participant who has been disqualified from the diversionary work program due to noncompliance with employment services may regain eligibility for the diversionary work program by complying with program requirements. A participant who has been disqualified from the diversionary work program due to noncooperation with child support enforcement requirements may regain eligibility by complying with child support requirements under section 518A.81. Once a participant has been reinstated, the county shall issue prorated benefits for the remaining portion of the month. A family unit that has been disqualified from the diversionary work program due to noncompliance shall not be eligible for MFIP or any other TANF cash program for the remainder of the four-month period. In a two-parent family, both parents must be in compliance before the family unit can regain eligibility for benefits.\n[See Note.]\nDWP benefits are subject to overpayments and underpayments. Anytime an overpayment or an underpayment is determined for DWP, the correction shall be calculated using prospective budgeting. Corrections shall be determined based on the policy in section 142G.30, subdivision 1, paragraphs (a), (b), and (c). ATM errors must be recovered as specified in section 256P.08, subdivision 7. Cross program recoupment of overpayments cannot be assigned to or from DWP.\n[See Note.]",
	"repealed": false
}