{
	"id": "80G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/80G.02",
	"title": "80G.02 REGISTRATION.",
	"text": "It is unlawful for a dealer or dealer representative to conduct a Minnesota transaction without being registered by the commissioner as provided for in this chapter. A dealer must submit an application to register itself and each of its dealer representatives within 45 days of reaching $25,000 in the aggregate of Minnesota transactions between July 1 and June 30 of any year, as determined by the transactions' sale or purchase prices. Once a dealer is required to register itself and its dealer representatives, the dealer must thereafter renew its registration and the registration of each of its dealer representatives in accordance with this chapter unless the person ceases to be a dealer. A dealer representative may not buy, sell, solicit, or market bullion products or investments in bullion products on behalf of a dealer unless the dealer is properly registered with the commissioner under this section.\nRegistrations issued or renewed by the commissioner under this chapter shall expire on June 30 and must be renewed.\nThe application and renewal forms shall include the following information, as applicable, which shall be considered by the commissioner in determining whether to issue a registration and whether to thereafter renew the registration:\n(1) the name, assumed names, doing business as names, including caller identification names, and business addresses of the dealer, the name of each owner and officer, and the name and primary work location of each dealer representative. A dealer who desires to carry on business in more than one location shall identify each address where business is conducted;\n(2) if a dealer is doing business under any name other than the dealer's legal name, documentation that the assumed name has been properly filed with the secretary of state or appropriate government office;\n(3) the dealer's primary telephone number, email address, and website domain name used or intended to be used by the dealer and its dealer representatives to buy, sell, solicit, market, or deliver to consumers bullion products or investments in bullion products;\n(4) the disclosure of all criminal convictions by any court, including military courts, within the last ten years, except those relating to misdemeanor traffic citations and misdemeanor convictions involving driving under the influence, driving while intoxicated, driving without a license, reckless driving, or driving with a suspended or revoked license, and juvenile offenses, for the dealer and each officer and owner of the dealer and for each of its dealer representatives;\n(5) the disclosure of any civil judgments in favor of a government entity or government entity orders entered, filed, or issued against the dealer, its officers and owners, or its dealer representatives within the last ten years for violation of consumer protection laws or unfair trade practice laws or for failure to account to a consumer for money or property received from the consumer;\n(6) the disclosure of any settlement or other agreement with any government entity within the last ten years resolving concerns that the dealer, its officers and owners, or its coin dealer representatives violated consumer protection or unfair trade practice laws, or for failure to account to a consumer for money or property received from the consumer; and\n(7) the disclosure of any instance in which the dealer, its officers and owners, and its dealer representatives were at any time permanently or temporarily prohibited by any court of competent jurisdiction or ordered to cease and desist as the result of a government agency action from engaging in buying, selling, soliciting, or marketing of bullion products or investments in bullion products. A dealer may rely on the screening process provided for in section 80G.05 and the statements of its dealer representatives for the purposes of complying with the disclosure requirements of this clause relating to dealer representatives, provided that such reliance is reasonable, in good faith, and the dealer has no knowledge of information suggesting that the screening results or statement are inaccurate.\nA registered dealer must provide the commissioner written notice of a change in the dealer's name, assumed names, doing business as names, business addresses, including all business addresses at which it or its dealer representatives conduct business, owners, email addresses, website domain names, or primary telephone number used by it or its dealer representatives to buy, sell, solicit, or market to consumers bullion products or investments in bullion products no later than 30 days after the change occurs.\n(a) The fee for each registration under this chapter shall be as follows:\n(1) dealers, $25; and\n(2) dealer representatives, $10.\n(b) The commissioner, based on the cost of processing registrations, may adjust the registration fee on an annual basis as needed.",
	"repealed": false
}