{
	"id": "142E.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.32",
	"title": "142E.32 CHILD CARE SERVICES GRANTS.",
	"text": "(a) The commissioner shall distribute funds to the child care resource and referral programs designated under sections 142E.30 and 142E.31, subdivision 2, for child care services grants to improve child care quality, support start-up of new programs, and expand existing programs.\n(b) Up to ten percent of funds appropriated for grants under this section may be used by the commissioner for statewide child care development initiatives, training initiatives, collaboration programs, and research and data collection. The commissioner shall develop eligibility guidelines and a process to distribute funds under this paragraph.\n(c) At least 90 percent of funds appropriated for grants under this section may be distributed by the commissioner to child care resource and referral programs under sections 142E.30 and 142E.31, subdivision 2, based on the following factors:\n(1) the number of children under 13 years of age needing child care in the region;\n(2) the region served by the program;\n(3) the ratio of children under 13 years of age needing child care to the number of licensed spaces in the region;\n(4) the number of licensed child care providers and school-age care programs in the region; and\n(5) other related factors determined by the commissioner.\n(d) Child care resource and referral programs must award child care services grants based on the recommendation of the child care district proposal review committees under subdivision 3.\n(e) The commissioner may distribute funds under this section for a two-year period.\nA child care resource and referral program designated under sections 142E.30 and 142E.31, subdivision 2, may award child care services grants to:\n(1) a child care center licensed under Minnesota Rules, chapter 9503, or in the process of becoming licensed;\n(2) a family or group family child care home licensed under Minnesota Rules, chapter 9502, or in the process of becoming licensed;\n(3) corporations or public agencies that develop or provide child care services;\n(4) a school-age care program;\n(5) a tribally licensed child care program; or\n(6) legal nonlicensed or family, friend, and neighbor child care providers.\n(a) Child care district proposal review committees review applications for child care services grants under this section and make funding recommendations to the child care resource and referral program designated under sections 142E.30 and 142E.31, subdivision 2. Each region within a district must be represented on the review committee. The child care district proposal review committees must complete their reviews and forward their recommendations to the child care resource and referral district programs by the date specified by the commissioner.\n(b) A child care resource and referral district program shall establish a process to select members of the child care district proposal review committee. Members must reflect a broad cross-section of the community, and may include the following constituent groups: family child care providers, child care center providers, school-age care providers, parents who use child care services, health services, social services, public schools, Head Start, employers, representatives of cultural and ethnic communities, and other citizens with demonstrated interest in child care issues. Members of the proposal review committee with a direct financial interest in a pending grant proposal may not provide a recommendation or participate in the ranking of that grant proposal.\n(c) The child care resource and referral district program may offer a stipend to proposal review committee members for participating in the grant review process.\n(a) A child care resource and referral program designated under sections 142E.30 and 142E.31, subdivision 2, may award child care services grants for:\n(1) creating new licensed child care facilities and expanding existing facilities, including, but not limited to, supplies, toys, equipment, facility renovation, and remodeling;\n(2) child care facility improvements, including but not limited to, improvements to meet licensing requirements;\n(3) staff training and development services including but not limited to in-service training, curriculum development, accreditation, certification, consulting, resource centers, program and resource materials, supporting effective teacher-child interactions, child-focused teaching, and content-driven classroom instruction;\n(4) capacity building through the purchase of appropriate technology to create, enhance, and maintain business management systems;\n(5) emergency assistance for child care programs;\n(6) new programs or projects for the creation, expansion, or improvement of programs that serve ethnic immigrant and refugee communities;\n(7) targeted recruitment initiatives to expand and build the capacity of the child care system and to improve the quality of care provided by legal nonlicensed child care providers; and\n(8) other uses as approved by the commissioner.\n(b) A child care resource and referral organization designated under sections 142E.30 and 142E.31, subdivision 2, may award child care services grants for eligible programs in amounts up to a maximum determined by the commissioner for each type of eligible program.",
	"repealed": false
}