{
	"id": "80A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.60",
	"title": "80A.60 SECTION 405; FEDERAL COVERED INVESTMENT ADVISER NOTICE FILING REQUIREMENT.",
	"text": "(a) Notice filing requirement. Except with respect to a federal covered investment adviser described in subsection (b), it is unlawful for a federal covered investment adviser to transact business in this state as a federal covered investment adviser unless the federal covered investment adviser complies with subsection (c).\n(b) Notice filing requirement not required. The following federal covered investment advisers are not required to comply with subsection (c):\n(1) a federal covered investment adviser without a place of business in this state if its only clients in this state are:\n(A) federal covered investment advisers, investment advisers registered under this chapter, and broker-dealers registered under this chapter;\n(B) institutional investors;\n(C) accredited investors;\n(D) bona fide preexisting clients whose principal places of residence are not in this state; or\n(E) other clients specified by rule adopted or order issued under this chapter;\n(2) a federal covered investment adviser without a place of business in this state if the person has had, during the preceding 12 months, not more than five clients that are resident in this state in addition to those specified under paragraph (1); and\n(3) any other person excluded by rule adopted or order issued under this chapter.\n(c) Notice filing procedure. A person acting as a federal covered investment adviser, not excluded under subsection (b), shall file a notice, a consent to service of process complying with section 80A.88, and such records as have been filed with the Securities and Exchange Commission under the Investment Advisers Act of 1940 required by rule adopted or order issued under this chapter and pay the fees specified in section 80A.65.\n(d) Effectiveness of filing. The notice under subsection (c) becomes effective upon its filing and remains effective through December 31 of the year following the year in which it is filed. The notice may be renewed annually in such manner as prescribed by the administrator.",
	"repealed": false
}