{
	"id": "430.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.02",
	"title": "430.02 PROCEEDINGS FOR ACQUISITION OF LANDS.",
	"text": "After adoption of the resolution, the city engineer shall make and present to the council a plat and survey of the proposed improvement. The plat or survey must show character, course, and extent of the improvement and the property necessary to be taken or interfered with, the name of the owner of each parcel of property, to the extent the engineer can readily find the name, and a statement to explain the plat and survey and the character and extent of the proposed improvement. For constructing pedestrian malls or improving streets primarily for pedestrian uses, the council may employ a competent engineer or landscape architect or both, and may purchase plans or designs prepared by a competent engineer or landscape architect, to aid the city engineer in duties under this chapter.\nA plat and survey finally adopted by the city council must be filed with the city clerk and must be held to show correctly the character and extent of the improvement actually agreed upon and ordered by the city council.\nThe plat must also show the amount of land taken from each owner, to the extent the owners are known, and the lands contiguous to the improvements.\nThe city council shall appoint five freeholders of the city, no two of whom reside in the same ward, as commissioners. Their duties are to view the premises and to determine and award the amount of damages and compensation to be paid to the owners of property to be taken or injured by the improvement, and to assess the amount of the damages and compensation and the expenses of the improvement upon the lands and property to be benefited by the improvement, in proportion to the benefits to be received by each parcel and without regard to a cash valuation.\nThree or more commissioners constitute a quorum and may perform any duty required of the commissioners. Commissioners must be notified of their appointment. Commissioners must be sworn to the faithful discharge of their duties. A vacancy must be filled by the city council.\n(a) The commissioners shall give notice, in a manner appropriate to inform the public:\n(1) that the survey and plat and the pedestrian mall ordinance, if any, are on file and available for examination in the office of the city clerk;\n(2) that the commissioners will meet on a day and at a place designated in the notice on or near the proposed improvement and view the property proposed to be taken or interfered with for the purposes of the improvement, ascertain and award compensation and damages, view the premises to be benefited by the improvement, assess on the benefited premises, in proportion to the benefits, the amount necessary to pay the compensation and damage, and the cost of making the improvement, and hear allegations and proof offered by interested persons.\n(b) The commissioners shall meet and view the premises according to the notice. After having viewed the premises, they may, for the hearing of evidence and preparation of their award and assessment, adjourn or go to any other convenient place in the city, and may have the aid and advice of the city engineer and of any other city officer. If a pedestrian mall ordinance is proposed by the council under section 430.011 in connection with an improvement, the commissioners may consider the business uses of abutting property affected by the ordinance and by the related improvement and the probable effect the ordinance and improvement will have on the value of the property and its uses, and the commissioners shall consider whether the property has access to another street or alley for delivering and receiving merchandise and materials and the extent to which the use and value of the property without the access under consideration will suffer as a result of the adoption of the ordinance and the making of the improvement.\n(c) After viewing the premises and hearing the evidence offered, the commissioners shall prepare and make a true and impartial appraisal and award of the compensation and damages to be paid to each person whose property is to be taken or injured in making the improvement. If the rest of the property, only a part of which is to be taken or damaged by the improvement, will be benefited by the improvement, the commissioners, in considering and awarding compensation and damages, shall also consider, estimate, and offset the benefits that will accrue to the owner because of the rest of the property, and award that owner only the excess of the compensation or damages over the benefits.\nThe commissioners shall assess the amount of the compensation and damages awarded under subdivision 3 upon the land and property benefited by the proposed improvements in proportion to the benefits, along with the expense and cost of making the improvements as fixed by the city council. No assessment may exceed the actual benefit to the assessed lot or parcel of land, less damages or injuries to the parcel that are less than the benefits. The commissioners shall prepare and report to the city council their appraisal and award. If, in their judgment, the total amount of the compensation and damages and the cost of making the improvement exceeds the actual benefits to the specific property subject to assessment, they shall also state that fact and the amount of the excess in their report.\nThe commissioners shall also prepare for the city council an assessment list containing their assessment of the compensation, damages, and costs in excess of the benefits to the property assessed. The list must contain a brief description of each tract or parcel of property assessed, the name or names of known owners of the tract, the amount assessed against each parcel of property, and the amount of the excess of the compensation, damages, and costs that they must return unassessed. If the city council has proposed a pedestrian mall ordinance under section 430.011 in connection with an improvement, the commissioners shall include in the assessment list only those properties proposed to be assessed for the improvement under the proposed ordinance.\nThe commissioners may employ clerical assistance. The cost of the clerical help, the commissioners' compensation, and the expenses of printing the notices required, including the notice of consideration by the city council estimated at the same rate per line as the cost of printing the prior notices, must be added to the other amounts to be assessed and must be assessed with them. The city attorney shall represent the city before the commissioners and produce required evidence.\nExcept in the case of motor vehicle parking lots, the city council may provide by the resolution appointing commissioners that a specified percentage, not exceeding 75 percent, of the total damages and costs must be payable out of the city's general funds. The city's share must then either be added to the amount of the certificates to be issued and sold under section 430.12 or provided by the issue of general obligation permanent improvement bonds. The city council shall annually levy a tax upon the taxable property of the city to pay any issued bonds with interest. Any amount required to be paid out of the general fund must not be assessed.\nThe commissioners shall file their completed report with the city clerk. The city clerk shall then prepare a list of descriptions of the several lots and parcels of land taken for the proposed improvements, the amount awarded for the taking of each lot or parcel, the names of the owner or owners of each lot or parcel, descriptions of the several lots or parcels of land upon which benefits have been assessed, the amount assessed against each lot or parcel, and the names of the owner or owners of each lot or parcel. The names of owners must be obtained from the commissioners or, if necessary, from the records in the office of the county treasurer. The clerk shall give notice of the proceedings appropriate to inform the owners of the proposed action. The notice must designate a place and time at which a committee appointed by the board of park commissioners or of the council will meet to hear and consider objections to making the improvement, to the amount of damages awarded for taking or interfering with the property involved, and to the amount of the assessment for benefits to any property affected by the proceedings, and claims of irregularities in the proceedings of the city council, the board of park commissioners, or the commissioners appointed by the council or the board. Objections or claims may be made by or on behalf of an owner of a lot or parcel taken or interfered with or assessed for benefits because of the improvements.\nImmediately after the notice is given under subdivision 7 and at least two weeks before the time of the meeting of the committee designated in the notice, the city clerk shall serve a copy of the notice upon each owner of land taken for the proposed improvement or land upon which benefits have been assessed. The notice must be served by depositing it in the United States mail, postage prepaid, in an envelope plainly bearing on its front in at least 10-point type the words \"Notice of Tax Assessments for Improvements Affecting Your Property,\" and the owner's last known address, as obtained from the records of the city clerk or the county treasurer. The failure of an owner to receive notice does not invalidate proceedings under this chapter.\nIf a pedestrian mall ordinance is proposed to be adopted in connection with an improvement under section 430.011, a copy of the proposed ordinance must be mailed with the notice.\n(a) A person may protest the proposed improvement if the person's property is proposed to be taken, interfered with, or assessed for benefits under this chapter and if the person: (1) objects to the making of the improvement; or (2) thinks that there has been an irregularity in the proceedings of the city council or the commissioners appointed by it so that the award of the commissioners ought not to be confirmed; or (3) is dissatisfied with the amount of damages awarded for the taking of or interference with the person's property or with the amount of the assessment for benefits to any property affected by the proceedings.\n(b) To protest, the person shall appear at the hearing or file with the city clerk designated in the published notice, at any time before the hearing or before the report and recommendation of the committee is filed, the person's (1) written objection to the making of the improvement, (2) objection to the damages awarded or benefits assessed, or (3) claim of a specific irregularity affecting specific property. An affected property owner or citizen or taxpayer of the city may appear at the hearing in support of or to object to the adoption of a pedestrian mall ordinance proposed under section 430.011 or may file written statements in support of or objecting to the adoption of the ordinance.\nAt the time and place designated in the published hearing notice, the city clerk shall present to the committee the report of the appointed commissioners and written objections or statements filed with the city clerk. The committee shall then consider those items, hear the objectors and persons appearing in favor of or against the adoption of a proposed pedestrian mall ordinance or their representatives, and adjourn the hearing as necessary.\nWithin ten days after the conclusion of the hearing the committee shall file with the city clerk its report and recommendation on the matter submitted to it. At that time the city clerk shall give notice that the report and recommendation have been filed and that they and the report of the commissioners will be considered by the city council at a meeting designated in the notice. The notice must be given so as to inform the persons affected and the public.\nOn the day set in the notice for the consideration of the reports and recommendation, or at a later meeting to which the reports and recommendation may stand over or be referred, the city council may, by resolution, annul the proceedings, confirm or annul any or all of the awards and assessments, or send them back to the commissioners for further consideration. If further consideration is required, the commissioners may meet again at a time and place designated in a notice mailed by the city clerk to interested persons at least two weeks before the meeting, hear any further evidence given by interested persons, adjourn the meeting as necessary, correct, alter, or revise any mistakes in the award and assessment, and again report to the city council.\nThe council may confirm or annul the new report. In confirming the awards and assessments, the city council shall give its final reading to and vote on the adoption of any pedestrian mall ordinance proposed in connection with the improvement under section 430.011. If the ordinance is amended or fails to be adopted any improvement begun in connection with the proposed ordinance must either be abandoned or the awards and assessments must be returned to the commissioners for further consideration.\nConfirmation of an award and assessment by the city council makes the award and assessment final upon all parties interested. The city council shall then levy an assessment or, if the city council considers it necessary, a partial assessment to pay the costs of the proceedings and the improvements upon the parcels of land described in the assessment list reported by the commissioners, in accordance with the confirmed assessments or in proportion to the assessments levied.\nThe city council may delay levying assessments under this chapter until completion or substantial completion of the improvements proposed to be made when the actual cost of the improvements and proceedings has been determined. The cost may include interest at five percent per year on money advanced by the city. The city council shall then levy assessments in the proceeding, aggregating the amount of the cost or the part of the cost the city council has determined, in conformity with this chapter, upon land described in the assessment list reported to the city council by the commissioners. Assessments must be proportionate to and not greater than the amounts confirmed upon the parcels of land by the council or by the court upon appeal in the proceeding. The city council shall adopt an assessment roll of the assessments. The roll may be substantially in the following form:\n\"The city council assesses and levies on and against the land described below the sums of money set against each lot or parcel. This assessment is made to defray the compensation and damages awarded for the taking of or injury to private property and the estimated cost of improvements in and about the .... as shown on the plat and survey on file in the office of the city clerk. This levy conforms to the report and assessment of commissioners appointed to make the assessment and in proportion to benefits from the improvements to accrue to the parcels and not exceeding the benefits to the assessed parcels.",
	"repealed": false
}