{
	"id": "204C.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.35",
	"title": "204C.35 FEDERAL, STATE, AND JUDICIAL RACES.",
	"text": "(a) In a state primary when the difference between the votes cast for the candidates for nomination to:\n(1) a state legislative office is less than one-half of one percent of the total number of votes counted for that nomination or is ten votes or less and the total number of votes cast for the nomination is 400 votes or less; or\n(2) a statewide federal office, state constitutional office, statewide judicial office, congressional office, or district judicial office is less than one-quarter of one percent of the total number of votes counted for that nomination or is ten votes or less and the total number of votes cast for the nomination is 400 votes or less;\nand the difference determines the nomination, the canvassing board with responsibility for declaring the results for that office shall manually recount the vote upon receiving a written request from the candidate whose nomination is in question.\nImmediately following the meeting of the board that has responsibility for canvassing the results of the nomination, the filing officer must notify the candidate that the candidate has the option to request a recount of the votes at no cost to the candidate. This written request must be received by the filing officer no later than 5:00 p.m. on the second day after the canvass of the primary for which the recount is being sought.\n(b) In a state general election when the difference between the votes of a candidate who would otherwise be declared elected to:\n(1) a state legislative office is less than one-half of one percent of the total number of votes counted for that office or is ten votes or less and the total number of votes cast for the office is 400 votes or less; or\n(2) a statewide federal office, state constitutional office, statewide judicial office, congressional office, or district judicial office and the votes of any other candidate for that office is less than one-quarter of one percent of the total number of votes counted for that office or is ten votes or less if the total number of votes cast for the office is 400 votes or less,\nthe canvassing board shall manually recount the votes upon receiving a written request from the candidate whose election is in question.\nImmediately following the meeting of the board that has responsibility for canvassing the results of the general election, the filing officer must notify the candidate that the candidate has the option to request a recount of the votes at no cost to the candidate. Except as provided in subdivision 2b, the written request must be received by the filing officer no later than 5:00 p.m. on the second day after the canvass of the election for which the recount is being sought.\n(c) A recount must not delay any other part of the canvass. The results of the recount must be certified by the canvassing board as soon as possible.\n(d) Time for notice of a contest for an office which is recounted pursuant to this section shall begin to run upon certification of the results of the recount by the canvassing board.\n(a) A losing candidate whose name was on the ballot for nomination or election to a statewide federal office, state constitutional office, statewide judicial office, congressional office, state legislative office, or district judicial office may request a recount in a manner provided in this section at the candidate's own expense when the vote difference is greater than the difference required by this section. The votes shall be manually recounted as provided in this section if the candidate files a request during the time for filing notice of contest of the primary or election for which a recount is sought.\n(b) The requesting candidate shall file with the filing officer a bond, cash, or surety in an amount set by the filing officer for the payment of the recount expenses. The requesting candidate is responsible for the following expenses: the compensation of the secretary of state, or designees, and any election judge, municipal clerk, county auditor, administrator, or other personnel who participate in the recount; necessary supplies and travel related to the recount; the compensation of the appropriate canvassing board and costs of preparing for the canvass of recount results; and any attorney fees incurred in connection with the recount by the governing body responsible for the recount.\n(c) A discretionary recount of a primary must not delay delivery of the notice of nomination to the winning candidate under section 204C.32.\n(d) The requesting candidate may provide the filing officer with a list of up to three precincts that are to be recounted first and may waive the balance of the recount after these precincts have been counted. If the candidate provides a list, the recount official must determine the expenses for those precincts in the manner provided by paragraph (b).\n(e) The results of the recount must be certified by the canvassing board as soon as possible.\n(f) If the winner of the race is changed by the optional recount, the cost of the recount must be paid by the jurisdiction conducting the recount.\n(g) If a result of the vote counting in the manual recount is different from the result of the vote counting reported on election day by a margin greater than two votes and greater than one-quarter of one percent of the number of ballots counted, the cost of the recount must be paid by the jurisdiction conducting the recount.\nIn a state general election when the difference between the number of \"yes\" votes cast on ratification of a proposed constitutional amendment is within one-quarter percent of the number of all other ballots cast at the election, the canvassing board shall manually recount the votes on that question, including the number of \"yes\" or \"no\" votes on the question, and the number of ballots that did not cast a vote on the question. The results of the recount must be certified by the canvassing board as soon as possible.\nAny request for recount for the election of presidential electors, whether publicly funded or discretionary, must be made by 5 p.m. on the day after the canvass is completed. Any recount of votes under this section for the election of presidential electors must be completed and certified by the canvassing board no later than six days after the recount is requested.\nA recount conducted as provided in this section is limited in scope to the determination of the number of votes validly cast for the office or question to be recounted. Only the ballots cast in the election and the summary statements certified by the election judges may be considered in the recount process. Original ballots that have been duplicated under section 206.86, subdivision 5, are not within the scope of a recount and must not be examined except as provided by a court in an election contest under chapter 209.\nFor the purposes of this section, the secretary of state is the filing officer for candidates for all federal offices and for state offices voted on in more than one county. The county auditor is the filing officer for state offices voted on in only one county.\nNotwithstanding any law to the contrary, a canvassing board may direct a recount official to make images of ballots challenged by a candidate in a recount available to the public.",
	"repealed": false
}