{
	"id": "122A.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.185",
	"title": "122A.185 TEACHER LICENSURE ASSESSMENT.",
	"text": "(a) The board must adopt rules requiring applicants for Tier 3 and Tier 4 licenses to pass an examination or performance assessment of general pedagogical knowledge and examinations or assessments of licensure field specific content. An applicant is exempt from the examination requirements if the applicant:\n(1) completed a board-approved teacher preparation program;\n(2) completed licensure via portfolio pursuant to section 122A.18, subdivision 10, and the portfolio has been recommended;\n(3) obtained national board certification from the National Board for Professional Teaching Standards; or\n(4) completed a state-approved teacher preparation program in another state and passed licensure examinations in that state, if applicable. The content examination requirement does not apply if no relevant content exam exists.\n(b) All testing centers in the state must provide monthly opportunities for untimed content and pedagogy examinations. These opportunities must be advertised on the test registration website. The board must require the exam vendor to provide other equitable opportunities to pass exams, including: (1) waiving testing fees for test takers who qualify for federal grants; (2) providing free, multiple, full-length practice tests for each exam and free, comprehensive study guides on the test registration website; (3) making content and pedagogy exams available in languages other than English for teachers seeking licensure to teach in language immersion programs; and (4) providing free, detailed exam results analysis by test objective to assist applicants who do not pass an exam in identifying areas for improvement. Any applicant who has not passed a required exam after two attempts must be allowed to retake the exam, including new versions of the exam, without being charged an additional fee.\nThe board must establish passing scores in all examinations required for licensure.\nThe board and the entity administering the content and pedagogy examinations must allow any individual who produces documentation of a disability in the form of an evaluation, 504 plan, or individual education program (IEP) to receive the same testing accommodations on the content and pedagogy examinations that the applicant received during the applicant's secondary or postsecondary education.\nMS 2023 Supp [Repealed, 2024 c 109 art 3 s 20]",
	"repealed": false
}