{
	"id": "272.483",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.483",
	"title": "272.483 DUTIES OF FILING OFFICER.",
	"text": "(a) If a notice of federal lien, a refiling of a notice of federal lien, or a notice of revocation of any certificate described in clause (b) is presented to a filing officer who is:\n(1) the secretary of state; the secretary shall cause the notice to be marked and indexed alphabetically and numerically in the computerized filing system maintained by the secretary of state;\n(2) the county recorder; the county recorder shall endorse identification and the date and time of filing and file and enter it in an alphabetical index showing the name and address of the person named in the notice, the date and time of filing, the file number of the lien, and the total amount appearing on the notice of lien.\nEach county recorder shall enter the date and time of filing and the file number and shall index the names of the persons shown on the notice into the computerized database system maintained by the secretary of state.\nFor notices of federal tax liens on real property, the information in the computerized filing and database systems does not create, release, discharge, or recreate a notice of federal tax lien on real property in this state.\n(b) If a certificate of release, nonattachment, or subordination of any lien is presented to the secretary of state for filing, the secretary shall:\n(1) enter the information into the computerized filing system;\n(2) cause a certificate of release or nonattachment to be marked and indexed as if the certificate were a termination statement within the meaning of the Uniform Commercial Code, but the notice of lien to which the certificate relates may not be removed from the files until ten years and 30 days after the filing date of the lien; and\n(3) cause a certificate of subordination to be marked and indexed as if the certificate were a release of collateral within the meaning of the Uniform Commercial Code.\n(c) If a refiled notice of federal lien referred to in clause (a) or any of the certificates or notices referred to in clause (b) is presented for filing to any other filing officer specified in section 272.481, the officer shall enter the refiled notice or the certificate with the date and time of filing in any alphabetical lien index where the original notice of lien is entered.\n(d) When a filing officer receives a request to search the records for the name of a particular person, the filing officer must issue a search certificate showing whether there is any notice of lien or certificate or notice of lien filed on or after ten years and 30 days before the date of the search. If a notice or certificate is on file, the search certificate must state the file or document number of the notice and the date and time of filing of each notice or certificate and the date and time the search certificate was issued. The fee for a certificate shall be that provided by section 336.9-525 or 357.18, subdivision 1, clause (3).",
	"repealed": false
}