{
	"id": "299L.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/299L.02",
	"title": "299L.02 DUTIES OF DIVISION OF ALCOHOL AND GAMBLING ENFORCEMENT.",
	"text": "(a) The director shall when required under chapter 349A or when requested by the director of the lottery conduct background checks on employees of the State Lottery, lottery retailers, and bidders of lottery procurement contracts.\n(b) The director shall, when so requested by the director of the State Lottery or when the director believes it to be reasonable and necessary, conduct investigations of lottery retailers, applicants for lottery retailer contracts, suppliers of goods or services to the State Lottery, and persons bidding on contracts for goods or services with the State Lottery.\n(c) The director shall conduct an annual security audit of the State Lottery, or arrange for such an audit by an outside agency or person, firm, or corporation. The director shall report to the director of the lottery on the results of the audit.\nThe director shall:\n(1) conduct background investigations of applicants for licensing as a manufacturer or distributor of gambling equipment or as a bingo hall under chapter 349; and\n(2) when requested by the director of gambling control, or when the director believes it to be reasonable and necessary, inspect the premises of a licensee under chapter 349 to determine compliance with law and with the rules of the board, or to conduct an audit of the accounts, books, records, or other documents required to be kept by the licensee.\nThe director may charge applicants under clause (1) a reasonable fee to cover the costs of the investigation.\n(a) The director shall conduct background investigations as provided by law on all applicants for licenses issued by the Minnesota Racing Commission.\n(b) The director shall, upon request of the director of the racing commission, or when the director believes it to be reasonable and necessary, investigate the activities of a licensee of the Minnesota Racing Commission to determine the licensee's compliance with law and with rules of the commission.\nThe director shall cooperate with all state and local agencies in the detection and apprehension of unlawful gambling.\nIn any background check required to be conducted by the division under this chapter, chapter 240, 349, 349A, or section 3.9221, the director may, or shall when required by law, require that fingerprints be taken and the director may forward the fingerprints to the Federal Bureau of Investigation for the conducting of a national criminal history check. The director may charge a fee of $15 for fingerprint recording and investigation under section 3.9221.\nThe director shall exercise oversight over all background checks on manufacturers and distributors who supply machines, games, software, or other gambling materials used in electronic pull-tabs, electronic bingo, or professional sports tipboards, to ensure the integrity of new forms of gambling entering the Minnesota market.\nAn applicant, licensee, or the person subject to the jurisdiction of the commissioner or director under this chapter, must:\n(1) comply with a request from the commissioner or director for information, documents, or other material within 30 days of the mailing of the request by the commissioner or director unless the notice specifies a different time; and\n(2) appear before the commissioner or director when requested to do so, and must bring documents or materials that the commissioner or director has requested.\nThe director shall deposit in a separate account in the state treasury all money received from Indian tribal governments for charges for investigations and background checks under compacts negotiated under section 3.9221, except for $7 from each charge that shall be deposited in the general fund. Money in the account is appropriated to the director for the purpose of carrying out the director's powers and duties under those compacts.",
	"repealed": false
}