{
	"id": "349.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.17",
	"title": "349.17 CONDUCT OF BINGO.",
	"text": "MS 2004 [Repealed, 2005 c 166 art 1 s 38]\nDuring any bingo occasion conducted by an organization, the organization is directly responsible for the:\n(1) staffing of the bingo occasion;\n(2) conducting of lawful gambling during the bingo occasion;\n(3) acquiring, storage, inventory control, and reporting of all gambling equipment used by the organization;\n(4) receipt, accounting, and all expenditures of gross receipts from lawful gambling; and\n(5) preparation of the bingo packets.\nMS 2000 [Repealed, 2002 c 386 art 1 s 12]\nEach bingo winner must be determined and every prize shall be awarded and delivered the same day on which the bingo occasion is conducted, except that payment for a bingo prize of $200 or more must be delivered within three business days of the day on which the occasion was conducted.\nOne or more checkers must be engaged for each bingo occasion when bingo is conducted using bingo hard cards. The checker or checkers must record, on a form the board provides, the number of hard cards played in each game and the prizes awarded to recorded hard cards. The form must provide for the inclusion of the face number of each winning hard card and must include a checker's certification that the figures recorded are correct to the best of the checker's knowledge.\n(a) The board shall by rule require that all licensed organizations: (1) conduct bingo only using a bingo paper sheet or facsimile of a bingo face that bears an individual number recorded by the distributor or linked bingo game provider; and (2) use each bingo paper sheet for no more than one bingo occasion. In lieu of the requirements of clause (2), a licensed organization may electronically record the sale of each bingo hard card or paper sheet at each bingo occasion using an electronic recording system approved by the board.\n(b) The requirements of paragraph (a) shall only apply to a licensed organization that received gross receipts from bingo in excess of $150,000 in the organization's last fiscal year.\n(c) Each bingo hard card, bingo paper sheet, or a facsimile of a bingo paper sheet must have five horizontal rows of spaces with each row except one having not more than two numbers in each space. The center row must have four spaces with not more than two numbers in each space and the center space marked \"free.\" Each column must have one of the letters B-I-N-G-O in order at the top. Bingo paper sheets may have numbers that are not preprinted but are filled in by players.\nThe price of a face played on an electronic bingo device may not be less than the price of a face on a bingo paper sheet sold for the same game at the same occasion. Bingo gift certificates must only be sold for face value. A game of bingo begins with the first letter and number called or displayed. Each player must cover, mark, or activate the numbers when bingo numbers are randomly selected and announced or displayed to the players. The game is won when a player, using bingo paper, bingo hard card, or a facsimile of a bingo paper sheet, has completed, as described in the bingo program, a previously designated pattern or previously determined requirements of the game and declared bingo. A bingo pattern or bingo game requirement may not be completed with fewer than three bingo numbers having been drawn, unless the game being played is a cover-none game. The game is completed when a winning card, sheet, or facsimile is verified and a prize awarded pursuant to subdivision 3.\nAn organization may conduct bar bingo subject to the following restrictions:\n(1) the bingo is conducted at a site the organization owns or leases and which has a license for the on-sale of intoxicating beverages on the premises under chapter 340A or where on-sale 3.2 percent malt beverages are sold; and\n(2) the bingo is conducted using only bingo paper sheets or facsimiles of bingo paper sheets purchased from a licensed distributor or licensed linked bingo game provider.\n(a) A licensed organization may conduct or participate in linked bingo games, including progressive games in which a portion of the prize is carried over from one game to another until won by a player achieving a valid bingo based upon a predetermined and posted win determination.\n(b) Linked bingo games may only be conducted by licensed organizations who have a valid agreement with the linked bingo game provider.\n(c) An electronic bingo device as defined in section 349.12, subdivision 12a, may be used for a linked bingo game.\n(d) The board may adopt rules to:\n(1) specify the manner in which a linked bingo game must be played and how the linked bingo prizes must be awarded;\n(2) specify the records to be maintained by a linked bingo game provider;\n(3) require the submission of periodic reports by the linked bingo game provider and specify the content of the reports;\n(4) establish the qualifications required to be licensed as a linked bingo game provider; and\n(5) any other matter involving the operation of a linked bingo game.\nIn addition to the requirements of subdivision 8, the following requirements and restrictions apply when linked bingo games are played exclusively on electronic bingo devices.\n(a) The permitted premises must be:\n(1) a premises licensed for the on-sale of intoxicating liquor or on-sale 3.2 percent malt beverages; or\n(2) a premises where bingo is conducted as the primary business and has a seating capacity of at least 100.\n(b) The number of electronic bingo devices is limited to:\n(1) no more than six devices in play for permitted premises with 200 seats or less;\n(2) no more than 12 devices in play for permitted premises with 201 seats or more; and\n(3) no more than 50 devices in play for permitted premises where bingo is the primary business.\nSeating capacity is determined as specified under the local fire code.\n(c) Prior to a bingo occasion, the linked bingo game provider, on behalf of the participating organizations, must provide to the board a bingo program in a format prescribed by the board.\n(d) Before participating in the play of a linked bingo game, a player must present a valid picture identification card that includes the player's date of birth. Except for prize receipts required by section 349.19, subdivision 10, an organization is not required to register or retain any information contained on the player's picture identification card.\n(e) A licensed organization must require each person cashing out an electronic linked bingo device with $600 or more in credits to present identification in the form of a driver's license, Minnesota identification card, or other identification the board deems sufficient to allow the identification and tracking of the winner. The organization must retain the winner's identification in the form of a prize receipt for 3-1/2 years. A prize receipt for electronic linked bingo must include the same information as is required in board rules for a paper pull-tab game prize receipt.\n(f) Except for prize receipts required by paragraph (e), an organization is not required to register or retain any information contained on the player's picture identification card.\n(g) An organization may remove from play a device that a player has not maintained in an activated mode for a specified period of time determined by the organization. The organization must provide the notice in its house rules.\nA hot-ball bingo prize may be funded by an organization or by players. If funded by an organization, all players participating in a bingo game that offers a hot-ball bingo prize must be eligible to win the hot-ball bingo prize at no additional cost to the player. If a hot-ball bingo prize is funded by players, players that have paid to be eligible to win the hot-ball bingo prize must be provided a bingo paper sheet that is a different color than players participating in the bingo game that are not eligible to win the hot-ball bingo prize.",
	"repealed": false
}