{
	"id": "97A.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.075",
	"title": "97A.075 USE OF LICENSE REVENUES.",
	"text": "(a) For purposes of this subdivision, \"deer license\" means a license issued under section 97A.475, subdivisions 2, clauses (5), (6), (7), (15), (16), and (17); 3, paragraph (a), clauses (2), (3), (4), (12), (13), and (14); and 8, paragraph (b), and licenses issued under section 97B.301, subdivision 4.\n(b) The deer management account is established as an account in the game and fish fund and may be used only for deer habitat improvement or deer management programs, including a computerized licensing system. The following amounts must be credited to the deer management account:\n(1) $16 from each annual deer license issued under section 97A.475, subdivisions 2, clauses (5), (6), and (7); 3, paragraph (a), clauses (2), (3), and (4); and 8, paragraph (b);\n(2) $2 from each annual deer license issued under sections 97A.475, subdivisions 2, clauses (15), (16), and (17); and 3, paragraph (a), clauses (12), (13), and (14); and 97B.301, subdivision 4; and\n(3) $16 annually from the lifetime fish and wildlife trust fund, established under section 97A.4742, for each license issued to a person 18 years of age or older under section 97A.473, subdivision 4, and $2 annually from the lifetime fish and wildlife trust fund for each license issued to a person under 18 years of age.\n(c) $1 from each annual deer license and each bear license and $1 annually from the lifetime fish and wildlife trust fund, established in section 97A.4742, for each license issued under section 97A.473, subdivision 4, must be credited to the deer and bear management account and is appropriated to the commissioner for deer- and bear-management programs, including a computerized licensing system.\n(d) Fifty cents from each deer license is credited to the emergency deer feeding and wild Cervidae health-management account and is appropriated for emergency deer feeding and wild Cervidae health management. Money appropriated for emergency deer feeding and wild Cervidae health management is available until expended.\n(e) When the unencumbered balance in the appropriation for emergency deer feeding and wild Cervidae health management exceeds $2,500,000 at the end of a fiscal year, the unencumbered balance over $2,500,000 is canceled and is available for deer- and bear-management programs and computerized licensing.\n[See Note.]\n(a) Ninety percent of the revenue from the Minnesota migratory-waterfowl stamps must be credited to the waterfowl habitat improvement account and is appropriated to the commissioner only for:\n(1) development of wetlands and lakes in the state and designated waterfowl management lakes for maximum migratory waterfowl production including habitat evaluation, the construction of dikes, water control structures and impoundments, nest cover, common carp barriers, acquisition of sites and facilities necessary for development and management of existing migratory waterfowl habitat and the designation of waters under section 97A.101;\n(2) management of migratory waterfowl;\n(3) development, restoration, maintenance, or preservation of migratory waterfowl habitat;\n(4) acquisition of and access to structure sites; and\n(5) the promotion of waterfowl habitat development and maintenance, including promotion and evaluation of government farm program benefits for waterfowl habitat.\n(b) Money in the account may not be used for costs unless they are directly related to a specific parcel of land or body of water under paragraph (a), clause (1), (3), (4), or (5), or to specific management activities under paragraph (a), clause (2).\n(a) Ninety percent of the revenue from trout-and-salmon stamps must be credited to the trout and salmon management account and is appropriated to the commissioner only for:\n(1) the development, restoration, maintenance, improvement, protection, and preservation of habitat for trout and salmon in trout streams and lakes, including, but not limited to, evaluating habitat; stabilizing eroding stream banks; adding fish cover; modifying stream channels; managing vegetation to protect, shade, or reduce runoff on stream banks; and purchasing equipment to accomplish these tasks;\n(2) rearing trout and salmon, including utility and service costs associated with coldwater hatchery buildings and systems; stocking trout and salmon in streams and lakes and Lake Superior; and monitoring and evaluating stocked trout and salmon;\n(3) acquisition of easements and fee title along trout waters;\n(4) identifying easement and fee title areas along trout waters; and\n(5) research and special management projects on trout streams, trout lakes, and Lake Superior and portions of its tributaries.\n(b) Money in the account may not be used for costs unless they are directly related to a specific parcel of land or body of water under paragraph (a), to specific fish rearing activities under paragraph (a), clause (2), or for costs associated with supplies and equipment to implement trout and salmon management activities under paragraph (a).\n(a) Ninety percent of the revenue from pheasant stamps must be credited to the pheasant habitat improvement account and is appropriated to the commissioner only for:\n(1) the development, restoration, and maintenance of suitable habitat for ringnecked pheasants on public and private land including the establishment of nesting cover, winter cover, and reliable food sources;\n(2) reimbursement of landowners for setting aside lands for pheasant habitat;\n(3) reimbursement of expenditures to provide pheasant habitat on public and private land;\n(4) the promotion of pheasant habitat development and maintenance, including promotion and evaluation of government farm program benefits for pheasant habitat; and\n(5) the acquisition of lands suitable for pheasant habitat management and public hunting.\n(b) Money in the account may not be used for:\n(1) costs unless they are directly related to a specific parcel of land under paragraph (a), clause (1), (3), or (5), or to specific promotional or evaluative activities under paragraph (a), clause (4); or\n(2) any personnel costs, except that prior to July 1, 2019, personnel may be hired to provide technical and promotional assistance for private landowners to implement conservation provisions of state and federal programs.\n(a) $4.50 from each turkey license sold, except youth licenses under section 97A.475, subdivision 2, clause (4), and subdivision 3, paragraph (a), clause (7), must be credited to the wild-turkey management account and is appropriated to the commissioner only for:\n(1) the development, restoration, and maintenance of suitable habitat for wild turkeys on public and private land including forest stand improvement and establishment of nesting cover, winter roost area, and reliable food sources;\n(2) acquisitions of, or easements on, critical wild-turkey habitat;\n(3) reimbursement of expenditures to provide wild-turkey habitat on public and private land;\n(4) trapping and transplantation of wild turkeys; and\n(5) the promotion of turkey habitat development and maintenance, population surveys and monitoring, and research.\n(b) Money in the account may not be used for:\n(1) costs unless they are directly related to a specific parcel of land under paragraph (a), clauses (1) to (3), a specific trap and transplant project under paragraph (a), clause (4), or to specific promotional or evaluative activities under paragraph (a), clause (5); or\n(2) any permanent personnel costs.\nRevenue from walleye stamps must be credited to the walleye stamp account and is appropriated to the commissioner only for stocking walleyes purchased from the private sector in waters of the state.\n(a) For purposes of this subdivision, \"wolf license\" means a license or permit issued under section 97A.475, subdivision 2, clause (22); 3, paragraph (a), clause (18); or 20, paragraph (b).\n(b) A wolf management and monitoring account is created in the game and fish fund. Revenue from wolf licenses must be credited to the wolf management and monitoring account and is appropriated to the commissioner only for wolf management, research, damage control, enforcement, and education. Notwithstanding any other law to the contrary, money credited to the account may not be used to pay indirect costs or agency shared services.",
	"repealed": false
}