{
	"id": "62Q.186",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.186",
	"title": "62Q.186 PROHIBITION ON RESCISSIONS OF HEALTH PLANS.",
	"text": "(a) \"Rescission\" means a cancellation or discontinuance of coverage under a health plan that has a retroactive effect.\n(b) \"Rescission\" does not include:\n(1) a cancellation or discontinuance of coverage under a health plan if:\n(i) the cancellation or discontinuance of coverage has only a prospective effect; or\n(ii) the cancellation or discontinuance of coverage is effective retroactively to the extent it is attributable to a failure to timely pay required premiums or contributions toward the cost of coverage; or\n(2) when the health plan covers only active employees and, if applicable, dependents and those covered under continuation coverage provisions, the employee pays no premiums for coverage after termination of employment and the cancellation or discontinuance of coverage is effective retroactively back to the date of termination of employment due to a delay in administrative record keeping.\n(a) A health plan company shall not rescind coverage under a health plan with respect to an individual, including a group to which the individual belongs or family coverage in which the individual is included, after the individual is covered under the health plan, unless:\n(1) the individual, or a person seeking coverage on behalf of the individual, performs an act, practice, or omission that constitutes fraud; or\n(2) the individual makes an intentional misrepresentation or omission of material fact, as prohibited by the terms of the health plan.\nFor purposes of this section, a person seeking coverage on behalf of an individual does not include an insurance producer or employee or authorized representative of the health carrier.\n(b) This section does not apply to any benefits classified as excepted benefits under United States Code, title 42, section 300gg-91(c), or regulations enacted thereunder from time to time.\nA health plan company shall provide at least 30 days' advance written notice to each individual who would be affected by the proposed rescission of coverage before coverage under the health plan may be terminated retroactively.\nNothing in this section allows rescission if rescission would otherwise be prohibited under section 62A.04, subdivision 2, clause (2).",
	"repealed": false
}