{
	"id": "103B.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.103",
	"title": "103B.103 EASEMENT STEWARDSHIP ACCOUNTS.",
	"text": "(a) The water and soil conservation easement stewardship account and the mitigation easement stewardship account are created in the special revenue fund. The accounts consist of money credited to the accounts and interest and other earnings on money in the accounts. The State Board of Investment must manage the accounts to maximize long-term gain.\n(b) Revenue from contributions and money appropriated for any purposes of the account as described in subdivision 2 must be deposited in the water and soil conservation easement stewardship account. Revenue from contributions, mitigation fees designated for stewardship purposes by the board, easement stewardship payments authorized under subdivision 3, and money appropriated for any purposes of the account as described in subdivision 2 must be deposited in the mitigation easement stewardship account.\nFive percent of the balance on July 1 each year in the water and soil conservation easement stewardship account and five percent of the balance on July 1 each year in the mitigation easement stewardship account are annually appropriated to the board and may be spent to cover the costs of managing easements held by the board, including costs associated with:\n(1) repairing or replacing structures;\n(2) monitoring;\n(3) landowner contacts;\n(4) records storage and management;\n(5) processing landowner notices;\n(6) requests for approval or amendments;\n(7) enforcement; and\n(8) legal services associated with easement management activities.\nThe board shall seek a financial contribution to the water and soil conservation easement stewardship account for each conservation easement acquired by the board. The board shall seek a financial contribution or assess an easement stewardship payment to the mitigation easement stewardship account for each wetland mitigation easement acquired by the board. Unless otherwise provided by law, the board shall determine the amount of the contribution or payment, which must be an amount calculated to earn sufficient money to meet the costs of managing the easement at a level that neither significantly overrecovers nor underrecovers the costs. In determining the amount of the financial contribution, the board shall consider:\n(1) the estimated annual staff hours needed to manage the conservation easement, taking into consideration factors such as easement type, size, location, and complexity;\n(2) the average hourly wages for the class or classes of state and local employees expected to manage the easement;\n(3) the estimated annual travel expenses to manage the easement;\n(4) the estimated annual miscellaneous costs to manage the easement, including supplies and equipment, information technology support, and aerial flyovers;\n(5) the estimated annualized costs of legal services, including the cost to enforce the easement in the event of a violation;\n(6) the estimated annualized costs for repairing or replacing water control structures; and\n(7) the expected rate of return on investments in the account.",
	"repealed": false
}