{
	"id": "469.1731",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1731",
	"title": "469.1731 BORDER CITY DEVELOPMENT ZONES.",
	"text": "To encourage economic development, to revitalize the designated areas, to expand tax base and economic activity, and to provide job creation, growth, and retention, the following border cities may designate, by resolution, areas of the city as development zones after a public hearing upon 30-day notice.\n(a) The city of Breckenridge may designate all or any part of the city as a zone.\n(b) The city of Dilworth may designate between one and six areas of the city as zones containing not more than 100 acres in the aggregate.\n(c) The city of East Grand Forks may designate all or any part of the city as a zone.\n(d) The city of Moorhead may designate between one and six areas of the city as zones containing not more than 100 acres in the aggregate.\n(e) The city of Ortonville may designate between one and six areas of the city as zones containing not more than 100 acres in the aggregate.\n(a) Before designating a development zone, the city must adopt a written development plan that addresses:\n(1) evidence of adverse economic conditions within the area resulting from competition with the bordering state or the 1997 floods or both;\n(2) the viability of the development plan;\n(3) public and private commitment to and other resources available for the area;\n(4) how designation would relate to a development and revitalization plan for the city as a whole; and\n(5) how the local regulatory burden will be eased for businesses operating in the area.\n(b) The development plan must include:\n(1) a map of the proposed zone that indicates the geographic boundaries, the total area, and the present use and conditions generally of land and structures within the area;\n(2) evidence of community support and commitment from business interests;\n(3) a description of the methods proposed to increase economic opportunity and expansion, facilitate infrastructure improvement, and identify job opportunities; and\n(4) the duration of the zone designation, not to exceed 15 years.\nThe city must file a copy of the resolution and development plan with the commissioner of employment and economic development. The designation takes effect 30 days after the filing.",
	"repealed": false
}