{
	"id": "181A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.07",
	"title": "181A.07 EXEMPTIONS.",
	"text": "Minors employed in corn detasseling operations and other agricultural operations, with the permission of their parents or guardian, shall be exempt from the provisions of section 181A.04, subdivision 4. Such minors 12 years of age or older are exempt from the age provision of section 181A.04, subdivision 1.\nAny minor employed as an actor, model, or performer shall be exempt from the minimum age provisions of section 181A.04, subdivision 1.\nNewspaper carriers shall be exempt from the minimum age provision of section 181A.04, subdivisions 1 and 3. Such carriers shall be at least 11 years of age.\nAny minor employed to do home chores, to babysit, or employed by a parent shall be exempt from all provisions of sections 181A.01 to 181A.12.\nA minor at least 11 years of age and less than 14 years of age shall be exempt from the minimum age provisions of section 181A.04, subdivision 1, if employed as a youth athletic program referee, umpire, or official for an age bracket younger than the minor's own age if an adult representing the state or local athletic program is on the premises at which the athletic program event is occurring and a person responsible for the state or local athletic program possesses a written acknowledgment signed by the minor's parent or guardian consenting to the minor's employment as a referee, umpire, or official.\nThe commissioner may grant exemptions from any provisions of sections 181A.01 to 181A.12 for an individual minor if the commissioner finds that such an exemption would be in the best interest of the minor involved. Such exemptions shall be granted only in accordance with the established rules of the department.\nAny minor's parent or guardian, school official, or youth employment specialist may request an exemption as provided in subdivision 5.\nThe commissioner may grant exemptions from any provisions of sections 181A.01 to 181A.12 for minors participating in training programs approved by the commissioner; or students in a valid apprenticeship program taught by or required by a trade union, the commissioner of education, the commissioner of employment and economic development, the Board of Trustees of the Minnesota State Colleges and Universities, or the Board of Regents of the University of Minnesota.",
	"repealed": false
}