{
	"id": "144.1508",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1508",
	"title": "144.1508 CLINICAL HEALTH CARE TRAINING.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Accredited clinical training\" means the clinical training provided by a medical education program that is accredited through an organization recognized by the Department of Education, the Centers for Medicare and Medicaid Services, or another national body that reviews the accrediting organizations for multiple disciplines and whose standards for recognizing accrediting organizations are reviewed and approved by the commissioner of health.\n(c) \"Clinical medical education program\" means the accredited clinical training of physicians, medical students, residents, doctors of pharmacy practitioners, doctors of chiropractic, dentists, advanced practice nurses, clinical nurse specialists, certified registered nurse anesthetists, nurse practitioners, certified nurse midwives, physician assistants, dental therapists and advanced dental therapists, psychologists, clinical social workers, community paramedics, community health workers, and other medical professions as determined by the commissioner.\n(d) \"Commissioner\" means the commissioner of health.\n(e) \"Eligible entity\" means an organization that is located in Minnesota, provides a clinical medical education experience, and hosts students, residents, or other trainee types as determined by the commissioner, and is from an accredited Minnesota teaching program and institution.\n(f) \"Eligible trainee FTEs\" means the number of trainees, as measured by full-time equivalent counts, that are training in Minnesota at an entity with either currently active medical assistance enrollment status and a National Provider Identification (NPI) number or documentation that they provide sliding fee services. Training may occur in an inpatient or ambulatory patient care setting or alternative setting as determined by the commissioner. Training that occurs in nursing facility settings is not eligible for funding under this section.\n(g) \"Teaching institution\" means a hospital, medical center, clinic, or other organization that conducts a clinical medical education program in Minnesota that is accountable to the accrediting body.\n(h) \"Trainee\" means a student, resident, fellow, or other postgraduate involved in a clinical medical education program from an accredited Minnesota teaching program and institution.\n(a) An eligible entity hosting clinical trainees from a clinical medical education program and teaching institution is eligible for funds under subdivision 3, if the entity:\n(1) is funded in part by sliding fee scale services or enrolled in the Minnesota health care program;\n(2) faces increased financial pressure as a result of competition with nonteaching patient care entities; and\n(3) emphasizes primary care or specialties that are in undersupply in rural or underserved areas of Minnesota.\n(b) An entity hosting a clinical medical education program for advanced practice nursing is eligible for funds under subdivision 3, if the program meets the eligibility requirements in paragraph (a), clauses (1) to (3), and is sponsored by the University of Minnesota Academic Health Center, the Mayo Foundation, or an institution that is part of the Minnesota State Colleges and Universities system or members of the Minnesota Private College Council.\n(c) An application must be submitted to the commissioner by an eligible entity through the teaching institution and contain the following information:\n(1) the official name and address and the site addresses of the clinical medical education programs where eligible trainees are hosted;\n(2) the name, title, and business address of those persons responsible for administering the funds;\n(3) for each applicant, the type and specialty orientation of trainees in the program; the name, entity address, medical assistance provider number, and national provider identification number of each training site used in the program, as appropriate; the federal tax identification number of each training site, where available; the total number of eligible trainee FTEs at each site; and\n(4) other supporting information the commissioner deems necessary.\n(d) An applicant that does not provide information requested by the commissioner shall not be eligible for funds for the current funding cycle.\n(a) The commissioner may distribute funds for clinical training in areas of Minnesota and for the professions listed in subdivision 1, paragraph (c), determined by the commissioner as a high need area and profession shortage area. The commissioner shall annually distribute medical education funds to qualifying applicants under this section based on the costs to train, service level needs, and profession or training site shortages. Use of funds is limited to related clinical training costs for eligible programs.\n(b) To ensure the quality of clinical training, eligible entities must demonstrate that they hold contracts in good standing with eligible educational institutions that specify the terms, expectations, and outcomes of the clinical training conducted at sites. Funds shall be distributed in an administrative process determined by the commissioner to be efficient.\n(a) Teaching institutions receiving funds under this section must sign and submit a medical education grant verification report (GVR) to verify funding was distributed as specified in the GVR. If the teaching institution fails to submit the GVR by the stated deadline, the teaching institution is required to return the full amount of funds received to the commissioner within 30 days of receiving notice from the commissioner. The commissioner shall distribute returned funds to the appropriate training sites in accordance with the commissioner's approval letter.\n(b) Teaching institutions receiving funds under this section must provide any other information the commissioner deems appropriate to evaluate the effectiveness of the use of funds for medical education.",
	"repealed": false
}