{
	"id": "550.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.143",
	"title": "550.143 LEVY ON FUNDS AT A FINANCIAL INSTITUTION.",
	"text": "When the sheriff is levying upon funds at a financial institution, this section must be complied with, in addition to the general provisions set forth in section 550.135.\nAlong with the writ of execution, the notice, instructions, and the exemption notice described in subdivision 3, the sheriff shall serve upon the financial institution an execution disclosure form which must be substantially in the following form:\nOn the ..... day of ............., ......., the time of service of execution herein, there was due and owing the judgment debtor from the third party the following:\n(1) Money. Enter on the line below any amounts due and owing the judgment debtor, except earnings, from the third party.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(2) Setoff. Enter on the line below the amount of any setoff, defense, lien, or claim which the third party claims against the amount set forth on line (1). State the facts by which such setoff, defense, lien, or claim is claimed. (Any indebtedness to a third party incurred by the judgment debtor within ten days prior to the receipt of the first execution levy on a debt is void as to the judgment creditor.)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(3) Exemption. Enter on the line below any amounts or property claimed by the judgment debtor to be exempt from execution.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(4) Adverse Interest. Enter on the line below any amounts claimed by other persons by reason of ownership or interest in the judgment debtor's property.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(5) Enter on the line below the total of lines (2), (3), and (4).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(6) Enter on the line below the difference obtained (never less than zero) when line (5) is subtracted from the amount on line (1).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(7) Enter on the line below 110 percent of the amount of the judgment creditor's claim which remains unpaid.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(8) Enter on the line below the lesser of line (6) and line (7). You are hereby instructed to remit this amount only if it is $10 or more.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nAFFIRMATION\nI, ....................... (person signing Affirmation), am the third party or I am authorized by the third party to complete this nonearnings disclosure, and have done so truthfully and to the best of my knowledge.\nIf the levy is on funds of a judgment debtor who is a natural person and if the funds to be levied are held on deposit at any financial institution, the judgment creditor or its attorney shall provide the sheriff with a notice, instructions, and two copies of an exemption notice, which must be substantially in the form set forth below. The sheriff shall serve the notice, instructions, and both copies of the exemption notice on the financial institution, along with the writ of execution. Failure of the sheriff to serve the notice, instructions, and the exemption notices renders the levy void, and the financial institution shall take no action. However, if this subdivision is being used to execute on funds that have previously been garnished in compliance with section 571.71, the judgment creditor is not required to serve additional exemption notices. In that event, the execution levy shall only be effective as to the funds that were subject to the prior garnishment. Upon receipt of the writ of execution, notice, instructions, and exemption notices, the financial institution shall retain as much of the amount due under section 550.04 as the financial institution has on deposit owing to the judgment debtor, but not more than 110 percent of the amount remaining due on the judgment.\nThe notice required by subdivision 3 must be provided as a separate form and must be substantially in the following form:\nIMPORTANT NOTICE\nYOUR FUNDS HAVE BEEN LEVIED\nThe Creditor has frozen money in your account at your financial institution.\nYour account balance is $.......\nThe amount being held is $.......\nThe amount being held will be frozen for 14 days from the date of this notice.\nSome of your money in your account may be protected (the legal word is exempt). You may be able to get it sooner than 14 days if you act quickly and follow the instructions on the next page.\nThe attached exemption form lists some different sources of money in your account that may be protected. If your money is from one or more of these sources, place a check on the line on the form next to the sources of your money. If it is from one of these sources, the Creditor cannot take it.\nBUT, you must follow the instructions and return the exemption form and copies of your bank statements from the last 60 days to have the bank unfreeze your money. If you do not follow the instructions, your financial institution will give the money to the Sheriff. If that happens and it is protected, you can still get it back from the Creditor later, but that is not as easy to do as filling in the form now.\nSee next pages for instructions and the exemption form.\nThe instructions required by this section must be in a separate form and must be substantially in the following form:\nINSTRUCTIONS\nNote: The creditor is who you owe the money to. You are the debtor.\n1. Fill out both of the attached exemption forms in this packet.\nIf you check one of the lines, you should also give proof that shows that some or all of the money in your account is from one or more of the protected sources. Creditors may ask for a hearing if they question your exemptions. To avoid a hearing:\nCase numbers should be added to the form. Copies of documents should be sent with the form.\nNOTICE: YOU MUST SEND TO THE CREDITOR'S ATTORNEY (OR TO THE CREDITOR, IF NO ATTORNEY) COPIES OF YOUR BANK STATEMENTS FOR THE PAST 60 DAYS BEFORE THE LEVY. Keep a copy of your bank statements in case there are questions about your claim. If you do not send to the creditor's attorney (or to the creditor, if no attorney) bank statements with your exemption claim, the financial institution may release your money to the Sheriff.\n2. Sign the exemption forms. Make one copy to keep for yourself.\n3. Mail or deliver the other copies of the form by (insert date).\nBOTH COPIES MUST BE MAILED OR DELIVERED THE SAME DAY.\nOne copy of the form and the copies of your bank statements go to:\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert name of creditor or creditor's attorney)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert address of creditor or creditor's attorney)\nOne copy goes to:\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert name of bank)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert address of bank)\nHOW THE PROCESS WORKS\nIf You Do Not Send in the Exemption Form and Bank Statements:\n14 days after the date of this letter some or all of your money may be turned over to the creditor or to the sheriff.\nIf You Send in the Exemption Form and Bank Statements:\nAny money that is NOT protected can be turned over to the sheriff.\nIf the Creditor Does Not Object:\nThe financial institution will unfreeze your money six business days after the institution gets your completed form.\nIf the Creditor Objects:\nThe money you have said is protected on the form will be held by the bank. The creditor has six business days to object (disagree) and ask the court to hold a hearing. You will receive a Notice of Objection and a Notice of Hearing.\nThe financial institution will hold the money until a court decides whether your money is protected or not. Some reasons a creditor may object are because you did not send copies of your bank statements or other proof of the benefits you received. Be sure to include these when you send your exemption form.\nYou may want to talk to a lawyer for advice about this process. If you are low income you can call Legal Aid.\nPENALTIES:\nIf you claim that your money is protected and a court decides you made that claim in bad faith, the court can order you to pay costs, actual damages, attorney fees, and an additional amount of up to $100. For example, it may be bad faith if you claim you receive government benefits that you do not receive.\nIf the creditor made a bad faith objection to your claim that your money is protected, the court can order them to pay costs, actual damages, attorney fees, and an additional amount of up to $100.\nThe exemption form required by this subdivision must be sent as a separate form and must be in substantially the following form:\nEXEMPTION FORM\nYou may have assistance based on need from another source that is not on the list. If you do, check this box, and fill in the source of your money on the line below:\nSource: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nInclude copies of any documents you have that show the source of this money.\nI give permission to any agency that has given me cash benefits to give information about my benefits to the above-named creditor, or its attorney. The information will ONLY concern whether I get benefits or not, or whether I have gotten them in the past six months.\nIf I was an inmate in the last six months, I give my permission to the correctional institution to tell the above-named creditor that I was an inmate there.\nYOU MUST SIGN AND SEND THIS FORM BACK TO THE CREDITOR'S ATTORNEY (OR TO THE CREDITOR, IF NO ATTORNEY) AND THE BANK. REMEMBER TO INCLUDE A COPY OF YOUR BANK STATEMENTS FOR THE PAST 60 DAYS. FILL IN THE BLANKS BELOW AND GO BACK TO THE INSTRUCTIONS TO MAKE SURE YOU DO IT CORRECTLY.\nI have mailed or delivered a copy of this form to:\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert name of creditor or creditor's attorney)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Insert address of creditor or creditor's attorney)\nI have also mailed or delivered a copy of this exemption form to my bank at the address listed in the instructions.\nWithin two business days after receipt of the writ of execution, notice, instructions, and two copies of the exemption notice, the financial institution shall serve upon the judgment debtor the notice, instructions, and two copies of the exemption notice. The financial institution shall serve these forms by first class mail to the last known address of the judgment debtor. If no claim of exemption is received by the financial institution within 14 days after the notice, instructions, and exemption notices are mailed to the judgment debtor, the funds remain subject to the execution levy and shall be remitted to the sheriff within six business days. If the judgment debtor elects to claim an exemption, the judgment debtor shall complete the exemption notice, sign it under penalty of perjury, and deliver one copy to the financial institution and one copy to the attorney for the judgment creditor within 14 days of the date postmarked on the correspondence mailed to the debtor containing the exemption notices. The judgment debtor is also required to include copies of bank statements for the prior 60 days with the exemption notice delivered to the attorney for the judgment creditor. In the event that there is no attorney for the judgment creditor, then the notice and bank statements must be sent directly to the judgment creditor. Failure of the judgment debtor to deliver the executed exemption notice or copies of the required bank statements for the prior 60 days does not constitute a waiver of any claimed right to an exemption. Upon timely receipt of a claim of exemption, funds not claimed to be exempt by the debtor remain subject to the execution levy. All money claimed to be exempt shall be released to the judgment debtor upon the expiration of six business days after the date postmarked on the envelope containing the executed exemption notice mailed to the financial institution, or the date of personal delivery of the executed exemption notice to the financial institution, unless within that time the judgment creditor interposes an objection to the exemption.\n(a) An objection shall be interposed within six business days of receipt by the creditor of an exemption claim from the debtor, by mailing or delivering one copy of the Notice of Objection and Notice of Hearing to the financial institution and one copy of the Notice of Objection and Notice of Hearing to the judgment debtor. The financial institution may rely on the date of mailing or delivery of a notice to it in computing any time periods in this section. The Notice of Objection and Notice of Hearing must be substantially in the form specified in subdivision 7.\n(b) The court administrator may charge a fee of $1 for the filing of a Notice of Objection and Notice of Hearing. Upon the filing of a Notice of Objection and Notice of Hearing, the court administrator shall schedule the matter for hearing no sooner than five business days but no later than seven business days from the date of filing. A debtor may request continuance of the hearing by notifying the creditor and the court. The court shall schedule the continued hearing within seven days of the original hearing date.\n(c) An order stating whether the debtor's funds are exempt must be issued by the court within three days of the date of the hearing.\nUpon receipt of a Notice of Objection and Notice of Hearing from the creditor or its attorney within the specified six-day period, the financial institution shall retain the funds claimed to be exempt. The financial institution shall retain the funds claimed to be exempt until otherwise ordered by the court or upon mutual agreement of the parties.\n(a) The Written Objection and Notice of Hearing must be in substantially the following form:\nThe creditor objects to your claim of exemption from levy of execution for the following reason(s):\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(Note: Bring with you to the hearing all documents and materials supporting your exemption claim. Failure to do so could delay the court's decision.)\nIf the creditor receives all documents and materials supporting your exemption claim before the hearing date, the creditor may agree with your exemption claim and you might still be able to avoid a hearing.\nBecause a court hearing will be held on your claim that your funds are protected, your financial institution will retain the funds until it receives an order from the court or upon mutual agreement between you and your creditor.\nMS 2008 [Repealed by amendment, 2009 c 31 s 1]\nAt any time during the procedure specified in this section, the judgment debtor or the judgment creditor may, by a writing dated after the service of the execution, direct the sheriff or the financial institution to release the funds in question to the other party. Upon receipt of a release, the sheriff or the financial institution shall release the funds as directed.\nIf in subsequent proceedings brought by the judgment debtor or the judgment creditor, the claim of exemption is not upheld, and the court finds that it was asserted in bad faith, the judgment creditor shall be awarded actual damages, costs, and reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. If the claim of exemption is upheld, and the court finds that the judgment creditor disregarded the claim of exemption in bad faith, the judgment debtor shall be awarded costs, reasonable attorney fees, actual damages, and an amount not to exceed $100. The underlying judgment must be modified to reflect assessment of damages, costs, and attorney fees. However, if the party in whose favor a penalty assessment is made is not actually indebted to the party's attorney for fees, the attorney's fee award shall be made directly to the attorney and, if not paid, an appropriate judgment in favor of the attorney shall be entered. Upon motion of any party in interest, on notice, the court shall determine the validity of any claim of exemption, and may make any order necessary to protect the rights of those interested. No financial institution is liable for damages for complying with this section. Both copies of an exemption claim or an objection to an exemption claim must be mailed or delivered on the same date. The financial institution may rely on the date of mailing or delivery of a notice to it in computing any time periods in this section.",
	"repealed": false
}