{
	"id": "16B.358",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.358",
	"title": "16B.358 POWERS; RESPONSIBILITIES AND DUTIES.",
	"text": "The council has the nonregulatory powers necessary to carry out its responsibilities and duties specified by law.\n(a) The council is responsible for activities in a nonregulatory capacity and in coordination with stakeholders to identify and recommend best practices that:\n(1) preserve and extend the longevity of Minnesota's public and privately owned infrastructure; and\n(2) provide for effective and efficient management of infrastructure.\n(b) Unless specifically provided otherwise, nothing in sections 16B.356 to 16B.359 requires transfer of personnel, specific responsibilities, or administrative functions from a department or agency to the council.\nThe duties of the council are to:\n(1) identify approaches to enhance and expedite infrastructure coordination across jurisdictions, agencies, state and local government, and public and private sectors, including in planning, design, engineering, construction, maintenance, and operations;\n(2) analyze methods to improve efficiency and the use of resources related to (i) public infrastructure, and (ii) public asset management practices;\n(3) identify opportunities to reduce duplication in infrastructure projects and asset management;\n(4) identify barriers and gaps in effective asset management;\n(5) identify objectives and strategies that enhance the longevity and adaptability of infrastructure throughout the state;\n(6) develop advisory recommendations, if any, related to the responsibilities and duties specified under this section, including to state agencies for programs, policies, and practices; and\n(7) implement the requirements under sections 16B.356 to 16B.359.\nThe council must develop and recommend a plan for a statewide asset managers program that provides for:\n(1) identification, exchange, and distribution of (i) information on existing asset management tools and resources, and (ii) best practices on infrastructure management;\n(2) training for infrastructure owners and asset managers; and\n(3) coordination and collaboration among infrastructure owners and asset managers.\nThe commissioner must provide the council with suitable space to maintain an office, hold meetings, and keep records. The commissioner must provide administrative staff and information technology resources to the council as necessary for the expeditious conduct of the council's duties and responsibilities.\nBy December 15 annually, the council must submit a report to the governor and the legislative committees with jurisdiction over capital investment, climate, economic development, energy, and transportation. At a minimum, the report must:\n(1) summarize the activities of the council;\n(2) provide an overview for each of the duties and requirements under sections 16B.356 to 16B.359;\n(3) identify any barriers and constraints related to activities of the council; and\n(4) provide any recommendations of the council.",
	"repealed": false
}