{
	"id": "299F.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.641",
	"title": "299F.641 INTRASTATE HAZARDOUS LIQUID PIPELINE.",
	"text": "The commissioner has regulatory jurisdiction over the safety standards and practices of intrastate hazardous liquid pipeline facilities and the transportation of hazardous liquids associated with those facilities.\nThe federal safety standards adopted as Code of Federal Regulations, title 49, parts 195 and 199, and standards that may be adopted that amend parts 195 and 199, are adopted as minimum safety standards. The commissioner may by rule adopt additional or more stringent safety standards for intrastate hazardous liquid pipeline facilities and the transportation of hazardous liquids associated with those facilities, if the state standards are compatible with the federal standards. The standards may not prescribe the location or routing of a pipeline facility.\nThe commissioner must establish and implement an inspection program to enforce the standards adopted under subdivision 2. The program must be established and implemented in a manner that complies with requirements for state certification under United States Code, title 49, section 2004.\n[Repealed by amendment, 1989 c 244 s 17]\n[Repealed by amendment, 1989 c 244 s 17]\nOn application of a person engaged in the transportation of hazardous liquid or the operation of hazardous liquid pipeline facilities, the commissioner may, after notice and opportunity for hearing and under terms and conditions and to the extent the commissioner considers appropriate, waive in whole or in part compliance with standards established under this section, on determining that a waiver of compliance with a standard is consistent with hazardous liquid pipeline safety. The commissioner shall state the reason for a waiver.\n(a) Each person who engages in the transportation of hazardous liquids or who owns or operates hazardous liquid pipeline facilities must prepare, maintain, and carry out a current written plan for operation and maintenance of each facility used in that transportation and owned or operated by that person as prescribed by the commissioner. The commissioner may, by regulation, also require persons who engage in the transportation of hazardous liquids or who own or operate pipeline facilities subject to this section to file the plans for approval. A plan required by this subdivision must be practicable, designed to meet the need for pipeline safety, and available to the commissioner on request. The plan must enhance the commissioner's ability to discover a condition that causes a significant change or restriction in the operation of the pipeline facilities or constitutes a hazard to life or property.\n(b) If the commissioner finds that a plan required under this subdivision is inadequate to achieve safe operation of pipeline facilities, the commissioner may, after notice and opportunity for a hearing, require the plan to be revised. In determining the adequacy of a plan filed under this section, the commissioner shall consider:\n(1) relevant available pipeline safety data;\n(2) whether the plan is appropriate for the particular type of pipeline transportation or facility;\n(3) the reasonableness of the plan; and\n(4) the extent to which the plan will contribute to public safety.\nThe commissioner is authorized to make certifications and reports to the United States Secretary of Transportation as may be required from time to time under the federal Hazardous Liquid Pipeline Safety Act.\nThe safety standards adopted under this section may be enforced as is provided for gas pipeline facilities under sections 299F.60 and 299F.61, and penalties collected must be paid to the commissioner for deposit in the state treasury and credit to the pipeline safety account.",
	"repealed": false
}