{
	"id": "152.0973",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.0973",
	"title": "152.0973 REPORT OF TRANSACTION.",
	"text": "A supplier who furnishes a precursor substance to a person in this state shall, not less than 21 days before delivery of the substance, submit to the Bureau of Criminal Apprehension a report of the transaction that includes the identification information specified in subdivision 3.\nA purchaser of a precursor substance from outside of Minnesota shall, not less than 21 days before taking possession of the substance, submit to the Bureau of Criminal Apprehension a report of the transaction that includes the identification information specified in subdivision 3.\nThe bureau may authorize a purchaser or supplier to submit the reports on a monthly basis with respect to repeated, regular transactions between the supplier and the purchaser involving the same substance if the superintendent of the Bureau of Criminal Apprehension determines that:\n(1) a pattern of regular supply of the precursor substance exists between the supplier and the purchaser of the substance; or\n(2) the purchaser has established a record of utilizing the precursor substance for lawful purposes.\nA supplier or purchaser who discovers a discrepancy between the quantity of precursor substance shipped and the quantity of precursor substance received shall report the discrepancy to the Bureau of Criminal Apprehension within three days of knowledge of the discrepancy. The report must include:\n(1) the complete name and address of the purchaser;\n(2) the type of precursor substance missing;\n(3) whether the precursor substance is missing due to theft, loss, or shipping discrepancy;\n(4) the method of delivery used;\n(5) the name of the common carrier or person who transported the substance; and\n(6) the date of shipment.\nA report submitted by a supplier or purchaser under this section must include:\n(1) the purchaser's driver's license number or state identification number and residential or mailing address other than a post office box number taken from the purchaser's driver's license or state identification card, if the purchaser is not an authorized agent;\n(2) the motor vehicle license number of the motor vehicle operated by the purchaser at the time of sale, if the purchaser is not an authorized agent;\n(3) a complete description of how the precursor substance will be used, if the purchaser is not an authorized agent;\n(4) a letter of authorization from the business for which the precursor substance is being furnished, including the state tax identification number and address of the business, a full description of how the precursor substance is to be used, and the signature of the authorized agent for the purchaser;\n(5) the signature of the supplier as a witness to the signature and identification of the purchaser;\n(6) the type and quantity of the precursor substance;\n(7) the method of delivery used; and\n(8) the complete name and address of the supplier.\nA supplier shall retain a copy of reports filed under subdivisions 1, 2, and 2a for five years. A purchaser shall retain a copy of reports filed under subdivisions 1a and 2a for five years.\nAll records relating to sections 152.0971 to 152.0974 shall be open to inspection by the Bureau of Criminal Apprehension during regular business hours.\n(a) A person who does not submit a report as required by this section is guilty of a misdemeanor.\n(b) A person who knowingly submits a report required by this section with false or fictitious information is guilty of a gross misdemeanor.\n(c) A person who is convicted a second or subsequent time of violating paragraph (a) is guilty of a gross misdemeanor if the subsequent offense occurred after the earlier conviction.",
	"repealed": false
}