{
	"id": "326B.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.95",
	"title": "326B.95 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 326B.95 to 326B.998.\n\"Authorized inspector\" means a national board-commissioned inspector who has been examined and found qualified to inspect the construction and repair of boilers and pressure vessels, and who holds a current certificate of competency.\n\"Certificate of competency\" means a certificate issued by the department to allow national board-commissioned inspectors to perform boiler and pressure vessel inspections within the state.\n\"Certificate of inspection\" means a sticker attached to the boiler or pressure vessel which documents the month and year of the inspection and the employer of the inspector performing the inspection.\n\"Certificate of registration\" means a document that has been made available on the department's website that lists all registered boilers and pressure vessels at a location, including the last inspection date, the certificate expiration date, and the maximum allowable working pressure for each boiler or pressure vessel.\n\"High-pressure boiler\" means a boiler operating at a steam or other vapor pressure in excess of 15 psig, or a water or other liquid boiler in which the pressure exceeds 160 psig or the temperature exceeds 250 degrees Fahrenheit.\n\"Inspection due date\" means the last possible date that the inspection can be completed within the time limits in this chapter.\n\"Insurance company boiler inspector\" means a national board-commissioned inspector who holds a current certificate of competency.\n\"Low-pressure boiler\" means a boiler operating at a steam or other vapor pressure of 15 psig or less, or a water or other liquid boiler in which the pressure does not exceed 160 psig and the temperature does not exceed 250 degrees Fahrenheit.\n\"National board\" means the National Board of Boiler and Pressure Vessel Inspectors, which is an organization comprised of chief inspectors for the states, cities, and territories of the United States and provinces and territories of Canada.\n\"National board-commissioned inspector\" means an individual who has been examined and found qualified to inspect in-service boilers and pressure vessels by the national board, and who holds a current commission issued by the national board.\n\"National Board Inspection Code\" or \"NBIC\" means a three-part technical document that is written and published by the national board detailing the installation, inspection, and repair of boilers and pressure vessels.\n\"Operation\" means the on-site act of manipulating, monitoring, and testing of boilers and their appurtenances by a properly licensed engineer or an apprentice under the direct supervision of the properly licensed engineer.\n\"Psig\" means pounds per square inch gauge.\n\"Remote monitoring\" means the act of viewing or overseeing the boiler or boiler plant operating parameters and conditions from a remote location.\n\"Repair\" means the work necessary to restore a boiler or pressure vessel to a safe and satisfactory operating condition, as defined in National Board Inspection Code, part 3, section 9.\n\"State boiler inspector\" means a national board-commissioned boiler inspector who holds a current certificate of competency and a current chief grade A boiler operator's license.",
	"repealed": false
}