{
	"id": "216C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.06",
	"title": "216C.06 DEFINITIONS.",
	"text": "For the purposes of sections 216C.05 to 216C.30, the following terms shall have the meanings here given them.\n[Renumbered subd 14]\n\"Building energy report\" means a questionnaire designed to collect information on a building concerning its energy use and other basic factors that relate to energy use.\n[Renumbered subd 15]\n\"Coal supplier\" means any entity engaged in this state in the wholesale distribution of coal or transportation into this state of any coal intended for use or distribution in the state or transshipment from the state.\n[Renumbered subd 18]\n\"Construction\" means significant physical alteration of a site to install or enlarge a large energy facility, but not including activities incident to preliminary engineering or environmental studies.\n\"Decorative gas lamp\" means a device installed for the purpose of producing illumination by burning natural, mixed, or LP gas and utilizing either a mantle or an open flame, but does not include portable camp lanterns or gas lamps.\n[Renumbered subd 17]\n[Renumbered subd 2a]\n[Repealed, 1997 c 7 art 1 s 91]\n[Repealed, 1997 c 7 art 1 s 91]\n[Renumbered subd 19]\n[Renumbered subd 16]\n\"Earth sheltered\" means constructed so that 50 percent or more of the exterior surface is covered or in contact with earth. Exterior surface includes all walls and roof, but excludes garages and other accessory buildings. Earth covering on walls is measured from the floor of the structure's lowest level. Earth covering on the roof must be at least 12 inches deep to be included in calculations of earth covering. Partially completed buildings shall not be considered earth sheltered.\n\"Petroleum supplier\" means any petroleum refinery in the state and any entity engaged in transmission or wholesale distribution of more than 100,000 gallons of crude petroleum or petroleum fuels or oil or derivatives thereof annually in this state.\n\"Photovoltaic device\" means a system of components that generates electricity from incident sunlight by means of the photovoltaic effect, whether or not the device is able to store the energy produced for later use.\n\"Solar energy system\" means a set of devices whose primary purpose is to collect solar energy and convert and store it for useful purposes including heating and cooling buildings or other energy-using processes, or to produce generated power by means of any combination of collecting, transferring, or converting solar-generated energy.\n\"Utility\" means any entity engaged in this state in the generation, transmission or distribution of electric energy and any entity engaged in this state in the transmission or distribution of natural or synthetic natural gas, including, but not limited to, a private investor-owned utility or a public or municipally owned utility.\n\"Wind energy conversion system\" (WECS) means any device, such as a wind charger, windmill, or wind turbine, which converts wind energy to a form of usable energy.",
	"repealed": false
}