{
	"id": "326.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.12",
	"title": "326.12 LICENSE OR CERTIFICATE AS EVIDENCE; SEAL.",
	"text": "The issuance of a license or certificate by the board shall be evidence that the person named therein is entitled to all the rights and privileges of a licensed architect, licensed engineer, licensed land surveyor, licensed landscape architect, licensed geoscientist, or certified interior designer while the license or certificate remains unrevoked or has not expired or has not been suspended.\nEach licensee or certificate holder may, upon licensure or certification, obtain a seal bearing the licensee's or certificate holder's name and the legend \"licensed architect,\" \"licensed professional engineer,\" \"licensed land surveyor,\" \"licensed landscape architect,\" the appropriate licensed professional geoscientist legend as defined by the board, or \"certified interior designer.\" Plans, specifications, plats, reports, and other documents prepared by a licensee or certificate holder may be stamped with the seal during the life of the license or certificate. A rubber stamp facsimile thereof may be used in lieu of the seal on tracings from which prints are to be made or on papers which would be damaged by the regular seal. It shall be unlawful for any one to stamp or seal any document with the stamp or seal after the license or certificate has expired, been revoked or suspended, unless said license or certificate shall have been renewed or reissued.\nEach plan, drawing, specification, plat, report, or other document which under sections 326.02 to 326.15 is prepared by a licensed architect, licensed engineer, licensed land surveyor, licensed landscape architect, licensed geoscientist, or certified interior designer must bear the signature of the licensed or certified person preparing it, or the signature of the licensed or certified person under whose direct supervision it was prepared. Each signature shall be accompanied by a certification that the signer is licensed or certified under sections 326.02 to 326.15, by the person's license or certificate number, and by the date on which the signature was affixed. The provisions of this paragraph shall not apply to any plans, drawings, specifications, plats, reports, or other documents of an intraoffice or intracompany nature or that are considered to be drafts or of a preliminary, schematic, or design development nature by licensed or certified individuals who would normally be responsible for their preparation. The required signature and certification must appear on all pages of plans and drawings that must be signed, but only on the first page of specifications, plats, reports, or other documents that must be signed. A stamp, printed signature, or electronically created signature has the same force and effect as an actual signature if it creates an accurate depiction of the licensed or certified professional's actual signature.",
	"repealed": false
}