{
	"id": "136G.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/136G.09",
	"title": "136G.09 PLAN ACCOUNTS; GENERALLY.",
	"text": "A person may make contributions to an account on behalf of a beneficiary. Contributions to an account made by persons other than the account owner become the property of the account owner. A person does not acquire an interest in an account by making contributions to an account. Contributions to an account must be made by check or other commercially acceptable means as permitted by the United States Internal Revenue Service and other applicable federal and state law and approved by the plan administrator in cooperation with the office and the board.\nExcept as provided for minor trust accounts in section 136G.14, an account owner is the only person entitled to:\n(1) select or change a beneficiary or a contingent account owner; or\n(2) request distributions or rollover distributions from an account.\nAn interest in an account or matching grant account must not be used as security for a loan.\nThe plan must provide a separate account for each beneficiary for whom contributions are made. Each account must have a single account owner and a single beneficiary. An account owner must not open more than one account for the same beneficiary, but several account owners may open accounts for the same beneficiary.\nThe account owner must designate the beneficiary of an account when the account is established, except for accounts established under section 529(e)(1)(C) of the Internal Revenue Code, which do not require a designated beneficiary until a distribution is made.\nExcept as provided for minor trust accounts in section 136G.14, an account owner may change the beneficiary of an account to a member of the family of the current beneficiary, at any time without penalty, if the change will not cause the total account balance of all accounts held for the new beneficiary to exceed the maximum account balance limit as provided in subdivision 8. A change of beneficiary other than as permitted in this subdivision is treated as a taxable distribution under section 136G.13, subdivision 3.\nExcept as provided for minor trust accounts in section 136G.14, an account owner may transfer ownership of an account to another person eligible to be an account owner. All transfers of ownership are absolute and irrevocable.\n(a) When a contribution is made, the total account balance of all accounts held for the same beneficiary, including matching grant accounts, must not exceed the maximum account balance limit as determined under this subdivision.\n(b) The office must establish a maximum account balance limit. The office must adjust the maximum account balance limit, as necessary, or on January 1 of each year. The maximum account balance limit must not exceed the amount permitted for the plan to qualify as a qualified tuition program under section 529 of the Internal Revenue Code.\nA contribution to any account for a beneficiary must be rejected if the contribution would cause the total account balance of all accounts held for the same beneficiary, including the matching grant account, to exceed the maximum account balance limit under section 529 of the Internal Revenue Code as established by the office.\n(a) The plan administrator shall attempt to locate the account owner or the beneficiary, or both, to determine the disposition of a dormant account. A fee of five percent of the total account balance of the dormant account, not to exceed $100, plus allowable costs, may be charged for this service. Costs will not exceed $100 or five percent of the total account balance in the dormant account, whichever is less.\n(b) If the account owner, or the account owner's legal heirs, are not found after three attempts by the plan administrator, the remaining funds in the dormant account must be turned over to the office. The funds are treated as unclaimed property for purposes of sections 345.31 to 345.60, and the office shall turn all remaining dormant account funds over to the commissioner of commerce. If the dormant account has a matching grant account, all amounts in the beneficiary's matching grant account, if any, must be returned to the office.\nAmendments to sections 136G.01 to 136G.13 automatically amend the participation agreement. Any amendments to the operating procedures and policies of the plan shall automatically amend the participation agreement after adoption by the office or the board.\nAll assets of the plan, including contributions to accounts and matching grant accounts and earnings, are held in trust for the exclusive benefit of account owners and beneficiaries. Assets must be held in a separate account in the state treasury to be known as the Minnesota college savings plan account or in accounts with the third-party provider selected pursuant to section 136G.05, subdivision 8. Plan assets are not subject to claims by creditors of the state, are not part of the general fund, and are not subject to appropriation by the state. Payments from the Minnesota college savings plan account shall be made under sections 136G.01 to 136G.13.",
	"repealed": false
}