{
	"id": "14.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.62",
	"title": "14.62 DECISIONS, ORDERS.",
	"text": "Every decision and order rendered by an agency in a contested case shall be in writing, shall be based on the record and shall include the agency's findings of fact and conclusions on all material issues. A decision or order that rejects or modifies a finding of fact, conclusion, or recommendation contained in the report of the administrative law judge required under sections 14.48 to 14.56, must include the reasons for each rejection or modification. A copy of the decision and order shall be served upon each party or the party's representative and the administrative law judge by first class mail.\n[Repealed, 2002 c 251 s 7]\nUnless otherwise provided by law, the report or order of the administrative law judge constitutes the final decision in the case unless the agency modifies or rejects it under subdivision 1 within 90 days after the record of the proceeding closes under section 14.61. When the agency fails to act within 90 days on a licensing case, the agency must return the record of the proceeding to the administrative law judge for consideration of disciplinary action. In all contested cases where the report or order of the administrative law judge constitutes the final decision in the case, the administrative law judge shall issue findings of fact, conclusions, and an order within 90 days after the hearing record closes under section 14.61. Upon a showing of good cause by a party or the agency, the chief administrative law judge may order a reasonable extension of either of the two 90-day deadlines specified in this subdivision. The 90-day deadline will be tolled while the chief administrative law judge considers a request for reasonable extension so long as the request was filed and served within the applicable 90-day period.\nFees and expenses must be awarded as provided in sections 15.471 to 15.474.\nThis section does not apply to a contested case under which the report or order of the administrative law judge constitutes the final decision in the case.",
	"repealed": false
}