{
	"id": "160.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.18",
	"title": "160.18 ACCESS TO ROADS; APPROACHES.",
	"text": "Except when the easement of access has been acquired, a road authority, as to a highway already established and constructed may grant by permit a suitable approach to the highway. The requesting abutting property owner shall pay for the cost and installation of any required culverts unless a road authority, other than the commissioner, adopts by resolution a policy for the furnishing of a culvert to an abutting owner when a culvert is necessary for suitable approach to a road. The policy may include provisions for the payment of all or part of the costs of furnishing the culvert by the abutting landowner.\nExcept when the easement of access has been acquired, the road authorities in laying out and constructing a new highway or in relocating or reconstructing an old highway shall construct suitable approaches thereto within the limits of the right-of-way where the approaches are reasonably necessary and practicable, so as to provide abutting owners a reasonable means of access to such highway.\nThe owner or occupant of property abutting upon a public highway, having a right of direct private access thereto, may provide such other or additional means of ingress from and egress to the highway as will facilitate the efficient use of the property for a particular lawful purpose, subject to reasonable regulation by and permit from the road authority as is necessary to prevent interference with the construction, maintenance and safe use of the highway and its appurtenances and the public use thereof.\n(a) Notwithstanding chapter 14 and section 14.386, the commissioner must establish a concise, expedited process that allows an owner or occupant of a property abutting a trunk highway to appeal a denial or revocation of an access permit. The owner or occupant must initiate an appeal no later than 30 days after the date the commissioner issues written notice of the denial or revocation of an access permit. The process must provide the owner or occupant and Department of Transportation staff the opportunity to present information supporting each party's respective position. The hearing must be conducted by an administrative law judge assigned by the chief administrative law judge. The administrative law judge must maintain a transcript of the hearing and keep a record of all documents and data submitted at the hearing. Within 30 days of the hearing's conclusion, the administrative law judge must transmit to the commissioner the record of the proceedings, along with a report and recommendation based on the record made in the informal hearing. The commissioner must make a written decision regarding the access permit.\n(b) Section 15.99 does not apply to appeals under this subdivision.",
	"repealed": false
}