{
	"id": "127A.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.47",
	"title": "127A.47 PAYMENTS TO RESIDENT AND NONRESIDENT DISTRICTS.",
	"text": "(a) Unless otherwise specifically provided by law, general education aid must be paid according to this subdivision.\n(b) Except as provided in paragraph (c), general education aid must be paid to the serving district.\n(c) If the resident district pays tuition for a pupil under section 123A.18, 123A.22, 123A.30, 123A.32, 123A.44, 123A.488, 123B.88, subdivision 4, 124D.04, 124D.05, 125A.03 to 125A.24, 125A.51, or 125A.65, general education aid, excluding basic skills revenue under section 126C.10, subdivision 4, must be paid to the resident district. For a student enrolled under section 124D.08, subdivision 2a, that is enrolled in other than an independent or special school district or charter school, the general education revenue shall be paid to the resident district.\n[Repealed, 2012 c 239 art 1 s 34]\n(a) In those instances when the divorced or legally separated parents or parents residing separately share joint physical custody of the child and the divorced or legally separated parents or parents residing separately reside in different school districts, for all school purposes, unless otherwise specifically provided by law, the child must be considered a resident of the school district, as indicated by the child's parents.\n(b) When the child of divorced or legally separated parents or parents residing separately under paragraph (a) resides with each parent on alternate weeks, the parents shall be responsible for the transportation of the child to the border of the resident school district during those weeks when the child resides in the nonresident school district.\nExcept as otherwise provided in law, any district not maintaining classified elementary or secondary schools must pay the tuition required in order to enable resident pupils to attend school in another district when necessary, and must receive general education aid on the same basis as other districts. The aid must be computed as if the pupils were enrolled in the district of residence.\nA district educating a pupil who is a resident of another district must notify the district of residence within 60 days of the date the pupil is determined by the district to be a nonresident, but not later than August 1 following the end of the school year in which the pupil is educated.\nIf a state agency or a court of the state desires to place a child in a district that is not the child's district of residence or to place a pupil who is a parent under section 120A.22, subdivision 3, in a school district which is not the school district in which the pupil's biological or adoptive parent or designated guardian resides, that agency or court must, before placement, allow the district of residence an opportunity to participate in the placement decision and notify the district of residence, the district of attendance and the commissioner of the placement decision. When a state agency or court determines that an immediate emergency placement is necessary and that time does not permit district participation in the placement decision or notice to the districts and the commissioner of the placement decision before the placement, the agency or court may make the decision and placement without that participation or prior notice. The agency or court must notify the district of residence, the district of attendance and the commissioner of an emergency placement within 15 days of the placement.\n(a) The general education aid and special education aid for districts must be adjusted for each pupil attending a nonresident district under sections 123A.05 to 123A.08, 124D.03, 124D.08, and 124D.68. The adjustments must be made according to this subdivision.\n(b) For purposes of this subdivision, the \"unreimbursed cost of providing special education and services\" means the difference between: (1) the actual cost of providing special instruction and services, including special transportation and unreimbursed building lease and debt service costs for facilities used primarily for special education, for a pupil with a disability, as defined in section 125A.02, or a pupil, as defined in section 125A.51, who is enrolled in a program listed in this subdivision, minus (2) if the pupil receives special instruction and services outside the regular classroom for more than 60 percent of the school day, the amount of general education revenue, excluding local optional revenue, plus local optional aid and referendum equalization aid as defined in section 125A.11, subdivision 1, paragraph (d), attributable to that pupil for the portion of time the pupil receives special instruction and services outside of the regular classroom, excluding portions attributable to district and school administration, district support services, operations and maintenance, capital expenditures, and pupil transportation, minus (3) special education aid under section 125A.76, excluding cross subsidy reduction aid under section 125A.76, subdivision 2e, attributable to that pupil, that is received by the district providing special instruction and services. For purposes of this paragraph, general education revenue and referendum equalization aid attributable to a pupil must be calculated using the serving district's average general education revenue and referendum equalization aid per adjusted pupil unit.\n(c) For fiscal year 2020, special education aid paid to a resident district must be reduced by an amount equal to 85 percent of the unreimbursed cost of providing special education and services. For fiscal year 2021 and later, special education aid paid to a resident district must be reduced by an amount equal to 80 percent of the unreimbursed cost of providing special education and services.\n(d) Notwithstanding paragraph (c), special education aid paid to a resident district must be reduced by an amount equal to 100 percent of the unreimbursed cost of special education and services provided to students at an intermediate district, cooperative, or charter school where the percent of students eligible for special education services is at least 70 percent of the charter school's total enrollment.\n(e) Notwithstanding paragraph (c), special education aid paid to a resident district must be reduced under paragraph (d) for students at a charter school receiving special education aid under section 124E.21, subdivision 3, calculated as if the charter school received special education aid under section 124E.21, subdivision 1.\n(f) Special education aid paid to the district or cooperative providing special instruction and services for the pupil, or to the fiscal agent district for a cooperative, must be increased by the amount of the reduction in the aid paid to the resident district under paragraphs (c) and (d). If the resident district's special education aid is insufficient to make the full adjustment under paragraphs (c), (d), and (e), the remaining adjustment shall be made to other state aids due to the district.\n(g) Notwithstanding paragraph (a), general education aid paid to the resident district of a nonspecial education student for whom an eligible special education charter school receives general education aid under section 124E.20, subdivision 1, paragraph (c), must be reduced by an amount equal to the difference between the general education aid attributable to the student under section 124E.20, subdivision 1, paragraph (c), and the general education aid that the student would have generated for the charter school under section 124E.20, subdivision 1, paragraph (a). For purposes of this paragraph, \"nonspecial education student\" means a student who does not meet the definition of pupil with a disability as defined in section 125A.02 or the definition of a pupil in section 125A.51.\n(h) An area learning center operated by a service cooperative, intermediate district, education district, or a joint powers cooperative may elect through the action of the constituent boards to charge the resident district tuition for pupils rather than to have the general education revenue paid to a fiscal agent school district. Except as provided in paragraph (f), the district of residence must pay tuition equal to at least 90 and no more than 100 percent of the district average general education revenue per pupil unit minus an amount equal to the product of the formula allowance according to section 126C.10, subdivision 2, times .0466, calculated without compensatory revenue, local optional revenue, and transportation sparsity revenue, times the number of pupil units for pupils attending the area learning center.\n(a) The general education aid for districts must be adjusted for each pupil attending a charter school under chapter 124E. The adjustments must be made according to this subdivision.\n(b) General education aid paid to a district in which a charter school not providing transportation according to section 124E.15 is located must be increased by an amount equal to the sum of:\n(1) the product of: (i) the sum of an amount equal to the product of the formula allowance according to section 126C.10, subdivision 2, times .0466, plus the transportation sparsity allowance for the district; times (ii) the adjusted pupil units attributable to the pupil; plus\n(2) the product of $223 and the extended time pupil units attributable to the pupil.",
	"repealed": false
}