{
	"id": "136A.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.123",
	"title": "136A.123 MN RECONNECT PROGRAM.",
	"text": "The commissioner of the Office of Higher Education must, to the extent funds are available, administer a credential completion program for adult learners consistent with this section.\n(a) For the purpose of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Cost of attendance\" means tuition and required fees charged by the institution and the campus-based budget used for federal financial aid for food, housing, books, supplies, transportation, and miscellaneous expenses.\n(c) \"Eligible student\" means an individual who:\n(1) meets the eligibility requirements in section 136A.121, subdivision 2, paragraphs (a), clauses (1), (2), (4), and (5); and (b);\n(2) is 25 years old or older and under 62;\n(3) has previously completed a minimum of 15 credits in a certificate or degree-seeking program that have been accepted by a participating institution;\n(4) has not enrolled in any Minnesota institution in the two academic years prior to enrollment at a participating institution;\n(5) has not completed a certificate, diploma, or degree of 16 credits or longer in length prior to enrollment at a participating institution in this program;\n(6) has enrolled in three or more credits each term;\n(7) reports a family adjusted gross income of $85,000 or less; and\n(8) has applied for the grant on the form required by the commissioner.\n(d) \"Grant\" means funds awarded under this section.\n(e) \"Participating institution\" means a two-year institution within the Minnesota State Colleges and Universities system selected under subdivision 5.\n(f) \"Program\" means a certificate, diploma, or degree program offered by a participating institution.\n(g) To the extent not inconsistent with this section, the definitions in section 136A.101 apply to this section.\nApplication for a grant must be made by a FAFSA or state aid application and any additional form required by the commissioner. Applications are due on a schedule set by the commissioner.\n(a) The commissioner must, to the extent funds are available, make grants to eligible students to attend a program at a participating institution. The amount of a grant per spring or fall academic term is the lesser of $1,000 or the difference between the cost of attendance and other scholarships or grants received by the student. If the appropriation is greater than the projected grants for the spring and fall terms, the commissioner may award grants up to $1,000 per student for summer or interim terms.\n(b) An eligible student may renew a student grant by applying for renewal on a form provided by the commissioner and on a schedule set by the commissioner. An eligible student may receive a student grant under this section for up to six semesters or the equivalent.\n(a) A two-year institution within the Minnesota State Colleges and Universities system may apply to become a participating institution. The commissioner, in conjunction with a selection committee, shall select institutions through a competitive application process. Priority must be given to institutions participating in the most recently completed fiscal year.\n(b) Participating institutions must:\n(1) demonstrate a commitment to adult learners through adoption of best practice policies, programs, and services; and\n(2) complete an adult learner assessment prior to participation.\nParticipating institutions may receive funds for student advising, resolving student financial holds, and improving services to eligible students.",
	"repealed": false
}