{
	"id": "604.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.11",
	"title": "604.11 MEDICAL MALPRACTICE CASES.",
	"text": "Pursuant to the time limitations set forth in the Minnesota Rules of Civil Procedure, the parties to any medical malpractice action may exchange the uniform interrogatories in subdivision 3 and ten additional nonuniform interrogatories. Any subparagraph of a nonuniform interrogatory will be treated as one nonuniform interrogatory. By stipulation of the parties, or by leave of the court upon a showing of good cause, more than ten additional nonuniform interrogatories may be propounded by a party. In addition, the parties may submit a request for production of documents pursuant to rule 34 of the Minnesota Rules of Civil Procedure.\nAt the time a trial judge orders a case for trial, the court shall require the parties to discuss and determine whether a form of alternative dispute resolution would be appropriate or likely to resolve some or all of the issues in the case. Alternative dispute resolution may include arbitration, mediation, summary jury trial, or other alternatives suggested by the court or parties, and may be either binding or nonbinding. All parties must agree unanimously before alternative dispute resolution proceeds.\n(a) Uniform plaintiff's interrogatories to the defendant are as follows:\nPLAINTIFF'S INTERROGATORIES TO DEFENDANT\nINTERROGATORY NO. 1:\nPlease attach a complete curriculum vitae for Dr. (..........), M.D., which should include, but is not limited to, the following information:\na. Name;\nb. Office address;\nc. Name of practice;\nd. Identities of partners or associates, including their names, specialties, and how long they have been associated with Dr. (..........);\ne. Specialty of Dr. (.........);\nf. Age;\ng. The names and dates of attendance at any medical schools;\nh. Full information as to internship or residency, including the place and dates of the internship or residency as well as any specialized fields of practice engaged in during such internship or residency;\ni. The complete history of the practice of Dr. (..........) from and after medical school, setting forth the places where Dr. (..........) practiced medicine, the persons with whom Dr. (..........) was associated, the dates of the practice, and the reasons for leaving the practice;\nj. Full information as to any board certifications Dr. (..........) may hold, including the field of specialty and the dates of the certifications and any recertifications;\nk. Identifying the medical societies and organizations to which Dr. (..........) belongs, giving full information as to any offices held in the organizations;\nl. Identifying all professional journal articles, treatises, textbooks, abstracts, speeches, or presentations which Dr. (..........) has authored or contributed to; and\nm. Any other information which describes or explains the training and experience of Dr. (..........) for the practice of medicine.\nINTERROGATORY NO. 2:\nHas Dr. (..........) been the subject of any professional disciplinary actions of any kind and, if so:\nState whether Dr. (..........'s) license to practice medicine has ever been revoked or publicly limited in any way and, if so, give the date and the reasons for such revocation or restriction.\nINTERROGATORY NO. 3:\nPlease set forth a listing by author, title, publisher, and date of publication of all the medical texts referred to by Dr. (..........) with respect to the practice of medicine during the past five years.\nINTERROGATORY NO. 4:\nPlease set forth a complete listing of the medical and professional journals to which Dr. (..........) subscribes or has subscribed within the past five years.\nINTERROGATORY NO. 5:\nAs to each expert whom you expect to call as a witness at trial, please state:\na. The expert's name, address, occupation, and title;\nb. The expert's field of expertise, including subspecialties, if any;\nc. The expert's education background;\nd. The expert's work experience in the field of expertise;\ne. All professional societies and associations of which the expert is a member;\nf. All hospitals at which the expert has staff privileges of any kind;\ng. All written publications of which the expert is the author, giving the title of the publication and when and where it was published.\nINTERROGATORY NO. 6:\nWith respect to each person identified in answer to the foregoing interrogatory, state:\na. The subject matter on which the person is expected to testify;\nb. The substance of the facts and opinions to which the person is expected to testify; and\nc. A summary of the grounds for each opinion, including the specific factual data upon which the opinion will be based.\nINTERROGATORY NO. 7:\nPlease state whether there is any policy of insurance that will provide coverage to the defendant should liability attach on the basis of the allegations contained in the plaintiff's Complaint. If so, state with regard to each policy applicable:\na. The name and address of the insurer;\nb. The exact limits of coverage applicable;\nc. Whether any reservation of rights or controversy or coverage dispute exists between you and the insurance company.\nPlease attach copies of each policy to your Answers.\nINTERROGATORY NO. 8:\nState the full name, present address, occupation, age, present employer, and the present employer's address of each physician, nurse, or other medical personnel in the employ of the defendant or defendant's professional association who treated, cared for, examined, or otherwise attended (name) from (date 1), through (date 2). With regard to every individual, please state:\na. Each date upon which the individual attended (name);\nb. The nature of the treatment or care rendered (name) on each date;\nc. The qualifications and area of specialty of each individual; and\nd. The present address of each individual.\nIn responding to this interrogatory, referring plaintiff's counsel to medical records will not be deemed to be a sufficient answer as plaintiff's counsel has reviewed the medical records and is not able to determine the identity of the individuals.\nINTERROGATORY NO. 9: (Hospital defendant only)\nPlease state the name, address, telephone number, and last known employer of the nursing supervisor for the shifts set forth in the preceding interrogatory.\nINTERROGATORY NO. 10:\nPlease identify by name and current or last known address and telephone number each and every person who has or claims to have knowledge of any facts relevant to the issues in this lawsuit, stating in detail all facts each person has or claims to have knowledge of.\nINTERROGATORY NO. 11:\na. Have any statements been taken from nonparties or the plaintiff(s) pertaining to this claim? For purposes of this request, a statement previously made is (1) a written statement signed or otherwise adopted or approved by the person making it, or (2) a stenographic, mechanical, electrical, or other recording, or a transcription thereof, which is a substantial verbatim recital or an oral statement by the person making it and contemporaneously recorded. With regard to each statement, state:\n1. The name and address of each person making a statement;\n2. The date on which the statement was made;\n3. The name and address of the person or persons taking each statement; and\n4. The subject matter of each statement.\nb. Attach a copy of each statement to the answers to these interrogatories.\nc. If you claim that any information, document, or thing sought or requested is privileged, protected by the work product doctrine, or otherwise not discoverable, please:\n1. Identify each document or thing by date, author, subject matter, and recipient;\n2. State in detail the legal and factual basis for asserting said privilege, work product protection, or objection, or refusing to provide discovery as requested.\nINTERROGATORY NO. 12:\nDo you or anyone acting on your behalf know of any photographs, films, or videotapes depicting ..........? If so, state:\na. The number of photographs or feet of film or videotape;\nb. The places, objects, or persons photographed, filmed, or videotaped;\nc. The date the photographs, film, or videotapes were taken;\nd. The name, address, and telephone number of each person who has the original or copy.\nPlease attach copies of any photographs or videotapes.\nINTERROGATORY NO. 13:\nIf you claim that injuries to plaintiff complained of in plaintiff's Complaint were contributed to or caused by plaintiff or any other person, including any other physician, hospital, nurse, or other health care provider, please state:\na. The facts upon which you base the claim;\nb. The name, current address, and current employer of each person whom you allege was or may have been negligent.\nINTERROGATORY No. 14:\nPlease state the name or names of the individuals supplying the information contained in your Answers to these Interrogatories. In addition, please state these individuals' current addresses, places of employment, and their current position at their place of employment.\nINTERROGATORY NO. 15:\nDoes defendant have knowledge of any conversations or statements made by the plaintiff(s) concerning any subject matter relative to this action? If so, please state:\na. The name and last known address of each person who claims to have heard such conversations or statements;\nb. The date of such conversations or statements;\nc. The summary or the substance of each conversation or statement.\nINTERROGATORY NO. 16:\nDid the defendant, the defendant's agents, or employees conduct a surveillance of the plaintiff(s)? If so, state:\na. Name, address, and occupation of the person who conducted each surveillance;\nb. Name and address of the person who requested each surveillance to be made;\nc. Date or dates on which each surveillance was conducted;\nd. Place or places where each surveillance was performed;\ne. Information or facts discovered in the surveillance;\nf. Name and address of the person now having custody of each written report, photographs, videotapes, or other documents concerning each surveillance.\nINTERROGATORY NO. 17:\nAre you aware of any person you may call as a witness at the trial of this action who may have or claims you have any information concerning the medical, mental, or physical condition of the plaintiff(s) prior to the incident in question? .......... If so, state:\na. The name and last known address of each person and your means of ascertaining the present whereabouts of each person;\nb. The occupation and employer of each person;\nc. The subject and substance of the information each person claims to have.\nINTERROGATORY NO. 18:\nAs to any affirmative defenses you allege, state the factual basis of and describe each affirmative defense, the evidence which will be offered at trial concerning any alleged affirmative defense, including the names of any witnesses who will testify in support thereof, and the descriptions of any exhibits which will be offered to establish each affirmative defense.\nINTERROGATORY NO. 19:\n(a) Do you contend that any entries in the answering defendant's medical/hospital records are incorrect or inaccurate? If so, state:\na. The precise entry(ies) that you think are incorrect or inaccurate;\nb. What you contend the correct or accurate entry(ies) should have been;\nc. The name, address, and employer of each and every person who has knowledge pertaining to a. and b.;\nd. A description, including the author and title of each and every document that you claim supports your answer to a. and b.;\ne. The name, address, and telephone number of each and every person you intend to call as a witness in support of your contention.\n(b) Uniform defendant's interrogatories to the plaintiff for personal injury cases are as follows:\nDEFENDANT'S INTERROGATORIES TO PLAINTIFF (PERSONAL INJURY)\n1. State your full name, address, date of birth, marital status, and Social Security number.\n2. If you have been employed at any time in the past ten years, with respect to this period state the names and addresses of each of your employers, describe the nature of your work, and state the approximate dates of each employment.\n3. If you have ever been a party to a lawsuit where you claimed damages for injury to your person, state the title of the suit, the court file number, the date of filing, the name and address of any involved insurance carrier, the kind of claim, and the ultimate disposition of the same. (This is meant to include workers' compensation and Social Security disability claims.)\n4. Identify by name and address each and every physician, surgeon, medical practitioner, or other health care practitioner whom you consulted or who provided advice, treatment, or care for you at any time within the last ten years and, with respect to each contract, consultation, treatment, or advice, describe the same with particularity and indicate the reasons for the same.\n5. State the name and address of each and every hospital, treatment facility, or institution in which plaintiff has been confined for any reason at any time, and set forth with particularity the reasons for each confinement and/or treatment and the dates of each.\n6. Itemize all special damages which you claim in this case and specify, where appropriate, the basis and reason for your calculation as to each item of special damages.\n7. List all payments related to the injury or disability in question that have been made to you, or on your behalf, from \"collateral sources\" as that term is defined in Minnesota Statutes, section 548.251.\n8. List all amounts that have been paid, contributed, or forfeited by, or on behalf of, you or members of your immediate family for the two-year period immediately before the accrual of this action to secure the right to collateral source benefits that have been made to you or on your behalf.\n9. Do you contend any of the following:\na. That defendant did not possess that degree of skill and learning which is normally possessed and used by medical professionals in good standing in a similar practice and under like circumstances;\nb. That defendant did not exercise that degree of skill and learning which is normally used by medical professionals in good standing in a similar practice and under like circumstances.\n10. If your answer to any part of the foregoing interrogatory is yes, with respect to each answer:\na. Specify in detail each contention;\nb. Specify in detail each act or omission of defendant which you contend was a departure from the degree of skill and learning normally used by medical professionals in a similar practice and under like circumstances;\nc. Specify in detail the conduct of defendant as you claim it should have been;\nd. Specify in detail each fact known to you and your attorneys upon which you base your answers to interrogatories 9 and 10.\n11. If you claim defendant failed to disclose to you any risk concerning the involved medical care and treatment which, if disclosed, would have resulted in your refusing to consent to the medical care or treatment, then:\na. State in detail each and every thing defendant did tell you concerning the risks of the involved medical care and treatment, giving the approximate dates thereof and identifying all persons in attendance;\nb. Describe each and every risk which you claim defendant should have, but failed to, disclose to you;\nc. Describe in detail precisely what you claim defendant should have said to you, but failed to say, concerning the risks of the involved medical care and treatment;\nd. Explain in detail all facts and reasons upon which you base the claim that, if the foregoing risks were explained to you, you would not have consented to the involved medical care and treatment.\n12. Please identify by name and current or last known address and telephone number each and every person who has or claims to have any knowledge of any facts relevant to the issues in this lawsuit, stating in detail all facts each person has or claims to have knowledge of.\n13. As to each expert whom you expect to call as a witness at trial, please state:\na. The expert's name, address, occupation, and title;\nb. The expert's field of expertise, including subspecialties, if any;\nc. The expert's education background;\nd. The expert's work experience in the field of expertise;\ne. All professional societies and associations of which the expert is a member;\nf. All hospitals at which the expert has staff privileges of any kind;\ng. All written publications of which the expert is the author, giving the title of the publication and when and where it was published.\n14. With respect to each person identified in answer to the foregoing interrogatory, state:\na. The subject matter on which the expert is expected to testify;\nb. The substance of the facts and opinions to which the expert is expected to testify; and\nc. A summary of the grounds for each opinion, including the specific factual data upon which the opinion will be based.\n15. Have any statements been taken from any defendant or nonparty pertaining to this claim? For purposes of this request, a statement previously made is: (1) a written statement signed or otherwise adopted or approved by the person making it, or (2) a stenographic, mechanical, electrical, or other recording, or a transcription thereof, which is a substantial verbatim recital or an oral statement by the person making it and contemporaneously recorded. With regard to each statement, state:\na. The name and address of each person making a statement;\nb. The date on which the statement was made;\nc. The name and address of the person or persons taking each statement; and\nd. The subject matter of the statement;\ne. Attach a copy of each statement to the answers to these interrogatories.\nf. If you claim that any information, document, or thing sought or requested is privileged, protected by the work product doctrine, or otherwise not discoverable, please:\n1. Identify each document or thing by date, author, subject matter, and recipient;\n2. State in detail the legal and factual basis for asserting said privilege, work product protection, or objection, or refusing to provide discovery as requested.\n(c) Uniform defendant's interrogatories to the plaintiff for wrongful death cases are as follows:\nDEFENDANT'S INTERROGATORIES TO PLAINTIFF (WRONGFUL DEATH)\n1. State the full name, age, present occupation, business address, present residence address, and address for a period of ten years prior to the present date for each heir or next of kin (including the Trustee) on whose behalf this action has been commenced.\n2. Set forth the date of birth and place of birth of the decedent.\n3. Set forth the date of birth and place of birth of the decedent's surviving spouse.\n4. Set forth the names, date of birth, and places of birth of any children of decedent.\n5. Set forth the names, addresses, and dates of birth of all heirs and next of kin of decedent and set forth the relationship of each individual to decedent.\n6. Set forth the date of marriage between decedent and decedent's surviving spouse and the place of the marriage.\n7. Set forth whether or not there were any proceedings for a legal separation or divorce instituted between decedent and decedent's surviving spouse and, if so, set forth the dates that the proceedings were instituted, the result of the proceedings, and the court in which the proceedings were instituted.\n8. Set forth whether or not decedent was ever married to anyone other than decedent's surviving spouse and if so, set forth the names of any other spouse or spouses and the inclusive dates of any other marriages.\n9. Set forth whether or not decedent's surviving spouse has ever been married to anyone other than decedent and, if so, set forth the names of any other spouses and the inclusive dates of any other marriages.\n10. If you claim defendant failed to disclose to you any risk concerning the involved medical care and treatment which, if disclosed, would have resulted in the decedent's refusing to consent to the medical care or treatment, then:\na. State in detail each and every thing defendant did tell you concerning the risks of the involved medical care and treatment, giving the approximate dates thereof and identify all persons in attendance;\nb. Describe each and every risk which you claim defendants should have, but failed to, disclose to you;\nc. Describe in detail precisely what you claim defendant should have said to you, but failed to say, concerning the risks of the involved medical care and treatment;\nd. Explain in detail all facts and reasons upon which you base the claim that, if the foregoing risks were explained to you, you would not have consented to the involved medical care and treatment.\n11. Was the deceased employed at the time of death?\n12. If the answer to Interrogatory No. 10 is yes, indicate the following:\na. The name and address of the deceased's employer and the nature of the employment;\nb. The amount of earnings from the employment;\nc. Defendant requests copies of the decedent's federal and state income tax return for the past five years.\n13. If decedent was self-employed for any period of time during the ten-year period of time immediately preceding decedent's death, set forth the following:\na. The inclusive dates of the self-employment;\nb. A specific and detailed description of the nature of the self-employment;\nc. The business name and address under which decedent operated; and\nd. A specific and detailed description of decedent's earnings from the self-employment.\n14. Set forth in detail a chronological education history of decedent including the name and address of each school attended, the inclusive dates of attendance, the date of graduation, a description of any degrees awarded, a description of the major area of study and the grade point average upon graduation.\n15. Did the decedent make any contribution of money, property, or other items having a money worth toward the support, maintenance, or well-being of any next of kin and, if so, please itemize the following:\na. The amount and nature of the contribution;\nb. The date(s) upon which each contribution was made;\nc. The person(s) receiving each contribution;\nd. The period of time over which the contributions were made;\ne. The regularity or irregularity of the contributions;\nf. Identify by date, author, type, recipient, and present custodian each and every document referring to or otherwise evidencing each contribution.\n16. Identify by name and address each and every physician, surgeon, medical practitioner, or other health care practitioner whom the decedent consulted or who provided advice, treatment, or care for the decedent at any time within ten years prior to death and, with respect to the contact, consultation, treatment, or advice, describe the same with particularity and indicate the reasons for the same.\n17. State the name and address of each and every hospital, treatment facility, or institution in which the decedent has been confined for any reason at any time, and set forth with particularity the reasons for each confinement and/or treatment and the dates of each.\n18. Itemize all special damages which you claim in this case and specify, where appropriate, the basis and reason for your calculation as to each item of special damages.\n19. List any payment related to the injury or disability in question made to you, or on your behalf, from \"collateral sources\" as that term is defined in Minnesota Statutes, section 548.251.\n20. List all amounts that have been paid, contributed or forfeited by, or on behalf of, you or members of your immediate family for the two-year period immediately before the accrual of this action to secure the right to collateral source benefits that have been made to you or on your behalf.\n21. Do you contend any of the following:\na. That any of the defendants did not possess that degree of skill and learning which is normally possessed and used by medical professionals in good standing in a similar practice and under like circumstances? If so, identify the defendants;\nb. That any of the defendants did not exercise that degree of skill and learning which is normally used by medical professionals in good standing in a similar practice and under like circumstances? If so, identify the defendants.\n22. If your answer to any part of the foregoing interrogatory is yes, with respect to each answer:\na. Specify in detail your contention;\nb. Specify in detail each act or omission of each defendant which you contend was a departure from that degree of skill and learning normally used by medical professionals in a similar practice and under like circumstances.\n23. Please identify by name and current or last known address and telephone number of each and every person who has or claims to have any knowledge of any facts relevant to the issues in this lawsuit, stating in detail all facts each person has or claims to have knowledge of.\n24. As to each expert whom you expect to call as a witness at trial, please state:\na. The expert's name, address, occupation, and title;\nb. The expert's field of expertise, including subspecialties, if any;\nc. The expert's education background;\nd. The expert's work experience in the field of expertise;\ne. All professional societies and associations of which the expert is a member;\nf. All hospitals at which the expert has staff privileges of any kind;\ng. All written publications of which the expert is the author, giving the title of the publication and when and where it was published.\n25. With respect to each person identified in the foregoing interrogatory, state:\na. The subject matter on which the expert is expected to testify;\nb. The substance of the facts and opinions to which the expert is expected to testify; and\nc. A summary of the grounds for each opinion, including the specific factual data upon which the opinion will be based.\n26. Set forth in detail anything said or written by which plaintiff claims to be relevant to any of the issues in this lawsuit, identifying the time and place of each statement, who was present, and what was said by each person who was present.\n27. Have any statements been taken from any defendant or nonparty pertaining to this claim? For purposes of this request, a statement previously made is: (1) a written statement signed or otherwise adopted or approved by the person making it, or (2) a stenographic, mechanical, electrical, or other recording, or a transcription thereof, which is a substantial verbatim recital or an oral statement by the person making it and contemporaneously recorded. With regard to each statement, state:\na. The name and address of each person making a statement;\nb. The date on which the statement was made;\nc. The name and address of the person or persons taking each statement; and\nd. The subject matter of each statement;\ne. Attach a copy of each statement to the answers to these interrogatories;\nf. If you claim that any information, document or thing sought or requested is privileged, protected by the work product doctrine, or otherwise not discoverable, please:\n1. Identify each document or thing by date, author, subject matter, and recipient;\n2. State in detail the legal and factual basis for asserting said privilege, work product protection, or objection, or refusing to provide discovery as requested.",
	"repealed": false
}