{
	"id": "334.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/334.16",
	"title": "334.16 FINANCE CHARGES FOR OPEN END CREDIT SALES.",
	"text": "The imposition, charge or collection of a finance charge upon an account balance by a seller of goods, services or both shall be lawful, provided that:\n(a) The sale is a consumer credit sale pursuant to an open end credit plan, agreement or arrangement between the buyer and seller under which (1) the seller may permit the buyer to make purchases from time to time from the seller or other sellers, (2) the buyer has the privilege of paying the balance in full or in installments, and (3) a finance charge may be computed by the seller from time to time on an outstanding unpaid balance.\n(b) The terms of the plan, agreement or arrangement provide for a periodic rate of finance charge which does not exceed 1-1/2 percent per month computed on an amount no greater than the average daily balance of the account during each monthly billing cycle; provided a minimum finance charge not in excess of 50 cents per month may be imposed, charged or collected.\n(c) No finance charge in excess of 1-1/3 percent per month shall be imposed on an open end and consumer credit account by any issuer whose credit card is issued primarily for the purpose of purchasing motor fuels and related products and whose gross annual national sales exceed $10 billion. Retailers must give adequate notice to open end consumer credit customers before any higher interest rate is applied. Accompanying credit statements must not suggest that the Minnesota legislature required retailers to raise interest rates. The accompanying material must make clear that the increase affects only the maximum allowable interest rate.\nThe definitions and the provisions on computation of percentage rates in the Truth-in-Lending Act, Title I of the Consumer Credit Protection Act, Public Law 90-321, and in Regulation Z of the Board of Governors of the Federal Reserve System adopted pursuant thereto, Code of Federal Regulations, title 12, part 226, as in effect on June 5, 1971, shall apply to the terms used in sections 334.16 to 334.18, and computations thereunder.\nThe calculation of the average daily balance for the purpose of the limitation on rates imposed by subdivision 1, paragraph (b), shall be made by excluding from the daily balances the amount of each sale from the date of sale until the last day of the regular billing cycle during which the sale was made. The portion of any balance arising from the sale of goods which are returned shall be excluded from the unpaid balance as of the date the goods are returned.",
	"repealed": false
}