{
	"id": "18D.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/18D.201",
	"title": "18D.201 INSPECTION, SAMPLING, ANALYSIS.",
	"text": "(a) The commissioner, upon presentation of official department credentials, must be granted access at reasonable times without delay to sites:\n(1) where a person manufactures, formulates, distributes, uses, disposes of, stores, or transports an agricultural chemical; or\n(2) which the commissioner reasonably believes are affected, or possibly affected, by the use of an agricultural chemical, agricultural chemical container, agricultural chemical rinsate, or agricultural chemical device in violation of this chapter.\n(b) The commissioner may enter sites for:\n(1) inspection of equipment for the manufacture, formulation, blending, distribution, disposal, or application of agricultural chemicals and the premises on which the equipment is stored;\n(2) sampling of sites actually or reportedly exposed to agricultural chemicals;\n(3) inspection of storage, handling, distribution, use, or disposal areas of agricultural chemicals or their containers;\n(4) inspection or investigation of complaints of injury to the environment;\n(5) sampling of agricultural chemicals;\n(6) observation of the use and application of an agricultural chemical;\n(7) inspection of records related to the manufacture, distribution, storage, handling, use, or disposal of an agricultural chemical;\n(8) investigating the source, nature, and extent of an incident, and the extent of the adverse effects on the environment; and\n(9) other purposes necessary to implement this chapter, chapter 18B, or 18C.\n(c) The commissioner may enter any public or private premises during or after regular business hours without a notice of inspection when a suspected incident may threaten public health or the environment.\n(a) The commissioner shall provide the owner, operator, or agent in charge with a receipt describing any samples obtained. If requested, the commissioner shall split any samples obtained and provide them to the owner, operator, or agent in charge. If an analysis is made of the samples, a copy of the results of the analysis must be furnished to the owner, operator, or agent in charge within 30 days after an analysis has been performed. If an analysis is not performed, the commissioner must notify the owner, operator, or agent in charge within 30 days of the decision not to perform the analysis.\n(b) The methods of sampling and analysis must be those adopted by the United States Environmental Protection Agency or the Association of Official Analytical Chemists. In cases not covered by those methods, or in cases where methods are available in which improved applicability has been demonstrated, the commissioner may adopt appropriate methods from other sources.\n(c) In sampling a lot of agricultural chemical that is registered, a single package may constitute the official sample.\n(a) A person who believes that a violation of this chapter has occurred may request an inspection by giving notice to the commissioner of the violation. The notice must be in writing, state with reasonable particularity the grounds for the notice, and be signed by the person making the request. If the pesticide application is alleged to have damaged a crop or vegetation, the request for inspection must be submitted within 45 days of the date of the pesticide application.\n(b) If after receiving a notice of violation the commissioner reasonably believes that a violation has occurred, the commissioner shall make a special inspection in accordance with the provisions of this section as soon as practicable, to determine if a violation has occurred.\n(c) An inspection conducted pursuant to a notice under this subdivision may cover an entire site and is not limited to the portion of the site specified in the notice. If the commissioner determines that reasonable grounds to believe that a violation occurred do not exist, the commissioner must notify the person making the request in writing of the determination.\nAfter a refusal or an anticipated refusal based on a prior refusal to allow entrance on a prior occasion by an owner, operator, or agent in charge to allow entry as specified in this chapter, the commissioner may apply for an order in the district court in the county where a site is located, that compels a person with authority to allow the commissioner to enter and inspect the site.\n(a) The cost of reinspection and reinvestigation may be assessed by the commissioner if the person subject to the corrective action order or remedial action order does not comply with the order in a reasonable time as provided in the order.\n(b) The commissioner may enter an order for recovery of the inspection and investigation costs.\n(a) In making inspections under this chapter, the commissioner may administer oaths, certify official acts, issue subpoenas to take and cause to be taken depositions of witnesses, and compel the attendance of witnesses and production of papers, books, documents, records, and testimony.\n(b) If a person fails to comply with a subpoena, or a witness refuses to produce evidence or to testify to a matter about which the person may be lawfully questioned, the district court shall, on application of the commissioner, compel obedience proceedings for contempt, as in the case of disobedience of the requirements of a subpoena issued by the court or a refusal to testify in court.\n(a) The commissioner may implement policies and procedures that provide for a decrease in the frequency of regulatory inspection for a person or site issued a certification of compliance pursuant to section 18C.111, subdivision 4.\n(b) The commissioner must consider the compliance history, enforcement record, and other public safety or environmental risk factors in determining the eligibility of a person or site for the reduced frequency of inspection described in paragraph (a). If the commissioner determines that a person or site is ineligible, the commissioner must notify the person or site of that ineligibility and the reasons for that determination.\n(c) The compliance findings of the commissioner's inspection of a person or site that stores, handles, or distributes ammonia and anhydrous ammonia fertilizer may be used as a basis for decreased frequency of regulatory inspection, as described in paragraphs (a) and (b).",
	"repealed": false
}