{
	"id": "332.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.30",
	"title": "332.30 ACCELERATED MORTGAGE PAYMENT PROVIDER; BOND REQUIREMENTS.",
	"text": "(a) Before beginning business in this state, an accelerated mortgage payment provider, as defined in section 332A.02, subdivision 8, clause (9), shall submit to the commissioner of commerce an authorization fee of $250 and either:\n(1) a surety bond in which the accelerated mortgage payment provider is the obligor, in an amount determined by the commissioner; or\n(2) if the commissioner agrees to accept it, a deposit:\n(i) in cash in an amount equivalent to the bond amount; or\n(ii) of authorized securities, as defined in section 50.14, with an aggregate market value equal to the bond amount. The cash or securities must be deposited with the commissioner of management and budget.\n(b) The amount of the bond required by the commissioner shall vary with the amount of Minnesota client funds held or to be held by the obligor. For new businesses, the bond must be no less than $100,000, except as provided in section 332.301. The commissioner may increase the required bond amount upon 30 days' notice to the accelerated mortgage payment provider.\n(c) If a bond is submitted, it must name as surety an insurance company authorized to transact fidelity and surety business in this state. The bond must run to the state of Minnesota for the use of the state and of any person who may have a claim against the obligor arising out of the obligor's activities as an accelerated mortgage payment provider. The bond must be conditioned that the obligor will not commit any fraudulent act and will faithfully conform to and abide by the provisions of accelerated mortgage payment agreements with Minnesota residents.\n(d) If an accelerated mortgage payment provider has failed to account to a mortgagor or distribute funds to the mortgagee as required by an accelerated mortgage payment agreement, the mortgagor or the mortgagor's legal representative or receiver or the commissioner shall have, in addition to any other legal remedies, a right of action in the name of the debtor on the bond or the security given pursuant to this section.\n(e) Section 58A.04, subdivisions 2 and 3, apply to this section.",
	"repealed": false
}