{
	"id": "86A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/86A.09",
	"title": "86A.09 DEVELOPMENT AND ESTABLISHMENT OF UNITS.",
	"text": "No construction of new facilities or other development of an authorized unit, other than repairs and maintenance, shall commence until the managing agency has prepared a master plan for administration of the unit in conformity with this section. No master plan is required for wildlife management areas that do not have resident managers, for scientific and natural areas, for water-access sites, for aquatic management areas, for rest areas, or for boater waysides.\nThe managing agency shall supervise preparation of the master plan and shall utilize the professional staffs of any agency of the state when the expertise of the staff of such agency is necessary to adequately prepare the master plan; the master plan shall present the information in a format and detail that is appropriate to the size and complexity of the authorized unit. When the master plan has been completed the managing agency shall announce to the public in a manner reasonably designed to inform interested persons that the master plan is available for public review and in the case of any major unit shall hold at least one public meeting on the plan in the vicinity of the unit. The managing agency shall make the master plan available for review and comment by the public and other state agencies for at least 15 days prior to the public meeting and shall accept comments on the plan for at least 30 days before approval. The managing agency shall prepare a record of the public meeting and any comments received during the comment period.\nAll master plans required by this section shall:\n(1) provide for administration of the unit in a manner that is consistent with the purposes for which the unit was authorized and with the principles governing the administration of the unit, as specified in section 86A.05 and the statutes relating to each type of unit; and\n(2) recognize values and resources within the unit that are primarily the responsibility of another managing agency to protect or develop and provide for their protection or development either through a cooperative agreement with the other managing agency or through designation of the appropriate area as a secondary unit.\nConstruction of necessary facilities and other development of the unit shall commence as soon as practicable and shall be carried out in conformity with the master plan.\nWhen, in the opinion of the managing agency, acquisition and development of the unit are sufficiently complete to permit operation and administration of the unit in substantial conformity with the master plan as approved, the managing agency shall declare the unit established and ready for use.\nThe managing agency shall prepare an amendment to a master plan to address changes proposed for a unit that would vary from the approved master plan. The master plan amendment shall address the impacts of the proposed changes to the natural and cultural resources, interpretive services, recreational opportunities, and administrative activities at the unit. The master plan amendment supersedes the master plan for those areas addressed by the amendment. The managing agency shall hold a public meeting for master plan amendments that constitute a significant change in public use or access to the unit or that may be controversial. Public notice and approval of the master plan amendment shall follow the process described in subdivision 2. Construction of necessary facilities and other development of the unit shall commence as soon as practicable after the master plan amendment is adopted.",
	"repealed": false
}