{
	"id": "103G.2243",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.2243",
	"title": "103G.2243 LOCAL COMPREHENSIVE WETLAND PROTECTION AND MANAGEMENT PLANS.",
	"text": "(a) As an alternative to the rules adopted under section 103G.2242, subdivision 1, and the public value criteria established or approved under section 103B.3355, a comprehensive wetland protection and management plan may be developed by a local government unit, or one or more local government units operating under a joint powers agreement, provided that:\n(1) a notice is made at the beginning of the planning process to the board, the commissioner of natural resources, the Pollution Control Agency, the commissioner of agriculture, local government units, and local citizens to actively participate in the development of the plan; and\n(2) the plan is implemented by ordinance as part of the local government's official controls under chapter 394, for a county; chapter 462, for a city; chapter 366, for a town; and by rules adopted under chapter 103D, for a watershed district; and chapter 103B, for a watershed management organization.\n(b) An organization that is invited to participate in the development of the local plan, but declines to do so and fails to participate or to provide written comments during the local review process, waives the right during board review to submit comments, except comments concerning consistency of the plan with laws and rules administered by that agency. In determining the merit of an agency comment, the board shall consider the involvement of the agency in the development of the local plan.\nA comprehensive wetland protection and management plan may:\n(1) provide for classification of wetlands in the plan area based on:\n(i) an inventory of wetlands in the plan area;\n(ii) an assessment of the wetland functions listed in section 103B.3355, using a methodology chosen by the Technical Evaluation Panel from one of the methodologies established or approved by the board under that section; and\n(iii) the resulting public values;\n(2) vary application of the sequencing standards in section 103G.222, subdivision 1, paragraph (b), for projects based on the classification and criteria set forth in the plan;\n(3) vary the replacement standards of section 103G.222, subdivision 1, paragraphs (f) and (g), based on the classification and criteria set forth in the plan, for specific wetland impacts provided there is no net loss of public values within the area subject to the plan, and so long as:\n(i) in a 50 to 80 percent area, a minimum acreage requirement of one acre of replaced wetland for each acre of drained or filled wetland requiring replacement is met within the area subject to the plan; and\n(ii) in a less than 50 percent area, a minimum acreage requirement of two acres of replaced wetland for each acre of drained or filled wetland requiring replacement is met within the area subject to the plan, except that replacement for the amount above a 1:1 ratio can be accomplished as described in section 103G.2242, subdivision 12; and\n(4) in a greater than 80 percent area, allow replacement credit, based on the classification and criteria set forth in the plan, for any project that increases the public value of wetlands, including activities on adjacent upland acres.\n(a) The plan is deemed approved 60 days after the local government submits the final plan to the board, unless the board disagrees with the plan as provided in paragraph (d).\n(b) The board may not disapprove a plan if the board determines the plan meets the requirements of this section.\n(c) In its review of a plan, the board shall advise the local government unit of those elements of the plan that are more restrictive than state law and rules for purposes of section 103G.237, subdivision 5.\n(d) If the board disagrees with the plan or any elements of the plan, the board shall, in writing, notify the local government of the plan deficiencies and suggested changes. The board shall include in the response to the local government the scientific justification, if applicable, for the board's concerns with the plan. Upon receipt of the board's concerns with the plan, the local government has 60 days to revise the plan and resubmit the plan to the board for reconsideration, or the local government may request a hearing before the board. The board shall hold a hearing within the boundaries of the jurisdiction of the local government within 60 days of the request for hearing. After the hearing, the board shall, within 60 days, prepare a report of its decision and inform the local government.\n(e) If, after the hearing, the board and local government disagree on the plan, the board shall, within 60 days, initiate mediation through a neutral party. If the board and local government unit agree in writing not to use mediation or the mediation does not result in a resolution of the differences between the parties, then the board may commence a declaratory judgment action in the district court of the county where the local government unit is located. If the board does not commence a declaratory judgment action within the applicable 60-day period, the plan is deemed approved.\n(f) The declaratory judgment action must be commenced within 60 days after the date of the written agreement not to use mediation or 60 days after conclusion of the mediation. If the board commences a declaratory judgment action, the district court shall review the board's record of decision and the record of decision of the local government unit. The district court shall affirm the plan if it meets the requirements of this section.\n(a) The plan becomes effective as provided in subdivision 3, paragraphs (d) to (f), and after adoption of the plan into the official controls of the local government.\n(b) After the effective date of a plan, a local government unit shall make replacement decisions consistent with the plan.\nAmendments to the plan become effective upon completion of the same process required for the original plan.\nExcept as otherwise provided for in this section, all other requirements relating to development of the plan must be consistent with the water plan processes under sections 103B.231 and 103B.311.",
	"repealed": false
}