{
	"id": "84.7741",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.7741",
	"title": "84.7741 OFF-HIGHWAY VEHICLE FORFEITURE.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Appropriate agency\" means a law enforcement agency that has the authority to make an arrest for a violation of a designated offense.\n(c) \"Claimant\" means an owner of an off-highway vehicle or a person claiming a leasehold or security interest in an off-highway vehicle.\n(d) \"Designated offense\" means a second gross misdemeanor violation under section 84.774, paragraph (b).\n(e) \"Family or household member\" means:\n(1) a parent, stepparent, or guardian;\n(2) any of the following persons related by blood, marriage, or adoption: brother, sister, stepbrother, stepsister, first cousin, aunt, uncle, nephew, niece, grandparent, great-grandparent, great-uncle, or great-aunt; or\n(3) persons residing together or persons who regularly associate and communicate with one another outside of a workplace setting.\n(f) \"Off-highway vehicle\" and \"vehicle\" do not include an off-highway vehicle that is stolen or taken in violation of the law.\n(g) \"Owner\" means a person legally entitled to possession, use, and control of an off-highway vehicle, including a lessee of an off-highway vehicle if the lease agreement has a term of 180 days or more. There is a rebuttable presumption that a person registered as the owner of an off-highway vehicle according to the records of the Department of Public Safety or the Department of Natural Resources is the legal owner. For purposes of this section, if an off-highway vehicle is owned jointly by two or more people, each owner's interest extends to the whole of the vehicle and is not subject to apportionment.\n(h) \"Prosecuting authority\" means the attorney in the jurisdiction in which the designated offense occurred, or a designee, who is responsible for prosecuting violations of a designated offense. If a state agency initiated the forfeiture and the attorney responsible for prosecuting the designated offense declines to pursue forfeiture, the attorney general's office, or its designee, may initiate forfeiture under this section.\n(i) \"Security interest\" means a bona fide security interest perfected according to section 168A.17, subdivision 2, based on a loan or other financing that, if an off-highway vehicle is required to be registered under chapter 168, is listed on the vehicle's title.\n(a) An off-highway vehicle subject to forfeiture under this section may be seized by the appropriate agency upon process issued by any court having jurisdiction over the vehicle.\n(b) Property may be seized without process if:\n(1) the seizure is incident to a lawful arrest or a lawful search;\n(2) the vehicle subject to seizure has been the subject of a prior judgment in favor of the state in a criminal injunction or forfeiture proceeding under this section; or\n(3) the appropriate agency has probable cause to believe that the delay occasioned by the necessity to obtain process would result in the removal or destruction of the vehicle. If property is seized without process under this clause, the prosecuting authority must institute a forfeiture action under this section as soon as is reasonably possible by serving a notice of seizure and intent to forfeit at the address of the owner as listed in the records of the Department of Public Safety or Department of Natural Resources.\n(c) When an off-highway vehicle is seized, the officer must provide a receipt to the person found in possession of the vehicle; or in the absence of any person, the officer must leave a receipt in the place where the vehicle was found, if reasonably possible.\nAll right, title, and interest in an off-highway vehicle subject to forfeiture under this section vests in the appropriate agency upon commission of the conduct resulting in the designated offense giving rise to the forfeiture. Any vehicle seized under this section is not subject to replevin, but is deemed to be in the custody of the appropriate agency subject to the orders and decrees of the court having jurisdiction over the forfeiture proceedings. When an off-highway vehicle is seized under this section, the appropriate agency shall use reasonable diligence to secure the property and prevent waste and may do any of the following:\n(1) place the vehicle under seal;\n(2) remove the vehicle to a place designated by the agency; and\n(3) place a disabling device on the vehicle.\nIf the owner of an off-highway vehicle that has been seized under this section seeks possession of the vehicle before the forfeiture action is determined, the owner may give security or post bond payable to the appropriate agency in an amount equal to the retail value of the seized vehicle. On posting the security or bond, the seized vehicle may be returned to the owner. The forfeiture action must proceed against the security as if it were the seized vehicle. This subdivision does not apply to a vehicle being held for investigatory purposes.\nCertified copies of court records and off-highway vehicle and driver's records concerning prior incidents are admissible as substantive evidence where necessary to prove the commission of a designated offense.\nPrior to the entry of a court order disposing with the forfeiture action, any person who has an interest in forfeited property may file with the prosecuting authority a petition for remission or mitigation of the forfeiture. The prosecuting authority may remit or mitigate the forfeiture upon terms and conditions the prosecuting authority deems reasonable if the prosecuting authority finds that:\n(1) the forfeiture was incurred without willful negligence or without any intention on the part of the petitioner to violate the law; or\n(2) extenuating circumstances justify the remission or mitigation of the forfeiture.\nAn off-highway vehicle is subject to forfeiture under this section if it was used in the commission of a designated offense.\n(a) An off-highway vehicle is presumed subject to forfeiture under this section if the driver:\n(1) is convicted of the designated offense upon which the forfeiture is based; or\n(2) fails to appear for a scheduled court appearance with respect to the designated offense charged and fails to voluntarily surrender within 48 hours after the time required for appearance.\n(b) An off-highway vehicle encumbered by a security interest perfected according to section 168A.17, subdivision 2, or subject to a lease that has a term of 180 days or more, is subject to the interest of the secured party or lessor unless the party or lessor had knowledge of or consented to the act upon which the forfeiture is based. However, when the proceeds of the sale of a seized vehicle do not equal or exceed the outstanding loan balance, the appropriate agency shall remit all proceeds of the sale to the secured party after deducting the agency's costs for the seizure, tow, storage, forfeiture, and sale of the vehicle. If the sale of the vehicle is conducted in a commercially reasonable manner consistent with section 336.9-610, the agency is not liable to the secured party for any amount owed on the loan in excess of the sale proceeds. The validity and amount of a nonperfected security interest must be established by its holder by clear and convincing evidence.\n(c) Notwithstanding paragraph (b), the secured party's or lessor's interest in an off-highway vehicle is not subject to forfeiture based solely on the secured party's or lessor's knowledge of the act or omission upon which the forfeiture is based if the secured party or lessor demonstrates by clear and convincing evidence that the party or lessor took reasonable steps to terminate use of the vehicle by the offender.\n(d) An off-highway vehicle is not subject to forfeiture under this section if its owner can demonstrate by clear and convincing evidence that the owner did not have actual or constructive knowledge that the vehicle would be used or operated in any manner contrary to law or that the owner took reasonable steps to prevent use of the vehicle by the offender. If the offender is a family or household member of the owner and has three or more prior off-highway vehicle convictions, the owner is presumed to know of any vehicle use by the offender that is contrary to law.\n(a) An off-highway vehicle used to commit a designated offense is subject to administrative forfeiture under this subdivision.\n(b) Within 60 days from when an off-highway vehicle is seized under subdivision 2, or within a reasonable time after seizure, the appropriate agency shall serve the driver or operator of the vehicle with a notice of the seizure and intent to forfeit the vehicle. Additionally, when an off-highway vehicle is seized under subdivision 2, or within a reasonable time after that, all persons known to have an ownership, possessory, or security interest in the vehicle must be notified of the seizure and the intent to forfeit the vehicle. For those vehicles required to be registered under chapter 168, the notification to a person known to have a security interest in the vehicle is required only if the vehicle is registered under chapter 168 and the interest is listed on the vehicle's title. Upon motion by the appropriate agency or prosecuting authority, a court may extend the time period for sending notice for a period not to exceed 90 days for good cause shown. Notice mailed by certified mail to the address shown in Department of Public Safety records is sufficient notice to the registered owner of the vehicle. For off-highway vehicles not required to be registered under chapter 168, notice mailed by certified mail to the address shown in the applicable filing or registration for the vehicle is sufficient notice to a person known to have an ownership, possessory, or security interest in the vehicle. Otherwise, notice may be given in the manner provided by law for service of a summons in a civil action.\n(c) The notice must be in writing and contain:\n(1) a description of the vehicle seized;\n(2) the date of the seizure; and\n(3) notice of the right to obtain judicial review of the forfeiture and of the procedure for obtaining that judicial review, printed in English. This requirement does not preclude the appropriate agency from printing the notice in other languages in addition to English.\nSubstantially the following language must appear conspicuously in the notice:\n\"WARNING: You will automatically lose the above-described property and the right to be heard in court if you do not file a lawsuit and serve the prosecuting authority within 60 days. You may file your lawsuit in conciliation court if the property is worth $15,000 or less; otherwise, you must file in district court. You may not have to pay a filing fee for your lawsuit if you are unable to afford the fee. You do not have to pay a conciliation court fee if your property is worth less than $500.\"\n(d) If notice is not sent in accordance with paragraph (b), and no time extension is granted or the extension period has expired, the appropriate agency shall return the property to the person from whom the property was seized, if known. An agency's return of property due to lack of proper notice does not restrict the agency's authority to commence a forfeiture proceeding at a later time. The agency shall not be required to return contraband or other property that the person from whom the property was seized may not legally possess.\n(e) Within 60 days following service of a notice of seizure and forfeiture under this subdivision, a claimant may file a demand for a judicial determination of the forfeiture. The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service of a copy of the complaint on the prosecuting authority having jurisdiction over the forfeiture and the standard filing fee for civil actions unless the petitioner has the right to sue in forma pauperis under section 563.01. The claimant may serve the complaint on the prosecuting authority by any means permitted by court rules. If the value of the seized property is $15,000 or less, the claimant may file an action in conciliation court for recovery of the seized vehicle. A copy of the conciliation court statement of claim must be served personally or by mail on the prosecuting authority having jurisdiction over the forfeiture within 60 days following service of the notice of seizure and forfeiture under this subdivision. If the value of the seized property is less than $500, the claimant does not have to pay the conciliation court filing fee. No responsive pleading is required of the prosecuting authority and no court fees may be charged for the prosecuting authority's appearance in the matter. Pleadings, filings, and methods of service are governed by the Rules of Civil Procedure.\n(f) The complaint must be captioned in the name of the claimant as plaintiff and the seized vehicle as defendant and must state with specificity the grounds on which the claimant alleges the vehicle was improperly seized, the claimant's interest in the vehicle seized, and any affirmative defenses the claimant may have. Notwithstanding any law to the contrary, an action for the return of an off-highway vehicle seized under this section may not be maintained by or on behalf of any person who has been served with a notice of seizure and forfeiture unless the person has complied with this subdivision.\n(g) If the claimant makes a timely demand for a judicial determination under this subdivision, the forfeiture proceedings must be conducted according to subdivision 9.\n(a) This subdivision governs judicial determinations of the forfeiture of an off-highway vehicle used to commit a designated offense. An action for forfeiture is a civil in rem action and is independent of any criminal prosecution. All proceedings are governed by the Rules of Civil Procedure.\n(b) If no demand for judicial determination of the forfeiture is pending, the prosecuting authority may, in the name of the jurisdiction pursuing the forfeiture, file a separate complaint against the vehicle, describing it, specifying that it was used in the commission of a designated offense, and specifying the time and place of its unlawful use.\n(c) The prosecuting authority may file an answer to a properly served demand for judicial determination, including an affirmative counterclaim for forfeiture. The prosecuting authority is not required to file an answer.\n(d) A judicial determination under this subdivision must be held at the earliest practicable date, and in any event no later than 180 days following the filing of the demand by the claimant. If a related criminal proceeding is pending, the hearing shall not be held until the conclusion of the criminal proceedings. The district court administrator shall schedule the hearing as soon as practicable after the conclusion of the criminal prosecution. The district court administrator shall establish procedures to ensure efficient compliance with this subdivision. The hearing is to the court without a jury.\n(e) There is a presumption that an off-highway vehicle seized under this section is subject to forfeiture if the prosecuting authority establishes that the vehicle was used in the commission of a designated offense. A claimant bears the burden of proving any affirmative defense raised.\n(f) If the forfeiture is based on the commission of a designated offense and the person charged with the designated offense appears in court as required and is not convicted of the offense, the court shall order the property returned to the person legally entitled to it upon that person's compliance with the redemption requirements of subdivision 12.\n(g) If the lawful ownership of the vehicle used in the commission of a designated offense can be determined and the owner makes the demonstration required under subdivision 7, paragraph (d), the vehicle must be returned immediately upon the owner's compliance with the redemption requirements of subdivision 12.\n(h) If the court orders the return of a seized vehicle under this subdivision, it must order that filing fees be reimbursed to the person who filed the demand for judicial determination. In addition, the court may order sanctions under section 549.211. Any reimbursement fees or sanctions must be paid from other forfeiture proceeds of the law enforcement agency and prosecuting authority involved and in the same proportion as distributed under subdivision 10, paragraph (b).\n(a) If the vehicle is administratively forfeited under subdivision 8, or if the court finds under subdivision 9 that the vehicle is subject to forfeiture under subdivisions 6 and 7, the appropriate agency shall:\n(1) sell the vehicle and distribute the proceeds under paragraph (b); or\n(2) keep the vehicle for official use. If the agency keeps a forfeited off-highway vehicle for official use, the agency shall make reasonable efforts to ensure that the off-highway vehicle is available for use by the agency's officers who participate in off-highway vehicle enforcement or education programs.\n(b) The proceeds from the sale of forfeited vehicles, after payment of seizure, towing, storage, forfeiture, and sale expenses and satisfaction of valid liens against the property, must be distributed as follows:\n(1) 70 percent of the proceeds must be forwarded to the appropriate agency for deposit as a supplement to the state or local agency's operating fund or similar fund for use in purchasing equipment for off-highway vehicle enforcement, training, and education; and\n(2) 30 percent of the money or proceeds must be forwarded to the prosecuting authority that handled the forfeiture for deposit as a supplement to its operating fund or similar fund for prosecutorial purposes.\n(c) If a vehicle is sold under paragraph (a), the appropriate agency shall not sell the vehicle to:\n(1) an officer or employee of the agency that seized the property or to a person related to the officer or employee by blood or marriage; or\n(2) the prosecuting authority or any individual working in the same office or a person related to the authority or individual by blood or marriage.\n(d) Sales of forfeited vehicles under this section must be conducted in a commercially reasonable manner.\n(e) If a vehicle is forfeited administratively under this section and no demand for judicial determination is made, the appropriate agency shall provide the prosecuting authority with a copy of the forfeiture or evidence receipt, the notice of seizure and intent to forfeit, a statement of probable cause for forfeiture of the property, and a description of the property and its estimated value. Upon review and certification by the prosecuting authority that (1) the appropriate agency provided a receipt in accordance with subdivision 2, paragraph (c), (2) the appropriate agency served notice in accordance with subdivision 8, and (3) probable cause for forfeiture exists based on the officer's statement, the appropriate agency may dispose of the property in any of the ways listed in this subdivision.\n(a) A financial institution with a valid security interest in or a valid lease covering a forfeited off-highway vehicle may choose to dispose of the vehicle under this subdivision, in lieu of the appropriate agency disposing of the vehicle under subdivision 10. A financial institution wishing to dispose of an off-highway vehicle under this subdivision shall notify the appropriate agency of its intent, in writing, within 30 days after receiving notice of the seizure and forfeiture. The appropriate agency shall release the vehicle to the financial institution or its agent after the financial institution presents proof of its valid security agreement or of its lease agreement and the financial institution agrees not to sell the vehicle to a family or household member of the violator, unless the violator is not convicted of the offense on which the forfeiture is based. The financial institution shall dispose of the vehicle in a commercially reasonable manner as defined in section 336.9-610.\n(b) After disposing of the forfeited vehicle, the financial institution shall reimburse the appropriate agency for its seizure, storage, and forfeiture costs. The financial institution may then apply the proceeds of the sale to its storage costs, to its sale expenses, and to satisfy the lien or the lease on the vehicle. If any proceeds remain, the financial institution shall forward the proceeds to the state treasury, which shall credit the appropriate fund as specified in subdivision 10.\n(a) If an off-highway vehicle is seized by a peace officer for a designated offense, the seized vehicle must be released only:\n(1) to the registered owner, a person authorized by the registered owner, a lienholder of record, or a person who has purchased the vehicle from the registered owner who provides proof of ownership of the vehicle;\n(2) if the vehicle is subject to a rental or lease agreement, to a renter or lessee who provides a copy of the rental or lease agreement; or\n(3) to an agent of a towing company authorized by a registered owner if the owner provides proof of ownership of the vehicle.\n(b) The proof of ownership or, if applicable, the copy of the rental or lease agreement required under paragraph (a) must be provided to the law enforcement agency seizing the vehicle or to a person or entity designated by the law enforcement agency to receive the information.\n(c) No law enforcement agency, local unit of government, or state agency is responsible or financially liable for any storage fees incurred due to a seizure under this section.\nThe appropriate agency and prosecuting authority shall report on forfeitures occurring under this section as described in section 609.5315, subdivision 6.",
	"repealed": false
}