{
	"id": "297H.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.01",
	"title": "297H.01 SOLID WASTE MANAGEMENT TAX DEFINITIONS.",
	"text": "When used in this chapter, the following terms have the meanings given to them in this section. For terms not defined in this section, the definitions contained in chapter 115A are incorporated into this chapter.\n\"Commercial generator\" means any of the following:\n(1) an owner or operator of a business, including a home-operated business, industry, church, nursing home, nonprofit organization, school, or any other commercial or institutional enterprise that generates mixed municipal solid waste or nonmixed municipal solid waste; or\n(2) any other generator of taxable waste that is not a residential generator defined in subdivision 8. A commercial generator does not include a self-hauler.\n\"Cubic yard\" means a cubic yard of nonmixed municipal solid waste that is not compacted.\n\"Market price\" means the lowest price available in the area, assuming transactions between separate parties that are willing buyers and willing sellers in a market.\n\"Mixed municipal solid waste\" means mixed municipal solid waste as defined in section 115A.03, subdivision 21.\n\"Nonmixed municipal solid waste\" means:\n(1) infectious waste as defined in section 116.76, subdivision 12;\n(2) pathological waste as defined in section 116.76, subdivision 14;\n(3) industrial waste as defined in section 115A.03, subdivision 13a; and\n(4) construction debris as defined in section 115A.03, subdivision 7.\n\"Periodic waste collection\" means each time a waste container is emptied by the person that collects the nonmixed municipal solid waste at the point that the waste has been aggregated for collection by the generator.\n\"Residential generator\" means any of the following:\n(1) a detached single family residence that generates mixed municipal solid waste or nonmixed municipal solid waste;\n(2) a person residing in a building or site containing multiple residences that generates mixed municipal solid waste, including apartment buildings, common interest communities, or manufactured home parks, where each residence is separately billed by the waste service provider;\n(3) an owner of a building or site containing multiple residences or an association representing residences that generate mixed municipal solid waste or nonmixed municipal solid waste, including apartment buildings, condominiums, manufactured home parks, or townhomes where no residence is separately billed for such service by the waste management service provider and the owner or association is billed directly for the waste management services. A residential generator does not include a self-hauler.\n\"Sales price\" means total consideration valued in money for waste management services, excluding separately stated charges for exemptions listed under section 297H.06.\n\"Self-hauler\" means a person who transports mixed municipal solid waste or nonmixed municipal solid waste generated by that person or another person without compensation.\n\"Waste management service provider\" means the person who directly bills the generator or self-hauler for waste management services, and includes, but is not limited to, waste haulers, waste management facilities, utility services, and political subdivisions, to the extent they directly bill for waste management services.\n\"Waste management services\" means waste collection, transportation, processing, and disposal.",
	"repealed": false
}