{
	"id": "401.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.01",
	"title": "401.01 COMMUNITY CORRECTIONS ACT; PURPOSE AND DEFINITION.",
	"text": "(a) To more effectively protect society and promote efficiency and economy in delivering correctional services, the commissioner may subsidize counties and Tribal Nations to help them develop, implement, and operate community-based correctional programs, including:\n(1) preventive or diversionary correctional programs;\n(2) conditional release programs;\n(3) community corrections centers; and\n(4) facilities for detaining or confining, caring, and treating persons convicted of crime or adjudicated delinquent.\n(b) Counties and Tribal Nations must use risk, need, and responsivity principles in their correctional programming.\n(a) For purposes of this chapter, the terms defined in this subdivision have the meanings given them.\n(b) \"CCA jurisdiction\" means a county or Tribal Nation that participates in the Community Corrections Act, the subsidy program under this chapter.\n(c) \"Commissioner\" means the commissioner of corrections or a designee.\n(d) \"Conditional release\" means:\n(1) parole, supervised release, or conditional release as authorized by section 609.3455, subdivision 6, 7, or 8; Minnesota Statutes 2004, section 609.108, subdivision 6; or Minnesota Statutes 2004, section 609.109, subdivision 7;\n(2) work release as authorized by sections 241.26, 244.065, and 631.425; and\n(3) probation, furlough, and any other authorized temporary release from a correctional facility.\n(e) \"Detain\" means to take into actual custody, including custody within a local correctional facility.\n(f) \"Joint board\" means the board under section 471.59.\n(g) \"Local advisory board\" means:\n(1) for a CCA jurisdiction, a corrections advisory board as defined in section 401.08;\n(2) for a non-CCA jurisdiction other than a Tribal Nation, a human services advisory board as defined in section 402.02, or advisory committee or task force as defined in section 402.03; or\n(3) for a Tribal Nation that is a non-CCA jurisdiction, a board with membership as determined by the Tribal Nation.\n(h) \"Non-CCA jurisdiction\" means a county or Tribal Nation that is not participating in the Community Corrections Act subsidy program and provides or receives probation services according to section 244.19.\n(i) \"Probation officer\" means a county or Tribal probation officer under a CCA or non-CCA jurisdiction appointed with the powers under section 244.19.\n(j) \"Release\" means to release from actual custody.\n(k) \"Tribal Nation\" means a federally recognized Tribal Nation within the boundaries of the state of Minnesota.",
	"repealed": false
}