{
	"id": "505.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.22",
	"title": "505.22 MINNESOTA COORDINATE SYSTEMS DEFINED.",
	"text": "(a) For purposes of more precisely defining the Minnesota Coordinate System of 1927, the following definition by the National Ocean Survey/National Geodetic Survey is adopted:\nThe Minnesota Coordinate System of 1927, North Zone, is a Lambert conformal conic projection of the Clarke spheroid of 1866, having standard parallels at north latitudes 47 degrees 02 minutes and 48 degrees 38 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 93 degrees 06 minutes west of Greenwich and the parallel 46 degrees 30 minutes north latitude. This origin is given the coordinates: x equals 2,000,000 feet and y equals 0 feet.\nThe Minnesota Coordinate System of 1927, Central Zone, is a Lambert conformal conic projection of the Clarke spheroid of 1866, having standard parallels at north latitudes 45 degrees 37 minutes and 47 degrees 03 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 94 degrees 15 minutes west of Greenwich and the parallel 45 degrees 00 minutes north latitude. This origin is given the coordinates: x equals 2,000,000 feet and y equals 0 feet.\nThe Minnesota Coordinate System of 1927, South Zone, is a Lambert conformal conic projection of the Clarke spheroid of 1866, having standard parallels at north latitudes 43 degrees 47 minutes and 45 degrees 13 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 94 degrees 00 minutes west of Greenwich with the parallel 43 degrees 00 minutes north latitude, such origin being given the coordinates: x equals 2,000,000 feet and y equals 0 feet.\n(b) For purposes of more precisely defining the Minnesota Coordinate System of 1983, the following definition by the National Ocean Survey/National Geodetic Survey is adopted:\nThe Minnesota Coordinate System of 1983, North Zone, is a Lambert conformal conic projection of the North American Geocentric Datum of 1983, having standard parallels at north latitudes 47 degrees 02 minutes and 48 degrees 38 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 93 degrees 06 minutes west of Greenwich with the parallel 46 degrees 30 minutes north latitude. This origin is given the coordinates: x equals 800,000 meters and y equals 100,000 meters.\nThe Minnesota Coordinate System of 1983, Central Zone, is a Lambert conformal conic projection of the North American Geocentric Datum of 1983, having standard parallels at north latitudes 45 degrees 37 minutes and 47 degrees 03 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 94 degrees 15 minutes west of Greenwich with the parallel 45 degrees 00 minutes north latitude. This origin is given the coordinates: x equals 800,000 meters and y equals 100,000 meters.\nThe Minnesota Coordinate System of 1983, South Zone, is a Lambert conformal conic projection of the North American Geocentric Datum of 1983, having standard parallels at North latitudes 43 degrees 47 minutes and 45 degrees 13 minutes, along which parallels the scale shall be exact. The origin of coordinates is at the intersection of the meridian 94 degrees 00 minutes west of Greenwich with the parallel 43 degrees 00 minutes north latitude. This origin is given the coordinates: x equals 800,000 meters and y equals 100,000 meters.",
	"repealed": false
}