{
	"id": "35.156",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.156",
	"title": "35.156 CHRONIC WASTING DISEASE.",
	"text": "The legislative committees and divisions with jurisdiction over agriculture policy and finance and environment and natural resources policy and finance may meet quarterly to receive updates from the commissioners of agriculture, health, and natural resources, the Board of Animal Health, and the University of Minnesota on chronic wasting disease activities undertaken by the reporting agency in the previous quarter.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nThe Board of Animal Health and the commissioner of natural resources must consult the Minnesota Center for Prion Research and Outreach at the University of Minnesota and incorporate peer-reviewed scientific information when administering and enforcing section 35.155 and associated rules pertaining to chronic wasting disease and farmed Cervidae.\nThe Board of Animal Health must promptly notify affected local units of government and Tribal governments when an animal in a farmed Cervidae herd tests positive for chronic wasting disease.\n(a) Once the United States Department of Agriculture has determined that a noninvasive live-animal test capable of accurately detecting chronic wasting disease in white-tailed deer is available, the Board of Animal Health must have each farmed white-tailed deer possessed by a person registered under section 35.155 tested for chronic wasting disease using a noninvasive live-animal test offered by a public or private diagnostic laboratory. A validated live-animal test is required when moving farmed white-tailed deer six months old and over from any premises within the state within 12 weeks of movement. The Board of Animal Health may institute additional live-animal chronic wasting disease testing protocols. Live-animal testing results must be submitted to both the commissioner of natural resources and the Board of Animal Health in the form required by both agencies.\n(b) If a farmed white-tailed deer tests positive using a noninvasive live-animal test, the owner must have the animal destroyed and tested for chronic wasting disease using a postmortem test approved by the Board of Animal Health.\n(c) If a farmed white-tailed deer tests positive for chronic wasting disease under paragraph (b), the owner must depopulate the premises of farmed Cervidae as required under section 35.155, subdivision 11.",
	"repealed": false
}