{
	"id": "296A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.16",
	"title": "296A.16 REFUND OR CREDIT.",
	"text": "The commissioner shall allow the distributor credit or refund of the tax paid on gasoline and special fuel:\n(1) exported or sold for export from the state, other than in the supply tank of a motor vehicle or of an aircraft;\n(2) sold to the United States government to be used exclusively in performing its governmental functions and activities or to any \"cost plus a fixed fee\" contractor employed by the United States government on any national defense project;\n(3) if the fuel is placed in a tank used exclusively for residential heating;\n(4) destroyed by accident while in the possession of the distributor;\n(5) in error;\n(6) in the case of gasoline only, sold for storage in an on-farm bulk storage tank, if the tax was not collected on the sale; and\n(7) in such other cases as the commissioner may permit, consistent with the provisions of this chapter and other laws relating to the gasoline and special fuel excise taxes.\nAny person who buys and uses gasoline for a qualifying purpose other than use in motor vehicles, snowmobiles except as provided in clause (2), or motorboats, or special fuel for a qualifying purpose other than use in licensed motor vehicles, and who paid the tax directly or indirectly through the amount of the tax being included in the price of the gasoline or special fuel, or otherwise, shall be reimbursed and repaid the amount of the tax paid upon filing with the commissioner a claim for refund in the form and manner prescribed by the commissioner, and containing the information the commissioner shall require. By signing any such claim which is false or fraudulent, the applicant shall be subject to the penalties provided in this chapter for knowingly making a false claim. The claim shall set forth the total amount of the gasoline so purchased and used by the applicant other than in motor vehicles, or special fuel purchased and used by the applicant other than in licensed motor vehicles, and shall state when and for what purpose it was used. When a claim contains an error in computation or preparation, the commissioner is authorized to adjust the claim in accordance with the evidence shown on the claim or other information available to the commissioner. The commissioner, on being satisfied that the claimant is entitled to the payments, shall approve the claim and transmit it to the commissioner of management and budget. The words \"gasoline\" or \"special fuel\" as used in this subdivision do not include aviation gasoline or special fuel for aircraft. Gasoline or special fuel bought and used for a \"qualifying purpose\" means:\n(1) Gasoline or special fuel used in carrying on a trade or business, used on a farm situated in Minnesota, and used for a farming purpose. \"Farm\" and \"farming purpose\" have the meanings given them in section 6420(c)(2), (3), and (4) of the Internal Revenue Code as defined in section 289A.02, subdivision 7.\n(2) Gasoline or special fuel used for off-highway business use.\n(i) \"Off-highway business use\" means any use off the public highway by a person in that person's trade, business, or activity for the production of income.\n(ii) Off-highway business use includes use of a passenger snowmobile off the public highways as part of the operations of a resort as defined in section 157.15, subdivision 11; and use of gasoline or special fuel to operate a power takeoff unit on a vehicle, but not including fuel consumed during idling time.\n(iii) Off-highway business use does not include use as a fuel in a motor vehicle which, at the time of use, is registered or is required to be registered for highway use under the laws of any state or foreign country; or use of a licensed motor vehicle fuel tank in lieu of a separate storage tank for storing fuel to be used for a qualifying purpose, as defined in this section. Fuel purchased to be used for a qualifying purpose cannot be placed in the fuel tank of a licensed motor vehicle and must be stored in a separate supply tank.\n(3) Gasoline or special fuel placed in the fuel tanks of new motor vehicles, manufactured in Minnesota, and shipped by interstate carrier to destinations in other states or foreign countries.\nNotwithstanding the provisions of subdivision 1, the commissioner shall allow a dealer a refund of:\n(1) the tax paid by the distributor on gasoline, undyed diesel fuel, or undyed kerosene destroyed by accident while in the possession of the dealer; or\n(2) the tax paid by a distributor or special fuels dealer on other special fuels destroyed by accident while in the possession of the dealer.\nNotwithstanding the provisions of subdivision 1, the commissioner shall allow a special fuel dealer a refund of the tax paid on fuel sold directly into a supply tank of a refrigeration unit with a separate engine and used exclusively by that refrigeration unit. A claim for refund may be filed as provided in this section.\nNotwithstanding subdivision 1, the commissioner shall allow a refund of the tax paid on undyed kerosene used exclusively for a purpose other than as fuel for a motor vehicle using the streets and highways. To obtain a refund, the person making the sale to an end user must meet the Internal Revenue Service requirements for sales from a blocked pump. A claim for a refund may be filed as provided in this section.\nNotwithstanding subdivision 1, the commissioner shall allow a licensed distributor a refund of the tax paid on leaded gasoline of 110 octane or more that does not meet ASTM specification D4814 for gasoline and that is sold in bulk for use in nonregistered motor vehicles. A claim for a refund may be filed as provided for in this section.\nNotwithstanding any other provision of law to the contrary, the tax imposed on gasoline, undyed diesel fuel, or undyed kerosene delivered to a qualified service station may not exceed, or must be reduced to, a rate not more than three cents per gallon above the state tax rate imposed on such products sold by a service station in a contiguous state located within the distance indicated in this subdivision. A distributor shall be allowed a credit or refund for the amount of reduction computed in accordance with this subdivision. For purposes of this subdivision, a \"qualifying service station\" means a service station located within 7.5 miles, measured by the shortest route by public road, from a service station selling like product in the contiguous state.\n[Repealed, 1Sp2001 c 5 art 7 s 66]\nA person who violates section 296A.23, subdivision 1, shall forfeit the full amount of the claim. In addition, a person who is convicted under section 296A.23 for filing a false statement or claim shall, in addition to any criminal penalties imposed, be prohibited from filing with the commissioner any claim for refund upon gasoline purchased within six months after such conviction.\nThere is appropriated to the persons entitled to refund or credit under this section, from the fund or account in the state treasury to which the money was credited, an amount sufficient to make the credit or refund.",
	"repealed": false
}