{
	"id": "548.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/548.091",
	"title": "548.091 SUPPORT, MAINTENANCE, OR COUNTY REIMBURSEMENT JUDGMENTS.",
	"text": "(a) A judgment for unpaid amounts under a judgment or decree of dissolution or legal separation that provides for installment or periodic payments of maintenance shall be entered by the court administrator when ordered by the court or shall be entered and docketed by the court administrator when the following conditions are met:\n(1) the obligee determines that the obligor is at least 30 days in arrears;\n(2) the obligee serves a copy of an affidavit of default and notice of intent to enter and docket judgment on the obligor by first class mail at the obligor's last known post office address. Service shall be deemed complete upon mailing in the manner designated. The affidavit shall state the full name, occupation, place of residence, and last known post office address of the obligor, the name of the obligee, the date of the first unpaid amount, the date of the last unpaid amount, and the total amount unpaid;\n(3) the obligor fails within 20 days after mailing of the notice either to pay all unpaid amounts or to request a hearing on the issue of whether arrears claimed owing have been paid and to seek, ex parte, a stay of entry of judgment; and\n(4) not less than 20 days after service on the obligor in the manner provided, the obligee files with the court administrator the affidavit of default together with proof of service and, if payments have been received by the obligee since execution of the affidavit of default, a supplemental affidavit setting forth the amount of payment received and the amount for which judgment is to be entered and docketed.\n(b) A judgment entered and docketed under this subdivision has the same effect and is subject to the same procedures, defenses, and proceedings as any other judgment in district court, and may be enforced or satisfied in the same manner as judgments under section 548.09.\n(c) An obligor whose property is subject to the lien of a judgment for installment of periodic payments of maintenance under section 548.09, and who claims that no amount of maintenance is in arrears, may move the court ex parte for an order directing the court administrator to vacate the lien of the judgment on the docket and register of the action where it was entered. The obligor shall file with the motion an affidavit stating:\n(1) the lien attached upon the docketing of a judgment or decree of dissolution or separate maintenance;\n(2) the docket was made while no installment or periodic payment of maintenance was unpaid or overdue; and\n(3) no installment or periodic payment of maintenance that was due prior to the filing of the motion remains unpaid or overdue.\nThe court shall grant the obligor's motion as soon as possible if the pleadings and affidavit show that there is and has been no default.\nAny payment or installment of support required by a judgment or decree of dissolution or legal separation, determination of parentage, an order under chapter 518C, an order under section 260B.331 or 260C.331, or an order under section 518A.82, that is not paid or withheld from the obligor's income as required under section 518A.53, or which is ordered as child support by judgment, decree, or order by a court in any other state, is a judgment by operation of law on and after the date it is due, is entitled to full faith and credit in this state and any other state, and shall be entered and docketed by the court administrator on the filing of affidavits as provided in subdivision 2a. A payment or installment of support that becomes a judgment by operation of law between the date on which a party served notice of a motion for modification under section 518A.39, subdivision 2, and the date of the court's order on modification may be modified under that subdivision. Beginning August 1, 2022, interest does not accrue on a past, current, or future judgment for child support, confinement and pregnancy expenses, or genetic testing fees.\nThe court administrator shall enter and docket judgment in the amount of each affidavit filed under subdivision 1 less any amount paid. From the time of docketing, the judgment is a lien in the amount unpaid upon all the real property in the county then or after owned by the judgment debtor. The judgment survives and the lien continues for ten years after its entry.\n(a) On or after the date an unpaid amount becomes a judgment by operation of law under subdivision 1a, the obligee or the public authority may file with the court administrator:\n(1) a statement identifying, or a copy of, the judgment or decree of dissolution or legal separation, determination of parentage, order under chapter 518B or 518C, an order under section 260B.331 or 260C.331, or an order under section 518A.82, or judgment, decree, or order for child support by a court in any other state, which provides for periodic installments of child support, or a judgment or notice of attorney fees and collection costs under section 518A.735;\n(2) an affidavit of default. The affidavit of default must state the full name, occupation, place of residence, and last known post office address of the obligor, the name of the obligee, the date or dates payment was due and not received and judgment was obtained by operation of law, the total amount of the judgments to be entered and docketed; and\n(3) an affidavit of service of a notice of intent to enter and docket judgment and to recover attorney fees and collection costs on the obligor, in person or by first class mail at the obligor's last known post office address. Service is completed upon mailing in the manner designated. Where applicable, a notice of interstate lien in the form promulgated under United States Code, title 42, section 652(a), is sufficient to satisfy the requirements of clauses (1) and (2).\n(b) A judgment entered and docketed under this subdivision has the same effect and is subject to the same procedures, defenses, and proceedings as any other judgment in district court, and may be enforced or satisfied in the same manner as judgments under section 548.09, except as otherwise provided.\n(c) A judgment entered and docketed under this subdivision is not subject to interest charging or accrual.\nMS 1998 [Repealed, 1999 c 245 art 7 s 24]\nUpon receipt of the documents filed under subdivision 2a, the court administrator shall enter and docket the judgment in the amount of the unpaid obligation identified in the affidavit of default.\nChild support judgments may be renewed by service of notice upon the debtor. Service must be by first class mail at the last known address of the debtor, with service deemed complete upon mailing in the manner designated, or in the manner provided for the service of civil process. Upon the filing of the notice and proof of service, the court administrator shall administratively renew the judgment for child support without any additional filing fee in the same court file as the original child support judgment. The judgment must be renewed in an amount equal to the unpaid principal plus the unpaid interest accrued prior to August 1, 2022. Child support judgments may be renewed multiple times until paid.\nA child support obligor may request a hearing under the Rules of Civil Procedure on the issue of whether the judgment amount or amounts have been paid and may move the court for an order directing the court administrator to vacate or modify the judgment or judgments entered pursuant to this action.\nThe court shall grant the obligor's motion if it determines that there is no default.\nMS 1998 [Repealed, 1999 c 245 art 7 s 24]\nAs child support payments continue to become due and are unpaid, additional judgments may be entered and docketed by following the procedures in subdivision 1a. Each judgment entered and docketed for unpaid child support payments must be treated as a distinct judgment for purposes of enforcement and satisfaction.\nMS 1998 [Repealed, 1999 c 245 art 7 s 24]\nThe public authority is exempt from payment of fees when a judgment is docketed or a certified copy of a judgment is issued by a court administrator, or a notice of judgment lien or a certified copy of a judgment is presented to a registrar of titles for recording. If a notice or certified copy is recorded by the public authority under this subdivision, the registrar of titles may collect from a party presenting for recording a satisfaction or release of the notice or certified copy the fees for recording and memorializing both the notice or certified copy and the satisfaction or release.\nIf requested by the public authority and upon the public authority's providing a notice of judgment lien or a certified copy of a judgment for child support debt, together with a street address, tax parcel identifying number, or a legal description for a parcel of real property, the county recorder shall search the registered land records in that county and cause the notice of judgment lien or certified copy of the judgment to be memorialized on every certificate of title or certificate of possessory title of registered land in that county that can be reasonably identified as owned by the obligor who is named on a docketed judgment. The fees for memorializing the lien or judgment must be paid in the manner prescribed by subdivision 7. The county recorders and their employees and agents are not liable for any loss or damages arising from failure to identify a parcel of registered land owned by the obligor who is named on the docketed judgment.\nThe public authority shall issue to the obligor, attorneys, lenders, and closers, or their agents, a payoff statement setting forth conclusively the amount necessary to satisfy the lien. Payoff statements must be issued within three business days after receipt of a request by mail, personal delivery, telefacsimile, or electronic mail transmission, and must be delivered to the requester by telefacsimile or electronic mail transmission if requested and if appropriate technology is available to the public authority. If the payoff statement includes amounts for unpaid maintenance, the statement shall specify that the public authority does not calculate accrued interest and that an interest balance in addition to the payoff statement may be owed.\nUpon payment of the child support amount due, the public authority shall execute and deliver a satisfaction of the judgment lien within five business days. The public authority is not responsible for satisfaction of judgments for unpaid maintenance.\nThe public authority shall negotiate a release of lien on specific property for less than the full amount due where the proceeds of a sale or financing, less reasonable and necessary closing expenses, are not sufficient to satisfy all encumbrances on the liened property. Partial releases do not release the obligor's personal liability for the amount unpaid. A partial satisfaction for the amount received must be filed with the court administrator.\nThe public authority shall maintain a process to review the identity of the obligor and to issue releases of lien in cases of misidentification. The public authority shall maintain a process to review the amount of child support judgments arising by operation of law. The public authority may move the court for an order to amend the judgment when the amount of judgment entered and docketed is incorrect.\nThe Department of Children, Youth, and Families, after consultation with registrars of title, shall prescribe the notice of judgment lien. These forms are not subject to chapter 14.",
	"repealed": false
}