{
	"id": "17.1018",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.1018",
	"title": "17.1018 GOOD FOOD ACCESS PROGRAM ADVISORY COMMITTEE.",
	"text": "As used in this section, the following terms have the meanings given them:\n(1) \"program\" means the good food access program under section 17.1017; and\n(2) \"commissioner\" means the commissioner of agriculture.\nThe Good Food Access Program Advisory Committee consists of the following members, appointed by the commissioner of agriculture, unless otherwise specified:\n(1) the commissioners of health, employment and economic development, and human services, or their respective designees;\n(2) one person representing the grocery industry;\n(3) two people representing economic or community development, one rural member and one urban or suburban member;\n(4) two people representing political subdivisions of the state;\n(5) one person designated by the Council for Minnesotans of African Heritage;\n(6) one person designated by the Minnesota Indian Affairs Council;\n(7) one person designated by the Council on Asian Pacific Minnesotans;\n(8) one person designated by the Chicano Latino Affairs Council;\n(9) one person designated by the Minnesota Farmers Union;\n(10) one person representing public health experts;\n(11) one person representing philanthropic foundations;\n(12) one person representing economic or community development financial institutions;\n(13) one person representing the University of Minnesota Regional Sustainable Development Partnerships;\n(14) two people representing organizations engaged in addressing food security, one representative from a statewide hunger relief organization and one from a community-based organization;\n(15) one person representing immigrant farmer-led organizations;\n(16) one person representing small business technical assistance with experience in food retail; and\n(17) up to four additional members with economic development, health equity, financial, or other relevant expertise.\nAt least half of the members must reside in or their organizations must serve rural Minnesota. The commissioner may remove members and fill vacancies as provided in section 15.059, subdivision 4.\nThe advisory committee must advise the commissioner of agriculture on managing the program, establishing program criteria, establishing project eligibility guidelines, establishing application processes and additional selection criteria, establishing annual monitoring and accountability mechanisms, facilitating leveraging of additional public and private investments, and promoting the program statewide.\nThe commissioner must convene the advisory committee at least two times per year to achieve the committee's duties.\nThe commissioner of agriculture must provide staffing, meeting space, and administrative services for the advisory committee.\nThe commissioner of agriculture or the commissioner's designee shall serve as chair of the committee.\nThe public members of the advisory committee serve without compensation or payment of expenses.\nThe advisory committee does not expire.",
	"repealed": false
}