{
	"id": "124D.4535",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.4535",
	"title": "124D.4535 INNOVATIVE DELIVERY OF CAREER AND TECHNICAL EDUCATION PROGRAMS; SHARING OF DISTRICT RESOURCES.",
	"text": "(a) A program is established to improve student, career and college readiness, and school outcomes by allowing groups of school districts to work together in partnership with local and regional postsecondary institutions and programs, community institutions, and other private, public, for-profit, and nonprofit workplace partners, to:\n(1) provide innovative education programs and activities that integrate core academic and career and technical subjects in students' programs of study through coordinated secondary and postsecondary career and technical programs leading to an industry certification or other credential;\n(2) provide embedded professional development for program participants;\n(3) use performance assessments in authentic settings to measure students' technical skills and progress toward attaining an industry certification or other credential; and\n(4) efficiently share district, institution, and workplace resources.\n(b) To participate in this program to improve student, career and college readiness, and school outcomes, a group of two or more school districts must collaborate with school staff and project partners and receive formal school board approval to form a partnership. The partnership must develop a plan to provide challenging programmatic options for students under paragraph (a); create professional development opportunities for educators and other program participants; increase student engagement and connection and challenging learning opportunities for diverse populations of students that are focused on employability skills and technical, job-specific skills related to a specific career pathway; or demonstrate efficiencies in delivering financial and other services needed to realize plan goals and objectives. The plan must include:\n(1) collaborative education goals and objectives;\n(2) strategies and processes to implement those goals and objectives, including a budget process with periodic expenditure reviews;\n(3) valid and reliable measures including performance assessments in authentic settings and progress toward attaining an industry certification or other credential, among other measures, to evaluate progress in realizing plan goals and objectives;\n(4) an implementation timeline; and\n(5) other applicable conditions, regulations, responsibilities, duties, provisions, fee schedules, and legal considerations needed to fully implement the plan.\nA partnership may invite additional districts or other participants under paragraph (a) to join the partnership after notifying the commissioner.\n(c) A partnership of interested districts must submit an application to the commissioner of education in the form and manner the commissioner determines, consistent with the requirements of this section. The application must contain the formal approval adopted by the school board in each district to participate in the plan.\n(d) Notwithstanding any other law to the contrary, a participating school district under this section continues to: receive revenue and maintain its taxation authority; be organized and governed by an elected school board with general powers under section 123B.02; and be subject to employment agreements under chapter 122A and section 179A.20; and district employees continue to remain employees of the employing school district.\n(e) Participating districts must submit a biennial report by February 1 in each odd-numbered year to the education committees of the legislature and the commissioner of education that includes performance assessment, high school graduation, and career and technical certification data to show the success of the partnership in preparing diverse populations of students for careers and jobs.\nThe commissioner of education must convene an advisory panel to advise the commissioner on applicants' qualifications to participate in this program. The commissioner must ensure an equitable geographical distribution of program participants to the extent practicable. The commissioner must select only those applicants that fully comply with subdivision 1. The commissioner may terminate a program participant that fails to effectively implement the goals and objectives contained in its application and according to its stated timeline.",
	"repealed": false
}