{
	"id": "352B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.08",
	"title": "352B.08 BENEFITS.",
	"text": "(a) Every member who is credited with three or more years of allowable service if first employed before July 1, 2013, or with at least ten years of allowable service if first employed after June 30, 2013, is entitled to separate from state service and upon becoming 50 years old, is entitled to receive a life annuity, upon separation from state service.\n(b) Members must apply for an annuity in a form and manner prescribed by the executive director.\n(c) No application may be made more than 60 days before the date the member is eligible to retire by reason of both age and service requirements.\n(d) An annuity begins to accrue no earlier than 180 days before the date the application is filed with the executive director.\nThe application for a benefit or refund made under this chapter must comply with section 352.115, subdivision 7a.\n(a) The annuity must be paid in monthly installments. The annuity is equal to the amount determined by multiplying the average monthly salary of the member by 3.0 percent for each year of allowable service and prorated for additional completed months of allowable service, unless restricted under paragraph (b).\n(b) Allowable service in excess of 33 years must not be used in computing the annuity. This restriction does not apply to any member who has at least 28 years of allowable service before July 1, 2013.\n(c) When the annuity commences, any member contributions attributable to allowable service not used to compute the annuity due to the restrictions in paragraph (b) must be refunded using procedures specified in section 352B.11, subdivision 1.\nAny member who has become at least 50 years old and who has at least three years of allowable service if first employed before July 1, 2013, or who has at least ten years of allowable service if first employed after June 30, 2013, is entitled upon application to a reduced retirement annuity equal to the annuity calculated under subdivision 2, reduced by one-tenth of one percent for each month that the member is under age 55 at the time of retirement, if the effective date of retirement is before July 1, 2015. If the effective date of retirement is after June 30, 2015, the reduction is 0.34 percent for each month that the member is under age 55 at the time of retirement.\n(a) The deferred annuity of any former member must be augmented from the first day of the month following the termination of active service, or July 1, 1971, whichever is later, to the effective date of retirement.\n(b) For a person who became an employee before July 1, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) five percent until January 1, 1981;\n(2) three percent from January 1, 1981, until December 31, 2011;\n(3) two percent from January 1, 2012, until December 31, 2018; and\n(4) after December 31, 2018, the deferred annuity must not be augmented.\n(c) For a person who became an employee after June 30, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) 2.5 percent until December 31, 2011;\n(2) two percent from January 1, 2012, until December 31, 2018; and\n(3) after December 31, 2018, the deferred annuity must not be augmented.\n(d) The mortality table and investment return assumption used to compute the annuity must be those in effect when the member files application for annuity.\n(a) In lieu of the single life annuity provided in subdivision 2, the member or former member may elect an optional annuity form. The board of the Minnesota state retirement system shall establish a joint and survivor annuity, payable to a designated beneficiary for life, adjusted to the actuarial equivalent value of the single life annuity. The board shall also establish an additional optional annuity with an actuarial equivalent value of the single life annuity in the form of a joint and survivor annuity which provides that the elected annuity be reinstated to the single life annuity provided in subdivision 2, if after commencing the elected joint and survivor annuity, the designated beneficiary dies before the member, which reinstatement is not retroactive but takes effect for the first full month occurring after the death of the designated beneficiary. The board may also establish other actuarial equivalent value optional annuity forms. In establishing actuarial equivalent value optional annuity forms, each optional annuity form shall have the same present value as a regular single life annuity using the mortality table adopted by the board and the investment return assumption specified in section 356.215, subdivision 8.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used, rather than the investment return specified in section 356.215, subdivision 8.\n(c) The board shall obtain the written recommendation of the actuary retained under section 356.214. These recommendations shall be a part of the permanent records of the board.\nA retirement annuity under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}