{
	"id": "62D.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.10",
	"title": "62D.10 PROVISIONS APPLICABLE TO ALL HEALTH PLANS.",
	"text": "The provisions of this section shall be applicable to nonprofit prepaid health care plans regulated under chapter 317A, and health maintenance organizations regulated pursuant to sections 62D.01 to 62D.30, both of which for purposes of this section shall be known as \"health plans.\"\n[Repealed, 1984 c 464 s 46]\nA health plan providing health maintenance services or reimbursement for health care costs to a specified group or groups may limit the open enrollment in each group plan to members of such group or groups, but after it has been in operation 24 months shall have an annual open enrollment period of at least 14 days during which it shall accept all otherwise eligible individuals in the order in which they apply for enrollment in a manner which does not discriminate on the basis of age, sex, race, health, or economic status. The health maintenance organization shall notify potential enrollees of any limitations on the number of new enrollees to be accepted. \"Specified groups\" may include, but shall not be limited to:\n(1) employees of one or more specified employers;\n(2) members of one or more specified labor unions;\n(3) members of one or more specified associations;\n(4) patients of physicians providing services through a health care plan who had previously provided services outside the health care plan; and\n(5) members of an existing group insurance policy.\nA health plan may apply to the commissioner of health for a waiver of the requirements of this section or for authorization to impose such underwriting restrictions upon open enrollment as are necessary (1) to preserve its financial stability, (2) to prevent excessive adverse selection by prospective enrollees, or (3) to avoid unreasonably high or unmarketable charges for enrollee coverage for health care services. The commissioner of health upon a showing of good cause, shall approve or upon failure to show good cause shall deny such application within 30 days of the receipt thereof from the health plan. The commissioner of health may, in accordance with chapter 14, promulgate rules to implement this section.\nAny fee charged by a health maintenance organization for the process of determining an applicant's eligibility, and any other application fee charged, shall be refunded with interest to the applicant if the applicant is not accepted for enrollment in the health maintenance organization, or credited with interest to the applicant's premiums due if the applicant is accepted for enrollment in the organization.\nHealth maintenance organization contracts under section 62D.04, subdivision 1, shall include a clear statement of the risk sharing arrangement.",
	"repealed": false
}