{
	"id": "240.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.16",
	"title": "240.16 STEWARDS.",
	"text": "All horse races run at a licensed racetrack must be presided over by a board of three stewards, who must be appointees of the commission or persons approved by it. The commission shall designate one steward as chair. At least two stewards for all races either shall be employees of the commission who shall serve in the unclassified service, or shall be under contract with the commission to serve as stewards. The commission may delegate the following duties and powers to a board of stewards:\n(1) to ensure that races are run in accordance with the commission's rules;\n(2) to supervise the conduct of racing to ensure the integrity of the sport;\n(3) to settle disputes arising from the running of horse races, and to certify official results;\n(4) to impose on licensees, for violation of law or commission rules, fines of up to $10,000, suspensions of up to one year, and other sanctions as delegated by the commission or permitted under its rules;\n(5) to recommend to the commission where warranted penalties in excess of those in clause (4);\n(6) to otherwise enforce the laws and rules of racing; and\n(7) to perform other duties and have other powers assigned by the commission.\nAll simulcasts are subject to the regulation of the commission. The commission may assign an official to preside over these activities and, if so assigned, the official has the powers and duties provided by rule.\nExcept as provided by section 240.08, subdivision 5, a ruling of a board of stewards may be appealed to the commission. The commission may review any ruling by the board of stewards on its own initiative. The commission may provide for appeals to be heard by less than a quorum of the commission. A hearing on a penalty imposed by a board of stewards must be granted on request.\nA board of stewards has the authority to administer oaths, issue subpoenas, order the production of documents and other evidence, and regulate the course of hearings before it, according to the commission's rules. Hearings held by a board of stewards are not subject to the provisions of the Administrative Procedure Act except those provisions which the commission by rule makes applicable.\nIn addition to rules under subdivision 3, the commission may promulgate rules governing the qualifications, appointment, approval, authority, removal, and compensation of stewards.\nThe commission may require that a licensee reimburse it for the costs of providing a state-paid steward or stewards to supervise racing at the licensee's racetrack.\nThe total compensation of stewards who are employees of the commission must be commensurate with the compensation of stewards who are not commission employees.",
	"repealed": false
}