{
	"id": "66A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.16",
	"title": "66A.16 GUARANTY FUNDS.",
	"text": "A mutual fire insurance company may be formed with, or an existing fire insurance company may establish, a guaranty fund divided into certificates of $10 each, or multiples thereof, and this guaranty fund shall be invested in the same manner as is provided for the investment of capital stock of insurance companies. The certificate holders of the guaranty fund shall be entitled to an annual dividend of not more than ten percent on their respective certificates, if the net profits or unused premiums left after all losses, expenses, or liabilities then incurred, with reserves for reinsurance, are provided for shall be sufficient to pay the same; and, if the dividends in any one year are less than ten percent, the difference may be made up in any subsequent year or years from the net profits. Approval of the commissioner must be obtained before accrual for or payment of the dividend, or any repayment of principal.\nThe guaranty fund shall be applied to the payment of losses and expenses when necessary and, if the guaranty fund be impaired, the directors may make good the whole or any part of the impairment from future profits of the company, but no dividend shall be paid on guaranty fund certificates while the guaranty fund is impaired.\nThe holder of the guaranty fund certificate shall not be liable for any more than the amount of the certificate which has not been paid in and this amount shall be plainly and legibly stated on the face of the certificate.\nEach certificate holder of record shall be entitled to one vote in person or by proxy in any meeting of the members of the company for each $10 investment in guaranty fund certificates. The guaranty fund may be reduced or retired by vote of the policyholders of the company and the assent of the commissioner, if the net assets of the company above its reinsurance reserve and all other claims and obligations and the amount of its guaranty fund certificates and interest thereon for two years last preceding and including the date of its last annual statement shall not be less than 50 percent of the premiums in force.\nDue notice of this proposed action on the part of the company shall be mailed to each policyholder of the company not less than 30 days before the meeting when the action may be taken.\nIn mutual fire insurance companies with a guaranty fund, the certificate holders shall be entitled to choose and elect from among their own number or from among the policyholders at least one-half of the total number of directors.\nIf any mutual fire insurance company with a guaranty fund ceases to do business, it shall not divide among its certificate holders any part of its assets or guaranty fund until all its debts and obligations have been paid or canceled.\nForeign mutual fire insurance companies having a guaranty fund shall not be required to make their certificate of guaranty fund conform to the provisions of this section, but when the certificates do not conform therewith the amount thereof shall be charged as a liability.\nAny mutual insurance company which establishes and maintains, over and above its liabilities and the reserves required by law of a like stock insurance company, a guaranty fund available for the payment of losses and expenses at least equal to the capital stock required of a like stock insurance company may issue policies of insurance without contingent liability, and when the articles of incorporation of any mutual insurance company having this guaranty fund provide, the company may transact any and all of the kinds of business as set forth in section 60A.06, subdivision 1, clauses (1) to (15), subject to the restrictions and limitations imposed by law on a like stock insurance company, and any domestic mutual company having a guaranty fund equal to the amount of capital stock required of a like stock insurance company may insure the same kinds of property and conduct and carry on its business, subject only to the restrictions and limitations applicable to like domestic stock insurance companies.\nSubdivision 1 shall not apply to this guaranty fund except that the guaranty fund of the company shall be invested in the same manner as is provided by law for the investment of its other funds. Every such company shall in its annual statement show as separate items the amount of the guaranty fund and the remaining divisible surplus, and the aggregate of these items shall be shown as surplus to policyholders.\nA guaranty fund may be created, in whole or in part, in either or both of the following ways:\n(1) where an existing mutual company has a surplus, the members of the company may at any regular or special meeting set aside from and out of its surplus such sum as shall be fixed by resolution to be transferred to and thereafter constitute, in whole or in part, the guaranty fund of the company; or\n(2) by the issuance of guaranty fund certificates, as specified in this subdivision, the same to be issued upon the conditions and subject to the rights and obligations specified in this subdivision.\nAny such company establishing a guaranty fund, as provided in this subdivision, may, subject to the restrictions and limitations imposed by law as to a like stock insurance company, amend its articles to provide for the doing by it of one or more of the kinds of insurance business specified in section 60A.06, subdivision 1, clauses (1) to (15).\nThe policy liability of any such mutual company issuing policies without a contingent liability shall, as to these policies, be computed upon the same basis as is applicable to like policies issued by stock insurance companies. Where any such company shall issue five-year term policies, wherein the premiums shall be payable in annual or biennial installments and no premium note is taken by the company as payment of the full term premium, the company then shall be required to maintain a reserve fund on only the portion of premiums actually collected from time to time under these term policies and no company so creating a guaranty fund shall issue policies without a contingent liability after the guaranty fund shall be impaired or reduced below the capital required of a like stock insurance company doing the same kind or kinds of insurance. Any company having a guaranty fund may insure, without a contingent liability, any kind or class of property which a like stock company may insure.\nAny director, officer, or member of any mutual insurance company, or any other person, may advance to the company any sum of money necessary for the purposes of its business or to enable it to comply with any of the requirements of the law, including the creation, in whole or in part, of a guaranty fund to enable it to do one or more of the kinds of business specified in this subdivision, and for the creation by a company issuing policies with a contingent liability of a guaranty fund, in such amount as the board of directors shall determine, for the protection of policyholders of the company, and the moneys, together with the interest thereon as may have been agreed upon, not exceeding ten percent per annum, shall be repaid only out of the surplus remaining after providing for all reserves, if any, and other liability, and which shall not otherwise be a liability or claim against the company or any of its assets. No commission or promotion expenses shall be paid in connection with the advance of any money to the company, and the amount of the advance remaining unpaid shall be reported in each annual statement.\nThe company shall issue to each person advancing money for the creation of a guaranty fund a certificate or certificates specifying the amount advanced. These certificates may be assigned by the holder and the transfer recorded upon the books of the company. The holders of the guaranty fund certificates shall be entitled to annual interest thereon at the rate agreed upon, if the net profits of the company, after all losses, expenses, liabilities, and legal reserves, if any, have been paid or provided for, are sufficient to pay the same. If the net profits of the company in any year are insufficient to pay the full amount of interest agreed upon, the difference may be paid in any subsequent year from the net profits of the subsequent years, if approval of the commissioner is obtained before accrual for or payment of the interest.\nThe guaranty fund shall be applied to the payment of losses and expenses when necessary and, if the guaranty fund be impaired, the directors may make good the whole or any part of the impairment from future net profits of the company or by the issue and sale of additional guaranty fund certificates, but no interest shall be paid on the guaranty fund certificates while the guaranty fund is impaired. No certificate shall be issued except for money actually paid to the company, which amount shall be plainly and legibly stated therein. The company shall issue certificates only in sums of $10, or multiples thereof; it shall keep a record of the name and address of the person to whom issued and of all assignments thereof. Upon surrender of a certificate duly assigned in writing, the company shall cancel the same and issue a new certificate to the assignee.\nEach certificate holder of record shall be entitled to one vote in person or by proxy at any meeting of the members of the company, for each $10 investment in the guaranty fund certificates.\nThe guaranty fund may be reduced or retired by vote of the board of directors of the company and the assent of the commissioner, if the net assets of the company, above its legal reserves, if any, and all other claims and obligations are sufficient therefor. The certificate holders shall be entitled to choose and elect from among their own members or from among the policyholders at least one-half of the total number of directors.\nIn case the members of any company by resolution adopted at any regular meeting or special meeting called for that purpose shall determine to wind up and liquidate the business of any such company, the assets thereof shall be applied (1) to the payment of the expense of the liquidation; (2) to the payment of any accrued liability, including losses, if any; (3) to the payment of any unearned premiums on policies in force at the time of the liquidation; (4) to the payment of guaranty fund certificates, if any, together with accrued interest thereon, if any; and (5) the residue shall be distributed according to the provisions of chapter 60B.\nAny mutual company authorized to transact business in this state which establishes and maintains, over and above its liabilities and the reserves required by law of like stock insurance companies, a guaranty fund available for the payment of losses and expenses at least equal to the capital stock required of a like stock insurance company may issue policies of insurance without contingent liability.\n(a) Any domestic mutual company qualified to issue policies of insurance without contingent liability as provided by subdivision 3 with surplus of $1,000,000 or less may adopt a plan of conversion to a stock company pursuant to section 60A.07, subdivision 8, clause (4), which authorizes holders of guaranty fund certificates to exchange the certificates for shares of the stock company. Shares of the stock company being formed may be issued during the conversion in exchange for such guaranty fund certificates.\n(b) The plan of conversion shall establish the price of the shares to be issued in exchange for the guaranty fund certificates. The price shall be established by an appraisal of the mutual company as an operating company. The appraisal shall be made by an independent certified public accountant. The plan, including the price, shall not be unfair or inequitable to the mutual company policyholders and shall not become effective until approved by the commissioner of commerce.",
	"repealed": false
}