{
	"id": "192.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.205",
	"title": "192.205 ENLISTMENTS.",
	"text": "Except as otherwise provided by federal law or regulation for the National Guard, original enlistments in the military forces shall be for a period of three years and subsequent enlistments for periods of one or three years. The governor may by order fix shorter period of enlistment or reenlistment for any of the military forces so far as not inconsistent with federal law. In the event of an emergency wherein the governor has called out any of the military forces, the governor may by order extend for not exceeding the duration of the emergency and 60 days thereafter the period of any enlistment in the forces called out which would otherwise expire.\nExcept as otherwise provided by federal law or regulation for the National Guard, every person enlisting in the military forces shall sign an enlistment contract in the form prescribed by the adjutant general, and shall subscribe to the following oath or affirmation: \"I hereby acknowledge to have voluntarily enlisted this .......... day of .......... ......., as a soldier in the .......... for the period of three (or one) year .... under the conditions prescribed by law, unless sooner discharged by proper authority. And I do solemnly swear that I will bear true faith and allegiance to the United States of America and the state of Minnesota; that I will serve them honestly and faithfully against all their enemies whomsoever; and that I will obey the orders of the President of the United States and of the governor of the state of Minnesota and the officers appointed over me, according to law and the Uniform Code of Military Justice\"; provided, that the words \"the President of the United States and of\" shall be omitted in the case of persons enlisting in forces not subject to federal service.\nNo civil association, society, club, post, order, fraternity, fraternal organization, union, league, or other organized body shall be enlisted in the military forces as a unit.\nAny officer of the Minnesota National Guard or any commissioned officer of a regular or reserve component of the armed forces of the United States may administer the oath or affirmation of enlistment to a person enlisting in the Minnesota National Guard.",
	"repealed": false
}