{
	"id": "60A.086",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.086",
	"title": "60A.086 RETROACTIVE TERMINATION OF COVERAGE UNDER GROUP POLICIES PROHIBITED.",
	"text": "This section applies to:\n(1) health plans as defined in section 62A.011, issued to groups;\n(2) group accident and health insurance;\n(3) group life insurance;\n(4) group accidental death and dismemberment insurance; and\n(5) group disability income insurance.\nNo plan of coverage described in subdivision 1 shall permit the issuer to retroactively cancel, retroactively rescind, or otherwise retroactively terminate the coverage of an employee, dependent, or other covered person under the group coverage, without the written consent of that employee, dependent, or other covered person. For purposes of this subdivision, \"covered person\" includes a person on continuation coverage or eligible for continuation coverage.\n(a) This section does not apply where the group policy or contract is lawfully terminated retroactively and not replaced with substantially similar coverage.\n(b) This section does not apply where the employee, dependent, or other covered person committed fraud or misrepresentation with respect to eligibility under the terms of the group policy or contract or with respect to any other material fact, but retroactive termination without written consent must not be based upon the failure of the employee, dependent, or other covered person to meet the group sponsor's eligibility requirements, if the group sponsor requested the issuer of the coverage to include the person as a covered person.\n(c) This section does not apply where the issuer of coverage described in subdivision 1 retroactively terminates coverage of an employee, dependent, or other covered person solely because the group sponsor did not notify the issuer of the coverage in advance of the employee's voluntary or involuntary termination from employment, provided that the retroactive termination of coverage is effective no earlier than the end of the day of termination from employment. This paragraph does not affect continuation rights under federal or state law and does not limit the effect of section 62Q.16.",
	"repealed": false
}