{
	"id": "260.795",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.795",
	"title": "260.795 ELIGIBLE SERVICES.",
	"text": "(a) Eligible Indian child welfare services provided under primary support grants include:\n(1) placement prevention and reunification services;\n(2) family-based services;\n(3) individual and family counseling;\n(4) access to professional individual, group, and family counseling;\n(5) crisis intervention and crisis counseling;\n(6) development of foster and adoptive placement resources, including recruitment, licensing, and support;\n(7) court advocacy;\n(8) training and consultation to county and private social services agencies regarding the federal Indian Child Welfare Act and the Minnesota Indian Family Preservation Act;\n(9) advocacy in working with the county and private social services agencies, and activities to help provide access to agency services, including but not limited to 24-hour caretaker and homemaker services, day care, emergency shelter care up to 30 days in 12 months, access to emergency financial assistance, and arrangements to provide temporary respite care to a family for up to 72 hours consecutively or 30 days in 12 months;\n(10) transportation services to the child and parents to prevent placement or reunite the family; and\n(11) other activities and services approved by the commissioner that further the goals of the federal Indian Child Welfare Act and the Minnesota Indian Family Preservation Act, including but not limited to recruitment of Indian staff for child-placing agencies and licensed child-placing agencies. The commissioner may specify the priority of an activity and service based on its success in furthering these goals.\n(b) Eligible services provided under special focus grants include:\n(1) permanency planning activities that meet the special needs of Indian families;\n(2) teenage pregnancy;\n(3) independent living skills;\n(4) family and community involvement strategies to combat child abuse and chronic neglect of children;\n(5) coordinated child welfare and mental health services to Indian families;\n(6) innovative approaches to assist Indian youth to establish better self-image, decrease isolation, and decrease the suicide rate;\n(7) expanding or improving services by packaging and disseminating information on successful approaches or by implementing models in Indian communities relating to the development or enhancement of social structures that increase family self-reliance and links with existing community resources;\n(8) family retrieval services to help adopted individuals reestablish legal affiliation with the Indian Tribe; and\n(9) other activities and services approved by the commissioner that further the goals of the federal Indian Child Welfare Act and the Minnesota Indian Family Preservation Act. The commissioner may specify the priority of an activity and service based on its success in furthering these goals.\n(c) The commissioner shall give preference to programs that use Indian staff, contract with Indian organizations or Tribes, or whose application is a joint effort between the Indian and non-Indian community to achieve the goals of the federal Indian Child Welfare Act and the Minnesota Indian Family Preservation Act. Programs must have input and support from the Indian community.\nIndian child welfare grant money must not be used for:\n(1) child day care necessary solely because of employment or training for employment of a parent or other relative with whom the child is living;\n(2) foster care maintenance or difficulty of care payments;\n(3) residential facility payments;\n(4) adoption assistance payments;\n(5) public assistance payments for Minnesota family investment program assistance, supplemental aid, medical assistance, general assistance, or community health services authorized by sections 145A.01 to 145A.14; or\n(6) administrative costs for income maintenance staff.\nThe commissioner shall submit claims for federal reimbursement earned through the activities and services supported through Indian child welfare grants. The commissioner may set aside a portion of the federal funds earned under this subdivision to establish and support a new Indian child welfare position in the Department of Children, Youth, and Families to provide program development. The commissioner shall use any federal revenue not set aside to expand services under section 260.785. The federal revenue earned under this subdivision is available for these purposes until the funds are expended.",
	"repealed": false
}