{
	"id": "256B.0945",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0945",
	"title": "256B.0945 SERVICES FOR CHILDREN WITH SEVERE EMOTIONAL DISTURBANCE.",
	"text": "(a) Counties must arrange to provide residential services for children with severe emotional disturbance according to sections 245.4882, 245.4885, and this section.\n(b) Services must be provided by a facility that is licensed according to section 245.4882 and administrative rules promulgated thereunder, and under contract with the county.\n(c) Eligible service costs may be claimed for a facility that is located in a state that borders Minnesota if:\n(1) the facility is the closest facility to the child's home, providing the appropriate level of care; and\n(2) the commissioner of human services has completed an inspection of the out-of-state program according to the interagency agreement with the commissioner of corrections under section 260B.198, subdivision 11, paragraph (b), and the program has been certified by the commissioner of corrections under section 260B.198, subdivision 11, paragraph (a), to substantially meet the standards applicable to children's residential mental health treatment programs under Minnesota Rules, chapter 2960. Nothing in this section requires the commissioner of human services to enforce the background study requirements under chapter 245C or the requirements related to prevention and investigation of alleged maltreatment under section 626.557 or chapter 260E. Complaints received by the commissioner of human services must be referred to the out-of-state licensing authority for possible follow-up.\n(d) Notwithstanding paragraph (b), eligible service costs may be claimed for an out-of-state inpatient treatment facility if:\n(1) the facility specializes in providing mental health services to children who are deaf, deafblind, or hard-of-hearing and who use American Sign Language as their first language;\n(2) the facility is licensed by the state in which it is located; and\n(3) the state in which the facility is located is a member state of the Interstate Compact on Mental Health.\nAll services must be included in a child's individualized treatment or multiagency plan of care as defined in chapter 245.\nFor facilities that are not institutions for mental diseases according to federal statute and regulation, medical assistance covers mental health-related services that are required to be provided by a residential facility under section 245.4882 and administrative rules promulgated thereunder, except for room and board. For residential facilities determined by the federal Centers for Medicare and Medicaid Services to be an institution for mental diseases, medical assistance covers medically necessary mental health services provided by the facility according to section 256B.055, subdivision 13, except for room and board.\nNotwithstanding section 256B.041, county payments for the cost of residential services provided under this section shall not be made to the commissioner of management and budget.\n(a) Notwithstanding sections 256B.19 and 256B.041, payments to counties for residential services provided under this section by a residential facility shall:\n(1) for services provided by a residential facility that is not an institution for mental diseases, only be made of federal earnings for services provided, and the nonfederal share of costs for services provided under this section shall be paid by the county from sources other than federal funds or funds used to match other federal funds. Payment to counties for services provided according to this section shall be a proportion of the per day contract rate that relates to rehabilitative mental health services and shall not include payment for costs or services that are billed to the IV-E program as room and board; and\n(2) for services provided by a residential facility that is determined to be an institution for mental diseases, be equivalent to the federal share of the payment that would have been made if the residential facility were not an institution for mental diseases. The portion of the payment representing what would be the nonfederal shares shall be paid by the county. Payment to counties for services provided according to this section shall be a proportion of the per day contract rate that relates to rehabilitative mental health services and shall not include payment for costs or services that are billed to the IV-E program as room and board.\n(b) Per diem rates paid to providers under this section by prepaid plans shall be the proportion of the per-day contract rate that relates to rehabilitative mental health services and shall not include payment for group foster care costs or services that are billed to the county of financial responsibility. Services provided in facilities located in bordering states are eligible for reimbursement on a fee-for-service basis only as described in paragraph (a) and are not covered under prepaid health plans.\n(c) Payment for mental health rehabilitative services provided under this section by or under contract with an American Indian tribe or tribal organization or by agencies operated by or under contract with an American Indian tribe or tribal organization must be made according to section 256B.0625, subdivision 34, or other relevant federally approved rate-setting methodology.\n(d) The commissioner shall set aside a portion not to exceed five percent of the federal funds earned for county expenditures under this section to cover the state costs of administering this section. Any unexpended funds from the set-aside shall be distributed to the counties in proportion to their earnings under this section.\n[Repealed, 2006 c 282 art 16 s 17]\n[Repealed, 2006 c 282 art 16 s 17]\n[Repealed, 2006 c 282 art 16 s 17]\n[Repealed, 2006 c 282 art 16 s 17]\n[Repealed, 2006 c 282 art 16 s 17]\n[Repealed, 1Sp2003 c 14 art 4 s 24]",
	"repealed": false
}