{
	"id": "299A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.02",
	"title": "299A.02 LIQUOR CONTROL FUNCTIONS.",
	"text": "No employee of the Department of Public Safety or the Department of Revenue having any responsibility for the administration or enforcement of chapter 297G or 340A shall have a direct or indirect interest, except through ownership or investment in pension or mutual funds, in the manufacture, transportation or sale of intoxicating liquor or any malt or vinous beverages, intoxicating, nonintoxicating, or commercial or industrial alcohol. The commissioner of public safety or the commissioner of revenue may remove an employee in the unclassified civil service for any intentional violation of any provision of chapter 297G or 340A. Intentional violation of a provision of chapter 297G or 340A by a classified employee of one of the departments may be grounds for removal of that employee pursuant to section 43A.33.\nThe commissioner shall administer and enforce the provisions of chapters 297G and 340A through the director of alcohol and gambling enforcement, except for those provisions thereof for which administration and enforcement are reserved to the commissioner of revenue.\nThe commissioner shall have power to require periodic factual reports from all licensed importers, manufacturers, wholesalers and retailers of intoxicating liquors and to make all reasonable rules to effect the object of chapters 297G and 340A. The rules shall include provisions for assuring the purity of intoxicating liquors and the true statement of its contents and proper labeling thereof with regard to all forms of sale. No rule may require the use of new containers in aging whiskey. No rule may require cordials or liqueurs to contain in excess of 2-1/2 percent by weight of sugar or dextrose or both.\nIn all matters relating to official duties, the commissioner shall have the powers possessed by courts of law to issue subpoenas and cause them to be served and enforced. All public officials, and their respective deputies and employees, and all individuals, partnerships, firms, corporations, incorporated and unincorporated associations, and others who manufacture, transport, or sell intoxicating liquor, or are connected therewith in any manner, shall at all times attend and answer under oath the commissioner's lawful inquiries, produce and exhibit such books, accounts, documents, and property as the commissioner may desire to inspect, and in all things aid the commissioner in the performance of the commissioner's duties.",
	"repealed": false
}