{
	"id": "609A.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/609A.055",
	"title": "609A.055 AUTOMATIC EXPUNGEMENT OF CERTAIN CANNABIS OFFENSES.",
	"text": "(a) A person is eligible for expungement:\n(1) upon the dismissal and discharge of proceedings against a person under section 152.18, subdivision 1, for violation of section 152.024, 152.025, or 152.027;\n(2) if the person was convicted of or received a stayed sentence for a violation of section 152.027, subdivision 3 or 4;\n(3) if the person was arrested and all charges were dismissed prior to a determination of probable cause for charges under section 152.021, subdivision 2, paragraph (a), clause (6); 152.022, subdivision 2, paragraph (a), clause (6); 152.023, subdivision 2, paragraph (a), clause (5); 152.024, subdivision 2, clause (2); 152.025, subdivision 2, clause (1); or 152.027, subdivision 3 or 4; or\n(4) if all pending actions or proceedings were resolved in favor of the person for charges under section 152.021, subdivision 2, paragraph (a), clause (6); 152.022, subdivision 2, paragraph (a), clause (6); 152.023, subdivision 2, paragraph (a), clause (5); 152.024, subdivision 2, clause (2); 152.025, subdivision 2, clause (1); or 152.027, subdivision 3 or 4.\n(b) For purposes of this section:\n(1) a verdict of not guilty by reason of mental illness is not a resolution in favor of the person; and\n(2) an action or proceeding is resolved in favor of the person if the person received an order under section 590.11 determining that the person is eligible for compensation based on exoneration.\n(a) The Bureau of Criminal Apprehension shall identify bureau records that qualify for expungement pursuant to subdivision 1.\n(b) The Bureau of Criminal Apprehension shall notify the judicial branch of:\n(1) the name and date of birth of each person whose case is eligible for an order of expungement; and\n(2) the court file number of the eligible case.\n(a) The Bureau of Criminal Apprehension shall grant expungement relief to each qualifying person whose records the bureau possesses and seal the bureau's records without requiring an application, petition, or motion. The bureau shall seal records related to an expungement within 60 days after the bureau sent notice of the expungement to the judicial branch pursuant to subdivision 2, paragraph (b), unless an order of the judicial branch prohibits sealing the records or additional information establishes that the records are not eligible for expungement.\n(b) Nonpublic criminal records maintained by the bureau and subject to a grant of expungement relief must display a notation stating \"expungement relief granted pursuant to section 609A.055.\"\n(c) The bureau shall inform the judicial branch of all cases that are granted expungement relief pursuant to this section. The bureau may notify the judicial branch using electronic means and may notify the judicial branch immediately or in a monthly report. Upon receiving notice of an expungement, the judicial branch shall seal all related records, including records of the person's arrest, indictment, trial, verdict, and dismissal or discharge of the case. Upon receiving notice of an expungement, the judicial branch shall issue any order necessary to seal related records. The judicial branch shall not order the Department of Health or the Department of Human Services to seal records under this section.\n(d) The bureau shall inform each arresting or citing law enforcement agency or prosecutorial office with records affected by the grant of expungement relief issued pursuant to paragraph (a) that expungement has been granted. The bureau shall notify each agency or office of an expungement within 60 days after the bureau sent notice of the expungement to the judicial branch. The bureau may notify each agency or office using electronic means. Upon receiving notification of an expungement, an agency or office shall seal all records related to the expungement, including the records of the person's arrest, indictment, trial, verdict, and dismissal or discharge of the case.\n(e) The bureau shall provide information on its publicly facing website clearly stating that persons who are noncitizens may need copies of records affected by a grant of expungement relief for immigration purposes, explaining how they can obtain these copies after expungement or other granted relief, and stating that a noncitizen should consult with an immigration attorney.\n(f) Data on a person whose offense has been expunged under this subdivision, including any notice sent pursuant to paragraph (d), are private data on individuals as defined in section 13.02, subdivision 12.\n(g) Section 609A.03, subdivision 6, applies to an order issued under this section sealing the record of proceedings under section 152.18.\n(h) The limitations under section 609A.03, subdivision 7a, paragraph (b), do not apply to an order issued under this section.\n(i) The subject whose record qualifies for expungement shall be given access to copies of the records of arrest, conviction, or incarceration for any purposes, including immigration purposes.\n(j) Relief granted under this subdivision shall not impact the ability of a petitioner to file for relief under section 590.01.\nThe Department of Public Safety, commissioner of public safety, Bureau of Criminal Apprehension, superintendent of the Bureau of Criminal Apprehension, and all employees of the Bureau of Criminal Apprehension shall not be held civilly liable when acting in good faith to exercise the powers granted by this section or for acts or omissions occurring within the scope of the performance of their duties under this section.\nThe Bureau of Criminal Apprehension shall issue a report to the legislative committees and divisions with jurisdiction over public safety policy and finance upon completion of the work required under subdivision 2. The report shall contain summary data and must include the total number of expungements granted by the Bureau of Criminal Apprehension.",
	"repealed": false
}