{
	"id": "297H.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.02",
	"title": "297H.02 RESIDENTIAL GENERATORS.",
	"text": "(a) A tax is imposed upon the sales price of mixed municipal solid waste management services received by a residential generator.\n(b) The tax is imposed upon the difference between the market price and the tip fee at a processing or disposal facility where the tip fee is less than the market price and the political subdivision subsidizes the cost of service at the facility. The political subdivision is liable for the tax.\n(c) The tax is imposed upon the market price of waste management services where a political subdivision directly bills on a property tax statement for organized collection of mixed municipal solid waste. The political subdivision is liable for the tax.\n(d) The political subdivision shall, by resolution, identify the market price. The political subdivision shall submit the market price to the commissioner of the Pollution Control Agency for review by October 1 of the year prior to the calendar year in which the market price will be in effect. The prices that the state pays for waste management services in that jurisdiction or the county where the jurisdiction is located must be a guideline in determining the market price. The commissioner of the Pollution Control Agency shall review the market price and shall inform the political subdivisions of any necessary changes to market price by November 15 of that year. The market price shall be effective as of January 1 of the next calendar year following review. The commissioner of the Pollution Control Agency may consider adjustment to the market price if a political subdivision submits a resolution for adjustment by May 1 of any year. The effective date of the adjustment shall be July 1.\nIf the commissioner of revenue believes a market price declared by resolution is not accurate, the commissioner may request that the Pollution Control Agency advise the political subdivision to identify by resolution an updated market price and submit the updated market price to the Pollution Control Agency for review.\nThe rate of tax under this section is 9.75 percent.\nWhen the sales price of a bag, sticker, or other indicia includes mixed municipal solid waste management services for residential generators, the tax on the bag, sticker, and other indicia sold by vendors on behalf of a political subdivision or waste hauler shall be collected when the bag, sticker, or other indicia are sold to the vendor by the political subdivision or waste hauler, and shall be taxed at the rate imposed under subdivision 2. The solid waste management service and the solid waste management tax shall be included in the sales price of the bag, sticker, or other indicia.",
	"repealed": false
}