{
	"id": "308C.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.501",
	"title": "308C.501 MEMBERS.",
	"text": "A cooperative shall have one or more members.\nA cooperative may have one class of members, all of whom are occupant members or a cooperative may have more than one class of members as long as one class of members are occupant members.\n(a) A member who knowingly, intentionally, or repeatedly violates a provision of the articles, bylaws, occupancy agreement, proprietary lease or rules, policies, and procedures promulgated by the board may be required by the board to surrender the member's membership interest and occupancy rights or any other financial rights of membership interests of any class owned by a member, or both.\n(b) The cooperative shall refund to the member for the surrendered membership interest at the lesser of the book value or the price paid the member for the membership interest payable in not more than seven years from the date of surrender.\n(c) Membership interests required to be surrendered may be reissued or be retired and canceled by the board.\n(d) The board may establish a procedure for members to dispute the basis for an alleged violation.\n(a) A member is entitled to inspect and copy, at the member's expense, during regular business hours at a reasonable location specified by the cooperative, any of the records described in section 308C.245 if the member meets the requirements of paragraph (b) and gives the cooperative written demand at least five business days before the date on which the member wishes to inspect and copy the records. Notwithstanding the provisions of this subdivision or any provisions of section 308C.245, a cooperative may limit a member's right to inspect or copy any records of the cooperative relating to the amount of equity capital in the cooperative held by any person or any accounts receivable or other amounts due the cooperative from any person, or any personnel records or employment records of any employee.\n(b) To be entitled to inspect and copy permitted records, the member shall meet the following requirements:\n(1) the demand is made in good faith and for a proper cooperative business purpose;\n(2) the member describes with reasonable particularity the purpose and the records the member desires to inspect; and\n(3) the records are directly connected with the described purpose.\n(c) The right of inspection granted by this subdivision shall not be abolished or limited by the articles, bylaws, or any actions of the board or the members.\n(d) This subdivision does not affect:\n(1) the right of a member to inspect records to the same extent as any other litigant if the member is in litigation with the cooperative; or\n(2) the power of a court to compel the production of the cooperative's records for examination.\n(e) Notwithstanding any other provision in this subdivision, if the records to be inspected or copied are in active use or storage and, therefore, not available at the time otherwise provided for inspection or copying, the cooperative shall notify the member and shall set a date and hour within three business days of the date otherwise set in this subdivision for the inspection or copying.\n(f) A member's agent or attorney has the same inspection and copying rights as the member. The right to copy records under this subdivision includes, if reasonable, the right to receive copies made by photographic copying, xerographic copying, or other means. The cooperative may impose a reasonable charge, covering the costs of labor and material, for copies of any documents provided to the member. The charge may not exceed the estimated cost of production and reproduction of the records.\n(g) If a cooperative refuses to allow a member, or the member's agent or attorney, who complies with this subdivision to inspect or copy any records that the member is entitled to inspect or copy within a prescribed time limit or, if none, within a reasonable time, the district court of the county in this state where the cooperative's principal office is located or, if it has no principal office in this state, the district court of the county in which its registered office is located may, on application of the member, summarily order the inspection or copying of the records demanded at the cooperative's expense.\n(h) If a court orders inspection or copying of the records demanded, unless the cooperative proves that it refused inspection or copying in good faith because it had a reasonable basis for doubt about the right of the member or the member's agent or attorney to inspect or copy the records demanded:\n(1) the court may order the losing party to pay the prevailing party's reasonable costs, including reasonable attorney fees;\n(2) the court may order the losing party to pay the prevailing party for any damages the prevailing party shall have incurred by reason of the subject matter of the litigation;\n(3) if inspection or copying is ordered under this paragraph, the court may order the cooperative to pay the member's inspection and copying expenses;\n(4) the court may grant either party any other remedy provided by law; and\n(5) the court may impose reasonable restrictions on the use or distribution of the records by the demanding member.",
	"repealed": false
}