{
	"id": "297E.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.13",
	"title": "297E.13 TAX-RELATED CRIMINAL PENALTIES.",
	"text": "(a) A person required to file a return, report, or other document with the commissioner, who knowingly fails to file it when required, is guilty of a gross misdemeanor. A person required to file a return, report, or other document who willfully attempts to evade or defeat a tax by failing to file it when required is guilty of a felony.\n(b) A person required to pay or to collect and remit a tax, who knowingly fails to do so when required, is guilty of a gross misdemeanor. A person required to pay or to collect and remit a tax, who willfully attempts to evade or defeat a tax law by failing to do so when required is guilty of a felony.\n(a) A person required to file a return, report, or other document with the commissioner, who delivers to the commissioner a return, report, or other document known by the person to be fraudulent or false concerning a material matter is guilty of a felony.\n(b) A person who knowingly aids or assists in, or advises in the preparation or presentation of a return, report, or other document that is fraudulent or false concerning a material matter, whether or not the falsity or fraud committed is with the knowledge or consent of the person authorized or required to present the return, report, or other document, is guilty of a felony.\nA person is guilty of a felony if the person:\n(1) is required by section 297E.05 to keep records or to make returns, and falsifies or fails to keep the records or falsifies or fails to make the returns; or\n(2) knowingly submits materially false information in any report, document, or other communication submitted to the commissioner in connection with lawful gambling or with this chapter.\n(a) A person who engages in the business of selling gambling product in Minnesota without the licenses or permits required under this chapter or chapter 349, or an officer of a corporation who so engages in the sales, is guilty of a gross misdemeanor.\n(b) A person selling gambling product in Minnesota after revocation of a license or permit under this chapter or chapter 349, when the commissioner or the board has not issued a new license or permit, is guilty of a felony.\nIt is a gross misdemeanor for a person to possess gambling equipment for resale in this state that has not been stamped or bar-coded in accordance with this chapter and chapter 349 and upon which the taxes imposed by chapter 297A or section 297E.02 have not been paid. The director of alcohol and gambling enforcement or the commissioner or the designated inspectors and employees of the director or commissioner may seize in the name of the state of Minnesota any unregistered or untaxed gambling equipment.\n(a) Criminal penalties imposed by this section are in addition to civil penalties imposed by this chapter.\n(b) A person who violates a provision of this chapter for which another penalty is not provided is guilty of a misdemeanor.\n(c) A person who violates a provision of this chapter for which another penalty is not provided is guilty of a gross misdemeanor if the violation occurs within five years after a previous conviction under a provision of this chapter.\n(d) A person who in any manner violates a provision of this chapter to evade a tax imposed by this chapter, or who aids and abets the evasion of a tax, or hinders or interferes with a seizing authority when a seizure is made as provided by section 297E.16 is guilty of a gross misdemeanor.\n(e) This section does not preclude civil or criminal action under other applicable law or preclude any agency of government from investigating or prosecuting violations of this chapter or chapter 349. County attorneys have primary responsibility for prosecuting violations of this chapter, but the attorney general may prosecute a violation of this chapter.\nNotwithstanding section 628.26, or other provision of the criminal laws of this state, an indictment may be found and filed, or a complaint filed, upon a criminal offense named in this section, in the proper court within six years after the offense is committed.",
	"repealed": false
}