{
	"id": "62A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.02",
	"title": "62A.02 POLICY FORMS.",
	"text": "For purposes of this section, \"health plan\" means a health plan as defined in section 62A.011 or a policy of accident and sickness insurance as defined in section 62A.01. No health plan shall be issued or delivered to any person in this state, nor shall any application, rider, or endorsement be used in connection with the health plan, until a copy of its form and of the classification of risks and the premium rates pertaining to the form have been filed with the commissioner. The filing for nongroup health plan forms shall include a statement of actuarial reasons and data to support the rate. For health benefit plans as defined in section 62L.02, and for health plans to be issued to individuals, the health carrier shall file with the commissioner the information required in section 62L.08, subdivision 8. For group health plans for which approval is sought for sales only outside of the small employer market as defined in section 62L.02, this section applies only to policies or contracts of accident and sickness insurance. All forms intended for issuance in the individual or small employer market must be accompanied by a statement as to the expected loss ratio for the form. Premium rates and forms relating to specific insureds or proposed insureds, whether individuals or groups, need not be filed, unless requested by the commissioner.\n(a) The health plan form shall not be issued, nor shall any application, rider, endorsement, or rate be used in connection with it, until the expiration of 60 days after it has been filed unless the commissioner approves it before that time.\n(b) Notwithstanding paragraph (a), a rate filed with respect to a policy of accident and sickness insurance as defined in section 62A.01 by an insurer licensed under chapter 60A, may be used on or after the date of filing with the commissioner. Rates that are not approved or disapproved within the 60-day time period are deemed approved. This paragraph does not apply to Medicare-related coverage as defined in section 62A.3099, subdivision 17.\n(c) For coverage to begin on or after January 1, 2016, and each January 1 thereafter, health plans in the individual and small group markets that are not grandfathered plans to be offered outside MNsure and qualified health plans to be offered inside MNsure must receive rate approval from the commissioner no later than 30 days prior to the beginning of the annual open enrollment period for MNsure. Premium rates for all carriers in the applicable market for the next calendar year must be made available to the public by the commissioner only after all rates for the applicable market are final and approved. Final and approved rates must be publicly released at a uniform time for all individual and small group health plans that are not grandfathered plans to be offered outside MNsure and qualified health plans to be offered inside MNsure, and no later than 30 days prior to the beginning of the annual open enrollment period for MNsure.\n(a) The commissioner shall, within 60 days after the filing of any form or rate, disapprove the form or rate:\n(1) if the benefits provided are not reasonable in relation to the premium charged;\n(2) if it contains a provision or provisions which are unjust, unfair, inequitable, misleading, deceptive or encourage misrepresentation of the health plan form, or otherwise does not comply with this chapter, chapter 62L, or chapter 72A;\n(3) if the proposed premium rate is excessive or not adequate; or\n(4) the actuarial reasons and data submitted do not justify the rate.\nThe party proposing a rate has the burden of proving by a preponderance of the evidence that it does not violate this subdivision.\nIn determining the reasonableness of a rate, the commissioner shall also review all administrative contracts, service contracts, and other agreements to determine the reasonableness of the cost of the contracts or agreement and effect of the contracts on the rate. If the commissioner determines that a contract or agreement is not reasonable, the commissioner shall disapprove any rate that reflects any unreasonable cost arising out of the contract or agreement. The commissioner may require any information that the commissioner deems necessary to determine the reasonableness of the cost.\nFor the purposes of this subdivision, the commissioner shall establish by rule a schedule of minimum anticipated loss ratios which shall be based on (i) the type or types of coverage provided, (ii) whether the policy is for group or individual coverage, and (iii) the size of the group for group policies. Except for individual policies of disability or income protection insurance, the minimum anticipated loss ratio shall not be less than 50 percent after the first year that a policy is in force. All applicants for a policy shall be informed in writing at the time of application of the anticipated loss ratio of the policy. \"Anticipated loss ratio\" means the ratio at the time of filing, at the time of notice of withdrawal under subdivision 4a, or at the time of subsequent rate revision of the present value of all expected future benefits, excluding dividends, to the present value of all expected future premiums.\nIf the commissioner notifies a health carrier that has filed any form or rate that it does not comply with this chapter, chapter 62L, or chapter 72A, it shall be unlawful for the health carrier to issue or use the form or rate. In the notice the commissioner shall specify the reasons for disapproval and state that a hearing will be granted within 20 days after request in writing by the health carrier.\nThe 60-day period within which the commissioner is to approve or disapprove the form or rate does not begin to run until a complete filing of all data and materials required by statute or requested by the commissioner has been submitted.\nHowever, if the supporting data is not filed within 30 days after a request by the commissioner, the rate is not effective and is presumed to be an excessive rate.\n(b) When an insurer or the Minnesota Comprehensive Health Association fails to respond to an objection or inquiry within 60 days, the filing is automatically disapproved. A resubmission is required if action by the Department of Commerce is subsequently requested. An additional filing fee is required for the resubmission.\n(a) Notwithstanding subdivisions 2, 3, 4a, 5a, and 6, individual premium rates may be used upon filing with the department of an individual policy form if the filing is accompanied by the individual policy form filing and a minimum lifetime loss ratio guarantee. Insurers may use the filing procedure specified in this subdivision only if the affected individual policy forms disclose the benefit of a minimum lifetime loss ratio guarantee. Insurers may amend individual policy forms to provide for a minimum lifetime loss ratio guarantee. If an insurer elects to use the filing procedure in this subdivision for an individual policy rate, the insurer shall not use a filing of premium rates that does not provide a minimum lifetime loss ratio guarantee for that individual policy rate.\n(b) The minimum lifetime loss ratio guarantee must be in writing and must contain at least the following:\n(1) an actuarial memorandum specifying the expected loss ratio that complies with the standards as set forth in this subdivision;\n(2) a statement certifying that all rates, fees, dues, and other charges are not excessive, inadequate, or unfairly discriminatory;\n(3) detailed experience information concerning the policy forms;\n(4) a step-by-step description of the process used to develop the minimum lifetime loss ratio, including demonstration with supporting data;\n(5) guarantee of specific minimum lifetime loss ratio that must be greater than or equal to 65 percent for policies issued to individuals or for certificates issued to members of an association that does not offer coverage to small employers, taking into consideration adjustments for duration;\n(6) a guarantee that the actual Minnesota loss ratio for the calendar year in which the new rates take effect, and for each year thereafter until new rates are filed, will meet or exceed the minimum lifetime loss ratio standards referred to in clause (5), adjusted for duration;\n(7) a guarantee that the actual Minnesota lifetime loss ratio shall meet or exceed the minimum lifetime loss ratio standards referred to in clause (5); and\n(8) if the annual earned premium volume in Minnesota under the particular policy form is less than $2,500,000, the minimum lifetime loss ratio guarantee must be based partially on the Minnesota earned premium and other credible factors as specified by the commissioner.\n(c) The actual Minnesota minimum loss ratio results for each year at issue must be independently audited at the insurer's expense, and the audit report must be filed with the commissioner not later than 120 days after the end of the year at issue.\n(d) The insurer shall refund premiums in the amount necessary to bring the actual loss ratio up to the guaranteed minimum lifetime loss ratio. For the purpose of this paragraph, loss ratio and guaranteed minimum lifetime loss ratio are the expected aggregate loss ratio of all approved individual policy forms that provide for a minimum lifetime loss ratio guarantee.\n(e) A Minnesota policyholder affected by the guaranteed minimum lifetime loss ratio shall receive a portion of the premium refund relative to the premium paid by the policyholder. The refund must be made to all Minnesota policyholders insured under the applicable policy form during the year at issue if the refund would equal $10 or more per policy. The refund must include statutory interest from July 1 of the year at issue until the date of payment. Payment must be made not later than 180 days after the end of the year at issue.\n(f) Premium refunds of less than $10 per insured must be credited to the policyholder's account.\n(g) Subdivisions 2 and 3 do not apply if premium rates are filed with the department and accompanied by a minimum lifetime loss ratio guarantee that meets the requirements of this subdivision. Such filings are deemed approved. When determining a loss ratio for the purposes of a minimum lifetime loss ratio guarantee, the insurer shall divide the total of the claims incurred, plus preferred provider organization expenses, case management, and utilization review expenses, plus reinsurance premiums less reinsurance recoveries by the premiums earned less state and local taxes less other assessments. The insurer shall identify any assessment allocated.\n(h) The policy form filing of an insurer using the filing procedure with a minimum lifetime loss ratio guarantee must disclose to the enrollee, member, or subscriber an explanation of the minimum lifetime loss ratio guarantee, and the actual loss ratio, and any adjustments for duration.\n(i) The insurer who elects to use the filing procedure with a minimum lifetime loss ratio guarantee shall notify all policyholders of the refund calculation, the result of the refund calculation, the percentage of premium on an aggregate basis to be refunded, if any, any amount of the refund attributed to the payment of interests, and an explanation of amounts less than $10.\n[Repealed, 1992 c 549 art 3 s 23]\nThe commissioner may, at any time after a 20-day written notice has been given to the insurer, withdraw approval of any form or rate that has previously been approved on any of the grounds stated in this section. It is unlawful for the health carrier to issue a form or rate or use it in connection with any health plan after the effective date of the withdrawal of approval. The notice of withdrawal of approval must advise the health carrier of the right to a hearing under the contested case procedures of chapter 14, and must specify the matters to be considered at the hearing.\nThe commissioner may request a health carrier to provide actuarial reasons and data, as well as other information, needed to determine if a previously approved rate continues to satisfy the requirements of this section. If the requested information is not provided within 30 days after request by the commissioner, the rate is presumed to be an excessive rate.\n[Repealed, 1992 c 549 art 3 s 23; 1994 c 625 art 10 s 49]\nThe health carrier must request a hearing before the 20-day notice period has ended, or the commissioner's order is final. A request for hearing stays the commissioner's order until the commissioner notifies the health carrier of the result of the hearing. The commissioner's order may require the modification of any rate or form and may require continued coverage to persons covered under a health plan to which the disapproved form or rate applies.\nAny order or decision of the commissioner under this section shall be subject to appeal in accordance with chapter 14.\nA domestic insurer may file with the commissioner for informational purposes only a policy or certificate of insurance that is not intended to be offered or sold within this state. This subdivision only applies to the filing in Minnesota of a policy or certificate of insurance issued to an insured or certificate holder located outside of this state when the filing is for the express purpose of complying with the law of the state in which the insured or certificate holder resides. In no event may a policy or certificate of insurance filed under this subdivision for out-of-state use be issued or delivered in Minnesota unless and until the policy or certificate of insurance is approved under subdivision 2.\nNo qualified health plan shall be offered through MNsure until its form and the premium rates pertaining to the form have been approved by the commissioner of commerce or health, as appropriate, and the health plan has been determined to comply with the certification requirements of MNsure in accordance with an agreement between the commissioners of commerce and health and MNsure.",
	"repealed": false
}