{
	"id": "137.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.66",
	"title": "137.66 MINNESOTA DISCOVERY, RESEARCH, AND INNOVATION ECONOMY FUNDING PROGRAM.",
	"text": "(a) The Minnesota Discovery, Research, and InnoVation Economy (MnDRIVE) funding program is established to discover new knowledge through scientific research that will:\n(1) advance the state's economy;\n(2) leverage opportunities and establish priorities in sectors of state strength and comparative advantage;\n(3) improve the health and well-being of Minnesota's citizens;\n(4) advance the capacity and competitiveness of existing and emerging food- and manufacturing-related science and technology industries; and\n(5) build a better Minnesota by driving progress and advancing the common good.\n(b) The MnDRIVE funding program shall establish priorities by investing in scientific research that promotes:\n(1) programs that can position Minnesota as a leader in engineering, science, technology, and food-related solutions;\n(2) initiatives that support the growth of targeted industry clusters and the competitiveness of existing Minnesota engineering, science, technology, and food companies in developing new products and services;\n(3) initiatives that can result in creating new Minnesota-based companies;\n(4) initiatives that can improve the quality of life of Minnesota's citizens, decrease the incidence of disease, and transform how we prevent, treat, and cure diseases; and\n(5) initiatives that can secure a safer environment, seek sustainable energy solutions, and prevent, diagnose, and treat environmental problems associated with Minnesota industry.\nThe Board of Regents of the University of Minnesota, acting alone or in partnership with other public or private entities, is requested to submit investment proposals consistent with the goals and objectives of the MnDRIVE funding program as part of the Board of Regents biennial budget request to the legislature. The Board of Regents must give consideration to investments in existing scientific research programs that meet these guidelines but may require additional resources in order to preserve or accelerate Minnesota into a national or global leadership position. The governor shall submit a recommendation to the legislature regarding funding requests submitted by the Board of Regents.\nBy March 1 of each odd-numbered year, the Board of Regents of the University of Minnesota must provide to the chairs and ranking minority members of the legislative committees with primary jurisdiction over higher education policy and finance a summary report of investments and accomplishments related to funds received from the state under subdivision 2 from the prior biennium.",
	"repealed": false
}