{
	"id": "16A.626",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.626",
	"title": "16A.626 ELECTRONIC PAYMENTS.",
	"text": "(a) For purposes of this section, the terms defined in this paragraph have the meaning given them. \"Agency\" means a state officer, employee, board, commission, authority, department, entity, or organization of the executive branch of state government. \"Government services transaction\" means the conduct of business between an agency and an individual or business entity where the individual or business entity is paying a license or permit fee or tax or purchasing goods or services.\n(b) Notwithstanding any other provision of law, rule, or regulation to the contrary, an agency may accept credit cards, charge cards, debit cards, or other method of electronic funds transfer for payment in government services transactions, including electronic transactions.\n(c) The commissioner of management and budget shall contract with one or more entities for the purpose of enabling agencies to accept and process credit cards and other electronic financial transactions. All agencies shall process their credit card and other electronic financial transactions through the contracts negotiated by the commissioner of management and budget, unless the commissioner of management and budget grants a waiver allowing an agency to negotiate its own contract with an entity. These contracts must be approved by the commissioner of management and budget.\n(d) Agencies that accept credit cards, charge cards, debit cards, or other method of electronic funds transfer for payment may impose a convenience fee to be added to each transaction, except that the Department of Revenue shall not impose a fee under this section on any payment of tax that is required by law or rule to be made by electronic funds transfer. The total amount of such convenience fee must be equal to the transaction fee charged by a processing contractor for such credit services during the most recent collection period. An agency imposing a convenience fee must notify the person using the credit services of the fee before the transaction is processed. Fees collected under this section are appropriated to the agency collecting the fee for purposes of paying the processing contractor.\n(e) A convenience fee imposed by an agency under this section is in addition to any tax, fee, charge, or cost otherwise imposed for a license, permit, tax, service, or good provided by the agency.\n(f) Credit card, charge card, debit card, or other method of electronic funds transfer account numbers are nonpublic data not on individuals as defined in section 13.02, subdivision 9, or private data on individuals as defined in section 13.02, subdivision 12.",
	"repealed": false
}