{
	"id": "169.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.345",
	"title": "169.345 PARKING PRIVILEGE FOR PHYSICALLY DISABLED.",
	"text": "(a) A vehicle described in section 168.021, subdivision 1, paragraph (a), that prominently displays the certificate authorized by this section or that bears the disability plate or plates issued under section 168.021 may be parked by or solely for the benefit of a physically disabled person:\n(1) in a designated parking space for disabled persons, as provided in section 169.346;\n(2) in a metered parking space without obligation to pay the meter fee and without time restrictions unless time restrictions are separately posted on official signs; and\n(3) without time restrictions in a nonmetered space where parking is otherwise allowed for passenger vehicles but restricted to a maximum period of time and that does not specifically prohibit the exercise of disabled parking privileges in that space.\nA person may park the vehicle for a physically disabled person in a parking space described in clause (1) or (2) only when actually transporting the physically disabled person for the sole benefit of that person and when the parking space is within a reasonable distance from the drop-off point.\n(b) For purposes of this subdivision, a certificate is prominently displayed if it is displayed so that it may be viewed from the front and rear of the motor vehicle by hanging it from the rearview mirror attached to the front windshield of the motor vehicle or, in the case of a motorcycle or a motorized bicycle, is secured to the vehicle. If there is no rearview mirror or if the certificate holder's disability precludes placing the certificate on the mirror, the certificate must be displayed on the dashboard of the vehicle. No part of the certificate may be obscured.\n(c) Notwithstanding paragraph (a), clauses (1), (2), and (3), this section does not permit parking in areas prohibited by sections 169.32 and 169.34, in designated no parking spaces, or in parking spaces reserved for specified purposes or vehicles. A local governmental unit may, by ordinance, prohibit parking on any street or highway to create a fire lane, or to accommodate heavy traffic during morning and afternoon rush hours and these ordinances also apply to physically disabled persons.\n(a) For the purpose of section 168.021 and this section, the following terms have the meanings given them in this subdivision.\n(b) \"Health professional\" means a licensed physician, licensed physician assistant, advanced practice registered nurse, licensed physical therapist, or licensed chiropractor.\n(c) \"Long-term certificate\" means a certificate issued for a period greater than 12 months but not greater than 71 months.\n(d) \"Organization certificate\" means a certificate issued to an entity other than a natural person for a period of three years.\n(e) \"Permit\" refers to a permit that is issued for a period of 30 days, in lieu of the certificate referred to in subdivision 3, while the application is being processed.\n(f) \"Physically disabled person\" means a person who:\n(1) because of disability cannot walk without significant risk of falling;\n(2) because of disability cannot walk 200 feet without stopping to rest;\n(3) because of disability cannot walk without the aid of another person, a walker, a cane, crutches, braces, a prosthetic device, or a wheelchair;\n(4) is restricted by a respiratory disease to such an extent that the person's forced (respiratory) expiratory volume for one second, when measured by spirometry, is less than one liter;\n(5) has an arterial oxygen tension (PaO2) of less than 60 mm/Hg on room air at rest;\n(6) uses portable oxygen;\n(7) has a cardiac condition to the extent that the person's functional limitations are classified in severity as class III or class IV according to standards set by the American Heart Association;\n(8) has lost an arm or a leg and does not have or cannot use an artificial limb;\n(9) has a disability that would be aggravated by walking 200 feet under normal environmental conditions to an extent that would be life threatening; or\n(10) is legally blind.\n(g) A pregnant person experiencing any of the conditions described in paragraph (f) is eligible for parking privileges pursuant to this section.\n(h) \"Short-term certificate\" means a certificate issued for a period greater than six months but not greater than 12 months.\n(i) \"Six-year certificate\" means a certificate issued for a period of six years.\n(j) \"Temporary certificate\" means a certificate issued for a period not greater than six months.\n(a) The commissioner shall develop a format for the medical statement. The medical statement must be signed by a health professional who certifies that the applicant is a physically disabled person as defined in subdivision 2. The commissioner may request additional information from the health professional if needed to verify the applicant's eligibility. The medical statement that the applicant is a physically disabled person must specify whether the disability is permanent or temporary and, if temporary, the opinion of the health professional as to the duration of the disability. A health professional who fraudulently certifies to the commissioner that a person is a physically disabled person as defined in subdivision 2, and that the person is entitled to the disability plates authorized by section 168.021 or to the certificate authorized by this section, is guilty of a misdemeanor and is subject to a fine of $500.\n(b) The commissioner may waive the requirement of providing a statement of a health professional if the applicant has previously filed with the commissioner a statement of a health professional certifying that the applicant has a permanent physical disability.\n(a) The commissioner shall issue (1) immediately, a permit valid for 30 days if the person is eligible for the certificate issued under this section and (2) an identifying certificate for a vehicle described in section 168.021, subdivision 1, paragraph (a), when a physically disabled applicant submits proof of physical disability under subdivision 2a. The commissioner shall design separate certificates for persons with permanent and temporary disabilities that can be readily distinguished from each other from outside a vehicle at a distance of 25 feet or, in the case of a motorcycle or a motorized bicycle, can be readily secured to the motorcycle or motorized bicycle. An applicant may be issued up to two certificates if the applicant has not been issued disability plates under section 168.021.\n(b) The operator of a vehicle displaying a certificate has the parking privileges provided in subdivision 1 only while the vehicle is actually parked while transporting a physically disabled person.\n(c) The commissioner shall cancel all certificates issued to an applicant who fails to comply with the requirements of this subdivision.\n(a) An organization providing transportation to one or more physically disabled persons may apply to the commissioner for one or more organization certificates for motor vehicles owned or operated on behalf of the organization.\n(b) The organization shall submit a written statement of intent to the commissioner signed by an officer of the organization. The statement must:\n(1) indicate the number of certificates requested;\n(2) state that all issued certificates must be used solely for the benefit of physically disabled persons;\n(3) state that the organization shall report lost or stolen certificates to the commissioner within 24 hours of first discovery; and\n(4) state that the organization shall immediately notify the commissioner of any misuse or suspected misuse of any certificate issued to the organization.\n(c) An organization shall include with the application a description of the internal controls to be used to ensure the proper use of certificates and to account for all issued certificates. The controls must include:\n(1) maintenance of a current list of the make, model, and plate number of all motor vehicles in which a certificate issued to the organization will be used; and\n(2) maintenance of a current list of the name and driver's license number of all individuals authorized to operate the motor vehicle in which certificates issued to the organization will be used.\n(d) When the commissioner is satisfied that an organization will use a certificate to transport physically disabled persons, the commissioner shall issue without charge (1) immediately, a permit valid for 30 days if the organization is eligible for a certificate and (2) an organization certificate for the motor vehicle.\n(e) The certificate issued to an organization transporting physically disabled persons must be renewed every third year. On original application and renewal, the organization must present evidence that each certificate issued continues to be used exclusively to transport physically disabled persons.\n(f) The commissioner shall cancel all certificates issued to an applicant who fails to comply with the requirements of this subdivision.\nA certificate must be made of plastic or similar durable material and must bear its expiration date prominently on both sides. A certificate issued to a temporarily disabled person must display the date of expiration of the duration of the disability, as determined under subdivision 3 or 3a. Each applicant must be provided a summary of the parking privileges and restrictions that apply to each motor vehicle for which the certificate is used.\nThe commissioner may charge a fee of $5 for issuance of each organization certificate, each temporary certificate, and each short-term certificate and a fee of $5 for a duplicate to replace a lost, stolen, or damaged organization, temporary, or short-term certificate. The commissioner shall not issue more than three duplicate certificates for lost, stolen, or canceled certificates within any six-year period without the approval of the Minnesota State Council on Disability.\n(a) If a peace officer, authorized parking enforcement employee or agent of a statutory or home rule charter city or town, representative of the Minnesota State Council on Disability, or an authorized agent of a citizen enforcement program under section 169.346, subdivision 4, finds that a certificate, permit, or disability plate is being improperly used, or the applicant is no longer eligible, the officer, municipal employee, representative, or agent shall report the violation or situation to the commissioner. The commissioner may cancel the certificate, permit, or disability plates issued under section 168.021 on determining that:\n(1) the certificate, permit, or plates were used improperly;\n(2) the certificate, permit, or plates were fraudulently obtained;\n(3) the certificate, permit, or plates were issued in error;\n(4) the person who was issued the certificate, permit, or plates is deceased;\n(5) the person who was issued the certificate, permit, or plates no longer maintains a Minnesota address; or\n(6) the person or organization has failed to comply with the requirements of this section.\n(b) A person who uses a certificate, permit, or disability plates in violation of this section is guilty of a misdemeanor and is subject to a fine of $500.\n[Repealed, 1967 c 389 s 2]",
	"repealed": false
}