{
	"id": "273.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.121",
	"title": "273.121 VALUATION OF REAL PROPERTY, NOTICE.",
	"text": "Any county assessor or city assessor having the powers of a county assessor, valuing or classifying taxable real property shall in each year notify those persons whose property is to be included on the assessment roll that year if the person's address is known to the assessor, otherwise the occupant of the property. The notice shall be in writing and shall be sent by ordinary mail at least ten days before the meeting of the local board of appeal and equalization under section 274.01 or the review process established under section 274.13, subdivision 1c. Upon written request by the owner of the property, the assessor may send the notice in electronic form or by electronic mail instead of on paper or by ordinary mail. It shall contain: (1) the market value for the current and prior assessment; (2) the market value subject to taxation after subtracting the amount of any qualifying improvements for the current assessment; (3) the classification of the property for the current and prior assessment; (4) the assessor's office address; and (5) the dates, places, and times set for the meetings of the local board of appeal and equalization, the review process established under section 274.13, subdivision 1c, and the county board of appeal and equalization. If the classification of the property has changed between the current and prior assessments, a specific note to that effect shall be prominently listed on the statement. The commissioner of revenue shall specify the form of the notice. The assessor shall attach to the assessment roll a statement that the notices required by this section have been mailed. Any assessor who is not provided sufficient funds from the assessor's governing body to provide such notices, may make application to the commissioner of revenue to finance such notices. The commissioner of revenue shall conduct an investigation and, if satisfied that the assessor does not have the necessary funds, issue a certification to the commissioner of management and budget of the amount necessary to provide such notices. The commissioner of management and budget shall issue a payment for such amount and shall deduct such amount from any state payment to such county or municipality. The necessary funds to make such payments are hereby appropriated. Failure to receive the notice shall in no way affect the validity of the assessment, the resulting tax, the procedures of any board of review or equalization, or the enforcement of delinquent taxes by statutory means.\nThe notice must state where the information on the property is available, the times when the information may be viewed by the public, and the county's website address.\nA county assessor, or a city assessor having the powers of a county assessor, who does not comply with the timely notice requirement under subdivision 1 must:\n(1) mail an additional valuation notice to each person who was not provided timely notice; and\n(2) convene a supplemental local board of appeal and equalization or local review session no sooner than ten days after sending the additional notices required by clause (1).",
	"repealed": false
}