{
	"id": "245F.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.08",
	"title": "245F.08 STABILIZATION SERVICES.",
	"text": "The license holder must encourage patients to remain in care for an appropriate duration as determined by the patient's stabilization plan, and must encourage all patients to enter programs for ongoing recovery as clinically indicated. In addition, the license holder must offer services that are patient-centered, trauma-informed, and culturally appropriate. Culturally appropriate services must include translation services and dietary services that meet a patient's dietary needs. All services provided to the patient must be documented in the patient's medical record. The following services must be offered unless clinically inappropriate and the justifying clinical rationale is documented:\n(1) individual or group motivational counseling sessions;\n(2) individual advocacy and case management services;\n(3) medical services as required in section 245F.12;\n(4) care coordination provided according to subdivision 2;\n(5) peer recovery support services provided according to subdivision 3;\n(6) patient education provided according to subdivision 4; and\n(7) referrals to mutual aid, self-help, and support groups.\nCare coordination services must be initiated for each patient upon admission. The license holder must identify the staff person responsible for the provision of each service. Care coordination services must include:\n(1) coordination with significant others to assist in the stabilization planning process whenever possible;\n(2) coordination with and follow-up to appropriate medical services as identified by the nurse or licensed practitioner;\n(3) referral to substance use disorder services as indicated by the comprehensive assessment;\n(4) referral to mental health services as identified in the comprehensive assessment;\n(5) referrals to economic assistance, social services, and prenatal care in accordance with the patient's needs;\n(6) review and approval of the transition plan prior to discharge, except in an emergency, by a staff member able to provide direct patient contact;\n(7) documentation of the provision of care coordination services in the patient's file; and\n(8) addressing cultural and socioeconomic factors affecting the patient's access to services.\nPeer recovery support services must meet the requirements in section 245G.07, subdivision 2, clause (8), and must be provided by a person who is qualified according to the requirements in section 245F.15, subdivision 7.\nA license holder must provide education to each patient on the following:\n(1) substance use disorder, including the effects of alcohol and other drugs, specific information about the effects of substance use on unborn children, and the signs and symptoms of fetal alcohol spectrum disorders;\n(2) tuberculosis and reporting known cases of tuberculosis disease to health care authorities according to section 144.4804;\n(3) Hepatitis C treatment and prevention;\n(4) HIV as required in section 245A.19, paragraphs (b) and (c);\n(5) nicotine cessation options, if applicable;\n(6) opioid tolerance and overdose risks, if applicable; and\n(7) long-term withdrawal issues related to use of barbiturates and benzodiazepines, if applicable.\nThe license holder must refer patients to mutual aid, self-help, and support groups when clinically indicated and to the extent available in the community.",
	"repealed": false
}