{
	"id": "116.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.48",
	"title": "116.48 NOTIFICATION REQUIREMENTS.",
	"text": "(a) An owner of an underground storage tank must notify the agency by June 1, 1986, or within 30 days after installation, whichever is later, of the tank's existence and specify the age, size, type, location, uses, and contents of the tank on forms prescribed by the agency.\n(b) An owner of an aboveground storage tank must notify the agency by June 1, 1990, or within 30 days after installation, whichever is later, of the tank's existence and specify the age, size, type, location, uses, and contents of the tank on forms prescribed by the agency.\nAn owner of an underground or aboveground storage tank permanently taken out of service on or after January 1, 1974, must notify the agency by June 1, 1986, in the case of underground storage tanks; by June 1, 1990, in the case of aboveground storage tanks; or, in either case, within 30 days of discovery, whichever is later, of the existence of the tank and specify or estimate to the best of the owner's knowledge on forms prescribed by the agency, the date the tank was taken out of service, the age, size, type, and location of the tank, and the type and quantity of substance remaining in the tank.\nAn owner must notify the agency within 30 days of a permanent removal from service or a change in the reported uses, contents, or ownership of an underground or aboveground storage tank.\nBeginning on January 1, 1986, and until July 1, 1987, a person who transfers the title to regulated substances to be placed directly into an underground storage tank must inform the owner or operator in writing of the notification requirement of this section.\nA person who sells a tank intended to be used as an underground or aboveground storage tank or property that the seller knows contains an underground or aboveground storage tank must inform the purchaser in writing of the owner's notification requirements of this section.\n(a) Before transferring ownership of property that the owner knows contains an underground or aboveground storage tank or contained an underground or aboveground storage tank that had a release for which no corrective action was taken or if required by the agency as a condition of a corrective action under chapter 115C, the owner shall record with the county recorder or registrar of titles of the county in which the property is located an affidavit containing:\n(1) a legal description of the property where the tank is located;\n(2) a description of the tank, of the location of the tank, and of any known release from the tank of a regulated substance to the full extent known or reasonably ascertainable;\n(3) a description of any restrictions currently in force on the use of the property resulting from any release; and\n(4) the name of the owner.\n(b) The county recorder shall record the affidavits in a manner that will insure their disclosure in the ordinary course of a title search of the subject property. Before transferring ownership of property that the owner knows contains an underground or aboveground storage tank, the owner shall deliver to the purchaser a copy of the affidavit and any additional information necessary to make the facts in the affidavit accurate as of the date of transfer of ownership.\n(c) Failure to record an affidavit as provided in this subdivision does not affect or prevent any transfer of ownership of the property.\nIf an affidavit has been recorded under subdivision 6 and the tank and any regulated substance released from the tank have been removed from the property in accordance with applicable law, the owner or other interested party may file with the county recorder or registrar of titles an affidavit stating the name of the owner, the legal description of the property, the place and date of filing and document number of the affidavit filed under subdivision 6, and the approximate date of removal of the tank and regulated substance. Upon filing the affidavit described in this subdivision, the affidavit and the affidavit filed under subdivision 6, together with the information set forth in the affidavits, cease to constitute either actual or constructive notice.\nBefore beginning installation or removal of an underground tank system, owners and operators must notify the commissioner. Notification must be in writing or by telephone at least ten days before the tank installation or removal. Owners and operators must renotify the commissioner if the date of the tank installation or removal changes by more than 48 hours. The notification must include the following information:\n(1) the name, address, and telephone number of the site owner;\n(2) the location of the site, if different from clause (1);\n(3) the date of the tank installation or removal; and\n(4) the name of the contractor or company that will install or remove the tank.",
	"repealed": false
}