{
	"id": "136F.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.71",
	"title": "136F.71 RECEIPTS.",
	"text": "All receipts of every kind, nature, and description, including student tuition and fees, all federal receipts, aids, contributions, and reimbursements, but not including receipts attributable to state colleges and universities activity funds, in all the state colleges and universities are appropriated to the board, but are subject to budgetary control to be exercised by the commissioner of management and budget. The balance in these funds shall not cancel on June 30, but shall be available in the next fiscal year.\nAll receipts attributable to the state colleges and universities activity funds are appropriated to the board and are not subject to budgetary control as exercised by the commissioner of management and budget.\nInterest income attributable to general fund dedicated receipts of the board is appropriated to the board. The board shall allocate the income proportionately among the colleges and universities. The board shall report this income separately in its biennial budget requests.\nNotwithstanding section 16A.27, the board shall have authority to control the amount and manner of deposit of all receipts described in this section in depositories selected by the board. The board's authority shall include specifying the considerations, financial activities, and conditions required from the depository, including the requirement of collateral security or a corporate surety bond as described in section 118A.03. The board may compensate the depository, including paying a reasonable charge to the depository, maintaining appropriate compensating balances with the depository, or purchasing non-interest-bearing certificates of deposit from the depository for performing depository-related services.\nNotwithstanding any other law to the contrary, to the extent that the board has receipts under this section sufficient to continue operations, the commissioner of management and budget shall provide the board with statewide systems services under section 16A.1286 and access to its funds as deemed necessary by the board to continue its operations. The board shall pay for the services received in accordance with section 16A.1286, including any administrative services necessary for the commissioner of management and budget to provide the statewide systems services. In addition, the board shall pay for treasury operations services provided by the commissioner of management and budget. Payments received by the commissioner of management and budget under this subdivision are appropriated to the Department of Management and Budget for the purposes of providing those services. The commissioner of management and budget may transfer payments received under this subdivision to the chief information officer and the commissioner of administration, if necessary.",
	"repealed": false
}