{
	"id": "142F.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.13",
	"title": "142F.13 MINNESOTA FOOD ASSISTANCE PROGRAM.",
	"text": "The Minnesota food assistance program is established to provide food assistance to legal noncitizens residing in this state who are ineligible to participate in the federal Supplemental Nutrition Assistance Program (SNAP) solely due to the provisions of section 402 or 403 of Public Law 104-193, as authorized by Title VII of the 1997 Emergency Supplemental Appropriations Act, Public Law 105-18, and as amended by Public Law 105-185.\nThe Minnesota food assistance program is limited to those noncitizens described in this subdivision who are 50 years of age or older.\nTo be eligible for the Minnesota food assistance program, all of the following conditions must be met:\n(1) the applicant must meet the initial and ongoing eligibility requirements for the federal SNAP, except for the applicant's ineligible immigration status;\n(2) the applicant must be either a qualified noncitizen as defined in section 142G.02, subdivision 80, or a noncitizen otherwise residing lawfully in the United States;\n(3) the applicant must be a resident of the state; and\n(4) the applicant must not be receiving assistance under MFIP.\n(a) The rules for the Minnesota food assistance program shall follow exactly the regulations for the federal SNAP, except for the provisions pertaining to immigration status under section 402 or 403 of Public Law 104-193.\n(b) The county agency shall use the income, budgeting, and benefit allotment regulations of the federal SNAP to calculate an eligible recipient's monthly Minnesota food assistance program benefit. Eligible recipients shall receive the same level of benefits as those provided by the federal SNAP to similarly situated citizen recipients. The monthly Minnesota food assistance program benefits shall not exceed an amount equal to the amount of federal SNAP benefits the household would receive if all members of the household were eligible for the federal SNAP benefits.\n(c) Minnesota food assistance program benefits must be disregarded as income in all programs that do not count SNAP benefits as income.\n(d) The county agency must redetermine a Minnesota food assistance program recipient's eligibility for the federal SNAP when the agency receives information that the recipient's legal immigration status has changed in such a way that would make the recipient potentially eligible for the federal SNAP.",
	"repealed": false
}