{
	"id": "60A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.60",
	"title": "60A.60 DEFINITIONS.",
	"text": "For the purposes of sections 60A.60 to 60A.696, the terms defined in this section have the meanings given them.\n\"Adjusted risk-based capital report\" means a risk-based capital report that has been adjusted by the commissioner according to section 60A.61, subdivision 5.\n\"Corrective order\" means an order issued by the commissioner specifying corrective actions that the commissioner has determined are required.\n\"Domestic insurer\" means an insurance company incorporated or organized in this state.\n\"Foreign insurer\" means an insurance company that is admitted to do business in this state under section 60A.19 but is not incorporated or organized in this state.\n\"NAIC\" means the National Association of Insurance Commissioners.\n\"Life and/or health insurer\" means an insurance company authorized to transact business under section 60A.06, subdivision 1, clause (4), or a property and casualty insurer transacting business only under section 60A.06, subdivision 1, clause (5)(a).\n\"Property and casualty insurer\" means an insurance company authorized to transact business under section 60A.06, subdivision 1, clauses (1), (2), (3), (5), (6), (8), (9), (10), (11), (12), (13), (14), and (15), but does not include monoline mortgage guaranty insurers, and financial guaranty insurers.\n\"Negative trend\" means negative trend over a period of time, as determined according to the \"trend test calculation\" included in the risk-based capital instructions.\n\"Risk-based capital instructions\" means the risk-based capital report including risk-based capital instructions adopted by the NAIC, as those risk-based instructions may be amended by the NAIC from time to time according to the procedures adopted by the NAIC.\n\"Risk-based capital level\" means an insurer's company action level risk-based capital, regulatory action level risk-based capital, authorized control level risk-based capital, or mandatory control level risk-based capital where:\n(1) \"company action level risk-based capital\" means, with respect to an insurer, the product of 2.0 and its authorized control level risk-based capital;\n(2) \"regulatory action level risk-based capital\" means the product of 1.5 and its authorized control level risk-based capital;\n(3) \"authorized control level risk-based capital\" means the number determined under the risk-based capital formula according to the risk-based capital instructions;\n(4) \"mandatory control level risk-based capital\" means the product of .70 and the authorized control level risk-based capital.\n\"Risk-based capital plan\" means a comprehensive financial plan containing the elements specified in section 60A.62, subdivision 2. If the commissioner rejects the risk-based capital plan, and it is revised by the insurer, with or without the commissioner's recommendation, the plan must be called the \"revised risk-based capital plan.\"\n\"Risk-based capital report\" means the report required in section 60A.61.\n\"Total adjusted capital\" means the sum of:\n(1) an insurer's statutory capital and surplus as determined in accordance with statutory accounting applicable to the annual statement required to be filed under section 60A.13; and\n(2) other items, if any, as the risk-based capital instructions may provide.",
	"repealed": false
}