{
	"id": "13C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/13C.02",
	"title": "13C.02 DISCLOSURE OF USE OF CONSUMER REPORTS FOR EMPLOYMENT PURPOSES.",
	"text": "A person may not obtain or cause to be prepared a consumer report on a consumer for employment purposes unless the person clearly and accurately discloses to the consumer that a consumer report may be obtained or caused to be prepared. The disclosure must inform the consumer of the right to request additional information on the nature of the report under subdivision 3. In the case of an investigative consumer report, the disclosure under this subdivision must inform the consumer that the report may include information obtained through personal interviews regarding the consumer's character, general reputation, personal characteristics, or mode of living.\nThe disclosure required under subdivision 1 must be in writing and must be provided to the consumer before the consumer report is obtained or caused to be prepared. If a written application is provided for employment purposes by an employer or prospective employer, the disclosure must be included in or accompany the application. The disclosure must include a box that the person may check off and return to receive a copy of the consumer report. If the consumer requests a copy of the report, the person requesting the report shall request the person preparing the report to provide a copy to the consumer. The report must be sent to the consumer by the person preparing the report within 24 hours of providing it to the person requesting the report. The report to the consumer must include a statement of the consumer's right to dispute and correct any errors and of the procedures under United States Code, title 15, sections 1681 to 1681t. A consumer may not be charged for a report provided under this section. If no report exists, the consumer reporting agency has no obligation to the consumer under this section.\nA consumer reporting agency shall, upon written request from the consumer, make a complete and accurate disclosure of the nature and scope of the report. The disclosure under this subdivision must be in writing and must be mailed or delivered to the consumer within five days after the request for the disclosure was received or the consumer report was requested, whichever date is later.\nThis section does not apply to:\n(1) a consumer report to be used for employment purposes for which the consumer has not specifically applied; or\n(2) a consumer report used for an investigation of a current violation of a criminal or civil statute by a current employee or an investigation of employee conduct for which the employer may be liable, until the investigation is completed.",
	"repealed": false
}