{
	"id": "43A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.50",
	"title": "43A.50 STATE EMPLOYEE COMBINED CHARITIES CAMPAIGN REGISTRATION.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Registered combined charitable organization\" means a federated funding organization:\n(1) which is tax exempt under section 501(c)3 of the Internal Revenue Code of 1986, as amended through December 31, 1992 (hereinafter \"Internal Revenue Code\"), and to which contributions are deductible under section 170 of the Internal Revenue Code;\n(2) which is properly registered with the attorney general of Minnesota to solicit contributions in Minnesota;\n(3) which secures funds through the state employee combined charities campaign for distribution to 14 or more affiliated agencies, each of which must devote substantially all of its activities to providing health, welfare, social, or other services that benefit individuals in Minnesota and contiguous counties;\n(4) which is governed either by an independent, voluntary board and at least 90 percent of the directors of the governing board live or work in Minnesota or contiguous counties or, if the charitable agencies are solely educational institutions which meet the requirements of paragraph (c), by a national board of directors that has a local advisory board composed of members who live or work in Minnesota or contiguous counties;\n(5) which expended no more than 30 percent of total contributions received in the organization's accounting year last reported for management and general costs and fundraising costs;\n(6) which distributed at least 70 percent of total contributions received in the organization's accounting year last reported to affiliated agencies, programs, and designated agencies in Minnesota and contiguous counties or, if the charitable agencies are solely educational institutions which meet the requirements of paragraph (c), distributes at least 70 percent of the state employee combined charitable campaign income and revenue directly to Minnesota residents or schools using established eligibility criteria; and\n(7) which has been registered with the commissioner in accordance with this section.\nRegistered combined charitable organization includes a charitable organization organized by Minnesota state employees and their exclusive representatives for the purpose of providing grants to nonprofit agencies providing Minnesota residents with food or shelter if the charitable organization meets the requirements of clauses (1), (2), (4), (5), (6), and (7).\n(c) \"Affiliated agency\" means a charitable agency that is represented by a federation and has an ongoing relationship with that federation which involves a review and monitoring process to ensure financial, managerial, and programmatic responsibility.\n(d) \"Charitable agency\" means a governmental agency or an organization (1) which is tax-exempt under section 501(c)3 of the Internal Revenue Code; (2) to which contributions are deductible under section 170 of the Internal Revenue Code; and (3) which is in compliance with the provisions of this chapter.\n(e) \"State employee combined charities campaign\" means the annual state campaign that allows a state employee to authorize payroll deduction for the employee's contribution to a registered combined charitable organization, pursuant to section 16A.134.\n(f) \"Management and general costs\" means costs as defined in section 309.50, subdivision 11.\n(g) \"Fundraising costs\" means costs as defined in section 309.50, subdivision 12.\n(h) \"Contiguous counties\" means counties in Iowa, North Dakota, South Dakota, and Wisconsin that share a border with Minnesota.\n(a) A federated funding organization shall apply to the commissioner by March 1 in order to be eligible to participate in the state employee combined charities campaign for that year.\n(b) A federated funding organization must apply in the form prescribed by the commissioner and shall provide the following:\n(1) assurance of tax-exempt status for the federated funding organization and each of the charitable agencies identified by the federated funding organization as an affiliated agency;\n(2) assurance of proper registration with the attorney general of Minnesota to solicit contributions in the state of Minnesota for the federated funding organization and each of the charitable agencies identified by the federated funding organization as an affiliated agency. A copy of the registration letter in effect at the time of application for the state employee combined charities campaign must be available upon request;\n(3) an affidavit signed by a duly constituted officer of the federated funding organization attesting to the fact that the federated funding organization and its affiliated agencies are in compliance with each of the provisions of this section;\n(4) a list of the board of directors or local advisory board for the federated funding organization which identifies the members who live or work in Minnesota and contiguous counties;\n(5) a list of the name and business address of each affiliated agency the federated funding organization supports;\n(6) a list of any related organizations, as defined in section 317A.011, subdivision 18;\n(7) the total contributions received in the organization's accounting year last reported and, from those contributions, the amounts expended by the federated funding organization for management and general costs and for fundraising costs and the amount distributed to the affiliated agencies, programs, and designated agencies it supports; and\n(8) a fee of $100, or ten percent of the funds raised from state employees in the previous campaign, whichever is less. The fee for an organization which did not participate in the previous year's state employee campaign is $100. These fees must be credited to an account in the special revenue fund and are appropriated to the commissioner to be expended with the approval of the Combined Charities Board in section 43A.04 for costs associated with administering the annual campaign.\nThe commissioner may require submission of additional information needed to determine compliance with the provisions of this chapter.\n(c) The commissioner shall register or not register the application of an organization and shall notify the organization of the decision by May 1. An organization whose application is denied has ten calendar days after receiving notice of the denial to appeal the decision or file an amended application correcting the deficiency. The commissioner shall register or not register the organization within ten calendar days after receiving the appeal or amended application. If registration is denied a second time, the organization may appeal within five calendar days after receiving notice of the denial. A hearing shall be scheduled by the commissioner and shall be held within 15 calendar days after receiving notice of the appeal. The parties may mutually agree to a later date. The provisions of chapter 14 do not apply to the hearing. The hearing shall be conducted in a manner considered appropriate by the commissioner. The commissioner shall make a determination within five calendar days after the hearing has been completed.\n(d) Only organizations that are approved may participate in the state employee combined charities campaign for the year of approval and only contributions to approved organizations may be deducted from an employee's pay pursuant to section 16A.134.\nNo two federated funding campaigns that are related organizations, as defined in section 317A.011, subdivision 18, may participate simultaneously in the state employee combined charities campaign.\nA registered combined charitable organization may offer the option of designating in writing that the amount deducted in section 16A.134 be designated to any charitable agency whether or not the charitable agency receives funds from the single, annual consolidated effort.",
	"repealed": false
}