{
	"id": "103D.535",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.535",
	"title": "103D.535 APPELLATE PROCEDURES AND REVIEW.",
	"text": "(a) Any party alone or jointly may appeal to the district court or to the board an order of the managers made in a proceeding relating to a project and entered in the watershed district's record that determines:\n(1) the amount of benefits determined;\n(2) the amount of damages allowed;\n(3) the allowance of fees or expenses in any proceedings;\n(4) a matter in the proceeding that affects a substantial right; or\n(5) an order of the managers authorizing or refusing to establish a project in whole or in part.\n(b) Actions of the managers that do not relate to projects, including actions related to permits and actions to enforce watershed district rules, are not reviewable under this section.\n(c) Projects initiated and financed by watershed districts, wholly within the metropolitan area, under a state-approved and locally adopted surface water management plan under section 103B.201 are not reviewable under this section.\nOn appeal, the amount awarded by the jury or the board as finally determined shall stand for and in the place of the amount from which the appeal was taken.\n(a) If an appeal is taken from an order authorizing a project, a trial of an appeal of benefits or damages from the proceedings must be stayed until the appeal is decided. If the order authorizing the project is affirmed, a trial of an appeal of benefits or damages may commence.\n(b) If the appeal is from an order refusing to authorize a project and the court or the board later orders the project, the secretary or administrator of the watershed district shall give notice by publication of the filing of the order. The notice is sufficient if it refers to the proposed project by general description and recites the substance of the order and the date of filing in the court.\n(a) A person or political subdivision appealing the amount of benefits or damages may include and have considered and determined benefits or damages affecting property other than that person's or political subdivision's own property.\n(b) Notice of the appeal must be served on:\n(1) the owner or occupant of the property not owned by the appellant or on the attorney who represented the other owner in the proceedings;\n(2) the auditor of the county where the property is located; and\n(3) on the court administrator of the district court of the county where the principal place of business of the watershed district is located, or on the board.\n(a) Before the appeal is heard by the court or board, the appellant must file a notice of appeal with the court administrator of the district court or the secretary of the board. The appeal must:\n(1) be filed within 30 days of the date of the final order;\n(2) state the grounds upon which the appeal is taken; and\n(3) be accompanied by an appeal bond of at least $250 to the watershed district where the property is located.\n(b) The bond must be approved by the court administrator of the district court or the board where the appeal is filed. The bond must be conditioned that the appellant will:\n(1) make the appeal;\n(2) pay all costs and disbursements that may be adjudged against the appellant; and\n(3) comply with the order of the court or of the board where the appeal is filed.\n(a) The appeal must be tried by a jury, or by the board at a time and place set by the court or board. If the appeal is tried by a jury, the appeal must be tried and determined at the next term of the district court held within the county where the notice of appeal was filed, or in other counties where the appeal is heard, beginning after the filing of the appeal.\n(b) An appeal takes precedence over all other civil matters.\n(c) If there is more than one appeal to the board involving the same project, or if there is more than one appeal triable in one county, the court or the board may consolidate the appeals and try them together, but the rights of the appellants must be determined separately. Consolidation of the appeals may be made on the court's or board's own motion or on the motion of a party in interest.\nIf there is an appeal relating to damages or benefits to property in a county other than the county where the principal place of business of the watershed district is located, on request of the appellant, the trial must be held at the next term of the district court of the county where the benefited or damaged property is located. The court administrator of the district court where the appeal is filed shall make a transcript of the papers and documents on file in the court administrator's office in the proceeding as they pertain to the matter for which the appeal is taken. The court administrator shall certify the transcript and file it in the office of the court administrator of the district court in the county where the appeal will be tried. After the final determination of the appeal, the court administrator of the district court where the action is tried shall certify and return the verdict to the district court of the county where the proceedings were initiated.\nIf the appeal is to the board, the board shall file its decision with the board's secretary. If the appeal is taken to the board from the order of the managers, the decision of the board may be reviewed by certiorari proceedings in the district court of a county where the proposed project lies in whole or in part.\nIf an appeal is from the order of the managers and made to the district court, and the court determines that there are involved facts, circumstances, or matters especially within the knowledge, functions, or duties of the board, the court may refer to the board as referee questions of fact within the scope of the board's knowledge, functions, and duties. The board shall make its findings of fact upon the questions and report them back to the court.\nThe board shall make a record of all matters tried by the board on appeal or referred to it by the district court for findings of fact under this section. The record must meet the requirements of a record of the trial of a matter in district court.\nProceedings before the board must conform to sections 14.57 to 14.62.",
	"repealed": false
}