{
	"id": "256D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.06",
	"title": "256D.06 AMOUNT OF ASSISTANCE.",
	"text": "General assistance shall be granted in an amount that when added to the countable income as determined to be actually available to the assistance unit under section 256P.06, the total amount equals the applicable standard of assistance for general assistance. In determining eligibility for and the amount of assistance for an individual or married couple, the agency shall apply the earned income disregard as determined in section 256P.03.\n[Repealed, 1983 c 312 art 8 s 17]\n[Repealed, 2014 c 312 art 28 s 37]\n[Repealed, 1990 c 568 art 4 s 85]\n(a) Notwithstanding the provisions of subdivision 1, a grant of emergency general assistance shall, to the extent funds are available, be made to an eligible single adult, married couple, or family for an emergency need where the recipient requests temporary assistance not exceeding 30 days if an emergency situation appears to exist under written criteria adopted by the county agency. If an applicant or recipient relates facts to the county agency which may be sufficient to constitute an emergency situation, the county agency shall, to the extent funds are available, advise the person of the procedure for applying for assistance according to this subdivision.\n(b) The applicant must be ineligible for assistance under chapter 142G, must have annual net income no greater than 200 percent of the federal poverty guidelines for the previous calendar year, and may receive an emergency assistance grant not more than once in any 12-month period.\n(c) Funding for an emergency general assistance program is limited to the appropriation. Each fiscal year, the commissioner shall allocate to counties the money appropriated for emergency general assistance grants based on each county agency's average share of state's emergency general expenditures for the immediate past three fiscal years as determined by the commissioner, and may reallocate any unspent amounts to other counties. No county shall be allocated less than $1,000 for a fiscal year.\n(d) Any emergency general assistance expenditures by a county above the amount of the commissioner's allocation to the county must be made from county funds.\n[Repealed, 1989 c 282 art 5 s 133; 1Sp1989 c 1 art 16 s 20]\n[Repealed, 1989 c 282 art 5 s 133; 1Sp1989 c 1 art 16 s 20]\n(a) Any applicant, otherwise eligible for general assistance and possibly eligible for maintenance benefits from any other source shall (1) make application for those benefits within 90 days of the general assistance application; and (2) execute an interim assistance agreement on a form as directed by the commissioner.\n(b) The commissioner shall review a denial of an application for other maintenance benefits and may require a recipient of general assistance to file an appeal of the denial if appropriate. If found eligible for benefits from other sources, and a payment received from another source relates to the period during which general assistance was also being received, the recipient shall be required to reimburse the county agency for the interim assistance paid. Reimbursement shall not exceed the amount of general assistance paid during the time period to which the other maintenance benefits apply and shall not exceed the state standard applicable to that time period.\n(c) The commissioner may contract with the county agencies, qualified agencies, organizations, or persons to provide advocacy and support services to process claims for federal disability benefits for applicants or recipients of services or benefits supervised by the commissioner using money retained under this section.\n(d) The commissioner may provide methods by which county agencies shall identify, refer, and assist recipients who may be eligible for benefits under federal programs for people with a disability.\n(e) The total amount of interim assistance recoveries retained under this section for advocacy, support, and claim processing services shall not exceed 35 percent of the interim assistance recoveries in the prior fiscal year.\n[Repealed, 1989 c 282 art 5 s 133; 1Sp1989 c 1 art 16 s 20]\n(a) The commissioner of human services shall contract with agencies or organizations capable of ensuring that clients who are presently receiving assistance under sections 256D.01 to 256D.21, and who may be eligible for benefits under the federal Supplemental Security Income program, apply and, when eligible, are converted to the federal income assistance program and made eligible for health care benefits under the medical assistance program. The commissioner shall ensure that money owing to the state under interim assistance agreements is collected.\n(b) The commissioner shall also directly or through contract implement procedures for collecting federal Medicare and medical assistance funds for which clients converted to SSI are retroactively eligible.\n(c) The commissioner shall contract with agencies to ensure implementation of this section. County contracts with providers for residential services shall include the requirement that providers screen residents who may be eligible for federal benefits and provide that information to the local agency. The commissioner shall modify the MAXIS computer system to provide information on clients who have been on general assistance for two years or longer. The list of clients shall be provided to local services for screening under this section.\n[Repealed, 2015 c 71 art 5 s 34]",
	"repealed": false
}