{
	"id": "174.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.03",
	"title": "174.03 DUTIES OF COMMISSIONER.",
	"text": "In order to best meet the present and future transportation needs of the public, to insure a strong state economy, to make most efficient use of public and private funds, to lessen adverse environmental impacts of the transportation sector, and to promote the more efficient use of energy and other resources for transportation purposes, the commissioner shall:\n(1) three months after notification that the department is ready to commence operations and prior to the drafting of the statewide transportation plan, hold public hearings as may be appropriate solely for the purpose of receiving suggestions for future transportation alternatives and priorities for the state. The Metropolitan Council, regional development commissions, and port authorities shall appear at the hearings and submit information concerning transportation-related planning undertaken and accomplished by these agencies. Other political subdivisions may appear and submit such information at the hearings. These hearings shall be completed no later than six months from the date of the commissioner's notification;\n(2) develop, adopt, revise, and monitor a statewide transportation plan, taking into account the suggestions and information submitted at the public hearings held pursuant to clause (1). The plan shall incorporate all modes of transportation including bicycle commutation and recreation and provide for the interconnection and coordination of different modes of transportation. The commissioner shall evaluate all transportation programs and facilities proposed for inclusion in the plan in terms of economic costs and benefits, safety aspects, impact on present and planned land uses, environmental effects, energy efficiency, national transportation policies and priorities, and availability of federal and other financial assistance;\n(3) based upon the statewide transportation plan, develop statewide transportation priorities and schedule authorized public capital improvements and other authorized public transportation expenditures pursuant to the priorities. As permitted by the federal Surface Transportation Program and subject to available funding, the commissioner shall give serious consideration to prioritizing for funding those trunk highway projects in the metropolitan area, as defined in section 473.121, subdivision 2, that are consistent with policies included in the Metropolitan Council's metropolitan development guide, transportation policy plan, and regional development framework, and that have been awarded funding through the federal Surface Transportation Program. In responding to an unforeseen, catastrophic event affecting the state transportation system, the commissioner may, upon written notification to the chairs of the senate and house of representatives committees with jurisdiction over transportation policy and finance, prioritize projects without regard to availability of federal funding; and\n(4) complete the plan and priorities required by this subdivision no later than July 1, 1978. Upon completion of the plan and priorities, the commissioner shall prepare and periodically revise, as necessary, the schedule of authorized public transportation expenditures. The plan, priorities, and schedule are exempt from the provisions of the Administrative Procedure Act.\n(a) The commissioner must revise the statewide multimodal transportation plan by January 15, 2022, and by January 15 of every five years thereafter. Before final adoption of a revised plan, the commissioner must hold a hearing to receive public comment on the preliminary draft of the revised plan.\n(b) Each revised statewide multimodal transportation plan must:\n(1) incorporate the goals of the state transportation system in section 174.01;\n(2) establish objectives, policies, and strategies for achieving those goals; and\n(3) identify performance targets for measuring progress and achievement of transportation system goals, objectives, or policies.\n(a) The commissioner must develop a comprehensive statewide freight and passenger rail plan to be revised within two years of each update to the statewide multimodal transportation plan that prioritizes future passenger rail capital improvement projects based on a scoring system. The plan must identify the criteria, weight of each criterion, and process used to score each project based on the weighted criteria. The plan must list the candidate projects evaluated, the score assigned, and any other reasons for prioritizing a project other than the score. The commissioner must publish the plan on the department's website.\n(b) The commissioner shall spend all funds for passenger rail on projects listed in the plan in order of priority unless the appropriation authorizing the funding explicitly designates the funding for a specific project.\nWithin one year of each revision of the statewide multimodal transportation plan under subdivision 1a, the commissioner must prepare a 20-year Minnesota state highway investment plan that:\n(1) incorporates performance measures and targets for assessing progress and achievement of the state's transportation goals, objectives, and policies identified in this chapter for the state trunk highway system, and those goals, objectives, and policies established in the statewide multimodal transportation plan. Performance targets must be based on objectively verifiable measures, and address, at a minimum:\n(i) preservation and maintenance of the structural condition of state highway roadways, bridges, pavements, roadside infrastructure, and traveler-related facilities;\n(ii) safety; and\n(iii) mobility;\n(2) summarizes trends and impacts for each performance target over the past five years;\n(3) summarizes the amount and analyzes the impact of the department's capital investments and priorities over the past five years on each performance target, including a comparison of prior plan projected costs with actual costs;\n(4) identifies the investments required to meet the established performance targets over the next 20-year period;\n(5) projects available state and federal funding over the 20-year period, including any unique, competitive, time-limited, or focused funding opportunities;\n(6) identifies strategies to ensure the most efficient use of existing transportation infrastructure, and to maximize the performance benefits of projected available funding;\n(7) establishes investment priorities for projected funding, which must:\n(i) provide for cost-effective preservation, maintenance, and repair to address the goal under section 174.01, subdivision 2, clause (9), in a manner that aligns with other goals in that section;\n(ii) as appropriate, provide a schedule of major projects or improvement programs for the 20-year period; and\n(iii) identify resulting projected costs and impact on performance targets;\n(8) identifies those performance targets identified under clause (1) not expected to meet the target outcome over the 20-year period together with alternative strategies that could be implemented to meet the targets; and\n(9) establishes procedures and guidance for capacity expansion project development to conform with section 161.178, subdivision 2, paragraph (a).\n[See Note.]\n[Repealed, 2014 c 227 art 1 s 23]\nAfter the adoption and each revision of the statewide transportation plan, the commissioner shall take no action inconsistent with the revised plan.\nThe statewide plan shall recognize established national transportation policies. The plan shall include matters of local or regional concern if this inclusion is needed to ensure a comprehensive, statewide perspective on transportation policies and priorities. The commissioner shall recognize and attempt to accommodate the local or regional transportation plans. However, the statewide plan shall supersede a local or regional plan to the extent inconsistent on a matter which the commissioner demonstrates is of statewide concern. A political subdivision may challenge the commissioner's determination that a portion of a local or regional plan is superseded by the statewide plan. The subdivision shall institute the challenge by filing a petition with the commissioner within 30 days after being notified by the commissioner that the local or regional plan is superseded. The challenge shall be resolved by the commissioner as a contested case pursuant to chapter 14.\nThe commissioner shall:\n(1) construct and maintain transportation facilities as authorized by law;\n(2) cooperate with, and may provide technical and financial assistance to, the Metropolitan Council and regional development commissions in the regional transportation planning process, in accordance with mutually acceptable terms and conditions;\n(3) cooperate with, and may provide planning and technical assistance upon the request of, any political subdivision or other governmental agency in accordance with mutually accepted terms and conditions, except as otherwise restricted by law; and\n(4) develop, revise, and monitor a statewide rail transportation plan as part of the statewide transportation planning process, including a study and evaluation of alternative methods for insuring adequate and economical transportation of agricultural commodities, supplies, and other goods to and from rural areas of the state. The plan shall include an analysis of rail lines in the state for the purpose of determining (i) eligibility of rail lines for assistance under federal and state rail assistance programs, (ii) eligibility of rail lines for inclusion in the state rail bank, and (iii) the actions required by the state to insure the continuation of rail service that meets essential state needs and objectives.\nThe Metropolitan Council, pursuant to section 473.146, and the regional development commissions shall develop regional long-range transportation policy plans in cooperation with the commissioner and local units of government. Upon promulgation of the statewide transportation plan, and periodically as necessary thereafter, each regional policy plan shall be reviewed and amended, if necessary, by the appropriate regional agency to insure that the regional policy plan is not in conflict with the statewide transportation plan.\n[Repealed, 1984 c 654 art 3 s 153]\nThe commissioner shall consider the social, economic, and environmental effects resulting from existing and proposed transportation facilities and shall make continuing efforts to mitigate any adverse effects. The commissioner shall utilize a systematic, interdisciplinary approach which shall insure the integrated use of the natural, social, and physical sciences and the environmental design arts in plans and decisions which may affect the environment.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\nThe commissioner, in cooperation with the commissioner of commerce through the state energy office, shall evaluate all modes of transportation in terms of their levels of energy consumption. The commissioner of commerce shall provide the commissioner with projections of the future availability of energy resources for transportation. The commissioner shall use the results of this evaluation and the projections to evaluate alternative programs and facilities to be included in the statewide plan and to otherwise promote the more efficient use of energy resources for transportation purposes.\nSalaries and expenses of the department relating to highway purposes shall be paid from moneys available in the trunk highway fund, except as provided in section 161.20, subdivision 3. The funds provided in sections 360.011 to 360.076 and 360.305 to 360.91 shall be expended by the commissioner of transportation in accordance with the purposes prescribed by those sections. Funds appropriated pursuant to the authority conferred by any constitutional article shall be expended in conformity with the purposes and uses authorized thereby.\nIn cooperation with the Department of Management and Budget and as required by section 16A.103, the commissioner shall prepare in February and November of each year a forecast of highway user tax distribution fund and trunk highway fund revenues and expenditures. The forecast must include an analysis of economic information and the potential impact on highway user fund revenues, historical growth rate information, and other variables affecting revenue assumptions and forecasted future growth rates. The forecast must include an analysis of trunk highway bonding and the necessary debt service payments, and assumptions regarding federal transportation funds. The commissioner shall review the forecast information with the chairs of the senate and house of representatives committees with jurisdiction over finance, ways and means, and transportation finance and with legislative fiscal staff no later than one week following the release of the forecast and shall inform the chairs and staff of changes made from previous forecasts.\n(a) The commissioner of transportation shall utilize the maximum feasible amount of all federal funds available to this state under United States Code, title 23, section 140, paragraph (b), to develop, conduct, and administer highway construction training, including skill improvement programs.\n(b) The commissioner of transportation must report by February 1 of each odd-numbered year to the house of representatives and senate committees having jurisdiction over transportation policy and finance concerning the commissioner's compliance with paragraph (a). The report must, with respect to each of the two previous calendar years:\n(1) describe the highway construction training and skill improvement programs the commissioner has conducted and administered;\n(2) analyze the results of the commissioner's training programs;\n(3) state the amount of federal funds available to this state under United States Code, title 23, section 140, paragraph (b); and\n(4) identify the amount spent by the commissioner in conducting and administering the programs.\n(a) The commissioner shall include in each contract that is funded at least in part by federal funds, a sanction for each contractor who does not meet the established project disadvantaged business enterprise goal or demonstrate good-faith effort to meet the goal.\n(b) The commissioner of transportation shall report by February 1 of each odd-numbered year to the house of representatives and senate committees having jurisdiction over transportation policy and finance concerning the commissioner's disadvantaged business enterprise program. The report must, with respect to each of the two previous calendar years:\n(1) state the department's annual overall goal, compared with the percentage attained;\n(2) explain the methodology, applicable facts, and public participation used to establish the overall goal;\n(3) describe good-faith efforts to meet the goal, if the goal was not attained;\n(4) describe actions to address overconcentration of disadvantaged business enterprises in certain types of work;\n(5) state the number of contracts that included disadvantaged business enterprise goals, the number of contractors that met established disadvantaged business enterprise goals, and sanctions imposed for lack of good-faith effort; and\n(6) describe contracts with no disadvantaged business enterprise goals, and, of those, state number of contracts and amount of each contract with targeted groups under section 16C.16.\n(a) The commissioner must implement performance measures and targets for the trunk highway system in order to construct resilient infrastructure, enhance the project selection for all transportation modes, improve economic security, and achieve the state transportation goals established in section 174.01.\n(b) At a minimum, the transportation planning process must include:\n(1) an inventory of transportation assets, including but not limited to bridge, pavement, geotechnical, pedestrian, bicycle, and transit asset categories;\n(2) establishment of statewide performance measures and targets, reporting of performance measure results, and where possible, performance forecasts that are:\n(i) statewide and, where data allow, district-specific;\n(ii) for assets in each asset category specified in clause (1); and\n(iii) identified in collaboration with the public;\n(3) gap identification and an explanation of the difference between performance targets and current status; and\n(4) life cycle assessment and corridor risk assessment as part of asset management programs in each district of the department.\n(c) At a minimum, the ten-year capital highway investment plan in each district of the department must:\n(1) be based on expected funding during the plan period and, to the extent feasible, maximize long-term benefits;\n(2) estimate the funding necessary to make optimal life cycle investments;\n(3) identify investments within each of the asset categories specified in paragraph (b), clause (1), that are funded through the trunk highway capital program;\n(4) identify specific trunk highway segments programmed to be removed from the trunk highway system; and\n(5) deliver annual progress toward achieving the state transportation goals established in section 174.01.\n(d) Annually by December 15, the commissioner must report trunk highway performance measures and targets and identify gaps, including information detailing the department's progress on achieving the state transportation goals, to the chairs and ranking minority members of the legislative committees having jurisdiction over transportation policy and finance. The report must be signed by the commissioner.",
	"repealed": false
}