{
	"id": "360.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.305",
	"title": "360.305 EXPENDITURES FOR AIRPORTS AND NAVIGATION.",
	"text": "The money appropriated to the commissioner of transportation as contemplated by this section shall be used in accordance with this chapter, in amounts not exceeding the sums specified for individual purposes in the acts making such appropriations. Unless otherwise provided in any such act, the governor may on the governor's own initiative or upon application by the commissioner of transportation order a change in the provisional limitations on the amounts to be expended for the individual purposes specified.\n(a) Before any expenditure of any of the money appropriated pursuant to this section to assist political subdivisions, municipalities, and public corporations in acquiring, constructing, improving, maintaining, and operating airports and other air navigation facilities may be authorized, the commissioner of transportation shall have made, with the approval of the governor, an order designating the municipalities and airports which are a part of the key airport system, the intermediate airport system, the landing strip system, and the state system of radio and navigational aids, in accordance with the definitions and limitations stated in subdivision 3.\n(b) The commissioner may use state airports fund money to provide the state's matching portion required to participate in the federal essential air service program under United States Code, title 49, sections 41731 to 41748.\n(a) Key system airports are those used or intended to be used by aircraft of all sizes up to and including large multiengine and jet aircraft, not exceeding 40.\n(b) Intermediate system airports shall be those used or intended for use by single engine or light to medium multiengine aircraft and shall include vertical takeoff and landing areas and short takeoff and landing areas not exceeding 90.\n(c) The landing strip system shall consist of those small airports which may be unattended, sod or hard surfaced and which are used or intended for use by single or multiengine light aircraft, and not exceeding 65.\n(d) The commissioner may amend such order from time to time to expand or modify the airport system to serve best the interest of the state, subject to the approval of the governor.\n(a) Annually by June 1, the commissioner of transportation shall establish local contribution rates which will apply to a political subdivision, municipality, or public corporation when applying for state or federal funding assistance to construct, improve, maintain, or operate an airport, or to acquire land for airport facilities or clear zones. If the commissioner does not establish local contribution rates by June 1, the previous rates apply.\n(b) The commissioner may pay all costs beyond the local contribution. Local contribution rates shall not be less than five percent of the total cost of the activity or acquisition, except that the commissioner may require less than five percent for research projects, radio or navigational aids, activities, or acquisitions for which federal funds are available to cover more than 90 percent of the total cost, or as otherwise necessary to respond to an emergency.\n(c) The commissioner's establishment of local contribution rates is not subject to the rulemaking requirements of chapter 14.\n(d) To receive aid under this section, the municipality must enter into an agreement with the commissioner giving assurance that the airport will be operated and maintained in a safe, serviceable manner for aeronautical purposes only for the use and benefit of the public:\n(1) for 20 years after the date the municipality receives any state funds for construction or improvement costs; and\n(2) for 99 years after the date the municipality receives any state funds for land acquisition costs. If any land acquired with state funds ceases to be used for aviation purposes, the municipality shall repay the state airports fund the same percentage of the appraised value of the property as that percentage of the costs of acquisition and participation provided by the state to acquire the land.\nThe agreement may contain other conditions as the commissioner deems reasonable.\n(e) The commissioner shall establish a hangar construction revolving account, which shall be used for the purpose of financing the construction of hangar buildings to be constructed by municipalities owning airports. All municipalities owning airports are authorized to enter into contracts for the construction of hangars, and contracts with the commissioner for the financing of hangar construction for an amount and period of time as may be determined by the commissioner and municipality. All receipts from the financing contracts shall be deposited in the hangar construction revolving account and are reappropriated for the purpose of financing construction of hangar buildings. The commissioner shall transfer up to $4,400,000 from the state airports fund to the hangar construction revolving account.\n(f) The commissioner may contribute to costs incurred by any municipality for airport maintenance and operations, safety equipment, and airport snow removal.\nThe commissioner of transportation shall cause to be prepared or supervise the preparation of plans and specifications for the construction, improvement, and maintenance of all airports and air navigation facilities upon which expenditures are made pursuant to this section; approve such plans and specifications; supervise and inspect all work; approve all lawful changes in plans and specifications; approve estimates for payments; and approve the construction when completed according to such plans and specifications.\nThe commissioner must not expend money for planning or land acquisition, for the construction, improvement, or maintenance of airports, or for air navigation facilities for an airport, unless the municipality, county, or joint airport zoning board involved has or is establishing a zoning authority for that airport, and the authority has made a good-faith showing that it is in the process of and will complete with due diligence, an airport zoning ordinance in accordance with sections 360.061 to 360.074. The commissioner may provide funds to support airport safety projects that maintain existing infrastructure, regardless of a zoning authority's efforts to complete a zoning regulation. The commissioner must make maximum use of zoning and easements to eliminate runway and other potential airport hazards rather than land acquisition in fee.\nReimbursements from municipalities for striping runways shall be deposited in the state airports fund.",
	"repealed": false
}