{
	"id": "161.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.46",
	"title": "161.46 REIMBURSEMENT OF UTILITY.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Utility\" means all publicly, privately, and cooperatively owned systems for supplying power, light, gas, telegraph, telephone, water, pipeline, or sewer service if such systems be authorized by law to use public highways for the location of its facilities.\n(c) \"Cost of relocation\" means the entire amount paid by such utility properly attributable to such relocation after deducting therefrom any increase in the value of the new facility and any salvage value derived from the old facility.\n(d) \"High voltage transmission line\" has the meaning given in section 216E.01, subdivision 4.\nWhenever the commissioner determines that the relocation of any utility facility is necessitated by the construction of a project on the routes of federally aided trunk highways, including urban extensions thereof, that are included within the National System of Interstate Highways, the owner or operator of the utility facility must relocate the utility facility in accordance with the order of the commissioner. Except as provided in section 161.45, subdivision 6, paragraph (d), or 7, upon the completion of relocation of a utility facility, the cost of relocation must be ascertained and paid out of the trunk highway fund by the commissioner, provided the amount paid by the commissioner for reimbursement to a utility does not exceed the amount on which the federal government bases its reimbursement for the interstate highway system.\nThe commissioner may enter into agreements with a utility for the relocation of utility facilities providing for the payment by the state of a lump sum based on the estimated cost of relocation when the lump sum so agreed upon does not exceed $100,000.\nWhen the project requires a utility to relinquish lands or interests in lands owned by the utility and the utility is unable to acquire lands or interests in lands necessary to enable it to relocate its facilities, or if the acquisition of the lands or interests in lands by the utility would result in undue delay thereby delaying the interstate highway project, the commissioner, by purchase, gift, or eminent domain proceedings, may acquire the lands or interests in lands necessary for the relocation if the commissioner deems that the acquisition would reduce the cost to the state of the project. The lands necessary for the relocation to be acquired by the commissioner must be designated in an agreement between the utility and the commissioner. The agreement must also provide that without cost to either party to the agreement, the utility will relinquish to the state its interests in the lands required for the interstate project in consideration of the conveyance by the state to the utility of the substitute lands designated in the agreement to be acquired by the state. The interest or estate acquired by the commissioner must be substantially similar to the interest or estate that the utility owned in the lands to be relinquished by it to the state. The commissioner may convey the lands or interests in lands to the utility.\nThe relocation work may be made a part of a state highway construction contract or let as a separate contract by the state under applicable federal laws, rules and regulations if the owner or operator of the utility facility requests the commissioner to act as its agent for the purpose of relocating such facilities and if such action is deemed to be in the best interest of the state. When relocation work is made a part of a state highway construction contract or when let as a separate contract by the state as authorized herein, the cost of such relocation may be paid by the commissioner directly to the contractor out of the trunk highway fund without requiring the utility to first make payment for such relocation work and thereafter request reimbursement therefor; provided that, the agreement entered into between the state and the utility shall contain a stipulation that the utility shall reimburse the state for any costs of such relocation in which the federal government will not participate.",
	"repealed": false
}