{
	"id": "115A.952",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.952",
	"title": "115A.952 RETAIL SALE OF PROBLEM MATERIALS; UNIFORM LABELING AND CONSUMER INFORMATION.",
	"text": "The agency may adopt rules to identify products that are used primarily for personal, family, or household purposes and that constitute a problem material or contain a problem material as defined in section 115A.03, subdivision 24e. The rules may also prescribe a uniform label to be affixed by retailers of identified products as provided in subdivision 4. Packaging that is recyclable or made from recycled material shall not constitute a problem material.\nThe commissioner of agriculture may adopt rules to provide consumer information and retail handling practices for pesticides, as defined in section 18B.01, subdivision 18; fertilizers, plant amendments, and soil amendments, as defined in section 18C.005, subdivisions 11, 25, and 33; and wood preservatives.\nThe agency and the commissioner of agriculture shall prepare and the agency shall supply to retailers, without charge to the retailers, the labels and informational materials required to comply with subdivision 4. Informational materials must include specific instructions on environmentally sound ways to use identified products and to handle them when the products or their containers are discarded.\nA person who sells or offers for sale at retail any product that is identified pursuant to rules of the agency adopted under subdivision 1 or under rules of the commissioner of agriculture under subdivision 2 shall:\n(1) affix a uniform label as prescribed by the rules in a prominent location upon or near the display area of the product. If the adjacent display area is a shelf, the label shall be affixed to the price information for the product on the shelf;\n(2) maintain and prominently display informational materials supplied by the agency at the location where identified products covered by the materials are sold or offered for sale; and\n(3) comply with the handling practices required under subdivision 2.",
	"repealed": false
}