{
	"id": "41B.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.036",
	"title": "41B.036 GENERAL POWERS OF THE AUTHORITY.",
	"text": "For the purpose of exercising the specific powers granted in section 41B.04 and effectuating the other purposes of sections 41B.01 to 41B.23 the authority has the general powers granted in this section.\n(a) It may sue and be sued.\n(b) It may have a seal and alter the seal.\n(c) It may make, and from time to time, amend and repeal rules consistent with sections 41B.01 to 41B.23.\n(d) It may acquire, hold, and dispose of real or personal property for its corporate purposes.\n(e) It may enter into agreements, contracts, or other transactions with any federal or state agency, any person and any domestic or foreign partnership, corporation, association, or organization, including contracts or agreements for administration and implementation of all or part of sections 41B.01 to 41B.23.\n(f) It may acquire real property, or an interest therein, in its own name, by purchase or foreclosure, where such acquisition is necessary or appropriate.\n(g) It may provide general technical services related to rural finance.\n(h) It may provide general consultative assistance services related to rural finance.\n(i) It may promote research and development in matters related to rural finance.\n(j) It may enter into agreements with lenders, borrowers, or the issuers of securities for the purpose of regulating the development and management of farms financed in whole or in part by the proceeds of qualified agricultural loans.\n(k) It may enter into agreements with other appropriate federal, state, or local governmental units to foster rural finance. It may give advance reservations of loan financing as part of the agreements, with the understanding that the authority will only approve the loans pursuant to normal procedures, and may adopt special procedures designed to meet problems inherent in such programs.\n(l) It may undertake and carry out studies and analyses of rural financing needs within the state and ways of meeting such needs including: data with respect to geographical distribution; farm size; the distribution of farm credit needs according to debt ratios and similar factors; the amount and quality of available financing and its distribution according to factors affecting rural financing needs and the meeting thereof; and may make the results of such studies and analyses available to the public and may engage in research and disseminate information on rural finance.\n(m) It may survey and investigate the rural financing needs throughout the state and make recommendations to the governor and the legislature as to legislation and other measures necessary or advisable to alleviate any existing shortage in the state.\n(n) It may establish cooperative relationships with such county and multicounty authorities as may be established and may develop priorities for the utilization of authority resources and assistance within a region in cooperation with county and multicounty authorities.\n(o) It may contract with, use, or employ any federal, state, regional, or local public or private agency or organization, legal counsel, financial advisors, investment bankers or others, upon terms it deems necessary or desirable, to assist in the exercise of any of the powers granted in sections 41B.01 to 41B.23 and to carry out the objectives of sections 41B.01 to 41B.23 and may pay for the services from authority funds.\n(p) It may establish cooperative relationships with counties to develop priorities for the use of authority resources and assistance within counties and to consider county plans and programs in the process of setting the priorities.\n(q) It may delegate any of its powers to its officers or staff.\n(r) It may enter into agreements with qualified agricultural lenders or others insuring or guaranteeing to the state the payment of all or a portion of qualified agricultural loans.\n(s) It may enter into agreements with eligible agricultural lenders providing for advance reservations of purchases of participation interests in restructuring loans, if the agreements provide that the authority may only purchase participation interests in restructuring loans under the normal procedure. The authority may provide in an agreement for special procedures or requirements designed to meet specific conditions or requirements.\n(t) It may allow farmers who are natural persons to combine programs of the federal Agriculture Credit Act of 1987 with programs of the Rural Finance Authority.\n(u) From within available funds generated by program fees, it may provide partial or full tuition assistance for farm management programs required under section 41B.03, subdivision 3, clause (7).\n(v) It may accept for and on behalf of the state any gift, bequest, devise, grant, or interest in money or personal property of any kind tendered to the state for any purpose pertaining to the activities of the authority.",
	"repealed": false
}