{
	"id": "245G.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.05",
	"title": "245G.05 COMPREHENSIVE ASSESSMENT AND ASSESSMENT SUMMARY.",
	"text": "A comprehensive assessment of the client's substance use disorder must be administered face-to-face by an alcohol and drug counselor within five calendar days from the day of service initiation for a residential program or by the end of the fifth day on which a treatment service is provided in a nonresidential program. The number of days to complete the comprehensive assessment excludes the day of service initiation. If the comprehensive assessment is not completed within the required time frame, the person-centered reason for the delay and the planned completion date must be documented in the client's file. The comprehensive assessment is complete upon a qualified staff member's dated signature. If the client received a comprehensive assessment that authorized the treatment service, an alcohol and drug counselor may use the comprehensive assessment for requirements of this subdivision but must document a review of the comprehensive assessment and update the comprehensive assessment as clinically necessary to ensure compliance with this subdivision within applicable timelines. An alcohol and drug counselor must sign and date the comprehensive assessment review and update.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63; 2023 c 61 art 4 s 28]\nA comprehensive assessment must meet the requirements under section 245I.10, subdivision 6, paragraphs (b) and (c). It must also include:\n(1) a diagnosis of a substance use disorder or a finding that the client does not meet the criteria for a substance use disorder;\n(2) a determination of whether the individual screens positive for co-occurring mental health disorders using a screening tool approved by the commissioner pursuant to section 245.4863;\n(3) a risk rating and summary to support the risk ratings within each of the dimensions listed in section 254B.04, subdivision 4; and\n(4) a recommendation for the ASAM level of care identified in section 254B.19, subdivision 1.",
	"repealed": false
}