{
	"id": "349A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/349A.02",
	"title": "349A.02 STATE LOTTERY.",
	"text": "A State Lottery is established under the supervision and control of a director. The director of the State Lottery shall be appointed by the governor with the advice and consent of the senate. The director serves in the unclassified service at the pleasure of the governor. The annual salary rate authorized for the director is established through the process described under section 15A.0815.\nMS 2002 [Repealed, 2004 c 233 s 7]\nIn operating the lottery the director shall exercise the following powers and duties:\n(1) adopt rules and game procedures;\n(2) issue lottery retailer contracts and rule on appeals of decisions relating to those contracts;\n(3) enter into lottery procurement contracts for the provision of goods and services to the lottery;\n(4) employ personnel as are required to operate the lottery;\n(5) enter into written agreements with one or more government-authorized lotteries, or with an organization created and controlled by those lotteries, for the operation, marketing, and promotion of a joint lottery;\n(6) adopt and publish advertising and promotional materials consistent with section 349A.09; and\n(7) take all necessary steps to ensure the integrity of, and public confidence in, the State Lottery.\nThe director may appoint other personnel as necessary to operate the State Lottery in accordance with chapter 43A. At least one position in the lottery must be an attorney position and the director shall employ in that position an attorney to perform legal services for the lottery.\nSubject to the provisions of section 43A.18, subdivision 1, the director may develop and implement a plan for making incentive payments to employees of the lottery whose primary responsibilities are in marketing.\nThe director shall conduct background checks, or request the director of alcohol and gambling enforcement to conduct background checks, on all prospective employees who are finalists, and shall require that all employees of the lottery be fingerprinted. No person may be employed by the lottery who has been convicted of a felony or a crime involving fraud or misrepresentation within five years of starting employment with the lottery, or has ever been convicted of a gambling-related offense. The director has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on employees and prospective employees of the lottery. The director may employ necessary persons pending the completion of a background check.\n(a) The director may request any other department or agency of the state, including the Division of Alcohol and Gambling Enforcement, to provide reasonable assistance to the director in carrying out the director's duties. All provision of services to the director from another state agency, must be by agreement made between the director and the agency. An agreement must include provisions specifying the duration of the services, the assignment of personnel of other agencies to provide the services, the determination of the cost of the services, and the transfer, from the lottery operations account to the agency, of funds sufficient to pay the costs of the services.\n(b) The director may enter into agreements with the commissioner of management and budget for the purpose of making payroll and other financial transactions.\nMS 1994 [Repealed, 1995 c 254 art 1 s 97]",
	"repealed": false
}