{
	"id": "484.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.69",
	"title": "484.69 CHIEF JUDGE.",
	"text": "The judges of the district court resident in each of the judicial districts shall meet and elect from among their number a single chief judge and an assistant chief judge. The chief judge and the assistant chief judge shall serve a term of two years beginning July 1 of the year in which they are elected. No judge may serve as chief judge or assistant chief judge for more than two consecutive two-year terms, except as provided in subdivision 1a. For the term beginning July 1, 1991, and after that, the chief judge and assistant chief judge in the odd-numbered judicial district shall be elected to a term of two years. For the term beginning July 1, 1991, the chief judge and assistant chief judge in the even-numbered judicial districts shall be elected to a term of one year. For the term beginning July 1, 1992, and after that, the chief judge and assistant chief judge in the even-numbered judicial districts shall be elected to a term of two years.\nThe seniority of judges and rotation of the position of chief judge or assistant chief judge shall not be criteria for the election of the chief judge or the assistant chief judge.\nA chief judge or assistant chief judge may be removed for cause as chief judge or assistant chief judge by the chief justice of the supreme court, or by a majority of the judges of the judicial district.\n[Repealed, 2008 c 277 art 1 s 98]\n[Repealed, 1990 c 553 s 15]\nIn each judicial district, the chief judge, subject to the authority of the chief justice, shall exercise general administrative authority over the courts within the judicial district. The chief judge shall make assignments of judges to serve on the courts within the judicial district, and assignments may be made without the consent of the judges affected. The chief judge may assign any judge of any court within the judicial district to hear any matter in any court of the judicial district. When a judge of a court is assigned to another court the judge is vested with the powers of a judge of the court of assignment. A judge may not be assigned to hear matters outside the judge's judicial district pursuant to this subdivision.\nThe chief judges shall meet at least semiannually to consider problems relating to judicial business and administration. After consultation with the judges of their respective districts the chief judges shall prepare in conference and submit to the chief justice of the supreme court a suggested agenda for the judicial conference held pursuant to section 480.18.\nThe chief judge shall convene a conference at least semiannually of all judges of the judicial district to consider administrative matters and rules of court and to provide advice and counsel to the chief judge.",
	"repealed": false
}