{
	"id": "124D.454",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.454",
	"title": "124D.454 ACCESS TO MINNESOTA'S TRANSITION SYSTEM FOR CHILDREN WITH A DISABILITY.",
	"text": "The purpose of this section is to provide a method to fund career and technical education programs for children with a disability that are components of the student's transition plan. As used in this section, the term \"children with a disability\" shall have the meaning ascribed to it in section 125A.02.\nFor the purposes of this section, the definitions in this subdivision apply.\n(a) \"Basic revenue\" has the meaning given it in section 126C.10, subdivision 2. For the purposes of computing basic revenue pursuant to this section, each child with a disability shall be counted as prescribed in section 126C.05, subdivision 1.\n(b) \"Essential personnel\" means a licensed teacher, licensed support services staff person, paraprofessional providing direct services to students, or licensed personnel under subdivision 12. This definition is not intended to change or modify the definition of essential employee in chapter 179A.\n[Repealed, 2013 c 116 art 5 s 32]\n[Repealed, 2007 c 146 art 3 s 25]\n[Repealed, 2007 c 146 art 3 s 25]\n[Repealed, 2007 c 146 art 3 s 25]\n[Repealed, 2007 c 146 art 3 s 25]\nThe aid provided under this section shall be paid only for services rendered or for the costs which are incurred according to this section for transition programs for children with a disability which are approved by the commissioner of education and operated in accordance with rules promulgated by the commissioner. These rules shall be subject to the restrictions provided in subdivision 12. The procedure for application for approval of these programs shall be as provided in section 125A.75, subdivisions 4 and 6, and the application review process shall be conducted by the Division of Federal Programs in the department.\nAll aid pursuant to this section shall be paid to the district or cooperative center providing the services. All aid received by a district or center from any source for transition programs for children with a disability shall be utilized solely for that purpose.\n[Repealed, 2013 c 116 art 5 s 32]\n[Repealed, 2013 c 116 art 5 s 32]\nAid must be paid under this section only for services rendered or for costs incurred in career and technical education programs approved by the commissioner and operated in accordance with rules promulgated by the commissioner. This aid shall be paid only for services rendered and for costs incurred by essential, licensed personnel who meet the requirements for licensure pursuant to the rules of the Professional Educator Licensing and Standards Board. Licensed personnel means persons holding a valid career and technical license issued by the Professional Educator Licensing and Standards Board under sections 122A.15 to 122A.33. If an average of five or fewer secondary full-time equivalent students are enrolled per teacher in an approved postsecondary program at Intermediate District No. 287, 916, or 917, licensed personnel means persons holding a valid vocational license issued by the commissioner or the Board of Trustees of the Minnesota State Colleges and Universities. Notwithstanding section 127A.42, the commissioner may modify or withdraw the program or aid approval and withhold aid under this section without proceeding under section 127A.42 at any time. To do so, the commissioner must determine that the program does not comply with rules of the Department of Education or that any facts concerning the program or its budget differ from the facts in the district's approved application.",
	"repealed": false
}