{
	"id": "82.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.75",
	"title": "82.75 TRUST ACCOUNT REQUIREMENTS.",
	"text": "All trust funds received by a broker or the broker's salespeople or closing agents shall be deposited, as provided in subdivision 5, in a trust account, maintained by the broker for such purpose in a bank, savings association, credit union, or an industrial loan and thrift company with deposit liabilities designated by the broker or closing agent, except as such money may be paid to one of the parties pursuant to express written agreement between the parties to a transaction. The depository bank shall be a Minnesota bank or trust company or any foreign bank and shall authorize the commissioner to examine its records of such deposits upon demand by the commissioner. The industrial loan and thrift company shall be organized under chapter 53. The savings association or credit union shall be organized under the laws of any state or the United States.\nA licensee acting in the capacity of principal in a real estate transaction where the seller retains any liability, contingent or otherwise, for the payment of an obligation on the property shall deposit in a Minnesota bank or trust company, any foreign bank which authorizes the commissioner to examine its records of the deposits, a savings association, credit union, or an industrial loan and thrift company organized under chapter 53 with deposit liabilities, in a trust account, those parts of all payments received on contracts that are necessary to meet any amounts concurrently due and payable on any existing mortgages, contracts for deed or other conveyancing instruments, and reserve for taxes and insurance or any other encumbrance on the receipts. The deposits must be maintained until disbursement is made under the terms of the encumbrance and proper accounting on the property made to the parties entitled to an accounting. The provisions of this subdivision relating to rental of interests in real estate apply only to residential property, except as provided in section 82.73, subdivision 3, paragraph (e).\nIn the event earnest money or other down payments in a real estate transaction are received by the broker or salesperson in the form of a nondepositable item such as a note, bond, stock certificate, treasury bill, or any other instrument or equity or thing of value received by a broker, salesperson, or closing agent received in lieu of cash shall be deposited immediately with an authorized escrow agent, whose authority is evidenced by a written agreement executed by the offeror and the escrow agent. A receipt shall be issued to the buyer for the value of the nondepositable item.\nIn the event the broker acts as the escrow agent, the broker shall obtain written authority from the buyer and seller to hold such items in escrow. In all cases, the parties shall be advised of the details relative to the nondepositable item, including the nature of the item, the amount, and in whose custody such item is being held. The fact that such an item is being held by the broker shall be duly recorded in the broker's trust account records.\nA broker, salesperson, or closing agent shall deposit only trust funds in a trust account and shall not commingle personal funds or other funds in a trust account, except that a broker, salesperson, or closing agent may deposit and maintain a sum in a trust account from personal funds, which sum shall be specifically identified and used to pay service charges or satisfy the minimum balance requirements relating to the trust account.\n(a) Each broker or closing agent shall maintain and retain records of all trust funds and trust accounts. The commissioner may prescribe information to be included in the records by appropriate rules.\n(b) Unless otherwise agreed upon in writing by the parties to a transaction, the broker with whom trust funds are to be deposited shall be the listing broker.\n(c) Earnest money received from a potential buyer shall be deposited into the listing broker's trust account pursuant to the terms of a written agreement between the parties. If the written agreement between the parties is silent as to the timing of the deposit of earnest money, the listing broker shall deposit the earnest money within three business days of either receipt of the earnest money or final acceptance of the purchase agreement, whichever is later. If the offer is rejected, the earnest money shall be returned to the potential buyer not later than the next business day after rejection.\n(d) Trust funds must be maintained in a trust account until disbursement is made in accordance with this section and proper accounting is made to the parties entitled to an accounting.\nTrust funds may only be disbursed upon the occurrence of one of the following:\n(1) a closing of the transaction;\n(2) written agreement between the parties;\n(3) pursuant to an affidavit as required in section 559.217; or\n(4) a court order.\nDisbursement must be made within ten business days following the consummation or termination of a transaction if the applicable agreements are silent as to the time of disbursement.\nThe names of the banks, savings associations, credit unions, and industrial loan and thrift companies and the trust account numbers used by a broker or closing agent shall be provided to the commissioner at the time of application for the broker's or closing agent's license. The broker shall immediately report to the commissioner any change of trust account status including changes in banks, savings associations, credit unions, and industrial loan and thrift companies, account numbers, or additional accounts in the same or other banks, savings associations, credit unions, and industrial loan and thrift companies. A broker or closing agent shall not close an existing trust account without giving ten days' written notice to the commissioner.\nNotwithstanding the provisions of this chapter, a real estate broker may establish and maintain interest bearing accounts for the purpose of receiving deposits in accordance with the provisions of section 504B.178.\n(a) Each broker shall maintain a pooled interest-bearing trust account for deposit of client funds. The interest accruing on the trust account, less reasonable transaction costs, must be paid to the Minnesota Housing Finance Agency for deposit in the housing trust fund account created under section 462A.201 unless otherwise specified pursuant to an expressed written agreement between the parties to a transaction.\n(b) For an account created under paragraph (a), each broker shall direct the financial institution to:\n(1) pay the interest, less reasonable transaction costs, computed in accordance with the financial institution's standard accounting practice, at least quarterly, to the Minnesota Housing Finance Agency; and\n(2) send a statement to the Minnesota Housing Finance Agency showing the name of the broker for whom the payment is made, the rate of interest applied, the amount of service charges deducted, and the account balance for the period in which the report is made.\nThe Minnesota Housing Finance Agency shall credit the amount collected under this subdivision to the housing trust fund account established in section 462A.201.\n(c) The financial institution must promptly notify the agency if a draft drawn on the account is dishonored. A draft is not dishonored if a stop payment order is requested by an issuer who has a good faith defense to payment on the draft.\nTrust funds may be placed by the broker in a special account which may be an interest-bearing account or certificate of deposit if the buyer and the seller consent in writing to the special account and to the disposition of the trust funds, including any interest thereon.\nFunds which would constitute trust funds if received by a licensee acting as an agent must, if received by a licensee acting as principal, be placed in a trust account unless a written agreement signed by all parties to the transaction specifies a different disposition of the funds. The written agreement shall state that the funds would otherwise be placed in a real estate trust account.\n(a) Every broker shall keep a record of all trust funds received, including notes, savings certificates, uncashed or uncollected checks, or other similar instruments. Said records shall set forth:\n(1) date funds received;\n(2) from whom received;\n(3) amount received;\n(4) with respect to funds deposited in a trust account, the date of said deposit;\n(5) with respect to funds previously deposited in a trust account, the check number or date of related disbursements; and\n(6) a monthly balance of the trust account.\nEach broker shall maintain a formal trust cash receipts journal and a formal cash disbursement journal, or similar records, in accordance with generally accepted accounting principles. All records and funds shall be subject to inspection by the commissioner or an agent of the commissioner at any time.\n(b) Each broker shall keep a separate record for each beneficiary or transaction, accounting for all funds therein which have been deposited in the broker's trust bank account. These records shall set forth information sufficient to identify the transaction and the parties thereto. At a minimum, each record shall set forth:\n(1) the date funds are deposited;\n(2) the amount deposited;\n(3) the date of each related disbursement;\n(4) the check number of each related disbursement;\n(5) the amount of each related disbursement; and\n(6) a description of each disbursement.",
	"repealed": false
}