{
	"id": "16B.276",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.276",
	"title": "16B.276 CAPITOL FLAG PROGRAM.",
	"text": "(a) The terms used in this section have the meanings given them.\n(b) \"Active service\" has the meaning given in section 190.05, subdivision 5.\n(c) \"Eligible family member\" means a surviving spouse, parent or legal guardian, child, or sibling of (1) a public safety officer killed in the line of duty, or (2) a person who has died while serving honorably in active service in the United States armed forces. For purposes of this section, an eligibility relationship may be established by birth or adoption.\n(d) \"Killed in the line of duty\" has the meaning given in section 299A.41, subdivision 3.\n(e) \"Public safety officer\" has the meaning given in section 299A.41, subdivision 4.\nA Capitol flag program is established. The purpose of the program is to make a Minnesota state flag and an American flag that were flown over the Minnesota State Capitol available to the family members of a public safety officer killed in the line of duty or a member of the United States armed forces who died while in active service. In addition to appropriations provided by law, the commissioner of management and budget may receive gifts to support the program as authorized in sections 16A.013 to 16A.016. The program established by this section is required only to the extent that sufficient funds are available through appropriations or gifts to support its operations.\n(a) A flag request may only be made by a legislator or state constitutional officer on behalf of an eligible family member after verification of the family member's eligibility under the procedures adopted under subdivision 4. The request must be made to the commissioner of administration, and must indicate the type of flag requested, a certification that the family member's eligibility has been verified, special requests for the date the flag is requested to be flown over the Capitol, and the method of presentment. The commissioner may adopt a form to be used for this purpose. With at least 30 days' notice, the commissioner must honor a request that a flag be flown on a specific commemorative date.\n(b) Upon receipt of a request, the commissioner shall deliver the requested flags to the requesting legislator or constitutional officer for coordination of a later presentment ceremony. If relevant information is made available, the commissioner shall provide a certificate memorializing the details of the occasion and the date the flag was flown with each flag presented.\nThe house of representatives, the senate, and each constitutional officer must adopt procedures for the administration of flag requests received from eligible family members, including a procedure for verification of a family member's eligibility to receive a flag.\n(a) For deaths that occur on or after August 1, 2021, the family of a public safety officer killed in the line of duty or service member of the United States armed forces who died in active service is entitled to receive one United States flag and one Minnesota state flag free of charge under this section. If multiple flags of the same type are requested to be flown in honor of the same decedent, the commissioner may charge a reasonable fee that does not exceed the actual cost of flying each flag and preparing a certificate memorializing the occasion.\n(b) For deaths that occurred before August 1, 2021, the family of a public safety officer killed in the line of duty or service member of the United States armed forces who died in active service may receive a Minnesota state flag and a United States flag for a fee, unless there are donated, nonstate funds available to provide a flag without a fee. If payment of a fee is required under this paragraph, the commissioner may charge an eligible family an amount that does not exceed the actual cost of flying each flag and preparing a certificate memorializing the occasion.",
	"repealed": false
}