{
	"id": "340A.4042",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.4042",
	"title": "340A.4042 WINE OR MALT LIQUOR EDUCATOR; ON-SALE LICENSE.",
	"text": "The commissioner may issue an on-sale license to a person meeting the requirements specified in sections 340A.402 and 340A.409, at an annual cost of $250 per license to a wine educator and $50 per permit for each employee of the wine educator that will be pouring wine, under the following conditions:\n(1) the license may be used to purchase wine at retail and serve wine for educational purposes in any part of the state, unless a political subdivision adopts an ordinance prohibiting wine education;\n(2) all events conducted pursuant to this license must be conducted through advance registration, and no walk-in access to the general public is permitted;\n(3) licensees must possess certification that is satisfactory to the commissioner, including, but not limited to, a certified specialist of wine or certified wine educator status as conferred by the Society of Wine Educators, a Wine and Spirits Education Trust Diploma, status as a certified sommelier, or the completion of a wine industry program at a technical college or culinary school. A wine educator must also complete Training for Intervention Procedures (TIPS) or other certified alcohol training programs and have a valid certificate on file with the commissioner;\n(4) a license holder shall not sell alcohol for off-premises consumption and no orders may be taken for future sales;\n(5) classes shall not be conducted at retail businesses that do not have a liquor license during business hours; and\n(6) prior to providing a class authorized under this section, the licensee shall notify the police chief of the city where the class will take place, if the event will take place within the corporate limits of a city. If the city has no police department, the licensee shall notify the city's clerk. If the class will take place outside the corporate limits of any city, the licensee shall notify the sheriff of the county where the class will take place.\nThe commissioner may issue an on-sale license to a person meeting the requirements specified in sections 340A.402 and 340A.409, at an annual cost of $250 per license to a malt liquor educator and $50 per permit for each employee of the malt liquor educator that will be pouring malt liquor, under the following conditions:\n(1) the license may be used to purchase malt liquor at retail and serve malt liquor for educational purposes in any part of the state, unless a political subdivision adopts an ordinance prohibiting malt liquor education;\n(2) all events conducted pursuant to this license must be conducted through advance registration, and no walk-in access to the general public is permitted;\n(3) licensees must possess certification that is satisfactory to the commissioner, including, but not limited to, certification as a cicerone, completion of coursework from the Master Brewers Association of the Americas, or other brewer or brewing certification program acceptable to the commissioner. A malt liquor educator must also complete Training for Intervention Procedures (TIPS) or other certified alcohol training programs and have a valid certificate on file with the commissioner;\n(4) a license holder shall not sell alcohol for off-premises consumption and no orders may be taken for future sales;\n(5) classes shall not be conducted at retail businesses that do not have a liquor license during business hours; and\n(6) prior to providing a class authorized under this section, the licensee shall notify the police chief of the city where the class will take place, if the event will take place within the corporate limits of a city. If the city has no police department, the licensee shall notify the city's clerk. If the class will take place outside the corporate limits of any city, the licensee shall notify the sheriff of the county where the class will take place.",
	"repealed": false
}