{
	"id": "72B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.06",
	"title": "72B.06 CATASTROPHE OR EMERGENCY SITUATIONS.",
	"text": "(a) For purposes of this chapter, a catastrophe exists when, due to a specific, infrequent, and sudden natural or man-made disaster or phenomenon, there have arisen losses to property in Minnesota that are covered by insurance, and the losses are so numerous and severe that resolution of claims related to such covered property losses will not occur expeditiously without the licensing of emergency independent adjusters due to the magnitude of the catastrophic damage. A failure of claims to be resolved expeditiously shall exist upon an insurer's filing with the department a written statement that one of the following conditions exists: (1) the insurer expects to incur at least 500 claims as a result of the event; or (2) the magnitude of the event is expected to generate twice the mean number of claims for one month for the affected area. Such written statement may be sent electronically to the commissioner. An insurer must notify the commissioner via registration of each independent adjuster not already licensed in Minnesota, that will act as an emergency independent adjuster on behalf of the insurer pursuant to paragraph (b).\n(b) A person who is otherwise qualified to adjust claims, but not already licensed in Minnesota, may act as an emergency independent adjuster and adjust claims, if, within five days of deployment to adjust claims arising from the catastrophe, the insurer or the independent adjuster's employer, in the notification required by paragraph (a), notifies the commissioner by providing the following information in a format prescribed by the commissioner:\n(1) the name of the individual;\n(2) the Social Security number of the individual;\n(3) the name of the insurer the independent adjuster will represent;\n(4) the effective date of the contract between the insurer and independent adjuster or the independent adjuster's employer;\n(5) the catastrophe loss control number;\n(6) the catastrophe name; and\n(7) other information the commissioner deems necessary.\n(c) An emergency independent adjuster's license or registration remains in force for 180 days; such license or registration shall be effective for all catastrophes described in paragraph (a), clauses (1) and (2). Such license or registration may be extended for 180 days.\nThe commissioner may summarily suspend or revoke the right of any person adjusting in this state under the authority of this section to continue to adjust in this state, if the commissioner finds that that person has engaged in any of the practices forbidden to a licensed adjuster under sections 72B.01 to 72B.136. Notice of such suspension or revocation may be given personally or by mail sent to the temporary address stated in the registration and to the insurer or independent adjusting company who submitted the independent adjuster information.",
	"repealed": false
}