{
	"id": "62Q.735",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.735",
	"title": "62Q.735 PROVIDER CONTRACTING PROCEDURES.",
	"text": "(a) Before requiring a health care provider to sign a contract, a health plan company shall give to the provider a complete copy of the proposed contract, including:\n(1) all attachments and exhibits;\n(2) operating manuals;\n(3) a general description of the health plan company's health service coding guidelines and requirement for procedures and diagnoses with modifiers, and multiple procedures; and\n(4) all guidelines and treatment parameters incorporated or referenced in the contract.\n(b) The health plan company shall make available to the provider the fee schedule or a method or process that allows the provider to determine the fee schedule for each health care service to be provided under the contract.\n(c) Nothing in this section requires a dental plan organization to disclose the plan's aggregate maximum allowable fee table used to determine other providers' fees. The contracted provider must not release this information in any way that would violate any state or federal antitrust law.\n(a) Any amendment or change in the terms of an existing contract between a health plan company and a provider must be disclosed to the provider at least 45 days prior to the effective date of the proposed change, with the exception of amendments required of the health plan company by law or governmental regulatory authority, when notice shall be given to the provider when the requirement is made known to the health plan company.\n(b) Any amendment or change in the contract that alters the fee schedule or materially alters the written contractual policies and procedures governing the relationship between the provider and the health plan company must be disclosed to the provider not less than 45 days before the effective date of the proposed change and the provider must have the opportunity to terminate the contract before the amendment or change is deemed to be in effect.\n(c) By mutual consent, evidenced in writing in amendments separate from the base contract and not contingent on participation, the parties may waive the disclosure requirements under paragraphs (a) and (b).\n(d) Notwithstanding paragraphs (a) and (b), the effective date of contract termination shall comply with the terms of the contract when a provider terminates a contract.\n(a) Any amendment or change in the terms of an existing contract between a network organization and a hospital, ambulatory surgical center, or freestanding emergency room must be disclosed to that provider.\n(b) Any amendment or change in the contract that alters the financial reimbursement or alters the written contractual policies and procedures governing the relationship between the hospital, ambulatory surgical center, or freestanding emergency room and the network organization must be disclosed to that provider before the amendment or change is deemed to be in effect.\n(c) For purposes of this subdivision, \"network organization\" means a preferred provider organization, as defined in section 145.61, subdivision 4c; a managed care organization, as defined in section 62Q.01, subdivision 5; or other entity that uses or consists of a network of health care providers.\n(a) A health plan company shall not require a provider to provide notice of intention to terminate its contract before communicating with the provider regarding contract renewals. A health plan company shall not communicate with enrollees about the possible termination until final termination notice is received from the provider.\n(b) A health plan company shall not preclude a nonnetwork provider from subsequent network participation solely as a result of the provider having terminated its participation in accordance with the terms of its contract.\nA health plan company shall provide, upon request, any additional fees or fee schedules relevant to the particular provider's practice beyond those provided with the renewal documents for the next contract year to all participating providers, excluding claims paid under the pharmacy benefit. Health plan companies may fulfill the requirements of this section by making the full fee schedules available through a secure web portal for contracted providers.\nWhere health plan company reimbursement is related to tiering of providers, the health plan company shall provide to any tiered providers upon request an explanation of the methodology used to calculate tier ranking, including information on cost and quality. This explanation need not allow any provider access to proprietary or trade secret information. When a tiered product is used by a health plan, the health plan company shall provide notification to the provider of the tier in which the provider is included prior to the effective date of the tiered product.",
	"repealed": false
}