{
	"id": "80A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.51",
	"title": "80A.51 SECTION 303; SECURITIES REGISTRATION BY COORDINATION.",
	"text": "(a) Registration permitted. A security for which a registration statement has been filed under the Securities Act of 1933 in connection with the same offering may be registered by coordination under this section.\n(b) Required records. A registration statement and accompanying records under this section must contain or be accompanied by the following records in addition to the information specified in section 80A.53 and a consent to service of process complying with section 80A.88:\n(1) a copy of the latest form of prospectus filed under the Securities Act of 1933;\n(2) a copy of the articles of incorporation and bylaws or their substantial equivalents currently in effect; a copy of any agreement with or among underwriters; a copy of any indenture or other instrument governing the issuance of the security to be registered; and a specimen, copy, or description of the security that is required by rule adopted or order issued under this chapter;\n(3) copies of any other information or any other records filed by the issuer under the Securities Act of 1933 requested by the administrator; and\n(4) an undertaking to forward each amendment to the federal prospectus, other than an amendment that delays the effective date of the registration statement, promptly after it is filed with the Securities and Exchange Commission.\n(c) Conditions for effectiveness of registration statement. A registration statement under this section becomes effective simultaneously with or subsequent to the federal registration statement when all of the following conditions are satisfied:\n(1) a stop order under subsection (d) or section 80A.54 or issued by the Securities and Exchange Commission is not in effect and a proceeding is not pending against the issuer under section 80A.54; and\n(2) the registration statement has been on file for at least 20 days or a shorter period provided by rule adopted or order issued under this chapter.\n(d) Notice of federal registration statement effectiveness. The registrant shall promptly notify the administrator in a record of the date when the federal registration statement becomes effective and the content of any price amendment and shall promptly file a record containing the price amendment. If the notice is not timely received, the administrator may issue a stop order, without prior notice or hearing, retroactively denying effectiveness to the registration statement or suspending its effectiveness until compliance with this section. The administrator shall promptly notify the registrant of an order by telegram, telephone, or electronic means and promptly confirm this notice by a record. If the registrant subsequently complies with the notice requirement of this section, the stop order is void as of the date of its issuance.\n(e) Effectiveness of registration statement. If the federal registration statement becomes effective before each of the conditions in this section is satisfied or is waived by the administrator, the registration statement is automatically effective under this chapter when all the conditions are satisfied or waived. If the registrant notifies the administrator of the date when the federal registration statement is expected to become effective, the administrator shall promptly notify the registrant by telegram, telephone, or electronic means and promptly confirm this notice by a record, indicating whether all the conditions are satisfied or waived and whether the administrator intends the institution of a proceeding under section 80A.54. The notice by the administrator does not preclude the institution of such a proceeding.",
	"repealed": false
}