{
	"id": "9.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/9.061",
	"title": "9.061 ADDITIONAL POWERS; EMERGENCIES.",
	"text": "The Executive Council may:\n(1) take such measures as are necessary to prevent an impending disaster that threatens to destroy life or property;\n(2) grant relief to communities stricken by disease, fire, action of the elements, or extreme economic distress;\n(3) prevent the occurrence or spread of any disaster;\n(4) grant relief to individuals or families adversely affected by a major disaster in conformance with federal disaster relief laws and regulations. Any grants made shall be refunded to the state if the financial assistance needed is received from any other source; and\n(5) repair state property damaged by a major disaster in conformance with federal disaster relief laws and regulations.\nIn these emergencies, the Executive Council may, when necessary, commandeer and use any property, vehicle, means of transportation, means of communication, or public service. The owner of any property taken shall be given a receipt for the property and be paid for its use and for any damages inflicted upon the property while in the service of the Executive Council.\nWhen necessary to grant relief or to prevent disaster, the Executive Council may use any of the facilities or offices of the state, may command the services of any state military organization, the services of the forces of the state fire marshal or any state department, and the services of employees of the state. These employees shall serve without additional pay, but all proper and necessary expenses incurred while in the performance of duty shall be paid out of funds provided in this section. Members of any state military organization shall be paid for their services while on duty as provided by the Military Code upon warrants drawn by the adjutant general.\nWhen an emergency exists and the attorney general certifies that money is needed, the Executive Council shall furnish the requested money from funds provided by this section.\nThe Executive Council shall transmit to the legislature a detailed report of all its expenses and all money paid out not later than March first of each year in which there is a regular session. It shall transmit information and make recommendations to assist the legislature in the enactment of legislation to prevent calamities.\nWhere an emergency exists the Executive Council may expend money as necessary therefor within the limit of appropriations made to the council for this purpose.\n[Repealed, 1965 c 830 s 2]\n[Repealed, 1965 c 830 s 2]\n[Repealed, 1965 c 830 s 2]\n[Repealed, 1965 c 830 s 2]\n[Repealed, 1965 c 830 s 2]",
	"repealed": false
}