{
	"id": "256B.0621",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0621",
	"title": "256B.0621 COVERED SERVICES: TARGETED CASE MANAGEMENT SERVICES.",
	"text": "[Repealed, 2002 c 375 art 2 s 56]\nFor purposes of subdivisions 3 to 10, the following terms have the meanings given them:\n(1) \"home care service recipients\" means those individuals receiving the following services under sections 256B.0651 to 256B.0654 and 256B.0659: skilled nursing visits, home health aide visits, home care nursing, personal care assistants, or therapies provided through a home health agency;\n(2) \"home care targeted case management\" means the provision of targeted case management services for the purpose of assisting home care service recipients to gain access to needed services and supports so that they may remain in the community;\n(3) \"institutions\" means hospitals, consistent with Code of Federal Regulations, title 42, section 440.10; regional treatment center inpatient services, consistent with section 246C.12; nursing facilities; and intermediate care facilities for persons with developmental disabilities;\n(4) \"relocation targeted case management\" includes the provision of both county targeted case management and public or private vendor service coordination services for the purpose of assisting recipients to gain access to needed services and supports if they choose to move from an institution to the community. Relocation targeted case management may be provided during the lesser of:\n(i) the last 180 consecutive days of an eligible recipient's institutional stay; or\n(ii) the limits and conditions which apply to federal Medicaid funding for this service; and\n(5) \"targeted case management\" means case management services provided to help recipients gain access to needed medical, social, educational, and other services and supports.\nThe following persons are eligible for relocation targeted case management or home care targeted case management:\n(1) medical assistance eligible persons residing in institutions who choose to move into the community are eligible for relocation targeted case management services; and\n(2) medical assistance eligible persons receiving home care services, who are not eligible for any other medical assistance reimbursable case management service, are eligible for home care targeted case management services beginning July 1, 2005.\n(a) A relocation targeted county case management provider is an enrolled medical assistance provider who is determined by the commissioner to have all of the following characteristics:\n(1) the legal authority to provide public welfare under sections 393.01, subdivision 7; and 393.07; or a federally recognized Indian tribe;\n(2) the demonstrated capacity and experience to provide the components of case management to coordinate and link community resources needed by the eligible population;\n(3) the administrative capacity and experience to serve the target population for whom it will provide services and ensure quality of services under state and federal requirements;\n(4) the legal authority to provide complete investigative and protective services under section 260E.14; and child welfare and foster care services under section 393.07, subdivisions 1 and 2; or a federally recognized Indian tribe;\n(5) a financial management system that provides accurate documentation of services and costs under state and federal requirements; and\n(6) the capacity to document and maintain individual case records under state and federal requirements.\n(b) A provider of targeted case management under section 256B.0625, subdivision 20, may be deemed a certified provider of relocation targeted case management.\n(c) A relocation targeted county case management provider may subcontract with another provider to deliver relocation targeted case management services. Subcontracted providers must demonstrate the ability to provide the services outlined in subdivision 6, and have a procedure in place that notifies the recipient and the recipient's legal representative of any conflict of interest if the contracted targeted case management provider also provides, or will provide, the recipient's services and supports. Counties must require that contracted providers must provide information on all conflicts of interest and obtain the recipient's informed consent or provide the recipient with alternatives.\nProviders of home care targeted case management and relocation service coordination must meet the qualifications under subdivision 4 for county vendors or the qualifications and certification standards under paragraphs (a) and (b) for private vendors.\n(a) The commissioner must certify each provider of home care targeted case management and relocation service coordination before enrollment. The certification process shall examine the provider's ability to meet the requirements in this subdivision and other state and federal requirements of this service.\n(b) Both home care targeted case management providers and relocation service coordination providers are enrolled medical assistance providers who have a minimum of a bachelor's degree or a license in a health or human services field, comparable training and two years of experience in human services, or who have been credentialed by an American Indian tribe under section 256B.02, subdivision 7, and have been determined by the commissioner to have all of the following characteristics:\n(1) the demonstrated capacity and experience to provide the components of case management to coordinate and link community resources needed by the eligible population;\n(2) the administrative capacity and experience to serve the target population for whom it will provide services and ensure quality of services under state and federal requirements;\n(3) a financial management system that provides accurate documentation of services and costs under state and federal requirements;\n(4) the capacity to document and maintain individual case records under state and federal requirements;\n(5) the capacity to coordinate with county administrative functions;\n(6) have no financial interest in the provision of out-of-home residential services to persons for whom home care targeted case management or relocation service coordination is provided; and\n(7) if a provider has a financial interest in services other than out-of-home residential services provided to persons for whom home care targeted case management or relocation service coordination is also provided, the county must determine each year that:\n(i) any possible conflict of interest is explained annually at a face-to-face meeting and in writing and the person provides written informed consent consistent with section 256B.77, subdivision 2, paragraph (p); and\n(ii) information on a range of other feasible service provider options has been provided.\n(c) The state of Minnesota, a county board, or agency acting on behalf of a county board shall not be liable for damages, injuries, or liabilities sustained because of services provided to a client by a private service coordination vendor.\n(a) Services eligible for medical assistance reimbursement as targeted case management include:\n(1) assessment of the recipient's need for targeted case management services and for persons choosing to relocate, the county must provide service coordination provider options at the first contact and upon request;\n(2) development, completion, and regular review of a written individual service plan, which is based upon the assessment of the recipient's needs and choices, and which will ensure access to medical, social, educational, and other related services and supports;\n(3) routine contact or communication with the recipient, recipient's family, primary caregiver, legal representative, substitute care provider, service providers, or other relevant persons identified as necessary to the development or implementation of the goals of the individual service plan;\n(4) coordinating referrals for, and the provision of, case management services for the recipient with appropriate service providers, consistent with section 1902(a)(23) of the Social Security Act;\n(5) coordinating and monitoring the overall service delivery and engaging in advocacy as needed to ensure quality of services, appropriateness, and continued need;\n(6) completing and maintaining necessary documentation that supports and verifies the activities in this subdivision;\n(7) assisting individuals in order to access needed services, including travel to conduct a visit with the recipient or other relevant person necessary to develop or implement the goals of the individual service plan; and\n(8) coordinating with the institution discharge planner before the recipient's discharge.\n(b) Relocation targeted county case management includes services under paragraph (a), clauses (1), (2), and (4). Relocation service coordination includes services under paragraph (a), clauses (3) and (5) to (8). Home care targeted case management includes services under paragraph (a), clauses (1) to (8).\nThe following time lines must be met for assigning a case manager:\n(a) For relocation targeted case management, an eligible recipient must be assigned a county case manager who visits the person within 20 working days of requesting a case manager from their county of financial responsibility as determined under chapter 256G.\n(1) If a county agency, its contractor, or federally recognized tribe does not provide case management services as required, the recipient may obtain relocation service coordination from a provider qualified under subdivision 5.\n(2) The commissioner may waive the provider requirements in subdivision 4, paragraph (a), clauses (1) and (4), to ensure recipient access to the assistance necessary to move from an institution to the community. The recipient or the recipient's legal guardian shall provide written notice to the county or tribe of the decision to obtain services from an alternative provider.\n(3) Providers of relocation targeted case management enrolled under this subdivision shall:\n(i) meet the provider requirements under subdivision 4 that are not waived by the commissioner;\n(ii) be qualified to provide the services specified in subdivision 6;\n(iii) coordinate efforts with local social service agencies and tribes; and\n(iv) comply with the conflict of interest provisions established under subdivision 4, paragraph (c).\n(4) Local social service agencies and federally recognized tribes shall cooperate with providers certified by the commissioner under this subdivision to facilitate the recipient's successful relocation from an institution to the community.\n(b) For home care targeted case management, an eligible recipient must be assigned a case manager within 20 working days of requesting a case manager from a home care targeted case management provider, as defined in subdivision 5.\nThe commissioner shall evaluate the delivery of targeted case management, including, but not limited to, access to case management services, consumer satisfaction with case management services, and quality of case management services.\nThe case manager must document each face-to-face and telephone contact with the recipient and others involved in the recipient's individual service plan.\nThe commissioner shall set payment rates for targeted case management under this subdivision. Case managers may bill according to the following criteria:\n(1) for relocation targeted case management, case managers may bill for direct case management activities, including face-to-face contact, telephone contact, and interactive video contact as defined in section 256B.0625, subdivision 20b, paragraph (f), in the lesser of:\n(i) 180 days preceding an eligible recipient's discharge from an institution; or\n(ii) the limits and conditions which apply to federal Medicaid funding for this service;\n(2) for home care targeted case management, case managers may bill for direct case management activities, including face-to-face and telephone contacts; and\n(3) billings for targeted case management services under this subdivision shall not duplicate payments made under other program authorities for the same purpose.\nThe commissioner shall establish a process with the Centers for Independent Living that allows a person residing in a Minnesota nursing facility to receive needed information, consultation, and assistance from one of the centers about the available community support options that may enable the person to relocate to the community, if the person: (1) is under the age of 65, (2) has indicated a desire to live in the community, and (3) has signed a release of information authorized by the person or the person's appointed legal representative. The process established under this subdivision shall be coordinated with the long-term care consultation service activities established in section 256B.0911.",
	"repealed": false
}