{
	"id": "245.975",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.975",
	"title": "245.975 OMBUDSPERSON FOR FAMILY CHILD CARE PROVIDERS.",
	"text": "The governor shall appoint an ombudsperson in the unclassified service to assist family child care providers with licensing, compliance, and other issues facing family child care providers. The ombudsperson must be selected without regard to the person's political affiliation and must have been a licensed family child care provider for at least three years. The ombudsperson shall serve a term of four years, which may be renewed, and may be removed prior to the end of the term for just cause.\n(a) The ombudsperson's duties shall include:\n(1) advocating on behalf of a family child care provider to address all areas of concern related to the provision of child care services, including licensing monitoring activities, licensing actions, and other interactions with state and county licensing staff;\n(2) providing recommendations for family child care improvement or family child care provider education;\n(3) operating a telephone line to answer questions, receive complaints, and discuss agency actions when a family child care provider believes that the provider's rights or program may have been adversely affected; and\n(4) assisting a family child care license applicant with navigating the application process.\n(b) The ombudsperson must report annually by December 31 to the commissioner of children, youth, and families and the chairs and ranking minority members of the legislative committees with jurisdiction over child care on the services provided by the ombudsperson to child care providers, including the number and locations of child care providers served and the activities of the ombudsperson in carrying out the duties under this section. The commissioner shall determine the form of the report and may specify additional reporting requirements.\nThe ombudsperson may appoint and compensate out of available funds a deputy, confidential secretary, and other employees in the unclassified service as authorized by law. The ombudsperson and the full-time staff are members of the Minnesota State Retirement Association. The ombudsperson may delegate to staff members any authority or duties of the office, except the duty to provide reports to the governor, commissioner, or the legislature.\n(a) The ombudsperson or designee, excluding volunteers, has access to any data of a state agency necessary for the discharge of the ombudsperson's duties, including records classified as confidential data on individuals or private data on individuals under chapter 13 or any other law. The ombudsperson's data request must relate to a specific case and is subject to section 13.03, subdivision 4. If the data concerns an individual, the ombudsperson or designee shall first obtain the individual's consent. If the individual is unable to consent and has no parent or legal guardian, then the ombudsperson's or designee's access to the data is authorized by this section.\n(b) The ombudsperson and designees must adhere to the Minnesota Government Data Practices Act and must not disseminate any private or confidential data on individuals unless specifically authorized by state, local, or federal law or pursuant to a court order.\n(c) The commissioner of human services; the commissioner of children, youth, and families; and any county agency must provide the ombudsperson copies of all fix-it tickets, correction orders, and licensing actions issued to family child care providers.\nIn carrying out the duties under this section, the ombudsperson may, independently of the department, provide testimony to the legislature, make periodic reports to the legislature, and address areas of concern to family child care providers.\nThe ombudsperson or designee is not civilly liable for any action taken under this section if the action was taken in good faith, was within the scope of the ombudsperson's authority, and did not constitute willful or reckless misconduct.\nThe ombudsperson must be a person who has knowledge and experience concerning the provision of family child care. The ombudsperson must be experienced in dealing with governmental entities, interpretation of laws and regulations, investigations, record keeping, report writing, public speaking, and management. A person is not eligible to serve as the ombudsperson while running for or holding public office or while holding a family child care license.\nMS 2022 [Repealed, 2024 c 115 art 16 s 47]\n(a) The commissioner of children, youth, and families shall post on the department's website the mailing address, email address, and telephone number for the office of the ombudsperson. The commissioner shall provide family child care providers with the mailing address, email address, and telephone number of the ombudsperson's office on the family child care licensing website and upon request of a family child care applicant or provider. Counties must provide family child care applicants and providers with the name, mailing address, email address, and telephone number of the ombudsperson's office upon request.\n(b) The ombudsperson must approve all postings and notices required by the department and counties under this subdivision.",
	"repealed": false
}