{
	"id": "137.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.31",
	"title": "137.31 PROCUREMENT FROM SMALL BUSINESSES.",
	"text": "Prior to the beginning of each fiscal year, the regents of the University of Minnesota shall designate and set aside for awarding to small businesses approximately 20 percent of the value of procurement contracts which are to be awarded during that fiscal year and which are to be paid in total or in part from funds appropriated to the university by the legislature. The regents shall designate specific procurement contracts to be set aside, or may authorize the university administration to divide the amount set aside into procurement contracts of economically feasible size, in order to facilitate offers or bids from small businesses. In making the annual designation, the regents shall attempt to vary the procurement contracts included in the set-aside program so that a variety of goods and services produced by different small businesses can be included in the university set-aside program over a period of years. For the purposes of this section, (a) \"procurement contract\" means any agreement, written or oral, by which the university obtains needed goods or services, including the construction of capital improvements; and (b) \"small business\" has the meaning given that term by state law. Nothing in this section shall be construed to prevent small businesses from seeking awards of procurement contracts not included in the set-aside program.\nThe regents shall establish procurement rules to govern the university set aside program. The rules shall include guidelines and procedures for negotiating price or securing bids, reasonable limitations on the amount by which a contract price under the set-aside program may exceed the estimated cost of obtaining comparable goods or services on the open market, uniform procedures for providing security for performance under procurement contracts, criteria for evaluating the financial and technical capabilities of participating small businesses, and any other matter deemed necessary or desirable for the proper operation of the university small business set-aside program.\n[Repealed, 1989 c 352 s 25]\n[Repealed, 1990 c 541 s 31]\nIf a procurement contract designated for the set-aside program cannot be awarded to a small business under the conditions prescribed in subdivisions 1 and 2, the award shall be placed in accordance with the regular procurement policies of the university. In this event, the university shall designate as a replacement a procurement contract of comparable value to be included in the university set-aside program during that fiscal year if practicable.\nThe regents and the administration of the University of Minnesota shall publicize the provisions of the university small business set-aside program, attempt to locate small businesses able to perform set aside procurement contracts, and encourage participation by small businesses in the University of Minnesota small business set-aside program.\n[Repealed, 1995 c 212 art 2 s 22]",
	"repealed": false
}