{
	"id": "352D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/352D.06",
	"title": "352D.06 ANNUITIES.",
	"text": "(a) When a participant attains at least age 55, terminates from covered service, and applies for a retirement annuity, the cash value of the participant's shares must be transferred to the general state employees retirement fund and be used to provide an annuity for the participant based upon the participant's age when the benefit begins to accrue.\n(b) Except for participants described in paragraph (c) or (d), the monthly amount of the annuity must be determined using the actuarial assumptions in effect for the general state employees retirement plan under section 356.215 on the accrual date.\n(c) For any participant who terminates employment on or after July 1, 2020, and before July 1, 2021, if the participant was at least age 63 or had at least 26 years of covered service as of June 30, 2020, the monthly amount of the annuity must be determined using the actuarial assumptions in effect for the general state employees retirement plan under section 356.215 on June 30, 2016.\n(d) For any participant who (1) terminates employment on or after June 1, 2021, and before July 1, 2022, (2) is an employee of the house of representatives, the senate, or the Legislative Coordinating Commission at the time the employee terminates employment, and (3) on June 30, 2020, was at least age 63 or had at least 26 years of covered service, the monthly amount of the annuity must be determined using the actuarial assumptions in effect for the general state employees retirement plan under section 356.215 on June 30, 2016.\nThe annuity under subdivision 1 is eligible for postretirement adjustments under section 356.415.\nA participant has the option in an application for an annuity to apply for and receive a partial value of the total shares and thereafter receive an annuity, as provided in subdivision 1, based on the remaining value of the total shares.\nAn annuity under this section accrues the day following receipt of the application or the day following termination, whichever is later. The benefit must be based on the value of the account the day following receipt of the application or the date of termination, whichever is later, plus any contributions and interest received after that date.",
	"repealed": false
}