{
	"id": "18C.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.71",
	"title": "18C.71 MINNESOTA AGRICULTURAL FERTILIZER RESEARCH AND EDUCATION PROGRAM.",
	"text": "Eligible project activities include research, education, and technology transfer related to the production and application of fertilizer, soil amendments, and other plant amendments, regenerative agriculture, and the protection of clean water. Chosen projects must contain a component of outreach that achieves a timely dissemination of findings and their applicability to the production agricultural community or metropolitan fertilizer users.\nThe council must develop or update research priorities and request guidance related to:\n(1) the availability of nitrogen by manure type and livestock species based on management; and\n(2) manure management and fertilizer best management practices for areas where surface water or groundwater are vulnerable to nitrate losses, including the adjustment of practices based on vulnerability such as coarse textured soils, soils with shallow bedrock, and karst geology.\nApplications for program grants must be submitted in the form prescribed by the Minnesota Agricultural Fertilizer Research and Education Council. Applications must be submitted on or before the deadline prescribed by the council. All applications are subject to a thorough in-state review by a peer committee established and approved by the council. Each project meeting the basic qualifications is subject to a yes or no vote by each council member. Projects chosen to receive funding must achieve an affirmative vote from at least ten of the 15 council members or two-thirds of voting members present. Projects awarded program funds must submit an annual progress report in the form prescribed by the council.\nThe program must have an annual audit of financial activities, which the council must file with the commissioner on or before June 1 for the immediately preceding year ending December 31.\nThis section expires June 30, 2030.",
	"repealed": false
}