{
	"id": "124D.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.49",
	"title": "124D.49 EDUCATION AND EMPLOYMENT TRANSITIONS PARTNERSHIPS.",
	"text": "Local education and employment transitions partnerships may be established to implement local education and employment transitions systems. Local partnerships must represent multiple sectors in the community, including, at a minimum, representatives of employers, primary and secondary education, labor and professional organizations, workers, learners, parents, community-based organizations, and to the extent possible, postsecondary education.\nA local education and employment transitions partnership must establish a governing board for planning and implementing work-based and other applied learning programs. The board must consist of at least one representative from each member of the education and employment transitions partnership. A majority of the board must consist of representatives of local or regional employers.\nA local education and employment transitions partnership must assess the needs of employers, employees, and learners, and develop a plan for implementing and achieving the objectives of a local or regional education and employment transitions system. The plan must provide for a comprehensive local system for assisting learners and workers in making the transition from school to work or for retraining in a new vocational area. The objectives of a local education and employment transitions system include:\n(1) increasing the effectiveness of the educational programs and curriculum of elementary, secondary, and postsecondary schools and the work site in preparing students in the skills and knowledge needed to be successful in the workplace;\n(2) implementing learner outcomes for students in grades kindergarten through 12 designed to introduce the world of work and to explore career opportunities, including nontraditional career opportunities;\n(3) eliminating barriers to providing effective integrated applied learning, service-learning, or work-based curriculum;\n(4) increasing opportunities to apply academic knowledge and skills, including skills needed in the workplace, in local settings which include the school, school-based enterprises, postsecondary institutions, the workplace, and the community;\n(5) increasing applied instruction in the attitudes and skills essential for success in the workplace, including cooperative working, leadership, problem-solving, English language proficiency, and respect for diversity;\n(6) providing staff training for vocational guidance counselors, teachers, and other appropriate staff in the importance of preparing learners for the transition to work, and in methods of providing instruction that incorporate applied learning, work-based learning, English language proficiency, and service-learning experiences;\n(7) identifying and enlisting local and regional employers who can effectively provide work-based or service-learning opportunities, including, but not limited to, apprenticeships, internships, and mentorships;\n(8) recruiting community and workplace mentors including peers, parents, employers and employed individuals from the community, and employers of high school students;\n(9) identifying current and emerging educational, training, native and English language development, and employment needs of the area or region, especially within industries with potential for job growth;\n(10) improving the coordination and effectiveness of local vocational and job training programs, including vocational education, adult basic education, tech prep, apprenticeship, service-learning, youth entrepreneur, youth training and employment programs administered by the commissioner of employment and economic development, and local job training programs under the Workforce Investment Act of 1998, Public Law 105-220;\n(11) identifying and applying for federal, state, local, and private sources of funding for vocational or applied learning programs;\n(12) providing students with current information and counseling about career opportunities, potential employment, educational opportunities in postsecondary institutions, workplaces, and the community, and the skills and knowledge necessary to succeed;\n(13) providing educational technology, including interactive television networks and other distance learning methods, to ensure access to a broad variety of work-based learning opportunities;\n(14) including students with disabilities in a district's vocational or applied learning program and ways to serve at-risk learners through collaboration with area learning centers under sections 123A.05 to 123A.09, or other alternative programs; and\n(15) providing a warranty to employers, postsecondary education programs, and other postsecondary training programs, that learners successfully completing a high school work-based or applied learning program will be able to apply the knowledge and work skills included in the program outcomes or graduation requirements. The warranty shall require education and training programs to continue to work with those learners that need additional skill or English language development until they can demonstrate achievement of the program outcomes or graduation requirements.\nA local education and employment transitions partnership must annually publish a report and submit information to the council as required. The report must include information required by the council for the statewide system performance assessment. The report must be available to the public in the communities served by the local education and employment transitions partnership. The report must be published no later than September 1 of the year following the year in which the data was collected.",
	"repealed": false
}