{
	"id": "97C.805",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.805",
	"title": "97C.805 NETTING LAKE WHITEFISH AND CISCOES.",
	"text": "(a) The commissioner shall, by rule, prescribe the open season and open state waters for netting lake whitefish and ciscoes. The commissioner may open specific lakes and waters that are otherwise closed if the commissioner posts notice of the date and time in appropriate public places at least 48 hours before the open season begins.\n(b) The commissioner may close specific lakes and waters that are otherwise open under this subdivision if the commissioner posts notice of the closing at a minimum of three sites on the shore of the waters, including all public water-access sites. Before closing waters under this paragraph, the commissioner shall determine that the closure is necessary to protect game fish or native rough fish populations.\n(a) Netting lake whitefish and ciscoes is subject to the restrictions in this subdivision.\n(b) A person may not use:\n(1) more than one net;\n(2) a net more than 100 feet long; or\n(3) a net more than three feet wide.\n(c) The mesh size of the net may not be less than:\n(1) 1-3/4 inches, stretch measure, for nets used to take ciscoes; and\n(2) 3-1/2 inches, stretch measure, for all other nets.\n(d) A net may not be set in water, including ice thickness, deeper than six feet.\n(e) The commissioner may designate waters where nets may be set so that portions of the net extend into water deeper than six feet under conditions prescribed by the commissioner to protect game fish. A pole or stake must project at least two feet above the surface of the water or ice at one end of the net.\n(f) A net may not be set within 50 feet of another net.\n(g) A person may not have angling equipment in possession while netting lake whitefish or ciscoes.\nNotwithstanding section 97C.391, subdivision 1, lake whitefish and ciscoes taken under this section may not be bought or sold.\nLake whitefish and ciscoes taken under this section may be taken and possessed without limit. Native rough fish caught while netting may be retained. All other fish taken while netting must be returned to the water immediately.",
	"repealed": false
}