{
	"id": "153.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/153.22",
	"title": "153.22 FORMS OF DISCIPLINARY ACTION.",
	"text": "When the board finds, after notice and hearing, that a licensed doctor of podiatric medicine has violated a provision or provisions of this chapter, it may do one or more of the following:\n(1) revoke the license;\n(2) suspend the license;\n(3) impose limitations or conditions on the podiatrist's practice of podiatric medicine; the imposition of retraining or rehabilitation requirements; the requirement of practice under supervision; or the conditioning of continued practice on demonstration of knowledge or skills by appropriate examination or other review of skill and competence;\n(4) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive the podiatrist of any economic advantage gained by reason of the violation charged, to discourage similar violations, or to reimburse the board for the cost of the investigation and proceeding, including, but not limited to, fees paid for services provided by the Office of Administrative Hearings, legal and investigative services provided by the Office of the Attorney General, court reporter services, witnesses, reproduction of records, board members' per diem compensation, board staff time, and board and staff expenses;\n(5) order the podiatrist to provide unremunerated professional service under supervision at a designated public hospital, nursing home, clinic, or other health care institution; or\n(6) censure or reprimand the licensed podiatrist.\nIn addition to any other remedy provided by law, the board may, without a hearing, temporarily suspend the license of a doctor of podiatric medicine if the board finds that the doctor has violated a statute or rule that the board is empowered to enforce and continued practice by the doctor would create a serious risk of harm to the public. The suspension is effective upon written notice to the doctor, specifying the statute or rule violated. The suspension remains in effect until the board issues a final order in the matter after a hearing. At the time it issues the suspension notice, the board shall schedule a disciplinary hearing to be held under the contested case procedure of the Administrative Procedure Act. The doctor must be provided with at least 20 days' notice of any hearing held under this subdivision. The hearing must be scheduled to begin no later than 30 days after the issuance of the suspension order.\nA suspension, revocation, condition, limitation, qualification, or restriction of a license is in effect pending determination of an appeal unless the court, upon petition and for good cause shown, otherwise orders.\nA license to practice podiatric medicine is automatically suspended if (1) a guardian of a licensee is appointed by order of a court under sections 524.5-101 to 524.5-502, for reasons other than the minority of the licensee; or (2) the licensee is committed by order of a court under chapter 253B. The license remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing.\nAny licensee whose license has been suspended or revoked may have the license reinstated or a new license issued, as the case may be, when the board finds the action is warranted. As a condition of reinstatement or the new license, the board may impose any disciplinary or corrective measure, other than suspension or revocation, that it might originally have imposed.",
	"repealed": false
}