{
	"id": "383B.908",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.908",
	"title": "383B.908 LIMITATIONS UPON CORPORATE POWERS; RESERVED POWERS.",
	"text": "Notwithstanding the authority granted to the board in section 383B.907, the county board shall retain specific controls over the corporation's mission, ability to incur indebtedness through the county, indigent care, and governance. These county board controls must be specified in the bylaws or other transactional documents, which shall be approved by the county board.\nThe corporation shall not have the power to dissolve, merge, consolidate, transfer, liquidate, or otherwise dispose of or distribute all, or substantially all, of the corporation's assets without a county board resolution approved by a majority of the county board.\nIn the event of the dissolution of the corporation, the net assets of the corporation shall be distributed to the county for public purposes.\nNo part of the net earnings and assets of the corporation shall inure to the benefit of any private individual, nor shall any part of the income or assets of the corporation be distributed to or divided among any private individuals as dividends or otherwise.\nThe county board shall approve the annual budget of the corporation and receive an annual audited financial statement. The annual budget shall address how efficiencies and revenues contribute to stabilize or reduce county liabilities for indigent care. The county board shall also retain the right to conduct an independent audit of the finances of the corporation.\nThe county board shall retain the authority to require the corporation to provide other health care or health care related services as the county board determines to be in the best interest of the county. The corporation shall provide these services as long as the county board provides funds to pay for the services. Payment to the corporation for the services shall be as agreed between the corporation and the county board.\nThe county board shall retain the right to dissolve the corporation, reorganize the corporation, or remove the entire corporate board in order to resume management of Hennepin County Medical Center upon a two-thirds vote of the entire county board.",
	"repealed": false
}