{
	"id": "484.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.68",
	"title": "484.68 DISTRICT ADMINISTRATOR.",
	"text": "The chief judge of the judicial district in each judicial district shall appoint a single district administrator, subject to the approval of the supreme court, with the advice of the judges of the judicial district.\nThe district administrator shall serve at the pleasure of a majority of the judges of the judicial district.\nThe district administrator shall have such deputies, assistants and staff as the judges of the judicial district deem necessary to perform the duties of the office.\nThe district administrator shall:\n(1) assist the chief judge in the performance of administrative duties;\n(2) manage the administrative affairs of the courts of the judicial district;\n(3) supervise the court administrators and other support personnel who serve in the courts of the judicial district and court reporters as agreed upon with the collective bargaining representative. Court reporters who serve in the courts of the judicial district and are appointed by individual judges shall remain under the supervision of the judge who appointed them and serve at their pleasure;\n(4) comply with the requests of the state court administrator for statistical or other information relating to the courts of the judicial district;\n(5) with the approval of the chief judge, determine the needs of the judges of the district for office equipment necessary for the effective administration of justice and develop a plan to make the equipment available to the judges of the district; the plan must be submitted to the state court administrator for approval and determination of eligibility for state funding under section 480.15, subdivision 12; and\n(6) perform any additional duties that are assigned by law or by the rules of court.\nThe district administrator shall serve as secretary for meetings of the judges of the judicial district.\nThe office budget of the district administrator shall be paid by the state. The budget must include sufficient money for the staff authorized by this section and other staff and expenses authorized under law. A county shall provide office facilities for the district administrator.\n[Repealed, 1986 c 464 s 3]\n[Repealed, 2006 c 260 art 5 s 54]\nA member of the Public Employees Retirement Association appointed as district administrator pursuant to this chapter, shall remain a member of the fund unless the member elects, within 12 months of the appointment, to be covered by the Minnesota State Retirement System. If a district court administrator elects retirement coverage by the Minnesota State Retirement System pursuant to this subdivision, that coverage shall commence with first day of the first payroll period occurring after the election. No person shall receive credit for more than one month of service from the affected retirement funds for the month in which the change in retirement coverage is elected.",
	"repealed": false
}