{
	"id": "115A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.11",
	"title": "115A.11 HAZARDOUS WASTE MANAGEMENT PLAN.",
	"text": "The agency shall adopt, amend as appropriate, and implement a hazardous waste management plan.\nIn developing and implementing the plan, the highest priority of the agency must be placed upon alternatives to land disposal of hazardous wastes including: technologies to modify industrial processes or introduce new processes that will reduce or eliminate hazardous waste generation; recycling, reuse, and recovery methods to reduce or eliminate hazardous waste disposal; and conversion and treatment technologies to reduce the degree of environmental risk from hazardous waste. The agency shall also consider technologies for retrievable storage of hazardous wastes for later recycling, reuse, recovery, conversion, or treatment.\nThe plan must include at least the elements prescribed in this subdivision.\n(a) The plan must estimate the types and quantities of hazardous waste that will be generated in the state through the year 2000.\n(b) The plan must set out specific and quantifiable objectives for reducing to the greatest feasible and prudent extent the need for and use of disposal facilities located within the state, through waste reduction, pretreatment, retrievable storage, processing, and resource recovery.\n(c) The plan must estimate the minimum disposal capacity and capability required by generators in the state for use through the year 2000. The estimate must be based on the achievement of the objectives under paragraph (b).\n(d) The plan must describe and recommend the implementation strategies required to assure availability of disposal capacity for the types and quantities of waste estimated under paragraph (c) and to achieve the objectives required by paragraph (b). The recommendations must address at least the following: the necessary private and government actions; the types of facilities and programs required; the availability and use of specific facilities outside of the state; development schedules for facilities, services, and rules that should be established in the state; revenue-raising and financing measures; levels of public and private effort and expenditure; legal and institutional changes; and other similar matters.\n(e) The plan must provide for the orderly development of hazardous waste management sites and facilities to protect the health and safety of rural and urban communities. In preparing the plan the agency shall consider its impact upon agriculture and natural resources.\n(f) The plan must include methods and procedures that will encourage the establishment of programs, services, and facilities that the agency recommends for development in the state for the recycling, reuse, recovery, conversion, treatment, destruction, transfer, storage, or disposal, including retrievable storage, of hazardous waste.\n(g) The plan must be consistent with the estimate of need and feasibility analysis prepared under section 115A.24 and the decisions made by the agency under section 115A.28.\n(h) The agency may make the implementation of elements of the plan contingent on actions of the legislature that have been recommended in the draft plan.\nThe plan and the procedures for hearings on the plan are not subject to the contested case provisions of chapter 14. Before revising the draft plan or amending its adopted plan, the agency shall provide notice and hold a public meeting.\n[Repealed, 1989 c 335 art 1 s 270]",
	"repealed": false
}