{
	"id": "135A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.15",
	"title": "135A.15 CAMPUS SEXUAL MISCONDUCT POLICY.",
	"text": "(a) This section applies to the following postsecondary institutions:\n(1) institutions governed by the Board of Trustees of the Minnesota State Colleges and Universities; and\n(2) private postsecondary institutions that offer in-person courses on a campus located in Minnesota and which are eligible institutions as defined in section 136A.103, paragraph (a), that are participating in the federal program under Title IV of the Higher Education Act of 1965, Public Law 89-329, as amended.\nInstitutions governed by the Board of Regents of the University of Minnesota are requested to comply with this section.\n(b) A postsecondary institution must adopt a clear, understandable written policy on sexual misconduct that informs victims of their rights under the crime victims bill of rights, including the right to assistance from the Crime Victims Reimbursement Board and the commissioner of public safety. The policy must apply to students and employees and must provide information about their rights and duties. The policy must apply to criminal incidents against a student or employee of a postsecondary institution occurring on property owned or leased by the postsecondary system or institution or at any activity, program, organization, or event sponsored by the system or institution, or by a fraternity or sorority, or any activity, program, organization, or event sponsored by the system or institution, or by a fraternity or sorority, regardless of whether the activity, program, organization, or event occurs on or off property owned or leased by the postsecondary system or institution. It must include procedures for reporting incidents of sexual misconduct and for disciplinary actions against violators. During student registration, a postsecondary institution shall provide each student with information regarding its policy. A copy of the policy also shall be posted at appropriate locations on campus at all times.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Advisor\" means a person who is selected by a responding or reporting party to serve as a support during a campus investigation and disciplinary process. This person may be an attorney. An advisor serves as a support to a party by offering comfort or attending meetings.\n(c) \"Domestic violence\" has the meaning given in section 518B.01, subdivision 2.\n(d) \"Incident\" means one report of sexual misconduct to a postsecondary institution, regardless of the number of complainants included in the report, the number of respondents included in the report, and whether or not the identity of any party is known by the reporting postsecondary institution. Incident encompasses all nonconsensual events included within one report if multiple events have been identified.\n(e) \"Intimate partner violence\" means any physical or sexual harm or a pattern of any other coercive behavior committed, enabled, or solicited to gain or maintain power and control over a victim, including verbal, psychological, economic, or technological abuse that may or may not constitute criminal behavior against an individual, that may be classified as a sexual misconduct, dating violence, or domestic violence caused by:\n(1) a current or former spouse of the individual; or\n(2) a person in a sexual or romantic relationship with the individual.\n(f) \"Nonconsensual dissemination of sexual images\" has the meaning given in section 617.261.\n(g) \"Reporting party\" means the party in a disciplinary proceeding who has reported being subjected to conduct or communication that could constitute sexual misconduct.\n(h) \"Responding party\" means the party in a disciplinary proceeding who has been reported to be the perpetrator of conduct or communication that could constitute sexual misconduct.\n(i) \"Sexual assault\" means rape, sex offenses - fondling, sex offenses - incest, or sex offenses - statutory rape as defined in Code of Federal Regulations, title 34, part 668, subpart D, appendix A, as amended.\n(j) \"Sexual extortion\" has the meaning given in section 609.3458.\n(k) \"Sex trafficking\" has the meaning given in section 609.321, subdivision 7a.\n(l) \"Sexual harassment\" has the meaning given in section 363A.03, subdivision 43.\n(m) \"Sexual misconduct\" means an incident of sexual violence, intimate partner violence, domestic violence, sexual assault, sexual harassment, nonconsensual distribution of sexual images, sexual extortion, nonconsensual dissemination of a deepfake depicting intimate parts or sexual acts, sex trafficking, or stalking.\n(n) \"Stalking\" has the meaning given in section 609.749.\n(a) The policy required under subdivision 1 shall, at a minimum, require that students and employees be informed of the policy, and shall include provisions for:\n(1) filing criminal charges with local law enforcement officials in cases defined as sexual misconduct that may constitute criminal behavior;\n(2) the prompt assistance of campus authorities, at the request of the victim, in notifying the appropriate law enforcement officials and disciplinary authorities of a sexual misconduct incident;\n(3) allowing sexual misconduct victims to decide whether to report a case to law enforcement or not report altogether; participate in a campus investigation, disciplinary proceeding, or nondisciplinary informal resolution; or not participate altogether;\n(4) requiring campus authorities to treat sexual misconduct victims with dignity;\n(5) requiring campus authorities to offer sexual misconduct victims fair and respectful health care, counseling services, or referrals to such services;\n(6) preventing campus authorities from suggesting to a victim of sexual misconduct that the victim is at fault for the crimes or violations that occurred;\n(7) preventing campus authorities from suggesting to a victim of sexual misconduct that the victim should have acted in a different manner to avoid such a crime;\n(8) subject to subdivisions 2a and 10, protecting the privacy of sexual misconduct victims by only disclosing data collected under this section to the victim, persons whose work assignments reasonably require access, and, at a sexual misconduct victim's request, police conducting a criminal investigation;\n(9) an investigation and resolution of a sexual misconduct complaint by campus disciplinary authorities;\n(10) a sexual misconduct victim's participation in and the presence of the victim's advisor at any meeting with campus officials concerning the victim's sexual misconduct complaint or campus disciplinary proceeding concerning a sexual misconduct complaint;\n(11) ensuring that a sexual misconduct victim may decide when to repeat a description of the incident of sexual misconduct;\n(12) notice to a sexual misconduct victim of the availability of a campus or local program providing victim advocacy services and information on free legal resources and services;\n(13) notice to a sexual misconduct victim of the outcome of any campus disciplinary proceeding concerning a sexual misconduct complaint, consistent with laws relating to data practices;\n(14) the complete and prompt assistance of campus authorities, at the direction of law enforcement authorities, in obtaining, securing, and maintaining evidence in connection with a sexual misconduct incident;\n(15) the assistance of campus authorities, at the request of the sexual misconduct victim, in preserving materials relevant to a campus disciplinary proceeding;\n(16) during and after the process of investigating a complaint and conducting a campus disciplinary procedure, the assistance of campus personnel, in cooperation with the appropriate law enforcement authorities, at a sexual misconduct victim's request, in shielding the victim from unwanted contact with the alleged assailant, including transfer of the victim to alternative classes or to alternative college-owned housing, if alternative classes or housing are available and feasible;\n(17) forbidding retaliation, and establishing a process for investigating complaints of retaliation, against sexual misconduct victims by campus authorities, the accused, organizations affiliated with the accused, other students, and other employees;\n(18) at the request of the victim, providing students who reported sexual misconduct to the institution and subsequently choose to transfer to another postsecondary institution with information about resources for victims of sexual misconduct at the institution to which the victim is transferring; and\n(19) consistent with laws governing access to student records, providing a student who reported an incident of sexual misconduct with access to the student's description of the incident as it was reported to the institution, including if that student transfers to another postsecondary institution.\n(b) None of the rights given to a student by the policy required by subdivision 1 may be made contingent upon the victim entering into a nondisclosure agreement or other contract restricting the victim's ability to discuss information in connection with a sexual misconduct complaint, investigation, or hearing.\n(c) A nondisclosure agreement or other contract restricting the victim's ability to discuss information in connection with a sexual misconduct complaint, investigation, or hearing may not be used as a condition of financial aid or remedial action.\n(a) A postsecondary institution must provide a reporting party an opportunity for an impartial, timely, and thorough investigation of a report of sexual misconduct against a student. If an investigation reveals that sexual misconduct has occurred, the institution must take prompt and effective steps reasonably calculated to end the sexual misconduct, prevent its recurrence, and, as appropriate, remedy its effects.\n(b) Throughout any investigation or disciplinary proceeding, a postsecondary institution must treat the reporting parties, responding parties, witnesses, and other participants in the proceeding with dignity and respect.\n(c) If a postsecondary institution conducts a hearing, an advisor may provide opening and closing remarks on behalf of a party or assist with formulating questions to the other party or witnesses about related evidence or credibility.\nThe sexual misconduct policy required by subdivision 1 must include a provision that a witness or victim of an incident of sexual misconduct who reports the incident in good faith shall not be sanctioned by the institution for admitting in the report to a violation of the institution's student conduct policy on the personal use of drugs or alcohol.\n(a) A postsecondary institution must enter into a memorandum of understanding with the primary local law enforcement agencies that serve its campus. The memorandum must be entered into no later than January 1, 2017, and updated every two years thereafter. This memorandum shall clearly delineate responsibilities and require information sharing, in accordance with applicable state and federal privacy laws, about certain crimes including, but not limited to, sexual assault. This memorandum of understanding shall provide:\n(1) delineation and sharing protocols of investigative responsibilities;\n(2) protocols for investigations, including standards for notification and communication and measures to promote evidence preservation; and\n(3) a method of sharing information about specific crimes, when directed by the victim, and a method of sharing crime details anonymously in order to better protect overall campus safety.\n(b) Prior to the start of each academic year, a postsecondary institution shall distribute an electronic copy of the memorandum of understanding to all employees on the campus that are subject to the memorandum.\n(c) An institution is exempt from the requirement that it develop a memorandum of understanding under this section if the institution and local or county law enforcement agencies establish a sexual misconduct protocol team to facilitate effective cooperation and collaboration between the institution and law enforcement.\n(a) A postsecondary institution must provide an online reporting system to receive complaints of sexual misconduct from students and employees. The system must permit anonymous reports, provided that the institution is not obligated to investigate an anonymous report unless a formal report is submitted through the process established in the institution's sexual misconduct policy.\n(b) A postsecondary institution must provide students making reports under this subdivision with information about who will receive and have access to the reports filed, how the information gathered through the system will be used, and contact information for on-campus and off-campus organizations serving victims of sexual misconduct.\n(c) Data collected under this subdivision is classified as private data on individuals as defined by section 13.02, subdivision 12. Postsecondary institutions not otherwise subject to chapter 13 must limit access to the data to only the data subject and persons whose work assignments reasonably require access.\n(a) Postsecondary institutions must annually report statistics on sexual misconduct. This report must be prepared in addition to any federally required reporting on campus security, including reports required by the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, United States Code, title 20, section 1092(f). The report must include, but not be limited to, the number of incidents of sexual misconduct of each offense listed under the definition in subdivision 1a, reported to the institution in the previous calendar year, as follows:\n(1) the number that were investigated by the institution;\n(2) the number that were referred for a disciplinary proceeding at the institution;\n(3) the number the victim chose to report to local or state law enforcement;\n(4) the number for which a campus disciplinary proceeding is pending, but has not reached a final resolution;\n(5) the number in which the alleged perpetrator was found responsible by the disciplinary proceeding at the institution;\n(6) the number that resulted in any action by the institution greater than a warning issued to the accused;\n(7) the number that resulted in a disciplinary proceeding at the institution that closed without resolution;\n(8) the number that resulted in a disciplinary proceeding at the institution that closed without resolution because the accused withdrew from the institution;\n(9) the number that resulted in a disciplinary proceeding at the institution that closed without resolution because the victim chose not to participate in the procedure; and\n(10) the number of reports made through the online reporting system established in subdivision 5, excluding reports submitted anonymously.\n(b) If an institution previously submitted a report indicating that one or more disciplinary proceedings was pending, but had not reached a final resolution, and one or more of those disciplinary proceedings reached a final resolution within the previous calendar year, that institution must submit updated totals from the previous year that reflect the outcome of the pending case or cases.\n(c) The reports required by this subdivision must be submitted to the Office of Higher Education by October 1 of each year. Each report must contain the data required under paragraphs (a) and (b) from the previous calendar year.\n(d) The commissioner of the Office of Higher Education shall calculate statewide numbers for each data item reported by an institution under this subdivision. The statewide numbers must include data from postsecondary institutions that the commissioner could not publish due to federal laws governing access to student records.\n(e) The Office of Higher Education shall publish on its website:\n(1) the statewide data calculated under paragraph (d); and\n(2) the data items required under paragraphs (a) and (b) for each postsecondary institution in the state.\nEach postsecondary institution shall publish on the institution's website the data items required under paragraphs (a) and (b) for that institution.\n(f) Reports and data required under this subdivision must be prepared and published as summary data, as defined in section 13.02, subdivision 19, and must be consistent with applicable law governing access to educational data. If an institution or the Office of Higher Education does not publish data because of applicable law, the publication must explain why data are not included.\n(a) Data on incidents of sexual misconduct shared with campus security officers or campus administrators responsible for investigating or adjudicating complaints of sexual misconduct are classified as private data on individuals as defined by section 13.02, subdivision 12, for the purposes of postsecondary institutions subject to the requirements of chapter 13. Postsecondary institutions not otherwise subject to chapter 13 must limit access to the data to only the data subject and persons whose work assignments reasonably require access.\n(b) Only individuals with explicit authorization from an institution may enter, update, or access electronic data related to an incident of sexual misconduct collected, created, or maintained under this section. The ability of authorized individuals to enter, update, or access these data must be limited through the use of role-based access that corresponds to the official duties or training level of the individual and the institutional authorization that grants access for that purpose. All actions in which the data related to an incident of sexual misconduct are entered, updated, accessed, shared, or disseminated outside of the institution must be recorded in a data audit trail. An institution shall immediately and permanently revoke the authorization of any individual determined to have willfully entered, updated, accessed, shared, or disseminated data in violation of this subdivision or any provision of chapter 13. If an individual is determined to have willfully gained access to data without explicit authorization, the matter shall be forwarded to a county attorney for prosecution.\n(a) A postsecondary institution must provide campus security officers and campus administrators responsible for investigating or adjudicating complaints of sexual misconduct with comprehensive training on preventing and responding to sexual misconduct in collaboration with the Bureau of Criminal Apprehension or another law enforcement agency with expertise in criminal sexual conduct. The training for campus security officers shall include a presentation on the dynamics of sexual assault, neurobiological responses to trauma, and best practices for preventing, responding to, and investigating sexual misconduct. The training for campus administrators responsible for investigating or adjudicating complaints on sexual misconduct shall include presentations on preventing sexual misconduct, responding to incidents of sexual misconduct, the dynamics of sexual assault, neurobiological responses to trauma, and compliance with state and federal laws on sexual misconduct.\n(b) The following categories of students who attend, or will attend, one or more courses on campus or will participate in on-campus activities must be provided sexual misconduct training:\n(1) students pursuing a degree or certificate;\n(2) students who are taking courses through the Postsecondary Enrollment Options Act; and\n(3) any other categories of students determined by the institution.\nStudents must complete such training no later than ten business days after the start of a student's first semester of classes. Once a student completes the training, institutions must document the student's completion of the training and provide proof of training completion to a student at the student's request. Students enrolled at more than one institution within the same system at the same time are only required to complete the training once.\nThe training shall include information about topics including but not limited to sexual misconduct as defined in subdivision 1a; consent as defined in section 609.341, subdivision 4; preventing and reducing the prevalence of sexual misconduct; procedures for reporting campus sexual misconduct; and campus resources on sexual misconduct, including organizations that support victims of sexual misconduct.\n(c) A postsecondary institution shall annually train individuals responsible for responding to reports of sexual misconduct. This training shall include information about best practices for interacting with victims of sexual misconduct, including how to reduce the emotional distress resulting from the reporting, investigatory, and disciplinary process.\n(d) To the extent possible, trainings must be culturally responsive and address the unique experiences and challenges faced by students based on race, ethnicity, color, national origin, disability, socioeconomic status, religion, sex, gender identity, sexual orientation, and pregnancy or parenting status.\n(a) An institution's student health service providers must screen students for incidents of sexual misconduct. Student health service providers shall offer students information on resources available to victims and survivors of sexual misconduct including counseling, mental health services, and procedures for reporting incidents to the institution.\n(b) Each institution offering student health or counseling services must designate an existing staff member or existing staff members as confidential resources for victims of sexual misconduct. The confidential resource must be available to meet with victims of sexual misconduct. The confidential resource must provide victims with information about locally available resources for victims of sexual misconduct including, but not limited to, mental health services and legal assistance. The confidential resource must provide victims with information about the process for reporting an incident of sexual misconduct to campus authorities or local law enforcement. The victim shall decide whether to report an incident of sexual misconduct to campus authorities or local law enforcement. Confidential resources must be trained in all aspects of responding to incidents of sexual misconduct including, but not limited to, best practices for interacting with victims of trauma, preserving evidence, campus disciplinary and local legal processes, and locally available resources for victims. Data shared with a confidential resource is classified as sexual assault communication data as defined by section 13.822, subdivision 1.\nThis section does not exempt mandatory reporters from the requirements of section 626.557 or chapter 260E governing the reporting of maltreatment of minors or vulnerable adults. Nothing in this section limits the authority of an institution to comply with other applicable state or federal laws related to investigations or reports of sexual misconduct.",
	"repealed": false
}