{
	"id": "16B.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.361",
	"title": "16B.361 OFFICE OF COLLABORATION AND DISPUTE RESOLUTION.",
	"text": "The commissioner of administration shall maintain the Office of Collaboration and Dispute Resolution within the Department of Administration. The office must:\n(1) assist state agencies; offices of the executive, legislative, and judicial branches; Tribal governments; and units of local government in improving collaboration, dispute resolution, and public engagement;\n(2) promote and utilize collaborative dispute resolution models and processes based on documented best practices to foster trust, relationships, mutual understanding, consensus-based resolutions, and wise and durable solutions, including but not limited to:\n(i) using established criteria and procedures for identifying and assessing collaborative dispute resolution projects;\n(ii) designing collaborative dispute resolution processes;\n(iii) preparing and training participants; and\n(iv) facilitating meetings and group processes using collaborative techniques and approaches;\n(3) support collaboration and dispute resolution in the public and private sectors by providing technical assistance and information on best practices and new developments in dispute resolution fields;\n(4) build capacity and educate the public and government entities on collaboration, dispute resolution approaches, and public engagement;\n(5) promote the broad use of community mediation in the state; and\n(6) ensure that all areas of the state have access to services by providing grants to private nonprofit entities certified by the state court administrator under chapter 494 that assist in resolution of disputes.\n(a) The commissioner shall, to the extent funds are appropriated for this purpose, make grants to private nonprofit community mediation entities certified by the state court administrator under chapter 494 that assist in resolution of disputes under subdivision 1, clause (6). The commissioner shall establish a grant review committee to assist in the review of grant applications and the allocation of grants under this section.\n(b) To be eligible for a grant under this section, a nonprofit organization must meet the requirements of section 494.05, subdivision 1, clauses (1), (2), (4), and (5).\n(c) A nonprofit entity receiving a grant must agree to comply with guidelines adopted by the state court administrator under section 494.015, subdivision 1. Policies adopted under sections 16B.97 and 16B.98 apply to grants under this section. The exclusions in section 494.03 apply to grants under this section.\n(d) Grantees must report data required under chapter 494 to evaluate quality and outcomes.\nThe commissioner may apply for and receive money made available from federal, state, or other sources for the purposes of carrying out the mission of the Office of Collaboration and Dispute Resolution. Funds received under this subdivision are appropriated to the commissioner for their intended purpose.",
	"repealed": false
}