{
	"id": "388.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/388.23",
	"title": "388.23 COUNTY ATTORNEY; ADMINISTRATIVE SUBPOENAS.",
	"text": "The county attorney, or any deputy or assistant county attorney whom the county attorney authorizes in writing, has the authority to subpoena and require the production of any records of telephone companies, cellular phone companies, paging companies, subscribers of private computer networks including Internet service providers or computer bulletin board systems, electric companies, gas companies, water utilities, chemical suppliers, hotels and motels, pawn shops, airlines, buses, taxis, and other entities engaged in the business of transporting people, and freight companies, warehousing companies, self-service storage facilities, package delivery companies, and other entities engaged in the businesses of transport, storage, or delivery, and records of the existence of safe deposit box account numbers and customer savings and checking account numbers maintained by financial institutions and safe deposit companies, insurance records relating to the monetary payment or settlement of claims, the banking, credit card, and financial records of a subject of an identity theft investigation or a vulnerable adult, whether held in the name of the vulnerable adult or a third party, including but not limited to safe deposit, loan and account applications and agreements, signature cards, statements, checks, transfers, account authorizations, safe deposit access records and documentation of fraud, and wage and employment records of an applicant or recipient of public assistance who is the subject of a welfare fraud investigation relating to eligibility information for public assistance programs. Subpoenas may only be issued for records that are relevant to an ongoing legitimate law enforcement investigation. Administrative subpoenas may only be issued in welfare fraud and identity theft cases if there is probable cause to believe a crime has been committed. This provision applies only to the records of business entities and does not extend to private individuals or their dwellings.\nThe subpoena shall be enforceable through the district court.\nThe person directed to produce the records shall be paid reasonable expenses incurred in producing the records.\nThe subpoena must state that the person to whom the subpoena is directed may not disclose the fact that the subpoena was issued or the fact that the requested records have been given to law enforcement personnel except:\n(1) insofar as the disclosure is necessary to find and disclose the records; or\n(2) pursuant to court order.\nThe willful failure to produce the documents required by the subpoena is a misdemeanor.\nUpon the ex parte request of the attorney issuing the subpoena, the district court may issue an order directing the production of the records. It is not necessary for either the request or the order to be filed with the court administrator. Failure to comply with the court order subjects the person who fails to comply to civil or criminal contempt of court, or both.",
	"repealed": false
}