{
	"id": "245A.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.055",
	"title": "245A.055 CLOSING A LICENSE.",
	"text": "The commissioner may close a license if the commissioner determines that a licensed program has not been serving any client for a consecutive period of 12 months or longer. The license holder is not prohibited from reapplying for a license if the license holder's license was closed under this chapter.\nIf a license is closed, the commissioner must notify the license holder of closure by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the notice of closure must be mailed to the last known address of the license holder and must inform the license holder why the license was closed and that the license holder has the right to request reconsideration of the closure. If the license holder believes that the license was closed in error, the license holder may ask the commissioner to reconsider the closure. The license holder's request for reconsideration must be made in writing and must include documentation that the licensed program has served a client in the previous 12 months. The request for reconsideration must be postmarked and sent to the commissioner or submitted through the provider licensing and reporting hub within 20 calendar days after the license holder receives the notice of closure. Upon implementation of the provider licensing and reporting hub, the provider must use the hub to request reconsideration. If the order is issued through the provider hub, the reconsideration must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub. A timely request for reconsideration stays imposition of the license closure until the commissioner issues a decision on the request for reconsideration.\nThe commissioner's disposition of a request for reconsideration is final and not subject to appeal under chapter 14.",
	"repealed": false
}