{
	"id": "424A.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.001",
	"title": "424A.001 DEFINITIONS.",
	"text": "Unless the context clearly indicates otherwise, as used in this chapter, the terms defined in this section have the meanings given.\n\"Ancillary benefit\" means a benefit payable from the special fund of the relief association other than a service pension that is permitted by law and that is provided for in the relief association bylaws.\n\"Defined benefit relief association\" means a firefighters relief association that provides a lump-sum service pension, provides a monthly benefit service pension, or provides a lump-sum service pension as an alternative to the monthly benefit service pension.\n\"Defined contribution relief association\" means a firefighters relief association that provides a service pension based solely on an individual account balance rather than a specified annual lump-sum or monthly benefit service pension amount.\n\"Fire department\" includes a municipal fire department, an independent nonprofit firefighting corporation, and a fire department established as or operated by a joint powers entity under section 471.59.\n\"Municipal\" means of a city or township.\n\"Municipal clerk\" means the person elected or appointed to the position of municipal clerk, the chief financial official or chief administrative official designated to perform such function, or, if there is no such person or designation, the chief financial official, the chief administrative official, or the person primarily responsible for managing the finances of a municipality.\n\"Municipality\" means a city or township which has established a fire department with which the relief association is directly associated, a city or township which has entered into a contract with the independent nonprofit firefighting corporation of which the relief association is directly associated, or a city or township that has entered into a contract with a joint powers entity established under section 471.59 of which the relief association is directly associated.\n(a) \"Relief association\" or \"firefighters relief association\" means a firefighters relief association that is:\n(1) organized and incorporated as a nonprofit corporation to provide retirement benefits to volunteer firefighters and paid on-call firefighters under chapter 317A and any laws of the state;\n(2) governed by this chapter and sections 424A.091 to 424A.095; and\n(3) directly associated with:\n(i) a fire department established by municipal ordinance;\n(ii) an independent nonprofit firefighting corporation that is organized under the provisions of chapter 317A and that operates primarily for firefighting purposes; or\n(iii) a fire department operated as or by a joint powers entity that operates primarily for firefighting purposes.\n(b) \"Relief association\" or \"firefighters relief association\" does not mean:\n(1) the Bloomington Fire Department Relief Association governed by Laws 2013, chapter 111, article 5, sections 31 to 42; Minnesota Statutes 2000, chapter 424; and Laws 1965, chapter 446, as amended; or\n(2) the statewide volunteer firefighter plan governed by chapter 353G.\n(c) A relief association or firefighters relief association is a governmental entity that receives and manages public money to provide retirement benefits for individuals providing the governmental services of firefighting and emergency first response.\n\"Special fund\" means the special fund of a firefighters relief association.\n[Repealed, 2010 c 359 art 13 s 13]\n[Repealed, 2009 c 169 art 10 s 58]\n\"Firefighting service\" means duties performed by firefighters and, if approved by the appropriate municipality or municipalities, duties performed by fire prevention personnel.\n\"Separate from active service\" means that a firefighter permanently ceases to perform fire suppression duties and fire prevention duties and, permanently ceases to supervise fire suppression, and fire prevention duties with a particular fire department.\n\"Break in service\" means temporarily ceasing all of the following with a particular fire department:\n(1) performing fire suppression duties;\n(2) performing fire prevention duties;\n(3) supervising fire suppression duties; and\n(4) supervising fire prevention duties.\n\"Firefighter\" means a person who is a volunteer firefighter, paid on-call firefighter, part-time firefighter, full-time firefighter, career firefighter, or any combination thereof.\n\"Volunteer firefighter\" means a firefighter who does not receive compensation per call or hour for firefighting services but who may receive reimbursement for expenses, who has a choice of availability in providing services with the fire department, and who is eligible for membership in a relief association associated with the fire department or participates in the statewide volunteer firefighter plan under chapter 353G.\n\"Paid on-call firefighter\" means a firefighter who receives compensation per call or per hour for firefighting services, who has a choice of availability regarding the firefighter's hours or scheduled shifts in providing services with the fire department, and who is eligible for membership in a relief association associated with the fire department or participates in the statewide volunteer firefighter plan under chapter 353G.\n\"Part-time firefighter\" means a firefighter who receives compensation per call or per hour for firefighting services, whose services with the fire department are scheduled, who is considered by the firefighter's employer to be in part-time employment, and who, as a result of providing firefighting services, is a member or is eligible to be a member of the general employees retirement plan or the public employees police and fire plan under chapter 353.\n\"Full-time firefighter\" or \"career firefighter\" means a firefighter who receives compensation per hour or a salary for firefighting services, whose services with the fire department are scheduled and who, as a result of providing firefighting services, is a member or is eligible to be a member of the general employees retirement plan or the public employees police and fire plan under chapter 353.\nThe fiscal year for a firefighters relief association begins on January 1 of each calendar year and ends on December 31 of the same calendar year.\nMembership in a firefighters relief association begins upon the date of hire by a municipality, a joint powers board, or an independent nonprofit firefighting corporation with which the relief association is directly associated, unless otherwise specified in the relief association bylaws.",
	"repealed": false
}