{
	"id": "270A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/270A.08",
	"title": "270A.08 NOTICE AND HEARING REQUIRED.",
	"text": "(a) Not later than five days after the claimant agency has sent notification to the department pursuant to section 270A.07, subdivision 1, the claimant agency shall send a written notification to the debtor asserting the right of the claimant agency to the refund or any part thereof. If the notice is returned to the claimant agency as undeliverable, or the claimant agency has reason to believe the debtor did not receive the notice, the claimant agency shall obtain the last known address of the debtor from the commissioner and resend the corrected notice.\n(b) If a debt has been referred to the commissioner for collection under chapter 16D, and the referring agency meets the definition of claimant agency under this chapter, the commissioner must notify the debtor prior to using revenue recapture under this chapter for collection of the debt. The notice must be sent by United States mail or personal delivery to the last known address of the debtor.\n(a) This written notice shall clearly and with specificity set forth the basis for the claim to the refund including the name of the benefit program involved if the debt arises from a public assistance grant and the dates on which the debt was incurred and, further, shall advise the debtor of the claimant agency's intention to request setoff of the refund against the debt.\n(b) Except as provided in paragraph (c), the notice will also advise the debtor that the debt can be set off against a refund unless the time period allowed by law for collecting the debt has expired, and will advise the debtor of the right to contest the validity of the claim at a hearing. The debtor must assert this right by written request to the claimant agency, which request the agency must receive within 45 days of the mailing date of the original notice or of the corrected notice, as required by subdivision 1. If the debtor has not received the notice, the 45 days shall not commence until the debtor has received actual notice. The debtor shall have the burden of showing no notice and shall be entitled to a hearing on the issue of notice as well as on the merits.\n(c) If the claimant agency is a public agency that is responsible for the administration of a low-income housing program, the notice will also advise the debtor that the debt can be set off against a refund unless the time period allowed by law for collecting the debt has expired. If the public agency has provided the debtor with the opportunity to contest the issues relating to the validity of the claim at a hearing under rules promulgated by the United States Department of Housing and Urban Development or the public agency, the notice will advise the debtor of that fact and advise the debtor that no further hearing may be requested by the debtor to contest the validity of the claim.",
	"repealed": false
}