{
	"id": "471.6985",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.6985",
	"title": "471.6985 MUNICIPAL LIQUOR STORE.",
	"text": "Any city operating a municipal liquor store shall publish a balance sheet using generally accepted accounting procedures and a statement of operations of the liquor store within 90 days after the close of the fiscal year in the official newspaper of the city. The statement shall be headlined, in a type size no smaller than 18-point: \"Analysis of ......(city)...... municipal liquor store operations for ......(year)....\" and shall be written in clear and easily understandable language. It shall contain the following information: total sales, cost of sales, gross profit, profit as percent of sales, operating expenses, operating income, contributions to and from other funds, capital outlay, interest paid and debt retired. The form and style of the statement shall be prescribed by the state auditor. Nonoperating expenses may not be extracted on the reporting form prior to determination of net profits for reporting purposes only. Administrative expenses charged to the liquor store by the city must be actual operating expenses and not used for any other public purpose prior to the determination of net profits. The publication requirements of this section shall be in addition to any publication or posting requirements for financial reports contained in sections 471.697 and 471.698. The statement may at the option of the city council be incorporated into the reports published pursuant to sections 471.697 and 471.698, in accordance with a form and style prescribed by the state auditor.\nAny city operating a municipal liquor store with total annual sales in excess of $350,000 shall submit to the state auditor audited financial statements for the liquor store that have been attested to by a certified public accountant or the state auditor within 180 days after the close of the fiscal year, except that the state auditor may extend the deadline upon request of a city and a showing of inability to conform. The state auditor may accept this report in lieu of the report required by subdivision 1.",
	"repealed": false
}