{
	"id": "116J.8731",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8731",
	"title": "116J.8731 MINNESOTA INVESTMENT FUND.",
	"text": "The Minnesota investment fund is created to provide financial and technical assistance, through partnership with communities, for the creation of new employment or to maintain existing employment, and for business start-up, expansions, and retention. It shall accomplish these goals by the following means:\n(1) creation or retention of permanent private-sector jobs in order to create above-average economic growth consistent with environmental protection, which includes investments in technology and equipment that increase productivity and provide for a higher wage;\n(2) stimulation or leverage of private investment to ensure economic renewal and competitiveness;\n(3) increasing the local tax base, based on demonstrated measurable outcomes, to guarantee a diversified industry mix;\n(4) improving the quality of existing jobs, based on increases in wages or improvements in the job duties, training, or education associated with those jobs;\n(5) improvement of employment and economic opportunity for citizens in the region to create a reasonable standard of living, consistent with federal and state guidelines on low- to moderate-income persons; and\n(6) stimulation of productivity growth through improved manufacturing or new technologies, including cold weather testing.\n(a) Except as otherwise provided in this section, the commissioner shall administer the fund as part of the Small Cities Development Block Grant Program and funds shall be made available to local communities and recognized Indian tribal governments in accordance with the rules adopted for economic development grants in the small cities community development block grant program. All units of general purpose local government are eligible applicants for Minnesota investment funds. The commissioner may provide forgivable loans directly to a private enterprise and not require a local community or recognized Indian tribal government application other than a resolution supporting the assistance.\n(b) Eligible applicants for the state-funded portion of the fund also include development authorities as defined in section 116J.552, subdivision 4, provided that the governing body of the municipality approves, by resolution, the application of the development authority. A local government entity may receive more than one award in a fiscal year. The commissioner may also make funds available within the department for eligible expenditures under subdivision 3, clause (2).\n(c) A home rule charter or statutory city, county, or town may loan or grant money received from repayment of funds awarded under this section to a regional development commission, other regional entity, or statewide community capital fund as determined by the commissioner, to capitalize or to provide the local match required for capitalization of a regional or statewide revolving loan fund.\nThe money appropriated for this section may be used to:\n(1) fund loans or grants for infrastructure, loans, loan guarantees, interest buy-downs, and other forms of participation with private sources of financing, provided that a loan to a private enterprise must be for a principal amount not to exceed one-half of the cost of the project for which financing is sought;\n(2) fund strategic investments in renewable energy market development, such as low interest loans for renewable energy equipment manufacturing, training grants to support renewable energy workforce, development of a renewable energy supply chain that represents and strengthens the industry throughout the state, and external marketing to garner more national and international investment into Minnesota's renewable sector. Expenditures in external marketing for renewable energy market development are not subject to the limitations in clause (1); and\n(3) provide private entrepreneurs with training, other technical assistance, and financial assistance, as provided in the small cities development block grant program.\nAssistance must be evaluated on the existence of the following conditions:\n(1) creation of new jobs, retention of existing jobs, or improvements in the quality of existing jobs as measured by the wages, skills, or education associated with those jobs;\n(2) increase in the tax base;\n(3) the project can demonstrate that investment of public dollars induces private funds;\n(4) the project can demonstrate an excessive public infrastructure or improvement cost beyond the means of the affected community and private participants in the project;\n(5) the project provides higher wage levels to the community or will add value to current workforce skills;\n(6) the project supports the development of microenterprises, as defined by federal statutes, through financial assistance, technical assistance, advice, or business services;\n(7) whether assistance is necessary to retain existing business;\n(8) whether assistance is necessary to attract out-of-state business; and\n(9) the project promotes or advances the green economy as defined in section 116J.437.\nA grant or loan cannot be made based solely on a finding that the conditions in clause (7) or (8) exist. A finding must be made that a condition in clause (1), (2), (3), (4), (5), or (6) also exists.\nApplications recommended for funding shall be submitted to the commissioner.\nA Minnesota investment fund grant may not be approved for an amount in excess of $1,000,000. This limit covers all money paid to complete the same project, whether paid to one or more grant recipients and whether paid in one or more fiscal years. A local community or recognized Indian tribal government may retain 40 percent, but not more than $100,000, of a Minnesota investment fund grant when it is repaid to the local community or recognized Indian tribal government by the person or entity to which it was loaned by the local community or Indian tribal government. Money repaid to the state must be credited to a Minnesota investment revolving loan account in the state treasury. Funds in the account are appropriated to the commissioner and must be used in the same manner as are funds appropriated to the Minnesota investment fund. Funds repaid to the state through existing Minnesota investment fund agreements must be credited to the Minnesota investment revolving loan account effective July 1, 2005. A grant or loan may not be made to a person or entity for the operation or expansion of a casino or a store which is used solely or principally for retail sales. Persons or entities receiving grants or loans must pay each employee total compensation, including benefits not mandated by law, that on an annualized basis is equal to at least 110 percent of the federal poverty level for a family of four.\nA Minnesota investment fund grant or loan cannot be used for a project related to a sports facility. For the purpose of this subdivision, \"sports facility\" means a building that has a professional sports team as a principal tenant.\nA business receiving Minnesota investment fund grants must demonstrate why the grant is necessary for a project and enter into an agreement with the local grantor. The agreement, among other things, must obligate the recipient to pay the minimum compensation set by this section and meet job creation or job enhancement goals. A recipient that breaches the agreement must repay the grant directly to the commissioner. Repayments under this subdivision must be deposited in the Minnesota investment revolving loan account. If the commissioner determines, during the repayment period of a Minnesota investment fund loan, that the project for which the loan was made is in imminent danger of ceasing operations due to financial difficulties, the commissioner may elect to delay loan payments due on the loan for a period of no more than two years. In making a determination about whether a recipient qualifies for possible delay in payments, the commissioner must consider all available information regarding the health of the affected business and the industry in which it operates, the potential for displacement of workers in the event that operations cease, and the likelihood that a delay of payments will provide the business with a reasonable ability to improve its financial condition.\nThere is created a Minnesota investment fund disaster contingency account in the special revenue fund. Repayment of loan amounts to the local government unit or development authority under this section shall be forwarded to the commissioner and deposited in the disaster contingency account in the Minnesota investment fund to be appropriated by law for future disaster relief.\n(a) All awards under section 12A.07 are subject to the requirements in this subdivision.\n(b) Eligible applicants are subject to the following requirements:\n(1) Applicants may be any business or nonprofit organization in the area included in the disaster declaration that was directly and adversely affected by the disaster. This includes: businesses, cooperatives, utilities, industrial, commercial, retail, and nonprofit organizations, including those nonprofits that provide residential, health care, child care, social, or other services on behalf of the Department of Human Services to residents included in the disaster area.\n(2) Business applicants must be organized as a proprietorship, partnership, LLC, or a corporation.\n(3) Applicants must have been in operation before the date of the disaster.\n(c) Loan funds may be used to assist businesses only in their recovery efforts but are not available to provide relief from economic losses.\n(d) Eligible costs may include the following: repair of buildings, leasehold improvements, fixtures and/or equipment, loss of inventory, and cleanup costs.\n(e) Ineligible activities include all of the following:\n(1) Any applicants not meeting the eligibility requirements outlined in this subdivision are ineligible to receive recovery loan funds.\n(2) Funds may not be used for lending or investment operations, land speculation, or any activity deemed illegal by federal, state, or local law or ordinance.\n(3) Ineligible costs include but are not limited to: economic injury losses, relocation, management fees, financing costs, franchise fees, debt consolidation, moving costs, refinancing debt existing prior to the date of the disaster, and operating costs.\n(f) Loan application: All parties seeking recovery loan funds must file an application with the local unit of government or development authority. Small Business Administration (SBA) application forms may be used. Applications must be transmitted in the form and manner prescribed by the commissioner.\n(g) Only completed applications will be reviewed for consideration. Submittal of the following information constitutes a complete application:\n(1) Minnesota investment fund recovery loan fund application;\n(2) business SBA disaster application, if applicable;\n(3) regional development organization or responsible local government application, if applicable;\n(4) administrative contact;\n(5) business release for local government to review SBA damage assessment/loss verification, if applicable;\n(6) proof of loss statement from insurer;\n(7) construction cost estimates;\n(8) invoices for work completed;\n(9) quotes for equipment;\n(10) proposed security;\n(11) company historical financial statements for the 24 months immediately prior to the application date;\n(12) credit check release;\n(13) number of jobs to be retained;\n(14) wages paid;\n(15) amount of loan request;\n(16) documentation of damages incurred;\n(17) property taxes paid and current;\n(18) judgments, liens, agreements, consent decrees, stipulations for settlements, or other such actions which would prevent the applicant from participating in any program administered by the responsible local, state, or regional government;\n(19) compliance with all applicable local ordinances and plans;\n(20) documentation through financial and tax records that the business was a viable operating entity at the time of the flood;\n(21) business tax identification number; and\n(22) other documentation as requested.\n(h) Incomplete applications will be assigned pending status and the applicant will be informed in writing of the missing documentation.\n(i) Applicant eligibility will be determined using criteria enumerated in paragraph (b). A credit check for the company and each of its principal owners may be conducted. An owner's encumbrance report will be completed by the Recorder's Office.\n(j) A grant recipient is eligible for assistance provided under this section only after the recipient has claimed all applicable private insurance and the recipient has utilized all other sources of applicable assistance available under the act appropriating funding for the grant.\nThe commissioner may transfer up to $5,000,000 of a fiscal year's appropriation between the Minnesota job creation fund program and Minnesota investment fund to meet business demand.",
	"repealed": false
}