{
	"id": "60A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.29",
	"title": "60A.29 NONPROFIT RISK INDEMNIFICATION TRUST ACT.",
	"text": "This section may be cited as the \"Nonprofit Risk Indemnification Trust Act.\"\nThe purpose of this section is to authorize the establishment of trust funds for the purpose of indemnifying nonprofit beneficiary organizations and their officers, directors, and agents for financial loss due to the imposition of legal liability or for damage or destruction of property, and to regulate the operation of trust funds established under this section.\nNo trust fund with the purpose of indemnifying multiple nonprofit beneficiary organizations shall be established without the prior approval of the commissioner of the Department of Commerce. The commissioner shall withhold approval of any trust fund that fails to comply with the provisions and requirements of this section.\nNo organization, corporation, agency, or program shall be a beneficiary of any trust fund established under this section unless it is exempt from taxation under section 501(c)(3) of the Internal Revenue Code of 1954, as amended through December 30, 1985. No trust fund established under this section shall agree to indemnify the state of Minnesota, any political subdivision of the state, or any hospital licensed pursuant to section 144.55. No trust fund established under this section shall indemnify any beneficiary for loss or damage to property permanently located outside the boundaries of this state or for legal liabilities arising from operations or activities occurring outside this state, except where those operations or activities are of a nonroutine nature; provided, however, that this restriction shall not apply to a beneficiary which is incorporated under the laws of this state and has its principal office located in this state.\nNo trust fund established under this section shall indemnify any beneficiary for liabilities incurred under the Workers' Compensation Act, or for benefits provided to employees pursuant to any medical, dental, life, or disability income protection plan.\nEvery trust fund established under this section shall establish in its bylaws or plan of operation a schedule of benefits, to be approved by the commissioner, governing the indemnification of beneficiaries of the trust. The schedule of benefits shall include all conditions, limitations, and exclusions relevant to indemnification.\nEvery trust fund established under this section shall provide each of its beneficiaries with a written indemnification agreement specifying the rights and obligations of the trust fund and the beneficiary under the agreement. Each form of indemnification agreement shall be filed with and approved by the commissioner.\nThe trust fund shall establish contributions required of beneficiaries necessary to fund the operations of the fund. All contribution schedules shall be filed with and approved by the commissioner prior to use. Contributions must be based on sound actuarial principles and be adequate to fund the operation of the trust fund. Contributions may not be excessive, in relation to the benefits provided, or unfairly discriminatory.\nNo trust fund established under this section shall enter into an agreement with any other trust fund whereby the risks assumed by each are pooled or shared.\nEvery trust fund established under this section shall be governed by a board of no fewer than five trustees. The initial trustees need not be appointed or elected by the beneficiaries of the trust fund. During the second year following the creation of an authorized trust fund, at least one-fourth of all its trustees in office shall have been elected or appointed by the beneficiaries. After the end of the second year following the creation of an authorized trust fund, a majority of all trustees in office shall have been elected or appointed by the beneficiaries. All trustees serving during the first two years following the creation of an authorized trust fund shall be elected or appointed for one-year terms. All trustees serving thereafter shall be elected or appointed for two-year terms, provided that the trustees may be elected or appointed for one-year terms to the extent necessary in order to create staggered terms. Any trustee may be removed at any time, with or without cause, by a majority vote of the beneficiaries. The board of trustees shall meet no fewer than four times each year.\nNo trustee shall be paid a salary or receive other compensation for service as a trustee, except that the bylaws or plan of operation may provide for reimbursement for actual expenses incurred on behalf of the trust fund and for the payment of a reasonable per diem amount for attendance at meetings of the board.\nThe trustees of each trust fund authorized under this section shall cause to be adopted a set of bylaws or plan of operation which shall govern the operation of the trust fund. All bylaws or plans of operation or amendments to them are subject to prior approval by the commissioner. The commissioner shall adopt rules governing the content and approval of bylaws or plans of operation.\nEvery trust fund authorized under this section shall, by June 1 of every year, file with the commissioner a financial statement for the previous year's operations. The financial statement must include the opinion of a certified public accountant that the statement was prepared in conformity with generally accepted accounting principles. Also by June 1 of every year, every trust fund must file with the commissioner, on forms provided by the department, a report summarizing the trust fund's operations during the previous year.\nEvery authorized trust fund shall have and maintain financial assets sufficient to satisfy all current and future financial obligations and responsibilities to beneficiaries. The commissioner shall adopt rules establishing minimum financial standards for authorized trust funds.\nAuthorized trust funds may enter into contracts with risk management service providers, actuarial consultants, or other vendors as are necessary to ensure the effective and efficient operation of the trust fund. Fees paid to vendors for services provided must not be excessive.\nAuthorized trust funds may insure or reinsure their obligations and liabilities with:\n(1) insurance companies authorized to do business in Minnesota, pursuant to section 60A.06;\n(2) insurance companies similarly authorized in any other state of the United States;\n(3) insurance companies not authorized in Minnesota or any other state if the unauthorized insurance company establishes reinsurance security in favor of the ceding trust fund conforming to the general rules for allowance of reinsurance credits stated in the Financial Condition Examiners Handbook adopted by the National Association of Insurance Commissioners; or\n(4) other trust funds organized under this section or under similar laws of any other state if the reinsuring trust fund establishes reinsurance security as specified in clause (3) in favor of the ceding trust fund.\nNo beneficiary shall have any cause of action against any other beneficiary arising solely out of the insolvency or inability of the trust fund to meet its obligations.\nThe commissioner may examine authorized trust funds to the same extent and with the same purpose as is provided, with respect to insurance companies, by section 60A.031.\nAs a condition of authorization, every trust fund shall deposit with the commissioner an acceptable security of a value equal to not less than $500,000. In the event that a trust fund fails to honor the obligations assumed by it under trust agreements issued to its beneficiaries, use of the security deposit shall revert to the commissioner for the purpose of executing the trust fund's obligations to its beneficiaries. The commissioner shall adopt rules governing the amount of security required and the acceptable forms of security.\nThe commissioner may adopt rules to enforce and administer the requirements of this section.\nTrust funds established under this section shall not be considered insurance companies or to be in the business of insurance nor shall they be subject to regulation by the commissioner, except as provided for in this section.\nA trust fund organized and existing under the laws of another state for the sole purpose of indemnifying nonprofit beneficiary organizations and their officers, directors, and agents for financial loss due to the imposition of legal liability or for damage or destruction of property, as provided in subdivisions 2 and 4, may apply to the commissioner for authority to operate within this state, provided that:\n(1) the trust fund has been continuously in operation for a period of not less than five years prior to the date it applies for authorization under this subdivision, during which period it must have issued only nonassessable indemnification agreements to its beneficiaries, and during each of those years the trust fund received not less than $1,000,000 in contributions from beneficiaries for protections afforded by the trust fund;\n(2) the trust fund has been authorized by and is subject to regulation and examination by the department of insurance of its domiciliary state;\n(3) the trust fund must file with the commissioner its trust agreement, bylaws or plan of operation, schedule of benefits, forms of indemnification agreements, and contribution schedules applicable to beneficiaries in this state;\n(4) the trust fund must be governed by a board of not fewer than five trustees, all of whom must be elected by the beneficiaries of the trust fund, and none of whom may receive compensation for service as a trustee;\n(5) the trust fund has, as of the last day of the calendar year immediately prior to its application for authority, a net fund balance surplus of not less than $1,000,000, as evidenced by its financial statements certified by an independent certified public accountant in accordance with generally accepted accounting principles consistently applied; and\n(6) the trust fund must, upon and at all times after authorization by the commissioner, maintain a registered office within this state.\nWithin 60 days after receipt of the documents specified under subdivision 22 and supporting evidence which establishes compliance with the standards set forth under that subdivision, the commissioner shall grant to the trust fund a certificate of authority to conduct operations in this state. The operations in this state are subject to the limitations and standards set forth in subdivisions 4 to 22. In the event an authorized foreign trust fund violates one of those subdivisions or the rules of the commissioner applicable to foreign trust funds, the commissioner may suspend or revoke the certificate of authority.\nThe commissioner may adopt rules to enforce and administer requirements of subdivisions 22 and 23.",
	"repealed": false
}