{
	"id": "298.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.28",
	"title": "298.28 DIVISION AND DISTRIBUTION OF PROCEEDS.",
	"text": "MS 1984 [Renumbered 298.28 subds 1-12]\nThe proceeds of the taxes collected under section 298.24, except the tax collected under section 298.24, subdivision 2, shall, upon certification of the commissioner of revenue, be allocated under subdivisions 2 to 12.\n[Repealed, 1977 c 423 art 10 s 30]\nMS 1984 [Renumbered 298.28 subd 13]\n(a) 4.5 cents per gross ton of merchantable iron ore concentrate, hereinafter referred to as \"taxable ton,\" plus the amount provided in paragraph (c), must be allocated to the city or town in the county in which the lands from which taconite was mined or quarried were located or within which the concentrate was produced. If the mining, quarrying, and concentration, or different steps in either thereof are carried on in more than one taxing district, the commissioner shall apportion equitably the proceeds of the part of the tax going to cities and towns among such subdivisions upon the basis of attributing 50 percent of the proceeds of the tax to the operation of mining or quarrying the taconite, and the remainder to the concentrating plant and to the processes of concentration, and with respect to each thereof giving due consideration to the relative extent of such operations performed in each such taxing district. The commissioner's order making such apportionment shall be subject to review by the Tax Court at the instance of any of the interested taxing districts, in the same manner as other orders of the commissioner.\n(b)(1) Four cents per taxable ton shall be allocated to cities and organized townships affected by mining because their boundaries are within three miles of a taconite mine pit that:\n(i) was actively mined by LTV Steel Mining Company in 1999; or\n(ii) has been actively mined in at least one of the prior three years.\n(2) If a city or town is located near more than one mine meeting the criteria under this paragraph, the city or town is eligible to receive aid calculated from only the mine producing the largest taxable tonnage. When more than one municipality qualifies for aid based on one company's production, the aid must be apportioned among the municipalities in proportion to their populations. The amounts distributed under this paragraph to each municipality must be used for infrastructure improvement projects.\n(c) The amount that would have been computed for the current year under Minnesota Statutes 2008, section 126C.21, subdivision 4, for a school district shall be distributed to the cities and townships within the school district in the proportion that their taxable net tax capacity within the school district bears to the taxable net tax capacity of the school district for property taxes payable in the year prior to distribution.\nMS 1984 [Renumbered 298.23 subd 14]\n(a) 12.5 cents per taxable ton, less any amount distributed under subdivision 8, and paragraph (b), must be allocated to the taconite municipal aid account to be distributed as provided in section 298.282. The amount allocated to the taconite municipal aid account must be annually increased in the same proportion as the increase in the implicit price deflator as provided in section 298.24, subdivision 1.\n(b) An amount must be allocated to towns or cities that is annually certified by the county auditor of a county containing a taconite tax relief area as defined in section 273.134, paragraph (b), within which there is (1) an organized township if, as of January 2, 1982, more than 75 percent of the assessed valuation of the township consists of iron ore or (2) a city if, as of January 2, 1980, more than 75 percent of the assessed valuation of the city consists of iron ore.\n(c) The amount allocated under paragraph (b) will be the portion of a township's or city's certified levy equal to the proportion of (1) the difference between 50 percent of January 2, 1982, assessed value in the case of a township and 50 percent of the January 2, 1980, assessed value in the case of a city and its current assessed value to (2) the sum of its current assessed value plus the difference determined in (1), provided that the amount distributed shall not exceed $55 per capita in the case of a township or $75 per capita in the case of a city. For purposes of this limitation, population will be determined according to the 1980 decennial census conducted by the United States Bureau of the Census. If the current assessed value of the township exceeds 50 percent of the township's January 2, 1982, assessed value, or if the current assessed value of the city exceeds 50 percent of the city's January 2, 1980, assessed value, this paragraph shall not apply. For purposes of this paragraph, \"assessed value,\" when used in reference to years other than 1980 or 1982, means the appropriate net tax capacities multiplied by 10.2.\n(d) In addition to other distributions under this subdivision, three cents per taxable ton for distributions in 2009 must be allocated for distribution to towns that are entirely located within the taconite tax relief area defined in section 273.134, paragraph (b). For distribution in 2010 through 2014 and for distribution in 2018 and subsequent years, the three-cent amount must be annually increased in the same proportion as the increase in the implicit price deflator as provided in section 298.24, subdivision 1. The amount available under this paragraph will be distributed to eligible towns on a per capita basis, provided that no town may receive more than $50,000 in any year under this paragraph. Any amount of the distribution that exceeds the $50,000 limitation for a town under this paragraph must be redistributed on a per capita basis among the other eligible towns, to whose distributions do not exceed $50,000.\n(a) 32.15 cents per taxable ton, plus the increase provided in paragraph (d), less the amount that would have been computed under Minnesota Statutes 2008, section 126C.21, subdivision 4, for the current year for that district, must be allocated to qualifying school districts to be distributed, based upon the certification of the commissioner of revenue, under paragraphs (b), (c), and (f).\n(b)(i) 3.43 cents per taxable ton must be distributed to the school districts in which the lands from which taconite was mined or quarried were located or within which the concentrate was produced. The distribution must be based on the apportionment formula prescribed in subdivision 2.\n(ii) Four cents per taxable ton from each taconite facility must be distributed to each affected school district for deposit in a fund dedicated to building maintenance and repairs, as follows:\n(1) proceeds from Keewatin Taconite or its successor are distributed to Independent School Districts Nos. 316, Coleraine, and 319, Nashwauk-Keewatin, or their successor districts;\n(2) proceeds from the Hibbing Taconite Company or its successor are distributed to Independent School Districts Nos. 695, Chisholm, and 701, Hibbing, or their successor districts;\n(3) proceeds from the Mittal Steel Company and Minntac or their successors are distributed to Independent School Districts Nos. 712, Mountain Iron-Buhl, 706, Virginia, 2711, Mesabi East, and 2154, Eveleth-Gilbert, or their successor districts;\n(4) proceeds from the Northshore Mining Company or its successor are distributed to Independent School Districts Nos. 2142, St. Louis County, and 381, Lake Superior, or their successor districts; and\n(5) proceeds from United Taconite or its successor are distributed to Independent School Districts Nos. 2142, St. Louis County, and 2154, Eveleth-Gilbert, or their successor districts.\nRevenues that are required to be distributed to more than one district shall be apportioned according to the number of pupil units identified in section 126C.05, subdivision 1, enrolled in the second previous year.\n(c)(i) 24.72 cents per taxable ton, less any amount distributed under paragraph (e), shall be distributed to a group of school districts comprised of those school districts which qualify as a tax relief area under section 273.134, paragraph (b), or in which there is a qualifying municipality as defined by section 273.134, paragraph (a), in direct proportion to school district indexes as follows: for each school district, its pupil units determined under section 126C.05 for the prior school year shall be multiplied by the ratio of the average adjusted net tax capacity per pupil unit for school districts receiving aid under this clause as calculated pursuant to chapters 122A, 126C, and 127A for the school year ending prior to distribution to the adjusted net tax capacity per pupil unit of the district. Each district shall receive that portion of the distribution which its index bears to the sum of the indices for all school districts that receive the distributions.\n(ii) Notwithstanding clause (i), each school district that receives a distribution under sections 298.018; 298.24; and 298.25 to 298.28, exclusive of any amount received under this clause; 298.34 to 298.39; 298.391 to 298.396; 298.405; or any law imposing a tax on severed mineral values after reduction for any portion distributed to cities and towns under section 126C.48, subdivision 8, paragraph (5), that is less than the amount of its levy reduction under section 126C.48, subdivision 8, for the second year prior to the year of the distribution shall receive a distribution equal to the difference; the amount necessary to make this payment shall be derived from proportionate reductions in the initial distribution to other school districts under clause (i). If there are insufficient tax proceeds to make the distribution provided under this paragraph in any year, money must be transferred from the taconite property tax relief account in subdivision 6, to the extent of the shortfall in the distribution.\n(d)(1) Any school district described in paragraph (c) where a levy increase pursuant to section 126C.17, subdivision 9, was authorized by referendum for taxes payable in 2001, shall receive a distribution of 21.3 cents per ton. Each district shall receive $175 times the pupil units identified in section 126C.05, subdivision 1, enrolled in the second previous year or the 1983-1984 school year, whichever is greater, less the product of 1.8 percent times the district's taxable net tax capacity in 2011.\n(2) Districts qualifying under paragraph (c) must receive additional taconite aid each year equal to 22.5 percent of the amount obtained by subtracting:\n(i) 1.8 percent of the district's net tax capacity for 2011, from:\n(ii) the district's weighted average daily membership for fiscal year 2012, multiplied by the sum of:\n(A) $415, plus\n(B) the district's referendum revenue allowance for fiscal year 2013.\nIf the total amount provided by paragraph (d) is insufficient to make the payments herein required then the entitlement of $175 per pupil unit shall be reduced uniformly so as not to exceed the funds available. Any amounts received by a qualifying school district in any fiscal year pursuant to paragraph (d) shall not be applied to reduce general education aid which the district receives pursuant to section 126C.13 or the permissible levies of the district. Any amount remaining after the payments provided in this paragraph shall be paid to the commissioner of Iron Range resources and rehabilitation who shall deposit the same in the taconite environmental protection fund and the Douglas J. Johnson economic protection trust fund as provided in subdivision 11.\nEach district receiving money according to this paragraph shall reserve the lesser of the amount received under this paragraph or $25 times the number of pupil units served in the district. It may use the money for early childhood programs.\n(e) There shall be distributed to any school district the amount which the school district was entitled to receive under section 298.32 in 1975.\n(f) Four cents per taxable ton must be distributed to qualifying school districts according to the distribution specified in paragraph (b), clause (ii), and 11 cents per taxable ton must be distributed according to the distribution specified in paragraph (c). These amounts are not subject to section 126C.48, subdivision 8.\n(a) 21.05 cents per taxable ton is allocated to counties to be distributed, based upon certification by the commissioner of revenue, under paragraphs (b) to (d).\n(b) 10.525 cents per taxable ton shall be distributed to the county in which the taconite is mined or quarried or in which the concentrate is produced, less any amount which is to be distributed pursuant to paragraph (c). The apportionment formula prescribed in subdivision 2 is the basis for the distribution.\n(c) 1.0 cent per taxable ton of the tax distributed to the counties under paragraph (b) shall be paid to a county that received a distribution under this section in 2000 because there was located in the county an electric power plant owned by and providing the primary source of power for a taxpayer mining and concentrating taconite in a different county.\n(d) 10.525 cents per taxable ton shall be paid to the county from which the taconite was mined, quarried or concentrated to be deposited in the county road and bridge fund. If the mining, quarrying and concentrating, or separate steps in any of those processes are carried on in more than one county, the commissioner shall follow the apportionment formula prescribed in subdivision 2.\n(a) In 2014 and thereafter, 34.8 cents per taxable ton, less any amount required to be distributed under paragraphs (b) and (c), must be allocated to St. Louis County acting as the counties' fiscal agent, to be distributed as provided in sections 273.134 to 273.136.\n(b) If an electric power plant owned by and providing the primary source of power for a taxpayer mining and concentrating taconite is located in a county other than the county in which the mining and the concentrating processes are conducted, .1875 cent per taxable ton of the tax imposed and collected from such taxpayer shall be paid to the county.\n(c) If an electric power plant owned by and providing the primary source of power for a taxpayer mining and concentrating taconite is located in a school district other than a school district in which the mining and concentrating processes are conducted, .4541 cent per taxable ton of the tax imposed and collected from the taxpayer shall be paid to the school district.\nFor the 1998 distribution, 6.5 cents per taxable ton shall be paid to the Iron Range resources and rehabilitation account for the purposes of section 298.22. That amount shall be increased for distribution years 1999 through 2014 and for distribution in 2018 and subsequent years in the same proportion as the increase in the implicit price deflator as provided in section 298.24, subdivision 1. The amount distributed pursuant to this subdivision shall be expended within or for the benefit of the taconite assistance area defined in section 273.1341.\n(a) The following amounts must be allocated to the commissioner of Iron Range resources and rehabilitation to be deposited in the Iron Range schools and community development account that is hereby created:\n(1)(i) for distributions in 2024 through 2032, 24 cents per taxable ton of the tax imposed under section 298.24, (ii) for distributions beginning in 2033, ten cents per taxable ton of the tax imposed under section 298.24;\n(2) the amount as determined under section 298.17, paragraph (b), clause (3); and\n(3) any other amount as provided by law.\n(b) Expenditures from this account may be approved as ongoing annual expenditures and shall be made only to provide disbursements to assist school districts with the payment of bonds that were issued for qualified school projects, or for any other school disbursement as approved by the commissioner of Iron Range resources and rehabilitation after consultation with the Iron Range Resources and Rehabilitation Board. For purposes of this section, \"qualified school projects\" means school projects within the taconite assistance area as defined in section 273.1341, that were (1) approved, by referendum, after April 3, 2006; and (2) approved by the commissioner of education pursuant to section 123B.71.\n(c) Beginning in fiscal year 2019, the disbursement to school districts for payments for bonds issued under section 123A.482, subdivision 9, must be increased each year to offset any reduction in debt service equalization aid that the school district qualifies for in that year, under section 123B.53, subdivision 6, compared with the amount the school district qualified for in fiscal year 2018.\n(d) No expenditure under this section shall be made unless approved by the commissioner of Iron Range resources and rehabilitation after consultation with the Iron Range Resources and Rehabilitation Board.\n0.50 cent per taxable ton shall be paid to the Range Association of Municipalities and Schools, for the purpose of providing an areawide approach to problems which demand coordinated and cooperative actions and which are common to those areas of northeast Minnesota affected by operations involved in mining iron ore and taconite and producing concentrate therefrom, and for the purpose of promoting the general welfare and economic development of the cities, towns, and school districts within the Iron Range area of northeast Minnesota.\nIn 1999, 3.35 cents per taxable ton shall be paid to the Douglas J. Johnson economic protection trust fund.\n(a) 25.1 cents per ton for distributions in 2002 and thereafter must be paid to the taconite economic development fund. No distribution shall be made under this paragraph in 2004 or any subsequent year in which total industry production falls below 30 million tons. Distribution shall only be made to a Minnesota taconite pellet producer's fund under section 298.227 if the producer timely pays its tax under section 298.24 by the dates provided under section 298.27, or pursuant to the due dates provided by an administrative agreement with the commissioner.\n(b) An amount equal to 50 percent of the tax under section 298.24 for concentrate sold in the form of pellet chips and fines not exceeding 5/16 inch in size and not including crushed pellets shall be paid to the taconite economic development fund. The amount paid shall not exceed $700,000 annually for all Minnesota taconite pellet producers. If the initial amount to be paid to the fund exceeds this amount, each Minnesota taconite pellet producer's payment shall be prorated so the total does not exceed $700,000.\nFive cents per ton must be paid to the taconite environmental fund for use under section 298.2961, subdivision 4.\n0.20 cent per taxable ton must be paid to the city of Eveleth for distribution in 2013 and thereafter, to be used for the support of the Hockey Hall of Fame, provided that it continues to operate in that city, and provided that the city of Eveleth certifies to the St. Louis County auditor that it has received donations for the support of the Hockey Hall of Fame from other donors. If the Hockey Hall of Fame ceases to operate in the city of Eveleth prior to receipt of the distribution in any year, and the governing body of the city determines that it is unlikely to resume operation there within a six-month period, the distribution under this subdivision shall be made to the commissioner of Iron Range resources and rehabilitation.\nFive cents per taxable ton must be deposited in an Iron Range higher education account that is hereby created, to be used for higher education programs conducted at educational institutions in the taconite assistance area defined in section 273.1341. The Iron Range Higher Education committee under section 298.2214, and the commissioner of Iron Range resources and rehabilitation, after consultation with the advisory board, must approve all expenditures from the account.\n(a) Except as provided in paragraph (b), for distributions in 2000 through 2014 and for distributions in 2018 and subsequent years, the amount determined under subdivision 9 shall be increased in the same proportion as the increase in the implicit price deflator as provided in section 298.24, subdivision 1. Beginning with distributions in 2018, the amount determined under subdivision 6, paragraph (a), shall be increased in the same proportion as the increase in the implicit price deflator as provided in section 298.24, subdivision 1.\n(b) For distributions in 2005 and subsequent years, an amount equal to the increased tax proceeds attributable to the increase in the implicit price deflator as provided in section 298.24, subdivision 1, for taxes paid in 2005, except for the amount of revenue increases provided in subdivision 4, paragraph (d), is distributed to the grant and loan fund established in section 298.2961, subdivision 4.\n(a) The proceeds of the tax imposed by section 298.24 which remain after the distributions and payments in subdivisions 2 to 10a, as certified by the commissioner of revenue, and paragraphs (b), (c), and (d) have been made, together with interest earned on all money distributed under this section prior to distribution, shall be divided between the taconite environmental protection fund created in section 298.223 and the Douglas J. Johnson economic protection trust fund created in section 298.292 as follows: Two-thirds to the taconite environmental protection fund and one-third to the Douglas J. Johnson economic protection trust fund. The proceeds shall be placed in the respective special accounts.\n(b) There shall be distributed to each city, town, and county the amount that it received under Minnesota Statutes 1978, section 294.26, in calendar year 1977; provided, however, that (1) the amount distributed in 1981 to the unorganized territory number 2 of Lake County and the town of Beaver Bay based on the between-terminal trackage of Erie Mining Company will be distributed in 1982 and subsequent years to the unorganized territory number 2 of Lake County and the towns of Beaver Bay and Stony River based on the miles of track of Erie Mining Company in each taxing district; and (2) a city located within six miles of five other cities qualifying for a distribution under section 298.282 shall receive a distribution equal to $5,000 under this paragraph in calendar year 2020 and subsequent years. The distribution to all other cites and towns receiving a distribution under this paragraph shall be reduced by the ratio that $5,000 bears to the total aid distribution received by all cities and towns under this paragraph.\n(c) There shall be distributed to the Iron Range resources and rehabilitation account the amounts it received in 1977 under Minnesota Statutes 1978, section 298.22. The amount distributed under this paragraph shall be expended within or for the benefit of the taconite assistance area defined in section 273.1341.\n(d) There shall be distributed to each school district 62 percent of the amount that it received under Minnesota Statutes 1978, section 294.26, in calendar year 1977.\n[Repealed, 2009 c 88 art 9 s 17]\nOn or before October 10 of each calendar year each producer of taconite, iron sulphides, and other iron-bearing material subject to taxation under section 298.24, hereinafter referred to as \"taxpayer,\" shall file with the commissioner of revenue an estimate of the amount of tax that would be payable by the taxpayer under the law for the calendar year; provided that the estimate shall be in an amount not less than the amount due on the mining and production of concentrates up to September 30 of the year plus the amount becoming due because of probable production between September 30 and December 31 of the year, less any credit allowable as provided in subdivision 13. The commissioner of revenue shall annually on or before October 10 report an estimated distribution amount to each taxing district and the officers with whom such report is so filed shall use the amount so indicated as being distributable to each taxing district in computing the permissible tax levy of the county or city in the year in which the estimate is made, and payable in the next calendar year, except that one cent per taxable ton of the amount distributed under subdivision 5, paragraph (d), shall not be deducted in calculating the permissible levy. In any calendar year in which a general property tax levy has been made, if the taxes distributable to any county or city are greater than the amount estimated by the commissioner to be paid to the county or city that year, the excess of the distribution shall be held in a special fund by the county or city and shall not be expended until the succeeding calendar year, and shall be included in computing the permissible levies of the county or city payable in such year. If the amounts distributable to the county or city after final determination by the commissioner of revenue under this section are less than the amounts by which a taxing district's levies were reduced pursuant to this section, the county or city may issue certificates of indebtedness in the amount of the shortage, and may include in its next tax levy an amount sufficient to pay the certificates of indebtedness and interest thereon, or, if no certificates were issued, an amount equal to the shortage.\n[Repealed, 2009 c 88 art 9 s 17]\n[Repealed, 1987 c 268 art 9 s 43]\nNotwithstanding any other provision of this section or any other law, if payment of taxes collected under section 298.24 is delayed past the due date because the taxpayer is a debtor in a pending bankruptcy proceeding, the amount paid shall be distributed as follows when received:\n(1) 50 percent to St. Louis County acting as the counties' fiscal agent, to be distributed as provided in sections 273.134 to 273.136;\n(2) 25 percent to the Douglas J. Johnson economic protection trust fund; and\n(3) 25 percent to the taconite environmental protection fund.\nOf the amount annually distributed to the Douglas J. Johnson Economic Protection Trust Fund under this section, $3,500,000 shall be transferred to the Iron Range schools and community development account under subdivision 7a. Any remaining amount of the amount annually distributed to the Douglas J. Johnson Economic Protection Trust Fund shall be transferred to the Iron Range resources and rehabilitation account under subdivision 7. The transfers under this subdivision must be made within ten days of the August payment.",
	"repealed": false
}