{
	"id": "15.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.059",
	"title": "15.059 ADVISORY COUNCILS AND COMMITTEES.",
	"text": "The terms, compensation and removal of members, and the expiration date of an advisory council or committee shall be governed by this section whenever specifically provided by law. As used in this section \"council or committee\" shall mean all advisory boards, councils, committees and commissions whose provisions are governed by this section.\nAn appointment to an advisory council or committee must be made in the manner provided in section 15.0597. The terms of the members of the advisory councils and committees shall be four years. The terms of one-half of the members shall be coterminous with the governor and the terms of the remaining one-half of the members shall end on the first Monday in January one year after the terms of the other members. If there is an odd number of members, the smallest possible majority of the members shall have terms coterminous with the governor. If the number of terms which can be served by a member of an advisory council or committee is limited by law, a partial term must be counted for this purpose if the time served by a member is greater than one-half of the duration of the regular term. If the membership is composed of categories of members from occupations, industries, political subdivisions, the public or other groupings of persons, and if the categories as specified in statute have two or more members each, the appointing authority shall appoint as nearly as possible one-half of the members in each category at each appointment date. Members may serve until their successors are appointed and qualify. If a successor has not been appointed by the July 1 after the scheduled end of a member's term, the term of the member for whom a successor has not been appointed shall be extended until the first Monday in January four years after the scheduled end of the term.\n(a) Members of the advisory councils and committees may be compensated at the rate of $55 a day spent on council or committee activities, when authorized by the council or committee, plus expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Members who, as a result of time spent attending council or committee meetings, incur child care expenses that would not otherwise have been incurred, may be reimbursed for those expenses upon council or committee authorization.\n(b) Members who are state employees or employees of political subdivisions must not receive the daily compensation for activities that occur during working hours for which they are compensated by the state or political subdivision. However, a state or political subdivision employee may receive the daily payment if the employee uses vacation time or compensatory time accumulated in accordance with a collective bargaining agreement or compensation plan for council or committee activity. Members who are state employees or employees of the political subdivisions of the state may receive the expenses provided for in this section unless the expenses are reimbursed by another source. Members who are state employees or employees of political subdivisions of the state may be reimbursed for child care expenses only for time spent on board activities that are outside their working hours.\n(c) Each council and committee must adopt internal standards prescribing what constitutes a day spent on council or committee activities for purposes of making daily payments under this subdivision.\nA member may be removed by the appointing authority at any time at the pleasure of the appointing authority. The chair of the advisory council or committee shall inform the appointing authority of a member missing the three consecutive meetings. After the second consecutive missed meeting and before the next meeting, the secretary of the council or committee shall notify the member in writing that the member may be removed for missing the next meeting. In the case of a vacancy on the board, the appointing authority shall appoint a person to fill the vacancy for the remainder of the unexpired term.\n[Repealed, 2014 c 286 art 1 s 5]\n[Repealed, 2001 c 161 s 58]\n[Repealed, 2014 c 286 art 1 s 5]\nIf the existence of an advisory task force is mandated by statute, the task force shall expire on the date specified in the enabling legislation. If no expiration date is specified, the task force shall expire two years after the effective date of the act creating the advisory task force. If the existence of a task force is authorized but not mandated by statute, the task force shall expire at the pleasure of the person or group which creates the task force, or two years after the first members of the task force are appointed, whichever is sooner. A person or group mandated or with discretionary authority to create a task force may create another task force to continue the work of a task force which expires, unless the enabling legislation specifies an expiration date or creation of another task force is prohibited by other law.\nMembers of advisory task forces shall not receive the per diem specified in this section but shall receive expenses in the same manner and amount as provided in the commissioner's plan under section 43A.18, subdivision 2. Members who, as a result of time spent attending task force meetings, incur child care expenses that would not otherwise have been incurred, may be reimbursed for those expenses upon task force authorization. Members who are state employees or employees of political subdivisions of the state may be reimbursed for child care expenses only for time spent on board activities that are outside their normal working hours. Members appointed to these advisory task forces shall serve until the expiration date of the advisory task force and may be removed pursuant to subdivision 4.",
	"repealed": false
}