{
	"id": "473.866",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.866",
	"title": "473.866 CONTESTED CASES; ADMINISTRATIVE AND JUDICIAL REVIEW.",
	"text": "The council's decision to require modification under section 473.175 may be contested by the affected local governmental unit. The unit shall have 60 days within which to request a hearing on the council's decision to require modification. If within 60 days the unit has not requested a hearing, the council shall make its final decision with respect to the required modifications. If an affected unit requests a hearing, the request for hearing shall be granted, and the hearing shall be conducted within 60 days by the state Office of Administrative Hearings in the manner provided by chapter 14 for contested cases. The 60-day period within which the hearing shall be conducted may be extended by mutual agreement of the council and the affected local governmental unit. The subject of the hearing shall not extend to questions concerning the need for or reasonableness of the metropolitan system plans or any part thereof. In the report of the administrative law judge the costs of the hearing shall be apportioned among the parties to the proceeding. Within 30 days after the receipt of the report the council shall, by resolution containing findings of fact and conclusions, make a final decision with respect to the required modifications of the comprehensive plan. Any party to the proceeding aggrieved by the decision of the council may appeal to the court in the manner provided in chapter 14 for contested cases. The record on appeal shall consist of: (1) the administrative law judge's record and report, and (2) the findings, conclusions and final decision of the council. The scope of review shall be that of section 14.69, provided that: (1) the court shall not give preference to either the administrative law judge's record and report or the findings, conclusions and final decision of the council, and (2) the decision of the court shall be based upon a preponderance of the evidence as contained in the record on appeal. The costs of the appeal shall be apportioned by the court.",
	"repealed": false
}