{
	"id": "62S.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.15",
	"title": "62S.15 AUTHORIZED LIMITATIONS AND EXCLUSIONS.",
	"text": "(a) No policy may be delivered or issued for delivery in this state as long-term care insurance if the policy limits or excludes coverage by type of illness, treatment, medical condition, or accident, except as follows:\n(1) preexisting conditions or diseases;\n(2) mental or nervous disorders; except that the exclusion or limitation of benefits on the basis of Alzheimer's disease is prohibited;\n(3) alcoholism and drug addiction;\n(4) illness, treatment, or medical condition arising out of war or act of war; participation in a felony, riot, or insurrection; service in the armed forces or auxiliary units; suicide, attempted suicide, or intentionally self-inflicted injury; or non-fare-paying aviation;\n(5) treatment provided in a government facility unless otherwise required by law, services for which benefits are available under Medicare or other government program except Medicaid, state or federal workers' compensation, employer's liability or occupational disease law, motor vehicle no-fault law; services provided by a member of the covered person's immediate family; and services for which no charge is normally made in the absence of insurance;\n(6) expenses for services or items available or paid under another long-term care insurance or health insurance policy; and\n(7) in the case of a qualified long-term care insurance contract, expenses for services or items to the extent that the expenses are reimbursable under title XVIII of the Social Security Act or would be so reimbursable but for the application of a deductible or coinsurance amount.\n(b) This subdivision does not prohibit exclusions and limitations by type of provider or territorial limitations. However, no long-term care issuer may deny a claim because services are provided in a state other than the state of policy issued under the following conditions:\n(1) when the state other than the state of policy issue does not have the provider licensing, certification, or registration required in the policy, but where the provider satisfies the policy requirements outlined for providers in lieu of licensure, certification, or registration; or\n(2) when the state other than the state of policy issue licenses, certifies, or registers the provider under another name.\nFor purposes of this paragraph, \"state of policy issue\" means the state in which the individual policy or certificate was originally issued.",
	"repealed": false
}