{
	"id": "488A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/488A.06",
	"title": "488A.06 BAILIFFS.",
	"text": "The sheriff with approval of a majority of the judges shall assign to the court a sufficient number of deputy sheriffs who shall act as bailiffs of the court. A bailiff shall be in attendance at all sessions of the court involving traffic or criminal matters, and serve all process and warrants and perform such other duties as may be directed by the judges of the court. The county board may with the approval of a majority of the judges contract with any municipality upon such terms as agreed upon for the services of police officers of the municipality to act as bailiffs at all sessions of the court in the municipality. Provided, however, and notwithstanding the provisions of any law to the contrary, the county board and the governing body of any town or city within the county shall have authority to contract for the service of such process and warrants by the police officers of such town or city within their respective boundaries upon such terms and conditions as may be agreed upon between the parties and approved by a majority of the judges of the court. Upon execution of such agreements, a copy thereof shall be delivered to the sheriff who may thereafter deliver for service the process and warrants to the local police officers for service pursuant to the terms of such agreement.\nNo bailiff shall serve or receive for service any summons or other paper in any eviction or civil action until the complaint has been filed with the court administrator. The bailiff to whom a summons or other paper is delivered for service shall make a prompt return to the court administrator showing whether or not it has been served and if not served the reason therefor.\nThe fees and mileage of bailiffs in civil actions and actions of eviction are the same as those payable to the sheriff of Hennepin County for like services for district court actions. The fees and mileage for all other services of bailiffs shall be fixed by rules promulgated by a majority of the judges. The fee provided for by chapter 349 of the Laws of 1953 is not payable. No fees or mileage are payable by the state, county or city to bailiffs for their services, except that the county may pay bailiffs for automobile mileage within the limits provided by law when the bailiffs furnish automobiles for use in the performance of their duties. Bailiffs shall make returns showing their fees and mileage after performing such services. The amount of the bailiffs' fees and mileage is payable to the sheriff in advance.\nExcept as provided in subdivision 3 above, such bailiffs shall be paid for their services only the compensation payable to them by the county as bailiffs. If any fee, gratuity, or reward is paid to any bailiff for services while on duty as a bailiff of the court, the bailiff shall forthwith pay it over to the court administrator for the use of the county. Failure to do so is a misdemeanor and is punishable by a fine not exceeding $100, or by imprisonment in the county jail or city workhouse for not more than 30 days.\nThe sheriff of Hennepin County shall transport defendants pursuant to rules promulgated by the court and orders of the court.",
	"repealed": false
}