{
	"id": "148.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.181",
	"title": "148.181 BOARD OF NURSING MEMBERSHIP, VACANCIES, DISCLOSURE.",
	"text": "(a) The Board of Nursing consists of 16 members appointed by the governor, each of whom must be a resident of this state. Eight members must be registered nurses, each of whom must have graduated from an approved school of nursing, must be licensed and currently registered as a registered nurse in this state, and must have had at least five years experience in nursing practice, nursing administration, or nursing education immediately preceding appointment. One of the eight must have had at least two years executive or teaching experience in a baccalaureate degree nursing program approved by the board under section 148.251 during the five years immediately preceding appointment, one of the eight must have had at least two years executive or teaching experience in an associate degree nursing program approved by the board under section 148.251 during the five years immediately preceding appointment, one of the eight must be practicing professional nursing in a nursing home at the time of appointment, one of the eight must have had at least two years executive or teaching experience in a practical nursing program approved by the board under section 148.251 during the five years immediately preceding appointment, and one of the eight must be licensed and have national certification or recertification as a registered nurse anesthetist, nurse practitioner, nurse midwife, or clinical nurse specialist. Four of the eight must have had at least five years of experience in nursing practice or nursing administration immediately preceding appointment. Four members must be licensed practical nurses, each of whom must have graduated from an approved school of nursing, must be licensed and currently registered as a licensed practical nurse in this state, and must have had at least five years experience in nursing practice immediately preceding appointment. The remaining four members must be public members as defined by section 214.02.\n(b) A member may be reappointed but may not serve more than two full terms consecutively. The governor shall attempt to make appointments to the board that reflect the geography of the state. The board members who are nurses should as a whole reflect the broad mix of practice types and sites of nurses practicing in Minnesota.\n(c) Membership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements are as provided in sections 214.07 to 214.09. Any nurse on the board who during incumbency permanently ceases to be actively engaged in the practice of nursing or otherwise becomes disqualified for board membership is automatically removed, and the governor shall fill the vacancy. The provision of staff, administrative services, and office space; the review and processing of complaints; the setting of board fees; and other provisions relating to board operations are as provided in sections 148.171 to 148.285 and chapter 214. Each member of the board shall file with the secretary of state the constitutional oath of office before beginning the term of office.\nOn expiration of the term of a member who is a registered nurse, the governor may appoint a registered nurse from a list of members submitted by professional nursing groups. Likewise on expiration of the term of a member who is a licensed practical nurse, the governor may appoint a licensed practical nurse from a list of members submitted by licensed practical nursing groups. These lists should contain names of persons in number at least twice the number of places to be filled. Vacancies occurring on the board, when the member is a registered nurse or a licensed practical nurse, may be filled for the unexpired terms by appointments to be made by the governor from nominations submitted by nursing groups in the manner aforesaid or from other recommendations. Members shall hold office until a successor is appointed and qualified.\nMS 1974 [Repealed, 1975 c 136 s 77]\n(a) A disciplinary hearing must be closed to the public.\n(b) Upon application of a party in a proceeding before the board under section 148.261, the board shall produce and permit the inspection and copying, by or on behalf of the moving party, of any designated documents or papers relevant to the proceedings, in accordance with rule 34 of the Minnesota Rules of Civil Procedure.",
	"repealed": false
}