{
	"id": "453.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/453.54",
	"title": "453.54 MUNICIPAL POWER AGENCIES; POWERS.",
	"text": "A municipal power agency shall have all of the powers enumerated in this section, in furtherance of the purpose stated in section 453.51, and in the exercise thereof shall be deemed to be performing an essential governmental function and exercising a part of the sovereign powers of the state of Minnesota. All powers of the municipal power agency shall be exercised by its board of directors, unless otherwise provided by the agency agreement or bylaws.\nIt may plan, acquire, construct, reconstruct, operate, maintain, repair, extend, or improve one or more projects within or outside the state; or acquire any interest in or any right to capacity of a project and may act as agent, or designate one or more of the other persons participating in a project to act as its agent, in connection with the planning, acquisition, construction, reconstruction, operation, maintenance, repair, extension, or improvement of the project.\nIt may investigate the desirability of and necessity for additional sources and supplies of electric energy, and make studies, surveys, and estimates as may be necessary to determine the feasibility and cost thereof.\nIt may cooperate with other persons in the development of sources and supplies of electric energy.\nIt may apply to any public agency for consents, authorizations, or approvals required for any project within its powers and take all actions necessary to comply with the conditions thereof.\nIt may perform any act authorized by sections 453.51 to 453.62 through or by means of its officers, agents, or employees or by contract with any person.\nIt may acquire, hold, use, and dispose of income, revenues, funds, and money.\nIt may invest in various technologies to minimize long-run costs of providing electrical services to consumers. These investments include energy conservation measures and renewable resources.\nIt may acquire, own, hire, use, operate, and dispose of personal property.\nIt may acquire, own, use, lease as lessor or lessee, operate, and dispose of real property and interests in real property, and make improvements thereon.\nIt may grant the use by franchise, lease, or otherwise, and make charges for the use of any property or facility owned or controlled by it.\nIt may borrow money and issue negotiable bonds or notes, secured or unsecured, in accordance with section 453.55.\nSubject to any agreement with bondholders or note holders, it may invest money of the municipal power agency not required for immediate use, including proceeds from the sale of any bonds or notes, in such obligations, securities, and other investments as the municipal power agency shall deem prudent, notwithstanding the provisions of any other law relating to the investment of public funds.\nIt may exercise the power of eminent domain in accordance with section 453.56.\nIt may determine the location and character of, and all other matters in connection with, any and all projects it is authorized to acquire, hold, establish, effectuate, operate, or control.\nIt may contract with any person, within or outside the state, for the construction of any project or for the sale, with or without advertising for bids, or transmission of electric energy generated by any project, or for any interest therein or any right to capacity thereof, on such terms and for such period of time as its board of directors determines.\nIt may purchase, sell, exchange, or transmit electric energy within and outside the state in such amounts as it shall determine to be necessary and appropriate to make the most effective use of its powers and to meet its responsibilities, and may enter into agreements with any person with respect to that purchase, sale, exchange, or transmission, on such terms and for such period of time as its board of directors determines.\nIt may procure insurance against any losses in connection with its property, operations, or assets in such amounts and from such insurers as it deems desirable.\nIt may contract for and accept any gifts or grants or loans of funds or property or financial or other aid in any form from any public agency or other person, and may comply, subject to the provisions of sections 453.51 to 453.62, with the terms and conditions thereof.\nIt may mortgage, pledge, and grant a security interest in any or all of its real and personal property to secure the payment of its bonds, notes, or other obligations or contracts.\nIt shall pay to each taxing authority within whose taxing jurisdiction its property is situated, in lieu of taxes on its property, the amounts of the taxes which would be payable if its property were owned by a private person. For this purpose the property of a municipal power agency shall be valued in the same manner and by the same procedure as the property of private persons.\nIt may exercise all other powers not inconsistent with the Constitution of the state of Minnesota or the United States Constitution, which powers may be reasonably necessary or appropriate for or incidental to the effectuation of its authorized purposes or to the exercise of any of the powers enumerated in this section, and generally may exercise in connection with its property and affairs, and in connection with property within its control, any and all powers which might be exercised by a natural person or a private corporation in connection with similar property and affairs.",
	"repealed": false
}