{
	"id": "137.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.70",
	"title": "137.70 UNIVERSITY NEIGHBORHOOD DEVELOPMENT.",
	"text": "In order to support and create an environment surrounding the campuses of the University of Minnesota in Minneapolis and Duluth, that is conducive to the purposes of higher education and a vital community, the Board of Regents and the cities of Minneapolis and Duluth shall create with the Marcy Holmes, Southeast Como, Prospect Park, and Cedar-Riverside neighborhood and business associations, an appropriate organization so that they cooperate in the development of those neighborhoods. The organization shall include representatives from the Marcy Holmes, Southeast Como, Prospect Park, and Cedar-Riverside neighborhood and business associations. The purpose of the organization is to improve the university's Minneapolis and Duluth campus area neighborhoods including, but not limited to, the following:\n(1) providing and supporting the development of good quality university neighborhood housing, including housing for students, faculty, employees, alumni, and others who may wish to live in the university area neighborhoods;\n(2) encouraging and assisting university faculty, staff, students, and others to live in the neighborhood as long-term residents;\n(3) supporting and assisting appropriate business development in commercial areas of the neighborhood; and\n(4) cooperating and coordinating planning and development in all matters affecting the neighborhood with local government, businesses, residents, and other stakeholders in the neighborhood.\nThe organization created by the Board of Regents and the city of Minneapolis shall include representatives from the organizations currently represented on the University District Alliance Steering Committee. The Board of Regents and the city of Duluth may establish the membership of an organization for the purposes of subdivision 1.\nThe Board of Regents and the cities of Minneapolis and Duluth shall report by January 15, 2010, to the chairs and ranking minority members of the legislative committees with primary jurisdiction over higher education policy and finance and economic development and housing finance on the status and activities of the organization that is created.",
	"repealed": false
}