{
	"id": "45.027",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.027",
	"title": "45.027 INVESTIGATIONS AND SUBPOENAS.",
	"text": "In connection with the duties and responsibilities entrusted to the commissioner, and Laws 1993, chapter 361, section 2, the commissioner of commerce may:\n(1) make public or private investigations within or without this state as the commissioner considers necessary to determine whether any person has violated or is about to violate any law, rule, or order related to the duties and responsibilities entrusted to the commissioner;\n(2) require or permit any person to file a statement in writing, under oath or otherwise as the commissioner determines, as to all the facts and circumstances concerning the matter being investigated;\n(3) hold hearings, upon reasonable notice, in respect to any matter arising out of the duties and responsibilities entrusted to the commissioner;\n(4) conduct investigations and hold hearings for the purpose of compiling information related to the duties and responsibilities entrusted to the commissioner;\n(5) examine the books, accounts, records, and files of every licensee, and of every person who is engaged in any activity regulated; the commissioner or a designated representative shall have free access during normal business hours to the offices and places of business of the person, and to all books, accounts, papers, records, files, safes, and vaults maintained in the place of business;\n(6) publish information which is contained in any order issued by the commissioner;\n(7) require any person subject to duties and responsibilities entrusted to the commissioner, to report all sales or transactions that are regulated. The reports must be made within ten days after the commissioner has ordered the report. The report is accessible only to the respondent and other governmental agencies unless otherwise ordered by a court of competent jurisdiction; and\n(8) assess a natural person or entity subject to the jurisdiction of the commissioner the necessary expenses of the investigation performed by the department when an investigation is made by order of the commissioner. The cost of the investigation shall be determined by the commissioner and is based on the salary cost of investigators or assistants and at an average rate per day or fraction thereof so as to provide for the total cost of the investigation. All money collected must be deposited into the general fund. A natural person or entity licensed under chapter 60K, 82, or 82B shall not be charged costs of an investigation if the investigation results in no finding of a violation. This clause does not apply to a natural person or entity already subject to the assessment provisions of sections 60A.03 and 60A.031.\nAn applicant, registrant, certificate holder, licensee, or other person subject to the jurisdiction of the commissioner shall comply with requests for information, documents, or other requests from the department within the time specified in the request, or, if no time is specified, within 30 days of the mailing of the request by the department. Applicants, registrants, certificate holders, licensees, or other persons subject to the jurisdiction of the commissioner shall appear before the commissioner or the commissioner's representative when requested to do so and shall bring all documents or materials that the commissioner or the commissioner's representative has requested.\nFor the purpose of any investigation, hearing, proceeding, or inquiry related to the duties and responsibilities entrusted to the commissioner, the commissioner or a designated representative may administer oaths and affirmations, subpoena witnesses, compel their attendance, take evidence, and require the production of books, papers, correspondence, memoranda, agreements, or other documents or records that the commissioner considers relevant or material to the inquiry.\nA subpoena issued pursuant to this subdivision must state that the person to whom the subpoena is directed may not disclose the fact that the subpoena was issued or the fact that the requested records have been given to law enforcement personnel except:\n(1) insofar as the disclosure is necessary to find and disclose the records; or\n(2) pursuant to court order.\nIn case of a refusal to appear or a refusal to obey a subpoena issued to any person, the district court, upon application by the commissioner, may issue to any person an order directing that person to appear before the commissioner, or the officer designated by the commissioner, there to produce documentary evidence if so ordered or to give evidence relating to the matter under investigation or in question. Failure to obey the order of the court may be punished by the court as a contempt of court.\nNo person is excused from attending and testifying or from producing any document or record before the commissioner, or from obedience to the subpoena of the commissioner or any officer designated by the commissioner or in a proceeding instituted by the commissioner, on the ground that the testimony or evidence required may tend to incriminate that person or subject that person to a penalty of forfeiture. No person may be prosecuted or subjected to a penalty or forfeiture for or on account of a transaction, matter, or thing concerning which the person is compelled, after claiming the privilege against self-incrimination, to testify or produce evidence, documentary or otherwise, except that the individual is not exempt from prosecution and punishment for perjury or contempt committed in testifying.\nWhenever it appears to the commissioner that any person has engaged or is about to engage in any act or practice constituting a violation of any law, rule, or order related to the duties and responsibilities entrusted to the commissioner, the commissioner may bring an action in the name of the state in Ramsey County District Court or the district court of an appropriate county to enjoin the acts or practices and to enforce compliance, or the commissioner may refer the matter to the attorney general or the county attorney of the appropriate county. A permanent injunction or other appropriate relief must be granted based solely upon a showing that the person has engaged or is about to engage in an act or practice constituting a violation of a law, rule, cease and desist order, or other order related to the duties and responsibilities entrusted to the commissioner. The terms of this subdivision govern an action brought under this subdivision, including an action against a person who, for whatever reason, claims that the subject law, rule, cease and desist order or other order does not apply to the person.\n(a) Whenever it appears to the commissioner that a person has engaged or is about to engage in an act or practice constituting a violation of a law, rule, or order related to the duties and responsibilities entrusted to the commissioner, the commissioner may issue and cause to be served upon the person an order requiring the person to cease and desist from violations.\n(b) The cease and desist order must be calculated to give reasonable notice of the rights of the person to request a hearing and must state the reasons for the entry of the order. A hearing must be held not later than ten days after the request for the hearing is received by the commissioner. After the completion of the hearing, the administrative law judge shall issue a report within ten days. Within 15 days after receiving the administrative law judge's report, the commissioner shall issue a further order vacating or making permanent the cease and desist order. The time periods provided in this provision may be waived by agreement of the person requesting the hearing and the Department of Commerce and the person against whom the cease and desist order is issued. If the person to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person is in default, and the proceeding may be determined against that person upon consideration of the cease and desist order, the allegations of which may be considered to be true. Unless otherwise provided, all hearings must be conducted according to chapter 14. The commissioner may adopt rules of procedure concerning all proceedings conducted under this subdivision.\n(c) If no hearing is requested within 30 days of service of the order, the cease and desist order will become permanent.\n(d) A cease and desist order issued under this subdivision remains in effect until it is modified or vacated by the commissioner. The administrative proceeding provided by this subdivision, and subsequent appellate judicial review of that administrative proceeding, constitutes the exclusive remedy for determining whether the commissioner properly issued the cease and desist order and whether the cease and desist order should be vacated or made permanent.\n(a) Whenever the commissioner under subdivision 5 seeks to enforce compliance with a cease and desist order that has been made permanent, the allegations in the cease and desist order are considered conclusively established for purposes of a proceeding under subdivision 5 for permanent or temporary relief to enforce the cease and desist order. Whenever the commissioner under subdivision 5 seeks to enforce compliance with a cease and desist order when a hearing or hearing request on the cease and desist order is pending, or the time has not yet expired to request a hearing on whether a cease and desist order should be vacated or made permanent, the allegations in the cease and desist order are considered conclusively established for purposes of a proceeding under subdivision 5 for temporary relief to enforce the cease and desist order.\n(b) Notwithstanding this subdivision or subdivision 5 or 5a to the contrary, the person against whom the cease and desist order is issued and who has requested a hearing under subdivision 5a may within 15 days after service of cease and desist order bring an action in Ramsey County District Court for issuance of an injunction to suspend enforcement of the cease and desist order pending a final decision of the commissioner under subdivision 5a to vacate or make permanent the cease and desist order. The court shall determine whether to issue such an injunction based on traditional principles of temporary relief.\nThe commissioner may impose a civil penalty not to exceed $10,000 per violation upon a person who violates any law, rule, or order related to the duties and responsibilities entrusted to the commissioner unless a different penalty is specified. If a civil penalty is imposed on a health carrier as defined in section 62A.011, the commissioner must divide 50 percent of the amount among any policyholders or certificate holders affected by the violation, unless the commissioner certifies in writing that the division and distribution to enrollees would be too administratively complex or that the number of enrollees affected by the penalty would result in a distribution of less than $50 per enrollee.\n(a) In addition to any other actions authorized by this section, the commissioner may, by order, deny, suspend, or revoke the authority or license of a person subject to the duties and responsibilities entrusted to the commissioner, as described under section 45.011, subdivision 4, or censure that person if the commissioner finds that:\n(1) the order is in the public interest; and\n(2) the person has violated any law, rule, or order related to the duties and responsibilities entrusted to the commissioner; or\n(3) the person has provided false, misleading, or incomplete information to the commissioner or has refused to allow a reasonable inspection of records or premises; or\n(4) the person has engaged in an act or practice, whether or not the act or practice directly involves the business for which the person is licensed or authorized, which demonstrates that the applicant or licensee is untrustworthy, financially irresponsible, or otherwise incompetent or unqualified to act under the authority or license granted by the commissioner.\n(b)(1) The commissioner shall issue an order requiring a licensee or applicant for a license to show cause why the license should not be revoked or suspended, or the licensee censured, or the application denied and provide the licensee or applicant an opportunity to request a hearing under the contested case provisions of chapter 14. The order must: (i) state the reasons that an order is being sought and whether a civil penalty is sought; and (ii) inform the licensee or applicant that unless the licensee or applicant requests a hearing on the matter within 30 days of receipt of the order, it becomes final by operation of law and that a final order will be issued under paragraph (a). If a hearing is requested by the licensee or applicant pursuant to item (ii): (A) the commissioner shall, within 15 days of receiving the request, set the date and time for the hearing and notify the licensee or applicant of those facts; and (B) the commissioner may modify, vacate, or extend the order, until the commissioner issues a final order under paragraph (a).\n(2) The commissioner may, by order, summarily suspend a license pending final determination of an order to show cause issued under clause (1). If a license is suspended pending final determination of an order to show cause and the licensee requests a hearing on the matter within 30 days of receipt of the order to show cause, a hearing on the merits must be held within 30 days of receipt of the hearing request. The summary suspension or summary revocation procedure does not apply to action by the commissioner against the certificate of authority of an insurer authorized to do business in Minnesota.\n(c) All hearings must be conducted according to chapter 14. After the hearing, the commissioner shall enter a final order disposing of the matter as the facts require. If the licensee or applicant fails to appear at a hearing after having been duly notified of it, the person is considered in default, and the proceeding may be determined against the licensee or applicant.\n(d) If an order becomes final because a person subject to an order does not timely request a hearing as provided in paragraph (b) or if the petition for judicial review is not timely filed after a hearing and a final order is issued by the commissioner as provided in paragraph (a), the commissioner may file a certified copy of the final order with the clerk of a court of competent jurisdiction. The final order so filed has the same effect as a judgment of the court and may be recorded, enforced, or satisfied in the same manner as a judgment of the court.\n(e) If a person does not comply with a final order under this section, the commissioner may petition a court of competent jurisdiction to enforce the order. The court may not require the commissioner to post a bond in an action or proceeding under this section. If the court finds, after service and opportunity for hearing, that the person was not in compliance with the order, the court may adjudge the person in civil contempt of the order. The court may impose a further civil penalty against the person for contempt in an amount up to $10,000 for each violation and may grant any other relief the court determines is just and proper in the circumstances.\n(f) Except for information classified as confidential under sections 60A.03, subdivision 9; 60A.031; 60A.93; and 60D.22, the commissioner may make any data otherwise classified as private or confidential pursuant to this section accessible to an appropriate person or agency if the commissioner determines that the access will aid the law enforcement process, promote public health or safety, or dispel widespread rumor or unrest. If the commissioner determines that private or confidential information should be disclosed, the commissioner shall notify the attorney general as to the information to be disclosed, the purpose of the disclosure, and the need for the disclosure. The attorney general shall review the commissioner's determination. If the attorney general believes that the commissioner's determination does not satisfy the purpose and intent of this paragraph, the attorney general shall advise the commissioner in writing that the information may not be disclosed. If the attorney general believes the commissioner's determination satisfies the purpose and intent of this provision, the attorney general shall advise the commissioner in writing, accordingly.\nAfter disclosing information pursuant to this provision, the commissioner shall advise the chairs of the senate and house of representatives judiciary committees of the disclosure and the basis for it.\n(a) The commissioner may release and disclose any active or inactive investigative information and data to any national securities exchange or national securities association registered under the Securities Exchange Act of 1934 when necessary for the requesting agency in initiating, furthering, or completing an investigation.\n(b) The commissioner may release any active or inactive investigative data relating to the conduct of the business of insurance to the Office of the Comptroller of the Currency or the Office of Thrift Supervision in order to facilitate the initiation, furtherance, or completion of the investigation.\nIn addition to any other actions authorized by this section, the commissioner may issue a stop order denying effectiveness to or suspending or revoking any registration.\nThe powers contained in subdivisions 1 to 8 are in addition to all other powers of the commissioner.\nChapter 364 does not apply to an applicant for a license or to a licensee where the underlying conduct on which the conviction is based would be grounds for denial, censure, suspension, or revocation of the license.\nIf a license lapses, is surrendered, withdrawn, terminated, or otherwise becomes ineffective, the commissioner may institute a proceeding under this subdivision within two years after the license was last effective and enter a revocation or suspension order as of the last date on which the license was in effect, or impose a civil penalty as provided for in subdivision 6.\nA revocation of a license prohibits the licensee from making a new application for a license for at least two years from the effective date of the revocation. The commissioner may, as a condition of reapplication, require the applicant to obtain a bond or comply with additional reasonable conditions of licensure the commissioner considers necessary to protect the public.",
	"repealed": false
}