{
	"id": "626A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.42",
	"title": "626A.42 ELECTRONIC DEVICE LOCATION INFORMATION.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Electronic communication service\" has the meaning given in section 626A.01, subdivision 17.\n(c) \"Electronic device\" means a device that enables access to or use of an electronic communication service, remote computing service, or location information service.\n(d) \"Government entity\" means a state or local agency, including but not limited to a law enforcement entity or any other investigative entity, agency, department, division, bureau, board, or commission or an individual acting or purporting to act for or on behalf of a state or local agency.\n(e) \"Location information\" means information concerning the location of an electronic device or unique identifier that, in whole or in part, is generated or derived from or obtained by the operation of an electronic device or unique identifier.\n(f) \"Location information service\" means the provision of a global positioning service or other mapping, locational, or directional information service.\n(g) \"Remote computing service\" has the meaning given in section 626A.34.\n(h) \"Tracking warrant\" means an order in writing, in the name of the state, signed by a court other than a court exercising probate jurisdiction, directed to a peace officer, granting the officer access to location information of an electronic device or unique identifier.\n(i) \"Unique identifier\" means any numeric or alphanumeric string that is associated with a single entity or account within a given electronic communication application or service.\n(a) Except as provided in paragraph (b), a government entity may not obtain the location information of an electronic device or unique identifier without a tracking warrant. A warrant granting access to location information must be issued only if the government entity shows that there is probable cause the person who possesses an electronic device or is using a unique identifier is committing, has committed, or is about to commit a crime. An application for a warrant must be made in writing and include:\n(1) the identity of the government entity's peace officer making the application, and the officer authorizing the application; and\n(2) a full and complete statement of the facts and circumstances relied on by the applicant to justify the applicant's belief that a warrant should be issued, including (i) details as to the particular offense that has been, is being, or is about to be committed, and (ii) the identity of the person, if known, committing the offense whose location information is to be obtained.\n(b) A government entity may obtain location information without a tracking warrant:\n(1) when the electronic device is reported lost or stolen by the owner;\n(2) in order to respond to the user's call or request for emergency services;\n(3) with the informed, affirmative, documented consent of the owner or user of the electronic device or unique identifier;\n(4) with the informed, affirmative consent of the legal guardian or next of kin of the owner or user if the owner or user is believed to be deceased or reported missing and unable to be contacted; or\n(5) in an emergency situation that involves the risk of death or serious physical harm to a person who possesses an electronic communications device pursuant to sections 237.82 and 237.83 or is using a unique identifier.\n(a) A tracking warrant issued under this section must authorize the collection of location information for a period not to exceed 60 days, or the period of time necessary to achieve the objective of the authorization, whichever is less.\n(b) Extensions of a tracking warrant may be granted, but only upon an application for an order and upon the judicial finding required by subdivision 2, paragraph (a). The period of extension must be for a period not to exceed 60 days, or the period of time necessary to achieve the objective for which it is granted, whichever is less.\n(c) Paragraphs (a) and (b) apply only to tracking warrants issued for the contemporaneous collection of electronic device or unique identifier location information.\n(a) Within a reasonable time but not later than 90 days after the court unseals the tracking warrant under this subdivision, the issuing or denying judge shall cause to be served on the persons named in the warrant and the application an inventory which shall include notice of:\n(1) the fact of the issuance of the warrant or the application;\n(2) the date of the issuance and the period of authorized, approved, or disapproved collection of location information, or the denial of the application; and\n(3) the fact that during the period location information was or was not collected.\n(b) A tracking warrant authorizing collection of location information must direct that:\n(1) the warrant be sealed for a period of 90 days or until the objective of the warrant has been accomplished, whichever is shorter; and\n(2) the warrant be filed with the court administrator within ten days of the expiration of the warrant.\n(c) The prosecutor may request that the tracking warrant, supporting affidavits, and any order granting the request not be filed. An order must be issued granting the request in whole or in part if, from affidavits, sworn testimony, or other evidence, the court finds reasonable grounds exist to believe that filing the warrant may cause the search or a related search to be unsuccessful, create a substantial risk of injury to an innocent person, or severely hamper an ongoing investigation.\n(d) The tracking warrant must direct that following the commencement of any criminal proceeding utilizing evidence obtained in or as a result of the search, the supporting application or affidavit must be filed either immediately or at any other time as the court directs. Until such filing, the documents and materials ordered withheld from filing must be retained by the judge or the judge's designee.\n(a) At the same time as notice is provided under subdivision 4, the issuing or denying judge shall report to the state court administrator:\n(1) the fact that a tracking warrant or extension was applied for;\n(2) the fact that the warrant or extension was granted as applied for, was modified, or was denied;\n(3) the period of collection authorized by the warrant, and the number and duration of any extensions of the warrant;\n(4) the offense specified in the warrant or application, or extension of a warrant;\n(5) whether the collection required contemporaneous monitoring of an electronic device's or unique identifier's location; and\n(6) the identity of the applying investigative or peace officer and agency making the application and the person authorizing the application.\n(b) On or before November 15 of each even-numbered year, the state court administrator shall transmit to the legislature a report concerning: (1) all tracking warrants authorizing the collection of location information during the two previous calendar years; and (2) all applications that were denied during the two previous calendar years. Each report shall include a summary and analysis of the data required to be filed under this subdivision. The report is public and must be available for public inspection at the Legislative Reference Library and the state court administrator's office and website.\n(a) Except as proof of a violation of this section, no evidence obtained in violation of this section shall be admissible in any criminal, civil, administrative, or other proceeding.\n(b) Any location information obtained pursuant to this chapter or evidence derived therefrom shall not be received in evidence or otherwise disclosed in any trial, hearing, or other proceeding in a federal or state court unless each party, not less than ten days before the trial, hearing, or proceeding, has been furnished with a copy of the tracking warrant, and accompanying application, under which the information was obtained. This ten-day period may be waived by the judge if the judge finds that it was not possible to furnish a party with the required information ten days before the trial, hearing, or proceeding and that a party will not be prejudiced by the delay in receiving the information.",
	"repealed": false
}