{
	"id": "332.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.33",
	"title": "332.33 LICENSING AND REGISTRATION.",
	"text": "Except as otherwise provided in this chapter, no person shall conduct business in Minnesota as a collection agency or debt buyer, as defined in sections 332.31 to 332.44, without having first applied for and obtained a collection agency license. A person acting under the authority of a collection agency, debt buyer, or as a collector must first register with the commissioner under this section. A registered collector may use one additional assumed name only if the assumed name is registered with and approved by the commissioner. A business that operates as a debt buyer must submit a completed license application no later than January 1, 2022. A debt buyer who has filed an application with the commissioner for a collection agency license prior to January 1, 2022, and whose application remains pending with the commissioner thereafter, may continue to operate without a license until the commissioner approves or denies the application.\nA person who carries on business as a collection agency or debt buyer without first having obtained a license or acts as a collector without first having registered with the commissioner pursuant to sections 332.31 to 332.44, or who carries on this business after the revocation, suspension, or expiration of a license or registration is guilty of a misdemeanor.\nLicenses issued or renewed and registrations received by the commissioner of commerce under sections 332.31 to 332.44 shall expire on June 30. Each collection agency license shall plainly state the name and business address of the licensee, and shall be posted in a conspicuous place in the office where the business is transacted. The fee for each collection agency license is $500, and renewal is $400. The fee for each collector registration and renewal is $10, which entitles the individual collector to work at a licensee's business location or in another location as provided under subdivision 5b. An additional branch license is not required for a location used under subdivision 5b. A collection agency licensee who desires to carry on business in more than one place shall procure a license for each place where the business is to be conducted.\nThe commissioner may require financial statements and references of all applicants for a license or registration as the commissioner considers necessary. The commissioner may make or cause to be made an independent investigation concerning the applicant's reputation, integrity, competence, and net worth, at the expense of the applicant for the initial investigation, not to exceed $500, and for that purpose may require a deposit against the cost of the investigation as the commissioner considers adequate. The investigation may cover all managerial personnel employed by or associated with the applicant.\nOn finding that an applicant for a license is not qualified under sections 332.31 to 332.44, the commissioner shall reject the application and shall give the applicant written notice of the rejection and the reasons for the rejection.\nA licensee, on behalf of an individual collector, must register with the state all individuals in the licensee's employ who are performing the duties of a collector as defined in sections 332.31 to 332.44. The licensee must apply for an individual collection registration in a form prescribed by the commissioner. The licensee shall verify on the form that the applicant has confirmed that the applicant meets the requirements to perform the duties of a collector as defined in sections 332.31 to 332.44. Upon submission of the application to the department, the individual may begin to perform the duties of a collector and may continue to do so unless the licensee is informed by the commissioner that the individual is ineligible.\nAn employee of a licensed collection agency may work from a location other than the licensee's business location if the licensee and employee comply with all requirements under this section that would apply if the employee were working at the business location.\nAll money received by the commissioner under this section shall be deposited in the general fund of the state treasury.\n(a) A licensee must give the commissioner written notice of a change in company name, address, or ownership not later than ten days after the change occurs. A registered individual collector must give written notice of a change of address, name, or assumed name no later than ten days after the change occurs.\n(b) Upon the death of any licensee, the license of the decedent may be transferred to the executor or administrator of the estate for the unexpired term of the license. The executor or administrator may be authorized to continue or discontinue the collection business of the decedent under the direction of the court having jurisdiction of the probate.\n(a) Each licensee must establish procedures to follow when screening an individual collector applicant prior to submitting an applicant to the commissioner for initial registration and at renewal.\n(b) The screening process for initial registration must be done at the time of hiring. The process must include a national criminal history record search, an attorney licensing search, and a county criminal history search for all counties where the applicant has resided within the five years immediately preceding the initial registration, to determine whether the applicant is eligible to be registered under section 332.35. Each licensee shall use a vendor that is a member of the National Association of Professional Background Screeners, or an equivalent vendor, to conduct this background screening process.\n(c) Screening for renewal of individual collector registration must include a national criminal history record search and a county criminal history search for all counties where the individual has resided during the immediate preceding year. Screening for renewal of individual collector registrations must take place no more than 60 days before the license expiration or renewal date. A renewal screening is not required if an individual collector has been subjected to an initial background screening within 12 months of the first registration renewal date. A renewal screening is required for all subsequent annual registration renewals.\n(d) The commissioner may review the procedures to ensure the integrity of the screening process. Failure by a licensee to establish these procedures is subject to action under section 332.40.\nThe commissioner must permit affiliated companies to operate under a single license and be subject to a single examination, provided that all of the affiliated company names are listed on the license.",
	"repealed": false
}