{
	"id": "256L.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.15",
	"title": "256L.15 PREMIUMS.",
	"text": "(a) Families with children and individuals shall pay a premium determined according to subdivision 2.\n(b) Members of the military and their families who meet the eligibility criteria for MinnesotaCare upon eligibility approval made within 24 months following the end of the member's tour of active duty shall have their premiums paid by the commissioner. The effective date of coverage for an individual or family who meets the criteria of this paragraph shall be the first day of the month following the month in which eligibility is approved. This exemption applies for 12 months.\n(c) Beginning July 1, 2009, American Indians enrolled in MinnesotaCare and their families shall have their premiums waived by the commissioner in accordance with section 5006 of the American Recovery and Reinvestment Act of 2009, Public Law 111-5. An individual must indicate status as an American Indian, as defined under Code of Federal Regulations, title 42, section 447.50, to qualify for the waiver of premiums. The commissioner shall accept attestation of an individual's status as an American Indian as verification until the United States Department of Health and Human Services approves an electronic data source for this purpose.\nThe commissioner may offer the following payment options to an enrollee:\n(1) payment by check;\n(2) payment by credit card;\n(3) payment by recurring automatic checking withdrawal;\n(4) payment by onetime electronic transfer of funds;\n(5) payment by wage withholding with the consent of the employer and the employee; or\n(6) payment by using state tax refund payments.\nAt application or reapplication, a MinnesotaCare applicant or enrollee may authorize the commissioner to use the Revenue Recapture Act in chapter 270A to collect funds from the applicant's or enrollee's refund for the purposes of meeting all or part of the applicant's or enrollee's MinnesotaCare premium obligation. The applicant or enrollee may authorize the commissioner to apply for the state working family tax credit on behalf of the applicant or enrollee. The setoff due under this subdivision shall not be subject to the $10 fee under section 270A.07, subdivision 1.\nOnly MinnesotaCare premiums paid for future months of coverage for which a health plan capitation fee has not been paid may be refunded.\n(a) The commissioner shall establish a sliding fee scale to determine the percentage of monthly individual or family income that households at different income levels must pay to obtain coverage through the MinnesotaCare program. The sliding fee scale must be based on the enrollee's monthly individual or family income.\n(b) Beginning January 1, 2014, MinnesotaCare enrollees shall pay premiums according to the premium scale specified in paragraph (d).\n(c) Paragraph (b) does not apply to:\n(1) children 20 years of age or younger; and\n(2) individuals with household incomes below 35 percent of the federal poverty guidelines.\n(d) The following premium scale is established for each individual in the household who is 21 years of age or older and enrolled in MinnesotaCare:\n(e) Beginning January 1, 2021, the commissioner shall adjust the premium scale established under paragraph (d) to ensure that premiums do not exceed the amount that an individual would have been required to pay if the individual was enrolled in an applicable benchmark plan in accordance with the Code of Federal Regulations, title 42, section 600.505 (a)(1).\nMS 2010 [Repealed, 2008 c 358 art 3 s 14]\n[Repealed, 2010 c 200 art 1 s 21]",
	"repealed": false
}