{
	"id": "85.053",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.053",
	"title": "85.053 STATE PARK PERMITS.",
	"text": "(a) The commissioner shall prepare and provide state park permits for each calendar year that state a motor vehicle may enter and use state parks, state recreation areas, and state waysides over 50 acres in area. State park permits must be available and placed on sale by January 1 of the calendar year that the permit is valid. A separate motorcycle permit may be prepared and provided by the commissioner.\n(b) An annual state park permit may be used from the time it is purchased for a 12-month period. State park permits in each category must be numbered consecutively for each year of issue.\n(c) State park permits shall be issued by employees of the Division of Parks and Recreation as designated by the commissioner. State park permits also may be consigned to and issued by agents designated by the commissioner who are not employees of the Division of Parks and Recreation. All proceeds from the sale of permits and all unsold permits consigned to agents shall be returned to the commissioner at such times as the commissioner may direct, but no later than the end of the calendar year for which the permits are effective. No part of the permit fee may be retained by an agent. An additional charge or fee in an amount to be determined by the commissioner, but not to exceed four percent of the price of the permit, may be collected and retained by an agent for handling or selling the permits.\nExcept as provided in section 85.054, a motor vehicle may not enter a state park, state recreation area, or state wayside over 50 acres in area, without a state park permit issued under this section or a state parks and trails plate issued under section 168.1295. Except for vehicles permitted under subdivisions 7, paragraph (a), clause (2), and 8, the state park permit must be affixed to the lower right corner windshield of the motor vehicle and must be completely affixed by its own adhesive to the windshield, or the commissioner may, by written order, provide an alternative means to display and validate state park permits. A motor vehicle owner or lessee is responsible for ensuring the owner's or lessee's vehicle has a state park permit, and the commissioner may issue warnings and citations under section 84.0835 to the owner or lessee of a vehicle not in compliance.\nNotwithstanding subdivision 2, the commissioner of natural resources may negotiate with the Minnesota Historical Society a special fee structure for the Split Rock Lighthouse state historic site within Split Rock Lighthouse State Park.\nThe commissioner shall prescribe and issue multiple-vehicle state park permits for persons who own more than one motor vehicle and who request the permit for additional vehicles on a form prescribed by the commissioner.\nThe commissioner shall prescribe a special state park permit for use of state parks, state recreation areas, or state waysides for one day under conditions prescribed by the commissioner. For campers, the permit shall allow for the use of the park where camped from the time of purchase until the camping check-out time of the following day.\nThe commissioner shall prescribe a special daily vehicle state park permit for groups for use of state parks, state recreation areas, or state waysides for up to one day under conditions prescribed by the commissioner.\n(a) The commissioner must issue an annual state park permit for no charge to any member of the 11 federally recognized tribes in Minnesota. To qualify for a free state park permit under this subdivision, an individual must present a qualifying tribal identification, as determined by each of the tribal governments, to the park attendant on duty or other designee of the commissioner.\n(b) For vehicles permitted under paragraph (a), the permit issued under this subdivision is valid only when displayed on a vehicle owned and occupied by the person to whom the permit is issued.\n(c) The commissioner may issue a daily state park permit free of charge to an individual who qualifies under paragraph (a) and does not own or operate a motor vehicle.\n(a) The commissioner shall prescribe and issue an employee's state park permit to state employees, peace officers, and contractors, that must enter areas where state park permits are required to perform official duties. An employee, peace officer, or contractor must display the special permit on the motor vehicle in the same manner as state park permits are displayed.\n(b) A motor vehicle displaying only an employee's state park permit may not enter a place where state park permits are required if the vehicle is used for purposes other than performing official duties.\n(a) The commissioner shall prescribe and issue special state park permits for:\n(1) a physically disabled person with a motor vehicle (i) that has disability plates issued under section 168.021, subdivision 1, or (ii) who has a permanent disability certificate issued under section 169.345 and who can demonstrate proof of ownership of the vehicle for which the state park permit is being purchased or proof of a leasehold interest in the vehicle for a term at least as long as the term of the permit;\n(2) a physically disabled person who: (i) does not own or operate a motor vehicle; (ii) possesses a statement certified under section 169.345, subdivision 2a; and (iii) applies to the commissioner in writing; and\n(3) a permanently disabled person who possesses an interagency access pass for people with permanent disabilities, issued by the federal government under the Federal Lands Recreation Enhancement Act.\n(b) For vehicles permitted under paragraph (a), clause (1), the permit or the decal issued under this subdivision is valid only when displayed on a vehicle owned and occupied by the person to whom the permit is issued.\n(a) Annual permits under subdivision 1 must be issued without a fee to active military personnel in any branch or unit of the United States armed forces or their dependents and to recipients of a Purple Heart medal. To qualify for a free permit under this subdivision, a person must present qualifying military identification or an annual pass for the United States military issued through the National Parks and Federal Recreational Lands Pass program to the park attendant on duty or other designee of the commissioner.\n(b) For purposes of this subdivision, the commissioner shall establish what constitutes qualifying military identification in the State Register.\n(c) For vehicles permitted under paragraph (a), the permit or decal issued under this subdivision is valid only when displayed on a vehicle owned and occupied by the person to whom the permit is issued.\n(d) The commissioner may issue a daily vehicle permit free of charge to an individual who qualifies under paragraph (a) and does not own or operate a motor vehicle.\nThe commissioner shall prescribe and issue a temporary permit for a vehicle that enters a park towed by a vehicle used for camping. The temporary permit shall be issued with the camping permit and allows the towed vehicle to be driven in state parks until the camping permit expires.\n(a) The commissioner shall issue an annual park permit for no charge to any veteran with any level of service-connected disability, as determined by the United States Department of Veterans Affairs, who presents each year a copy of the veteran's determination letter or other official form of validation issued by the United States Department of Veterans Affairs or the United States Department of Defense to a park attendant or commissioner's designee. For the purposes of this subdivision, \"veteran\" has the meaning given in section 197.447.\n(b) For vehicles permitted under paragraph (a), the permit or decal issued under this subdivision is valid only when displayed on a vehicle owned and occupied by the person to whom the permit is issued.\n(c) The commissioner may issue a daily vehicle permit free of charge to an individual who qualifies under paragraph (a) and does not own or operate a motor vehicle.",
	"repealed": false
}