{
	"id": "144G.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.60",
	"title": "144G.60 STAFFING REQUIREMENTS.",
	"text": "(a) Employees, contractors, and regularly scheduled volunteers of the facility are subject to the background study required by section 144.057 and may be disqualified under chapter 245C. Nothing in this subdivision shall be construed to prohibit the facility from requiring self-disclosure of criminal conviction information.\n(b) Data collected under this subdivision shall be classified as private data on individuals under section 13.02, subdivision 12.\n(c) Termination of a staff member in good faith reliance on information or records obtained under this section regarding a confirmed conviction does not subject the assisted living facility to civil liability or liability for unemployment benefits.\nAll staff persons providing assisted living services must be trained and competent in the provision of services consistent with current practice standards appropriate to the resident's needs, and promote and be trained to support the assisted living bill of rights.\n(a) Licensed health professionals and nurses providing services as staff members of a licensed facility must possess a current Minnesota license or registration to practice.\n(b) Licensed health professionals and registered nurses must be competent in assessing resident needs, planning appropriate services to meet resident needs, implementing services, and supervising staff if assigned.\n(c) Nothing in this section limits or expands the rights of nurses or licensed health professionals to provide services within the scope of their licenses or registrations, as provided by law.\n(a) Unlicensed personnel providing assisted living services must have:\n(1) successfully completed a training and competency evaluation appropriate to the services provided by the facility and the topics listed in section 144G.61, subdivision 2, paragraph (a); or\n(2) demonstrated competency by satisfactorily completing a written or oral test on the tasks the unlicensed personnel will perform and on the topics listed in section 144G.61, subdivision 2, paragraph (a); and successfully demonstrated competency on topics in section 144G.61, subdivision 2, paragraph (a), clauses (5), (7), and (8), by a practical skills test.\nUnlicensed personnel who only provide assisted living services listed in section 144G.08, subdivision 9, clauses (1) to (5), shall not perform delegated nursing or therapy tasks.\n(b) Unlicensed personnel performing delegated nursing tasks in an assisted living facility must:\n(1) have successfully completed training and demonstrated competency by successfully completing a written or oral test of the topics in section 144G.61, subdivision 2, paragraphs (a) and (b), and a practical skills test on tasks listed in section 144G.61, subdivision 2, paragraphs (a), clauses (5) and (7), and (b), clauses (3), (5), (6), and (7), and all the delegated tasks they will perform;\n(2) satisfy the current requirements of Medicare for training or competency of home health aides or nursing assistants, as provided by Code of Federal Regulations, title 42, section 483 or 484.36; or\n(3) have, before April 19, 1993, completed a training course for nursing assistants that was approved by the commissioner.\n(c) Unlicensed personnel performing therapy or treatment tasks delegated or assigned by a licensed health professional must meet the requirements for delegated tasks in section 144G.62, subdivision 2, paragraph (a), and any other training or competency requirements within the licensed health professional's scope of practice relating to delegation or assignment of tasks to unlicensed personnel.\nWhen a facility contracts with a temporary staffing agency, those individuals must meet the same requirements required by this section for personnel employed by the facility and shall be treated as if they are staff of the facility.",
	"repealed": false
}