{
	"id": "142G.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.76",
	"title": "142G.76 MFIP CONSOLIDATED FUND.",
	"text": "The consolidated fund is established to support counties and tribes in meeting their duties under this chapter. Counties and tribes must use funds from the consolidated fund to develop programs and services that are designed to improve participant outcomes as measured in section 142G.79, subdivision 2. Counties and tribes that administer MFIP eligibility may use the funds for any allowable expenditures under subdivision 2, including case management. Tribes that do not administer MFIP eligibility may use the funds for any allowable expenditures under subdivision 2, including case management, except those in subdivision 2, paragraph (a), clauses (1) and (6). All payments made through the MFIP consolidated fund to support a caregiver's pursuit of greater economic stability does not count when determining a family's available income.\n(a) The commissioner must restrict expenditures under the consolidated fund to benefits and services allowed under title IV-A of the federal Social Security Act. Allowable expenditures under the consolidated fund may include, but are not limited to:\n(1) short-term, nonrecurring shelter and utility needs that are excluded from the definition of assistance under Code of Federal Regulations, title 45, section 260.31, for families who meet the residency requirement in section 142G.12, subdivisions 1 and 1a. Payments under this subdivision are not considered TANF cash assistance and are not counted towards the 60-month time limit;\n(2) transportation needed to obtain or retain employment or to participate in other approved work activities or activities under a family stabilization plan;\n(3) direct and administrative costs of staff to deliver employment services for MFIP or family stabilization services; to administer financial assistance; and to provide specialized services intended to assist hard-to-employ participants to transition to work or transition from family stabilization services to MFIP;\n(4) costs of education and training including functional work literacy and English as a second language;\n(5) cost of work supports including tools, clothing, boots, telephone service, and other work-related expenses;\n(6) county administrative expenses as defined in Code of Federal Regulations, title 45, section 260(b);\n(7) services to parenting and pregnant teens;\n(8) supported work;\n(9) wage subsidies;\n(10) child care needed for MFIP or family stabilization services participants to participate in social services;\n(11) child care to ensure that families leaving MFIP will continue to receive child care assistance from the time the family no longer qualifies for transition year child care until an opening occurs under the basic sliding fee child care program;\n(12) services to help noncustodial parents who live in Minnesota and have minor children receiving MFIP assistance, but do not live in the same household as the child, obtain or retain employment; and\n(13) services to help families participating in family stabilization services achieve the greatest possible degree of self-sufficiency.\n(b) Administrative costs that are not matched with county funds as provided in subdivision 8 may not exceed 7.5 percent of a county's or 15 percent of a tribe's allocation under this section. The commissioner shall define administrative costs for purposes of this subdivision.\n(c) The commissioner may waive the cap on administrative costs for a county or tribe that elects to provide an approved supported employment, unpaid work, or community work experience program for a major segment of the county's or tribe's MFIP population. The county or tribe must apply for the waiver on forms provided by the commissioner. In no case shall total administrative costs exceed the TANF limits.\n[See Note.]\nFamilies with a minor child, a pregnant woman, or a noncustodial parent of a minor child receiving assistance, with incomes below 200 percent of the federal poverty guideline for a family of the applicable size, are eligible for services funded under the consolidated fund. Counties and tribes must give priority to families currently receiving MFIP or family stabilization services and families at risk of receiving MFIP. A county or tribe shall not impose a residency requirement on families, except for the residency requirement under section 142G.12.\n[See Note.]\n(a) Effective January 1, 2004, and each two-year period thereafter, each county and tribe must have in place an approved biennial service agreement related to the services and programs in this chapter. In counties with a city of the first class with a population over 300,000, the county must consider a service agreement that includes a jointly developed plan for the delivery of employment services with the city. Counties may collaborate to develop multicounty, multitribal, or regional service agreements.\n(b) The service agreements will be completed in a form prescribed by the commissioner. The agreement must include:\n(1) a statement of the needs of the service population and strengths and resources in the community;\n(2) numerical goals for participant outcomes measures to be accomplished during the biennial period. The commissioner may identify outcomes from section 142G.79, subdivision 2, as core outcomes for all counties and tribes;\n(3) strategies the county or tribe will pursue to achieve the outcome targets. Strategies must include specification of how funds under this section will be used and may include community partnerships that will be established or strengthened;\n(4) strategies the county or tribe will pursue under family stabilization services; and\n(5) other items prescribed by the commissioner in consultation with counties and tribes.\n(c) The commissioner shall provide each county and tribe with information needed to complete an agreement, including: (1) information on MFIP cases in the county or tribe; (2) comparisons with the rest of the state; (3) baseline performance on outcome measures; and (4) promising program practices.\n(d) The service agreement must be submitted to the commissioner by October 15, 2003, and October 15 of each second year thereafter. The county or tribe must allow a period of not less than 30 days prior to the submission of the agreement to solicit comments from the public on the contents of the agreement.\n(e) The commissioner must, within 60 days of receiving each county or tribal service agreement, inform the county or tribe if the service agreement is approved. If the service agreement is not approved, the commissioner must inform the county or tribe of any revisions needed prior to approval.\nBeginning January 1, 2005, no more than $3,000,000 of the funds annually appropriated to the commissioner for use in the consolidated fund shall be available to the commissioner to reward high-performing counties and tribes, support promising practices, and test innovative approaches to improving outcomes for MFIP participants, family stabilization services participants, and persons at risk of receiving MFIP as detailed in subdivision 3. Project funds may be targeted to geographic areas with poor outcomes as specified in section 142G.79, subdivision 3, or to subgroups within the MFIP case load who are experiencing poor outcomes.\n(a) For purposes of this section, the following terms have the meanings given.\n(1) \"2002 historic spending base\" means the commissioner's determination of the sum of the reimbursement related to fiscal year 2002 of county or tribal agency expenditures for the base programs listed in clause (6), items (i) through (iv), and earnings related to calendar year 2002 in the base program listed in clause (6), item (v), and the amount of spending in fiscal year 2002 in the base program listed in clause (6), item (vi), issued to or on behalf of persons residing in the county or tribal service delivery area.\n(2) \"Adjusted caseload factor\" means a factor weighted:\n(i) 47 percent on the MFIP cases in each county at four points in time in the most recent 12-month period for which data is available multiplied by the county's caseload difficulty factor; and\n(ii) 53 percent on the count of adults on MFIP in each county and tribe at four points in time in the most recent 12-month period for which data is available multiplied by the county or tribe's caseload difficulty factor.\n(3) \"Caseload difficulty factor\" means a factor determined by the commissioner for each county and tribe based upon the self-support index described in section 142G.79, subdivision 2, clause (6).\n(4) \"Initial allocation\" means the amount potentially available to each county or tribe based on the formula in paragraphs (b) through (d).\n(5) \"Final allocation\" means the amount available to each county or tribe based on the formula in paragraphs (b) through (d), after adjustment by subdivision 7.\n(6) \"Base programs\" means the:\n(i) MFIP employment and training services under Minnesota Statutes 2002, section 256J.62, subdivision 1, in effect June 30, 2002;\n(ii) bilingual employment and training services to refugees under Minnesota Statutes 2002, section 256J.62, subdivision 6, in effect June 30, 2002;\n(iii) work literacy language programs under Minnesota Statutes 2002, section 256J.62, subdivision 7, in effect June 30, 2002;\n(iv) supported work program authorized in Laws 2001, First Special Session chapter 9, article 17, section 2, in effect June 30, 2002;\n(v) administrative aid program under Minnesota Statutes 2002, section 256J.76 in effect December 31, 2002; and\n(vi) emergency assistance program under Minnesota Statutes 2002, section 256J.48, in effect June 30, 2002.\n(b) The commissioner shall determine for calendar year 2008 and subsequent years the initial allocation of funds to be made available under this section based 50 percent on the proportion of the county or tribe's share of the statewide 2002 historic spending base and 50 percent on the proportion of the county or tribe's share of the adjusted caseload factor.\n(c) With the commencement of a new or expanded tribal TANF program, or for tribes administering TANF as authorized under Laws 2011, First Special Session chapter 9, article 9, section 18, or an agreement under section 142A.03, subdivision 2, paragraph (e), clause (7), in which some or all of the responsibilities of particular counties under this section are transferred to a tribe, the commissioner shall:\n(1) in the case where all responsibilities under this section are transferred to a tribe or tribal program, determine the percentage of the county's current caseload that is transferring to a tribal program and adjust the affected county's and tribe's allocations accordingly; and\n(2) in the case where a portion of the responsibilities under this section are transferred to a tribe or tribal program, the commissioner shall consult with the affected county or counties to determine an appropriate adjustment to the allocation.\n(d) Effective January 1, 2005, counties and tribes will have their final allocations adjusted based on the performance provisions of subdivision 7.\n(a) For calendar year 2016 and yearly thereafter, each county and tribe must be allocated 100 percent of their initial calendar year allocation. Allocations for counties and tribes must be adjusted based on performance as follows:\n(1) a county or tribe that performs above its range of expected performance on the annualized three-year self-support index under section 142G.79, subdivision 2, clause (6), must receive an additional allocation equal to 2.5 percent of its initial allocation; and\n(2) a county or tribe that performs below its range of expected performance on the annualized three-year self-support index under section 142G.79, subdivision 2, clause (6), for two consecutive years must negotiate a multiyear improvement plan with the commissioner. If no improvement is shown by the end of the multiyear plan, the county's or tribe's allocation must be decreased by 2.5 percent. The decrease must remain in effect until the county or tribe performs within or above its range of expected performance.\n(b) For calendar year 2016 and yearly thereafter, performance-based funds for a federally approved tribal TANF program in which the state and tribe have in place a contract under section 142A.03, addressing consolidated funding, must be allocated as follows:\n(1) a tribe that performs above its range of expected performance on the annualized three-year self-support index under section 142G.79, subdivision 2, clause (6), must receive an additional allocation equal to 2.5 percent of its initial allocation; or\n(2) a tribe that performs below its range of expected performance on the annualized three-year self-support index under section 142G.79, subdivision 2, clause (6), for two consecutive years must negotiate a multiyear improvement plan with the commissioner. If no improvement is shown by the end of the multiyear plan, the tribe's allocation must be decreased by 2.5 percent. The decrease must remain in effect until the tribe performs within or above its range of expected performance.\n(c) Funds remaining unallocated after the performance-based allocations in paragraph (a) are available to the commissioner for innovation projects under subdivision 5.\n(d) If available funds are insufficient to meet county and tribal allocations under paragraphs (a) and (b), the commissioner shall proportionally prorate funds to counties and tribes that qualify for a bonus under paragraphs (a), clause (1), and (b), clause (2).\n(a) The commissioner shall specify requirements for reporting according to section 142A.03, subdivision 2, paragraph (o). Each county or tribe shall be reimbursed for eligible expenditures up to the limit of its allocation and subject to availability of funds.\n(b) Reimbursements for county administrative-related expenditures determined through the income maintenance random moment time study shall be reimbursed at a rate of 50 percent of eligible expenditures.\n(c) The commissioner of children, youth, and families shall review county and tribal agency expenditures of the MFIP consolidated fund as appropriate and may reallocate unencumbered or unexpended money appropriated under this section to those county and tribal agencies that can demonstrate a need for additional money. To the extent that unexpended funds are insufficient to cover demonstrated need, funds must be prorated to those counties and tribes in relation to demonstrated need.\n[Repealed, 2007 c 147 art 2 s 63]",
	"repealed": false
}