{
	"id": "290.0694",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0694",
	"title": "290.0694 CREDIT FOR SALES OF MANUFACTURED HOME PARKS TO COOPERATIVES.",
	"text": "(a) For purposes of this section, the following definitions have the meanings given.\n(b) \"Qualified property\" means a manufactured home park in Minnesota classified as 4c(5)(i) or 4c(5)(iii) under section 273.13, subdivision 25, paragraph (d).\n(c) \"Qualified seller\" means a taxpayer, as defined under section 290.01, subdivision 6, who sells qualified property to: (1) a corporation or association organized under chapter 308A, 308B, or 308C, where each person who owns a share or shares in the corporation or association would be entitled to occupy a lot within the qualified property after the sale; (2) a charitable corporation, organized under the laws of Minnesota with no outstanding stock, and granted a ruling by the Internal Revenue Service for 501(c)(3) tax-exempt status, whose members hold residential participation warrants entitling the members to occupy the units in the manufactured home park; or (3) a nonprofit or a representative acting on behalf of residents, as defined by section 327C.015, subdivision 13, who purchases the property on behalf of residents who intend to form a corporation or association as described in clause (1) or (2).\n[See Note.]\n(a) A qualified seller is allowed a credit against the tax imposed under this chapter. The credit equals five percent of the amount of the sale price of the qualified property.\n(b) If the amount of the credit under this section exceeds the taxpayer's liability for tax under this chapter, the excess is a credit carryover to each of the five succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit that may be added under this paragraph may not exceed the taxpayer's liability for tax, less any credit for the current taxable year.\n(c) For residents and part-year residents, the credit must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\nCredits granted to a partnership, a limited liability company taxed as a partnership, an S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each partner, member, shareholder, or owner based on their share of the entity's assets or as specially allocated in their organizational documents or any other executed document, as of the last day of the taxable year.\nThis section expires January 1, 2031, for taxable years beginning after December 31, 2030.",
	"repealed": false
}