{
	"id": "182.655",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.655",
	"title": "182.655 OCCUPATIONAL SAFETY AND HEALTH STANDARDS.",
	"text": "Standards and variances shall be proposed, granted, adopted, modified or revoked by the commissioner in accordance with the procedures of this section. The standards and variances are exempt from the Administrative Procedure Act but, to the extent authorized by law to adopt rules, the commissioner may use the provisions of section 14.386, paragraph (a), clauses (1) and (3). Section 14.386, paragraph (b), does not apply to these rules.\nWhenever the commissioner, in order to serve the objectives of this chapter, determines that a rule should be promulgated under this section, establishing, modifying or revoking an occupational safety and health standard, the commissioner shall publish a proposed rule promulgating, modifying, or revoking an occupational safety or health standard and shall afford interested persons a period of 30 days after publication to submit written data or comments.\nOn or before the last day of the period provided for the submission of written data or comments, any interested person may file with the commissioner written objections to the proposed rule, stating the grounds therefor and requesting a public hearing on such objections. Within 30 days after the last day for filing such objections, the commissioner shall publish a notice specifying the occupational safety or health standard to which objections have been filed and a hearing requested, and specifying a time and place for such hearing.\nWithin 60 days after the expiration of the period provided for the submission of written data or comments or within 60 days after the completion of any hearing, the commissioner shall issue a rule promulgating, modifying, or revoking an occupational safety or health standard or make a determination that a rule should not be promulgated. Such a rule may contain a provision delaying its effective date for such period, not in excess of 90 days, as the commissioner determines may be necessary to insure that affected employers and employees will be informed of the existence of the standard and of its terms and that employers affected are given an opportunity to familiarize themselves and their employees with the existence of the requirements of the standard.\nThe commissioner, in adopting standards dealing with hazardous substances or harmful physical agents under this section, shall set the standard which most adequately assures, to the extent feasible, on the basis of the best available evidence, that no employee will suffer material impairment of health or functional capacity even if the employee has regular exposure to the hazard dealt with by the standard for the period of the employee's working life. Development of standards under this subdivision shall be based upon research, demonstrations, experiments, and other information as may be appropriate. In addition to the attainment of the highest degree of health and safety protection for the employee, other considerations shall be the latest available scientific data in the field, the feasibility of the standards, and experience gained under this and other health and safety laws. Whenever practicable, the standard adopted shall be expressed in the terms of objective criteria and of the performance desired.\nAny employer may apply to the commissioner for a temporary order granting a variance from a standard or any provision thereof promulgated under this section. Such temporary order shall be granted only if the employer files an application which meets the requirements of subdivision 7 and establishes that:\n(1) it is unable to comply with a standard by its effective date because of unavailability of professional or technical personnel or of materials and equipment needed to come into compliance with the standard or because necessary construction or alteration of facilities cannot be completed by the effective date;\n(2) it is taking all available steps to safeguard employees against the hazards covered by the standard; and\n(3) it has an effective program for coming into compliance with the standard as quickly as practicable.\nAny temporary order issued under this section shall prescribe the practices, means, methods, operations and processes which the employer must adopt and use while the order is in effect and state in detail the employer's program for coming into compliance with the standard. Such a temporary order may be granted only after notice to employees and to employee representative and an opportunity for a hearing; provided, that the commissioner may issue one interim order to be effective until a decision is made on the basis of a hearing. No temporary order may be in effect for longer than the period needed by the employer to achieve compliance with the standard or one year, whichever is shorter, except that such an order may be renewed not more than twice. No such order shall be renewed unless the requirements of this section are met and an application for renewal is filed at least 90 days prior to the expiration date of the order. No interim order may remain in effect for longer than 180 days.\nAn application for a temporary order under this section shall contain:\n(1) a specification of the standard or portion thereof from which the employer seeks a variance;\n(2) a representation by the employer, supported by representations from qualified persons having first hand knowledge of the facts represented, that it is unable to comply with the standard or portion thereof and a detailed statement of the reasons therefor;\n(3) a statement of the steps being taken and which will be taken, with specific dates, to protect employees against the hazards covered by the standard;\n(4) a statement of when it expects to be able to comply with the standard and what steps it has taken and will take, with specific dates, to come into compliance with the standard; and\n(5) a certification that it has informed employees of the application by giving a copy thereof to their authorized representative, posting a statement giving a summary of the application and specifying where a copy may be examined at the place or places where notices to employees are normally posted, and by other appropriate means, and that it has informed employees of their right to petition the commissioner for a hearing.\nAny affected employer may apply to the commissioner for a rule or order for a permanent variance from a standard promulgated under this section. Affected employees shall be given a notice of each such application and an opportunity to participate in a hearing. The commissioner shall issue such rule or order if the commissioner determines on the record, after opportunity for an inspection where appropriate and a hearing, that the proponent of the variance has demonstrated by a preponderance of the evidence that the conditions, practices, means, methods, operations or processes used or proposed to be used by an employer will provide employment and places of employment to employees which are as safe and healthful as those which would prevail if there was compliance with the standard. The rule or order so issued shall prescribe the conditions the employer must maintain, and the practices, means, methods, operations and processes which it must adopt and utilize. Such a rule or order may be modified or revoked upon application by an employer, employees, or by the commissioner on the commissioner's own motion, in the manner prescribed for its issuance under this subdivision at any time after six months from its issuance.\nThe commissioner is authorized to grant a variance from any standard or portion thereof whenever the commissioner determines that such variance is necessary to permit an employer to participate in an experiment approved by the commissioner or the United States Secretary of Labor or the United States Secretary of Health, Education and Welfare, designed to demonstrate or validate new and improved techniques to safeguard the health and safety of workers.\n(a) Any standard adopted under this section shall prescribe the use of labels or other appropriate forms of warning as are necessary to insure that employees are apprised of all hazards to which they are exposed, relevant symptoms and appropriate emergency treatment, and proper conditions and precautions of safe use or exposure.\n(b) In the case of containers containing a hazardous substance or equipment which generates a harmful physical agent, a label is required as an appropriate form of warning in providing substantially the same information as required under section 182.653, subdivision 4b, 4c, or 4e. As a minimum, a hazardous substance container must be tagged or marked with (1) the identity of the hazardous substance; (2) the appropriate hazard warnings; and (3) the name and address of the chemical manufacturer, importer, or other responsible party.\n(c) A label may be a coded reference to an appropriate and accessible data sheet containing the information required under section 182.653, subdivision 4b, 4c, or 4e. When appropriate, a current data sheet may be affixed to, or posted in, accessible close proximity to a container containing a hazardous substance or a work area where there is a harmful physical agent in satisfaction of standards adopted for labels under this chapter. Containers may be labeled pursuant to federal or state labeling requirements that the commissioner certifies as satisfying the labeling standards adopted under this chapter. Specifically, pesticides that are labeled in accordance with the federal Insecticide, Fungicide and Rodenticide Act (United States Code, title 7, section 136 et seq.); any food, food additive, color additive, drug, or cosmetic including materials intended for use as ingredients in products labeled in accordance with the requirements of the Federal Food, Drug, and Cosmetic Act (United States Code, title 21, section 301 et seq.); distilled spirits, (beverage alcohols), wine, or malt beverage labeled in accordance with the federal Alcohol Administration Act (United States Code, title 27, section 201 et seq.); any consumer products as defined in the Consumer Product Safety Act (United States Code, title 15, section 2051 et seq.) and labeled in accordance with the requirement of that act; or any hazardous substance as defined in the federal Hazardous Substances Act (United States Code, title 15, section 1261 et seq.) and labeled in accordance with the requirements of that act shall meet the requirements of the labeling standards adopted under this chapter.\nWhere appropriate, standards shall prescribe suitable protective equipment, if feasible engineering and administrative methods of protection alone do not provide adequate protection, and this equipment shall be made available by and at the cost of the employer. The standards shall also provide for monitoring or measuring employee exposure at the locations and intervals and in the manner as may be necessary and appropriate for the protection of employees. Where appropriate, a standard shall prescribe the type and frequency of medical examinations or other tests which shall be made available by the employer, or at the employer's cost, to employees exposed to hazards in order to most effectively determine whether the health of those employees is adversely affected by the exposure. The results of these examinations or tests shall be furnished only to the commissioner, the employee's physician, at the request of the employee, and the employer with notice to the employee.\n(a) The commissioner shall adopt an emergency temporary standard to take immediate effect upon publication if the commissioner determines:\n(1) that employees are exposed to grave or imminent danger from exposure to hazardous substances or harmful physical agents or other hazards; and\n(2) that the emergency standard is necessary to protect employees from the danger. The standard shall be effective until superseded by a standard adopted in accordance with the procedures prescribed in subdivision 2.\n(b) Upon publication of the standard or standards, which interested persons may receive upon request and payment of fees, the commissioner shall commence a proceeding in accordance with subdivision 2 and the standard as published shall also serve as a proposed rule for the proceeding; the commissioner shall adopt a standard under this section no later than six months after the publication of the emergency standard.\nStandards promulgated under this section shall not be different from federal standards where the standard significantly affects interstate commerce, unless such standards are required by compelling local conditions and do not unduly burden interstate commerce.\nAll standards adopted by the commissioner shall be at least as effective as those which are presently or will, in the future, be promulgated under section 6 of the federal Occupational Safety and Health Act of 1970.\nThe commissioner may recommend for adoption those portions of current occupational health and safety standards deemed significant and deserving of mandatory status adopted by the Threshold Limit Value Committees of the American Conference of Governmental Industrial Hygienists, the American National Standards Institute, or other recognized national standard-setting organizations and recommended to the commissioner by the council; and may further periodically adopt changes in such standards under the same circumstances but not more often than once a year.",
	"repealed": false
}