{
	"id": "145.988",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.988",
	"title": "145.988 HELP ME CONNECT RESOURCE AND REFERRAL SYSTEM FOR CHILDREN.",
	"text": "The commissioner shall establish the Help Me Connect resource and referral system for children as a comprehensive, collaborative resource and referral system for children from the prenatal stage through age eight, and their families. The commissioner of health shall work collaboratively with the commissioners of human services and education to implement this section.\n(a) The Help Me Connect system shall facilitate collaboration across sectors, including child health, early learning and education, child welfare, and family supports by:\n(1) providing early childhood provider outreach to support knowledge of and access to local resources that provide early detection and intervention services;\n(2) identifying and providing access to early childhood and family support navigation specialists that can support families and their children's needs; and\n(3) linking children and families to appropriate community-based services.\n(b) The Help Me Connect system shall provide community outreach that includes support for, and participation in, the Help Me Connect system, including disseminating information on the system and compiling and maintaining a current resource directory that includes but is not limited to primary and specialty medical care providers, early childhood education and child care programs, developmental disabilities assessment and intervention programs, mental health services, family and social support programs, child advocacy and legal services, public health services and resources, and other appropriate early childhood information.\n(c) The Help Me Connect system shall maintain a centralized access point for parents and professionals to obtain information, resources, and other support services.\n(d) The Help Me Connect system shall collect data to increase understanding of the current and ongoing system of support and resources for expectant families and children through age eight and their families, including identification of gaps in service, barriers to finding and receiving appropriate services, and lack of resources.",
	"repealed": false
}