{
	"id": "297I.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.01",
	"title": "297I.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, for the purposes of this chapter, the following terms have the meanings given them.\n\"Affiliated group\" means a group that includes the insured and any entity, or group of entities, that controls, is controlled by, or is under common control with the insured. An entity has control over another entity when: (1) the entity directly or indirectly or acting through one or more other persons owns, controls, or has the power to vote 25 percent or more of any class of voting securities of the other entity; or (2) the entity controls in any manner the election of a majority of the directors or trustees of the other entity.\n\"Association\" or \"associations\" has the meaning given in section 60A.02, subdivision 1a.\n\"Commissioner\" means the commissioner of revenue of the state of Minnesota.\n\"Community integrated service network\" has the meaning given in section 62N.02, subdivision 4a.\n\"Company\" or \"insurance company\" has the meaning given in section 60A.02, subdivision 4.\n\"Department of Revenue\" means the Minnesota Department of Revenue or commissioner of revenue.\n(a) \"Direct business\" means all insurance provided by an insurance company or its agents, and specifically includes stop-loss insurance purchased in connection with a self-insurance plan for employee health benefits or for other purposes, but excludes:\n(1) reinsurance in which an insurance company assumes the liability of another insurance company; and\n(2) self-insurance.\n(b) For purposes of this subdivision, an insurance company includes a nonprofit health service corporation, health maintenance organization, and community integrated service network.\n\"Domestic\" has the meaning given in section 60A.02, subdivision 5.\n\"Foreign\" has the meaning given in section 60A.02, subdivision 6.\n\"Gross premiums\" means total premiums paid by policyholders and applicants of policies, whether received in the form of money or other valuable consideration, on property, persons, lives, interests and other risks located, resident, or to be performed in this state, but excluding consideration and premiums for reinsurance assumed from other insurance companies.\n(a) \"Gross premiums\" includes the total consideration paid to bail bond agents for bail bonds.\n(b) For title insurers, \"gross premiums\" means the charge for title insurance made by a title insurer or its agents according to the insurer's rate filing approved by the commissioner of commerce without a deduction for commissions paid to or retained by the agent. Gross premiums of a title insurer does not include any other charge or fee for abstracting, searching, or examining the title, or escrow, closing, or other related services.\n(c) \"Gross premiums\" includes any workers' compensation special compensation fund premium surcharge pursuant to section 176.129.\n(d) \"Gross premiums\" for nonadmitted insurance includes any payment made as consideration for an insurance contract for such insurance, including premium deposits, assessments, fees, and any other compensation given in consideration for a contract of insurance. Gross premiums does not include the stamping fee, as provided under section 60A.2085, subdivision 7, nor the operating assessment, as provided under section 60A.208, subdivision 8.\n\"Health maintenance organization\" has the meaning given in section 62D.02, subdivision 4.\n\"Home state\" means the state in which an insured maintains its principal place of business, or in the case of an individual, the individual's principal residence; or if 100 percent of the insured risk is located out of the state, the state to which the greatest percentage of the insured's taxable premium for that insurance contract is allocated. If more than one insured from an affiliated group are named insureds on a single nonadmitted insurance contract, the term home state means the home state of the member of the affiliated group that has the largest percentage of premium attributed to it under that insurance contract.\n\"Independently procured insurance\" means insurance procured directly by an insured from a nonadmitted insurer.\n\"Nonadmitted insurance\" means any property and casualty insurance permitted to be placed directly or through a surplus lines broker with a nonadmitted insurer.\n\"Nonadmitted insurance premium tax\" means, with respect to surplus lines or independently procured insurance coverage, any tax, fee, assessment, or other charge imposed directly or indirectly by a government entity.\n\"Nonadmitted insurer\" means an insurer not licensed to engage in the business of insurance in Minnesota, but does not include a risk retention group as the term is defined in section 2(a)(4) of the Liability Risk Retention Act of 1986, United States Code, title 15, section 3901(a)(4).\n\"Nonprofit health service plan corporation\" has the meaning given in section 62C.02, subdivision 6.\n\"Insurance\" means the same as that term is defined in section 60A.02, subdivision 3.\n\"Insurance agent\" or \"insurance agency\" has the meaning given in section 60A.02, subdivision 7.\n\"Reinsurance\" is insurance whereby an insurance company, for a consideration, agrees to indemnify another insurance company as defined under section 297I.01, subdivisions 5 and 6a, paragraph (b), to the extent taxable under section 297I.05, against all or part of the loss which the latter may sustain under the policy or policies which it has issued.\n\"Return premiums\" means any dividend or any unused or unabsorbed portion of premium deposit or assessment that is applied toward the payment of any premium, premium deposit, or assessment due from the policyholder or member upon a continuance or renewal of the insurance on account of which the dividend was earned or premium deposit or assessment paid. Return premiums also includes any portion of premium returned by the company upon cancellation or termination of a policy or membership, except surrender values paid upon the cancellation and surrender of policies or certificates of life insurance.\n\"State\" has the meaning given in section 60A.02, subdivision 18.\n\"Surplus lines broker\" means an individual, firm, or corporation which is licensed in a state to sell, solicit, or negotiate insurance on properties, risks, or exposures located or to be performed in a state with nonadmitted insurers.\n\"Taxpayer\" means any insurance company, association, surplus lines broker, or insured or any other person or entity required to pay any amount due under this chapter.",
	"repealed": false
}