{
	"id": "216B.683",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.683",
	"title": "216B.683 MERCURY EMISSIONS REDUCTION; COST RECOVERY, FINANCIAL INCENTIVES.",
	"text": "(a) A public utility required to file a mercury emissions-reduction plan under sections 216B.68 to 216B.688 may also file for approval of emissions-reduction rate riders pursuant to section 216B.1692, subdivision 3, for its mercury control and other environmental improvement initiatives under sections 216B.68 to 216B.688.\n(b) In addition to the cost recovery provided by section 216B.1692, subdivision 3, the emissions-reduction rate riders may include recovery of costs associated with (1) the purchase and installation of continuous mercury emission-monitoring systems, (2) costs associated with the purchase and installation of emissions-reduction equipment, (3) construction work in progress, (4) ongoing operation and maintenance costs associated with the utility's emission-control initiatives, including, but not limited to, the cost of any sorbent or emission-control reagent injected into the unit, (5) any project costs incurred before plan approval that are demonstrated to the commission's satisfaction to be part of the plan, and (6) any studies undertaken by the utility in support of the emissions-reduction plan.\n(c) The utility may propose to phase in the emissions-reduction riders to recover these costs over the development and life of the projects.\nA mercury emissions-reduction rider approved by the commission may include performance-based financial incentives if the commission determines that the incentives will increase the likelihood that the utility will exceed 90 percent mercury emissions reductions, provided the incentives do not impose excessive costs on the utility's consumers when added to the costs recovered under subdivision 1. These incentives may include increased returns on investments or other performance-based incentives. The commission may structure the financial incentives to escalate for each additional increment of mercury emissions reduction achieved by the utility above the 90 percent mercury emissions reduction.\n(a) Section 216B.1692 applies to plans and emissions-control riders proposed under sections 216B.68 to 216B.688, except that:\n(1) projects included in a plan approved under sections 216B.68 to 216B.688 are deemed to be qualifying projects for the purposes of section 216B.1692; and\n(2) section 216B.1692, subdivisions 5, paragraph (c), and 6, do not apply to plans or riders submitted under sections 216B.68 to 216B.688.\n(b) Commission approval of an emissions-reduction plan under this section includes approval of an emissions-reduction rider associated with that plan if submitted by the utility.",
	"repealed": false
}