{
	"id": "214.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.10",
	"title": "214.10 COMPLAINT, INVESTIGATION, AND HEARING.",
	"text": "The executive director or executive secretary of a board, a board member or any other person who performs services for the board who receives a complaint or other communication, whether oral or written, which complaint or communication alleges or implies a violation of a statute or rule which the board is empowered to enforce, shall promptly forward the substance of the communication on a form prepared by the attorney general to the designee of the attorney general responsible for providing legal services to the board. Before proceeding further with the communication, the designee of the attorney general may require the complaining party to state the complaint in writing on a form prepared by the attorney general. Complaints which relate to matters within the jurisdiction of another governmental agency shall be forwarded to that agency by the executive director or executive secretary. An officer of that agency shall advise the executive director or executive secretary of the disposition of that complaint. A complaint received by another agency which relates to a statute or rule which a licensing board is empowered to enforce shall be forwarded to the executive director or executive secretary of the board to be processed in accordance with this section. No complaint alleging a matter within the jurisdiction of the board shall be dismissed by a board unless at least two board members have reviewed the matter. If a board makes a determination to investigate a complaint, it shall notify a licensee who is the subject of an investigation that an investigation has been initiated at a time when such notice will not compromise the investigation.\nThe designee of the attorney general providing legal services to a board shall evaluate the communications forwarded by the board or its members or staff. If the communication alleges a violation of statute or rule which the board is to enforce, the designee is empowered to investigate the facts alleged in the communication. In the process of evaluation and investigation, the designee shall consult with or seek the assistance of the executive director, executive secretary, or, if the board determines, a member of the board who has been appointed by the board to assist the designee. The designee may also consult with or seek the assistance of any other qualified persons who are not members of the board who the designee believes will materially aid in the process of evaluation or investigation. The executive director, executive secretary, or the consulted board member may attempt to correct improper activities and redress grievances through education, conference, conciliation and persuasion, and in these attempts may be assisted by the designee of the attorney general. If the attempts at correction or redress do not produce satisfactory results in the opinion of the executive director, executive secretary, or the consulted board member, or if after investigation the designee providing legal services to the board, the executive director, executive secretary, or the consulted board member believes that the communication and the investigation suggest illegal or unauthorized activities warranting board action, the person having the belief shall inform the executive director or executive secretary of the board who shall schedule a contested case hearing in accordance with chapter 14. Before directing the holding of a contested case hearing, the executive director, executive secretary, or the designee of the attorney general shall have considered the recommendations of the consulted board member. Before scheduling a contested case hearing, the executive director or executive secretary must have received a verified written complaint from the complaining party. A board member who was consulted during the course of an investigation may participate at the hearing but may not vote on any matter pertaining to the case. The executive director or executive secretary of the board shall promptly inform the complaining party of the final disposition of the complaint. Nothing in this section shall preclude the board from scheduling, on its own motion, a contested case hearing based upon the findings or report of the board's executive director or executive secretary, a board member or the designee of the attorney general assigned to the board. Nothing in this section shall preclude a member of the board, executive director, or executive secretary from initiating a complaint.\nA board shall initiate proceedings to suspend or revoke a license or shall refuse to renew a license of a person licensed by the board who is convicted in a court of competent jurisdiction of violating section 609.2231, subdivision 8, 609.23, 609.231, 609.2325, 609.233, 609.2335, 609.234, 609.465, 609.466, 609.52, or 609.72, subdivision 3.\nIn all matters pending before it relating to its lawful regulation activities, a board may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. Any person failing or refusing to appear or testify regarding any matter about which the person may be lawfully questioned or produce any papers, books, records, documents, or other evidentiary materials in the matter to be heard, after having been required by order of the board or by a subpoena of the board to do so may, upon application to the district court in any district, be ordered to comply therewith; provided that in matters to which the Peace Officers Standards and Training Board is a party, application shall be made to the district court having jurisdiction where the event giving rise to the matter occurred. The chair of the board acting on behalf of the board may issue subpoenas and any board member may administer oaths to witnesses, or take their affirmation. Depositions may be taken within or without the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon any person named therein, anywhere within the state by any officer authorized to serve subpoenas or other process or paper in civil actions, with the same fees and mileage and in the same manner as prescribed by law for service of process issued out of the district court of this state. Fees and mileage and other costs shall be paid as the board directs.\nMS 1992 [Repealed, 1993 c 326 art 7 s 22]\nMS 1992 [Repealed, 1993 c 326 art 7 s 22]\nMS 1992 [Repealed, 1993 c 326 art 7 s 22]\nMS 1992 [Repealed, 1993 c 326 art 7 s 22]\nIn addition to the provisions of this section that apply to all examining and licensing boards, the requirements in this subdivision apply to all health-related licensing boards, except the Board of Veterinary Medicine.\n(a) If the executive director or consulted board member determines that a communication received alleges a violation of statute or rule that involves sexual contact with a patient or client, the communication shall be forwarded to the designee of the attorney general for an investigation of the facts alleged in the communication. If, after an investigation it is the opinion of the executive director or consulted board member that there is sufficient evidence to justify disciplinary action, the board shall conduct a disciplinary conference or hearing. If, after a hearing or disciplinary conference the board determines that misconduct involving sexual contact with a patient or client occurred, the board shall take disciplinary action. Notwithstanding subdivision 2, a board may not attempt to correct improper activities or redress grievances through education, conciliation, and persuasion, unless in the opinion of the executive director or consulted board member there is insufficient evidence to justify disciplinary action. The board may settle a case by stipulation prior to, or during, a hearing if the stipulation provides for disciplinary action.\n(b) A board member who has a direct current or former financial connection or professional relationship to a person who is the subject of board disciplinary activities must not participate in board activities relating to that case.\n(c) Each health-related licensing board shall establish procedures for exchanging information with other Minnesota state boards, agencies, and departments responsible for regulating health-related occupations, facilities, and programs, and for coordinating investigations involving matters within the jurisdiction of more than one regulatory body. The procedures must provide for the forwarding to other regulatory bodies of all information and evidence, including the results of investigations, that are relevant to matters within that licensing body's regulatory jurisdiction. Each health-related licensing board shall have access to any data of the Department of Human Services relating to a person subject to the jurisdiction of the licensing board. The data shall have the same classification under chapter 13, the Minnesota Government Data Practices Act, in the hands of the agency receiving the data as it had in the hands of the Department of Human Services.\n(d) Each health-related licensing board shall establish procedures for exchanging information with other states regarding disciplinary actions against licensees. The procedures must provide for the collection of information from other states about disciplinary actions taken against persons who are licensed to practice in Minnesota or who have applied to be licensed in this state and the dissemination of information to other states regarding disciplinary actions taken in Minnesota. In addition to any authority in chapter 13 permitting the dissemination of data, the board may, in its discretion, disseminate data to other states regardless of its classification under chapter 13. Criminal history record information shall not be exchanged. Before transferring any data that is not public, the board shall obtain reasonable assurances from the receiving state that the data will not be made public.\n(a) As used in this subdivision, the following terms have the meanings given them.\n(1) \"Licensed person\" means a person who is licensed under this chapter by the Board of Nursing, the Board of Psychology, the Social Work Licensing Board, the Board of Marriage and Family Therapy, the Board of Unlicensed Mental Health Service Providers, the Board of Behavioral Health and Therapy, or the Professional Educator Licensing and Standards Board.\n(2) \"Crime against a minor\" means conduct that constitutes a violation of section 609.185, 609.19, 609.195, 609.20, 609.205, 609.2112, 609.2113, 609.2114, 609.215, 609.221, 609.222, 609.223, 609.342, 609.343, 609.345, or a felony violation of section 609.377.\n(b) In any license revocation proceeding, there is a rebuttable presumption that a licensed person who is convicted in a court of competent jurisdiction of committing a crime against a minor is unfit to practice the profession or occupation for which that person is licensed.\nNotwithstanding the provisions of subdivision 1 to the contrary, when the executive director or any member of the Board of Peace Officer Standards and Training produces or receives a written statement or complaint that alleges a violation of a statute or rule that the board is empowered to enforce, the executive director may order an appropriate law enforcement agency to conduct an inquiry into the complaint's allegations. If directed to complete an investigation, the investigating agency must complete the inquiry and submit a written summary of it to the executive director within 30 days of the order for inquiry.\n(a) After the investigation is complete, the executive director shall convene at least a four-member committee of the board to determine if the complaint constitutes reasonable grounds to believe that a violation within the board's enforcement jurisdiction has occurred. In conformance with section 626.843, subdivision 1b, at least three members of the committee must be voting board members who are peace officers and one member of the committee must be a voting board member appointed from the general public. No later than 30 days before the committee meets, the executive director shall give the licensee who is the subject of the complaint and the complainant written notice of the meeting. The executive director shall also give the licensee a copy of the complaint. Before making its determination, the committee shall give the complaining party and the licensee who is the subject of the complaint a reasonable opportunity to be heard.\n(b) The committee shall, by majority vote, after considering the information supplied by the investigating agency and any additional information supplied by the complainant or the licensee who is the subject of the complaint, take one of the following actions:\n(1) find that reasonable grounds exist to believe that a violation within the board's enforcement jurisdiction has occurred and order that an administrative hearing be held;\n(2) decide that no further action is warranted; or\n(3) continue the matter.\nThe executive director shall promptly give notice of the committee's action to the complainant and the licensee.\n(c) If the committee determines that a complaint does not relate to matters within its enforcement jurisdiction but does relate to matters within another state or local agency's enforcement jurisdiction, it shall refer the complaint to the appropriate agency for disposition.\n(a) Notwithstanding the provisions of subdivision 2 to the contrary, an administrative hearing shall be held if ordered by the committee under subdivision 11, paragraph (b). After the administrative hearing is held, the administrative law judge shall refer the matter to the full board for final action.\n(b) Before the board meets to take action on the matter and the executive director must notify the complainant and the licensee who is the subject of the complaint. After the board meets, the executive director must promptly notify these individuals and the chief law enforcement officer of the agency employing the licensee of the board's disposition.\nAs used in subdivisions 10 to 12, \"appropriate law enforcement agency\" means the law enforcement agency assigned by the executive director and the chair of the committee of the board convened under subdivision 11.\nThis section shall not apply to complementary and alternative health care practitioners practicing under chapter 146A. Complaints and disciplinary actions against complementary and alternative health care practitioners shall be conducted in accordance with chapter 146A.",
	"repealed": false
}