{
	"id": "144.6071",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6071",
	"title": "144.6071 TRAUMA REGISTRY.",
	"text": "The commissioner of health shall establish and maintain a central registry of persons who sustain major trauma as defined in section 144.602, subdivision 3. The registry shall collect information to facilitate the development of clinical and system quality improvement, injury prevention, treatment, and rehabilitation programs.\nA trauma hospital must participate in the statewide trauma registry. The consent of the injured person is not required.\nTrauma hospitals must electronically submit the following information to the registry:\n(1) demographic information of the injured person;\n(2) information about the date, location, and cause of the injury;\n(3) information about the condition of the injured person;\n(4) information about the treatment, comorbidities, and diagnosis of the injured person;\n(5) information about the outcome and disposition of the injured person; and\n(6) other trauma-related information required by the commissioner, if necessary to facilitate the development of clinical and system quality improvement, treatment, and rehabilitation programs.\nThe commissioner may adopt rules to collect other information required to facilitate the development of clinical and system quality improvement, injury prevention, treatment, and rehabilitation programs. The commissioner may adopt rules at any time to implement this section and is not subject to the requirements of section 14.125.\nAny person or facility furnishing information required in this section shall not be subject to any action for damages or other relief, provided that the person or facility is acting in good faith.\nData on individuals collected by the commissioner of health under this section are private data on individuals, as defined in section 13.02, subdivision 12. Data not on individuals are nonpublic data as defined in section 13.02, subdivision 9. The commissioner shall provide summary registry data to public and private entities to conduct studies using data collected by the registry. The commissioner may charge a fee under section 13.03, subdivision 3, for all out-of-pocket expenses associated with the provision of data or data analysis.\nThe commissioner shall use the registry to annually publish a report that includes comparative demographic and risk-adjusted epidemiological data on designated trauma hospitals. Any analyses or reports that identify providers may only be published after the provider has been provided the opportunity by the commissioner to review the underlying data and submit comments. The provider shall have 21 days to review the data for accuracy.",
	"repealed": false
}