{
	"id": "429.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.021",
	"title": "429.021 LOCAL IMPROVEMENTS, COUNCIL POWERS.",
	"text": "The council of a municipality shall have power to make the following improvements:\n(1) To acquire, open, and widen any street, and to improve the same by constructing, reconstructing, and maintaining sidewalks, pavement, gutters, curbs, and vehicle parking strips of any material, or by grading, graveling, oiling, or otherwise improving the same, including the beautification thereof and including storm sewers or other street drainage and connections from sewer, water, or similar mains to curb lines.\n(2) To acquire, develop, construct, reconstruct, extend, and maintain storm and sanitary sewers and systems, including outlets, holding areas and ponds, treatment plants, pumps, lift stations, service connections, and other appurtenances of a sewer system, within and without the corporate limits.\n(3) To construct, reconstruct, extend, and maintain steam heating mains.\n(4) To install, replace, extend, and maintain street lights and street lighting systems and special lighting systems.\n(5) To acquire, improve, construct, reconstruct, extend, and maintain water works systems, including mains, valves, hydrants, service connections, wells, pumps, reservoirs, tanks, treatment plants, and other appurtenances of a water works system, within and without the corporate limits.\n(6) To acquire, improve and equip parks, open space areas, playgrounds, and recreational facilities within or without the corporate limits.\n(7) To plant trees on streets and provide for their trimming, care, and removal.\n(8) To abate nuisances and to drain swamps, marshes, and ponds on public or private property and to fill the same.\n(9) To construct, reconstruct, extend, and maintain dikes and other flood control works.\n(10) To construct, reconstruct, extend, and maintain retaining walls and area walls.\n(11) To acquire, construct, reconstruct, improve, alter, extend, operate, maintain, and promote a pedestrian skyway system. Such improvement may be made upon a petition pursuant to section 429.031, subdivision 3.\n(12) To acquire, construct, reconstruct, extend, operate, maintain, and promote underground pedestrian concourses.\n(13) To acquire, construct, improve, alter, extend, operate, maintain, and promote public malls, plazas or courtyards.\n(14) To construct, reconstruct, extend, and maintain district heating systems.\n(15) To construct, reconstruct, alter, extend, operate, maintain, and promote fire protection systems in existing buildings, but only upon a petition pursuant to section 429.031, subdivision 3.\n(16) To acquire, construct, reconstruct, improve, alter, extend, and maintain highway sound barriers.\n(17) To improve, construct, reconstruct, extend, and maintain gas and electric distribution facilities owned by a municipal gas or electric utility.\n(18) To purchase, install, and maintain signs, posts, and other markers for addressing related to the operation of enhanced 911 telephone service.\n(19) To improve, construct, extend, and maintain facilities for Internet access and other communications purposes, provided that the municipality must:\n(i) not discriminate in favor of the municipality's own communications facilities by granting the municipality more favorable or less burdensome terms and conditions than a nonmunicipal service provider with respect to: (A) access and use of public rights-of-way; (B) access and use of municipally owned or controlled conduit, towers, and utility poles; and (C) permitting fees charged to access municipally owned and managed facilities;\n(ii) maintain separation between the municipality's role as a regulator over firms that offer services in competition with the services offered by the municipality over the municipality's communications service facilities, and the municipality's role as a competitive provider of services over the municipality's communications service facilities; and\n(iii) not share inside information between employees or contractors responsible for executing the municipality's role as a regulator over firms that offer communications services in competition with the communication services offered by the municipality, and employees or contractors responsible for executing the municipality's role as a competitive communications services provider.\n(20) To assess affected property owners for all or a portion of the costs agreed to with an electric utility, telecommunications carrier, or cable system operator to bury or alter a new or existing distribution system within the public right-of-way that exceeds the utility's design and construction standards, or those set by law, tariff, or franchise, but only upon petition under section 429.031, subdivision 3.\n(21) To assess affected property owners for repayment of voluntary energy improvement financings under section 216C.436, subdivision 7, or 216C.437, subdivision 28.\n(22) To construct, reconstruct, alter, extend, operate, maintain, and promote energy improvement projects in existing buildings, provided that:\n(i) a petition for the improvement is made by a property owner under section 429.031, subdivision 3;\n(ii) the municipality funds and administers the energy improvement project;\n(iii) project funds are only used for the installation of improvements to heating, ventilation, and air conditioning equipment and building envelope and for the installation of renewable energy systems;\n(iv) each property owner petitioning for the improvement receives notice that free or low-cost energy improvements may be available under federal, state, or utility programs;\n(v) for energy improvement projects on residential property, only residential property having five or more units may obtain financing for projects under this clause; and\n(vi) prior to financing an energy improvement project or imposing an assessment for a project, written notice is provided to the mortgage lender of any mortgage encumbering or otherwise secured by the property proposed to be improved.\nAn improvement on two or more streets or two or more types of improvement in or on the same street or streets or different streets may be included in one proceeding and conducted as one improvement.\nWhen any portion of the cost of an improvement is defrayed by special assessments, the procedure prescribed in this chapter shall be followed unless the council determines to proceed under charter provisions; but this chapter does not prescribe the procedure to be followed by a municipality in making improvements financed without the use of special assessments.\nIf the council determines to proceed under charter provisions for special assessments, such provisions shall be deemed to include a requirement that notices of proposed assessments inform property owners of the procedures they must follow under the charter in order to appeal the assessments to district court. The notices shall also inform property owners of the provisions of sections 435.193 to 435.195 and the existence of any deferment procedure established pursuant thereto in the municipality.\nCharter provisions shall also be deemed to require that when the council determines to make any improvement, it shall let the contract for all or part of the work, or order all or part of the work done by day labor or otherwise as may be authorized by the charter, no later than one year after the adoption of the resolution ordering such improvement, unless a different time limit is specifically stated in the resolution ordering the improvement.",
	"repealed": false
}