{
	"id": "465.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.79",
	"title": "465.79 ESTABLISHMENT OF BOUNDARY COMMISSION.",
	"text": "By resolution, the city council of a statutory or home rule charter city, town board, or county board may create a boundary commission. Members of the commission shall be residents of the county or counties in which the city or town is located who are familiar with real property.\nUpon initiation by resolution of the governing body or upon petition of an adjoining or affected property owner, the boundary commission shall review property descriptions of the disputed areas in the respective jurisdiction. Upon mailed notice to all known parties in interest, the commission shall attempt to establish agreements between adjoining landowners as to the location of common boundaries as delineated by a certified land survey. If agreement cannot be reached, the commission shall make a recommendation as to the location of the common boundaries within the disputed area. The commission shall prepare a plan designating all agreed and recommended boundary lines and report to the city council, town board, or county board.\nUpon receipt of the plan and a report from the commission, the city council, town board, or county board shall hold a public hearing. The council, town board, or county board shall give mailed notice to all known parties in interest and published notice 20 days prior to the hearing. The council, town board, or county board shall hear all interested parties and may make adjustments to the proposed plan that it deems just and necessary.\nFollowing the public hearing, the council or board may petition the district court for judicial approval of the proposed plan. If any affected parcel is land registered under chapter 508, the petition must be referred to the examiner of titles for a report. The council or board shall provide sufficient information to identify all parties in interest and shall give notice to parties in interest as the court may order. The court shall determine the location of any contested, disputed, or unagreed boundary and shall determine adverse claims to each parcel as provided in chapter 559. After hearing and determining all disputes, the court shall issue its judgment in the form of a plat complying with chapter 505 and an order designating the owners and encumbrancers of each lot. Real property taxes need not be paid or current as a condition of filing the plat, notwithstanding the requirements of section 505.04.\nThe city or board may assess part or all of the cost incurred by it against the benefited properties on a per parcel basis as provided in chapter 429.",
	"repealed": false
}