{
	"id": "611A.0392",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.0392",
	"title": "611A.0392 NOTICE TO COMMUNITY CRIME PREVENTION GROUP.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Cities of the first class\" has the meaning given in section 410.01.\n(c) \"Community crime prevention group\" means a community group focused on community safety and crime prevention that:\n(1) meets regularly for the purpose of discussing community safety and patrolling community neighborhoods for criminal activity;\n(2) is previously designated by the local law enforcement agency as a community crime prevention group; and\n(3) interacts regularly with the police regarding community safety issues.\n(a) A law enforcement agency that is responsible for arresting individuals who commit crimes within cities of the first class shall make reasonable efforts to disclose certain information in a timely manner to the designated leader of a community crime prevention group that has reported criminal activity, excluding petty misdemeanors, to law enforcement. The law enforcement agency shall make reasonable efforts to disclose information on the final outcome of the investigation into the criminal activity including, but not limited to, where appropriate, the decision to arrest or not arrest the person and whether the matter was referred to a prosecuting authority. If the matter is referred to a prosecuting authority, the law enforcement agency must notify the prosecuting authority of the community crime prevention group's request for notice under this subdivision.\n(b) A prosecuting authority who is responsible for filing charges against or prosecuting a person arrested for a criminal offense in cities of the first class shall make reasonable efforts to disclose certain information in a timely manner to the designated leader of a community crime prevention group that has reported specific criminal activity to law enforcement. The prosecuting authority shall make reasonable efforts to disclose information on the final outcome of the criminal proceeding that resulted from the arrest including, but not limited to, where appropriate, the decision to dismiss or not file charges against the arrested person.\n(c) A community crime prevention group that would like to receive written or Internet notice under this subdivision must request the law enforcement agency and the prosecuting authority where the specific alleged criminal conduct occurred to provide notice to the community crime prevention group leader. The community crime prevention group must provide the law enforcement agency with the name, address, and telephone number of the community crime prevention group leader and the preferred method of communication.",
	"repealed": false
}