{
	"id": "216C.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.46",
	"title": "216C.46 RESIDENTIAL HEAT PUMP REBATE PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Eligible applicant\" means a person who provides evidence to the commissioner's satisfaction demonstrating that the person has received or has applied for a heat pump rebate available from the federal Department of Energy under the Inflation Reduction Act of 2022, Public Law 117-189.\n(c) \"Heat pump\" means a cold climate rated air-source heat pump composed of (1) a mechanism that heats and cools indoor air by transferring heat from outdoor or indoor air using a fan, (2) a refrigerant-filled heat exchanger, and (3) an inverter-driven compressor that varies the pressure of the refrigerant to warm or cool the refrigerant vapor.\nA residential heat pump rebate program is established in the department to provide financial assistance to eligible applicants that purchase and install a heat pump in the applicant's Minnesota residence.\n(a) An application for a rebate under this section must be made to the commissioner on a form developed by the commissioner. The application must be accompanied by documentation, as required by the commissioner, demonstrating that:\n(1) the applicant is an eligible applicant;\n(2) the applicant owns the Minnesota residence in which the heat pump is to be installed;\n(3) the applicant has had an energy audit conducted of the residence in which the heat pump is to be installed within the last 18 months by a person with a Building Analyst Technician certification issued by the Building Performance Institute, Inc., or an equivalent certification, as determined by the commissioner;\n(4) either:\n(i) the applicant has installed in the applicant's residence, by a contractor with an Air Leakage Control Installer certification issued by the Building Performance Institute, Inc., or an equivalent certification, as determined by the commissioner, the amount of insulation and the air sealing measures recommended by the auditor; or\n(ii) the auditor has otherwise determined that the amount of insulation and air sealing measures in the residence are sufficient to enable effective heat pump performance;\n(5) the applicant has purchased a heat pump of the capacity recommended by the auditor or contractor, and has had the heat pump installed by a contractor with sufficient training and experience in installing heat pumps, as determined by the commissioner; and\n(6) the total cost to purchase and install the heat pump in the applicant's residence.\n(b) The commissioner must develop administrative procedures governing the application and rebate award processes.\n(c) The commissioner may modify program requirements under this section when necessary to align with comparable federal programs administered by the department under the federal Inflation Reduction Act of 2022, Public Law 117-189.\nA rebate awarded under this section must not exceed the lesser of:\n(1) $4,000; or\n(2) the total cost to purchase and install the heat pump in an eligible applicant's residence net of the rebate amount received for the heat pump from the federal Department of Energy under the Inflation Reduction Act of 2022, Public Law 117-189.\nThe commissioner may issue a request for proposal seeking an entity to serve as an energy coordinator to interact directly with applicants and potential applicants to:\n(1) explain the technical aspects of heat pumps, energy audits, and energy conservation measures, and the energy and financial savings that can result from implementing each;\n(2) identify federal, state, and utility programs available to homeowners to reduce the costs of energy audits, energy conservation, and heat pumps;\n(3) explain the requirements and scheduling of the application process;\n(4) provide access to certified contractors who can perform energy audits, install insulation and air sealing measures, and install heat pumps; and\n(5) conduct outreach to make potential applicants aware of the program.\nThe commissioner may issue a request for proposals seeking an entity to develop and organize programs to train contractors with respect to the technical aspects and installation of heat pumps in residences. The training curriculum must be at a level sufficient to provide contractors who complete training with the knowledge and skills necessary to install heat pumps to industry best practice standards, as determined by the commissioner. Training programs must: (1) be accessible in all regions of the state; and (2) provide mentoring and ongoing support, including continuing education and financial assistance, to trainees.\n(a) The residential heat pump rebate account is established as a separate account in the special revenue fund in the state treasury. The commissioner shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund, but remains in the account until expended. The commissioner shall manage the account.\n(b) Money in the account is appropriated to the commissioner for the purposes of this section and to reimburse the reasonable costs of the department to administer this section.",
	"repealed": false
}