{
	"id": "64B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/64B.30",
	"title": "64B.30 DOMESTIC ASSOCIATIONS; EXAMINATION; REHABILITATION; DISSOLUTION.",
	"text": "The commissioner, or any person the commissioner may appoint, shall have the power of visitation and examination into the affairs of any domestic society. The commissioner shall conduct an examination at least as often as is required in section 60A.031, subdivision 1. The commissioner may:\n(1) employ assistance for the purposes of examination and the commissioner, or any person the commissioner may appoint, shall have free access to any books, papers, and documents that relate to the business of the association; and\n(2) summon and qualify as witnesses, under oath, and examine its officers, agents, and employees, or other persons, in relation to the affairs, transactions, and condition of the association.\nWherever the commissioner is satisfied that any of the conditions exist as stated in chapter 60B, the commissioner may proceed as provided therein.\nUpon application to the commissioner, a domestic society may request that it be dissolved and that its existence be terminated. Such application shall demonstrate that the applicant has satisfied its members' policy obligations or that it has transferred such obligations to another society, domestic or foreign, by means of assumption or bulk reinsurance or otherwise, that the applicant's supreme governing body has approved such termination and dissolution and that the application includes such other information that the commissioner requires. Any limitation in section 64B.13 related to reinsurance by a domestic society with another society shall not apply to reinsurance entered into in conjunction with the transfer of member policy obligations as a part of a voluntary dissolution. Upon the approval of the application by the commissioner, the society shall be deemed dissolved and its existence terminated upon the date set forth in the application.",
	"repealed": false
}