{
	"id": "168A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.09",
	"title": "168A.09 DUPLICATE CERTIFICATE.",
	"text": "(a) In the event a certificate of title is lost, stolen, mutilated, destroyed, or becomes illegible, the owner or legal representative of the owner named in the certificate may submit an application to the department or a deputy registrar for a duplicate in a format prescribed by the department. The department or deputy registrar must issue a duplicate certificate of title if satisfied that the applicant is entitled to the duplicate certificate of title. The duplicate certificate of title must be plainly marked as a duplicate and mailed or delivered to the owner. The department or deputy registrar must indicate in the driver and vehicle information system records that a duplicate certificate of title has been issued. As a condition to issuing a duplicate certificate of title, the department may require a bond from the applicant in the manner and format prescribed in section 168A.07, subdivision 1, clause (2). The duplicate certificate of title must contain the legend: \"This duplicate certificate of title may be subject to the rights of a person under the original certificate.\"\n(b) The commissioner must allow duplicate certificate of title issuance by a deputy registrar, subject to procedures established by the commissioner.\nMS 1988 [Repealed by amendment, 1989 c 148 s 6]\nA person recovering an original certificate of title for which a duplicate has been issued shall promptly surrender the original certificate to the department.\n(a) The owner of a vehicle may apply to the commissioner for a replacement title if:\n(1) a Minnesota title has been issued prior to August 1, 2012; and\n(2) the vehicle meets the requirements for a restored pioneer vehicle under section 168A.01, subdivision 16d.\n(b) The commissioner shall establish and make publicly available requirements for an application under this subdivision, and shall make reasonable efforts to minimize burden on the title applicant. Among the application requirements, a person applying for a replacement title shall surrender the original title.\n(c) The commissioner shall impose a fee for a replacement title issued under this subdivision that is equal to the fee for issuing a duplicate certificate of title under section 168A.29. Fee proceeds must be allocated in the same manner as the fee for a duplicate certificate of title.",
	"repealed": false
}