{
	"id": "123B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.02",
	"title": "123B.02 GENERAL POWERS OF INDEPENDENT SCHOOL DISTRICTS.",
	"text": "The board must have the general charge of the business of the district, the school houses, and of the interests of the schools thereof. The board's authority to govern, manage, and control the district; to carry out its duties and responsibilities; and to conduct the business of the district includes implied powers in addition to any specific powers granted by the legislature.\nIt is the duty and the function of the district to furnish school facilities to every child of school age residing in any part of the district. The board may establish and organize and alter and discontinue such grades or schools as it may deem advisable and assign to each school and grade a proper number of pupils. The board shall provide free textbooks for the pupils of the district.\n(a) A district must not be required by any type of formal or informal agreement except an agreement to provide building space according to paragraph (f), including a joint powers agreement, or membership in any cooperative unit defined in section 123A.24, subdivision 2, to participate in or provide financial support for the purposes of the agreement for a time period in excess of four fiscal years, or the time period set forth in this subdivision. Any agreement, part of an agreement, or other type of requirement to the contrary is void. This paragraph applies only to agreements entered into between July 1, 1993, and June 30, 1999.\n(b) This subdivision shall not affect the continued liability of a district for its share of bonded indebtedness or other debt incurred as a result of any agreement before July 1, 1993. The district is liable only until the obligation or debt is discharged and only according to the payment schedule in effect on July 1, 1993, except that the payment schedule may be altered for the purpose of restructuring debt or refunding bonds outstanding on July 1, 1993, if the annual payments of the district are not increased and if the total obligation of the school district for its share of outstanding bonds or other debt is not increased.\n(c) To cease participating in or providing financial support for any of the services or activities relating to the agreement or to terminate participation in the agreement, the board must adopt a resolution and notify other parties to the agreement of its decision on or before February 1 of any year. The cessation or withdrawal shall be effective June 30 of the same year except that for a member of an education district organized under sections 123A.15 to 123A.19 or an intermediate district organized under chapter 136D, cessation or withdrawal shall be effective June 30 of the following fiscal year. At the option of the board, cessation or withdrawal may be effective June 30 of the following fiscal year for a district participating in any type of agreement.\n(d) Before issuing bonds or incurring other debt, the governing body responsible for implementing the agreement must adopt a resolution proposing to issue bonds or incur other debt and the proposed financial effect of the bonds or other debt upon each participating district. The resolution must be adopted within a time sufficient to allow the board to adopt a resolution within the time permitted by this paragraph and to comply with the statutory deadlines set forth in sections 122A.40, 122A.41, and 123A.33. The governing body responsible for implementing the agreement shall notify each participating board of the contents of the resolution. Within 120 days of receiving the resolution of the governing body, the school board of the participating district shall adopt a resolution stating:\n(1) its concurrence with issuing bonds or incurring other debt;\n(2) its intention to cease participating in or providing financial support for the service or activity related to the bonds or other debt; or\n(3) its intention to terminate participation in the agreement.\nA board adopting a resolution according to clause (1) is liable for its share of bonded indebtedness or other debt as proposed by the governing body implementing the agreement. A school board adopting a resolution according to clause (2) is not liable for the bonded indebtedness or other debt, as proposed by the governing body, related to the services or activities in which the district ceases participating or providing financial support. A board adopting a resolution according to clause (3) is not liable for the bonded indebtedness or other debt proposed by the governing body implementing the agreement.\n(e) After July 1, 1993, a district is liable according to paragraph (d) for its share of bonded indebtedness or other debt incurred by the governing body implementing the agreement to the extent that the bonds or other debt are directly related to the services or activities in which the district participates or for which the district provides financial support. The district has continued liability only until the obligation or debt is discharged and only according to the payment schedule in effect at the time the governing body implementing the agreement provides notice to the school board, except that the payment schedule may be altered for the purpose of refunding the outstanding bonds or restructuring other debt if the annual payments of the district are not increased and if the total obligation of the district for the outstanding bonds or other debt is not increased.\n(f) A district that is a member of a cooperative unit as defined in section 123A.24, subdivision 2, may obligate itself to participate in and provide financial support for an agreement with a cooperative unit to provide school building space for a term not to exceed two years with an option on the part of the district to renew for an additional two years.\n(g) Notwithstanding any limitations imposed under this subdivision, a school district may, according to section 123B.51, subdivision 4, enter into a lease of all or a portion of a schoolhouse that is not needed for school purposes, including, but not limited to, a lease with a term of more than one year.\nNotwithstanding subdivision 3, if a school district and a city jointly own a building or site, the district and the city may enter into an agreement that extends beyond the end of the fiscal year to pay operating costs for that building or site.\nThe board may authorize a representative to move unauthorized vehicles parked on school district property, or require the driver or other person in charge of the vehicle to move the same off school district property.\nWhen such representative finds such a vehicle unattended upon district premises, such representative is hereby authorized to provide for the removal of such vehicle and remove the same to the nearest convenient garage or other place of safety off of district property. Such vehicle shall be moved at the expense of the owner or operator.\nTrespasses on school property shall be governed according to section 609.605, subdivision 4.\nThe board may receive, for the benefit of the district, bequests, donations, or gifts for any proper purpose and apply the same to the purpose designated. In that behalf, the board may act as trustee of any trust created for the benefit of the district, or for the benefit of pupils thereof, including trusts created to provide pupils of the district with advanced education after completion of high school, in the advancement of education.\nThe voters of a district may authorize the issuance of bonds of the district in accordance with the provisions of chapter 475.\nThe board must provide by levy of tax necessary funds for the conduct of schools, the payment of indebtedness, and all proper expenses of the district.\nThe board may provide library facilities as part of its school equipment according to the standards of the commissioner of education.\nThe board may establish and maintain summer school programs and intersession classes of flexible school year programs.\nSchool districts may enter into agreements with Indian tribal governments for purposes of providing educational services for students. Such agreements may allow for the use of any resources available to either party and must give students the option to enroll in the district at their election.\n[Renumbered 120A.22, subd 1a]\nThe board may furnish school lunches for pupils and teachers on such terms as it determines.\nThe board may employ and discharge necessary employees and may contract for other services.\nA school board may establish and operate an employee recognition program for district employees, including teachers, and may expend funds as necessary to achieve the objectives of the program. The employee recognition program shall not include monetary awards.\n(a) At the request of an employee and as part of the employee's compensation arrangement, the board may purchase an individual annuity contract for an employee for retirement or other purposes and may make payroll allocations in accordance with such arrangement for the purpose of paying the entire premium due and to become due under such contract. The allocation must be made in a manner which will qualify the annuity premiums, or a portion thereof, for the benefit afforded under section 403(b) of the current Federal Internal Revenue Code or any equivalent provision of subsequent federal income tax law. The employee shall own such contract and the employee's rights under the contract shall be nonforfeitable except for failure to pay premiums. Section 122A.40 shall not be applicable hereto and the board shall have no liability thereunder because of its purchase of any individual annuity contracts. This statute shall be applied in a nondiscriminatory manner to employees of the school district. The identity and number of the available vendors under federal Internal Revenue Code section 403(b) is a term and condition of employment under section 179A.03.\n(b) When considering vendors under paragraph (a), the school district and the exclusive representative of the employees shall consider all of the following:\n(1) the vendor's ability to comply with all employer requirements imposed by section 403(b) of the Internal Revenue Code of 1986 and its subsequent amendments, other provisions of the Internal Revenue Code of 1986 that apply to section 403(b) of the Internal Revenue Code, and any regulation adopted in relation to these laws;\n(2) the vendor's experience in providing 403(b) plans;\n(3) the vendor's potential effectiveness in providing client services attendant to its plan and in relation to cost;\n(4) the nature and extent of rights and benefits offered under the vendor's plan;\n(5) the suitability of the rights and benefits offered under the vendor's plan;\n(6) the vendor's ability to provide the rights and benefits offered under its plan; and\n(7) the vendor's financial stability.\nThe board of any independent school district may expend funds to pay premiums on hospitalization and major medical insurance coverage for officers and employees who retire prior to age 65.\nThe board must provide for the payment of all just claims against the district in cases provided by law.\nWhen payment of a claim cannot be deferred until the next board meeting without loss to the district of a discount privilege, or when payment of a claim cannot be deferred until the next board meeting because of contract terms, purchase order terms, or a vendor's standard terms which are part of the contract, the claim may be paid prior to board approval, providing that the board:\n(1) has delegated authority to the clerk or a designated business administrator to make a payment prior to board approval; and\n(2) requires that payment made prior to board approval be acted upon at the next board meeting.\nPayment prior to board approval must not affect the right of the district or a taxpayer to challenge the validity of a claim.\nIn all proper cases, the board must prosecute and defend actions by or against the district.\nIf reimbursement is requested by a district employee, the board may, after consulting with its legal counsel, reimburse the employee for any costs and reasonable attorney fees incurred by the person to defend criminal charges brought against the person arising out of the performance of duties for the district. A board member who is a witness or an alleged victim in the case may not vote on the reimbursement. If a quorum of the board is disqualified from voting on the reimbursement, the reimbursement must be approved by a judge of the district court.\nThe board, or more than one board acting jointly under the authority granted by section 471.59, may construct, acquire, own in whole or in part, operate, and sell and retain and spend the payment received from selling energy from a wind energy conversion system, as defined in section 216C.06, subdivision 19. An individual school board's share of the installed capacity of the wind energy conversion systems authorized by this subdivision must not exceed 3.3 megawatts of nameplate capacity, provided that if more than one board is acting jointly, each board may have a separate share of no more than 3.3 megawatts of nameplate capacity. A board owning, operating, or selling energy from a wind energy conversion system must integrate information about wind energy conversion systems in its educational programming. The board, or more than one board acting jointly under the authority granted by section 471.59, may be a limited partner in a partnership, a member of a limited liability company, or a shareholder in a corporation, established for the sole purpose of constructing, acquiring, owning in whole or in part, financing, or operating a wind energy conversion system for the benefit of the district or districts in accordance with this section. A board individually, or acting jointly, or an entity of which a board is a limited partner, member, or shareholder, may not sell, transmit, or distribute the electrical energy at retail or provide for end use of the electrical energy at an off-site facility of the board or entity. Nothing in this subdivision modifies the exclusive service territories or exclusive right to serve as provided in sections 216B.37 to 216B.43.\nA school board, after formally adopting a policy consistent with this subdivision, may offer a reward to a person who provides accurate and reliable information leading to the conviction of a person who has committed or conspired to commit a crime against students or school employees, volunteers or board members as a result of their affiliation with the school district, or against school district property.\nA board may authorize the use of a credit card by any officer or employee otherwise authorized to make a purchase on behalf of the district. If a district officer or employee makes or directs a purchase by credit card that is not approved by the school board, the officer or employee is personally liable for the amount of the purchase. A purchase by credit card must otherwise comply with all statutes, rules, or district policy applicable to school district purchases.\nThe board may authorize and pay for the membership of the school district or of any district representative designated by the board in those local economic development associations or other community or civic organizations that the board deems appropriate.\nA board that contracts for the services of a school resource officer must ensure the contract meets the requirements of section 626.8482.",
	"repealed": false
}