{
	"id": "290A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/290A.03",
	"title": "290A.03 DEFINITIONS.",
	"text": "The following words, terms, and phrases when used in this chapter shall have the meaning ascribed to them in this section, except where the context indicates a different meaning.\n\"Commissioner\" means the commissioner of revenue of the state of Minnesota.\n(a) \"Income\" means the sum of the following:\n(1) federal adjusted gross income as defined in the Internal Revenue Code; and\n(2) the sum of the following amounts to the extent not included in clause (1):\n(i) all nontaxable income;\n(ii) the amount of a passive activity loss that is not disallowed as a result of section 469, paragraph (i) or (m) of the Internal Revenue Code and the amount of passive activity loss carryover allowed under section 469(b) of the Internal Revenue Code;\n(iii) an amount equal to the total of any discharge of qualified farm indebtedness of a solvent individual excluded from gross income under section 108(g) of the Internal Revenue Code;\n(iv) cash public assistance and relief;\n(v) any pension or annuity (including railroad retirement benefits, all payments received under the federal Social Security Act, Supplemental Security Income, and veterans benefits), which was not exclusively funded by the claimant or spouse, or which was funded exclusively by the claimant or spouse and which funding payments were excluded from federal adjusted gross income in the years when the payments were made;\n(vi) interest received from the federal or a state government or any instrumentality or political subdivision thereof;\n(vii) workers' compensation;\n(viii) nontaxable strike benefits;\n(ix) the gross amounts of payments received in the nature of disability income or sick pay as a result of accident, sickness, or other disability, whether funded through insurance or otherwise;\n(x) a lump-sum distribution under section 402(e)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1995;\n(xi) contributions made by the claimant to an individual retirement account, including a qualified voluntary employee contribution; simplified employee pension plan; self-employed retirement plan; cash or deferred arrangement plan under section 401(k) of the Internal Revenue Code; or deferred compensation plan under section 457 of the Internal Revenue Code, to the extent the sum of amounts exceeds the retirement base amount for the claimant and spouse;\n(xii) to the extent not included in federal adjusted gross income, distributions received by the claimant or spouse from a traditional or Roth style retirement account or plan;\n(xiii) nontaxable scholarship or fellowship grants;\n(xiv) alimony received to the extent not included in the recipient's income;\n(xv) the amount of deduction allowed under section 220 or 223 of the Internal Revenue Code;\n(xvi) the amount deducted for tuition expenses under section 222 of the Internal Revenue Code; and\n(xvii) the amount deducted for certain expenses of elementary and secondary school teachers under section 62(a)(2)(D) of the Internal Revenue Code.\nIn the case of an individual who files an income tax return on a fiscal year basis, the term \"federal adjusted gross income\" shall mean federal adjusted gross income reflected in the fiscal year ending in the calendar year. Federal adjusted gross income shall not be reduced by the amount of a net operating loss carryback or carryforward or a capital loss carryback or carryforward allowed for the year.\n(b) \"Income\" does not include:\n(1) amounts excluded pursuant to the Internal Revenue Code, sections 101(a) and 102;\n(2) amounts of any pension or annuity which was exclusively funded by the claimant or spouse and which funding payments were not excluded from federal adjusted gross income in the years when the payments were made;\n(3) to the extent included in federal adjusted gross income, amounts contributed by the claimant or spouse to a traditional or Roth style retirement account or plan, but not to exceed the retirement base amount reduced by the amount of contributions excluded from federal adjusted gross income, but not less than zero;\n(4) surplus food or other relief in kind supplied by a governmental agency;\n(5) relief granted under this chapter;\n(6) child support payments received under a temporary or final decree of dissolution or legal separation;\n(7) restitution payments received by eligible individuals and excludable interest as defined in section 803 of the Economic Growth and Tax Relief Reconciliation Act of 2001, Public Law 107-16;\n(8) alimony paid; or\n(9) veterans disability compensation paid under title 38 of the United States Code.\n(c) The sum of the following amounts may be subtracted from income:\n(1) for the claimant's first dependent, the exemption amount multiplied by 1.4;\n(2) for the claimant's second dependent, the exemption amount multiplied by 1.3;\n(3) for the claimant's third dependent, the exemption amount multiplied by 1.2;\n(4) for the claimant's fourth dependent, the exemption amount multiplied by 1.1;\n(5) for the claimant's fifth dependent, the exemption amount; and\n(6) if the claimant or claimant's spouse had a disability or attained the age of 65 on or before December 31 of the year for which the taxes were levied, the exemption amount.\n(d) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"exemption amount\" means the exemption amount under section 290.0121, subdivision 1, paragraph (b), for the taxable year for which the income is reported;\n(2) \"retirement base amount\" means the deductible amount for the taxable year for the claimant and spouse under section 219(b)(5)(A) of the Internal Revenue Code, adjusted for inflation as provided in section 219(b)(5)(C) of the Internal Revenue Code, without regard to whether the claimant or spouse claimed a deduction; and\n(3) \"traditional or Roth style retirement account or plan\" means retirement plans under sections 401, 403, 408, 408A, and 457 of the Internal Revenue Code.\n\"Household\" means a claimant and an individual related to the claimant as the claimant's spouse who are domiciled in the same homestead.\n\"Household income\" means all income received by all persons of a household in a calendar year while members of the household, other than income of a dependent.\n\"Homestead\" means the dwelling occupied as the claimant's principal residence and so much of the land surrounding it, not exceeding ten acres, as is reasonably necessary for use of the dwelling as a home and any other property used for purposes of a homestead as defined in section 273.13, subdivision 22, or section 273.13, subdivision 25, paragraph (e), clause (2). For agricultural land assessed as part of a homestead pursuant to section 273.13, subdivision 23, \"homestead\" is limited to the house and garage and immediately surrounding one acre of land. The homestead may be owned as a part of a multidwelling or multipurpose building and the land on which it is built. A manufactured home, as defined in section 273.125, subdivision 8, or a park trailer taxed as a manufactured home under section 168.012, subdivision 9, assessed as personal property may be a dwelling for purposes of this subdivision.\n[See Note.]\n\"Dependent\" means any person who is considered a dependent under sections 151 and 152 of the Internal Revenue Code.\n\"Claimant\" means a person, other than a dependent, as defined under sections 151 and 152 of the Internal Revenue Code disregarding section 152(b)(3) of the Internal Revenue Code, who filed a claim authorized by this chapter and who was a resident of this state as provided in chapter 290 during the calendar year for which the claim for relief was filed. If a homestead property owner was a part-year Minnesota resident, the income reflected in the computation made pursuant to section 290A.04 shall be for the entire calendar year, including income not assignable to Minnesota.\nMS 2022 [Repealed, 2023 c 64 art 7 s 31]\n\"Disability\" means:\n(a) Inability to engage in any substantial gainful activity by reason of any medically determinable physical or mental impairment which can be expected to result in death or has lasted or can be expected to last for a continuous period of not less than 12 months, or\n(b) Blindness; and the term \"blindness\" means central acuity of 20/200 or less in the better eye with the use of a correcting lens. An eye which is accompanied by a limitation in the fields of vision such that the widest diameter of the visual field subtends an angle no greater than 20 degrees shall be considered as having a central visual acuity of 20/200 or less.\n(c) An individual shall be determined to be under a disability only if the physical or mental impairment or impairments are of such severity that the individual is not only unable to do previous work but cannot, considering age, education, and work experience, engage in any other kind of substantial gainful work which exists in the state economy, regardless of whether the work exists in the immediate area of residence, or whether a specific job vacancy exists for the individual, or whether the individual would be hired on applying for work. For purposes of the preceding sentence, \"work which exists in the state economy\" means work which exists in significant numbers either in the area where the individual lives or in several areas of the state.\n(d) A \"physical or mental impairment\" is an impairment that results from anatomical, physiological, or psychological abnormalities which are demonstrable by medically acceptable clinical and laboratory diagnostic techniques.\nMS 2022 [Repealed, 2023 c 64 art 7 s 31]\n(a) \"Gross rent\" means rent paid for the right of occupancy, at arm's length, of a site on which a homestead which is a manufactured home is located.\n(b) If the landlord and tenant have not dealt with each other at arm's length and the commissioner determines that the gross rent charged was excessive, the commissioner may adjust the gross rent to a reasonable amount for purposes of this chapter.\n(c) Any amount paid by a claimant residing in property assessed pursuant to section 273.124, subdivision 3, 4, 5, or 6 for occupancy in that property shall be included within the term \"property taxes payable\" as defined in subdivision 13, to the extent allowed, notwithstanding the fact that ownership is not in the name of the claimant.\n[Repealed, 1997 c 231 art 5 s 19]\n\"Property taxes payable\" means the property tax exclusive of special assessments, penalties, and interest payable on a claimant's homestead after deductions made under sections 273.135, 273.1384, 273.1391, 273.42, subdivision 2, and any other state paid property tax credits in any calendar year, and after any refund claimed and allowable under section 290A.04, subdivision 2h, that is first payable in the year that the property tax is payable. In the case of a claimant who makes ground lease payments, \"property taxes payable\" includes the amount of the payments directly attributable to the property taxes assessed against the parcel on which the house is located. Regardless of the limitations in section 280A(c)(5) of the Internal Revenue Code, \"property taxes payable\" must be apportioned or reduced for the use of a portion of the claimant's homestead for a business purpose if the claimant deducts any business depreciation expenses for the use of a portion of the homestead or deducts expenses under section 280A of the Internal Revenue Code for a business operated in the claimant's homestead. For manufactured homes, \"property taxes payable\" shall also include 17 percent of the gross rent paid in the preceding year for the site on which the homestead is located. When a homestead is owned by two or more persons as joint tenants or tenants in common, such tenants shall determine between them which tenant may claim the property taxes payable on the homestead. If they are unable to agree, the matter shall be referred to the commissioner of revenue whose decision shall be final. Property taxes are considered payable in the year prescribed by law for payment of the taxes.\nIn the case of a claim relating to \"property taxes payable,\" the claimant must have owned and occupied the homestead on January 2 of the year in which the tax is payable and (i) the property must have been classified as homestead property pursuant to section 273.124, on or before December 31 of the assessment year to which the \"property taxes payable\" relate; or (ii) the claimant must provide documentation from the local assessor that application for homestead classification has been made on or before December 31 of the year in which the \"property taxes payable\" were payable and that the assessor has approved the application.\n[Repealed, 1997 c 231 art 5 s 19]\n\"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended through May 1, 2023.\n\"Manufactured home\" means homesteads that are manufactured homes as defined in section 273.125, subdivision 8, including manufactured homes located in a manufactured home community owned by a cooperative organized under chapter 308A, 308B, or 308C, and park trailers taxed as manufactured homes under section 168.012, subdivision 9.\n[See Note.]",
	"repealed": false
}