{
	"id": "18.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.91",
	"title": "18.91 ADVISORY COMMITTEE; MEMBERSHIP.",
	"text": "The commissioner shall consult with the Noxious Weed Advisory Committee to advise the commissioner concerning responsibilities under the noxious weed control program. The committee shall evaluate species for invasiveness, difficulty of control, cost of control, benefits, and amount of injury caused by them. For each species evaluated, the committee shall recommend to the commissioner on which noxious weed list or lists, if any, the species should be placed. Species designated as prohibited or restricted noxious weeds or specially regulated plants must be reevaluated every three years for a recommendation on whether or not they need to remain on the noxious weed lists. The committee shall also advise the commissioner on the implementation of the Minnesota Noxious Weed Law and assist the commissioner in the development of management criteria for each noxious weed category. Members of the committee are not entitled to reimbursement of expenses nor payment of per diem. Members shall serve two-year terms with subsequent reappointment by the commissioner.\nThe commissioner shall appoint members, which shall include representatives from the following:\n(1) the Department of Horticultural Science at the University of Minnesota;\n(2) the Department of Agronomy at the University of Minnesota;\n(3) the Department of Forest Resources at the University of Minnesota;\n(4) the nursery and landscape industry in Minnesota;\n(5) the seed industry in Minnesota;\n(6) the Department of Agriculture;\n(7) the Department of Natural Resources;\n(8) a conservation organization;\n(9) an environmental organization;\n(10) at least two farm organizations;\n(11) the county agricultural inspectors;\n(12) city governments;\n(13) township governments;\n(14) county governments;\n(15) the Department of Transportation;\n(16) the University of Minnesota Extension;\n(17) the timber and forestry industry in Minnesota;\n(18) the Board of Water and Soil Resources;\n(19) soil and water conservation districts;\n(20) the Minnesota Association of County Land Commissioners; and\n(21) other members as needed.\n[Repealed, 2013 c 114 art 2 s 69]\nThe committee shall select a chair from its membership. Meetings of the committee may be called by or at the direction of the commissioner or upon direction of the chair.\n[Repealed, 2013 c 114 art 2 s 69]",
	"repealed": false
}