{
	"id": "116J.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.421",
	"title": "116J.421 RURAL POLICY AND DEVELOPMENT CENTER.",
	"text": "(a) The Rural Policy and Development Center is established at Mankato State University. The center may be established by the board as a nonprofit corporation under section 501(c)(3) of the Internal Revenue Code or the board may organize and operate the center in a manner and form that the board determines best allows the center to carry out its duties.\n(b) If the board organizes the center as a nonprofit corporation under section 501(c)(3) of the Internal Revenue Code, staff of the center may participate in state insurance plans that apply to state employees generally, and are subject to regulation by the state Campaign Finance and Public Disclosure Board.\nThe center is governed by a board of directors appointed to six-year terms by the governor comprised of:\n(1) a representative from each of the two largest statewide general farm organizations;\n(2) a representative from a regional initiative organization selected under section 116J.415, subdivision 3;\n(3) the president of Mankato State University;\n(4) a representative from the general public residing in a town of less than 5,000 located outside of the metropolitan area;\n(5) a member of the house of representatives appointed by the speaker of the house and a member of the senate appointed by the subcommittee on committees of the senate committee on rules and administration appointed for two-year terms;\n(6) three representatives from business, including one representing rural manufacturing and one rural retail and service business;\n(7) three representatives from private foundations with a demonstrated commitment to rural issues;\n(8) one representative from a rural county government; and\n(9) one representative from a rural regional government.\nThe board shall appoint one additional member to the board of directors who shall represent the general public.\nIf the board concludes at any time that the composition of the board does not adequately reflect the ethnic and gender diversity of rural Minnesota, the board may appoint up to four additional members in order to better reflect this diversity. Members appointed by the board under this paragraph shall serve six-year terms. The board may not appoint additional members such that the board would have a total of more than 20 members.\nThe center shall:\n(1) research and identify present and emerging social and economic issues for rural Minnesota, including health care, transportation, crime, housing, and job training;\n(2) forge alliances and partnerships with rural communities to find practical solutions to economic and social problems;\n(3) provide a resource center for rural communities on issues of importance to them;\n(4) encourage collaboration across higher education institutions to provide interdisciplinary team approaches to problem solving with rural communities;\n(5) involve students in center projects; and\n(6) submit to the legislature a report on the \"State of Rural Minnesota\" no later than March 1 in each odd-numbered year.\nThe center has a statewide mission. It may contract and collaborate with higher education and other institutions located throughout the state.\nThe board has the power to do all things reasonable and necessary to carry out the duties of the center including, without limitation, the power to:\n(1) enter into contracts for goods or services with individuals and private and public entities;\n(2) sue and be sued;\n(3) acquire, hold, lease, and transfer any interest in real and personal property;\n(4) accept appropriations, gifts, grants, and bequests;\n(5) hire employees; and\n(6) delegate any of its powers.\nState appropriations to the board, whether from the general fund or the rural policy and development fund, may, at the discretion of the board, be expended for administration of the center and to carry out its duties under this section or under other law.\nCompensation and expense reimbursement of board members is as provided in section 15.0575, subdivision 3.",
	"repealed": false
}