{
	"id": "290.0693",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0693",
	"title": "290.0693 RENTER'S CREDIT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Dependent\" means any individual who is considered a dependent under sections 151 and 152 of the Internal Revenue Code.\n(c) \"Disability\" has the meaning given in section 290A.03, subdivision 10.\n(d) \"Exemption amount\" means the exemption amount under section 290.0121, subdivision 1, paragraph (b).\n(e) \"Gross rent\" means rent paid for the right of occupancy, at arm's length, of a homestead, exclusive of charges for any medical services furnished by the landlord as a part of the rental agreement, whether expressly set out in the rental agreement or not. The gross rent of a resident of a nursing home or intermediate care facility is $600 per month. The gross rent of a resident of an adult foster care home is $930 per month. The commissioner shall annually adjust the amounts in this paragraph as provided in section 270C.22. The statutory year is 2023. If the landlord and tenant have not dealt with each other at arm's length and the commissioner determines that the gross rent charged was excessive, the commissioner may adjust the gross rent to a reasonable amount for purposes of this section.\n(f) \"Homestead\" has the meaning given in section 290A.03, subdivision 6.\n(g) \"Household\" has the meaning given in section 290A.03, subdivision 4.\n(h) \"Household income\" means all income received by all persons of a household in a taxable year while members of the household, other than income of a dependent.\n(i) \"Income\" means adjusted gross income, minus:\n(1) for the taxpayer's first dependent, the exemption amount multiplied by 1.4;\n(2) for the taxpayer's second dependent, the exemption amount multiplied by 1.3;\n(3) for the taxpayer's third dependent, the exemption amount multiplied by 1.2;\n(4) for the taxpayer's fourth dependent, the exemption amount multiplied by 1.1;\n(5) for the taxpayer's fifth dependent, the exemption amount; and\n(6) if the taxpayer or taxpayer's spouse had a disability or attained the age of 65 on or before the close of the taxable year, the exemption amount.\n(j) \"Rent constituting property taxes\" means 17 percent of the gross rent actually paid in cash, or its equivalent, or the portion of rent paid in lieu of property taxes, in any taxable year by a claimant for the right of occupancy of the claimant's Minnesota homestead in the taxable year, and which rent constitutes the basis, in the succeeding taxable year of a claim for a credit under this section by the claimant. If an individual occupies a homestead with another person or persons not related to the individual as the individual's spouse or as dependents, and the other person or persons are residing at the homestead under a rental or lease agreement with the individual, the amount of rent constituting property tax for the individual equals that portion not covered by the rental agreement.\n(a) An individual is allowed a credit against the tax due under this chapter equal to the amount that rent constituting property taxes exceeds the percentage of the household income of the claimant specified in subdivision 3 in the taxable year in which the rent was paid as specified in that subdivision.\n(b) If the amount of credit which a taxpayer is eligible to receive under this section exceeds the taxpayer's liability for tax under this chapter, the commissioner shall refund the excess to the taxpayer.\n(a) A taxpayer whose rent constituting property taxes exceeds the percentage of the household income stated below must pay an amount equal to the percent of income shown for the appropriate household income level along with the percent paid by claimant of the remaining amount of rent constituting property taxes. The credit under subdivision 2 equals the amount of rent constituting property taxes that remain, up to the maximum credit amount shown below.\nThe credit is the amount calculated under this subdivision. No credit is allowed if the taxpayer's household income is $75,389 or more.\n(b) The commissioner must annually adjust the dollar amounts of the income thresholds and the maximum refunds in paragraph (a), as provided in section 270C.22. The statutory year is 2024.\n(c) The commissioner shall construct and make available to taxpayers a comprehensive table showing the rent constituting property taxes to be paid and refund allowed at various levels of income and assessment. The table shall follow the schedule of income percentages, maximums, and other provisions specified in paragraph (a), except that the commissioner may graduate the transition between income brackets. All refunds shall be computed in accordance with tables prepared and issued by the commissioner.\n(a) The owner or managing agent of any property for which rent is paid for occupancy as a homestead must furnish a certificate of rent paid to a person who is a renter on December 31, in the form prescribed by the commissioner. If the renter moves before December 31, the owner or managing agent may give the certificate to the renter at the time of moving, or mail the certificate to the forwarding address if an address has been provided by the renter. The certificate must be made available to the renter before February 1 of the year following the year in which the rent was paid. The owner or managing agent must retain a duplicate of each certificate or an equivalent record showing the same information for a period of four years. The duplicate or other record must be made available to the commissioner upon request.\n(b) The commissioner may require the owner or managing agent, through a simple process, to furnish to the commissioner on or before January 31 a copy of each certificate of rent paid furnished to a renter for rent paid in the prior year. The commissioner shall prescribe the content, format, and manner of the form pursuant to section 270C.30. The commissioner may require the Social Security number, individual taxpayer identification number, federal employer identification number, or Minnesota taxpayer identification number of the owner or managing agent who is required to furnish a certificate of rent paid under this paragraph. Before implementation, the commissioner, after consulting with representatives of owners or managing agents, shall develop an implementation and administration plan for the requirements of this paragraph that attempts to minimize financial burdens, administration and compliance costs, and takes into consideration existing systems of owners and managing agents.\n(a) A taxpayer is eligible for the credit under this section if the taxpayer is an individual, other than a dependent, as defined under sections 151 and 152 of the Internal Revenue Code, disregarding section 152(b)(3) of the Internal Revenue Code, who filed for a credit and who was a resident of this state during the taxable year for which the credit was claimed.\n(b) In the case of a credit for rent constituting property taxes of a part-year Minnesota resident, the household income and rent constituting property taxes reflected in this computation shall be for the period of Minnesota residency only. Any rental expenses paid that may be reflected in arriving at federal adjusted gross income cannot be utilized for this computation.\n(c) When two individuals of a household are able to meet the qualifications to claim a credit under this section, the individuals may determine among them as to which individual may claim the credit. If the individuals are unable to agree, the matter shall be referred to the commissioner of revenue whose decision shall be final.\n(d) To claim a credit under this section, the taxpayer must have resided in a rented or leased unit on which ad valorem taxes or payments made in lieu of ad valorem taxes, including payments of special assessments imposed in lieu of ad valorem taxes, are payable at some time during the taxable year for which the taxpayer claimed the credit.\n(a) A taxpayer must not claim a credit under this section if the taxpayer is a resident of a nursing home, intermediate care facility, long-term residential facility, or a facility that accepts housing support payments whose rent constituting property taxes is paid pursuant to the Supplemental Security Income program under title XVI of the Social Security Act, the Minnesota supplemental aid program under sections 256D.35 to 256D.54, the medical assistance program pursuant to title XIX of the Social Security Act, or the housing support program under chapter 256I.\n(b) If only a portion of the rent constituting property taxes is paid by these programs, the resident is eligible for a credit, but the credit calculated must be multiplied by a fraction, the numerator of which is adjusted gross income, reduced by the total amount of income from the above sources other than vendor payments under the medical assistance program and the denominator of which is adjusted gross income, plus vendor payments under the medical assistance program, to determine the allowable credit.\n(c) Notwithstanding paragraphs (a) and (b), if the taxpayer was a resident of the nursing home, intermediate care facility, long-term residential facility, or facility for which the rent was paid for the claimant by the housing support program for only a portion of the taxable year covered by the claim, the taxpayer may compute rent constituting property taxes by disregarding the rent constituting property taxes from the nursing home or facility and may use only that amount of rent constituting property taxes or property taxes payable relating to that portion of the year when the taxpayer was not in the facility. The taxpayer's household income is the income for the entire taxable year covered by the claim.\nIf a homestead is occupied by two or more renters who are not married to each other, the rent shall be deemed to be paid equally by each renter, and separate claims shall be filed by each renter. The income of each renter shall be each renter's household income for purposes of computing the amount of credit to be allowed.\nOnly one taxpayer per household per year is entitled to claim a credit under this section. In the case of a married taxpayer filing a separate return, only one spouse may claim the credit under this section. The credit amount for the spouse that claims the credit must be calculated based on household income and not solely on the income of the spouse.\n(a) Every taxpayer claiming a credit under this section shall supply to the commissioner of revenue, in support of the claim, proof of eligibility under this section, including but not limited to amount of rent paid, name and address of owner or managing agent of property rented, changes in household membership, and household income.\n(b) Taxpayers with a disability shall submit proof of disability in the form and manner as the commissioner prescribes. The department may require examination and certification by the taxpayer's physician or by a physician designated by the commissioner. The cost of any examination shall be borne by the taxpayer, unless the examination proves the disability, in which case the cost of the examination shall be borne by the commissioner.\n(c) A determination of disability of a taxpayer by the Social Security Administration under Title II or Title XVI of the Social Security Act shall constitute presumptive proof of disability.\nNo claim for a credit under this section shall be allowed if the commissioner determines that the claimant received tenancy to the homestead primarily for the purpose of receiving a credit under this section and not for bona fide residence purposes.\nThe amount necessary to pay the refunds under this section is appropriated from the general fund to the commissioner.",
	"repealed": false
}