{
	"id": "353.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.01",
	"title": "353.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, each of the following terms, for the purposes of this chapter, has the meaning given it.\n\"Public employee\" means a governmental employee or a public officer performing personal services for a governmental subdivision defined in subdivision 6, whose salary is paid, in whole or in part, from revenue derived from taxation, fees, assessments, or from other sources. For purposes of membership in the association, the term includes the classes of persons listed in subdivision 2a and excludes the classes of persons listed in subdivision 2b. The term also includes persons who elect association membership under subdivision 2d, paragraph (a), and persons for whom the applicable governmental subdivision had elected association membership under subdivision 2d, paragraph (b).\n(a) Public employees whose salary from one governmental subdivision exceeds $425 in any month and who are not specifically excluded under subdivision 2b or have not been provided an option to participate under subdivision 2d, whether individually or by action of the governmental subdivision, must participate as members of the association with retirement coverage by the general employees retirement plan under this chapter, the public employees police and fire plan under this chapter, or the local government correctional employees retirement plan under chapter 353E, whichever applies. Membership commences as a condition of employment on the first day of employment or on the first day that the eligibility criteria are met, whichever is later. Public employees include but are not limited to:\n(1) persons whose salary meets the threshold in this paragraph from employment in one or more positions within one governmental subdivision;\n(2) elected county sheriffs;\n(3) persons who are appointed, employed, or contracted to perform governmental functions that by law or local ordinance are required of a public officer, including, but not limited to:\n(i) town and city clerk or treasurer;\n(ii) county auditor, treasurer, or recorder;\n(iii) city manager as defined in section 353.028 who does not exercise the option provided under subdivision 2d; or\n(iv) emergency management director, as provided under section 12.25;\n(4) physicians under section 353D.01, subdivision 2, who do not elect public employees defined contribution plan coverage under section 353D.02, subdivision 2;\n(5) full-time employees of the Dakota County Agricultural Society;\n(6) employees of the Red Wing Port Authority who were first employed by the Red Wing Port Authority before May 1, 2011, and who are not excluded employees under subdivision 2b;\n(7) employees of the Seaway Port Authority of Duluth who are not excluded employees under subdivision 2b;\n(8) employees of the Stevens County Housing and Redevelopment Authority who were first employed by the Stevens County Housing and Redevelopment Authority before May 1, 2014, and who are not excluded employees under subdivision 2b;\n(9) employees of the Minnesota River Area Agency on Aging who were first employed by a Regional Development Commission before January 1, 2016, and who are not excluded employees under subdivision 2b; and\n(10) employees of the Public Employees Retirement Association.\n(b) A public employee or elected official who was a member of the association on June 30, 2002, based on employment that qualified for membership coverage by the public employees retirement plan or the public employees police and fire plan under this chapter, or the local government correctional employees retirement plan under chapter 353E as of June 30, 2002, retains that membership for the duration of the person's employment in that position or incumbency in elected office. Except as provided in subdivision 28, the person shall participate as a member until the employee or elected official terminates public employment under subdivision 11a or terminates membership under subdivision 11b.\n(c) If the salary of an included public employee is less than $425 in any subsequent month, the member retains membership eligibility.\n(d) For the purpose of participation in the general employees retirement plan, public employees include employees who were members of the former Minneapolis Employees Retirement Fund on June 29, 2010.\n(a) The following public employees are not eligible to participate as members of the association with retirement coverage by the general employees retirement plan, the local government correctional employees retirement plan under chapter 353E, or the public employees police and fire plan:\n(1) persons whose salary from one governmental subdivision never exceeds $425 in a month;\n(2) public officers who are elected to a governing body, city mayors, or persons who are appointed to fill a vacancy in an elected office of a governing body, whose term of office commences on or after July 1, 2002, for the service to be rendered in that elected position;\n(3) election judges and persons employed solely to administer elections;\n(4) patient and inmate personnel who perform services for a governmental subdivision;\n(5) except as otherwise specified in subdivision 12a, employees who are employed solely in a temporary position as defined under subdivision 12a, and employees who resign from a nontemporary position and accept a temporary position within 30 days of that resignation in the same governmental subdivision;\n(6) employees who are employed by reason of work emergency caused by fire, flood, storm, or similar disaster, but if the person becomes a probationary or provisional employee within the same pay period, other than on a temporary basis, the person is a \"public employee\" retroactively to the beginning of the pay period;\n(7) employees who by virtue of their employment in one governmental subdivision are required by law to be a member of and to contribute to any of the plans or funds administered by the Minnesota State Retirement System, the Teachers Retirement Association, or the St. Paul Teachers Retirement Fund Association, but this exclusion must not be construed to prevent a person from being a member of and contributing to the Public Employees Retirement Association and also belonging to and contributing to another public pension plan or fund for other service occurring during the same period of time, and a person who meets the definition of \"public employee\" in subdivision 2 by virtue of other service occurring during the same period of time becomes a member of the association unless contributions are made to another public retirement plan on the salary based on the other service or to the Teachers Retirement Association by a teacher as defined in section 354.05, subdivision 2;\n(8) persons who are members of a religious order and are excluded from coverage under the federal Old Age, Survivors, Disability, and Health Insurance Program for the performance of service as specified in United States Code, title 42, section 410(a)(8)(A), as amended, if no irrevocable election of coverage has been made under section 3121(r) of the Internal Revenue Code of 1954, as amended;\n(9) persons who are:\n(i) employed by a governmental subdivision who have not reached the age of 23 and who are enrolled on a full-time basis to attend or are attending classes on a full-time basis at an accredited school, college, or university in an undergraduate, graduate, or professional-technical program, or at a public or charter high school;\n(ii) employed as resident physicians, medical interns, pharmacist residents, or pharmacist interns and are serving in a degree or residency program in a public hospital or in a public clinic; or\n(iii) students who are serving for a period not to exceed five years in an internship or a residency program that is sponsored by a governmental subdivision, including an accredited educational institution;\n(10) persons who hold a part-time adult supplementary technical college license who render part-time teaching service in a technical college;\n(11) for the first three years of employment, foreign citizens who are employed by a governmental subdivision, except that the following foreign citizens must be considered included employees under subdivision 2a:\n(i) H-1B, H-1B1, and E-3 status holders;\n(ii) employees of Hennepin County or Hennepin Healthcare System, Inc.;\n(iii) employees legally authorized to work in the United States for three years or more; and\n(iv) employees otherwise required to participate under federal law;\n(12) public hospital employees who elected not to participate as members of the association before 1972 and who did not elect to participate from July 1, 1988, to October 1, 1988;\n(13) except as provided in section 353.86, volunteer ambulance service personnel, as defined in subdivision 35, but persons who serve as volunteer ambulance service personnel may still qualify as public employees under subdivision 2 and may be members of the Public Employees Retirement Association and participants in the general employees retirement plan or the public employees police and fire plan, whichever applies, on the basis of compensation received from public employment service other than service as volunteer ambulance service personnel;\n(14) except as provided in section 353.87, volunteer firefighters, as defined in subdivision 36, engaging in activities undertaken as part of volunteer firefighter duties, but a person who is a volunteer firefighter may still qualify as a public employee under subdivision 2 and may be a member of the Public Employees Retirement Association and a participant in the general employees retirement plan or the public employees police and fire plan, whichever applies, on the basis of compensation received from public employment activities other than those as a volunteer firefighter;\n(15) employees in the building and construction trades, as follows:\n(i) pipefitters and associated trades personnel employed by Independent School District No. 625, St. Paul, with coverage under a collective bargaining agreement by the pipefitters local 455 pension plan who were either first employed after May 1, 1997, or, if first employed before May 2, 1997, elected to be excluded under Laws 1997, chapter 241, article 2, section 12;\n(ii) electrical workers, plumbers, carpenters, and associated trades personnel employed by Independent School District No. 625, St. Paul, or the city of St. Paul, with coverage under a collective bargaining agreement by the electrical workers local 110 pension plan, the plumbers local 34 pension plan, or the carpenters local 322 pension plan who were either first employed after May 1, 2000, or, if first employed before May 2, 2000, elected to be excluded under Laws 2000, chapter 461, article 7, section 5;\n(iii) bricklayers, allied craftworkers, cement masons, glaziers, glassworkers, painters, allied tradesworkers, and plasterers employed by the city of St. Paul or Independent School District No. 625, St. Paul, with coverage under a collective bargaining agreement by the bricklayers and allied craftworkers local 1 pension plan, the cement masons local 633 pension plan, the glaziers and glassworkers local 1324 pension plan, the painters and allied trades local 61 pension plan, or the plasterers local 265 pension plan who were either first employed after May 1, 2001, or if first employed before May 2, 2001, elected to be excluded under Laws 2001, First Special Session chapter 10, article 10, section 6;\n(iv) plumbers employed by the Metropolitan Airports Commission, with coverage under a collective bargaining agreement by the plumbers local 34 pension plan, who were either first employed after May 1, 2001, or if first employed before May 2, 2001, elected to be excluded under Laws 2001, First Special Session chapter 10, article 10, section 6;\n(v) electrical workers or pipefitters employed by the Minneapolis Park and Recreation Board, with coverage under a collective bargaining agreement by the electrical workers local 292 pension plan or the pipefitters local 539 pension plan, who were first employed before May 2, 2015, and elected to be excluded under Laws 2015, chapter 68, article 11, section 5;\n(vi) laborers and associated trades personnel employed by the city of St. Paul or Independent School District No. 625, St. Paul, who are designated as temporary employees with coverage under a collective bargaining agreement by a multiemployer plan as defined in section 356.27, subdivision 1, who were either first employed on or after June 1, 2018, or if first employed before June 1, 2018, elected to be excluded under Laws 2018, chapter 211, article 16, section 13; and\n(vii) employees who are trades employees as defined in section 356.27, subdivision 1, first hired on or after July 1, 2020, by the city of St. Paul or Independent School District No. 625, St. Paul, except for any trades employee for whom contributions are made under section 356.24, subdivision 1, clause (8), (9), or (10), by either employer to a multiemployer plan as defined in section 356.27, subdivision 1;\n(16) employees who are hired after June 30, 2002, solely to fill seasonal positions under subdivision 12b which are limited in duration by the employer to a period of six months or less in each year of employment with the governmental subdivision;\n(17) persons who are provided supported employment or work-study positions by a governmental subdivision and who participate in an employment or industries program maintained for the benefit of these persons where the governmental subdivision limits the position's duration to up to five years, including persons participating in a federal or state subsidized on-the-job training, work experience, senior citizen, youth, or unemployment relief program where the training or work experience is not provided as a part of, or for, future permanent public employment;\n(18) independent contractors and the employees of independent contractors;\n(19) reemployed annuitants of the association during the course of that reemployment;\n(20) persons appointed to serve on a board or commission of a governmental subdivision or an instrumentality thereof;\n(21) persons employed as full-time fixed-route bus drivers by the St. Cloud Metropolitan Transit Commission who are members of the International Brotherhood of Teamsters Local 638 and who are, by virtue of that employment, members of the International Brotherhood of Teamsters Central States pension plan; and\n(22) persons employed by the Duluth Transit Authority or any subdivision thereof who are members of the Teamsters General Local Union 346 and who are, by virtue of that employment, members of the Central States Southeast and Southwest Areas Pension Fund.\n(b) Any person performing the duties of a public officer in a position defined in subdivision 2a, paragraph (a), clause (3), is not an independent contractor and is not an employee of an independent contractor.\n[See Note.]\n[Repealed, 1989 c 319 art 3 s 26]\n(a) Membership in the association is optional by action of the individual employee for the following public employees who meet the conditions set forth in subdivision 2a:\n(1) members of the coordinated plan who are also employees of labor organizations as defined in section 353.017, subdivision 1, for their employment by the labor organization only, if they elect to have membership under section 353.017, subdivision 2;\n(2) persons who are elected or persons who are appointed to elected positions other than local governing body elected positions who elect to participate by filing a written election for membership;\n(3) members of the association who are appointed by the governor to be a state department head and who elect not to be covered by the general state employees retirement plan of the Minnesota State Retirement System under section 352.021;\n(4) city managers as defined in section 353.028, subdivision 1, who do not elect to be excluded from membership in the association under section 353.028, subdivision 2; and\n(5) employees of the Port Authority of the city of St. Paul on January 1, 2003, who were at least age 45 on that date, and who elected to participate by filing a written election for membership.\n(b) Membership in the association is optional by action of the governmental subdivision for the employees of the following governmental subdivisions under the conditions specified:\n(1) the Minnesota Association of Townships if the board of that association, at its option, certifies to the executive director that its employees who meet the conditions set forth in subdivision 2a are to be included for purposes of retirement coverage, in which case the status of the association as a participating employer is permanent;\n(2) a county historical society if the county in which the historical society is located, at its option, certifies to the executive director that the employees of the historical society who meet the conditions set forth in subdivision 2a are to be considered county employees for purposes of retirement coverage under this chapter. The status as a county employee must be accorded to all similarly situated county historical society employees and, once established, must continue as long as a person is an employee of the county historical society; and\n(3) Hennepin Healthcare System, Inc., a public corporation, with respect to employees other than paramedics, emergency medical technicians, and protection officers, if the corporate board establishes alternative retirement plans for certain classes of employees of the corporation and certifies to the association the applicable employees to be excluded from future retirement coverage.\n(c) For employees who are covered by paragraph (a), clause (1), (2), or (3), or covered by paragraph (b), clause (1) or (2), if the necessary membership election is not made, the employee is excluded from retirement coverage under this chapter. For employees who are covered by paragraph (a), clause (4), if the necessary election is not made, the employee must become a member and have retirement coverage under the applicable provisions of this chapter. For employees specified in paragraph (b), clause (3), membership continues until the exclusion option is exercised for the designated class of employee.\n(d) The option to become a member, once exercised under this subdivision, may not be withdrawn until the termination of public service as defined under subdivision 11a.\n\"Head of department\" means the head of any department, institution, office, or branch of service of any governmental subdivision which directly pays salaries out of its revenue or is empowered to authorize the payment of such salaries.\n\"Accumulated deductions\" means the total of the amounts deducted from the salary of a member, exclusive of interest, and the total of the amounts paid by a member in lieu of such deductions and credited to the member's individual account in the retirement fund.\n[Repealed, 1971 c 106 s 40]\n(a) \"Governmental subdivision\" means a county, city, town, school district within this state, or a department, unit or instrumentality of state or local government, or any public body established under state or local authority that has a governmental purpose, is under public control, is responsible for the employment and payment of the salaries of employees of the entity, and receives a major portion of its revenues from taxation, fees, assessments or from other public sources.\n(b) Governmental subdivision also means the Public Employees Retirement Association, the League of Minnesota Cities, the Association of Metropolitan Municipalities, charter schools formed under chapter 124E, service cooperatives exercising retirement plan participation under section 123A.21, subdivision 5, joint powers boards organized under section 471.59, subdivision 11, paragraph (a), family service collaboratives and children's mental health collaboratives organized under section 471.59, subdivision 11, paragraph (b) or (c), provided that the entities creating the collaboratives are governmental units that otherwise qualify for retirement plan membership, public hospitals owned or operated by, or an integral part of, a governmental subdivision or governmental subdivisions, the Association of Minnesota Counties, the Minnesota Inter-county Association, the Minnesota Municipal Utilities Association, the Metropolitan Airports Commission, the University of Minnesota with respect to police officers covered by the public employees police and fire retirement plan, the Range Association of Municipalities and Schools, soil and water conservation districts, economic development authorities created or operating under sections 469.090 to 469.108, the Port Authority of the city of St. Paul, the Seaway Port Authority of Duluth, the Red Wing Port Authority, the Spring Lake Park Fire Department, incorporated, the Lake Johanna Volunteer Fire Department, incorporated, the Red Wing Environmental Learning Center, the Dakota County Agricultural Society, and Hennepin Healthcare System, Inc.\n(c) Governmental subdivision does not mean any municipal housing and redevelopment authority organized under the provisions of sections 469.001 to 469.047; or any port authority organized under sections 469.048 to 469.089 other than the Port Authority of the city of St. Paul or the Seaway Port Authority of Duluth and other than the Red Wing Port Authority; or any hospital district organized or reorganized before July 1, 1975, under sections 447.31 to 447.37 or the successor of the district; or the board of a family service collaborative or children's mental health collaborative organized under sections 142D.15, 245.491 to 245.495, or 471.59, if that board is not controlled by representatives of governmental units.\n(d) A nonprofit corporation governed by chapter 317A or organized under Internal Revenue Code, section 501(c)(3), which is not covered by paragraph (a) or (b), is not a governmental subdivision unless the entity has obtained a written advisory opinion from the United States Department of Labor or a ruling from the Internal Revenue Service declaring the entity to be an instrumentality of the state so as to provide that any future contributions by the entity on behalf of its employees are contributions to a governmental plan within the meaning of Internal Revenue Code, section 414(d).\n(e) A public body created by state or local authority may request membership on behalf of its employees by providing sufficient evidence that it meets the requirements in paragraph (a).\n(f) An entity determined to be a governmental subdivision is subject to the reporting requirements of this chapter upon receipt of a written notice of eligibility from the association.\n\"Member\" means a person who accepts employment as a \"public employee\" under subdivision 2, who is an employee who works in one or more positions that require or allow membership in the association under subdivision 2a or 2d, for whom contributions have been withheld from salary and who is not covered by the plan established in chapter 353D or excluded under subdivision 2b. A person who is a member remains a member while performing services as a public employee and while on an authorized leave of absence or an authorized temporary layoff.\n\"Former member\" means a member of the association who terminates public service under subdivision 11a or membership under subdivision 11b.\n\"Association\" means the Public Employees Retirement Association.\n[Repealed, 1957 c 935 s 27]\n(a) Subject to the limitations of section 356.611, \"salary\" means:\n(1) the wages or periodic compensation payable to a public employee by the employing governmental subdivision before:\n(i) employee retirement deductions that are designated as picked-up contributions under section 356.62;\n(ii) any employee-elected deductions for deferred compensation, supplemental retirement plans, or other voluntary salary reduction programs that would have otherwise been available as a cash payment to the employee; and\n(iii) employee deductions for contributions to a supplemental plan or to a governmental trust established under section 356.24, subdivision 1, clause (7), to save for postretirement health care expenses, unless otherwise excluded under paragraph (b);\n(2) for a public employee who is covered by a supplemental retirement plan under section 356.24, subdivision 1, clause (8), (9), (10), or (12), the employer contributions to the applicable supplemental retirement plan when an agreement between the parties establishes that the contributions will either result in a mandatory reduction of employees' wages through payroll withholdings, or be made in lieu of an amount that would otherwise be paid as wages;\n(3) a payment from a public employer through a grievance proceeding, settlement, or court order that is attached to a specific earnings period in which the employee's regular salary was not earned or paid to the member due to a suspension or a period of involuntary termination that is not a wrongful discharge under section 356.50; provided the amount is not less than the equivalent of the average of the hourly base salary rate in effect during the last six months of allowable service prior to the suspension or period of involuntary termination, plus any applicable increases awarded during the period that would have been paid under a collective bargaining agreement or personnel policy but for the suspension or involuntary termination, multiplied by the average number of regular hours for which the employee was compensated during the six months of allowable service prior to the suspension or period of involuntary termination, but not to exceed the compensation that the public employee would have earned if regularly employed during the applicable period;\n(4) compensation paid during an authorized leave of absence, other than an authorized medical leave of absence, as long as the compensation paid during a pay period is not less than the lesser of:\n(i) the product of the average hourly base salary rate in effect during the six months of allowable service immediately preceding the leave, multiplied by the average number of regular hours for which the employee was compensated each pay period during the six months of allowable service immediately preceding the leave of absence; or\n(ii) compensation equal to the value of the employee's total available accrued leave hours;\n(5) compensation paid during an authorized medical leave of absence, other than a workers' compensation leave, as long as the compensation paid during a pay period is not less than the lesser of:\n(i) the product of one-half and the average hourly base salary rate in effect during the six months of allowable service immediately preceding the leave of absence; or\n(ii) compensation equal to the value of the employee's total available accrued leave hours; and\n(6) for a public employee who receives performance or merit bonus payment under a written compensation plan, policy, or collective bargaining agreement in addition to regular salary or in lieu of regular salary increases, the compensation paid to the employee for attaining or exceeding performance goals, duties, or measures during a specified period of employment.\n(b) Salary does not mean:\n(1) fees paid to district court reporters;\n(2) unused annual leave, vacation, or sick leave payments, in the form of lump-sum or periodic payments;\n(3) for the donor, payment to another person of the value of hours donated under a benevolent vacation, personal, or sick leave donation program;\n(4) any form of severance or retirement incentive payments;\n(5) an allowance payment or per diem payments for or reimbursement of expenses;\n(6) lump-sum settlements not attached to a specific earnings period;\n(7) workers' compensation payments or disability insurance payments, including payments from employer self-insurance arrangements;\n(8) employer-paid amounts used by an employee toward the cost of insurance coverage, flexible spending accounts, cafeteria plans, health care expense accounts, day care expenses, or any payments in lieu of any employer-paid group insurance coverage, including the difference between single and family rates that may be paid to a member with single coverage and certain amounts determined by the executive director to be ineligible;\n(9) employer-paid fringe benefits, including, but not limited to:\n(i) employer-paid premiums or supplemental contributions for employees for all types of insurance;\n(ii) membership dues or fees for the use of fitness or recreational facilities;\n(iii) incentive payments or cash awards relating to a wellness program;\n(iv) the value of any nonmonetary benefits;\n(v) any form of payment made in lieu of an employer-paid fringe benefit;\n(vi) an employer-paid amount made to a deferred compensation or tax-sheltered annuity program; and\n(vii) any amount paid by the employer as a supplement to salary, either as a lump-sum amount or a fixed or matching amount paid on a recurring basis, that is not available to the employee as cash;\n(10) the amount equal to that which the employing governmental subdivision would otherwise pay toward single or family insurance coverage for a covered employee when, through a contract or agreement with some but not all employees, the employer:\n(i) discontinues, or for new hires does not provide, payment toward the cost of the employee's selected insurance coverages under a group plan offered by the employer;\n(ii) makes the employee solely responsible for all contributions toward the cost of the employee's selected insurance coverages under a group plan offered by the employer, including any amount the employer makes toward other employees' selected insurance coverages under a group plan offered by the employer; and\n(iii) provides increased salary rates for employees who do not have any employer-paid group insurance coverages;\n(11) except as provided in section 353.86 or 353.87, compensation of any kind paid to volunteer ambulance service personnel or volunteer firefighters, as defined in subdivision 35 or 36;\n(12) the amount of compensation that exceeds the limitation provided in section 356.611;\n(13) amounts paid by a federal or state grant for which the grant specifically prohibits grant proceeds from being used to make pension plan contributions, unless the contributions to the plan are made from sources other than the federal or state grant; and\n(14) bonus pay that is not performance or merit pay under paragraph (a), clause (6).\n(c) Amounts, other than those provided under paragraph (a), clause (3), provided to an employee by the employer through a grievance proceeding, a court order, or a legal settlement are salary only if the settlement or court order is reviewed by the executive director and the amounts are determined by the executive director to be consistent with paragraph (a) and prior determinations.\n\"Unit value,\" for a member of the public employees police and fire retirement plan who was a member of the former Minneapolis Firefighters Relief Association on December 29, 2011, is $82.32 for calendar year 2011, $96.899 for calendar year 2012, $100.775 for calendar year 2013, $104.264 for calendar year 2014, $124.031 for calendar year 2015, and for calendar years after calendar year 2015, the prior year's unit value plus an increase equal to the adjustment percentage determined under section 356.415, subdivision 1c, effective for the January 1 of the calendar year.\n\"Unit value,\" for a member of the public employees police and fire retirement plan who was a member of the former Minneapolis Police Relief Association on December 29, 2011, is $86.71 for calendar year 2011, $104.651 for calendar year 2012, $109.011 for calendar year 2013, $114.825 for calendar year 2014, $124.031 for calendar year 2015, and for calendar years after calendar year 2015, the prior year's unit value plus an increase equal to the adjustment percentage determined under section 356.415, subdivision 1c, effective for the January 1 of the calendar year.\n\"Public service\" means service as an officer or employee of a governmental subdivision.\n(a) \"Termination of public service\" occurs when:\n(1) a member resigns or is dismissed from public service by the employing governmental subdivision and the employee does not, within 30 days of the date the employment relationship ended, return to an employment position with a governmental subdivision; or\n(2) the employer-employee relationship is severed due to the expiration of a layoff under subdivision 12 or 12c.\n(b) The termination of public service must be recorded in the association records upon receipt of an appropriate notice from the governmental subdivision.\n(c) A termination of public service does not occur if:\n(1) prior to termination of service, the member has an agreement, verbal or written, to provide service to a governmental subdivision as an employee or to the same governmental subdivision as an independent contractor or employee of an independent contractor; or\n(2) within 30 days after the date the employment relationship ended, the member provides service to the same governmental subdivision as an independent contractor or employee of an independent contractor.\n(a) \"Termination of membership\" means the conclusion of membership in the association for a person who has not terminated public service under subdivision 11a and occurs:\n(1) when a person files a written election with the association to discontinue employee deductions under section 353.27, subdivision 7, paragraph (a), clause (1);\n(2) when a city manager files a written election with the association to discontinue employee deductions under section 353.028, subdivision 2;\n(3) when a member transfers to a temporary position and becomes excluded from membership under subdivision 2b, clause (5); or\n(4) when a member is approved to participate in the postretirement option authorized under section 353.371.\n(b) The termination of membership under paragraph (a), clauses (3) and (4), must be reported to the association by the governmental subdivision.\n\"Authorized temporary or seasonal layoff,\" including seasonal leave of absence, means a suspension of public service for a limited period during a year that is authorized by the employing governmental subdivision for a member who is expected at the start of the period to return to the same position at the end of the layoff period and for whom there has been no termination of public service under subdivision 11a.\n(a) \"Temporary position\" means an employment position predetermined by the employer at the time of hiring to be a period of six months or less. Temporary position also means an employment position occupied by a person hired by the employer as a temporary replacement who is employed for a predetermined period of six months or less.\n(b) \"Temporary position\" does not mean an employment position for a specified or unspecified term in which a person serves a probationary period as a requirement for subsequent employment on a permanent or unlimited basis.\n(c) If employment in a temporary position extends beyond six consecutive months, the head of the department shall report the employee for membership if salary in any month exceeds the salary threshold specified in subdivision 2a. The membership eligibility of an employee who resigns or is dismissed from a temporary position and accepts another temporary position in the same governmental subdivision within 30 days must be determined on the total length of employment rather than on each separate position.\n\"Seasonal position\" means a position where the nature of the work or its duration are related to a specific season or seasons of the year, regardless of whether or not the employing agency anticipates that the same employee will return to the position each season in which it becomes available. The entire period of employment in a year must be used to determine whether or not a position may be excluded as seasonal when there is less than a 30-day break between one seasonal position and a subsequent seasonal position for employment with the same governmental employer. Seasonal positions include, but are not limited to, coaching athletic activities or employment to plow snow or to maintain roads or parks, or to operate skating rinks, ski lodges, golf courses, or swimming pools.\n\"Indefinite layoff\" occurs when a member is placed on a layoff that is not a temporary or seasonal layoff under subdivision 12, for which no date has been specified by the employing governmental subdivision for the employee's return to work, and there has been no termination of public service under subdivision 11a.\n[Repealed, 1963 c 641 s 38]\n(a) \"Actuarial equivalent\" means the condition of one annuity or benefit having an equal actuarial present value as another annuity or benefit, determined as of a given date with each actuarial present value based on the appropriate mortality table adopted by the board of trustees based on the experience of the fund as recommended by the actuary retained under section 356.214, and approved under section 356.215, subdivision 18, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used rather than the investment return specified in section 356.215, subdivision 8.\nFor the purpose of survivor benefit eligibility, \"dependent child\" means:\n(1) a biological or adopted child of a deceased member who is unmarried and has not reached the age of 23;\n(2) a child of the member conceived during the member's lifetime and born after the member's death, unless a parent-child relationship does not exist under section 524.2-120, subdivision 10; and\n(3) a child who has not reached the age of 23 and is the subject of adoption proceedings filed by a member and who, within two years after death of the member, by judgment and decree duly entered, is adjudged to be the adopted child of the deceased member. The child is a dependent child effective on the date of the decree of adoption.\nMS 2022 [Repealed, 2023 c 47 art 2 s 14]\n(a) \"Allowable service\" means:\n(1) service during years of actual membership in the course of which employee deductions were withheld from salary and contributions were made at the applicable rates under section 353.27, 353.65, or 353E.03;\n(2) periods of service covered by payments in lieu of salary deductions under sections 353.27, subdivisions 12 and 12a, and 353.35;\n(3) service in years during which the public employee was not a member but for which the member later elected, while a member, to obtain credit by making payments to the fund as permitted by any law then in effect;\n(4) a period of authorized leave of absence during which the employee receives pay as specified in subdivision 10, paragraph (a), clause (4) or (5), from which deductions for employee contributions are made, deposited, and credited to the fund;\n(5) a period of authorized leave of absence without pay, or with pay that is not included in the definition of salary under subdivision 10, paragraph (a), clause (4) or (5), for which salary deductions are not authorized, and for which a member obtained service credit for up to 12 months of the authorized leave period by payment under section 353.0162, to the fund made in place of salary deductions;\n(6) an authorized temporary or seasonal layoff under subdivision 12, limited to three months allowable service per authorized temporary or seasonal layoff in one calendar year. An employee who has received the maximum service credit allowed for an authorized temporary or seasonal layoff must return to public service and must obtain a minimum of three months of allowable service subsequent to the layoff in order to receive allowable service for a subsequent authorized temporary or seasonal layoff;\n(7) a period of uniformed services leave purchased under section 353.014;\n(8) a period of military service purchased under section 353.0141; or\n(9) a period of reduced salary purchased under section 353.0162.\n(b) No member may receive more than 12 months of allowable service credit in a year either for vesting purposes or for benefit calculation purposes.\n(c) For an active member who was an active member of the former Minneapolis Firefighters Relief Association on December 29, 2011, \"allowable service\" is the period of service credited by the Minneapolis Firefighters Relief Association as reflected in the transferred records of the association up to December 30, 2011, and the period of service credited under paragraph (a), clause (1), after December 30, 2011. For an active member who was an active member of the former Minneapolis Police Relief Association on December 29, 2011, \"allowable service\" is the period of service credited by the Minneapolis Police Relief Association as reflected in the transferred records of the association up to December 30, 2011, and the period of service credited under paragraph (a), clause (1), after December 30, 2011.\nMS 2006 [Repealed, 2000 c 461 art 4 s 4; 1Sp2003 c 12 art 6 s 3; 2004 c 267 art 17 s 7; 2005 c 156 art 4 s 10; 1Sp2005 c 8 art 2 s 4]\nMS 2008 [Renumbered 353.013]\n\"Approved actuary\" means an actuary who meets the definition in section 356.215, subdivision 1, paragraph (c).\n(a) \"Average salary,\" unless otherwise specified, means an amount equivalent to the average of the highest salary of the member, police officer, or firefighter, whichever applies, upon which employee contributions were paid for any five successive years of allowable service, based on dates of salary periods as listed on salary deduction reports. \"Average salary\" includes the salary of the employee during the period of covered employment rendered after reaching the allowable service credit limit of section 353.651, subdivision 3, paragraph (b). Average salary must be based upon all allowable service if this service is less than five years.\n(b) \"Average salary\" may not include any reduced salary paid during a period in which the employee is entitled to benefit payments from workers' compensation for temporary disability, unless the average salary is higher, including this period.\n(c) \"Average salary,\" for purposes of calculating benefits for a surviving spouse or dependent children under section 353.657, subdivision 2 or 3, means the average of the full-time monthly base salary rate in effect during the last six months of allowable service. If the employment during the last six months of allowable service was part time, the average salary must be prorated based on the actual number of hours worked.\n\"Year of allowable service\" means any 12 calendar months not necessarily consecutive in which a public employee received compensation from the governmental subdivision or was eligible to credit for service. It also means 12 months credit each year for employees who are paid on a yearly basis and who may or may not receive compensation in every calendar month in the year.\n\"Total and permanent disability\" means the inability to engage in any substantial gainful activity by reason of any medically determinable physical or mental impairment which can be expected to be of long-continued and indefinite duration. Long-continued and indefinite duration means that the disability has been or is expected to be for a period of at least one year.\n\"Surviving spouse\" means the spouse of a deceased member or disabilitant who was legally married to the member at the time of death.\n[Repealed, 1971 c 106 s 40]\n[Repealed, 1971 c 106 s 40]\n\"Retirement annuity\" means the amount paid or payable by the fund to a former member after retirement.\n\"Optional annuity\" means the allowance paid or payable by the fund to the designated optional annuity beneficiary of a member or former member, pursuant to an optional annuity form selected at or before retirement, or to the spouse of a deceased member under section 353.32, subdivision 1a.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1971 c 106 s 40]\n\"Benefit\" means a monthly survivor benefit paid or payable by the fund to a surviving spouse or a dependent child and also includes a monthly disability benefit paid or payable by the fund to a member who is totally and permanently disabled.\n(a) \"Retirement\" means the payment of an annuity by the association. A right to retirement is subject to termination of public service under subdivision 11a. A right to retirement requires a complete and continuous separation for 30 days from employment as a public employee.\n(b) Notwithstanding the 30-day separation requirement under paragraph (a), a member of a defined benefit plan under this chapter, who also participates in the public employees defined contribution plan under chapter 353D for other public service, may be paid, if eligible, a retirement annuity from the defined benefit plan while participating in the defined contribution plan. A retirement annuity is also payable from a defined benefit plan under this chapter to an eligible member who terminates public service and who, within 30 days of separation, takes office as an elected official of a governmental subdivision.\n(c) Elected officials included in association membership under subdivisions 2a and 2d meet the 30-day separation requirement under this section by resigning from office before filing for a subsequent term in the same office and by remaining completely and continuously separated from that office for 30 days prior to the date of the election.\n(d) The 30-day separation requirement under paragraph (a) does not apply to a retirement annuity payable from a defined benefit plan under this chapter to a public employee if the public employee:\n(1) is covered by a covered retirement plan under section 356.30, subdivision 3;\n(2) is eligible for a combined service annuity under section 356.30, subdivision 1; and\n(3) has entered into a phased retirement agreement or its equivalent permitted by the laws applicable to the covered retirement plan with coverage of the last period of public service.\n\"Designated beneficiary\" means the person, organization, trust, or estate designated by a member, former member, or a person legally authorized to act on behalf of the member or former member to receive a refund of the balance of the member's or former member's accumulated deductions after death. A beneficiary designation is valid if it is made in the form prescribed by the executive director and is received by the association on or before the date of death of the member or former member. If a beneficiary designation is deemed to be invalid for any reason, any remaining balance of the member's or former member's accumulated deductions are subject to the provisions of section 353.32, subdivisions 4 and 5.\n\"Designated optional annuity beneficiary\" means the person designated by a former member to receive a joint and survivor annuity or a modified joint and survivor annuity.\n\"Authorized leave of absence\" means any period during which a member is authorized by an employer to refrain from active employment, with or without pay, evidenced by appropriate record of the employer and promptly transmitted to the association.\n\"Coordinated member\" means a public employee, including a public hospital employee, who is covered by an agreement or modification made between the state and the Secretary of Health and Human Services, making the provisions of the federal Old Age, Survivors and Disability Insurance Act applicable to the member if the membership eligibility criteria are met under this chapter. A coordinated member also is a former basic member who has a complete and continuous separation for at least 30 days from employment as a public employee meeting the requirements specified in subdivision 28, paragraph (a), and who reenters public service as a public employee and meets the membership eligibility criteria under this chapter.\n\"Basic member\" means a public employee, including a public hospital employee, who is not covered by any agreement or modification made between the state and the Secretary of Health and Human Services.\n[Repealed, 1982 c 404 s 10]\n\"Volunteer ambulance service personnel,\" for purposes of this chapter, are basic and advanced life-support emergency medical service personnel employed by or providing services for any public ambulance service or privately operated ambulance service that receives an operating subsidy from a governmental entity.\nFor purposes of this chapter, a person is considered a \"volunteer firefighter\" for all service for which the person receives credit in an association or fund operating under chapter 424A or credit in the retirement plan established under chapter 353G.\n(a) \"Normal retirement age\" means age 65 for a person who first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, clause (6), before July 1, 1989. For a person who first becomes a public employee after June 30, 1989, \"normal retirement age\" means the higher of age 65 or \"retirement age,\" as defined in United States Code, title 42, section 416(l), as amended, but not to exceed age 66.\n(b) \"Normal retirement age\" means age 55 for a person who is a member of a pension fund listed in section 356.30, subdivision 3, clauses (7) and (8).\n\"Business year\" means the first day of the first full pay period through the last day of the last full pay period of the 12-month fiscal year applicable to the respective governmental subdivision.\n[Repealed, 2002 c 392 art 3 s 9]\n[Repealed, 2010 c 359 art 5 s 28]\n\"Duty disability,\" physical or psychological, means a condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of the position held by a person who is a member of the public employees police and fire retirement plan, and that is the direct result of an injury incurred during, or a disease arising out of, the performance of inherently dangerous duties that are specific to the positions covered by the public employees police and fire retirement plan.\n\"Less frequent duties\" means tasks which are designated in the applicant's job description as either required from time to time or as assigned, but which are not carried out as part of the normal routine of the applicant's job.\n\"Line of duty death\" means:\n(1) a death that occurs while performing or as a direct result of performing normal or less frequent duties which are specific to protecting the property and personal safety of others and that present inherent dangers that are specific to the positions covered by the public employees police and fire plan; or\n(2) a death that is determined by the commissioner of public safety to meet the requirements of section 299A.41, subdivision 3.\n\"Normal duties\" means specific tasks which are designated in the applicant's job description and which the applicant performs on a day-to-day basis, but do not include less frequent duties which may be requested to be done by the employer from time to time.\nFor purposes of survivor benefits under the public employees police and fire plan, a \"not line of duty death\" is any death not specified under subdivision 43.\n\"Regular disability,\" physical or psychological, means a condition that is expected to prevent a member, for a period of not less than 12 months, from performing the normal duties of the position held by a person who is a member of the public employees police and fire plan, and which results from a disease or an injury that arises from any activities while not at work, or while at work and performing those normal or less frequent duties that do not present inherent dangers that are specific to the occupations covered by the public employees police and fire plan.\n(a) \"Vesting\" means obtaining a nonforfeitable entitlement to an annuity or benefit from a retirement plan administered by the association by having credit for sufficient allowable service under paragraph (b), (c), or (d), whichever applies.\n(b) For purposes of qualifying for an annuity or benefit as a basic or coordinated plan member of the general employees retirement plan of the association, a public employee is 100 percent vested when the person has accrued credit for not less than three years of allowable service in the general employees retirement plan.\n(c) For purposes of qualifying for an annuity or benefit as a member of the local government correctional service retirement plan:\n(1) a public employee who first became a member of the association before July 1, 2010, is 100 percent vested when the person has accrued credit for not less than three years of allowable service in the local government correctional service retirement plan; and\n(2) a public employee who first becomes a member of the association after June 30, 2010, is vested at the following percentages when the person has accrued credit for allowable service in the local government correctional service retirement plan, as follows:\n(i) 50 percent after five years;\n(ii) 60 percent after six years;\n(iii) 70 percent after seven years;\n(iv) 80 percent after eight years;\n(v) 90 percent after nine years; and\n(vi) 100 percent after ten years.\n(d) For purposes of qualifying for an annuity or benefit as a member of the police and fire retirement plan:\n(1) a public employee who first became a member of the association before July 1, 2010, is 100 percent vested when the person has accrued credit for not less than three years of allowable service in the public employees police and fire retirement plan; and\n(2) a public employee who first becomes a member of the association after June 30, 2010, is vested at the following percentages when the person has accrued credited allowable service in the police and fire plan, as follows:\n(i) 50 percent after five years;\n(ii) 60 percent after six years;\n(iii) 70 percent after seven years;\n(iv) 80 percent after eight years;\n(v) 90 percent after nine years; and\n(vi) 100 percent after ten years.\n\"MERF\" means the former Minneapolis Employees Retirement Fund of which the actuarial liabilities and assets are merged with the general employees retirement plan of the Public Employees Retirement Association, and the benefits of which are governed by the applicable provisions of Minnesota Statutes 2008, chapter 422A.\n[Repealed, 2015 c 68 art 14 s 30]\n\"APRN\" means an individual licensed as an advanced practice registered nurse by the Board of Nursing as defined in section 148.171, subdivision 3, who provides services to a member or an applicant that are within the scope of the APRN's professional licensure.",
	"repealed": false
}