{
	"id": "245G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.02",
	"title": "245G.02 APPLICABILITY.",
	"text": "Except as provided in subdivisions 2 and 3, no person, corporation, partnership, voluntary association, controlling individual, or other organization may provide a substance use disorder treatment service to an individual with a substance use disorder unless licensed by the commissioner.\nThis chapter does not apply to a county or recovery community organization that is providing a service for which the county or recovery community organization is an eligible vendor under section 254B.05. This chapter does not apply to an organization whose primary functions are information, referral, diagnosis, case management, and assessment for the purposes of client placement, education, support group services, or self-help programs. This chapter does not apply to the activities of a licensed professional in private practice. A license holder providing the initial set of substance use disorder services allowable under section 254A.03, subdivision 3, paragraph (c), to an individual referred to a licensed nonresidential substance use disorder treatment program after a positive screen for alcohol or substance misuse is exempt from sections 245G.05; 245G.06, subdivisions 1, 1a, and 4; 245G.07, subdivisions 1, paragraph (a), clauses (2) to (4), and 2, clauses (1) to (7); and 245G.17.\nThis chapter does not apply to substance use disorder treatment provided by a hospital licensed under chapter 62J, or under sections 144.50 to 144.56, unless the hospital accepts funds for substance use disorder treatment from the behavioral health fund under chapter 254B, medical assistance under chapter 256B, or MinnesotaCare or health care cost containment under chapter 256L, or general assistance medical care formerly codified in chapter 256D.\nA residential adolescent substance use disorder treatment program serving an individual younger than 16 years of age must be licensed according to Minnesota Rules, chapter 2960.",
	"repealed": false
}