{
	"id": "260C.419",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.419",
	"title": "260C.419 STATEWIDE OFFICE OF APPELLATE COUNSEL AND TRAINING.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Board\" means the State Board of Appellate Counsel and Training.\n(c) \"Juvenile protection matter\" means any of the following:\n(1) child in need of protection or services matters as defined in section 260C.007, subdivision 6, including habitual truant and runaway matters;\n(2) neglected and in foster care matters as defined in section 260C.007, subdivision 24;\n(3) review of voluntary foster care matters as defined in section 260C.141, subdivision 2;\n(4) review of out-of-home placement matters as defined in section 260C.212;\n(5) termination of parental rights matters as defined in sections 260C.301 to 260C.328; and\n(6) permanent placement matters as defined in sections 260C.503 to 260C.521, including matters involving termination of parental rights, guardianship to the commissioner of children, youth, and families, transfer of permanent legal and physical custody to a relative, permanent custody to the agency, temporary legal custody to the agency, and matters involving voluntary placement pursuant to section 260D.07.\n(d) \"Office\" means the Statewide Office of Appellate Counsel and Training.\n(a) The Statewide Office of Appellate Counsel and Training is established as an independent state office. The office shall be responsible for:\n(1) establishing and maintaining a system for providing appellate representation to parents in juvenile protection matters, as provided in section 260C.163, subdivision 3, paragraph (c), and in Tribal court jurisdictions;\n(2) providing training to all parent attorneys practicing in the state on topics relevant to their practice and establishing practice standards and training requirements for parent attorneys practicing in the state; and\n(3) collaborating with the Minnesota Department of Children, Youth, and Families to coordinate and secure federal Title IV-E support for counties and Tribes interested in accessing federal funding.\n(b) The office shall be governed by a board as provided in subdivision 3.\n(a) The State Board of Appellate Counsel and Training is established to direct the Statewide Office of Appellate Counsel and Training. The board shall consist of seven members, including:\n(1) four public members appointed by the governor; and\n(2) three members appointed by the supreme court, at least one of whom must have experience representing parents in juvenile court and who include two attorneys admitted to practice law in the state and one public member.\n(b) The appointing authorities may not appoint any of the following to be a member of the board:\n(1) a person who is a judge;\n(2) a person who is a registered lobbyist;\n(3) a person serving as a guardian ad litem or counsel for a guardian ad litem;\n(4) a person who serves as counsel for children in juvenile court;\n(5) a person under contract with or employed by the Department of Children, Youth, and Families or a county department of human or social services; or\n(6) a current city or county attorney or assistant city or county attorney.\n(c) All members shall demonstrate an interest in maintaining a high quality, independent appellate defense system for parents in juvenile protection proceedings who are unable to obtain adequate representation, a robust program for parent attorneys in Minnesota, and an efficient coordination effort, in collaboration with the Department of Children, Youth, and Families, to secure and utilize Title IV-E funding. At least one member of the board appointed by the governor must be a representative from a federally recognized Indian Tribe. No more than five members of the board may belong to the same political party. At least three members of the board shall be from judicial districts other than the First, Second, Fourth, and Tenth Judicial Districts. To the extent practicable, the membership of the board must include persons with disabilities, reflect the ethnic diversity of the state, take into consideration race and gender, and include persons from throughout the state. The members shall be well acquainted with representing parents in district court and appellate proceedings related to child protection matters as well as the law that affects a parent attorney's work, including chapter 260C, the Rules of Juvenile Protection Procedure, the Rules of Civil Appellate Procedure, the Indian Child Welfare Act, and the Minnesota Indian Family Preservation Act. The terms, compensation, and removal of members shall be as provided in section 15.0575. The members shall elect a chair from among the membership and the chair shall serve a term of two years.\n(a) Beginning January 1, 2024, and for every four years after that date, the board shall appoint a head appellate counsel in charge of executing the responsibilities of the office who shall provide for sufficient appellate counsel for parents and other personnel necessary to discharge the functions of the office. The head appellate counsel shall serve a four-year term and may be removed only for cause upon the order of the board. The head appellate counsel shall be a full-time qualified attorney, licensed to practice law in this state, and serve in the unclassified service of the state. Vacancies of the office shall be filled by the appointing authority for the unexpired term. The head appellate counsel shall devote full time to the performance of duties and shall not engage in the general practice of law. The compensation of the head appellate counsel shall be set by the board and shall be commensurate with county attorneys in the state.\n(b) Consistent with the decisions of the board, the head appellate counsel shall employ assistants or hire independent contractors to serve as appellate counsel for parents. Each assistant appellate counsel and independent contractor serves at the pleasure of the head appellate counsel. The compensation of assistant appellate counsel and independent contractors shall be set by the board and shall be commensurate with county attorneys in the state.\n(c) A person serving as appellate counsel shall be a qualified attorney licensed to practice law in this state. A person serving as appellate counsel practicing in Tribal court shall be a licensed attorney qualified to practice law in Tribal courts in the state. Assistant appellate counsel and contracted appellate counsel may engage in the general practice of law where not employed or contracted to provide services on a full-time basis.\n(d) The head appellate counsel shall, consistent with the responsibilities under subdivision 2, employ or hire the following:\n(1) one managing appellate attorney;\n(2) two staff attorneys;\n(3) one director of training;\n(4) one program administrator to support Title IV-E reimbursement in collaboration with the Department of Children, Youth, and Families; and\n(5) one office administrator.\n(e) Each employee identified in paragraph (d) serves at the pleasure of the head appellate counsel. The compensation of each employee shall be set by the board and shall be commensurate with county attorneys in the state.\n(f) Any person serving as managing appellate attorney, staff attorney, and director of training shall be a qualified attorney licensed to practice law in the state.\n(g) A person serving as the program administrator and office administrator must be chosen solely on the basis of training, experience, and qualifications.\n(a) The board shall work cooperatively with the head appellate counsel to govern the office and provide fiscal oversight.\n(b) The board shall approve and recommend to the legislature a budget for the board, the office, and any programs operated by that office.\n(c) The board shall establish procedures for distribution of funding under this section to the office and any programs operated by that office.\n(d) The head appellate counsel with the approval of the board shall establish appellate program standards, administrative policies, procedures, and rules consistent with statute, rules of court, and laws that affect appellate counsel's work. The standards must include but are not limited to:\n(1) standards needed to maintain and operate an appellate counsel for parents program, including requirements regarding the qualifications, training, and size of the legal and supporting staff for an appellate counsel program;\n(2) standards for appellate counsel caseloads;\n(3) standards and procedures for the eligibility of appointment, assessment, and collection of the costs for legal representation provided by appellate counsel;\n(4) standards for contracts between contracted appellate counsel and the state appellate counsel program for the legal representation of indigent persons;\n(5) standards prescribing minimum qualifications of counsel appointed under the board's authority or by the courts; and\n(6) standards ensuring the independent, competent, and efficient representation of clients whose cases present conflicts of interest.\n(e) The head appellate counsel, with approval of the board, shall establish training program standards and processes and procedures necessary to carry out the office's responsibilities for statewide training of parent attorneys, including but not limited to establishing uniform practice standards and training requirements for all parent attorneys practicing in the state.\n(f) The head appellate counsel and the program administrator with approval of the board shall establish processes and procedures for collaborating with the Department of Children, Youth, and Families to secure and utilize Title IV-E funds and communicating with counties and Tribes and any other processes and procedures necessary to carry out the office's responsibilities.\n(g) The board may:\n(1) propose statutory changes to the legislature and rule changes to the supreme court that are in the best interests of the operation of the appellate counsel for parents program; and\n(2) require the reporting of statistical data, budget information, and other cost factors by the appellate counsel for parents program.\nIn no event shall the board or its members interfere with the discretion, judgment, or zealous advocacy of counsel in their handling of individual cases as a part of the judicial branch of government.\nThe establishment of the office and its employees and support staff and the board shall be funded by the state of Minnesota. Minnesota counties and Tribes may utilize this office to provide appellate representation to indigent parents in their jurisdiction who are seeking an appeal and for assistance in securing Title IV-E funding through collaboration with the Department of Children, Youth, and Families.\nIf any of the costs provided by appellate counsel are assessed and collected or otherwise reimbursed from any source, the State Board of Appellate Counsel and Training shall deposit payments in a separate account established in the special revenue fund. The amount credited to this account is appropriated to the State Board of Appellate Counsel and Training. The balance of this account does not cancel but is available until expended.",
	"repealed": false
}