{
	"id": "168A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.04",
	"title": "168A.04 FORM AND CONTENT OF APPLICATION.",
	"text": "The application for the first certificate of title of a vehicle or manufactured home in this state, or for reissuance of a certificate of title for a manufactured home under section 168A.142, must be made by the owner to the department on the form prescribed by the department and must contain:\n(1) the first, middle, and last names, the dates of birth, and addresses of all owners who are natural persons, the full names and addresses of all other owners;\n(2) a description of the vehicle or manufactured home including, so far as the following data exists, its make, model, year, identifying number in the case of a vehicle or serial number in the case of a manufactured home, type of body, and whether new or used;\n(3) the date of purchase by applicant, the name and address of the person from whom the vehicle or manufactured home was acquired, the names and addresses of any secured parties in the order of their priority, and the dates of their respective security agreements;\n(4) with respect to motor vehicles subject to the provisions of section 325E.15, the true cumulative mileage registered on the odometer or that the actual mileage is unknown if the odometer reading is known by the owner to be different from the true mileage;\n(5) whether the vehicle sustained damage by collision or other occurrence that meets the disclosure requirements under section 325F.6641, subdivision 1; and\n(6) any further information the department reasonably requires to identify the vehicle or manufactured home and to enable it to determine whether the owner is entitled to a certificate of title, and the existence or nonexistence and priority of any security interest in the vehicle or manufactured home.\nIf the application refers to a vehicle purchased from a dealer it shall contain the name and address of any secured party holding a security interest created or reserved at the time of the sale and the date of the security agreement and be signed by the dealer as well as the owner, and the dealer shall within ten days mail or deliver the application and appropriate taxes to the department.\nIf the United States Postal Service will not deliver mail to the residence address of a registered owner who is an individual as listed on the title application, then the registered owner must provide verification from the United States Postal Service that mail will not be delivered to the registered owner's residence address and that mail will be delivered to a specified alternate mailing address. When an applicant provides an alternate mailing address under this subdivision, the commissioner shall use the alternate mailing address in lieu of the residence address for all notices and mailings to the registered owner.\nIf the application refers to a new vehicle it shall be accompanied by a manufacturer's or importer's certificate of origin.\nIf the application refers to a vehicle last previously registered in another state or country, the application must contain or be accompanied by:\n(1) any certificate of title issued by the other state or country;\n(2) any other information and documents the department reasonably requires to establish the ownership of the vehicle and the existence or nonexistence and priority of any security interest in it;\n(3) the certificate of a person authorized by the department that the identifying number of the vehicle has been inspected and found to conform to the description given in the application, or any other proof of the identity of the vehicle the department reasonably requires; and\n(4) whether the vehicle sustained damage by collision or other occurrence that meets the disclosure requirements under section 325F.6641, subdivision 1. Damage, for the purpose of the calculation under this clause, does not include the actual cost incurred to repair, replace, or reinstall inflatable safety restraints and other vehicle components that must be replaced due to the deployment of the inflatable safety restraints.\n(a) Except as provided in subdivision 6, if the application refers to a specially constructed vehicle, a reconstructed vehicle, or a restored pioneer vehicle, the application shall so state and shall contain or be accompanied by:\n(1) any information and documents the department reasonably requires to establish the ownership of the vehicle and the existence or nonexistence and priority of security interests in it;\n(2) the certificate of a person authorized by the department that the identifying number of the vehicle has been inspected and found to conform to the description given in the application, or any other proof of the identity of the vehicle the department reasonably requires; and\n(3) at the time of application, a written certification to the department that the vehicle to be titled meets the requirements of chapter 169 for vehicles in its class regarding safety and acceptability to operate on public roads and highways.\n(b) As part of the application for certificate of title on a restored pioneer vehicle, the applicant shall supply evidence of the manufacturer's year, make, model, and identifying number of the vehicle. A manufacturer's identifying number is valid under this paragraph if it matches a number permanently affixed, stamped, or otherwise assigned to at least one essential part of the motor vehicle, including but not limited to the engine block or the vehicle body. In the case of an insufficient application, the commissioner may require additional documentation to confirm the manufacturer's identifying number on the vehicle, including but not limited to photographic proof, copies of original vehicle catalogs, or certification letters from antique car collector organizations.\n(a) If the application refers to an assembled motorcycle, the application must so state and be accompanied by:\n(1) a manufacturer's statement or certificate of origin from a recognized motorcycle manufacturer for the frame, complete engine or engine cases, provided that if a statement or certificate of origin is submitted for engine cases it must also be accompanied by copies of original documentation for cylinder heads, cylinders, flywheels, and piston and rod assemblies; and\n(2) vendor receipts or copies of the receipts from suppliers on the transmission assembly, engine assembly, fork assembly, and front and rear wheel assemblies. If the applicant is a motorcycle assembler, the applicant must also provide copies of original vendor receipts for the assemblies listed in this clause.\n(b) An assembled motorcycle for which the documentation required under paragraph (a), clauses (1) and (2), has been submitted is not subject to the filing requirement of section 168A.07, subdivision 1, clause (2).",
	"repealed": false
}