{
	"id": "216I.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.03",
	"title": "216I.03 SITING AUTHORITY.",
	"text": "The legislature hereby declares it is the policy of the state to locate large electric power facilities in an orderly manner that is compatible with environmental preservation and the efficient use of resources. In accordance with the policy, the commission must choose locations that minimize adverse human and environmental impact while ensuring (1) continuing electric power system reliability and integrity, and (2) that electric energy needs are met and fulfilled in an orderly and timely fashion.\n(a) The commission has the authority to provide for site and route selection for large energy infrastructure facilities. The commission must issue permits for large energy infrastructure facilities in a timely fashion and in a manner consistent with the overall determination of need for the project under section 216B.2425 or 216B.243, if applicable.\n(b) The scope of an environmental review conducted under this chapter must not include: (1) questions of need, including size, type, and timing; (2) alternative system configurations; or (3) voltage.\nIf a route is proposed in two or more states, the commission must attempt to reach an agreement with affected states on the entry and exit points before designating a route. The commission, in discharge of the commission's duties under this chapter, may make joint investigations, hold joint hearings within or outside of the state, and issue joint or concurrent orders in conjunction or concurrence with any official or agency of any state or of the United States. The commission may, pursuant to any consent of Congress, negotiate and enter into any agreements or compacts with agencies of other states for cooperative efforts to certify the construction, operation, and maintenance of large electric power facilities in a manner consistent with this chapter's requirements and to enforce the respective state laws regarding large electric power facilities.\nBy December 15, 2025, and every odd-numbered year thereafter, the commission must submit a written report to the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over energy and utilities. The report must:\n(1) provide an update on the progress made to permit, approve, and construct the electric utility infrastructure necessary to meet the requirements of section 216B.1691 within the milestones provided under section 216B.1691;\n(2) describe efforts made by the commission to engage stakeholders in environmental justice areas, as defined in section 216B.1691, subdivision 1, paragraph (c), in permitting, approving, and constructing electric utility infrastructure under this section, section 216B.1691, or section 216B.243; and\n(3) provide information regarding any cumulative impact analysis ordered by the commissioner of the Pollution Control Agency under section 116.065 pertaining to any electric utility infrastructure permitted, approved, or constructed under this section, section 216B.1691, or section 216B.243.",
	"repealed": false
}