{
	"id": "14.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.05",
	"title": "14.05 GENERAL AUTHORITY.",
	"text": "Each agency shall adopt, amend, suspend, or repeal its rules in accordance with the procedures specified in sections 14.001 to 14.69, and only pursuant to authority delegated by law and in full compliance with its duties and obligations. If a law authorizing rules is repealed, the rules adopted pursuant to that law are automatically repealed on the effective date of the law's repeal unless there is another law authorizing the rules. Except as provided in section 14.06, sections 14.001 to 14.69 shall not be authority for an agency to adopt, amend, suspend, or repeal rules.\n(a) An agency may modify a proposed rule in accordance with the procedures of the Administrative Procedure Act. However, an agency may not modify a proposed rule so that it is substantially different from the proposed rule in the notice of intent to adopt rules or notice of hearing.\n(b) A modification does not make a proposed rule substantially different if:\n(1) the differences are within the scope of the matter announced in the notice of intent to adopt or notice of hearing and are in character with the issues raised in that notice;\n(2) the differences are a logical outgrowth of the contents of the notice of intent to adopt or notice of hearing and the comments submitted in response to the notice; and\n(3) the notice of intent to adopt or notice of hearing provided fair warning that the outcome of that rulemaking proceeding could be the rule in question.\n(c) In determining whether the notice of intent to adopt or notice of hearing provided fair warning that the outcome of that rulemaking proceeding could be the rule in question the following factors must be considered:\n(1) the extent to which persons who will be affected by the rule should have understood that the rulemaking proceeding on which it is based could affect their interests;\n(2) the extent to which the subject matter of the rule or issues determined by the rule are different from the subject matter or issues contained in the notice of intent to adopt or notice of hearing; and\n(3) the extent to which the effects of the rule differ from the effects of the proposed rule contained in the notice of intent to adopt or notice of hearing.\nAn agency may withdraw a rule any time before filing it with the secretary of state. An agency may withdraw a portion of a rule unless the remaining rule is substantially different from the rule as published. It shall publish notice that the rule has been withdrawn in the State Register. If a rule is withdrawn, the agency may again propose it for adoption, either in the original or modified form, but the agency shall comply with all procedures of sections 14.05 to 14.28, with the exception of section 14.101, if the noncompliance is approved by the chief administrative law judge.\n[Expired]\nBy December 1 of each year, an agency must submit to the governor, the Legislative Coordinating Commission, the policy and funding committees and divisions with jurisdiction over the agency, and the revisor of statutes, a list of any rules or portions of rules that are obsolete, unnecessary, or duplicative of other state or federal statutes or rules. The list must also include an explanation of why the rule or portion of the rule is obsolete, unnecessary, or duplicative of other state or federal statutes or rules. By December 1, the agency must either report a timetable for repeal of the rule or portion of the rule, or must develop a bill for submission to the appropriate policy committee to repeal the obsolete, unnecessary, or duplicative rule. Such a bill must include proposed authorization to use the expedited procedures of section 14.389 to repeal or amend the obsolete, unnecessary, or duplicative rule. A report submitted under this subdivision must be signed by the person in the agency who is responsible for identifying and initiating repeal of obsolete rules. The report also must identify the status of any rules identified in the prior year's report as obsolete, unnecessary, or duplicative. If none of an agency's rules are obsolete, unnecessary, or duplicative, an agency's December 1 report must state that conclusion.\nThe governor may veto all or a severable portion of a rule of an agency as defined in section 14.02, subdivisions 2 and 4, by submitting notice of the veto to the State Register within 14 days of receiving a copy of the rule from the secretary of state under section 14.16, subdivision 3, 14.26, subdivision 3, or 14.386 or the agency under section 14.389, subdivision 3, or section 14.3895. The veto is effective when the veto notice is submitted to the State Register. This authority applies only to the extent that the agency itself would have authority, through rulemaking, to take such action. If the governor vetoes a rule or portion of a rule under this section, the governor shall notify the chairs of the legislative committees having jurisdiction over the agency whose rule was vetoed.\nAn agency must file rule-related documents with the Office of Administrative Hearings by electronic transmission in the manner approved by that office. An agency may file rule-related documents with the Office of the Revisor of Statutes by electronic transmission in the manner approved by that office.",
	"repealed": false
}