{
	"id": "184B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/184B.20",
	"title": "184B.20 INFLATABLE AMUSEMENT EQUIPMENT.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Commercial use\" means regular use of an inflatable for profit by an owner at a permanently located facility:\n(1) to which the general public is invited; or\n(2) which the owner makes available at that facility for private parties or other events.\n\"Commercial use\" does not include use of an inflatable (i) at a carnival, festival, fair, private party, or similar venue at a location other than the permanently located facility, or (ii) at a facility where the use of the inflatable is incidental to the primary use of the facility.\n(c) \"Inflatable\" means an amusement device, used to bounce or otherwise play on, that incorporates a structural and mechanical system and employs a high-strength fabric or film that achieves its strength, shape, and stability by tensioning from internal air pressure.\n(d) \"Owner\" means a person who owns, leases as lessee, or controls the operation of an inflatable for commercial use.\n(e) \"Person\" has the meaning given in section 302A.011, subdivision 22.\n(f) \"Supervisor\" means an individual stationed within close proximity to an inflatable during its use, for the purpose of supervising its safe use.\n(g) \"Trained\" means that an individual has received instruction in how to supervise the safe use of inflatables in accordance with industry and ASTM standards.\nNo owner shall provide an inflatable for commercial use in this state by others unless the owner complies with this section.\nAn inflatable that is in commercial use must be placed in a manner that complies with ASTM Standard F 2374.07, adopted by the American Society for Testing and Materials, including any future updates to that standard.\nNo owner of an inflatable shall allow commercial use of the inflatable unless a trained supervisor is present in close proximity to the inflatable and is actively supervising its use. The ratio of supervisors to inflatables must comply with ASTM Standard F 2374.07, as referenced under subdivision 3.\n(a) An owner of an inflatable that is subject to subdivision 2 shall maintain liability insurance covering liability for a death or injury resulting from commercial use of the inflatable with limits of no less than $1,000,000 per occurrence and $2,000,000 aggregate per year. The insurance shall also include medical payments coverage of no less than $5,000 per occurrence, which may be limited to injuries incurred while using an inflatable, including getting on or off of the inflatable. The insurance must be issued by an insurance company authorized to issue the coverage in this state by the commissioner of commerce, and must be kept in force during the entire period of registration. In the event of a policy cancellation, the insurer will send written notice to the commissioner of labor and industry at the same time that a cancellation request is received from or a notice is sent to the insured.\n(b) A waiver of liability signed by or on behalf of a minor for injuries arising out of the negligence of the owner or the owner's employee or designee is void.\nAn owner of an inflatable that is subject to subdivision 2 must obtain and maintain a current registration with the commissioner of labor and industry. The registration information must include the name, address, telephone number, and email address of the owner, the street address of each facility at which the owner regularly provides inflatables for commercial use in this state by others, and a current insurance certificate of coverage proving full compliance with subdivision 5. The commissioner shall issue and renew a certificate of registration only to owners who comply with this section. The commissioner shall charge a registration fee of $100 for a two-year registration designed to cover the cost of registration and enforcement. Fee receipts must be deposited in the state treasury and credited to the construction code fund. The registration certificate shall be issued and renewed for a two-year period. The registrant shall promptly notify the commissioner in writing of any changes in the registration information required in this subdivision.\nThe commissioner of labor and industry shall enforce this section and may use for that purpose section 326B.082 and any powers otherwise available to the commissioner for enforcement purposes, including suspension or revocation of the person's registration and assessment of fines.",
	"repealed": false
}