{
	"id": "144.2255",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.2255",
	"title": "144.2255 CERTIFIED BIRTH RECORD FOR HOMELESS YOUTH.",
	"text": "A subject of a birth record who is a homeless youth in Minnesota or another state may apply to the state registrar or a local issuance office for a certified birth record according to this section. The state registrar or local issuance office shall issue a certified birth record or statement of no vital record found to a subject of a birth record who submits:\n(1) a completed application signed by the subject of the birth record;\n(2) a statement that the subject of the birth record is a homeless youth, signed by the subject of the birth record; and\n(3) one of the following:\n(i) a document of identity listed in Minnesota Rules, part 4601.2600, subpart 8, or, at the discretion of the state registrar or local issuance office, Minnesota Rules, part 4601.2600, subpart 9;\n(ii) a statement that complies with Minnesota Rules, part 4601.2600, subparts 6 and 7; or\n(iii) a statement verifying that the subject of the birth record is a homeless youth that complies with the requirements in subdivision 2 and is from an employee of a human services agency that receives public funding to provide services to homeless youth, runaway youth, youth with mental illness, or youth with substance use disorders; a school staff person who provides services to homeless youth; or a school social worker.\nA statement verifying that a subject of a birth record is a homeless youth must include:\n(1) the following information regarding the individual providing the statement: first name, middle name, if any, and last name; home or business address; telephone number, if any; and email address, if any;\n(2) the first name, middle name, if any, and last name of the subject of the birth record; and\n(3) a statement specifying the relationship of the individual providing the statement to the subject of the birth record and verifying that the subject of the birth record is a homeless youth.\nThe individual providing the statement must also provide a copy of the individual's employment identification.\nIf a subject of a birth record obtains a certified birth record under this section using the statement specified in subdivision 1, clause (3), item (iii), the certified birth record issued shall expire six months after the date of issuance. Upon expiration of the certified birth record, the subject of the birth record may surrender the expired birth record to the state registrar or a local issuance office and obtain another birth record. Each certified birth record obtained under this subdivision shall expire six months after the date of issuance. If the subject of the birth record does not surrender the expired birth record, the subject may apply for a certified birth record using the process in subdivision 1.\nData listed under subdivision 1, clauses (2) and (3), item (iii), are private data on individuals.",
	"repealed": false
}