{
	"id": "168A.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.143",
	"title": "168A.143 MANUFACTURED HOMES; OWNERSHIP AT ISSUE.",
	"text": "When an applicant is unable to obtain from or locate previous owners no longer holding an interest in the manufactured home based on a certificate of title, or to locate, obtain, or produce the original certificate of origin or certificate of title for a manufactured home, and there is no evidence of a surrendered certificate of title or manufacturer's statement of origin as provided in section 168A.1412, subdivisions 2 and 3, which has not otherwise been unaffixed or is being unaffixed as provided in section 168A.142, the department must issue or reissue a certificate of title to a manufactured home when the applicant submits:\n(1) the application, pursuant to the requirements of section 168A.04, in a form prescribed by the department;\n(2) an affidavit that:\n(i) identifies the name of the manufacturer and dimensions, and if available, the make, model number, model year, and manufacturer's serial number of the manufactured home; and\n(ii) certifies the applicant is the owner of the manufactured home, has physical possession of the manufactured home, knows of no facts or circumstances that materially affect the validity of the title of the manufactured home as represented in the application, and provides copies of such ownership documents, so far as the documents exist, including by way of example:\n(A) bill of sale;\n(B) financing, replevin, or foreclosure documents;\n(C) appraisal;\n(D) insurance certification;\n(E) personal property tax bill;\n(F) landlord certification;\n(G) affidavit of survivorship or estate documents;\n(H) divorce decree; or\n(I) court order;\n(3) an affidavit by an attorney admitted to practice law in this state stating:\n(i) the attorney has performed a search of the Minnesota Department of Public Safety Driver and Vehicles Services records within 120 days of the date of application to obtain a certificate of origin or certificate of title on behalf of the applicant, but was unable to determine the names or locations of one or more owners or prior owners of the manufactured home;\n(ii) if applicable, the attorney was unable to successfully contact one or more owners, or prior owners, after providing written notice 45 days prior to the registered and last known owner by certified mail at the address shown on Driver and Vehicles Services records, or if the last known address if different from Driver and Vehicles Services records, then also the last known address as known to the applicant;\n(iii) if the attorney is unable to contact one or more owners, or previous owners, by sending a letter by certified mail, then the attorney must present to the department, as an attachment to its affidavit, the returned letter as evidence of the attempted contact, or the acknowledgment of receipt of the letter, together with an affidavit of nonresponse; and\n(iv) the attorney knows of no facts or circumstances that materially affect the validity of the title of the manufactured home as represented in the application, other than property taxes payable in the year the affidavit is signed; and\n(4) payment for required current year taxes and fees as prescribed by the department.\nA security interest perfected under this chapter may be canceled seven years from the perfection date for a manufactured home, upon the request of the owner of the manufactured home, if the owner has paid the lien in full or the lien has been abandoned and the owner is unable to locate the lienholder to obtain a lien release. The owner must send a letter to the lienholder by certified mail, return receipt requested, stating the reason for the release and requesting a lien release. If the owner is unable to obtain a lien release by sending a letter by certified mail, then the owner must present to the department the returned letter as evidence of the attempted contact, or the acknowledgment of receipt of the letter, together with a copy of the letter and an owner affidavit of nonresponse.\n(a) Pursuant to section 168A.23, the department may revoke a previously issued certificate of title issued under this section.\n(b) The department is not liable for any errors, omissions, misstatements, or other deficiencies or inaccuracies in documents submitted to the department under this section, provided the documents submitted appear to satisfy the requirements of this section. The department is not required to investigate the accuracy of statements contained in submitted documents.",
	"repealed": false
}