{
	"id": "176.1351",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.1351",
	"title": "176.1351 MANAGED CARE.",
	"text": "Any person or entity, other than a workers' compensation insurer or an employer for its own employees, may make written application to the commissioner to have a plan certified that provides management of quality treatment to injured workers for injuries and diseases compensable under this chapter. Specifically, and without limitation, an entity licensed under chapter 62C or 62D or a preferred provider organization that is subject to chapter 72A is eligible for certification under this section. Each application for certification shall be accompanied by a reasonable fee prescribed by the commissioner which shall be deposited in the special compensation fund. A plan may be certified to provide services in a limited geographic area. A certificate is valid for the period the commissioner prescribes unless revoked or suspended. Application for certification shall be made in the form and manner and shall set forth information regarding the proposed plan for providing services as the commissioner may prescribe. The information shall include, but not be limited to:\n(1) a list of the names of all health care providers who will provide services under the managed care plan, together with appropriate evidence of compliance with any licensing or certification requirements for those providers to practice in this state; and\n(2) a description of the places and manner of providing services under the plan.\nThe commissioner shall certify a managed care plan if the commissioner finds that the plan:\n(1) proposes to provide quality services that meet uniform treatment standards prescribed by the commissioner and all medical and health care services that may be required by this chapter in a manner that is timely, effective, and convenient for the worker;\n(2) is reasonably geographically convenient to employees it serves;\n(3) provides appropriate financial incentives to reduce service costs and utilization without sacrificing the quality of service;\n(4) provides adequate methods of peer review, utilization review, and dispute resolution to prevent inappropriate, excessive, or not medically necessary treatment, and excludes participation in the plan by those individuals who violate these treatment standards;\n(5) provides a procedure for the resolution of medical disputes;\n(6) provides aggressive case management for injured workers and provides a program for early return to work and cooperative efforts by the workers, the employer, and the managed care plan to promote workplace health and safety consultative and other services;\n(7) provides a timely and accurate method of reporting to the commissioner necessary information regarding medical and health care service cost and utilization to enable the commissioner to determine the effectiveness of the plan;\n(8) authorizes workers to receive compensable treatment from a health care provider who is not a member of the managed care plan, if that provider maintains the employee's medical records and has a documented history of treatment with the employee and agrees to refer the employee to the managed care plan for any other treatment that the employee may require and if the health care provider agrees to comply with all the rules, terms, and conditions of the managed care plan;\n(9) authorizes necessary emergency medical treatment for an injury provided by a health care provider not a part of the managed care plan;\n(10) does not discriminate against or exclude from participation in the plan any category of health care provider and includes an adequate number of each category of health care providers to give workers convenient geographic accessibility to all categories of providers and adequate flexibility to choose health care providers from among those who provide services under the plan;\n(11) provides an employee the right to change health care providers under the plan at least once; and\n(12) complies with any other requirement the commissioner determines is necessary to provide quality medical services and health care to injured workers.\nThe commissioner may accept findings, licenses, or certifications of other state agencies as satisfactory evidence of compliance with a particular requirement of this subdivision.\nAn employee must exhaust the dispute resolution procedure of the certified managed care plan prior to filing a petition or otherwise seeking relief from the commissioner or a compensation judge on an issue related to managed care. If an employee has exhausted the dispute resolution procedure of the managed care plan on the issue of a rating for a disability, the employee may seek a disability rating from a health care provider outside of the managed care organization. The employer is liable for the reasonable fees of the outside provider as limited by the medical fee schedule adopted under this chapter.\nThe commissioner may refuse to certify or may revoke or suspend the certification of a managed care plan that unfairly restricts direct access within the managed care plan to any health care provider profession. Direct access within the managed care plan is unfairly restricted if direct access is denied and the treatment or service sought is within the scope of practice of the profession to which direct access is sought and is appropriate under the standards of treatment adopted by the managed care plan or, in instances where the commissioner has adopted standards of treatment, the standards adopted by the commissioner.\n(a) The commissioner shall refuse to certify or shall revoke or suspend the certification of a managed care plan if the commissioner finds that the plan for providing medical or health care services fails to meet the requirements of this section, or service under the plan is not being provided in accordance with the terms of a certified plan.\n(b) In lieu of or in addition to suspension or revocation under paragraph (a), the commissioner may, for any noncompliance with the managed care plan as certified or any violation of a statute or rule applicable to a managed care plan, assess an administrative penalty payable to the commissioner for deposit in the assigned risk safety account in an amount up to $25,000 for each violation or incidence of noncompliance. The commissioner may adopt rules necessary to implement this subdivision. In determining the level of an administrative penalty, the commissioner shall consider the following factors:\n(1) the number of workers affected or potentially affected by the violation or noncompliance;\n(2) the effect or potential effect of the violation or noncompliance on workers' health, access to health services, or workers' compensation benefits;\n(3) the effect or potential effect of the violation or noncompliance on workers' understanding of their rights and obligations under the workers' compensation law and rules;\n(4) whether the violation or noncompliance is an isolated incident or part of a pattern of violations; and\n(5) the potential or actual economic benefits derived by the managed care plan or a participating provider by virtue of the violation or noncompliance.\nThe commissioner shall give written notice to the managed care plan of the penalty assessment and the reasons for the penalty. The managed care plan has 30 days from the date the penalty notice is issued within which to file a written request for an administrative hearing and review of the commissioner's determination pursuant to section 176.85, subdivision 1.\n(c) If the commissioner, for any reason, has cause to believe that a managed care plan has or may violate a statute or rule or a provision of the managed care plan as certified, the commissioner may, before commencing action under paragraph (a) or (b), call a conference with the managed care plan and other persons who may be involved in the suspected violation or noncompliance for the purpose of ascertaining the facts relating to the suspected violation or noncompliance and arriving at an adequate and effective means of correcting or preventing the violation or noncompliance. The commissioner may enter into stipulated consent agreements with the managed care plan for corrective or preventive action or the amount of the penalty to be paid. Proceedings under this paragraph shall not be governed by any formal procedural requirements, and may be conducted in a manner the commissioner deems appropriate under the circumstances.\n(d) The commissioner may issue an order directing a managed care plan or a representative of a managed care plan to cease and desist from engaging in any act or practice that is not in compliance with the managed care plan as certified, or that it is in violation of an applicable statute or rule. Within 30 days of service of the order, the managed care plan may request review of the cease and desist order by an administrative law judge pursuant to chapter 14. The decision of the administrative law judge shall include findings of fact, conclusions of law and appropriate orders, which shall be the final decision of the commissioner. In the event of noncompliance with a cease and desist order, the commissioner may institute a proceeding in district court to obtain injunctive or other appropriate relief.\n(e) A managed care plan, participating health care provider, or an employer or insurer that receives services from the managed care plan, shall cooperate fully with an investigation by the commissioner. For purposes of this section, cooperation includes, but is not limited to, attending a conference called by the commissioner under paragraph (c), responding fully and promptly to any questions relating to the subject of the investigation, and providing copies of records, reports, logs, data, and other information requested by the commissioner to assist in the investigation.\n(f) Any person acting on behalf of a managed care plan who knowingly submits false information in any report required to be filed by a managed care plan is guilty of a misdemeanor.\nThe commissioner may adopt rules necessary to implement this section.",
	"repealed": false
}