{
	"id": "61B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.20",
	"title": "61B.20 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 61B.18 to 61B.32.\n\"Account\" means either of the two accounts created under section 61B.21, subdivision 1.\n\"Annuity contracts\" means annuity contracts as described in section 60A.06, subdivision 1, clause (4).\n\"Association\" means the Minnesota Life and Health Insurance Guaranty Association.\n\"Commissioner\" means the commissioner of commerce.\n\"Contractual obligation\" means an obligation under a policy or contract or certificate under a group policy or contract, or portion of the policy or contract or certificate, for which coverage is provided under section 61B.19, subdivision 2.\n\"Covered policy\" means a policy or contract to which sections 61B.18 to 61B.32 apply, as provided in section 61B.19, subdivision 2.\n\"Current contractual obligation\" means a contractual obligation which has become due and owing for: (1) death benefits; (2) health insurance benefits; (3) periodic annuity benefit or supplemental contract payments, provided the annuitant or payee elected the commencement of the periodic annuity benefit or supplemental contract payments before the date of impairment or insolvency, or if the annuitant or payee elected the commencement of the periodic annuity benefit or supplemental contract payments after the date of impairment or insolvency, (i) the election was made pursuant to a written plan, such as a retirement plan, which existed before the impairment or insolvency, or (ii) commencement of the periodic annuity benefit or supplemental contract payments was elected at or after the annuitant's attainment of age 65 and, in either case, was for a payment period of not less than the annuitant's lifetime or a period certain of not less than ten years; or (4) cash surrender or loan values or endowment proceeds or any portion thereof, but only if, and to the extent that, an emergency or hardship such as, but not limited to, the funds being reasonably necessary to pay education, medical, home purchase, or essential living expenses, is established in accordance with standards proposed by the association and approved by the commissioner. The hardship standards must also provide for an individual appeal to the board of directors in those circumstances which, while not meeting the standards approved by the commissioner, may truly be a hardship.\n\"Direct life insurance\" means life insurance as described in section 60A.06, subdivision 1, clause (4), and does not include credit life insurance regulated under chapter 62B.\n\"Health insurance\" means accident and health insurance as described in section 60A.06, subdivision 1, clause (5)(a), long-term care insurance as described in section 62A.46, subdivision 2, and chapter 62S, credit accident and health insurance regulated under chapter 62B, subscriber contracts issued by a nonprofit health service plan corporation operating under chapter 62C, and health maintenance contracts issued by a health maintenance organization operating under chapter 62D.\n\"Impaired insurer\" means a member insurer that is not an insolvent insurer, and:\n(1) is placed under an order of rehabilitation or conservation by a court of competent jurisdiction. The order of rehabilitation or conservation referred to in this subdivision is the initial order granting a petition, application, or other request to begin a rehabilitation or conservatorship; or\n(2) is determined by the commissioner to be potentially unable to fulfill its contractual obligations and the commissioner has notified the association of the determination.\n\"Insolvent insurer\" means a member insurer that is placed under an order of liquidation by a court of competent jurisdiction with a finding of insolvency. The order of liquidation referred to in this subdivision is the initial order granting a petition, application, or other request to begin a liquidation.\n\"Member insurer\" means an insurer or health maintenance organization licensed or holding a certificate of authority to transact in this state any kind of insurance or health maintenance organization business for which coverage is provided under section 61B.19, subdivision 2, and includes an insurer or health maintenance organization whose license or certificate of authority in this state may have been suspended, revoked, not renewed, or voluntarily withdrawn. The term does not include:\n(1) a nonprofit hospital or medical service organization, other than a nonprofit health service plan corporation that operates under chapter 62C;\n(2) a fraternal benefit society;\n(3) a mandatory state pooling plan;\n(4) a mutual assessment company or an entity that operates on an assessment basis;\n(5) an insurance exchange;\n(6) a community integrated service network; or\n(7) an entity similar to those listed in clauses (1) to (6).\n\"Moody's Corporate Bond Yield Average\" means the Monthly Average Corporates as published by Moody's Investors Service, Inc., or any successor thereto.\n\"Person\" means an individual, corporation, partnership, unincorporated association, limited liability company, governmental body or entity, or voluntary organization.\n\"Premiums\" means amounts or considerations by whatever name called received on covered policies or contracts less premiums, considerations, and deposits returned, and less dividends and experience credits on those covered policies or contracts to the extent not guaranteed in advance. The term does not include amounts received for policies or contracts or for the portions of policies or contracts for which coverage is not provided under section 61B.19, subdivision 3, except that assessable premium shall not be reduced on account of section 61B.19, subdivision 4, relating to limitations with respect to any one life, any one individual, and any one contract holder. Premiums subject to assessment under section 61B.24, include all amounts received on any unallocated annuity contract issued to a contract holder resident in this state if the contract is not otherwise excluded from coverage under section 61B.19, subdivision 3; provided that \"premiums\" shall not include any premiums in excess of the liability limit on any unallocated annuity contract specified in section 61B.19, subdivision 4.\n\"Resident\" means a person whose principal place of residence is Minnesota at the time a member insurer is initially determined by the commissioner or a court to be an impaired or insolvent insurer and to whom a contractual obligation is owed, whichever occurs first. A person may be a resident of only one state, which for a natural person is the person's principal place of residence, for a person other than a natural person is its principal place of business, and for a trust, is the principal place of business of the settlor or entity which established the trust. Citizens of the United States who are either (i) residents of foreign countries, or (ii) residents of United States possessions, territories, or protectorates that do not have an association similar to the association created by sections 61B.19 to 61B.32, are considered residents of this state if the insurer that issued the covered policies or contracts was domiciled in this state.\n\"State\" means a state, the District of Columbia, Puerto Rico, and a United States possession, territory, or protectorate.\n\"Structured settlement annuity\" means an annuity purchased in order to fund periodic payments for a plaintiff or other claimant in payment for or with respect to personal injury suffered by the plaintiff or other claimant.\n\"Supplemental contract\" means a written agreement entered into for the distribution of policy or contract proceeds.\n\"Unallocated annuity contract\" means an annuity contract, funding agreement, or group annuity certificate that is not issued to and owned by an individual, except to the extent of annuity benefits guaranteed to an individual by an insurer under the contract or certificate.",
	"repealed": false
}