{
	"id": "168.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.041",
	"title": "168.041 IMPOUNDING REGISTRATION PLATES.",
	"text": "(a) When a person is convicted of driving a self-propelled motor vehicle after the suspension, revocation, or cancellation of the person's driver's license or driving privileges, the court shall require the registration plates of the self-propelled motor vehicle involved in the violation owned by the person or registered in the person's name to be surrendered to the court. The court shall issue a receipt for the surrendered registration plates.\n(b) If the violator is not the owner of the self-propelled motor vehicle, the court shall require the registration plates of the motor vehicle to be surrendered to the court if the vehicle was used by the violator with the permission of the owner and the owner had knowledge of the fact that the violator's driver's license had been revoked or suspended prior to the commission of the offense.\nMS 1991 Supp [Repealed, 1992 c 571 art 14 s 14]\nIf a person is convicted of violating a law or municipal ordinance, except a parking law or ordinance, regulating the operation of motor vehicles on the streets or highways, and the record of the person so convicted shows a previous conviction for driving after suspension or revocation of the person's driver's license or driving privileges, the court may direct the commissioner of public safety to suspend the driver's license of the person for a period not exceeding one year. The court may also require the registration plates of any self-propelled motor vehicle owned by the violator or registered in the violator's name to be surrendered to the court.\nExcept as otherwise provided in section 169A.60, if a person is convicted of an offense that makes mandatory the revocation of the person's driver's license, or is convicted of driving a self-propelled motor vehicle without having a valid driver's license in force, the court may require the registration plates of any self-propelled motor vehicle owned by the person or registered in the person's name to be surrendered to the court.\nMS 1988 [Repealed, 1990 c 602 art 1 s 8]\nIf the court issues an impoundment order, the registration plates must be surrendered to the court either three days after the order is issued or on the date specified by the court, whichever date is later. The court may destroy the surrendered registration plates. Except as provided in subdivision 6 or 7, no new registration plates may be issued to the violator or owner until the driver's license of the violator has been reissued or reinstated. The court shall notify the commissioner of public safety within ten days after issuing an impoundment order.\nMS 1989 Supp [Repealed, 1990 c 602 art 1 s 8]\nIf the driver's license revocation that is the basis for an impoundment order is rescinded, the registrar of motor vehicles shall issue new registration plates for the vehicle at no cost, when the registrar receives an application that includes a copy of the order rescinding the driver's license revocation.\n(a) A violator or owner may apply to the commissioner for new registration plates, which must bear a special series of numbers or letters so as to be readily identified by traffic law enforcement officers. The commissioner may authorize the issuance of special plates if a member of the violator's household has a valid driver's license, the violator or owner has a limited license issued under section 171.30, or the owner is not the violator and the owner has a valid or limited license or a member of the owner's household has a valid driver's license. The commissioner may issue the special plates on payment of a $25 fee for each vehicle for which special plates are requested. The commissioner may not authorize the issuance of special plates unless the court that impounded the vehicle's plates gives written approval for the issuance of the special plates.\n(b) Until the driver's license of the violator is reinstated or reissued, the violator shall inform the commissioner that an impoundment order is in effect when requesting any new registration plates.\nA registered owner may not sell a motor vehicle during the time its registration plates have been ordered surrendered or during the time its registration plates bear a special series number, unless the registered owner applies to the court that impounded the plates, for consent to transfer title to the motor vehicle. If the court is satisfied that the proposed sale is in good faith and for a valid consideration, that the registered owner will be deprived of the custody and control of the motor vehicle, and that the sale is not for the purpose of circumventing the provisions of this section, it may certify its consent to the registrar of motor vehicles. The registrar shall then transfer the certificate of title to the new owner upon proper application and issue new registration plates. After the registration plates have been ordered surrendered to the court under this section, if the title to the motor vehicle is transferred by the foreclosure of a chattel mortgage, the cancellation of a conditional sales contract, a sale upon execution, or by decree or order of a court of competent jurisdiction, the registrar of motor vehicles shall then transfer the certificate of title and issue new registration plates to the new registered owner.\nNothing contained in this section or section 169A.60 is intended to change or modify any provision of this chapter, with respect to the taxation of motor vehicles or the time within which motor vehicle taxes must be paid.\nA person who fails to surrender any registration plates to the court upon demand under this section, who operates a motor vehicle on a street or highway at a time when a court has ordered the surrender of its registration plates, or who fails to comply with subdivision 6, paragraph (b), is guilty of a misdemeanor.\n\"Rental motor vehicle\" means a passenger vehicle, truck, motorcycle, or motorized bicycle:\n(1) that is leased in the name of the violator, or leased jointly in the name of the violator and the violator's spouse; and\n(2) that is one of a fleet of two or more vehicles rented for periods of 30 days or less.\nMS 2004 [Repealed, 1Sp2005 c 6 art 2 s 48]",
	"repealed": false
}