{
	"id": "142E.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.12",
	"title": "142E.12 EMPLOYMENT, EDUCATION, OR TRAINING ELIGIBILITY.",
	"text": "(a) Persons who are seeking employment and who are eligible for assistance under this section are eligible to receive up to 240 hours of child care assistance per calendar year.\n(b) At application and redetermination, employed persons who work at least an average of 20 hours and full-time students who work at least an average of ten hours a week and receive at least a minimum wage for all hours worked are eligible for child care assistance for employment. For purposes of this section, work-study programs must be counted as employment. An employed person with an MFIP employment plan shall receive child care assistance as specified in the person's employment plan. Child care assistance during employment must be authorized as provided in paragraphs (c) and (d).\n(c) When the person works for an hourly wage and the hourly wage is equal to or greater than the applicable minimum wage, child care assistance shall be provided for the hours of employment, break, and mealtime during the employment and travel time up to two hours per day.\n(d) When the person does not work for an hourly wage, child care assistance must be provided for the lesser of:\n(1) the amount of child care determined by dividing gross earned income by the applicable minimum wage, up to one hour every eight hours for meals and break time, plus up to two hours per day for travel time; or\n(2) the amount of child care equal to the actual amount of child care used during employment, including break and mealtime during employment, and travel time up to two hours per day.\n[See Note.]\nPersons participating in employment programs, training programs, or education programs are eligible for continued assistance from the child care fund, if they are financially eligible under the sliding fee scale set by the commissioner in section 142E.15.\n(a) Money for an eligible person according to sections 142E.04, subdivision 3, and 142E.08, subdivision 1, shall be used to reduce child care costs for a student. The county shall not limit the duration of child care subsidies for a person in an employment or educational program unless the person is ineligible for child care funds. Any other limitation must be based on county policies included in the approved child care fund plan.\n(b) To be eligible, the student must be in good standing and be making satisfactory progress toward the degree. The maximum length of time a student is eligible for child care assistance under the child care fund for education and training is no more than the time necessary to complete the credit requirements for an associate's or baccalaureate degree as determined by the educational institution. Time limitations for child care assistance do not apply to basic or remedial educational programs needed for postsecondary education or employment. Basic or remedial educational programs include high school, commissioner of education-selected high school equivalency, and English as a second language programs. A program exempt from this time limit must not run concurrently with a postsecondary program.\n(c) If a student meets the conditions of paragraphs (a) and (b), child care assistance must be authorized for all hours of class time and credit hours, including independent study and internships, and up to two hours of travel time per day. A postsecondary student shall receive four hours of child care assistance per credit hour for study time and academic appointments per service period.\n(d) For an MFIP participant, child care assistance must be authorized according to the person's approved employment plan. If an MFIP participant receiving MFIP child care assistance under this chapter moves to another county, continues to participate in an authorized educational or training program, and remains eligible for MFIP child care assistance, the participant must receive continued child care assistance from the county responsible for the person's current employment plan under section 256G.07.\n(e) If a person with an approved education program under section 142E.04, subdivision 3, or 142E.08, subdivision 1, begins receiving MFIP assistance, the person continues to receive child care assistance for the approved education program until the person's education is included in an approved MFIP employment plan or until redetermination, whichever occurs first.\n(f) If a person's MFIP assistance ends and the approved MFIP employment plan included education, the person continues to be eligible for child care assistance for education under transition year child care assistance until the person's education is included in an approved education plan or until redetermination.\n[See Note.]",
	"repealed": false
}