{
	"id": "570.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/570.061",
	"title": "570.061 EXECUTION OF ORDER OF ATTACHMENT.",
	"text": "The sheriff shall execute an attachment order without delay after receiving it. If the sheriff does not attach property within 90 days after the order is issued by the court, or such further time as the court may order, the order shall automatically terminate. If property is attached within this time period, the attachment will remain effective until executed, satisfied, discharged, or vacated, as provided in this chapter.\nReal estate shall be attached by the recording of the sheriff's certified copy of the order and of a return of attachment containing a description of the real estate with the county recorder, or with the registrar of titles with respect to registered property, for the county in which the real estate is located, and serving a copy of the order and return upon the respondent in the manner provided for a service of a summons, if the respondent can be found in the county. If the respondent cannot be found in that county, the order and return shall be mailed by registered mail or certified mail to the respondent's last known address. The attachment shall be a lien on the interest of the respondent in the real estate from the time of recording with the recorder or registrar.\nPersonal property shall be attached in the manner provided by law for levy of execution and, so far as practicable, the provisions relating to the levy shall govern the execution of the attachment order. When an attachment of personal property has been made, the sheriff shall affix to the order an inventory of the property attached, specifying any proposed sale of perishable property, and shall serve a copy of the order and inventory upon the respondent in the manner provided for the service of a summons if the respondent can be found in the county. If the respondent cannot be found in the county, the order and return shall be mailed by registered or certified mail to the respondent's last known address. Attachment of personal property shall be a lien on the interest of the respondent in the personal property from the time of seizure by the sheriff or subjection to the control of the sheriff.\nIf any of the property attached is perishable, the sheriff shall sell the perishable property in the manner provided for the sale of personal property on execution. The sheriff shall also take such legal proceedings, either in the sheriff's own name or that of the respondent, as may be necessary for the recovery of credits and affects attached.\nWhen any attachment order is fully executed or discharged, the sheriff shall return the order to the court administrator, with an attached record of the sheriff's actions in executing or discharging the order of the court.",
	"repealed": false
}