{
	"id": "65B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.17",
	"title": "65B.17 RENEWAL; NOTICE NOT TO RENEW.",
	"text": "No insurer shall fail to renew an automobile insurance policy unless it shall mail or deliver to the named insured, at the address shown in the policy, at least 60 days' advance notice of its intention not to renew. The notice must contain the specific underwriting or other reason or reasons for the nonrenewal. When the failure to renew is based upon a termination of the agency contract, the notice must so state. This section does not apply:\n(a) if the insurer has manifested its willingness to renew; or\n(b) in case of nonpayment of the renewal premium,\nprovided that, notwithstanding the failure of an insurer to comply with this section, the policy terminates on the effective date of any other automobile insurance policy procured by the insured, with respect to any automobile designated in both policies. Renewal of a policy does not constitute a waiver or estoppel with respect to grounds for cancellation which existed before the effective date of the renewal. No insurer shall fail to renew an automobile policy solely because of the age of the insured. No insurer shall refuse to renew an automobile insurance policy for reasons which are arbitrary or capricious. No insurer shall refuse to renew an automobile insurance policy in violation of rules adopted pursuant to subdivision 2. An insurer may refuse to renew an automobile insurance policy in case of nonpayment of dues to an association or organization, other than an insurance association or organization, where payment of dues is a prerequisite to obtaining or continuing such insurance; provided, however, that this provision for nonrenewal for failure to pay dues shall not be applicable to persons who are retired at age 62 years of age or older or who are disabled, according to Social Security standards.\nThe commissioner may adopt rules pursuant to chapter 14 to specify the grounds for nonrenewal of an automobile policy. The rules must limit the basis for nonrenewal to the following factors:\n(a) the reasons stated for cancellation in section 65B.15;\n(b) payments made for collision, bodily injury liability, or property damage liability coverage;\n(c) moving violations of a driver; and\n(d) other factors deemed reasonable by the commissioner.\nThe rules must specify the manner in which these factors will be considered and may reflect the severity or recurrence of any moving violation, the amount of any payment made, and the number of vehicles insured.\nAn insurer withdrawing from the market by nonrenewing a line of business must notify the commissioner in writing at least 90 days before termination of any policy is effective. The notice must contain the effective date of the withdrawal plan, the number of policies affected, the reason for the withdrawal, and the availability of coverage in the market.\nThe rules adopted under this section may provide for imposition of a monetary penalty not greater than $500 per occurrence upon insurers who are found to be in violation of any rule provision.",
	"repealed": false
}