{
	"id": "51A.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.041",
	"title": "51A.041 ORGANIZATION OF CAPITAL STOCK ASSOCIATIONS.",
	"text": "The incorporators of a capital stock association shall appoint one of their number as chair of the incorporators and the chair shall procure from a surety company or other surety acceptable to the commissioner, a surety bond in an amount at least equal to the amount of capital stock contributions, plus the additional amounts described in subdivision 2. The bond shall name the commissioner as obligee and shall be delivered to the commissioner. It shall assure the safekeeping of the funds described; their delivery to the association after the issuance of the certificate of incorporation and after the bonding of the officers; and, in the event of the failure to complete organization, the return of the amounts collected to the respective subscribers or their assigns, less reasonable expenses which shall be deducted from the paid-in surplus. Before a certificate of incorporation is issued, the capital of the association shall be paid in by subscribers to the chair in cash or authorized securities and shall be the sum of the par or initially stated value of all shares of voting capital stock. Each share of capital stock shall entitle the holder thereof to one vote. The minimum required capital shall be not less than $500,000, provided the commissioner may require a larger amount to be paid in. No portion of the capital stock shall be withdrawn by any person or in any way, either in dividends or otherwise, except as provided by law. No dividend on capital stock shall be made except as provided in section 51A.21, subdivision 21.\nExcept with the written consent of the commissioner, no person shall be eligible for election or shall serve as director or officer of an association who has been adjudicated a bankrupt or convicted of a criminal offense involving dishonesty or a breach of trust. A director shall automatically cease to be a director when adjudicated a bankrupt or convicted of a criminal offense as herein provided.\nIn addition to the required capital stock the incorporators shall pay an additional amount as the commissioner shall determine which shall constitute minimum paid-in surplus. This paid-in surplus shall in no event be less than 25 percent of the amount of required capital stock. Furthermore, there shall be established an expense fund in an amount determined by the commissioner to be adequate to meet the expense of organizing the association and its operating expenses until the time its net income is sufficient.\nAfter approval by the commissioner of commerce of the application for a certificate of incorporation, and prior to issuance of the certificate of incorporation by the commissioner, the incorporators of the proposed association shall file with the commissioner a statement in a form and with the supporting data and proof as it may require, verifying that the entire capital and paid-in surplus has been unconditionally paid in, and that the funds representing the capital and paid-in surplus, less sums of the paid-in surplus expended for land, building, supplies, fixtures, equipment, and organization, are on hand.\nAs of the date corporate existence begins, the association shall issue capital stock as necessary to satisfy the minimum capital requirements of this section and additional capital stock as may be approved for issuance by its board of directors up to the amount authorized in its certificate of incorporation, and thereafter shall issue no other shares except as authorized in Laws 1981, chapter 276. Any capital stock of an association, when issued, shall constitute permanent capital and shall not be retired or withdrawn except as hereinafter provided until all liabilities of the association have been satisfied in full, including the withdrawal value of all deposit accounts, and until outstanding capital certificates have been retired. An association may issue shares of common stock and preferred stock, with or without par value, and the common and preferred stock may be divided into classes and the classes into series. Capital stock of an association shall be issued pursuant to the following requirements:\n(a) Except for stock issued pursuant to the incorporation of the association, an employee stock option plan, or other forms of stock-based compensation or a plan of merger, consolidation, conversion from a mutual to a capital stock association, or other type of reorganization which has been approved by the commissioner, the consideration for the issuance of capital stock shall be paid in cash. The par value or stated value of the stock shall be maintained as the permanent capital of the association, and any additional amount paid in shall be credited to paid-in surplus.\n(b) The aggregate par value or stated value of all outstanding shares of capital stock shall be the permanent capital of the association, and except as otherwise specifically provided by Laws 1981, chapter 276, the capital stock shall not be retired until final liquidation of the association. No association shall reduce the par or stated value of its outstanding capital stock without first obtaining the written approval of the commissioner, and the approval shall be withheld if the reduction will cause the par or stated value of outstanding capital stock to be less than the minimum required by Laws 1981, chapter 276, or will result in less than adequate net worth as the commissioner may determine. No association shall retire any part of its capital stock unless the retirement is approved by the commissioner. With the written approval of the commissioner, an association may purchase its capital stock from the personal representative of a deceased stockholder; and with the written approval, an association may contract with a living stockholder for this purpose upon the stockholder's death. Any purchase shall be for the price, and upon the terms and conditions, agreed upon by the association and the stockholder or personal representative; provided, however, that the purchase shall not reduce the net worth accounts of the association, or any of them, to an amount less than required by applicable law or by any approved insurer of the association's savings accounts. An association agreeing with a stockholder to purchase that stockholder's capital stock upon the stockholder's death may purchase insurance upon the life of the stockholder to fund or partially fund the purchase. Any stock purchased from a decedent's personal representative may be resold by the association at the price, and upon the terms and conditions, as the board of directors of the association shall approve, or may be retired; provided, however, that prior to the resale, notice shall be filed with the commissioner disclosing the price, terms, and conditions of the proposed resale.\nWithin 30 days after the corporate existence of an association begins, the directors of the association shall hold an organization meeting and shall elect officers pursuant to the provisions of Laws 1981, chapter 276 and the bylaws. At the organization meeting the directors shall take other action as appropriate in connection with beginning the transaction of business by the association. The commissioner may extend by order the time within which the organization meeting shall be held.",
	"repealed": false
}