{
	"id": "182.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.66",
	"title": "182.66 CITATIONS.",
	"text": "After an inspection or investigation, if the commissioner believes that an employer has violated a requirement of section 182.653, or any standard, rule or order adopted pursuant to this chapter, the commissioner shall, with reasonable promptness and in no event later than six months following the inspection, issue a written citation to the employer by certified mail. The citation shall describe with particularity the nature of the violation, including a reference to the provision of the act, standard, rule or order alleged to have been violated. In addition, the citation shall fix a reasonable time for the abatement of the violation.\nEach citation issued under this section, and the penalty proposed to be assessed under section 182.666, or a copy or copies thereof, shall be prominently posted, as prescribed in rules issued by the commissioner, at or near each place a violation referred to in the citation occurred. Each citation and proposed penalty shall be posted for a minimum period of 20 days.\nThe commissioner may prescribe procedures for the issuance of a notice in lieu of a citation with respect to de minimis violations which have no direct or immediate relationship to safety and health.\nNotwithstanding section 13.39, subdivision 2, the data in a written citation is classified as public data 20 days after the employer has received the citation. All data in the citation is public, including but not limited to the employer's name, the employer's business address, and the address of the worksite; the date or dates of inspection; the date the citation was issued; the provision of the act, standard, rule, or order alleged to have been violated; the severity level of the citation; the description of the nature of the violation; the proposed abatement date; the proposed penalty; and any abatement guidelines. If a notice of contest is filed contesting any part of a citation pursuant to section 182.661, subdivision 3, the date that the notice was filed shall also be classified as public data 20 days after the employer has received the citation. When citation data is requested, the department must also provide any final settlement agreement or order amending or withdrawing the citation.",
	"repealed": false
}