{
	"id": "341.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.21",
	"title": "341.21 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Boxing\" means the act of attack and defense with the fists, using padded gloves, that is practiced as a sport under the rules of the Association of Boxing Commissions, or equivalent. Where applicable, boxing includes tough person contests.\n\"Combatant\" means an individual who employs the act of attack and defense as a professional boxer, professional or amateur tough person, professional or amateur kickboxer, or professional or amateur mixed martial artist while engaged in a combative sport.\n\"Combative sport\" means a sport that employs the act of attack and defense with the fists, with or without using padded gloves, or feet that is practiced as a sport under the rules of the Association of Boxing Commissions, unified rules for mixed martial arts, or their equivalent. Combative sports include professional boxing, professional and amateur tough person, professional or amateur kickboxing, and professional and amateur mixed martial arts contests.\n\"Combative sports contest\" means a professional boxing, a professional or amateur tough person, a professional or amateur kickboxing, or a professional or amateur mixed martial arts contest, bout, competition, match, or exhibition.\n[Repealed, 2012 c 278 art 3 s 10]\n\"Commissioner\" means the commissioner of labor and industry or a duly designated representative of the commissioner who is either an employee of the Department of Labor and Industry or a person working under contract with the department.\n[Renumbered subd 2c]\n[Repealed, 2012 c 278 art 3 s 10]\n\"HBV\" means the hepatitis B virus with the e-antigen present in the most recent blood test.\n\"HCV\" means the hepatitis C virus.\n\"HIV\" means the human immunodeficiency virus.\n\"Individual\" means a living human being.\n[Renumbered subd 4g]\n\"Martial art\" means a variety of weaponless disciplines of combat or self-defense that utilize physical skill and coordination, and are practiced as combat sports. The disciplines include, but are not limited to, Wing Chun, Tae kwon do, savate, karate, sanshou, Jiu Jitsu, judo, ninjitsu, kung fu, Brazilian Jiu Jitsu, wrestling, grappling, tai chi, and other weaponless martial arts disciplines.\n[Renumbered subd 4h]\n\"Mixed martial arts contest\" means a combat sport in which combatants are permitted to use a wide range of fighting techniques and is a contest between two or more individuals consisting of any combination of two or more full contact martial art disciplines.\n[Renumbered subd 4f]\n\"Person\" means an individual, corporation, partnership, limited liability company, organization, or other business entity organized and existing under law, its officers and directors, or a person holding 25 percent or more of the ownership of a corporation that is authorized to do business under the laws of this state.\n\"Kickboxing\" means the act of attack and defense with the fists using padded gloves and bare feet.\n\"Professional\" means any person who competes for any money prize or a prize that exceeds the value of $50 or teaches, pursues, or assists in the practice of a combative sport as a means of obtaining a livelihood or pecuniary gain.\n[Repealed by amendment, 2008 c 300 s 20]\n\"Tough person contest,\" including contests marketed as tough man or tough woman contests, means a boxing match or similar contest where each combatant wears headgear and gloves that weigh at least 12 ounces.\n[Repealed by amendment, 2008 c 300 s 20]",
	"repealed": false
}