{
	"id": "256K.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.49",
	"title": "256K.49 EMERGENCY SERVICES GRANTS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Eligible organization\" means a local governmental unit, federally recognized Tribal Nation, or nonprofit organization providing or seeking to provide emergency services for homeless persons.\n(d) \"Emergency services\" means:\n(1) providing emergency shelter for homeless persons; and\n(2) assisting homeless persons in obtaining essential services, including:\n(i) access to permanent housing;\n(ii) medical and psychological help;\n(iii) employment counseling and job placement;\n(iv) substance abuse treatment;\n(v) financial assistance available from other programs;\n(vi) emergency child care;\n(vii) transportation; and\n(viii) other services needed to stabilize housing.\nAn emergency services grant program is established to provide homeless persons essential services and emergency shelter in safe, sanitary, and decent facilities. The grant program is to help eligible organizations improve the quality of existing shelters, make available other emergency housing, meet the operating and maintenance costs of shelters, and provide essential services to homeless persons. The program shall be administered by the commissioner.\nThe commissioner shall make grants so as to ensure that emergency services are available to meet the needs of homeless persons statewide.\nThe commissioner may require a grantee to match the grant amount with $1 of nonstate funds for every $2 of grant funds. The match may be in-kind, including the value of volunteer time, or in cash, or a combination of the two.\nAn eligible organization may apply to the commissioner for a grant to initiate, maintain, or expand a program providing emergency services for homeless persons. The commissioner shall determine the timing and form of the application for the program.\nThe commissioner shall award grants based on the following criteria:\n(1) that the application is for a grant to provide emergency services;\n(2) evidence of the applicant's need for state assistance and of the need for the particular emergency services to be funded; and\n(3) long-range plans for future funding if the need continues to exist for the emergency services.\nIn order to collect uniform data to measure better the nature and extent of the need for emergency services, grant recipients shall collect and make available to the commissioner the following information:\n(1) the number of persons who seek emergency shelter and where they are seeking shelter;\n(2) the number of persons for whom shelter is provided and where, by age, sex, and whether as an individual or part of a family;\n(3) the reasons for seeking assistance;\n(4) the length of stay;\n(5) the reasons for leaving the shelter; and\n(6) the demand for essential services.",
	"repealed": false
}