{
	"id": "62M.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.17",
	"title": "62M.17 CONTINUITY OF CARE; PRIOR AUTHORIZATIONS.",
	"text": "If an enrollee obtains coverage from a new health plan company and the health plan company for the enrollee's new health benefit plan uses a different utilization review organization from the enrollee's previous health benefit plan to conduct utilization review, the health plan company for the enrollee's new health benefit plan shall comply with a prior authorization for health care services approved by the utilization review organization used by the enrollee's previous health benefit plan for at least the first 60 days that the enrollee is covered under the new health benefit plan. In order to obtain coverage for this 60-day time period, the enrollee or the enrollee's attending health care professional must submit documentation of the previous prior authorization to the enrollee's new health plan company according to procedures in the enrollee's new health benefit plan. During this 60-day time period, the utilization review organization used by the enrollee's new health plan company may conduct its own utilization review of these health care services.\n(a) If, during a plan year, a utilization review organization changes coverage terms for a health care service or the clinical criteria used to conduct prior authorizations for a health care service, the change in coverage terms or change in clinical criteria shall not apply until the next plan year for any enrollee who received prior authorization for a health care service using the coverage terms or clinical criteria in effect before the effective date of the change.\n(b) Paragraph (a) does not apply if a utilization review organization changes coverage terms for a drug or device that has been deemed unsafe by the United States Food and Drug Administration (FDA); that has been withdrawn by either the FDA or the product manufacturer; or when an independent source of research, clinical guidelines, or evidence-based standards has issued drug- or device-specific warnings or recommended changes in drug or device usage.\n(c) Paragraph (a) does not apply if a utilization review organization changes coverage terms for a service or the clinical criteria used to conduct prior authorizations for a service when an independent source of research, clinical guidelines, or evidence-based standards has recommended changes in usage of the service for reasons related to patient harm. This paragraph expires December 31, 2025, for health benefit plans offered, sold, issued, or renewed on or after that date.\n(d) Effective January 1, 2026, and applicable to health benefit plans offered, sold, issued, or renewed on or after that date, paragraph (a) does not apply if a utilization review organization changes coverage terms for a service or the clinical criteria used to conduct prior authorizations for a service when an independent source of research, clinical guidelines, or evidence-based standards has recommended changes in usage of the service for reasons related to previously unknown and imminent patient harm.\n(e) Paragraph (a) does not apply if a utilization review organization removes a brand name drug from its formulary or places a brand name drug in a benefit category that increases the enrollee's cost, provided the utilization review organization (1) adds to its formulary a generic or multisource brand name drug rated as therapeutically equivalent according to the FDA Orange Book, or a biologic drug rated as interchangeable according to the FDA Purple Book, at a lower cost to the enrollee, and (2) provides at least a 60-day notice to prescribers, pharmacists, and affected enrollees.",
	"repealed": false
}