{
	"id": "28A.0752",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.0752",
	"title": "28A.0752 DELEGATION OF POWERS AND DUTIES.",
	"text": "(a) Agreements to delegate licensing and inspection duties pertaining to retail food handlers shall include licensing, inspection, reporting, and enforcement duties authorized under sections 17.04, 29.21, 29.23, 29.235, 29.236, 29.237, 29.24, 29.25, 29.26, 29.27, and 30.49, appropriate sections of the Minnesota Food Law, chapters 31 and 34A, and applicable Minnesota food rules.\n(b) Agreements are subject to subdivision 3.\n(c) This subdivision does not affect agreements entered into under section 28A.075 or current cooperative agreements which base inspections and licensing responsibility on the firm's most predominant mode of business.\nAn agreement to delegate licensing and inspection of retail food handlers to a community health board must be approved by the commissioner and is subject to subdivision 3.\n(a) Agreements authorized under this section must be in writing and signed by the delegating authority and the designated agent.\n(b) The agreement must list criteria the delegating authority will use to determine if the designated agent's performance meets appropriate standards and is sufficient to replace performance by the delegating authority.\n(c) The agreement may specify minimum staff requirements and qualifications, set procedures for the assessment of costs, and provide for termination procedures if the delegating authority determines that the designated agent has failed to comply with the agreement.\n(d) The delegating authority and the designated agent are required to perform inspections utilizing the Minnesota Food Code's minimum and maximum standards.\n(e) A designated agent must not perform licensing, inspection, or enforcement duties under the agreement in territory outside its jurisdiction unless approved by the commissioner and governing body for that territory through a separate agreement.\n(f) The scope of agreements established under this section is limited to duties and responsibilities agreed upon by the parties. The agreement may provide for automatic renewal and for notice of intent to terminate by either party.\n(g) During the life of the agreement, the delegating authority shall not perform duties that the designated agent is required to perform under the agreement, except inspections necessary to determine compliance with the agreement and this section or as agreed to by the parties.\n(h) The delegating authority shall consult with, advise, and assist a designated agent in the performance of its duties under the agreement.\n(i) This section does not alter the responsibility of the delegating authority for the performance of duties specified by law and rule.",
	"repealed": false
}