{
	"id": "254B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.15",
	"title": "254B.15 SUBSTANCE USE DISORDER SYSTEM REFORM.",
	"text": "The commissioner shall design a reform of Minnesota's substance use disorder treatment system to ensure a full continuum of care is available for individuals with substance use disorders.\nThe reform proposal in subdivision 3 shall support the following goals:\n(1) improve and promote strategies to identify individuals with substance use issues and disorders;\n(2) ensure timely access to treatment and improve access to treatment;\n(3) enhance clinical practices and promote clinical guidelines and decision-making tools for serving people with substance use disorders;\n(4) build aftercare and recovery support services;\n(5) coordinate and consolidate funding streams, including local, state, and federal funds, to maximize efficiency;\n(6) increase the use of quality and outcome measures to inform benefit design and payment models; and\n(7) coordinate treatment of substance use disorder primary care, long-term care, and the mental health delivery system when appropriate.\n(a) A reform proposal shall include systemic and practice reforms to develop a robust continuum of care to effectively treat the physical, behavioral, and mental dimensions of substance use disorders. Elements of the reform proposal shall include, but are not limited to:\n(1) an assessment and access process that permits clients to present directly to a service provider for a substance use disorder assessment and authorization of services;\n(2) mechanisms for direct reimbursement of credentialed professionals;\n(3) care coordination models to link individuals with substance use disorders to appropriate providers;\n(4) peer support services to assist people with substance use disorders who are in recovery;\n(5) implementation of withdrawal management services pursuant to chapter 245F;\n(6) primary prevention services to delay the onset of substance use and avoid the development of addiction;\n(7) development of new services and supports that are responsive to the chronic nature of substance use disorders; and\n(8) exploration and implementation of available options to allow for exceptions to the federal Institution for Mental Diseases (IMD) exclusion for medically necessary, rehabilitative, substance use disorder treatment provided in the most integrated and least restrictive setting.\n(b) The commissioner shall develop a proposal consistent with the criteria outlined in paragraph (a) and seek all federal authority necessary to implement the proposal. The commissioner shall seek any federal waivers, state plan amendments, requests for new funding, realignment of existing funding, and other authority necessary to implement elements of the reform proposal outlined in this section.\n(c) Implementation is contingent upon legislative approval of the proposal under this subdivision.\nNo later than February 1, 2017, the commissioner shall present an update on the progress of the proposal to members of the legislative committees in the house of representatives and senate with jurisdiction over health and human services policy and finance on the progress of the proposal and shall make recommendations on any legislative changes and state appropriations necessary to implement the proposal.\nIn developing the proposal, the commissioner shall consult with consumers, providers, counties, tribes, health plans, and other stakeholders.",
	"repealed": false
}