{
	"id": "604.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.113",
	"title": "604.113 ISSUANCE OF WORTHLESS CHECK.",
	"text": "(a) The definitions provided in this subdivision apply to this section.\n(b) \"Check\" means a check, draft, order of withdrawal, or similar negotiable or nonnegotiable instrument.\n(c) \"Credit\" means an arrangement or understanding with the drawee for the payment of the check.\n(d) \"Dishonor\" has the meaning given in section 336.3-502, but does not include dishonor due to a stop payment order requested by an issuer who has a good faith defense to payment on the check. \"Dishonor\" does include a stop payment order requested by an issuer if the account did not have sufficient funds for payment of the check at the time of presentment, except for stop payment orders on a check found to be stolen.\n(e) \"Payee\" or \"holder\" includes an agent of the payee or holder.\nWhoever issues any check that is dishonored is liable for the following penalties:\n(a) A service charge, not to exceed $30, may be imposed immediately on any dishonored check by the payee or holder of the check, regardless of mailing a notice of dishonor, if notice of the service charge was conspicuously displayed on the premises when the check was issued. If a law enforcement agency obtains payment of a dishonored check on behalf of the payee or holder, up to the entire amount of the service charge may be retained by the law enforcement agency for its expenses. Only one service charge may be imposed under this paragraph for each dishonored check. The displayed notice must also include a provision notifying the issuer of the check that civil penalties may be imposed for nonpayment.\n(b) If the amount of the dishonored check is not paid within 30 days after the payee or holder has mailed notice of dishonor pursuant to section 609.535 and a description of the penalties contained in this subdivision, whoever issued the dishonored check is liable to the payee or holder of the check for:\n(1) the amount of the check, the service charge as provided in paragraph (a), plus a civil penalty of up to $100 or the value of the check, whichever is greater. In determining the amount of the penalty, the court shall consider the amount of the check and the reason for nonpayment. The civil penalty may not be imposed until 30 days following the mailing of the notice of dishonor. A payee or holder of the check may make a written demand for payment of the civil liability by sending a copy of this section and a description of the liability contained in this section to the issuer's last known address. Notice as provided in paragraph (a) must also include notification that additional civil penalties will be imposed for dishonored checks for nonpayment after 30 days;\n(2) interest at the rate payable on judgments pursuant to section 549.09 on the face amount of the check from the date of dishonor; and\n(3) reasonable attorney fees if the aggregate amount of dishonored checks issued by the issuer to all payees within a six-month period is over $1,250.\n(c) This subdivision prevails over any provision of law limiting, prohibiting, or otherwise regulating service charges authorized by this subdivision, but does not nullify charges for dishonored checks, which do not exceed the charges in paragraph (a) or terms or conditions for imposing the charges which have been agreed to by the parties in an express contract.\n(d) A sight draft may not be used as a means of collecting the civil penalties provided in this section without prior consent of the issuer.\n(e) The issuer of a dishonored check is not liable for the penalties described in paragraph (b) if a pretrial diversion program under section 628.69 has been established in the jurisdiction where the dishonored check was issued, the issuer was accepted into the program, and the issuer successfully completes the program.\nNotice of nonpayment or dishonor that includes a citation to this section and section 609.535, and a description of the penalties contained in these sections, shall be sent by the payee or holder of the check to the drawer by certified mail, return receipt requested, or by regular mail, supported by an affidavit of service by mailing, to the address printed or written on the check.\nThe issuance of a check with an address printed or written on it is a representation by the drawer that the address is the correct address for receipt of mail concerning the check. Failure of the drawer to receive a regular or certified mail notice sent to that address is not a defense to liability under this section, if the drawer has had actual notice for 30 days that the check has been dishonored.\nAn affidavit of service by mailing shall be retained by the payee or holder of the check.\nThe check is prima facie evidence of the identity of the issuer if the person receiving the check:\n(a) records the following information about the issuer on the check, unless it is printed on the face of the check:\n(1) name;\n(2) home or work address;\n(3) home or work telephone number; and\n(4) identification number issued pursuant to section 171.07;\n(b) compares the issuer's physical appearance, signature, and the personal information recorded on the check with the issuer's identification card issued pursuant to section 171.07; and\n(c) initials the check to indicate compliance with these requirements.\nAny defense otherwise available to the issuer also applies to liability under this section.",
	"repealed": false
}