{
	"id": "61B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.27",
	"title": "61B.27 PREVENTION OF INSOLVENCIES.",
	"text": "(a) To aid in the detection and prevention of member insurer insolvencies or impairments the commissioner shall notify the commissioners of insurance of all the other states, territories of the United States, and the District of Columbia when the commissioner takes one of the following actions against a member insurer:\n(i) revocation of license; or\n(ii) suspension of license.\nThe notice must be mailed to all commissioners within 30 days following the action.\n(b) If the commissioner deems it appropriate, the commissioner may:\n(1) Report to the board of directors when the commissioner has taken any of the actions specified in paragraph (a) or has received a report from another commissioner indicating that an action specified in paragraph (a) has been taken in another state. The report to the board of directors must contain all significant details of the action taken or the report received from another commissioner.\n(2) Report to the board of directors when the commissioner has reasonable cause to believe from an examination, whether completed or in process, of a member company that the company may be an impaired or insolvent insurer.\n(3) Furnish to the board of directors the National Association of Insurance Commissioners insurance regulatory information system ratios and listings of companies not included in the ratios developed by the National Association of Insurance Commissioners, and the board may use the information in carrying out its duties and responsibilities under this section. The report and the information contained in it must be kept confidential by the board of directors until it has been made public by the commissioner or other lawful authority. Nothing in this provision supersedes other requirements of law.\n(4) Notify the board if the commissioner makes a formal order requiring the member insurer to restrict its premium writing, obtain additional contributions to surplus, withdraw from this state, reinsure all or any part of its business, or increase capital, surplus, or any other account for the security of policyholders, contract holders, certificate holders, or creditors.\n(c) The commissioner may seek the advice and recommendations of the board of directors concerning any matter affecting the commissioner's duties and responsibilities regarding the financial condition of member insurers and of insurers or health maintenance organizations seeking admission to transact business in this state.\n(d) The board of directors may, upon majority vote, make reports and recommendations to the commissioner upon matters germane to the solvency, liquidation, rehabilitation, or conservation of any member insurer or germane to the solvency of an insurer or health maintenance organization seeking to do business in this state. Those reports and recommendations shall not be considered public documents.\n(e) The board of directors, upon majority vote, may notify the commissioner of information indicating that a member insurer may be an impaired or insolvent insurer.\n(f) The board of directors may, upon majority vote, make recommendations to the commissioner for the detection and prevention of member insurer insolvencies.\n(g) The board of directors may, at the conclusion of an insurer insolvency in which the association was obligated to pay covered claims, prepare a report to the commissioner containing the information it may have in its possession bearing on the history and causes of the insolvency. The board shall cooperate with the boards of directors of guaranty associations in other states in preparing a report on the history and causes of insolvency of a particular insurer or health maintenance organization, and may adopt by reference any report prepared by those other associations.\n(h) Nonperformance by the commissioner of any of the acts specified in this section or failure to meet the specified time limits does not affect the association, its members, or any other person as to the person's duties and obligations.\nNothing in this section supersedes other requirements of law.",
	"repealed": false
}