{
	"id": "514.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.03",
	"title": "514.03 EXTENT AND AMOUNT OF LIEN.",
	"text": "With respect to any contract or improvement as to which notice is not required by section 514.011, the lien shall be as follows:\n(a) If the contribution is made under a contract with the owner and for an agreed price, the lien as against the owner shall be for the sum agreed upon.\n(b) In all other cases, it shall be for the reasonable value of the work done, and of the skill, material, and machinery furnished.\nWith respect to any contract or improvement as to which notice is required by section 514.011, the lien shall be as follows:\n(a) If the contribution is made under a contract with the owner and for an agreed price, the lien as against the owner shall be for the sum agreed upon;\n(b) In all other cases, it shall be for the reasonable value of the work done, and of the skill, material, and machinery furnished. Provided, however:\n(c) The total sum of all liens, whether the contribution is made under a contract with the owner or otherwise, shall not exceed the total of said contract price plus the contract price or reasonable value of any additional contract or contracts between the owner and the contractor or additional work ordered by the owner, less the total of the following:\n(i) Payments made by the owner or the owner's agent to the contractor prior to receiving any notice prescribed by section 514.011, subdivision 2;\n(ii) Payments made by the owner or the owner's agent to discharge any lien claims as authorized by section 514.07; and\n(iii) Payments made by the owner or the owner's agent pursuant to presentation of valid lien waivers from persons or companies contributing to the improvement who have previously given the notice required by section 514.011, subdivision 2.\nThe lien shall extend to all the interest and title of the owner in and to the premises improved, not exceeding 80 acres, except in the case of homesteaded agricultural land as used in section 273.13, subdivision 23, where the lien shall be limited to 40 acres.",
	"repealed": false
}