{
	"id": "97C.835",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.835",
	"title": "97C.835 LAKE SUPERIOR COMMERCIAL FISHING.",
	"text": "(a) A license to fish commercially in Lake Superior shall be issued to a maximum of 25 residents. To qualify for licensing, a resident must have landed fish in the previous year with a value of at least $1,500, and must have engaged in commercial fishing for at least 30 days of the previous year. An applicant may be issued a license, at the discretion of the commissioner, if failure to meet the requirements for the dollar value of fish landed or number of days fished resulted from illness or other mitigating circumstances, or the applicant has reached the age of 65 and has been licensed at least five of the previous ten years.\n(b) A license may be issued to a resident who has not previously fished commercially on Lake Superior and has not been convicted of a game and fish law violation in the preceding three years, if the applicant:\n(1) shows a bill of sale indicating the purchase of gear and facilities connected with an existing license;\n(2) shows proof of inheritance of all the gear and facilities connected with an existing license; or\n(3) has served at least two years as an apprentice in a Minnesota Lake Superior licensed commercial fishing operation.\nLake trout, ciscoes, chubs, alewives, lake whitefish, round whitefish, pygmy whitefish, rainbow smelt, common carp, and native rough fish may be taken by licensed commercial fishing operators from Lake Superior, in accordance with this section.\nPound or trap nets may be used to take lake whitefish, round whitefish, pygmy whitefish, ciscoes, chubs, alewives, rainbow smelt, common carp, and native rough fish in Lake Superior, including St. Louis Bay east of the U.S. Highway 53 bridge, under the rules prescribed by the commissioner.\nGill nets for taking lake trout and lake whitefish may not be less than 4-1/2-inch extension measure mesh. The commissioner may prescribe rules to limit the total amount of gill net to be licensed for the taking of lake trout and lake whitefish and may limit the amount of net to be operated by each licensee.\nGill nets for taking ciscoes and chubs may not be less than 2-1/4-inch extension measure mesh and may not exceed 2-3/4-inch extension measure mesh except that smaller or larger mesh sizes may be used under a permit issued by the commissioner.\nThe amount of gill net licensed in Minnesota waters of Lake Superior may not exceed 300,000 feet of net weighted to fish in a floating or suspended position off the bottom and 300,000 feet of net weighted to fish on the bottom.\nA licensee may not operate more than 6,000 feet of gill net weighted to fish in a floating or suspended position off the bottom or 25,000 feet of gill net weighted to fish on the bottom. The commissioner may authorize gill net footage in excess of the individual limits when the commissioner determines that all of the gill net footage permitted for Minnesota waters of Lake Superior would not otherwise be allocated in a license year. The commissioner must allocate this excess gill net footage equitably among the licensees who have applied for it.\nThe commissioner may issue special permits to duly licensed commercial fishing operators for the purpose of taking lake trout, ciscoes, and lake whitefish in Lake Superior and adjacent waters under rules prescribed by the commissioner.",
	"repealed": false
}