{
	"id": "144E.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.50",
	"title": "144E.50 EMERGENCY MEDICAL SERVICES FUND.",
	"text": "This section is the \"Minnesota Emergency Medical Services System Support Act.\"\nIn order to develop, maintain, and improve regional emergency medical services systems, the director shall establish an emergency medical services system fund. The fund shall be used for the general purposes of promoting systematic, cost-effective delivery of emergency medical care throughout the state; identifying common local, regional, and state emergency medical system needs and providing assistance in addressing those needs; providing discretionary grants for emergency medical service projects with potential regionwide significance; providing for public education about emergency medical care; promoting the exchange of emergency medical care information; ensuring the ongoing coordination of regional emergency medical services systems; and establishing and maintaining training standards to ensure consistent quality of emergency medical services throughout the state.\nMS 2022 [Repealed, 2024 c 122 art 1 s 25; 2024 c 127 art 63 s 23]\n[See Note.]\nDesignated regional emergency medical services systems may use emergency medical services system funds to support local and regional emergency medical services as determined within the region, with particular emphasis given to supporting and improving emergency trauma and cardiac care and training. No part of a region's share of the fund may be used to directly subsidize any ambulance service operations or rescue service operations or to purchase any vehicles or parts of vehicles for an ambulance service or a rescue service.\nMoney from the fund shall be distributed according to this subdivision. Ninety-five percent of the fund shall be distributed annually on a contract for services basis with each of the eight regional emergency medical services systems designated by the director. The systems shall be governed by a body consisting of appointed representatives from each of the counties in that region and shall also include representatives from emergency medical services organizations. The director shall contract with a regional entity only if the contract proposal satisfactorily addresses proposed emergency medical services activities in the following areas: personnel training, transportation coordination, public safety agency cooperation, communications systems maintenance and development, public involvement, health care facilities involvement, and system management. If each of the regional emergency medical services systems submits a satisfactory contract proposal, then this part of the fund shall be distributed evenly among the regions. If one or more of the regions does not contract for the full amount of its even share or if its proposal is unsatisfactory, then the director may reallocate the unused funds to the remaining regions on a pro rata basis. Five percent of the fund shall be used by the director to support regionwide reporting systems and to provide other regional administration and technical assistance.\n(a) Each regional emergency medical services board designated by the director shall be audited either annually or biennially by an independent auditor who is either a state or local government auditor or a certified public accountant who meets the independence standards specified by the General Accounting Office for audits of governmental organizations, programs, activities, and functions. The audit shall cover all funds received by the regional board, including but not limited to, funds appropriated under this section, section 144E.52, and section 169.686, subdivision 3. Expenses associated with the audit are the responsibility of the regional board.\n(b) A biennial audit specified in paragraph (a) shall be performed following the close of the biennium. Copies of the audit and any accompanying materials shall be filed by October 1 of each odd-numbered year, beginning in 1999, with the director, the legislative auditor, and the state auditor.\n(c) An annual audit specified in paragraph (a) shall be performed following the close of the regional emergency medical services board's fiscal year. Copies of the audit and any accompanying materials shall be filed within 150 days following the close of the regional emergency medical services board's fiscal year, beginning in the year 2000, with the director, the legislative auditor, and the state auditor.\n(d) If the audit is not conducted as required in paragraph (a) or copies filed as required in paragraph (b) or (c), or if the audit determines that funds were not spent in accordance with this chapter, the director shall immediately reduce funding to the regional emergency medical services board as follows:\n(1) if an audit was not conducted or if an audit was conducted but copies were not provided as required, funding shall be reduced by up to 100 percent; and\n(2) if an audit was conducted and copies provided, and the audit identifies expenditures made that are not in compliance with this chapter, funding shall be reduced by the amount in question plus ten percent.\nA funding reduction under this paragraph is effective for the fiscal year in which the reduction is taken and the following fiscal year.\n(e) The director shall distribute any funds withheld from a regional board under paragraph (d) to the remaining regional boards on a pro rata basis.",
	"repealed": false
}