{
	"id": "16B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.26",
	"title": "16B.26 UTILITY COMPANIES, PERMITS TO CROSS STATE-OWNED LANDS.",
	"text": "(a) Authority. Except where the authority conferred by this section has been imposed on some other state or county office, the commissioner may grant an easement or permit over, under, or across any land owned by the state for public purposes, including but not limited to, access, road, street, mass transit, telecommunication, flood protection, or utility purposes. This authority does not apply to land under the jurisdiction of the commissioner of natural resources or land obtained for trunk highway purposes.\n(b) Notice of revocation. An easement or permit is revocable by written notice given by the commissioner if at any time its continuance will conflict with a public use of the land over, under, or upon which it is granted, or for any other reason. The notice must be in writing and is effective 90 days after the notice is sent by certified mail to the last known address of the record holder of the easement. If the address of the holder of the easement or permit is not known, it expires 90 days after the notice is recorded in the office of the county recorder of the county in which the land is located. Upon revocation of an easement, the commissioner may allow a reasonable time for the easement holder to vacate the premises affected. Notwithstanding the foregoing, the commissioner may grant to a state agency or political subdivision a permanent easement for the construction, operation, and maintenance of publicly owned infrastructure as described in paragraph (a), to have and to hold for as long as the easement area is used in accordance with the terms and conditions of the easement. If a permanent easement ceases to be used for the purposes stated in the easement or in accordance with its terms and conditions, the easement may be revoked by a written notice given by the commissioner in accordance with this paragraph.\n(c) Easement runs with land. State land subject to an easement or permit granted by the commissioner remains subject to sale or lease, and the sale or lease does not revoke the permit or easement granted.\nIf the easement or permit involves land under the jurisdiction of an agency other than the Department of Administration, it is subject to the approval of the head of the agency and is subject to revocation by the commissioner as provided in this section, on request of the head of the agency.\nAn application for easement or permit under this section must include: a legal description of the land affected; a map showing the area affected by the easement or permit; and a detailed design of any structures to be placed on the land. The commissioner may require that the application be in another form and include other descriptions, maps, or designs. The commissioner may at any time order changes or modifications respecting construction or maintenance of structures or other conditions of the easement which the commissioner finds necessary to protect the public health and safety.\nThe easement or permit must be in a form prescribed by the attorney general and must describe the location of the easement granted. The easement or permit continues until revoked by the commissioner, subject to change or modification as provided in this section.\nThe commissioner may prescribe consideration and conditions for granting an easement or permit. Money received by the state under this section must be credited to the fund to which income or proceeds of sale from the land would be credited, if provision for the sale is made by law. Otherwise, it must be credited to the general fund.",
	"repealed": false
}