{
	"id": "205.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.13",
	"title": "205.13 CANDIDATES, FILING.",
	"text": "An individual who is eligible and desires to become a candidate for an office to be voted for at the municipal general election shall file an affidavit of candidacy with the municipal clerk. Candidates for a special election to fill a vacancy held as provided in section 412.02, subdivision 2a, must file an affidavit of candidacy for the specific office to fill the unexpired portion of the term. Subject to the approval of the county auditor, the town clerk may authorize candidates for township offices to file affidavits of candidacy with the county auditor. The affidavit shall be in the same form as that in section 204B.06. The municipal clerk shall also accept an application signed by not less than five voters and filed on behalf of an eligible voter in the municipality whom they desire to be a candidate, if service of a copy of the application has been made on the candidate and proof of service is endorsed on the application being filed. Upon receipt of the proper filing fee, the clerk shall place the name of the candidate on the official ballot without partisan designation.\nIn a city nominating candidates at a primary, an affidavit of candidacy for a city office voted on in November must be filed no more than 84 days nor less than 70 days before the city primary. In municipalities that do not hold a primary, an affidavit of candidacy must be filed no more than 70 days and not less than 56 days before the municipal general election held in March in any year, or a special election not held in conjunction with another election, and no more than 98 days nor less than 84 days before the municipal general election held in November of any year. The municipal clerk's office must be open for filing from 1:00 p.m. to 5:00 p.m. on the last day of the filing period.\nA candidate for municipal office who will be absent from the state during the filing period may submit a properly executed affidavit of candidacy, the appropriate filing fee, and any necessary petitions in person to the filing officer. The candidate shall state in writing the reason for being unable to submit the affidavit during the filing period. The affidavit, filing fee, and petitions must be submitted to the filing officer during the seven days immediately preceding the candidate's absence from the state. In cities of the first class, and in any city where the use of nominating petitions is permitted under the city's charter, a nominating petition for a candidate who will be absent from the state during the filing period may be signed during the 14 days immediately preceding the date when the affidavit of candidacy is filed.\nAt least two weeks before the first day to file affidavits of candidacy, the municipal clerk shall publish a notice stating the first and last dates on which affidavits of candidacy may be filed in the clerk's office and the closing time for filing on the last day for filing. The clerk shall post a similar notice at least ten days before the first day to file affidavits of candidacy. The notice must separately list any office for which affidavits of candidacy may be filed to fill the unexpired portion of a term when a special election is being held to fill a vacancy as provided in section 412.02, subdivision 2a.\n(a) Except as otherwise provided in this section, the filing fee for a municipal office is as follows:\n(1) in first class cities, $20;\n(2) in second and third class cities, $5; and\n(3) in fourth class cities and towns, $2.\n(b) A home rule charter or statutory city may adopt, by ordinance, a filing fee of a different amount not to exceed the following:\n(1) in first class cities, $80;\n(2) in second and third class cities, $40; and\n(3) in fourth class cities, $15.\n(c) A home rule charter city that sets filing fees by authority provided in city charter is not subject to the fee limits in this section.\nA candidate for municipal office may file a petition in place of the filing fees specified in subdivision 3. The petition shall meet the requirements of section 204B.11, subdivision 2.\nA nominating petition filed on behalf of a candidate for municipal office in a city of the first class shall be signed by eligible voters who maintain residence in the election district from which the candidate is to be elected. The number of signers shall be at least 500, or two percent of the total number of individuals who voted in the municipality, ward, or other election district at the last preceding municipal general election, whichever is greater.\nA candidate for a municipal elective office may withdraw from the election by filing an affidavit of withdrawal with the municipal clerk no later than 5:00 p.m. two days after the last day for filing affidavits of candidacy. Thereafter, no candidate may file an affidavit of withdrawal.",
	"repealed": false
}