{
	"id": "270C.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.21",
	"title": "270C.21 TAXPAYER ASSISTANCE GRANTS; TAX CREDIT OUTREACH GRANTS.",
	"text": "When the commissioner awards grants under this section, the commissioner must provide public notice of the grants in a timely manner so that the grant process is completed and grants are awarded by October 1, in order for recipient organizations to adequately plan expenditures for the filing season. At the time the commissioner provides public notice, the commissioner must also notify organizations that received grants in the previous biennium. Amounts appropriated for grants under this section are not subject to retention of administrative costs under section 16B.98, subdivision 14.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Eligible credit\" means a credit, refund, or other tax preference targeting low-income taxpayers, including but not limited to the credits under sections 290.0661, 290.0671, 290.0674, and 290.0693, and chapter 290A.\n(c) \"Tax outreach organization\" means a nonprofit organization or federally recognized Indian Tribe with experience serving demographic groups or geographic regions that have historically had low rates of participation in eligible credits.\n(d) \"Taxpayer assistance services\" means accounting and tax preparation services provided by volunteers to low-income, elderly, and disadvantaged Minnesota residents to help them file federal and state income tax returns and Minnesota property tax refund claims and to provide personal representation before the Department of Revenue and Internal Revenue Service.\n(e) \"Volunteer taxpayer assistance organization\" means an eligible organization qualifying under section 7526A(e)(2)(B) of the Internal Revenue Code of 1986.\nThe commissioner must make grants to one or more volunteer taxpayer assistance organizations to coordinate, facilitate, encourage, and aid in the provision of taxpayer assistance services.\nThe commissioner must make one or more grants to tax outreach organizations and volunteer assistance organizations. Grants provided under this subdivision must be used to:\n(1) publicize and promote the availability of eligible credits to taxpayers likely to be eligible for those credits; or\n(2) provide taxpayer assistance services.",
	"repealed": false
}