{
	"id": "116.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.76",
	"title": "116.76 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 116.76 to 116.83.\n\"Agency\" means the Pollution Control Agency.\n\"Blood\" means waste human blood and blood products in containers, or solid waste saturated and dripping human blood or blood products. Human blood products include serum, plasma, and other blood components.\n\"Commercial transporter\" means a person, other than the United States government, who transports infectious or pathological waste for compensation.\n\"Commissioner\" means the commissioner of the Pollution Control Agency.\n\"Decontamination\" means rendering infectious waste safe for routine handling as a solid waste.\n[Repealed, 1Sp1993 c 1 art 9 s 75]\n\"Facility\" means a site where infectious waste is generated, stored, decontaminated, incinerated, or disposed.\n\"Generator\" means a person whose activities produce infectious waste. \"Generator\" does not include a person who produces sharps as a result of administering medication to oneself. \"Generator\" does not include an ambulance service licensed under section 144E.10, an eligible community health board, or public health nursing agency as defined in section 116.78, subdivision 10, or a program providing school health service under section 121A.21.\n\"Household\" means a single detached dwelling unit or a single unit of a multiple dwelling.\n\"Infectious agent\" means an organism that is capable of producing infection or infectious disease in humans.\n\"Infectious waste\" means laboratory waste, blood, regulated body fluids, sharps, and research animal waste that have not been decontaminated.\n\"Laboratory waste\" means waste cultures and stocks of agents that are generated from a laboratory and are infectious to humans; discarded contaminated items used to inoculate, transfer, or otherwise manipulate cultures or stocks of agents that are infectious to humans; wastes from the production of biological agents that are infectious to humans; and discarded live or attenuated vaccines that are infectious to humans.\n\"Pathological waste\" means human tissues and body parts removed accidentally or during surgery or autopsy intended for disposal.\n\"Person\" means an individual, partnership, association, public or private corporation, or other legal entity, the United States government, an interstate body, the state, and an agency, department, or political subdivision of the state.\n\"Regulated human body fluids\" means cerebrospinal fluid, synovial fluid, pleural fluid, peritoneal fluid, pericardial fluid, and amniotic fluid that are in containers or that drip freely from body fluid soaked solid waste items.\n\"Research animal waste\" means carcasses, body parts, and blood derived from animals knowingly and intentionally exposed to agents that are infectious to humans for the purpose of research, production of biologicals, or testing of pharmaceuticals.\n\"Sharps\" means:\n(1) discarded items that can induce subdermal inoculation of infectious agents, including needles, lancets, scalpel blades, pipettes, and other items derived from human or animal patient care, blood banks, laboratories, mortuaries, research facilities, and industrial operations; and\n(2) discarded glass or rigid plastic vials containing infectious agents.",
	"repealed": false
}