{
	"id": "181.960",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.960",
	"title": "181.960 DEFINITIONS.",
	"text": "For purposes of sections 181.960 to 181.966 and unless otherwise provided, the following terms have the meanings given in this section.\n\"Employee\" means a person who performs services for hire for an employer, provided that the services have been performed predominately within this state. The term includes any person who has been separated from employment for less than one year. The term does not include an independent contractor.\n\"Employer\" means a person who has one or more employees. Employer does not include a state agency, statewide system, political subdivision, or advisory board or commission that is subject to chapter 13.\n\"Personnel record,\" to the extent maintained by an employer, means: any application for employment; wage or salary history; notices of commendation, warning, discipline, or termination; authorization for a deduction or withholding of pay; fringe benefit information; leave records; and employment history with the employer, including salary and compensation history, job titles, dates of promotions, transfers, and other changes, attendance records, performance evaluations, and retirement record. The term does not include:\n(1) written references respecting the employee, including letters of reference supplied to an employer by another person;\n(2) information relating to the investigation of a violation of a criminal or civil statute by an employee or an investigation of employee conduct for which the employer may be liable, unless and until:\n(i) the investigation is completed and, in cases of an alleged criminal violation, the employer has received notice from the prosecutor that no action will be taken or all criminal proceedings and appeals have been exhausted; and\n(ii) the employer takes adverse personnel action based on the information contained in the investigation records;\n(3) education records, pursuant to section 513(a) of title 5 of the Family Educational Rights and Privacy Act of 1974, United States Code, title 20, section 1232g, that are maintained by an educational institution and directly related to a student;\n(4) results of employer testing, except that the employee may see a cumulative total test score for a section of the test or for the entire test;\n(5) information relating to the employer's salary system and staff planning, including comments, judgments, recommendations, or ratings concerning expansion, downsizing, reorganization, job restructuring, future compensation plans, promotion plans, and job assignments;\n(6) written comments or data of a personal nature about a person other than the employee, if disclosure of the information would constitute an intrusion upon the other person's privacy;\n(7) written comments or data kept by the employee's supervisor or an executive, administrative, or professional employee, provided the written comments or data are kept in the sole possession of the author of the record;\n(8) privileged information or information that is not discoverable in a workers' compensation, grievance arbitration, administrative, judicial, or quasi-judicial proceeding;\n(9) any portion of a written or transcribed statement by a coworker of the employee that concerns the job performance or job-related misconduct of the employee that discloses the identity of the coworker by name, inference, or otherwise; and\n(10) medical reports and records, including reports and records that are available to the employee from a health care services provider pursuant to sections 144.291 to 144.298.",
	"repealed": false
}