{
	"id": "256B.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.37",
	"title": "256B.37 PRIVATE INSURANCE POLICIES, CAUSES OF ACTION.",
	"text": "Upon furnishing medical assistance or alternative care services under section 256B.0913 to any person who has private accident or health care coverage, or receives or has a right to receive health or medical care from any type of organization or entity, or has a cause of action arising out of an occurrence that necessitated the payment of medical assistance, the state agency or the state agency's agent shall be subrogated, to the extent of the cost of medical care furnished, to any rights the person may have under the terms of the coverage, or against the organization or entity providing or liable to provide health or medical care, or under the cause of action.\nThe right of subrogation created in this section includes all portions of the cause of action, notwithstanding any settlement allocation or apportionment that purports to dispose of portions of the cause of action not subject to subrogation.\n[See Note.]\nTo recover under this section, the attorney general may institute or join a civil action to enforce the subrogation rights of the commissioner established under this section.\nAny prepaid health plan providing services under sections 256B.69 and 256L.12 and Minnesota Statutes 2009 Supplement, section 256D.03, subdivision 4, paragraph (c); children's mental health collaboratives under section 245.493; demonstration projects for persons with disabilities under section 256B.77; nursing homes under the alternative payment demonstration project under section 256B.434; or the county-based purchasing entity providing services under section 256B.692 may retain legal representation to enforce the subrogation rights created under this section or, if no action has been brought, may initiate and prosecute an independent action on their behalf against a person, firm, or corporation that may be liable to the person to whom the care or payment was furnished.\nThe state agency must be given notice of monetary claims against a person, firm, or corporation that may be liable in damages, or otherwise obligated to pay part or all of the cost of medical care when the state agency has paid or become liable for the cost of care. Notice must be given as follows:\n(a) Applicants for medical assistance shall notify the state or local agency of any possible claims when they submit the application. Recipients of medical assistance shall notify the state or local agency of any possible claims when those claims arise.\n(b) A person providing medical care services to a recipient of medical assistance shall notify the state agency when the person has reason to believe that a third party may be liable for payment of the cost of medical care.\n(c) A person who is party to a claim upon which the state agency may be entitled to subrogation under this section shall notify the state agency of its potential subrogation claim before filing a claim, commencing an action, or negotiating a settlement. A person who is a party to a claim includes the plaintiff, the defendants, and any other party to the cause of action.\nNotice given to the local agency is not sufficient to meet the requirements of paragraphs (b) and (c).\nUpon any judgment, award, or settlement of a cause of action, or any part of it, upon which the state agency has a subrogation right, including compensation for liquidated, unliquidated, or other damages, reasonable costs of collection, including attorney fees, must be deducted first. The full amount of medical assistance paid to or on behalf of the person as a result of the injury must be deducted next and paid to the state agency. The rest must be paid to the medical assistance recipient or other plaintiff. The plaintiff, however, must receive at least one-third of the net recovery after attorney fees and collection costs.\nPrivate accident and health care coverage including Medicare for medical services is primary coverage and must be exhausted before medical assistance or alternative care services are paid for medical services including home health care, personal care assistance services, hospice, supplies and equipment, or services covered under a Centers for Medicare and Medicaid Services waiver. When a person who is otherwise eligible for medical assistance has private accident or health care coverage, including Medicare or a prepaid health plan, the private health care benefits available to the person must be used first and to the fullest extent.\nMedical assistance payment will not be made when either covered charges are paid in full by a third party or the provider has an agreement to accept payment for less than charges as payment in full. Payment for patients that are simultaneously covered by medical assistance and a liable third party other than Medicare will be determined as the lesser of clauses (1) to (3):\n(1) the patient liability according to the provider/insurer agreement;\n(2) covered charges minus the third-party payment amount; or\n(3) the medical assistance rate minus the third-party payment amount.\nA negative difference will not be implemented.\nAll providers must reduce their submitted charge to medical assistance programs to reflect all discount amounts applied to the charge by any provider/insurer agreement or contract. The net submitted charge may not be greater than the patient liability for the service.\nWhen a parent or a person with an obligation of support has enrolled in a prepaid health care plan under section 518A.41, subdivision 1, the commissioner of human services shall limit the recipient of medical assistance to the benefits payable under that prepaid health care plan to the extent that services available under medical assistance are also available under the prepaid health care plan.",
	"repealed": false
}