{
	"id": "16C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.10",
	"title": "16C.10 EXCEPTIONS AUTHORIZED.",
	"text": "The solicitation process described in this chapter is not required when there is clearly and legitimately only a single source for the goods and services and the commissioner determines that the price has been fairly and reasonably established.\nThe solicitation process described in this chapter and chapter 16B is not required in emergencies. In emergencies, the commissioner may make or authorize any purchases necessary for the design, construction, repair, rehabilitation, and improvement of a publicly owned structure or may make or authorize an agency to do so and may purchase, or may authorize an agency to purchase, any goods, services, or utility services directly for immediate use. This provision applies to projects conducted by Minnesota State Colleges and Universities.\nNotwithstanding anything in this chapter to the contrary, the commissioner may, instead of soliciting bids, contract for purchases with suppliers who have published schedules of prices effective for sales to any federal agency of the United States. These contracts may be entered into, regardless of the amount of the purchase price, if the commissioner considers them advantageous and if the purchase price of all the commodities purchased under the contract do not exceed the price specified by the schedule.\nThe solicitation process described in this chapter is not required for cooperative agreements. The commissioner may enter into contracts or accept prices effective for sales to any governmental unit as defined in section 471.59, through a cooperative agreement as defined in section 471.59.\nThe solicitation process described in this chapter is not required for acquisition of the following:\n(1) merchandise for resale purchased under policies determined by the commissioner;\n(2) farm and garden products which, as determined by the commissioner, may be purchased at the prevailing market price on the date of sale;\n(3) goods and services from the Minnesota correctional facilities;\n(4) goods and services from rehabilitation facilities and extended employment providers that are certified by the commissioner of employment and economic development, and day services licensed under chapter 245D;\n(5) goods and services for use by a community-based facility operated by the Direct Care and Treatment executive board;\n(6) goods purchased at auction or when submitting a sealed bid at auction provided that before authorizing such an action, the commissioner consult with the requesting agency to determine a fair and reasonable value for the goods considering factors including, but not limited to, costs associated with submitting a bid, travel, transportation, and storage. This fair and reasonable value must represent the limit of the state's bid;\n(7) utility services where no competition exists or where rates are fixed by law or ordinance;\n(8) goods and services from Minnesota Sex Offender Program facilities; and\n(9) contracts of the Department of Employment and Economic Development distributing state and federal funds for the purpose of subcontracting the provision of program services to eligible recipients. For these contracts, the commissioner of employment and economic development is authorized to directly enter into agency contracts and encumber available funds. For contracts distributing state or federal funds pursuant to the federal Workforce Investment Act, United States Code, title 29, section 2911 et seq., the commissioner of employment and economic development in consultation with the Job Skills Partnership Board is authorized to directly enter into agency contracts and encumber available funds to ensure a rapid response to the needs of dislocated workers. The commissioner of employment and economic development shall adopt internal procedures to administer and monitor funds distributed under these contracts. This exception also applies to any contracts entered into by the commissioner of education that were previously entered into by the commissioner of employment and economic development.\nA competitive solicitation process described in this chapter is not required for the acquisition of goods, services, construction, and utilities in an amount of $5,000 or less or as authorized by section 16C.16, subdivisions 6, paragraph (b), 6a, paragraph (b), and 7, paragraph (b).\n(a) For the purpose of this subdivision, \"reverse auction\" means a purchasing process in which vendors compete to provide goods or services at the lowest selling price in an open and interactive environment. Reverse auctions may not be utilized to procure engineering design services or architectural services or to establish building and construction contracts under sections 16C.26 to 16C.29.\n(b) The provisions of sections 13.591, subdivision 3, and 16C.06, subdivision 2, do not apply when the commissioner determines that a reverse auction is the appropriate purchasing process.",
	"repealed": false
}