{
	"id": "504B.182",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.182",
	"title": "504B.182 INITIAL AND FINAL INSPECTION REQUIRED.",
	"text": "(a) At the commencement of a residential tenancy, or within 14 days of a residential tenant occupying a unit, the landlord must notify the tenant of their option to request an initial inspection of the residential unit for the purposes of identifying existing deficiencies in the rental unit to avoid deductions for the security deposit of the tenant at a future date. If the tenant requests an inspection, the landlord and tenant shall schedule the inspection at a mutually acceptable date and time.\n(b) In lieu of an initial inspection or move-out inspection under subdivision 2, when a tenant agrees, a landlord may provide written acknowledgment to the tenant of photos or videos of a rental unit and agree to the condition of the rental unit at the start or end of the tenancy.\nWithin a reasonable time after notification of either a landlord or residential tenant's intention to terminate the tenancy, or before the end of the lease term, the landlord shall notify the tenant in writing of the tenant's option to request a move-out inspection and of the tenant's right to be present at the inspection. At a reasonable time, but no earlier than five days before the termination or the end of the lease date, or day the tenant plans to vacate the unit, the landlord, or an agent of the landlord, shall, upon the request of the tenant, make a move-out inspection of the premises. The purpose of the move-out inspection shall be to allow the tenant an opportunity to remedy identified deficiencies, in a manner consistent with the rights and obligations of the parties under the rental agreement, in order to avoid deductions from the security deposit. If a tenant chooses not to request a move-out inspection, the duties of the landlord under this subdivision are discharged. If an inspection is requested, the parties shall attempt to schedule the inspection at a mutually acceptable date and time.\nNothing in this section changes the requirements or obligations under any other section of law, including but not limited to sections 504B.178, 504B.185, 504B.195, or 504B.271, 504B.375, and 504B.381.\nExcept as allowed under subdivisions 1 and 2, when a tenant chooses not to request an initial or move-out inspection, or alternate inspection under subdivision 1, paragraph (b), any provision, whether oral or written, of any lease or other agreement, whereby any provision of this section is waived by a tenant, is contrary to public policy and void.",
	"repealed": false
}