{
	"id": "62J.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.54",
	"title": "62J.54 IDENTIFICATION AND IMPLEMENTATION OF UNIQUE IDENTIFIERS.",
	"text": "(a) All group purchasers and any health care provider organization that meets the definition of a health care provider under United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder shall use a national provider identifier to identify health care provider organizations in Minnesota, according to this section.\n(b) The national provider identifier for health care providers as adopted and required in Code of Federal Regulations, title 45, part 162, subpart D, and any future modifications to the subpart shall be used as the unique identification number for health care provider organizations in Minnesota under this section.\n(c) All health care provider organizations in Minnesota that are eligible to obtain a national provider identifier according to United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder shall obtain a national provider identifier using the process prescribed in Code of Federal Regulations, title 45, part 162, subpart D, and any future modifications to the subpart.\n(d) Only the national provider identifier shall be used to identify health care provider organizations when submitting and receiving paper and electronic claims and remittance advice notices, and in conjunction with other data collection and reporting functions.\n(e) Health care provider organizations in Minnesota shall make available their national provider identifier to other health care providers when required to be included in the administrative transactions regulated by United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder.\n(f) The commissioner of health may contract with the federal Secretary of Health and Human Services or the Secretary's agent to implement this subdivision.\n(a) All group purchasers in Minnesota and any individual health care provider that meets the definition of a health care provider under United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder shall use the national provider identifier to identify an individual health care provider in Minnesota, according to this section.\n(b) The national provider identifier for health care providers adopted in Code of Federal Regulations, title 45, part 162, subpart D, and any future modifications to the subpart shall be used as the unique identification number for individual health care providers.\n(c) All individual health care providers in Minnesota that are eligible to obtain a national provider identifier according to United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder shall obtain a national provider identifier using the process prescribed in Code of Federal Regulations, title 45, part 162, subpart D, and any future modifications to the subpart.\n(d) Only the national provider identifier shall be used to identify individual health care providers when submitting and receiving paper and electronic claims and remittance advice notices, and in conjunction with other data collection and reporting functions.\n(e) Individual health care providers in Minnesota shall make available their national provider identifier to other health care providers when required to be included in the administrative transactions regulated by United States Code, title 42, sections 1320d to 1320d-8, as amended, and regulations adopted thereunder.\n(f) The commissioner of health may contract with the federal Secretary of Health and Human Services or the Secretary's agent to implement this subdivision.\n(a) All group purchasers and health care providers in Minnesota shall use a unique identification number to identify group purchasers.\n(b) The unique health identifier for group purchasers that are health plans under Code of Federal Regulations, title 45, part 160, subpart A, shall be the Standard Unique Health Identifier for Health Plans as adopted in Code of Federal Regulations, title 45, part 162, subpart E, and any future modifications to the subpart, effective as required by the subpart.\n(c) Group purchasers that are health plans under Code of Federal Regulations, title 45, part 160, subpart A, shall obtain a unique health identifier using the process prescribed in Code of Federal Regulations, title 45, part 162, subpart E, and any future modifications to the subpart.\n(d) The unique group purchaser identifier, as described in this section, shall be used for purposes of submitting and receiving claims, and in conjunction with other data collection and reporting functions.\n(e) The commissioner of health may contract with the federal Secretary of Health and Human Services or the Secretary's agent to implement this subdivision.\n(a) Not later than 24 months after the date on which a unique health identifier for individuals is adopted or established under United States Code, title 42, sections 1320d to 1320d-8 (1996 and subsequent amendments), all group purchasers and health care providers in Minnesota shall use a unique identification number to identify each patient who receives health care services in Minnesota, except as provided in paragraph (b).\n(b) Small health plans, as defined by the federal Secretary of Health and Human Services under United States Code, title 42, section 1320d-4 (1996 and subsequent amendments), shall use a unique identification number to identify each patient who receives health care services in Minnesota no later than 36 months after the date on which a unique health identifier for individuals is adopted or established under United States Code, title 42, sections 1320d to 1320d-8 (1996 and subsequent amendments).\n(c) The unique health identifier for individuals adopted or established by the federal Secretary of Health and Human Services under United States Code, title 42, sections 1320d to 1320d-8 (1996 and subsequent amendments), shall be used as the unique patient identification number, except as provided in paragraphs (e) and (f).\n(d) The unique patient identification number shall be used by group purchasers and health care providers for purposes of submitting and receiving claims, and in conjunction with other data collection and reporting functions.\n(e) Within the limits of available appropriations, the commissioner shall develop a proposal for an alternate numbering system for patients who do not have or refuse to provide their Social Security numbers, if:\n(1) a unique health identifier for individuals is adopted or established under United States Code, title 42, sections 1320d to 1320d-8 (1996 and subsequent amendments);\n(2) the unique health identifier is the Social Security number of the patient;\n(3) there is no federal alternate numbering system for patients who do not have or refuse to provide their Social Security numbers; and\n(4) federal law or the federal Secretary of Health and Human Services explicitly allows a state to develop an alternate numbering system for patients who do not have or refuse to provide their Social Security numbers.\n(f) If an alternate numbering system is developed under paragraph (e), patients who use numbers issued by the alternate numbering system are not required to provide their Social Security numbers and group purchasers or providers may not demand the Social Security numbers of patients who provide numbers issued by the alternate numbering system. If an alternate numbering system is developed under paragraph (e), group purchasers and health care providers shall establish procedures to notify patients that they can elect not to have their Social Security number used as the unique patient identifier.\n(g) The commissioner of health may contract with the federal Secretary of Health and Human Services or the Secretary's agent to implement this subdivision.",
	"repealed": false
}