{
	"id": "103G.625",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.625",
	"title": "103G.625 MUNICIPAL CONTROL OF AQUATIC VEGETATION AND ORGANISMS.",
	"text": "The governing body of a municipality or town may expend funds for the control or destruction of harmful or undesirable aquatic vegetation or organisms in public waters and may cooperate with other governing bodies and landowners in the control or destruction.\nThe control or destruction of the aquatic vegetation or organisms may not be started unless a permit has been obtained from the commissioner under section 103G.615 and the work is done in accordance with the terms and conditions of the permit.\n(a) The governing body of a municipality or town may use any available funds and may levy a tax on all taxable property in the municipality or town to implement this section.\n(b) To provide funds in advance of collection of the tax levies, the governing body may, at any time after the tax has been levied and certified to the county auditor for collection, issue certificates of indebtedness in anticipation of the collection and payment of the tax. The total amount of the certificates, including principal and interest, may not exceed 90 percent of the amount of the levy and must become payable from the proceeds of the levy not later than two years from the date of issuance. The certificates shall be issued on terms and conditions as the governing body may determine and sold as provided in section 475.60.\n(c) If the governing body determines that an emergency exists, it may make appropriations from the proceeds of the certificates for authorized purposes without complying with statutory or charter provisions requiring that expenditures be based on a prior budget authorization or other budgeting requirement.\n(d) The proceeds of a tax levied or an issue of certificates of indebtedness must be deposited in a separate fund and expended only for purposes authorized by this section. If a disbursement is not made from the fund for a period of five years, money remaining in the fund may be transferred to the general fund.",
	"repealed": false
}