{
	"id": "349A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/349A.06",
	"title": "349A.06 LOTTERY RETAILERS.",
	"text": "The director shall sell tickets for the lottery through lottery retailers with whom the director contracts. Contracts under this section are not subject to the provisions of sections 16C.03, 16C.05, 16C.06, 16C.08, 16C.09, and 16C.10, and are valid for a period of one year. The director may permit a retailer to sell tickets at more than one business location under a contract entered into under this section.\nThe Metropolitan Airports Commission shall permit the sale of lottery tickets at the Minneapolis-St. Paul International Airport in at least each concourse of the Lindbergh terminal, or at other locations mutually agreed to by the director and the commission. The director shall issue a contract to a nonprofit organization to operate an independent kiosk to sell lottery tickets at the airport.\n(a) The director may not contract with a retailer who:\n(1) is under the age of 18;\n(2) is in business solely as a seller of lottery tickets;\n(3) owes $500 or more in delinquent taxes as defined in section 270C.72;\n(4) has been convicted within the previous five years of a felony or gross misdemeanor, any crime involving fraud or misrepresentation, or a gambling-related offense;\n(5) is a member of the immediate family, residing in the same household, as the director or any employee of the lottery;\n(6) in the director's judgment does not have the financial stability or responsibility to act as a lottery retailer, or whose contracting as a lottery retailer would adversely affect the public health, welfare, and safety, or endanger the security and integrity of the lottery; or\n(7) is a currency exchange, as defined in section 53A.01.\nA contract entered into before August 1, 1990, which violates clause (7) may continue in effect until its expiration but may not be renewed.\n(b) An organization, firm, partnership, or corporation that has a stockholder who owns more than five percent of the business or the stock of the corporation, an officer, or director, that does not meet the requirements of paragraph (a), clause (4), is not eligible to be a lottery retailer under this section.\n(c) The restrictions under paragraph (a), clause (4), do not apply to an organization, partnership, or corporation if the director determines that the organization, partnership, or firm has terminated its relationship with the individual whose actions directly contributed to the disqualification under this subdivision.\nThe director may require that a lottery retailer post a bond, securities, or an irrevocable letter of credit, in an amount as the director deems necessary, to protect the financial interests of the state. If securities are deposited or an irrevocable letter of credit filed, the securities or letter of credit must be of a type or in the form provided under section 349A.07, subdivision 5, paragraphs (b) and (c).\nThe director may request the director of alcohol and gambling enforcement to investigate all applicants for lottery retailer contracts to determine their compliance with the requirements of subdivision 2. The director may issue a temporary contract, valid for not more than 90 days, to an applicant pending the completion of the investigation or a final determination of qualifications under this section. The director has access to all criminal history data compiled by the director of alcohol and gambling enforcement on (1) any person holding or applying for a retailer contract, (2) any person holding a lottery vendor contract or who has submitted a bid on such a contract, and (3) any person applying for employment with the lottery.\n(a) A lottery retailer may sell lottery tickets only on the premises described in the contract.\n(b) A lottery retailer must prominently display a certificate issued by the director on the premises where lottery tickets will be sold.\n(c) A lottery retailer must keep a complete set of books of account, correspondence, and all other records necessary to show fully the retailer's lottery transactions, and make them available for inspection by employees of the lottery at all times during business hours. The director may require a lottery retailer to furnish information as the director deems necessary to carry out the purposes of this chapter, and may require an audit to be made of the books of account and records. The director may select an auditor to perform the audit and may require the retailer to pay the cost of the audit. The auditor has the same right of access to the books of account, correspondence, and other records as is given to employees of the lottery.\n(d) A contract issued under this section may not be transferred or assigned.\n(e) The director shall require that lottery tickets may be sold by retailers only for cash.\n(f) A lottery retailer must prominently post at the point of sale of lottery tickets, in a manner approved by the commissioner of human services, the toll-free telephone number established by the commissioner of human services in connection with the compulsive gambling program established under section 245.98.\nThe director may by rule provide for:\n(1) amounts which a lottery retailer may retain from gross receipts from the sale of lottery tickets in order to pay prizes to holders of winning tickets; and\n(2) amounts which a lottery retailer may retain from gross receipts from the sale of lottery tickets as a commission.\nIf a lottery retailer's rental payments for the business premises are contractually computed, in whole or in part, on the basis of a percentage of retail sales, and the computation of retail sales is not explicitly defined to include the sale of lottery tickets, the compensation retained by the sales agent for the sale of lottery tickets shall be considered the amount of the retail sale for purposes of computing the rental payments.\nAll proceeds from the sale of lottery tickets received by a lottery retailer constitute a trust fund until paid to the director. The lottery retailer is personally liable for all proceeds.\nThe director may charge a nonrefundable application fee to a person applying for a lottery retailer contract, in an amount sufficient to cover the costs of making the investigation required under subdivision 4. The fee collected under this subdivision must be deposited in the lottery fund.\nNo political subdivision may require a local license to operate as a lottery retailer or impose a tax or fee on the business of operating as a lottery retailer.\n(a) The director shall cancel the contract of any lottery retailer or prohibit a lottery retailer from selling lottery tickets at a business location who:\n(1) has been convicted of a felony or gross misdemeanor;\n(2) has committed fraud, misrepresentation, or deceit;\n(3) has provided false or misleading information to the lottery; or\n(4) has acted in a manner prejudicial to public confidence in the integrity of the lottery.\n(b) The director may cancel, suspend, or refuse to renew the contract of any lottery retailer or prohibit a lottery retailer from selling lottery tickets at a business location who:\n(1) changes business location;\n(2) fails to account for lottery tickets received or the proceeds from tickets sold;\n(3) fails to remit funds to the director in accordance with the director's rules;\n(4) violates a law or a rule or order of the director;\n(5) fails to comply with any of the terms in the lottery retailer's contract;\n(6) fails to file a bond, securities, or a letter of credit as required under subdivision 3;\n(7) in the opinion of the director fails to maintain a sufficient sales volume to justify continuation as a lottery retailer; or\n(8) has violated section 340A.503, subdivision 2, clause (1), two or more times within a two-year period.\n(c) The director may also cancel, suspend, or refuse to renew a lottery retailer's contract or prohibit a lottery retailer from selling lottery tickets at a business location if there is a material change in any of the factors considered by the director under subdivision 2.\n(d) A contract cancellation, suspension, refusal to renew, or prohibiting a lottery retailer from selling lottery tickets at a business location under this subdivision is a contested case under sections 14.57 to 14.69 and is in addition to any criminal penalties provided for a violation of law or rule.\n(e) The director may temporarily suspend a contract or temporarily prohibit a lottery retailer from selling lottery tickets at a business location without notice for any of the reasons specified in this subdivision provided that a hearing is conducted within seven days after a request for a hearing is made by a lottery retailer. Within 20 days after receiving the administrative law judge's report, the director shall issue an order vacating the temporary suspension or prohibition or making any other appropriate order. If no hearing is requested within 30 days of the temporary suspension or prohibition taking effect, the suspension or prohibition becomes permanent unless the director vacates or modifies the order.\nThe director may adopt a plan whereby eligible lottery retailers will receive a bonus payment, in addition to commissions or incentives earned for the sale of lottery tickets, if total lottery sales for a fiscal year increase when compared to the total lottery sales for the previous fiscal year. The bonus payment shall be no more than ten percent of any increase in total lottery sale, which shall be paid to active lottery retailers at the end of a fiscal year on the basis of each lottery retailer's market share.",
	"repealed": false
}