{
	"id": "341.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.28",
	"title": "341.28 REGULATION OF COMBATIVE SPORT CONTESTS.",
	"text": "All combative sport contests within this state must be conducted according to the requirements of this chapter.\nAll professional boxing contests are subject to this chapter. Every combatant in a boxing contest shall wear padded gloves that weigh at least eight ounces. Officials at all boxing contests must be licensed under this chapter.\nAll professional and amateur tough person contests are subject to this chapter. All tough person contests are subject to the most recent version of the Unified Rules of Boxing, as promulgated by the Association of Boxing Commissions. Every contestant in a tough person contest shall have a physical examination prior to their bouts. Every contestant in a tough person contest shall wear headgear and padded gloves that weigh at least 12 ounces. Officials at all tough person contests shall be licensed under this chapter.\nAll professional and amateur mixed martial arts contests are subject to this chapter and all officials at these events must be licensed under this chapter.\nAll professional and amateur kickboxing contests are subject to this chapter and all officials at these events must be licensed under this chapter.\n(a) Unless this chapter specifically states otherwise, contests or exhibitions for martial arts and amateur boxing are exempt from the requirements of this chapter and officials at these events are not required to be licensed under this chapter.\n(b) Martial arts and amateur boxing contests, unless subject to the exceptions set forth in subdivision 6 or 7, must be regulated by a nationally recognized organization approved by the commissioner. The organization must have a set of written standards, procedures, or rules used to sanction the combative sports it oversees.\n(c) Any regulatory body overseeing a martial arts or amateur boxing event must submit bout results to the commissioner within 72 hours after the event. If the regulatory body issues suspensions, the regulatory body must submit to the commissioner a list of any suspensions resulting from the event within 72 hours after the event. Regulatory bodies that oversee combative sports or martial arts contests under subdivision 6 or 7 are not subject to this paragraph.\nCombative sports or martial arts contests regulated by the Minnesota State High School League, National Collegiate Athletic Association, National Junior Collegiate Athletic Association, National Association of Intercollegiate Athletics, or any similar organization that governs interscholastic athletics are not subject to this chapter and officials at these events are not required to be licensed under this chapter.\nCombative sports or martial arts contests between individuals under the age of 18 years are exempt from the requirements of this chapter and officials at these events are not required to be licensed under this chapter. A contest under this subdivision must be regulated by (1) a widely recognized organization that regularly oversees youth competition, or (2) a local government.",
	"repealed": false
}