{
	"id": "462A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.06",
	"title": "462A.06 GENERAL POWERS OF THE AGENCY.",
	"text": "For the purpose of exercising the specific powers granted in section 462A.05 and effectuating the other purposes of this chapter, the agency shall have the general powers granted in this section.\nIt may sue and be sued.\nIt may have a seal and alter the same at will.\nIt may make, and from time to time, amend and repeal rules not inconsistent with the provisions of this chapter.\nIt may acquire, hold and dispose of personal property for its corporate purposes.\nIt may enter into agreements or other transactions with any federal or state agency, any person and any domestic or foreign partnership, corporation, association or organization.\nIt may, subject to the provisions of section 462A.05, subdivision 27, (1) acquire real or personal property, or an interest therein, including partnership shares in housing-related partnerships, on either a temporary or long-term basis in its own name, by purchase, exchange, gift, assignment, transfer, foreclosure, deed in lieu of foreclosure, lease, assignment of lease or otherwise, including rights or easements in real property; (2) own, hold, manage, operate, clear, improve, and rehabilitate real or personal property; and (3) sell, assign, lease, encumber, mortgage, or otherwise dispose of any real or personal property, or any interest in that property, or mortgage lien or security interest owned by it or under its control, custody, or in its possession and release or relinquish any right, title, claim, lien, interest, easement, or demand however acquired, including any equity or right of redemption in property foreclosed by it, and do any of the foregoing by public or private sale, with or without public bidding, notwithstanding the provisions of any other law.\nIt may sell, at public or private sale, any note, mortgage or other instrument or obligation evidencing or securing a loan, including a certificate evidencing an interest in one or more loans. The agency may, in connection with such a sale, retain the right or obligation to collect the principal and interest on the loan, to enter into commitments for timely remittal of the principal and interest, or to provide any other services as described in the certificate.\nIt may procure insurance against any loss in connection with its property in such amounts, and from such insurers, as may be necessary or desirable.\nIt may consent, whenever it deems it necessary or desirable in the fulfillment of its corporate purpose, to the modification of the rate of interest, time of payment or any installment of principal or interest, or any other term, of any mortgage loan, mortgage loan commitment, construction loan, temporary loan, contract or agreement of any kind to which the agency is a party.\nIt may make and publish rules pursuant to chapter 14 respecting its mortgage lending, construction lending, rehabilitation lending, grants, and temporary lending, and any such other rules as are necessary to effectuate its corporate purpose.\nIt may borrow money to carry out and effectuate its corporate purpose and may issue its bonds or notes as evidence of any such borrowing in accordance with sections 462A.08 to 462A.17.\nMS 1971 [Repealed, 1973 c 515 s 40]\nMS 1971 [Repealed, 1973 c 515 s 40]\nMS 1971 [Repealed, 1973 c 515 s 40]\nMS 1971 [Repealed, 1973 c 515 s 40]",
	"repealed": false
}