{
	"id": "62L.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.17",
	"title": "62L.17 PARTICIPATION IN REINSURANCE ASSOCIATION.",
	"text": "The board of directors or the interim board shall establish minimum claim processing and managed care standards which must be met by a health carrier in order to have its business reinsured by the association.\nA health carrier may elect to not participate in the reinsurance association through transferring risk only after filing an application with the commissioner of commerce. The commissioner may approve the application after consultation with the board of directors. In determining whether to approve an application, the commissioner shall consider whether the health carrier meets the following standards:\n(1) demonstration by the health carrier of a substantial and established market presence;\n(2) demonstrated experience in the small group market and history of rating and underwriting small employer groups;\n(3) commitment to comply with the requirements of this chapter for small employers in the state or its service area; and\n(4) financial ability to assume and manage the risk of enrolling small employer groups without the protection of the reinsurance.\nInitial application for nonparticipation must be filed with the commissioner no later than February 1993. The commissioner shall make the determination and notify the carrier no later than April 15, 1993.\nA health carrier that enters the small employer market subsequent to February 1993, may elect to not participate in the reinsurance association by filing an application within 60 days of entry into the small employer market or May 26, 1995, whichever is later. The commissioner shall make a determination and notify the health carrier no later than 60 days after receipt of the application. In determining whether to approve the application, the commissioner shall consider the standards defined in subdivision 2, except that the commissioner may also consider whether the health carrier has a guaranteeing organization as permitted under chapter 62N.\nA health carrier's initial election is for a period of two years. Subsequent elections of participation are for five-year periods.\nA health carrier whose application for nonparticipation has been rejected by the commissioner may appeal the decision. The association may also appeal a decision of the commissioner, if approved by a two-thirds majority of the board. Chapter 14 applies to all appeals under this subdivision.\nA health carrier that has received approval to not participate in the reinsurance association shall annually certify to the commissioner on or before December 1 that it continues to meet the standards described in subdivision 2.\nElection to participate in the reinsurance association must occur on or before December 31 of each year. If after a period of nonparticipation, the nonparticipating health carrier subsequently elects to participate in the reinsurance association, the health carrier retains the risk it assumed when not participating in the association.\nIf a participating health carrier subsequently elects to not participate in the reinsurance association, the health carrier shall cease reinsuring through the association all of its small employer business and is liable for any assessment described in section 62L.22 which has been prorated based on the business covered by the reinsurance mechanism during the year of the assessment.\nThe commissioner, after consultation with the board, may authorize a health carrier to modify its election to not participate in the association at any time, if the risk from the carrier's existing small employer business jeopardizes the financial condition of the health carrier. If the commissioner authorizes a health carrier to participate in the association, the health carrier shall retain the risk it assumed while not participating in the association. This election option may not be exercised if the health carrier is in rehabilitation.",
	"repealed": false
}