{
	"id": "256.9657",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9657",
	"title": "256.9657 PROVIDER SURCHARGES.",
	"text": "(a) Effective July 1, 1993, each non-state-operated nursing home licensed under chapter 144A shall pay to the commissioner an annual surcharge according to the schedule in subdivision 4. The surcharge shall be calculated as $620 per licensed bed. If the number of licensed beds is reduced, the surcharge shall be based on the number of remaining licensed beds the second month following the receipt of timely notice by the commissioner of human services that beds have been delicensed. The nursing home must notify the commissioner of health in writing when beds are delicensed. The commissioner of health must notify the commissioner of human services within ten working days after receiving written notification. If the notification is received by the commissioner of human services by the 15th of the month, the invoice for the second following month must be reduced to recognize the delicensing of beds. Beds on layaway status continue to be subject to the surcharge. The commissioner of human services must acknowledge a medical care surcharge appeal within 30 days of receipt of the written appeal from the provider.\n(b) Effective July 1, 1994, the surcharge in paragraph (a) shall be increased to $625.\n(c) Effective August 15, 2002, the surcharge under paragraph (b) shall be increased to $990.\n(d) Effective July 15, 2003, the surcharge under paragraph (c) shall be increased to $2,815.\n(e) The commissioner may reduce, and may subsequently restore, the surcharge under paragraph (d) based on the commissioner's determination of a permissible surcharge.\nThe commissioner shall request a waiver from the secretary of health and human services to: (1) exclude from the surcharge under subdivision 1 a nursing home that provides all services free of charge; (2) make a pro rata reduction in the surcharge paid by a nursing home that provides a portion of its services free of charge; and (3) limit the hospital surcharge to acute care hospitals only. If a waiver is approved under this subdivision, the commissioner shall adjust the nursing home surcharge accordingly. Any waivers granted by the federal government shall be effective on or after October 1, 1992.\n[Repealed, 1998 c 254 art 1 s 68]\nMS 2016 [Repealed, 2018 c 182 art 1 s 109]\n(a) Effective October 1, 1992, each Minnesota hospital except facilities of the federal Indian Health Service and regional treatment centers shall pay to the medical assistance account a surcharge equal to 1.4 percent of net patient revenues excluding net Medicare revenues reported by that provider to the health care cost information system according to the schedule in subdivision 4.\n(b) Effective July 1, 1994, the surcharge under paragraph (a) is increased to 1.56 percent.\n(c) Notwithstanding the Medicare cost finding and allowable cost principles, the hospital surcharge is not an allowable cost for purposes of rate setting under sections 256.9685 to 256.9695.\n(a) Each teaching hospital shall pay to the medical assistance account a surcharge equal to 1.41 percent of its fiscal year 2021 net patient revenue for inpatient services. The initial surcharge must not be collected more than 30 days before the commissioner makes the first of the payments required under section 256.969, subdivision 2g. Subsequent surcharge payments must be paid annually in the form and manner specified by the commissioner. The surcharge must comply with all applicable federal requirements and federal laws, including but not limited to Code of Federal Regulations, title 42, section 433.68.\n(b) Revenue from the surcharge must be used by the commissioner only to pay the nonfederal share of the medical assistance supplemental payments described in section 256.969, subdivision 2g, and must be used to supplement, and not supplant, medical assistance reimbursement to teaching hospitals.\n(c) For purposes of this subdivision, \"teaching hospital\" means any Minnesota hospital with a Centers for Medicare and Medicaid Services designation of \"teaching hospital\" as reported on form CMS-2552-10, worksheet S-2, line 56, that is eligible for reimbursement under section 256.969, subdivision 2g.\n(d) Notwithstanding paragraph (c), the following hospitals are exempt from paying the surcharge under this section:\n(1) all hospitals in Minnesota designated as a children's hospital under Medicare, including Children's Health Care, doing business as Children's Minnesota, and Gillette Children's Specialty Healthcare, doing business as Gillette Children's;\n(2) teaching hospitals with three or fewer full-time equivalent trainees, based on a Medicare cost report filed for the fiscal year ending in 2022;\n(3) federal Indian Health Service facilities; and\n(4) regional treatment centers.\n(e) The teaching hospital surcharge established under this subdivision must only be assessed if the annual inpatient supplemental payments under section 256.969, subdivision 2g, are approved by the Centers for Medicare and Medicaid Services.\n(f) The commissioner must reduce the surcharge percentage in paragraph (a) such that the aggregate amount collected from hospitals under this subdivision does not exceed the total amount needed for the nonfederal share of the annual inpatient supplemental payments authorized by section 256.969, subdivision 2g.\n(g) For purposes of this subdivision, net patient revenue for inpatient services must be calculated by:\n(1) determining gross inpatient hospital facility charges from the hospital's audited statements or, if not contained or segregated within the hospital's audited financial statements, using detailed internal financial income statements or schedules; and\n(2) subtracting from gross inpatient hospital facility charges:\n(i) all professional fee charges, home health charges, skilled nursing facility charges, hospice charges, end-stage renal disease charges, and other nonhospital charges; and\n(ii) applicable contractual allowances.\n(h) Teaching hospitals subject to the surcharge under this subdivision shall submit to the commissioner, in the form and manner specified by the commissioner, all documentation necessary to provide reconciliation of the net patient revenue calculation under paragraph (b).\n(i) This subdivision is effective on the later of July 1, 2025, or 60 days after the end of the first legislative regular session that begins following federal approval for all of the following: (1) the amendment in this act adding section 256.9657, subdivision 2a; (2) the amendment in this act to section 256.969, subdivision 2b; and (3) the amendment in this act adding section 256.969, subdivision 2g. The commissioner of human services shall notify the revisor of statutes when federal approval is obtained.\n(j) This subdivision is subject to the implementation requirements in Laws 2024, chapter 127, article 54, section 9.\n(k) This subdivision expires June 30, 2030, or five years after federal approval is obtained, whichever is later.\n(a) Effective October 1, 1992, each health maintenance organization with a certificate of authority issued by the commissioner of health under chapter 62D and each community integrated service network licensed by the commissioner under chapter 62N shall pay to the commissioner of human services a surcharge equal to six-tenths of one percent of the total premium revenues of the health maintenance organization or community integrated service network as reported to the commissioner of health according to the schedule in subdivision 4.\n(b) For purposes of this subdivision, total premium revenue means:\n(1) premium revenue recognized on a prepaid basis from individuals and groups for provision of a specified range of health services over a defined period of time which is normally one month, excluding premiums paid to a health maintenance organization or community integrated service network from the Federal Employees Health Benefit Program;\n(2) premiums from Medicare wraparound subscribers for health benefits which supplement Medicare coverage;\n(3) Medicare revenue, as a result of an arrangement between a health maintenance organization or a community integrated service network and the Centers for Medicare and Medicaid Services of the federal Department of Health and Human Services, for services to a Medicare beneficiary, excluding Medicare revenue that states are prohibited from taxing under sections 1854, 1860D-12, and 1876 of title XVIII of the federal Social Security Act, codified as United States Code, title 42, sections 1395mm, 1395w-112, and 1395w-24, respectively, as they may be amended from time to time; and\n(4) medical assistance revenue, as a result of an arrangement between a health maintenance organization or community integrated service network and a Medicaid state agency, for services to a medical assistance beneficiary.\nIf advance payments are made under clause (1) or (2) to the health maintenance organization or community integrated service network for more than one reporting period, the portion of the payment that has not yet been earned must be treated as a liability.\n(c) When a health maintenance organization or community integrated service network merges or consolidates with or is acquired by another health maintenance organization or community integrated service network, the surviving corporation or the new corporation shall be responsible for the annual surcharge originally imposed on each of the entities or corporations subject to the merger, consolidation, or acquisition, regardless of whether one of the entities or corporations does not retain a certificate of authority under chapter 62D or a license under chapter 62N.\n(d) Effective June 15 of each year, the surviving corporation's or the new corporation's surcharge shall be based on the revenues earned in the previous calendar year by all of the entities or corporations subject to the merger, consolidation, or acquisition regardless of whether one of the entities or corporations does not retain a certificate of authority under chapter 62D or a license under chapter 62N until the total premium revenues of the surviving corporation include the total premium revenues of all the merged entities as reported to the commissioner of health.\n(e) When a health maintenance organization or community integrated service network, which is subject to liability for the surcharge under this chapter, transfers, assigns, sells, leases, or disposes of all or substantially all of its property or assets, liability for the surcharge imposed by this chapter is imposed on the transferee, assignee, or buyer of the health maintenance organization or community integrated service network.\n(f) In the event a health maintenance organization or community integrated service network converts its licensure to a different type of entity subject to liability for the surcharge under this chapter, but survives in the same or substantially similar form, the surviving entity remains liable for the surcharge regardless of whether one of the entities or corporations does not retain a certificate of authority under chapter 62D or a license under chapter 62N.\n(g) The surcharge assessed to a health maintenance organization or community integrated service network ends when the entity ceases providing services for premiums and the cessation is not connected with a merger, consolidation, acquisition, or conversion.\n(a) Effective July 1, 2003, each non-state-operated facility as defined under section 256B.501, subdivision 1, shall pay to the commissioner an annual surcharge according to the schedule in subdivision 4, paragraph (d). The annual surcharge shall be $1,040 per licensed bed. If the number of licensed beds is reduced, the surcharge shall be based on the number of remaining licensed beds the second month following the receipt of timely notice by the commissioner of human services that beds have been delicensed. The facility must notify the commissioner of health in writing when beds are delicensed. The commissioner of health must notify the commissioner of human services within ten working days after receiving written notification. If the notification is received by the commissioner of human services by the 15th of the month, the invoice for the second following month must be reduced to recognize the delicensing of beds. The commissioner may reduce, and may subsequently restore, the surcharge under this subdivision based on the commissioner's determination of a permissible surcharge.\n(b) Effective July 1, 2013, the surcharge under paragraph (a) is increased to $3,679 per licensed bed.\n(a) Payments to the commissioner under subdivision 1 must be paid in monthly installments due on the 15th of the month beginning October 15, 1992. The monthly payment must be equal to the annual surcharge divided by 12.\n(b) Effective October 15, 2014, payment to the commissioner under subdivision 2 must be paid in nine monthly installments due on the 15th of the month beginning October 15, 2014, through June 15 of the following year. The monthly payment must be equal to the annual surcharge divided by nine.\n(c) Effective October 1, 2014, and each October 1 thereafter, the payments in subdivision 2 must be based on revenues earned in the previous calendar year.\n(d) If the commissioner of health does not provide by August 15 of any year data needed to update the base year for the hospital or April 15 of any year data needed to update the base year for the health maintenance organization surcharges, the commissioner of human services may estimate base year revenue and use that estimate for the purposes of this section until actual data is provided by the commissioner of health.\n(e) Payments to the commissioner under subdivision 3a must be paid in monthly installments due on the 15th of the month beginning July 15, 2003. The monthly payment must be equal to the annual surcharge divided by 12.\n(f) Payments due in July through September 2014 under subdivision 3 for revenue earned in calendar year 2012 shall be paid in a lump sum on June 15, 2014. On June 15, 2014, each health maintenance organization and community-integrated service network shall pay all payments under subdivision 3 in a lump sum for revenue earned in calendar year 2013. Effective June 15, 2015, and each June 15 thereafter, the payments in subdivision 3 shall be based on revenues earned in the previous calendar year and paid in a lump sum on June 15 of each year.\n[Repealed, 1992 c 513 art 7 s 135]\nAt least 30 days prior to the date the payment is due, the commissioner shall give each provider a written notice of each payment due. A provider may request a contested case hearing under chapter 14 within 30 days of receipt of the notice. The decision of the commissioner regarding the amount due stands until the appeal is decided. The provider shall pay the contested payment at the time of appeal with settle up at the time of appeal resolution.\nThe provisions of sections 270C.31, except subdivisions 5 and 7; 270C.32, except subdivisions 6 and 10; 270C.33; 270C.61, subdivision 2; and 289A.35 to 289A.50 relating to the authority to audit, assess, collect, and pay refunds of other state taxes may be implemented by the commissioner of human services with respect to the tax, penalty, and interest imposed by this section. The commissioner of human services shall impose civil penalties for violation of this section as provided in section 289A.60, and the tax and penalties are subject to interest at the rate provided in section 270C.40. The commissioner of human services shall have the power to abate penalties and interest when discrepancies occur resulting from, but not limited to, circumstances of error and mail delivery. The commissioner of human services shall bring appropriate civil actions to collect provider payments due under this section.\nIf any provider obligated to pay an annual surcharge under this section is more than two months delinquent in the timely payment of a monthly surcharge installment payment, the provisions in paragraphs (a) to (f) apply.\n(a) The department may withhold some or all of the amount of the delinquent surcharge, together with any interest and penalties due and owing on those amounts, from any money the department owes to the provider. The department may, at its discretion, also withhold future surcharge installment payments from any money the department owes the provider as those installments become due and owing. The department may continue this withholding until the department determines there is no longer any need to do so.\n(b) The department shall give prior notice of the department's intention to withhold by mailing a written notice to the provider at the address to which remittance advices are mailed or faxing a copy of the notice to the provider at least ten business days before the date of the first payment period for which the withholding begins. The notice may be sent by ordinary or certified mail, or facsimile, and shall be deemed received as of the date of mailing or receipt of the facsimile. The notice shall:\n(1) state the amount of the delinquent surcharge;\n(2) state the amount of the withholding per payment period;\n(3) state the date on which the withholding is to begin;\n(4) state whether the department intends to withhold future installments of the provider's surcharge payments;\n(5) inform the provider of their rights to informally object to the proposed withholding and to appeal the withholding as provided for in this subdivision;\n(6) state that the provider may prevent the withholding during the pendency of their appeal by posting a bond; and\n(7) state other contents as the department deems appropriate.\n(c) The provider may informally object to the withholding in writing anytime before the withholding begins. An informal objection shall not stay or delay the commencement of the withholding. The department may postpone the commencement of the withholding as deemed appropriate and shall not be required to give another notice at the end of the postponement and before commencing the withholding. The provider shall have the right to appeal any withholding from remittances by filing an appeal with Ramsey County District Court and serving notice of the appeal on the department within 30 days of the date of the written notice of the withholding. Notice shall be given and the appeal shall be heard no later than 45 days after the appeal is filed. In a hearing of the appeal, the department's action shall be sustained if the department proves the amount of the delinquent surcharges or overpayment the provider owes, plus any accrued interest and penalties, has not been repaid. The department may continue withholding for delinquent and current surcharge installment payments during the pendency of an appeal unless the provider posts a bond from a surety company licensed to do business in Minnesota in favor of the department in an amount equal to two times the provider's total annual surcharge payment for the fiscal year in which the appeal is filed with the department.\n(d) The department shall refund any amounts due to the provider under any final administrative or judicial order or decree which fully and finally resolves the appeal together with interest on those amounts at the rate of three percent per annum simple interest computed from the date of each withholding, as soon as practical after entry of the order or decree.\n(e) The commissioner, or the commissioner's designee, may enter into written settlement agreements with a provider to resolve disputes and other matters involving unpaid surcharge installment payments or future surcharge installment payments.\n(f) Notwithstanding any law to the contrary, all unpaid surcharges, plus any accrued interest and penalties, shall be overpayments for purposes of section 256B.0641.\n(a) The surcharge shall be adjusted by inflationary and caseload changes in future bienniums to maintain reimbursement of health care providers in accordance with the requirements of the state and federal laws governing the medical assistance program, including the requirements of the Medicaid moratorium amendments of 1991 found in Public Law No. 102-234.\n(b) The commissioner shall request the Minnesota congressional delegation to support a change in federal law that would prohibit federal disallowances for any state that makes a good faith effort to comply with Public Law 102-234 by enacting conforming legislation prior to the issuance of federal implementing regulations.",
	"repealed": false
}