{
	"id": "62A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.30",
	"title": "62A.30 COVERAGE FOR DIAGNOSTIC PROCEDURES FOR CANCER.",
	"text": "This section applies to all policies of accident and health insurance, health maintenance contracts regulated under chapter 62D, health benefit certificates offered through a fraternal benefit society regulated under chapter 64B, and subscriber contracts offered by nonprofit health service plan corporations regulated under chapter 62C, but does not apply to policies designed primarily to provide coverage payable on a per diem, fixed indemnity or nonexpense incurred basis, or policies that provide only accident coverage.\nEvery policy, plan, certificate, or contract referred to in subdivision 1 that provides coverage to a Minnesota resident must provide coverage for routine screening procedures for cancer and the office or facility visit, including mammograms, surveillance tests for ovarian cancer for women who are at risk for ovarian cancer as defined in subdivision 3, pap smears, and colorectal screening tests for men and women, when ordered or provided by a physician in accordance with the standard practice of medicine.\nFor purposes of subdivision 2:\n(a) \"At risk for ovarian cancer\" means:\n(1) having a family history:\n(i) with one or more first- or second-degree relatives with ovarian cancer;\n(ii) of clusters of women relatives with breast cancer; or\n(iii) of nonpolyposis colorectal cancer; or\n(2) testing positive for BRCA1 or BRCA2 mutations.\n(b) \"Surveillance tests for ovarian cancer\" means annual screening using:\n(1) CA-125 serum tumor marker testing;\n(2) transvaginal ultrasound;\n(3) pelvic examination; or\n(4) other proven ovarian cancer screening tests currently being evaluated by the federal Food and Drug Administration or by the National Cancer Institute.\n(a) For purposes of subdivision 2, coverage for a preventive mammogram screening (1) includes digital breast tomosynthesis for enrollees at risk for breast cancer, and (2) is covered as a preventive item or service, as described under section 62Q.46.\n(b) For purposes of this subdivision, \"digital breast tomosynthesis\" means a radiologic procedure that involves the acquisition of projection images over the stationary breast to produce cross-sectional digital three-dimensional images of the breast. \"At risk for breast cancer\" means:\n(1) having a family history with one or more first- or second-degree relatives with breast cancer;\n(2) testing positive for BRCA1 or BRCA2 mutations;\n(3) having heterogeneously dense breasts or extremely dense breasts based on the Breast Imaging Reporting and Data System established by the American College of Radiology; or\n(4) having a previous diagnosis of breast cancer.\n(c) This subdivision does not apply to coverage provided through a public health care program under chapter 256B or 256L.\n(d) Nothing in this subdivision limits the coverage of digital breast tomosynthesis in a policy, plan, certificate, or contract referred to in subdivision 1 that is in effect prior to January 1, 2020.\n(e) Nothing in this subdivision prohibits a policy, plan, certificate, or contract referred to in subdivision 1 from covering digital breast tomosynthesis for an enrollee who is not at risk for breast cancer.\nIf a health care provider determines an enrollee requires additional diagnostic services or testing after a mammogram, a health plan must provide coverage for the additional diagnostic services or testing with no cost-sharing, including co-pay, deductible, or coinsurance.\nIf the application of subdivision 5 before an enrollee has met their health plan's deductible would result in: (1) health savings account ineligibility under United States Code, title 26, section 223; or (2) catastrophic health plan ineligibility under United States Code, title 42, section 18022(e), then subdivision 5 shall apply to diagnostic services or testing only after the enrollee has met their health plan's deductible.",
	"repealed": false
}