{
	"id": "290.0686",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0686",
	"title": "290.0686 CREDIT FOR ATTAINING MASTER'S DEGREE IN TEACHER'S LICENSURE FIELD.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Master's degree program\" means a graduate-level program at an accredited university leading to a master of arts or science degree in a core content area directly related to a qualified teacher's licensure field. The master's degree program may not include pedagogy or a pedagogy component. To be eligible under this credit, a licensed elementary school teacher must pursue and complete a master's degree program in a core content area in which the teacher provides direct classroom instruction.\n(c) \"Qualified teacher\" means a person who:\n(1) holds a teaching license issued by the licensing division in the Department of Education on behalf of the Professional Educator Licensing and Standards Board both when the teacher begins the master's degree program and when the teacher completes the master's degree program;\n(2) began a master's degree program after June 30, 2017; and\n(3) completes the master's degree program during the taxable year.\n(d) \"Core content area\" means the academic subject of reading, English or language arts, mathematics, science, foreign languages, civics and government, economics, arts, history, or geography.\n(a) An individual who is a qualified teacher is allowed a credit against the tax imposed under this chapter. The credit equals the lesser of $2,500 or the amount the individual paid for tuition, fees, books, and instructional materials necessary to completing the master's degree program and for which the individual did not receive reimbursement from an employer or scholarship.\n(b) For a nonresident or a part-year resident, the credit under this subdivision must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\n(c) A qualified teacher may claim the credit in this section only one time for each master's degree program completed in a core content area.",
	"repealed": false
}