{
	"id": "256B.6926",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.6926",
	"title": "256B.6926 STATE MONITORING.",
	"text": "(a) The commissioner shall establish a monitoring system that addresses all aspects of the managed care program, including the performance of each managed care organization in the areas identified under Code of Federal Regulations, part 42, section 438.66, paragraph (b).\n(b) The commissioner shall use data collected from the monitoring activities, including, at a minimum, the data identified in Code of Federal Regulations, part 42, section 438.66, paragraph (c), to improve the performance of the managed care program.\nThe commissioner shall conduct a readiness review of each managed care organization that contracts with the commissioner to assess the managed care organization's ability and capacity to perform satisfactorily in the areas described in Code of Federal Regulations, part 42, section 438.66, paragraph (d), clauses (1) to (4). The review must be conducted and approval must be received from the Centers for Medicare and Medicaid Services prior to the commissioner entering into a contract with the managed care organization.\n(a) The commissioner shall submit to the Centers for Medicare and Medicaid Services, no later than 180 days after each contract year, a report on the managed care program administered by the commissioner, regardless of the authority under which the program operates, with the initial report being submitted 180 days after the contract year following the release of the Centers for Medicare and Medicaid Services guidance. Each report must, at a minimum, assess the managed care program's operation in the areas identified in Code of Federal Regulations, part 42, section 438.66, paragraph (e), clause (2), and must be:\n(1) provided to the Medicaid Citizens' Advisory Committee as required under Code of Federal Regulations, part 42, section 431.12;\n(2) provided to the stakeholder consultation group as required under Code of Federal Regulations, part 42, section 438.70, to the extent the managed care program includes long-term services and supports; and\n(3) published on the department's website.\n(b) The report described under this subdivision may be used to meet the commissioner's reporting obligation under the managed care waiver authority for the managed care program.\nThe commissioner shall implement safeguards against conflicts of interest on behalf of state and local officers and employees and agents of the state who have responsibilities relating to managed care contracts. The safeguards must be at least as effective as the safeguards specified in United States Code, title 41, sections 2101 to 2107. The commissioner shall comply with Code of Federal Regulations, part 42, section 438.58, and United States Code, title 42, section 1396a, paragraph (a), clause (4), item (c), applicable to contracting officers, employees, or independent contractors.",
	"repealed": false
}