{
	"id": "609.749",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.749",
	"title": "609.749 HARASSMENT; STALKING; PENALTIES.",
	"text": "MS 2019 Supp [Repealed, 2020 c 96 s 6]\nMS 2018 [Repealed, 2020 c 96 s 6]\n(a) When acts constituting a violation of this section are committed in two or more counties, the accused may be prosecuted in any county in which one of the acts was committed for all acts in violation of this section.\n(b) The conduct described in subdivision 2, clauses (4) and (5), may be prosecuted at the place where any call is made or received or, in the case of wireless or electronic communication or any communication made through any available technologies, where the actor or victim resides or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established by chapter 5B. The conduct described in subdivision 2, clause (2), may be prosecuted where the actor or victim resides. The conduct described in subdivision 2, clause (6), may be prosecuted where any letter, telegram, message, package, or other object is sent or received or, in the case of wireless or electronic communication or communication made through other available technologies, where the actor or victim resides or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established by chapter 5B.\nFor all violations under this section, except a violation of subdivision 2, clause (7), a peace officer may make an arrest under the provisions of section 629.34. A peace officer may not make a warrantless, custodial arrest of any person for a violation of subdivision 2, clause (7).\n(a) As used in this subdivision, the following terms have the meanings given:\n(1) \"family or household members\" has the meaning given in section 518B.01, subdivision 2, paragraph (b);\n(2) \"personal information\" has the meaning given in section 617.261, subdivision 7, paragraph (f);\n(3) \"sexual act\" has the meaning given in section 617.261, subdivision 7, paragraph (g); and\n(4) \"substantial emotional distress\" means mental distress, mental suffering, or mental anguish as demonstrated by a victim's response to an act including but not limited to seeking psychotherapy as defined in section 604.20, losing sleep or appetite, being diagnosed with a mental-health condition, experiencing suicidal ideation, or having difficulty concentrating on tasks resulting in a loss of productivity.\n(b) A person who commits any of the acts listed in paragraph (c) is guilty of a gross misdemeanor if the person, with the intent to kill, injure, harass, or intimidate another person:\n(1) places the other person in reasonable fear of substantial bodily harm;\n(2) places the person in reasonable fear that the person's family or household members will be subject to substantial bodily harm; or\n(3) causes or would reasonably be expected to cause substantial emotional distress to the other person.\n(c) A person commits harassment under this section if the person:\n(1) directly or indirectly, or through third parties, manifests a purpose or intent to injure the person, property, or rights of another by the commission of an unlawful act;\n(2) follows, monitors, or pursues another, whether in person or through any available technological or other means;\n(3) returns to the property of another if the actor is without claim of right to the property or consent of one with authority to consent;\n(4) repeatedly makes telephone calls, sends text messages, or induces a victim to make telephone calls to the actor, whether or not conversation ensues;\n(5) makes or causes the telephone of another repeatedly or continuously to ring;\n(6) repeatedly mails or delivers or causes the delivery by any means, including electronically, of letters, telegrams, messages, packages, through assistive devices for people with vision impairments or hearing loss, or any communication made through any available technologies or other objects;\n(7) knowingly makes false allegations against a peace officer concerning the officer's performance of official duties with intent to influence or tamper with the officer's performance of official duties; or\n(8) uses another's personal information, without consent, to invite, encourage, or solicit a third party to engage in a sexual act with the person.\n(a) A person who commits any of the following acts is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both:\n(1) commits any offense described in subdivision 2 in whole or in substantial part because of the victim's or another's actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03, or because of the victim's actual or perceived association with another person or group of a certain actual or perceived race, color, ethnicity, religion, sex, gender, sexual orientation, gender identity, gender expression, age, national origin, or disability as defined in section 363A.03;\n(2) commits any offense described in subdivision 2 by falsely impersonating another;\n(3) commits any offense described in subdivision 2 and a dangerous weapon was used in any way in the commission of the offense;\n(4) commits any offense described in subdivision 2 with intent to influence or otherwise tamper with a juror or a judicial proceeding or with intent to retaliate against a judicial officer, as defined in section 609.415, or a prosecutor, defense attorney, or officer of the court, because of that person's performance of official duties in connection with a judicial proceeding; or\n(5) commits any offense described in subdivision 2 against a victim under the age of 18, if the actor is more than 36 months older than the victim.\n(b) A person who commits any offense described in subdivision 2 against a victim under the age of 18, if the actor is more than 36 months older than the victim, and the act is committed with sexual or aggressive intent, is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(a) A person is guilty of a felony who violates any provision of subdivision 2 within ten years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency, and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) A person is guilty of a felony who violates any provision of subdivision 2 within ten years of the first of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency, and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(a) A person who engages in stalking with respect to a single victim or one or more members of a single household which the actor knows or has reason to know would cause the victim under the circumstances to feel terrorized or to fear bodily harm and which does cause this reaction on the part of the victim, is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(b) For purposes of this subdivision, \"stalking\" means two or more acts within a five-year period that violate or attempt to violate the provisions of any of the following or a similar law of another state, the United States, the District of Columbia, tribe, or United States territories:\n(1) this section;\n(2) sections 609.185 to 609.205 (first- to third-degree murder and first- and second-degree manslaughter);\n(3) section 609.713 (terroristic threats);\n(4) section 609.224 (fifth-degree assault);\n(5) section 609.2242 (domestic assault);\n(6) section 518B.01, subdivision 14 (violations of domestic abuse orders for protection);\n(7) section 609.748, subdivision 6 (violations of harassment restraining orders);\n(8) section 609.605, subdivision 1, paragraph (b), clauses (3), (4), and (7) (certain trespass offenses);\n(9) section 609.78, subdivision 2 (interference with an emergency call);\n(10) section 609.79 (obscene or harassing telephone calls);\n(11) section 609.795 (letter, telegram, or package; opening; harassment);\n(12) section 609.582 (burglary);\n(13) section 609.595 (damage to property);\n(14) section 609.765 (criminal defamation);\n(15) sections 609.342 to 609.3451 (first- to fifth-degree criminal sexual conduct);\n(16) section 609.3458 (sexual extortion); or\n(17) section 629.75, subdivision 2 (violations of domestic abuse no contact orders).\n(c) Words set forth in parentheses after references to statutory sections in paragraph (b) are mere catchwords included solely for convenience in reference. They are not substantive and may not be used to construe or limit the meaning of the cited statutory provision.\n(a) When a person is convicted of a felony offense under this section, or another felony offense arising out of a charge based on this section, the court shall order an independent professional mental health assessment of the offender's need for mental health treatment. The court may waive the assessment if an adequate assessment was conducted prior to the conviction.\n(b) Notwithstanding sections 13.384, 13.85, 144.291 to 144.298, 260B.171, or 260C.171, the assessor has access to the following private or confidential data on the person if access is relevant and necessary for the assessment:\n(1) medical data under section 13.384;\n(2) welfare data under section 13.46;\n(3) corrections and detention data under section 13.85;\n(4) health records under sections 144.291 to 144.298; and\n(5) juvenile court records under sections 260B.171 and 260C.171.\nData disclosed under this section may be used only for purposes of the assessment and may not be further disclosed to any other person, except as authorized by law.\n(c) If the assessment indicates that the offender is in need of and amenable to mental health treatment, the court shall include in the sentence a requirement that the offender undergo treatment.\n(d) The court shall order the offender to pay the costs of assessment under this subdivision unless the offender is indigent under section 563.01.\nConduct is not a crime under this section if it is performed under terms of a valid license, to ensure compliance with a court order, or to carry out a specific lawful commercial purpose or employment duty, is authorized or required by a valid contract, or is authorized, required, or protected by state, federal, or tribal law or the state, federal, or tribal constitutions. Subdivision 2, clause (2), does not impair the right of any individual or group to engage in speech protected by the federal, state, or tribal constitutions, or federal, state, or tribal law, including peaceful and lawful handbilling and picketing.\n(a) When a person is convicted of harassment or stalking under this section and the court determines that the person used a firearm in any way during commission of the crime, the court may order that the person is prohibited from possessing any type of firearm for any period longer than three years or for the remainder of the person's life. A person who violates this paragraph is guilty of a gross misdemeanor. At the time of the conviction, the court shall inform the defendant for how long the defendant is prohibited from possessing a firearm and that it is a gross misdemeanor to violate this paragraph. The failure of the court to provide this information to a defendant does not affect the applicability of the firearm possession prohibition or the gross misdemeanor penalty to that defendant.\n(b) Except as otherwise provided in paragraph (a), when a person is convicted of harassment or stalking under this section, the court shall inform the defendant that the defendant is prohibited from possessing a firearm for three years from the date of conviction and that it is a gross misdemeanor offense to violate this prohibition. The failure of the court to provide this information to a defendant does not affect the applicability of the firearm possession prohibition or the gross misdemeanor penalty to that defendant.\n(c) Except as otherwise provided in paragraph (a), a person is not entitled to possess a pistol if the person has been convicted after August 1, 1996, of harassment or stalking under this section, or to possess a firearm if the person has been convicted on or after August 1, 2014, of harassment or stalking under this section, unless three years have elapsed from the date of conviction and, during that time, the person has not been convicted of any other violation of this section. Property rights may not be abated but access may be restricted by the courts. A person who possesses a firearm in violation of this paragraph is guilty of a gross misdemeanor.\n(d) If the court determines that a person convicted of harassment or stalking under this section owns or possesses a firearm and used it in any way during the commission of the crime, it shall order that the firearm be summarily forfeited under section 609.5316, subdivision 3.\n(e) Except as otherwise provided in paragraphs (d) and (g), when a person is convicted of harassment or stalking under this section, the court shall order the defendant to transfer any firearms that the person possesses, within three business days, to a federally licensed firearms dealer, a law enforcement agency, or a third party who may lawfully receive them. The transfer may be permanent or temporary. A temporary firearm transfer only entitles the receiving party to possess the firearm. A temporary transfer does not transfer ownership or title. A defendant may not transfer firearms to a third party who resides with the defendant. If a defendant makes a temporary transfer, a federally licensed firearms dealer or law enforcement agency may charge the defendant a reasonable fee to store the person's firearms and may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified via certified mail prior to disposal of abandoned firearms. For temporary firearms transfers under this paragraph, a law enforcement agency, federally licensed firearms dealer, or third party shall exercise due care to preserve the quality and function of the transferred firearms and shall return the transferred firearms to the person upon request after the expiration of the prohibiting time period imposed under this subdivision, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The return of temporarily transferred firearms to a defendant shall comply with state and federal law. If a defendant permanently transfers the defendant's firearms to a law enforcement agency, the agency is not required to compensate the defendant and may charge the defendant a reasonable processing fee. A law enforcement agency is not required to accept a person's firearm under this paragraph. The court shall order that the person surrender all permits to carry and purchase firearms to the sheriff.\n(f) A defendant who is ordered to transfer firearms under paragraph (e) must file proof of transfer as provided for in this paragraph. If the transfer is made to a third party, the third party must sign an affidavit under oath before a notary public either acknowledging that the defendant permanently transferred the defendant's firearms to the third party or agreeing to temporarily store the defendant's firearms until such time as the defendant is legally permitted to possess firearms. The affidavit shall indicate the serial number, make, and model of all firearms transferred by the defendant to the third party. The third party shall acknowledge in the affidavit that the third party may be held criminally and civilly responsible under section 624.7144 if the defendant gains access to a transferred firearm while the firearm is in the custody of the third party. If the transfer is to a law enforcement agency or federally licensed firearms dealer, the law enforcement agency or federally licensed firearms dealer shall provide proof of transfer to the defendant. The proof of transfer must specify whether the firearms were permanently or temporarily transferred and include the name of the defendant, date of transfer, and the serial number, make, and model of all transferred firearms. The defendant shall provide the court with a signed and notarized affidavit or proof of transfer as described in this section within two business days of the firearms transfer. The court shall seal affidavits and proofs of transfer filed pursuant to this paragraph.\n(g) When a person is convicted of harassment or stalking under this section, the court shall determine by a preponderance of the evidence if the person poses an imminent risk of causing another person substantial bodily harm. Upon a finding of imminent risk, the court shall order that the local law enforcement agency take immediate possession of all firearms in the person's possession. The local law enforcement agency shall exercise due care to preserve the quality and function of the defendant's firearms and shall return the firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The local law enforcement agency shall, upon written notice from the person, transfer the firearms to a federally licensed firearms dealer or a third party who may lawfully receive them. Before a local law enforcement agency transfers a firearm under this paragraph, the agency shall require the third party or federally licensed firearms dealer receiving the firearm to submit an affidavit or proof of transfer that complies with the requirements for affidavits or proofs of transfer established in paragraph (f). The agency shall file all affidavits or proofs of transfer received with the court within two business days of the transfer. The court shall seal all affidavits or proofs of transfer filed pursuant to this paragraph. A federally licensed firearms dealer or third party who accepts a firearm transfer pursuant to this paragraph shall comply with paragraphs (e) and (f) as if accepting transfer from the defendant. If the law enforcement agency does not receive written notice from the defendant within three business days, the agency may charge a reasonable fee to store the defendant's firearms. A law enforcement agency may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified via certified mail prior to disposal of abandoned firearms.",
	"repealed": false
}