{
	"id": "609A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/609A.03",
	"title": "609A.03 PETITION TO EXPUNGE CRIMINAL RECORDS.",
	"text": "An individual who is the subject of a criminal record who is seeking the expungement of the record shall file a petition under this section and pay a filing fee in the amount required under section 357.021, subdivision 2, clause (1). The filing fee may be waived in cases of indigency and shall be waived in the cases described in section 609A.02, subdivision 3, paragraph (a), clause (1).\n(a) A petition for expungement shall be signed under oath by the petitioner and shall state the following:\n(1) the petitioner's full name and all other legal names or aliases by which the petitioner has been known at any time;\n(2) the petitioner's date of birth;\n(3) all of the petitioner's addresses from the date of the offense or alleged offense in connection with which an expungement order is sought, to the date of the petition;\n(4) why expungement is sought, if it is for employment or licensure purposes, the statutory or other legal authority under which it is sought, and why it should be granted;\n(5) the details of the offense or arrest for which expungement is sought, including the date and jurisdiction of the occurrence, either the names of any victims or that there were no identifiable victims, whether there is a current order for protection, restraining order, or other no contact order prohibiting the petitioner from contacting the victims or whether there has ever been a prior order for protection or restraining order prohibiting the petitioner from contacting the victims, the court file number, and the date of conviction or of dismissal;\n(6) in the case of a conviction, what steps the petitioner has taken since the time of the offense toward personal rehabilitation, including treatment, work, or other personal history that demonstrates rehabilitation;\n(7) petitioner's criminal conviction record indicating all convictions for misdemeanors, gross misdemeanors, or felonies in this state, and for all comparable convictions in any other state, federal court, or foreign country, whether the convictions occurred before or after the arrest or conviction for which expungement is sought;\n(8) petitioner's criminal charges record indicating all prior and pending criminal charges against the petitioner in this state or another jurisdiction, including all criminal charges that have been continued for dismissal or stayed for adjudication, or have been the subject of pretrial diversion; and\n(9) all prior requests by the petitioner, whether for the present offense or for any other offenses, in this state or any other state or federal court, for pardon, return of arrest records, or expungement or sealing of a criminal record, whether granted or not, and all stays of adjudication or imposition of sentence involving the petitioner.\n(b) If there is a current order for protection, restraining order, or other no contact order prohibiting the petitioner from contacting the victims or there has ever been a prior order for protection or restraining order prohibiting the petitioner from contacting the victims, the petitioner shall attach a copy of the order to the petition.\n(a) The petitioner shall serve by mail the petition for expungement and a proposed expungement order on the prosecutorial office that had jurisdiction over the offense for which expungement is sought and all other state and local government agencies and jurisdictions whose records would be affected by the proposed order. The petitioner shall also serve by mail the attorney for each agency and jurisdiction.\n(b) The prosecutorial office that had jurisdiction over the offense for which expungement is sought shall serve by mail the petition for expungement and a proposed expungement order on any victims of the offense for which expungement is sought who have requested notice of expungement pursuant to section 611A.06. Service under this paragraph does not constitute a violation of an existing order for protection, restraining order, or other no contact order.\n(c) The prosecutorial office's notice to victims of the offense under this subdivision must specifically inform the victims of the victims' right to be present and to submit an oral or written statement at the expungement hearing described in subdivision 4.\n(d) An agency or jurisdiction that is served with a petition under this subdivision may submit to the court private or confidential data on the petitioner that the agency or jurisdiction determines is necessary to respond to the petition. As part of the submission, the agency or jurisdiction shall inform the court and the petitioner that the submission contains private or confidential data that may become accessible to the public as part of the expungement proceeding. The petitioner may, at the time of filing the petition or after that time, file a request with the court to seal the private or confidential data that are submitted by the agency or jurisdiction.\nA hearing on the petition shall be held no sooner than 60 days after service of the petition. A victim of the offense for which expungement is sought has a right to submit an oral or written statement to the court at the time of the hearing describing the harm suffered by the victim as a result of the crime and the victim's recommendation on whether expungement should be granted or denied. The judge shall consider the victim's statement when making a decision.\n(a) Except as otherwise provided by paragraph (b), expungement of a criminal record under this section is an extraordinary remedy to be granted only upon clear and convincing evidence that it would yield a benefit to the petitioner commensurate with the disadvantages to the public and public safety of:\n(1) sealing the record; and\n(2) burdening the court and public authorities to issue, enforce, and monitor an expungement order.\n(b) Except as otherwise provided by this paragraph, if the petitioner is petitioning for the sealing of a criminal record under section 609A.02, subdivision 3, paragraph (a), clause (1) or (2), the court shall grant the petition to seal the record unless the agency or jurisdiction whose records would be affected establishes by clear and convincing evidence that the interests of the public and public safety outweigh the disadvantages to the petitioner of not sealing the record.\n(c) In making a determination under this subdivision, the court shall consider:\n(1) the nature and severity of the underlying crime, the record of which would be sealed;\n(2) the risk, if any, the petitioner poses to individuals or society;\n(3) the length of time since the crime occurred;\n(4) the steps taken by the petitioner toward rehabilitation following the crime;\n(5) aggravating or mitigating factors relating to the underlying crime, including the petitioner's level of participation and context and circumstances of the underlying crime;\n(6) the reasons for the expungement, including the petitioner's attempts to obtain employment, housing, or other necessities;\n(7) the petitioner's criminal record;\n(8) the petitioner's record of employment and community involvement;\n(9) the recommendations of interested law enforcement, prosecutorial, and corrections officials;\n(10) the recommendations of victims or whether victims of the underlying crime were minors;\n(11) the amount, if any, of restitution outstanding, past efforts made by the petitioner toward payment, and the measures in place to help ensure completion of restitution payment after expungement of the record if granted; and\n(12) other factors deemed relevant by the court.\n(d) Notwithstanding section 13.82, 13.87, or any other law to the contrary, if the court issues an expungement order it may require that the criminal record be sealed, the existence of the record not be revealed, and the record not be opened except as required under subdivision 7. Records must not be destroyed or returned to the subject of the record.\n(e) Information relating to a criminal history record of an employee, former employee, or tenant that has been expunged before the occurrence of the act giving rise to the civil action may not be introduced as evidence in a civil action against a private employer or landlord or its employees or agents that is based on the conduct of the employee, former employee, or tenant.\nAn order expunging the record of a conviction for a crime of violence as defined in section 624.712, subdivision 5, must provide that the person is not entitled to ship, transport, possess, or receive a firearm for the remainder of the person's lifetime. Any person whose record of conviction is expunged under this section and who thereafter receives a relief of disability under United States Code, title 18, section 925, or whose ability to possess firearms has been restored under section 609.165, subdivision 1d, is not subject to the restriction in this subdivision.\nIf the court orders the sealing of the record of proceedings under section 152.18, the effect of the order shall be to restore the person, in the contemplation of the law, to the status the person occupied before the arrest, indictment, or information. The person shall not be held guilty of perjury or otherwise of giving a false statement if the person fails to acknowledge the arrest, indictment, information, or trial in response to any inquiry made for any purpose.\nIf the court finds, under subdivision 5, paragraph (c), clause (5), that the context and circumstances of the underlying crime indicate a nexus between the criminal record to be expunged and the person's status as a crime victim, then the effect of the court order to seal the record of the proceedings shall be to restore the person, in the contemplation of the law, to the status the person occupied before the arrest, indictment, or information. The person shall not be guilty of perjury or otherwise of giving a false statement if the person fails to acknowledge the arrest, indictment, information, or trial in response to any inquiry made for any purpose. The court may request a sworn statement from a staff member of a state-funded victim services organization or a licensed health care provider as evidence to support a determination under subdivision 5.\n(a) Upon issuance of an expungement order related to a charge supported by probable cause, the DNA samples and DNA records held by the Bureau of Criminal Apprehension and collected under authority other than section 299C.105, shall not be sealed, returned to the subject of the record, or destroyed.\n(b) Notwithstanding the issuance of an expungement order:\n(1) an expunged record may be opened for purposes of a criminal investigation, prosecution, or sentencing, upon an ex parte court order;\n(2) an expunged record of a conviction may be opened for purposes of evaluating a prospective employee in a criminal justice agency without a court order; and\n(3) an expunged record of a conviction may be opened for purposes of a background study under section 245C.08 unless the court order for expungement is directed specifically to the commissioner of human services.\nUpon request by law enforcement, prosecution, or corrections authorities, an agency or jurisdiction subject to an expungement order shall inform the requester of the existence of a sealed record and of the right to obtain access to it as provided by this paragraph. For purposes of this section, a \"criminal justice agency\" means courts or a government agency that performs the administration of criminal justice under statutory authority.\n(c) This subdivision applies to expungement orders subject to its limitations and effective before January 1, 2015.\n(a) Upon issuance of an expungement order related to a charge supported by probable cause, the DNA samples and DNA records held by the Bureau of Criminal Apprehension and collected under authority other than section 299C.105 shall not be sealed, returned to the subject of the record, or destroyed.\n(b) Notwithstanding the issuance of an expungement order:\n(1) except as provided in clause (2), an expunged record may be opened, used, or exchanged between criminal justice agencies without a court order for the purposes of initiating, furthering, or completing a criminal investigation or prosecution or for sentencing purposes or providing probation or other correctional services;\n(2) when a criminal justice agency seeks access to a record that was sealed under section 609A.02, subdivision 3, paragraph (a), clause (1), after an acquittal or a court order dismissing for lack of probable cause, for purposes of a criminal investigation, prosecution, or sentencing, the requesting agency must obtain an ex parte court order after stating a good-faith basis to believe that opening the record may lead to relevant information;\n(3) an expunged record of a conviction may be opened for purposes of evaluating a prospective employee in a criminal justice agency without a court order;\n(4) an expunged record of a conviction may be opened for purposes of a background study under section 245C.08 unless the commissioner had been properly served with notice of the petition for expungement and the court order for expungement is directed specifically to the commissioner of human services following proper service of a petition, or following proceedings under section 609A.017, 609A.025, or 609A.035 upon service of an order to the commissioner of human services;\n(5) an expunged record of a conviction may be opened for purposes of a background check required under section 122A.18, subdivision 8, unless the court order for expungement is directed specifically to the Professional Educator Licensing and Standards Board;\n(6) the court may order an expunged record opened upon request by the victim of the underlying offense if the court determines that the record is substantially related to a matter for which the victim is before the court;\n(7) a prosecutor may request, and the district court shall provide, certified records of conviction for a record expunged pursuant to sections 609A.015, 609A.017, 609A.02, 609A.025, and 609A.035, and the certified records of conviction may be disclosed and introduced in criminal court proceedings as provided by the rules of court and applicable law; and\n(8) the subject of an expunged record may request, and the court shall provide, certified or uncertified records of conviction for a record expunged pursuant to sections 609A.015, 609A.017, 609A.02, 609A.025, and 609A.035.\n(c) An agency or jurisdiction subject to an expungement order shall maintain the record in a manner that provides access to the record by a criminal justice agency under paragraph (b), clause (1) or (2), but notifies the recipient that the record has been sealed. The Bureau of Criminal Apprehension shall notify the commissioner of human services or the Professional Educator Licensing and Standards Board of the existence of a sealed record and of the right to obtain access under paragraph (b), clause (4) or (5). Upon request, the agency or jurisdiction subject to the expungement order shall provide access to the record to the commissioner of human services or the Professional Educator Licensing and Standards Board under paragraph (b), clause (4) or (5).\n(d) An expunged record that is opened or exchanged under this subdivision remains subject to the expungement order in the hands of the person receiving the record.\n(e) A criminal justice agency that receives an expunged record under paragraph (b), clause (1) or (2), must maintain and store the record in a manner that restricts the use of the record to the investigation, prosecution, or sentencing for which it was obtained.\n(f) For purposes of this section, a \"criminal justice agency\" means a court or government agency that performs the administration of criminal justice under statutory authority.\n(g) This subdivision applies to expungement orders subject to its limitations and effective on or after January 1, 2015, and grants of expungement relief issued on or after January 1, 2025.\n(a) The court administrator shall send a copy of an expungement order to each agency and jurisdiction whose records are affected by the terms of the order and send a letter to the petitioner identifying each agency that received the order.\n(b) If requested in the petition, each agency and jurisdiction receiving the order must send a letter to the petitioner at an address provided in the petition confirming the receipt of the expungement order and that the record has been expunged.\n(c) Data on the petitioner in a letter sent under this subdivision are private data on individuals as defined in section 13.02.\nAn expungement order issued under this section shall be stayed automatically for 60 days after the order is filed and, if the order is appealed, during the appeal period. A person or an agency or jurisdiction whose records would be affected by the order may appeal the order within 60 days of service of notice of filing of the order. An agency or jurisdiction or its officials or employees need not file a cost bond or supersedeas bond in order to further stay the proceedings or file an appeal.",
	"repealed": false
}