{
	"id": "97A.157",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.157",
	"title": "97A.157 1854 TREATY AREA AGREEMENT.",
	"text": "The purpose of this section is to effectuate resolution of issues in dispute between the state of Minnesota and the Grand Portage, Bois Forte, and Fond du Lac Bands of Chippewa Indians that relate to hunting, fishing, trapping, and gathering in the Ceded Area described in the September 30, 1854, treaty between the Lake Superior Chippewa and the government of the United States. This treaty was ratified by the United States Senate on January 10, 1855, and was recognized and affirmed in a subsequent treaty between the Bois Forte Band of Chippewa Indians and the government of the United States dated April 7, 1866, and ratified by the United States Senate on April 26, 1866. The enforcement of certain rights claimed by Lake Superior Chippewas under these treaties has been sought in a civil action brought in the United States District Court for the District of Minnesota, Fourth Division, that is entitled Grand Portage Band of Chippewas, et al. v. State of Minnesota, et al., Civ. No. 4-85-1090. The state of Minnesota desires to settle all outstanding matters relating to the above dispute.\nThe parties to the above named civil action have negotiated a settlement of the dispute and have filed an executed copy of their \"Memorandum of Agreement\" with the court on February 16, 1988.\nThe state of Minnesota, by the enactment of this section, ratifies and affirms the Memorandum of Agreement, provided the agreement is amended by July 1, 1988, by the addition of the following language: \"Any party in the Memorandum of Agreement may cancel this agreement upon one year's written notice to the other parties.\"\nThe commissioner of natural resources, on behalf of the state of Minnesota, shall take all actions, by rule or otherwise, necessary to carry out the duties and obligations of the state of Minnesota arising from the Memorandum of Agreement. Powers and duties provided by this subdivision apply to payment of money under the Memorandum of Agreement only to the extent and to the amount specifically appropriated by the legislature to carry out the terms of the Memorandum of Agreement.",
	"repealed": false
}