{
	"id": "142A.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.76",
	"title": "142A.76 OFFICE OF RESTORATIVE PRACTICES.",
	"text": "As used in this section, \"restorative practices\" means a practice within a program or policy that incorporates core restorative principles, including but not limited to voluntariness, prioritization of agreement by the people closest to the harm on what is needed to repair the harm, reintegration into the community, honesty, and respect. Restorative practices include but are not limited to victim-offender conferences, family group conferences, circles, community conferences, and other similar victim-centered practices. Restorative practices funded under this statute may be used at any point including before court involvement, after court involvement, to prevent court involvement, or in conjunction with court involvement. Restorative practices are rooted in community values and create meaningful outcomes that may include but are not limited to:\n(1) establishing and meeting goals related to increasing connection to community, restoring relationships, and increasing empathy; considering all perspectives involved; and taking responsibility for impact of actions by all parties involved;\n(2) addressing the needs of those who have been harmed;\n(3) recognizing and addressing the underlying issues of behavior;\n(4) engaging with those most directly affected by an incident and including community members that reflect the diversity of the individual's environment;\n(5) determining the appropriate responses to specific incidents through the use of a collaborative process;\n(6) providing solutions and approaches that affirm and are tailored to specific cultures; and\n(7) implementing policies and procedures that are informed by the science of the social, emotional, and cognitive development of children.\nThe Office of Restorative Practices is established within the Department of Public Safety. The Office of Restorative Practices shall have the powers and duties described in this section.\n(a) The commissioner of public safety shall appoint a director of the Office of Restorative Practices. The director should have qualifications that include or are similar to the following:\n(1) experience in the many facets of restorative justice and practices such as peacemaking circles, sentencing circles, community conferencing, community panels, and family group decision making;\n(2) experience in victim-centered and trauma-informed practices;\n(3) knowledge of the range of social problems that bring children and families to points of crisis such as poverty, racism, unemployment, and unequal opportunity;\n(4) knowledge of the many ways youth become involved in other systems such as truancy, juvenile delinquency, and child protection; and\n(5) understanding of educational barriers.\n(b) The director shall hire additional staff to perform the duties of the Office of Restorative Practices. The staff shall be in the classified service of the state and their compensation shall be established pursuant to chapter 43A.\n(a) The Office of Restorative Practices shall promote the use of restorative practices across multiple disciplines, including but not limited to:\n(1) pretrial diversion programs established pursuant to section 388.24;\n(2) delinquency, criminal justice, child welfare, and education systems; and\n(3) community violence prevention practices.\n(b) The Office of Restorative Practices shall collaborate with Tribal communities, counties, multicounty agencies, other state agencies, nonprofit agencies, and other jurisdictions, and with existing restorative practices initiatives in those jurisdictions to establish new restorative practices initiatives, support existing restorative practices initiatives, and identify effective restorative practices initiatives.\n(c) The Office of Restorative Practices shall encourage collaboration between jurisdictions by creating a statewide network, led by restorative practitioners, to share effective methods and practices.\n(d) The Office of Restorative Practices shall create a statewide directory of restorative practices initiatives. The office shall make this directory available to all restorative practices initiatives, counties, multicounty agencies, nonprofit agencies, and Tribes in order to facilitate referrals to restorative practices initiatives and programs.\n(e) The Office of Restorative Practices shall work throughout the state to build capacity for the use of restorative practices in all jurisdictions and shall encourage every county to have at least one available restorative practices initiative.\n(f) The Office of Restorative Practices shall engage restorative practitioners in discerning ways to measure the effectiveness of restorative efforts throughout the state.\n(g) The Office of Restorative Practices shall oversee the coordination and establishment of local restorative practices advisory committees. The office shall oversee compliance with the conditions of this funding program. If a complaint or concern about a local advisory committee or a grant recipient is received, the Office of Restorative Practices shall exercise oversight as provided in this section.\n(h) The Office of Restorative Practices shall provide information to local restorative practices advisory committees, or restorative practices initiatives in Tribal communities and governments, counties, multicounty agencies, other state agencies, and other jurisdictions about best practices that are developmentally tailored to youth, trauma-informed, and healing-centered, and provide technical support. Providing information includes but is not limited to sharing data on successful practices in other jurisdictions, sending notification about available training opportunities, and sharing known resources for financial support. The Office of Restorative Practices shall also provide training and technical support to local restorative practices advisory committees. Training includes but is not limited to the use and scope of restorative practices, victim-centered restorative practices, and trauma-informed care.\n(i) The Office of Restorative Practices shall annually establish minimum requirements for the grant application process.\n(j) The Office of Restorative Practices shall work with Tribes, counties, multicounty agencies, and nonprofit agencies throughout the state to educate those entities about the application process for grants and encourage applications.\n(a) Within available appropriations, the director shall award grants to establish and support restorative practices initiatives and for the restitution program described in section 299A.955. An approved applicant must receive a grant of up to $500,000 each year.\n(b) On an annual basis, the Office of Restorative Practices shall establish a minimum number of applications that must be received during the application process. If the minimum number of applications is not received, the office must reopen the application process.\n(c) Grants may be awarded to private and public nonprofit agencies; local units of government, including cities, counties, and townships; local educational agencies; and Tribal governments. A restorative practices advisory committee may support multiple entities applying for grants based on community needs, the number of youth and families in the jurisdiction, and the number of restorative practices available to the community. Budgets supported by grant funds can include contracts with partner agencies.\n(d) Applications must include the following:\n(1) a list of willing restorative practices advisory committee members;\n(2) letters of support from potential restorative practices advisory committee members;\n(3) a description of the planning process that includes:\n(i) a description of the origins of the initiative, including how the community provided input; and\n(ii) an estimated number of participants to be served; and\n(4) a formal document containing a project description that outlines the proposed goals, activities, and outcomes of the initiative including, at a minimum:\n(i) a description of how the initiative meets the minimum eligibility requirements of the grant;\n(ii) the roles and responsibilities of key staff assigned to the initiative;\n(iii) identification of any key partners, including a summary of the roles and responsibilities of those partners;\n(iv) a description of how volunteers and other community members are engaged in the initiative; and\n(v) a plan for evaluation and data collection.\n(e) In determining the appropriate amount of each grant, the Office of Restorative Practices shall consider the number of individuals likely to be served by the local restorative practices initiative.\n(a) Restorative practices advisory committees must include:\n(1) a judge of the judicial district that will be served by the restorative practices initiative;\n(2) the county attorney of a county that will be served by the restorative practices initiative or a designee;\n(3) the chief district public defender in the district that will be served by the local restorative justice program or a designee;\n(4) a representative from the children's unit of a county social services agency assigned to the area that will be served by the restorative practices initiative;\n(5) a representative from the local probation department or community corrections agency that works with youth in the area that will be served by the restorative practices initiative;\n(6) a representative from a local law enforcement agency that operates in the area that will be served by the restorative practices initiative;\n(7) a school administrator or designee from a school or schools that operate in the area that will be served by the restorative practices initiative;\n(8) multiple community members that reflect the racial, socioeconomic, and other diversity of the population of a county that will be served by the local restorative justice program and the individuals most frequently involved in the truancy, juvenile offender, and juvenile safety and placement systems;\n(9) restorative practitioners, including restorative practitioners from within the community if available and, if not, from nearby communities;\n(10) parents, youth, and justice-impacted participants; and\n(11) at least one representative from a victims advocacy group.\n(b) Community members described in paragraph (a), clause (8), must make up at least one-third of the restorative practices advisory committee.\n(c) Community members, parents, youth, and justice-impacted participants participating in the advisory committee may receive a per diem from grant funds in the amount determined by the General Services Administration.\n(d) The restorative practices advisory committees must utilize restorative practices in their decision-making process and come to consensus when developing, expanding, and maintaining restorative practices criteria and referral processes for their communities.\n(e) Restorative practices advisory committees shall be responsible for establishing eligibility requirements for referrals to the local restorative practices initiative. Once restorative practices criteria and referral processes are developed, children, families, and cases, depending upon the point of prevention or intervention, must be referred to the local restorative practices initiatives or programs that serve the county, local community, or Tribal community where the child and family reside.\n(f) Referrals may be made under circumstances, including but not limited to:\n(1) as an alternative to arrest as outlined in section 260B.1755;\n(2) for a juvenile petty offense;\n(3) for a juvenile traffic offense;\n(4) for a juvenile delinquency offense, including before and after a delinquency petition has been filed;\n(5) for a child protection case, including before and after adjudication;\n(6) for a children's mental health case;\n(7) for a juvenile status offense, including but not limited to truancy or running away;\n(8) for substance use issues;\n(9) for situations involving transition to or from the community; and\n(10) through self-referral.\n(a) Complaints by restorative practices advisory committee members, community members, restorative practices initiatives, or restorative practices practitioners regarding concerns about grant recipients may be made to the Office of Restorative Practices.\n(b) The Office of Restorative Practices may prescribe the methods by which complaints to the office are to be made, reviewed, and acted upon.\n(c) The Office of Restorative Practices shall establish and use a restorative process to respond to complaints so that grant recipients are being held to their agreed upon responsibilities and continue to meet the minimum eligibility requirements for grants to local restorative practices initiatives for the duration of the grant.\nBy February 15 of each year, the director shall report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over public safety, human services, and education, on the work of the Office of Restorative Practices, any grants issued pursuant to this section, and the status of local restorative practices initiatives in the state that were reviewed in the previous year.",
	"repealed": false
}