{
	"id": "204B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.32",
	"title": "204B.32 ELECTION EXPENSES; PAYMENT.",
	"text": "(a) The secretary of state shall pay the compensation for presidential electors and all necessary expenses incurred by the secretary of state in connection with elections.\n(b) The counties shall pay the compensation prescribed in section 204B.31, clauses (2) and (3), the cost of printing the state general election ballots when machines are used, the state partisan primary ballots, and the state and county nonpartisan primary ballots, all necessary expenses incurred by county auditors in connection with elections, and the expenses of special county elections.\n(c) Subject to subdivision 2, the municipalities shall pay the compensation prescribed for election judges and sergeants at arms, the cost of printing the municipal ballots, providing ballot boxes, providing and equipping polling places and all necessary expenses of the municipal clerks in connection with elections, except special county elections.\n(d) The school districts shall pay the compensation prescribed for election judges and sergeants-at-arms, the cost of printing the school district ballots, providing ballot boxes, providing and equipping polling places and all necessary expenses of the school district clerks in connection with school district elections not held in conjunction with state elections. When school district elections are held in conjunction with state elections, the school district shall pay the costs of printing the school district ballots, providing ballot boxes and all necessary expenses of the school district clerk.\nAll disbursements under this section shall be presented, audited, and paid as in the case of other public expenses.\nThe secretary of state shall develop procedures for the allocation of election expenses among counties, municipalities, and school districts for elections that are held concurrently. The following expenses must be included in the procedures: salaries of election judges; postage for absentee ballots and applications; preparation of polling places; preparation and testing of electronic voting systems; ballot preparation; publication of election notices, including the notice required by section 204D.16; transportation of ballots and election supplies; and compensation for administrative expenses of the county auditor, municipal clerk, or school district clerk.",
	"repealed": false
}