{
	"id": "524.5-113",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-113",
	"title": "524.5-113 NOTICE.",
	"text": "(a) Except for notice for which specific requirements are otherwise provided in this article or as otherwise ordered by the court for good cause, notice of a hearing on a petition is required for all petitions in the manner prescribed by this section. The petitioner shall give notice of the time and place of the hearing to all interested persons. Subject to paragraph (f), notice must be given by mail postmarked at least 14 days before the hearing.\n(b) Proof of notice must be made before or at the hearing and filed in the proceeding.\n(c) A notice under this article must be given in plain language.\n(d) If a patient of a state hospital, regional center, or any state-operated service has a guardianship or conservatorship established, modified, or terminated, the head of the state hospital, regional center, or state-operated service shall be notified. The notice shall require the institution to advise the court of the existence, if known, of a health care directive as defined in section 145C.01, executed by the proposed person subject to guardianship, incapacitated person, or person subject to conservatorship, a living will executed under chapter 145B, or any other similar document executed in another state and enforceable under the laws of this state. If a person subject to guardianship, incapacitated person, or person subject to conservatorship is under the guardianship or conservatorship of the commissioner of human services as developmentally disabled or dependent and neglected or is under the temporary custody of the commissioner of human services, the court shall notify the commissioner of human services if the public guardianship or conservatorship is established, modified, or terminated.\n(e) If a conservator is required to file a bond pursuant to section 524.5-415, notice of any proceeding seeking a surcharge of any interested party must be sent or delivered to the surety at the address shown in the court records at the place where the bond is filed and to any other address then known to the petitioner.\n(f) Except where personal service is required by statute for the petition to appoint a guardian under section 524.5-308 or conservator under section 524.5-404, service of all documents and notices under this chapter may, and where required by supreme court rule or order shall, be made by electronic means other than facsimile transmission if authorized by rule or order of the supreme court and if service is made in accordance with the rule or order.\n(g) An interested person may notify the court in writing that the interested person does not wish to receive copies of notices required under any provision of this article after which time neither the court nor any other person is required to give notice to any person who has waived notice.\n(h) After an initial hearing on any guardianship or conservatorship matter, the court may limit the notices and reports required under any provision of this article to the persons determined by the court.",
	"repealed": false
}