{
	"id": "179A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.14",
	"title": "179A.14 COLLECTIVE BARGAINING AGREEMENT; NEGOTIATION PROCEDURES.",
	"text": "(a) First agreement. When an exclusive representative desires to meet and negotiate an initial agreement establishing terms and conditions of employment, the exclusive representative shall give written notice to the employer and the commissioner. If the exclusive representative has not been certified by the commissioner under section 179A.12 within one year of such written notice, the employer has ten days from receipt of the notice to object to the demand to negotiate by petitioning the commissioner to investigate either the appropriateness of the unit or the question of representation that the employer believes is raised by the demand, or both. If the employer does not object within ten days, the employer accepts the obligations of section 179A.07, subdivision 2, and the balance of this chapter with regard to such exclusive representative. If the employer does object by filing a petition under this section, the commissioner shall investigate the petition under section 179A.12, subdivision 5.\n(b) Subsequent agreement. When a party to a contract desires to meet and negotiate an agreement subsequent to the initial agreement, the party shall give written notice to the other party and to the commissioner at least 60 days before the termination date of the existing contract. If a party fails to give the required 60-day notice, the party is subject to a fine of $10 per day for each day the notice is late. The fine for late notice may be waived at the discretion of the commissioner if the commissioner finds that the failure to give timely notice did not prejudice the commissioner or the other party in the fulfillment of their responsibilities and duties. The fine for late notice is the only penalty for late notice under this paragraph.\nPublic employers and exclusive representatives of employees may voluntarily participate in joint negotiations in similar or identical appropriate units. It is the policy of sections 179A.01 to 179A.25 to encourage areawide negotiations, and the commissioner shall encourage it when possible.\nAll negotiations, mediation sessions, and hearings between public employers and public employees or their respective representatives are public meetings except when otherwise provided by the commissioner.",
	"repealed": false
}