{
	"id": "136A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.15",
	"title": "136A.15 DEFINITIONS.",
	"text": "For purposes of sections 136A.15 to 136A.1702, the terms defined in this section have the meanings given them.\nMS 2018 [Repealed, 2019 c 64 art 2 s 45]\n[Repealed, 2014 c 149 s 75]\n[Repealed, 2014 c 149 s 75]\n[Repealed, 2014 c 149 s 75]\n\"Eligible institution\" means an institution that meets the eligibility requirements under section 136A.155.\nMS 2018 [Repealed, 2019 c 64 art 2 s 45]\n\"Eligible student\" means a student who is officially registered or accepted for enrollment at an eligible institution in Minnesota or a Minnesota resident who is officially registered as a student or accepted for enrollment at an eligible institution in another state. Non-Minnesota residents are eligible students if they are enrolled or accepted for enrollment in a minimum of one course of at least 30 days in length during the academic year that requires physical attendance at an eligible institution located in Minnesota. Non-Minnesota resident students enrolled exclusively during the academic year in correspondence courses or courses offered over the Internet are not eligible students. Non-Minnesota resident students not physically attending classes in Minnesota due to enrollment in a study abroad program for 12 months or less are eligible students. Non-Minnesota residents enrolled in study abroad programs exceeding 12 months are not eligible students. An eligible student, for section 136A.1701, means a student who gives informed consent authorizing the disclosure of data specified in section 136A.162, paragraph (c), to a consumer credit reporting agency.\n\"Minnesota resident\" means a student who meets one of the following conditions:\n(1) a student who has resided in Minnesota for purposes other than postsecondary education for at least 12 months without being enrolled at a postsecondary educational institution for more than five credits in any term;\n(2) a dependent student whose parent or legal guardian resides in Minnesota at the time the student applies;\n(3) a student who graduated from a Minnesota high school, if the student was a resident of Minnesota during the student's period of attendance at the Minnesota high school and the student is physically attending a Minnesota postsecondary educational institution; or\n(4) a student who, after residing in the state for a minimum of one year, earned a high school equivalency certificate in Minnesota.",
	"repealed": false
}