{
	"id": "149A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.08",
	"title": "149A.08 CEASE AND DESIST ORDER.",
	"text": "In addition to any other remedy provided by law, the regulatory agency may issue a cease and desist order to:\n(1) stop a person from violating or threatening to violate any law, rule, order, stipulation agreement, settlement, compliance agreement, license, or permit which the regulatory agency is empowered to regulate, enforce, or issue; or\n(2) prohibit a funeral provider from engaging in the sale of preneed funeral goods, funeral services, burial site goods, or burial site services if the funeral provider has been found in violation of any provision of this chapter.\nThe cease and desist order must be in writing, state the specific reason for its issuance, and give notice of the right to request a hearing under sections 14.57 to 14.62.\n(a) This subdivision applies to cease and desist orders issued pursuant to subdivision 1, clause (2).\n(b) In addition to the requirements of subdivision 2, a cease and desist order must also specify that the hearing to which the funeral provider has a right occurs, if requested, before the order goes into effect and that a timely request for a hearing automatically stays the cease and desist order.\n(c) A request for a hearing must be in writing, must be delivered to the regulatory agency by certified mail within 20 calendar days after the funeral provider receives the order, and must specifically state the reasons for seeking review of the order. If the funeral provider fails to request a hearing in writing within 20 calendar days of receipt of the order, the cease and desist order becomes the final order of the regulatory agency. If a funeral provider makes a timely request for a hearing, the cease and desist order is automatically stayed pending the outcome of the hearing. The regulatory agency must initiate a hearing within 30 calendar days from the date of receiving the written request for hearing. The hearing shall be conducted pursuant to sections 14.57 to 14.62. No earlier than ten calendar days but within 30 calendar days of receiving the presiding administrative law judge's report, the regulatory agency shall issue a final order modifying, vacating, or making permanent the cease and desist order as the facts require.\nThis subdivision applies to cease and desist orders issued pursuant to subdivision 1, clause (1). A request for hearing must be in writing, delivered to the regulatory agency by certified mail within 20 calendar days after the receipt of the cease and desist order, and specifically state the reasons for seeking review of the order. The regulatory agency must initiate a hearing within 30 calendar days from the date of receipt of the written request for hearing. The hearing shall be conducted pursuant to sections 14.57 to 14.62. No earlier than ten calendar days but within 30 calendar days of receipt of the presiding administrative law judge's report, the regulatory agency shall issue a final order modifying, vacating, or making permanent the cease and desist order as the facts require. If, within 20 calendar days of receipt of the cease and desist order, the subject of the order fails to request a hearing in writing, the cease and desist order becomes the final order of the regulatory agency.\nThis subdivision applies to cease and desist orders issued pursuant to subdivision 1, clause (1). When a request for a stay accompanies a timely hearing request, the regulatory agency may, in the regulatory agency's discretion, grant the stay. If the regulatory agency does not grant a requested stay, the regulatory agency shall refer the request to the Office of Administrative Hearings within three working days from the receipt of the request. Within ten calendar days after receiving the request from the regulatory agency, an administrative law judge shall issue a recommendation to grant or deny the stay. The regulatory agency shall grant or deny the stay within five calendar days of receiving the administrative law judge's recommendation.\nA judicial review of the final order issued by the regulatory agency may be requested in the manner prescribed in sections 14.63 to 14.69. Failure to request a hearing pursuant to subdivision 3 shall constitute a waiver of the right to further agency or judicial review of the final order.\nIn the event of noncompliance with the cease and desist order, the regulatory agency may:\n(1) institute a proceeding in any district court in any district in Minnesota to obtain injunctive relief;\n(2) impose an administrative penalty, pursuant to section 149A.06, for each separate violation; or\n(3) revoke, suspend, limit, or condition the license or permit issued to the subject of the cease and desist order.\nThe issuance of a cease and desist order or injunctive relief does not relieve a person subject to regulation under this chapter from criminal prosecution by a competent authority.",
	"repealed": false
}