{
	"id": "473.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.145",
	"title": "473.145 DEVELOPMENT GUIDE.",
	"text": "(a) The Metropolitan Council must prepare and adopt, after appropriate study and such public hearings as may be necessary, a comprehensive development guide for the metropolitan area. It must consist of a compilation of policy statements, goals, standards, programs, and maps prescribing guides for the orderly and economical development, public and private, of the metropolitan area. The comprehensive development guide must recognize and encompass physical, social, or economic needs of the metropolitan area and those future developments which will have an impact on the entire area including but not limited to such matters as land use, climate mitigation and adaptation, parks and open space land needs, the necessity for and location of airports, highways, transit facilities, public hospitals, libraries, schools, and other public buildings.\n(b) For the purposes of this section, \"climate mitigation and adaptation\" includes mitigation goals and strategies that meet or exceed the greenhouse gas emissions-reduction goals established by the state under section 216H.02, subdivision 1, and transportation targets established by the commissioner of transportation, including vehicle miles traveled reduction targets established in the statewide multimodal transportation plan under section 174.03, subdivision 1a, as well as plans and policies to address climate adaptation in the region. The commissioner of transportation must consult with the Metropolitan Council on transportation targets prior to establishing the targets.\n(c) Notwithstanding any other provision of law, no decision adopting or authorizing a comprehensive plan shall be subject to the requirements of chapter 116D. Nothing in this paragraph exempts individual projects, as defined by Minnesota Rules, part 4410.0200, subpart 65, from the requirements of chapter 116D and applicable rules.",
	"repealed": false
}