{
	"id": "462A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.41",
	"title": "462A.41 FIRST-GENERATION HOMEBUYERS DOWN PAYMENT ASSISTANCE FUND.",
	"text": "A first-generation homebuyers down payment assistance fund is established for the agency to provide targeted assistance to eligible first-generation homebuyer households throughout the state. The agency may partner with community organizations, including community development financial institutions, credit unions, other financial institutions, nonprofits, government entities, or federally recognized American Indian Tribes or their Tribally Designated Housing Entities, to deliver the assistance.\n(a) For purposes of this section, \"eligible first-generation homebuyer\" means an individual:\n(1) whose household income is at or below 115 percent of the statewide or area median income, whichever is greater, at the time of purchase;\n(2) who is a first-time homebuyer as defined by the agency;\n(3) who meets the following criteria:\n(i) has either never owned a home or owned a home but lost it due to foreclosure; and\n(ii) has a parent or prior legal guardian who does not currently own a home and had never previously owned a home or had previously owned a home but lost it due to foreclosure;\n(4) who completes an approved homebuyer education course; and\n(5) who plans on occupying the home as a primary residence.\n(b) An eligible homebuyer must purchase the home within the maximum loan amount established by the Federal Housing Administration for the county in which the home is located and must contribute a minimum of $1,000 toward down payment or closing costs.\nAssistance under this section may be provided as a forgivable loan, a deferred loan, or a combination of both. Homebuyers may use the funds to purchase a one- to four-unit home, including manufactured homes. The assistance is limited to the greater of ten percent of the purchase price of a home or $35,000 per eligible first-generation homebuyer household. The amount of assistance shall be adjusted for market conditions over time at the discretion of the agency. The funds may be used for one or more of the following: closing costs, down payment, mortgage insurance, interest rate buy-down, and principal reduction. The funds can be combined with other homebuyer assistance and must be used in conjunction with a conforming first mortgage loan that is fully amortizing, with or without interest, and meets the standard of a qualified mortgage or as otherwise determined by the agency.\nLoans would be repayable if the property converts to nonowner occupancy, is sold within the loan period, is subjected to an ineligible refinance, is subjected to an unauthorized transfer of title, or for other reasons as stated in the loan documents. Recapture can be waived in the event of financial or personal hardship at the discretion of the agency.\nThe first-generation homebuyers down payment assistance fund is available statewide and shall be administered by the agency. If the agency works with a lending partner, that partner may use a percentage of the funds received for administrative fees as determined by the agency.",
	"repealed": false
}