{
	"id": "245F.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.05",
	"title": "245F.05 ADMISSION AND DISCHARGE POLICIES.",
	"text": "A license holder must have a written admission policy containing specific admission criteria. The policy must describe the admission process and the point at which an individual who is eligible under subdivision 2 is admitted to the program. A license holder must not admit individuals who do not meet the admission criteria. The admission policy must be approved and signed by the medical director of the facility and must designate which staff members are authorized to admit and discharge patients. The admission policy must be posted in the area of the facility where patients are admitted and given to all interested individuals upon request.\nFor an individual to be admitted to a withdrawal management program, the program must make a determination that the program services are appropriate to the needs of the individual. A program may only admit individuals who, at the time of admission, meet the criteria for admission as determined by current American Society of Addiction Medicine standards for appropriate level of withdrawal management.\n(a) A license holder must have a written policy and procedure for addressing the needs of individuals who are denied admission to the program. These individuals include:\n(1) individuals whose pregnancy, in combination with their presenting problem, requires services not provided by the program; and\n(2) individuals who are in imminent danger of harming self or others if their behavior is beyond the behavior management capabilities of the program and staff.\n(b) Programs must document denied admissions, including the date and time of the admission request, reason for the denial of admission, and where the individual was referred. If the individual did not receive a referral, the program must document why a referral was not made. This information must be documented on a form approved by the commissioner and made available to the commissioner upon request.\n(a) If a license holder denies an individual admission to the program or terminates services to a patient and the denial or termination poses an immediate threat to the patient's or individual's health or requires immediate medical intervention, the license holder must refer the patient or individual to a medical facility capable of admitting the patient or individual.\n(b) A license holder must report to a law enforcement agency with proper jurisdiction all denials of admission and terminations of services that involve the commission of a crime against a staff member of the license holder or on the license holder's property, as provided in Code of Federal Regulations, title 42, section 2.12 (c)(5), and title 45, parts 160 to 164.\nA license holder must have a written policy and procedure, approved and signed by the medical director, that specifies conditions under which patients may be discharged or transferred. The policy must include the following:\n(1) guidelines for determining when a patient is medically stable and whether a patient is able to be discharged or transferred to a lower level of care;\n(2) guidelines for determining when a patient needs a transfer to a higher level of care. Clinically managed program guidelines must include guidelines for transfer to a medically monitored program, hospital, or other acute care facility. Medically monitored program guidelines must include guidelines for transfer to a hospital or other acute care facility;\n(3) procedures staff must follow when discharging a patient under each of the following circumstances:\n(i) the patient is involved in the commission of a crime against program staff or against a license holder's property. The procedures for a patient discharged under this item must specify how reports must be made to law enforcement agencies with proper jurisdiction as allowed under Code of Federal Regulations, title 42, section 2.12 (c)(5), and title 45, parts 160 to 164;\n(ii) the patient is in imminent danger of harming self or others and is beyond the license holder's capacity to ensure safety;\n(iii) the patient was admitted under chapter 253B; or\n(iv) the patient is leaving against staff or medical advice; and\n(4) a requirement that staff must document where the patient was referred after discharge or transfer, and if a referral was not made, the reason the patient was not provided a referral.",
	"repealed": false
}