{
	"id": "237.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.661",
	"title": "237.661 ANTISLAMMING.",
	"text": "If a customer has elected to exercise the right described in section 237.66, subdivision 1a, the telephone company serving the customer shall not process a request to serve the customer by another telecommunications carrier without prior authorization from the customer. If a customer has not elected to exercise the right described in that subdivision, the company may process a request to serve the customer by another telecommunications carrier.\n(a) A telecommunications carrier may request that the telephone company serving a customer process a change in that customer's long-distance provider, if the customer has authorized the change either orally or in writing signed by the customer. Prior to requesting a change in a customer's long-distance service provider, the carrier must confirm:\n(1) the customer's identity with information unique to the customer, unless the customer refused to provide identifying information, then that fact should be noted;\n(2) that the customer has been informed of the offering made by the carrier;\n(3) that the customer understands that the customer is being requested to change telecommunication carriers;\n(4) that the customer has the authority to authorize the change; and\n(5) that the customer agrees to the change.\n(b) After requesting the change in long-distance service provider, the carrier must:\n(1) notify the customer in writing that the request has been processed; and\n(2) be able to produce, upon complaint by the customer, evidence that the carrier verified the authorization by the customer to change the customer's long-distance service provider. If the carrier used a negative checkoff verification procedure as defined in subdivision 4, paragraph (c), the evidence must include a tape recording of the initial oral authorization.\nIf the carrier is not able to present, upon complaint by the customer, evidence that complies with subdivision 2, paragraph (b), clause (2), the change to the service of the carrier is deemed to be unauthorized from the date the carrier requested the change. In that event, the carrier shall:\n(1) bear all costs of immediately returning the customer to the service of the customer's original service provider; and\n(2) bear all costs of serving that customer during the period of unauthorized service.\n(a) Customer authorization for a change in the customer's long-distance service provider may be verified using a verification procedure that complies with federal law or regulation. Except as provided in paragraph (b), the requirement that the carrier be able to produce evidence of customer authorization is satisfied if the carrier uses a federally authorized verification procedure.\n(b) If federal law or regulation authorizes a carrier to use a negative checkoff verification procedure, and the carrier does so, the carrier must be able to produce a tape recording of the initial oral authorization by the customer to change long-distance service providers as evidence of the authorization. The initial oral authorization must include confirmation of the items listed in subdivision 2, paragraph (a).\n(c) \"Negative checkoff\" means a verification procedure that consists of:\n(1) an initial oral authorization by the customer to change long-distance service providers; and\n(2) a mailing to the customer by the soliciting telecommunications carrier regarding the change in service providers that informs the customer that if the customer fails to cancel the change in service providers, the change will be deemed authorized and verified.",
	"repealed": false
}