{
	"id": "469.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.152",
	"title": "469.152 PURPOSES.",
	"text": "The welfare of the state requires the active promotion, attraction, encouragement, and development of economically sound industry and commerce through governmental action for the purpose of preventing the emergence of blighted and marginal lands and areas of chronic unemployment. It is the policy of the state to facilitate and encourage action by local government units to prevent the economic deterioration of such areas to the point where the process can be reversed only by total redevelopment through the use of local, state, and federal funds derived from taxation, necessitating relocating displaced persons and duplicating public services in other areas. By the use of the powers and procedures described in sections 469.152 to 469.165, local government units and their agencies and authorities responsible for redevelopment and economic development may prevent occurrence of conditions requiring redevelopment, or aid in the redevelopment of existing areas of blight, marginal land, and avoidance of substantial and persistent unemployment.\nThe welfare of the state further requires the provision of necessary health care facilities, so that adequate health care services are available to residents of the state at reasonable cost. The welfare of the state further requires the provision of county jail facilities for the purpose of providing adequately for the care, control, and safeguarding of civil rights of prisoners. The welfare of the state requires that, whenever feasible, employment opportunities made available in part by sections 469.152 to 469.165 or other state law providing for similar financing mechanisms should be offered to individuals who are unemployed or who are economically disadvantaged.\nThe welfare of the state further requires that, whenever feasible, action should be taken to reduce the cost of borrowing by local governments for public purposes.",
	"repealed": false
}