{
	"id": "180.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/180.03",
	"title": "180.03 DUTIES.",
	"text": "The duties of the inspector of mines shall be to visit all mining operations for which a permit to mine has been obtained from the commissioner of natural resources in the inspector's county at least once every 90 days and more often if requested so to do as hereinafter provided, and closely inspect the mines so visited and condemn all such places where the employees are in danger from any cause. In the event that the inspector of mines finds that a place is dangerous from any cause, it shall be the inspector's duty immediately to order those engaged in the work at that place to cease work, and notify the superintendent, agent, or person in charge to secure the place from the existing danger, which notification or order shall be in writing, clearly define the limits of the dangerous place, and specify the work to be done or change to be made to render the same secure, ordinary mine risks excepted. It shall be the duty of the inspector of mines to order the person, persons, or corporation working any mine, or the agent, superintendent, lead supervisor, or other person having immediate charge of the working of any mine, to mitigate the identified hazard.\nEvery person, firm, or corporation that is or has been engaged in the business of mining or removing iron ore, taconite, semitaconite or other minerals except sand, crushed rock, and gravel shall erect and maintain, as a minimum, a three strand wire fence along the outside perimeter of the excavation, open pit, or shaft of any mine in which mining operations have ceased for a period of six consecutive months or longer. Based upon local site conditions that may exist at shafts, caves, or open pits, the county mine inspector may require more secure fencing such as barbed wire or mesh fence, or may require barriers, appropriate signs, or any combination of the above, to reduce the possibility of accidental falls. The county mine inspector may grant exemptions under subdivision 4. Where mining operations have ceased and not resumed, the fence, barrier, signs, or combination of them required by this section shall be erected within two years from the date when the county mine inspector directs the erection of fences, barriers, signs, or combination of them.\nExcept as described in subdivision 4, when a mine is idle or abandoned it is the duty of the inspector of mines to notify the person, firm, or corporation that is or has been engaged in the business of mining to erect and maintain around all the shafts, caves, and open pits of such mines a fence, barrier, appropriate signs, or combination of them, suitable to warn of the presence of shafts, caves, or open pits and reduce the possibility of accidentally falling into these shafts, caves, or open pits. If the mine has been idled or abandoned, or if the person, firm, or corporation that has been engaged in the business of mining no longer exists, the fee owner shall erect and maintain the fence, barrier, or signs required by this section. If the fee owner fails to act, the county in which the mining operation is located may, in addition to any other remedies available, abate the nuisance by erecting or maintaining the fence, barrier, or signs and assessing the costs and related expenses pursuant to section 429.101.\n(a) The portion of an excavation, cave, open or water-filled pit, or shaft is exempt from the requirements of this section if:\n(1) it is located on property owned, leased, or administered by the Department of Iron Range Resources and Rehabilitation;\n(2) it is for the construction, operation, maintenance, or administration of:\n(i) grants-in-aid trails as defined in section 85.018;\n(ii) property owned or leased by a municipality, as defined in section 466.01, subdivision 1, that is intended or permitted to be used as a park, an open area for recreational purposes, or for the provision of recreational services, including the creation of trails or paths without artificial surfaces; or\n(iii) recreational use, as defined in section 604A.21, subdivisions 5 and 6, provided the use is administered by a municipality, as defined in section 466.01, subdivision 1;\n(3) it is for economic development purposes under chapter 469; or\n(4) upon written application by the property owner, the county mine inspector determines that it is provided with fencing, barriers, appropriate signs, or combinations of them, in a manner that is reasonably similar to the standards in subdivision 2, or if, in the inspector's judgment, it does not constitute a safety hazard.\n(b) Where an exemption applies, there shall be, at a minimum, appropriate signs posted by the recipient of the exemption consistent with section 97B.001, subdivision 4:\n(1) at each location of public access to the mining area restricting access to designated areas and warning of possible dangers due to the presence of excavations, shafts, caves, or open or water-filled pits;\n(2) prohibiting public access beyond the boundaries of the designated public access area; and\n(3) identifying those areas where the property on which public access is allowed abuts private property.\n(c) Where an exemption applies, to reduce the possibility of inadvertent access beyond the boundaries of the designated public access area, any new fencing erected by the recipient of the exemption in accordance with subdivision 2 or 3 shall be maintained by the recipient of the exemption.\n(d) Notwithstanding section 180.10, limited openings in preexisting fencing may be created and maintained by the recipient of the exemption or its agent to provide public access to the designated public access area.\n(e) The county mine inspector has the authority to enter, examine, and inspect any and all property exempted under this section at all reasonable times by day or by night, and, in addition to enforcing the provisions of this chapter, may make recommendations regarding the erection of fences, barriers, signs, or a combination of them.\n[Repealed by amendment, 2013 c 38 s 4]",
	"repealed": false
}