{
	"id": "136F.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.60",
	"title": "136F.60 COLLEGE AND UNIVERSITY SITES; ACQUISITION.",
	"text": "The board may purchase property adjacent to or in the vicinity of the campuses as necessary for the development of a state college or university. Before taking action, the board shall consult with the chairs of the senate Finance Committee and the house of representatives Ways and Means Committee about the proposed action. The board shall explain the need to acquire property, specify the property to be acquired, and indicate the source and amount of money needed for the acquisition. The funds needed may be spent from sums previously appropriated for purposes of the state colleges and universities, including, but not limited to, general fund appropriations for instructional or noninstructional expenditures, general fund appropriations carried forward, or state college and university activity fund appropriations. The board may pay relocation costs, at its discretion, when acquiring property.\n(a) If money has been appropriated to the board to acquire lands or sites for public buildings or real estate, the acquisition may be by gift, purchase, or condemnation proceedings. Condemnation proceedings must be under chapter 117.\n(b) The board may accept gifts to improve or acquire facilities as provided in this paragraph:\n(1) for remodeling existing facilities if the remodeling does not materially increase the square footage of the facility;\n(2) for the acquisition, construction, or remodeling costs of facilities for which state capital appropriations have been made and whose use will not be substantially changed; or\n(3) for capital projects not authorized by the legislature if the board first certifies that project revenues, other gifts or grants, or other sources of capital funds are available for project costs and that no tuition revenues or state or federal appropriations are used for the capital or operating costs, including all program costs, salaries, and benefits, of the facility.\n(c) The board may convey or lease real property under the board's control, with or without monetary consideration, to provide a facility for the primary benefit of a state college or university or its students if the board certifies that project revenues, other gifts or grants, or other sources of funds are available for project costs and that no tuition revenues or state or federal appropriations are used for the capital cost of the facility. Agreements under this paragraph must demonstrate to the board's satisfaction the financial viability of the proposed project, including all proposed financial and contractual obligations, and operating costs, including all program costs, salaries and benefits, and other costs reasonably expected to be incurred or binding upon the college or university. Siting and design of the facility must be consistent with the campus master plan and Minnesota State Colleges and Universities building standards. Agreements under this paragraph to convey, or to lease for a term not to exceed 30 years, subject to section 16A.695, may be made following requests for proposal or by direct negotiation. Conveyances by the board under this paragraph must be by quitclaim deed in a form approved by the attorney general. Land conveyed by the board must revert to the state if it is no longer used for the primary benefit of a state college or university or its students.\n(d) For purposes of this subdivision, \"facility\" includes student unions, recreational centers and athletic centers, or facilities for which state capital appropriations have been made and the use of which will not be substantially changed. \"Facility\" also includes self-supporting student housing.\n(e) The board must report in a timely manner to the chairs of the house of representatives and senate committees with jurisdiction over higher education finance, capital investment, and ways and means any capital project under paragraphs (b) or (c) with a cost of $3,000,000 or more.\n(a) The board may grant permanent or temporary easements over, under, or across any land under its jurisdiction for reasonable purposes determined by the board as provided in paragraphs (b) and (c).\n(b) The board may grant a revocable easement or permit under this paragraph. An easement or permit is revocable by written notice given by the board if at any time its continuance will conflict with a public use of the land over, under, or upon which it is granted, or for any other reason. The notice must be in writing and is effective 90 days after the notice is sent by certified mail to the last known address of the holder of record of the easement. If the address of the holder of the easement or permit is not known, it expires 90 days after the notice is recorded in the office of the county recorder of the county in which the land is located. Upon revocation of an easement or permit, the board may allow a reasonable time to vacate the premises affected.\n(c) State land subject to an easement or permit granted by the board remains subject to sale or lease, and the sale or lease does not revoke the permit or easement granted.\nThe board may sell, transfer, or otherwise dispose of an improvement located on state-owned lands, the compensation for which shall be determined by the board. The sale, transfer, or disposition must be accomplished by a bill of sale describing the improvement transferred and the terms and conditions of the sale or transfer. Proceeds from the sale, transfer, or disposition must be retained by the board unless otherwise provided by section 16A.695 or other law.\n(a) The board may declare state lands or improvements under its control that are no longer needed by the Minnesota State Colleges and Universities system to be surplus and may offer them for public sale in a manner consistent with the procedures set forth in sections 16B.282 to 16B.286 for disposition of state lands by the commissioner of administration. The parcels must not be exchanged or transferred for no or nominal consideration.\n(b) Proceeds from the sale or disposition of land or improvements under this subdivision, after paying all expenses incurred in selling or disposing of the land and then paying any amounts due under section 16A.695, are appropriated to the board for use for capital projects at the institution that was responsible for management of the land or improvements.",
	"repealed": false
}