{
	"id": "127A.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.82",
	"title": "127A.82 MILITARY INTERSTATE CHILDREN'S COMPACT STATE COUNCIL.",
	"text": "(a) A Military Interstate Children's Compact State Council is established to provide for the coordination among state agencies, local education agencies, and military installations concerning the state's participation in, and compliance with the Interstate Compact on Educational Opportunity for Military Children established in section 127A.85, otherwise known as the Military Interstate Children's Compact, and Interstate Commission activities.\n(b) Council membership must include at least:\n(1) the commissioner;\n(2) a superintendent, appointed by the commissioner, of a school district or charter school with a high concentration of military children;\n(3) a representative from a military installation appointed by the adjutant general;\n(4) one member of the house of representatives appointed by the speaker of the house;\n(5) one member of the senate appointed by the Subcommittee on Committees of the Committee on Rules and Administration; and\n(6) other offices and stakeholder groups the council deems appropriate.\nIf the commissioner determines there is not a school district deemed to contain a high concentration of military children, the commissioner may appoint a superintendent from another school district to represent local education agencies on the council.\n(c) The council must appoint or designate a military family education liaison to assist military families and the state in facilitating the implementation of section 127A.85.\n(d) The compact commissioner responsible for the administration and management of the state's participation in the compact must be appointed by the commissioner.\n(e) The compact commissioner and the military family education liaison designated herein shall be ex officio members of the council, unless either is already a full voting member of the council.\n(a) The council may develop recommendations to the governor and the legislature designed to facilitate successful educational transitions for children of military families under the compact.\n(b) The commissioner must schedule and hold a meeting of the council no less than once per state fiscal year.\n(c) The council must produce meeting agendas that are made publicly available before each meeting and maintain meeting minutes that are made publicly available once they are approved by the council.\n(d) By January 15 of each odd-numbered year, the council shall submit a report to the governor and to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over kindergarten through grade 12 education policy and finance and military affairs that summarizes the council's progress in meeting its goals and identifies the need for any draft legislation to facilitate successful educational transitions for children of military families.",
	"repealed": false
}