{
	"id": "65B.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.53",
	"title": "65B.53 INDEMNITY; ARBITRATION BETWEEN OBLIGORS; SUBROGATION.",
	"text": "A reparation obligor paying or obligated to pay basic or optional economic loss benefits is entitled to indemnity subject to the limits of the applicable residual liability coverage from a reparation obligor providing residual liability coverage on a commercial vehicle of more than 5,500 pounds curb weight if negligence in the operation, maintenance or use of the commercial vehicle was the direct and proximate cause of the injury for which the basic economic loss benefits were paid or payable to the extent that the insured would have been liable for damages but for the deduction provisions of section 65B.51, subdivision 1.\nFor purposes of this subdivision, a \"commercial vehicle of more than 5,500 pounds curb weight\" does not include a vehicle listed in section 65B.47, subdivision 1a.\nA reparation obligor paying or obligated to pay basic or optional economic loss benefits is subrogated to the claim for the recovery of damages for economic loss that the person to whom the basic or optional economic loss benefits were paid or payable has against another person whose negligence in another state was the direct and proximate cause of the injury for which the basic economic loss benefits were paid or payable. This right of subrogation exists only to the extent that basic economic loss benefits are paid or payable and only to the extent that recovery on the claim absent subrogation would produce a duplication of benefits or reimbursement of the same loss.\nA reparation obligor paying or obligated to pay basic economic loss benefits is subrogated to a claim based on an intentional tort, strict or statutory liability, or negligence other than negligence in the maintenance, use, or operation of a motor vehicle. This right of subrogation exists only to the extent that basic economic loss benefits are paid or payable and only to the extent that recovery on the claim absent subrogation would produce a duplication of benefits or reimbursement of the same loss.\nThe right of indemnity provided in subdivision 1 shall be enforceable only through mandatory good faith and binding arbitration procedures established by rule of the commissioner of commerce. These procedures shall utilize determinations of comparative negligence. No evidence nor the decision in such an arbitration proceeding shall be admissible in any action by any party.\nExcept as provided in this section nothing in sections 65B.41 to 65B.71 shall limit or abridge the subrogation rights of a reparation obligor providing collision coverage to a policyholder.\nNo reparation obligor shall include in its contract any provision which would require a person to commence a negligence action as a condition precedent to the payment of basic economic loss benefits or which permits the reparation obligor to determine whether such an action will be commenced. No reparation obligor shall contract for a right of reimbursement or subrogation greater than or in addition to those permitted by this chapter.\nArbitration proceedings need not await final payment of benefits, and the award, if any, shall include provision for reimbursement of subsequent benefits, but no question of fact decided by a prior award shall be reconsidered in any such subsequent arbitration hearing.\nNotwithstanding any law to the contrary, in any action brought for the recovery of damages allegedly caused by the negligent operation, ownership, maintenance or use of a motor vehicle or motorcycle where the right of subrogation is claimed or may be claimed under this section, or in any counterclaim to such an action, the right of an insurer to be subrogated to all or a portion of the claim of an insured, whether the right to subrogation arises from contract, statute or any other source, shall be enforceable against the insured only if the insurer, upon demand by the insured, agrees to pay a share of the attorney fees and costs incurred to prosecute the claim, in such proportion as the insurer's subrogated interest in the claim bears to any eventual recovery on the claim.",
	"repealed": false
}