{
	"id": "169.4501",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.4501",
	"title": "169.4501 SCHOOL BUS EQUIPMENT STANDARDS.",
	"text": "Except as provided in sections 169.4502 and 169.4503, the construction, design, equipment, and color of types A, B, C, D school buses and multifunction school activity buses used for the transportation of school children shall meet the requirements of the \"bus body and chassis specifications\" in the most recent edition of the \"National School Transportation Specifications and Procedures\" adopted by the National Congress on School Transportation. Except as provided in section 169.4504, the construction, design, and equipment of types A, B, C, D school buses and multifunction school activity buses used for the transportation of students with disabilities also shall meet the requirements of the \"specially equipped school bus specifications\" in the National School Transportation Specifications and Procedures. The \"bus body and chassis specifications\" and \"specially equipped school bus specifications\" sections of the most recent edition of the \"National School Transportation Specifications and Procedures,\" adopted by the National Congress on School Transportation, are incorporated by reference in this chapter.\n(a) The standards adopted in this section and sections 169.4502 and 169.4503, govern the construction, design, equipment, and color of school buses used for the transportation of school children, when owned or leased and operated by a school or privately owned or leased and operated under a contract with a school. Each school, its officers and employees, and each person employed under the contract is subject to these standards.\n(b) The standards apply to school buses manufactured after August 1 of the year following a year in which a revised edition of the National School Transportation Specifications and Procedures is adopted. Buses complying with the standards when manufactured need not comply with standards established later except as specifically provided for by law.\n(c) A school bus manufactured on or before the date provided by paragraph (b) must conform to the Minnesota standards in effect on the date the vehicle was manufactured except as specifically provided for in law.\n(d) A new bus body may be remounted on a used chassis provided that the remounted vehicle meets state and federal standards for new buses which are current at the time of the remounting. Permission must be obtained from the commissioner of public safety before the remounting is done. A used bus body may not be remounted on a new or used chassis.\nThe Department of Public Safety shall develop a School Bus Inspection Manual based on the national standards adopted in subdivision 1 and Minnesota standards adopted in sections 169.4502 to 169.4504. The Minnesota State Patrol shall use the manual as the basis for inspecting buses as provided in section 169.451. The Department of Public Safety has no rulemaking authority to alter the standards upon which school buses are inspected.\nThe commissioner of public safety may grant a variance to any of the school bus standards to accommodate testing of new equipment related to school buses. A variance from the standards must be for the sole purpose of testing and evaluating new equipment for increased safety, efficiency, and economy of pupil transportation. The variance expires 18 months from the date on which it is granted unless the commissioner specifies an earlier expiration date.",
	"repealed": false
}