{
	"id": "245I.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.03",
	"title": "245I.03 REQUIRED POLICIES AND PROCEDURES.",
	"text": "A license holder must establish, enforce, and maintain policies and procedures to comply with the requirements of this chapter and chapters 245A, 245C, and 260E; sections 626.557 and 626.5572; and Minnesota Rules, chapter 9544. The license holder must make all policies and procedures available in writing to each staff person. The license holder must complete and document a review of policies and procedures every two years and update policies and procedures as necessary. Each policy and procedure must identify the date that it was initiated and the dates of all revisions. The license holder must clearly communicate any policy and procedural change to each staff person and provide necessary training to each staff person to implement any policy and procedural change.\nA license holder must have policies and procedures to ensure the health and safety of each staff person and client during the provision of services, including policies and procedures for services based in community settings.\nA license holder must have policies and procedures to ensure that each staff person complies with the client rights and protections requirements in section 245I.12.\n(a) A license holder must have procedures that each staff person follows when responding to a client who exhibits behavior that threatens the immediate safety of the client or others. A license holder's behavioral emergency procedures must incorporate person-centered planning and trauma-informed care.\n(b) A license holder's behavioral emergency procedures must include:\n(1) a plan designed to prevent the client from inflicting self-harm and harming others;\n(2) contact information for emergency resources that a staff person must use when the license holder's behavioral emergency procedures are unsuccessful in controlling a client's behavior;\n(3) the types of behavioral emergency procedures that a staff person may use;\n(4) the specific circumstances under which the program may use behavioral emergency procedures; and\n(5) the staff persons whom the license holder authorizes to implement behavioral emergency procedures.\n(c) The license holder's behavioral emergency procedures must not include secluding or restraining a client except as allowed under section 245.8261.\n(d) Staff persons must not use behavioral emergency procedures to enforce program rules or for the convenience of staff persons. Behavioral emergency procedures must not be part of any client's treatment plan. A staff person may not use behavioral emergency procedures except in response to a client's current behavior that threatens the immediate safety of the client or others.\nIf a license holder is licensed as a residential program, stores or administers client medications, or observes clients self-administer medications, the license holder must ensure that a staff person who is a registered nurse or licensed prescriber reviews and approves of the license holder's policies and procedures to comply with the health services and medications requirements in section 245I.11, the training requirements in section 245I.05, subdivision 5, and the documentation requirements in section 245I.08, subdivision 5.\nA license holder must have policies and procedures for reporting a staff person's suspected maltreatment, abuse, or neglect of a client according to chapter 260E and section 626.557.\nIf a license holder is licensed as a residential program, the license holder must have policies and procedures for reporting and maintaining records of critical incidents according to section 245I.13.\nA license holder must have personnel policies and procedures that:\n(1) include a chart or description of the organizational structure of the program that indicates positions and lines of authority;\n(2) ensure that it will not adversely affect a staff person's retention, promotion, job assignment, or pay when a staff person communicates in good faith with the Department of Human Services, the Office of Ombudsman for Mental Health and Developmental Disabilities, the Department of Health, a health-related licensing board, a law enforcement agency, or a local agency investigating a complaint regarding a client's rights, health, or safety;\n(3) prohibit a staff person from having sexual contact with a client in violation of chapter 604, section 609.344 or 609.345;\n(4) prohibit a staff person from neglecting, abusing, or maltreating a client as described in chapter 260E and sections 626.557 and 626.5572;\n(5) include the drug and alcohol policy described in section 245A.04, subdivision 1, paragraph (c);\n(6) describe the process for disciplinary action, suspension, or dismissal of a staff person for violating a policy provision described in clauses (3) to (5);\n(7) describe the license holder's response to a staff person who violates other program policies or who has a behavioral problem that interferes with providing treatment services to clients; and\n(8) describe each staff person's position that includes the staff person's responsibilities, authority to execute the responsibilities, and qualifications for the position.\nIf a license holder uses volunteers, the license holder must have policies and procedures for using volunteers, including when the license holder must submit a background study for a volunteer, and the specific tasks that a volunteer may perform.\n(a) A license holder must have policies and procedures that comply with all applicable state and federal law. A license holder's use of electronic record keeping or electronic signatures does not alter a license holder's obligations to comply with applicable state and federal law.\n(b) A license holder must have policies and procedures for a staff person to promptly document a client's revocation of consent to disclose the client's health record. The license holder must verify that the license holder has permission to disclose a client's health record before releasing any client data.",
	"repealed": false
}