{
	"id": "88.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.12",
	"title": "88.12 COMPENSATING WILDFIRE FIGHTERS; EMERGENCY EXPENSES.",
	"text": "The compensation and expenses of persons temporarily employed in emergencies in suppression or control of wildfires shall be fixed by the commissioner of natural resources or an authorized agent and paid as provided by law. Such compensation shall not exceed the maximum rate for comparable labor established as provided by law or rules, but shall not be subject to any minimum rate so established. The commissioner is authorized to draw and expend from money appropriated for the purposes of sections 88.03 to 88.22 a reasonable sum and through forest officers or other authorized agent be used in paying emergency expenses, including just compensation for services rendered by persons summoned and for private property used, damaged, or appropriated under sections 88.03 to 88.22. The commissioner of management and budget is authorized to issue a payment for this sum when duly approved by the commissioner. The commissioner or agent in charge shall take proper subvouchers or receipts from all persons to whom these moneys are paid, and after these subvouchers have been approved they shall be filed with the commissioner of management and budget. Authorized funds as herein provided at any time shall be deposited, subject to withdrawal or disbursement by check or otherwise for the purposes herein prescribed, in a bank authorized and bonded to receive state deposits; and the bond of this bank to the state shall cover and include this deposit.\nThe commissioner is hereby authorized and empowered to contract for or accept the services of any and all persons whose aid is available, temporarily or otherwise, in forestry or wildfire prevention work, either gratuitously or for compensation not in excess of the limits provided by law with respect to the employment of labor by the commissioner. At the request of another emergency response agency, trained forestry wildfire fighting resources may be used to support search and rescue operations. The commissioner may issue a commission, or other written evidence of authority, to any such person whose services are so arranged for; and may thereby empower such person to act, temporarily or otherwise, as fire warden, or in any other capacity, with such powers and duties as may be specified in the commission or other written evidence of authority, but not in excess of the powers conferred by law on forest officers.",
	"repealed": false
}