{
	"id": "609.892",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.892",
	"title": "609.892 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 237.73, 609.892, and 609.893.\n\"Access device\" means a card, plate, code, account number, or other means of account access that can be used, alone or in conjunction with another access device, to obtain telecommunications service.\n\"Credit card number\" means the card number appearing on a credit card that is an identification card or plate issued to a person by a supplier of telecommunications service that permits the person to whom the card has been issued to obtain telecommunications service on credit. The term includes the number or description of the card or plate even if the card or plate itself is not produced when obtaining telecommunications service.\n\"Telecommunications device\" means an instrument, apparatus, equipment mechanism, operating procedure, or code designed or adapted for a particular use and that is intended or can be used in violation of section 609.893. The term includes but is not limited to computer hardware, software, programs, electronic mail system, voice mail system, identification validation system, private branch exchange, or any other means of facilitating telecommunications service.\n\"Telecommunications provider\" means a person, firm, association, or a corporation, private or municipal, owning, operating, or managing facilities used to provide telecommunications service.\n\"Telecommunications service\" means a service that, in exchange for a pecuniary consideration, provides or offers to provide transmission of messages, signals, facsimiles, or other communication between persons who are physically separated from each other by telephone, telegraph, cable, wire, fiber optic cable, or the projection of energy without physical connection. This term applies when the telecommunications service originates or ends or both originates and ends in this state.\n\"Telephone company\" means a telecommunications provider that provides local exchange telecommunications service.",
	"repealed": false
}