{
	"id": "308B.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.615",
	"title": "308B.615 CERTIFICATED MEMBERSHIP INTERESTS.",
	"text": "The membership interests of a cooperative shall be either certificated or uncertificated. Each holder of certificated membership interests issued is entitled to a certificate of membership interest.\nCertificates shall be signed by an agent or officer authorized in the articles or bylaws to sign share certificates or, in the absence of an authorization, by the chair or records officer of the cooperative.\nIf a person signs or has a facsimile signature placed upon a certificate while the chair, an officer, transfer agent, or records officer of a cooperative, the certificate may be issued by the cooperative, even if the person has ceased to have that capacity before the certificate is issued, with the same effect as if the person had that capacity at the date of its issue.\nA certificate representing membership interests of a cooperative shall contain on its face:\n(1) the name of the cooperative;\n(2) a statement that the cooperative is organized under the laws of this state and this chapter;\n(3) the name of the person to whom the certificate is issued;\n(4) the number and class of membership interests, and the designation of the series, if any, that the certificate represents;\n(5) a statement that the membership interests in the cooperative are subject to the articles and bylaws of the cooperative; and\n(6) any restrictions on transfer, including approval of the board, if applicable, first rights of purchase by the cooperative, and other restrictions on transfer, which may be stated by reference to the back of the certificate or to another document.\nA certificate representing membership interest issued by a cooperative authorized to issue membership interests of more than one class or series shall set forth upon the face or back of the certificate, or shall state that the cooperative will furnish to any member upon request and without charge, a full statement of the designations, preferences, limitations, and relative rights of the membership interests of each class or series authorized to be issued, so far as they have been determined, and the authority of the board to determine the relative rights and preferences of subsequent classes or series.\nA certificate signed as provided in subdivision 2 is prima facie evidence of the ownership of the membership interests referred to in the certificate.\nUnless uncertificated membership interests are prohibited by the articles or bylaws, a resolution approved by the affirmative vote of a majority of the directors present may provide that some or all of any or all classes and series of its membership interests will be uncertificated membership interests. The resolution does not apply to membership interests represented by a certificate until the certificate is surrendered to the cooperative. Within a reasonable time after the issuance or transfer of uncertificated membership interests, the cooperative shall send to the new member the information required by this section to be stated on certificates. This information is not required to be sent to the new holder by a publicly held cooperative that has adopted a system of issuance, recordation, and transfer of its membership interests by electronic or other means not involving an issuance of certificates if the system complies with section 17A of the Securities Exchange Act of 1934. Except as otherwise expressly provided by statute, the rights and obligations of the holders of certificated and uncertificated membership interests of the same class and series are identical.",
	"repealed": false
}