{
	"id": "473H.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.05",
	"title": "473H.05 APPLICATION; COVENANT AGREEMENT.",
	"text": "An owner or owners of certified long-term agricultural land may apply to the authority with jurisdiction over the land on forms provided by the commissioner of agriculture for the creation of an agricultural preserve at any time. Land for which application is received prior to June 1 of any year shall be assessed pursuant to section 473H.10 for taxes payable in the following year. Land for which application is received on or after June 1 of any year shall be assessed pursuant to section 473H.10 in the following year. The application shall be executed and acknowledged in the manner required by law to execute and acknowledge a deed and shall contain at least the following information and such other information as the commissioner deems necessary:\n(a) legal description of the area proposed to be designated and parcel identification numbers if so designated by the county auditor and the certificate of title number if the land is registered;\n(b) name and address of owner;\n(c) an affidavit by the authority evidencing that the land is certified long-term agricultural land at the date of application;\n(d) a statement by the owner covenanting that the land shall be kept in agricultural use, and shall be used in accordance with the provisions of sections 473H.02 to 473H.17 which exist on the date of application and providing that the restrictive covenant shall be binding on the owner or the owner's successor or assignee, and shall run with the land.\nThe authority may require an application fee, not to exceed $50, to defray administrative costs.\nMS 1998 [Repealed, 1999 c 11 art 1 s 72]\nIf an owner's property was initially granted agricultural preserve status under subdivision 1 but the owner filed an agricultural preserve termination notice on that property, the owner may reenroll the property in the program as provided in this subdivision. In lieu of the requirements in subdivision 1, the county may allow a property owner to reenroll by completing a one page form or affidavit, as prepared by the county. The county may require whatever information is deemed necessary, except that approval by the city or township, in which the property is located, shall be required on the form or affidavit.\nThe county may charge the property owner a reenrollment fee, not to exceed $10, to defray any administrative cost.\nReenrolling property under this subdivision shall be allowed only if the same property owner or owners wish to reenroll the same property under the same conditions as was originally approved under subdivision 1.",
	"repealed": false
}