{
	"id": "402A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/402A.40",
	"title": "402A.40 TRANSITION TO NEW BARGAINING UNIT STRUCTURE.",
	"text": "Notwithstanding the provisions of section 179A.12 or any other law, this section governs, where contrary to other law, the initial certification and decertification, if any, of exclusive representatives for service delivery authorities. Employees of a service delivery authority are public employees under section 179A.03, subdivision 14. Service delivery authorities are public employers under section 179A.03, subdivision 15.\nThe commissioner of the Minnesota Bureau of Mediation Services shall certify an employee organization for employees of a service delivery authority as exclusive representative for an appropriate unit upon a petition filed with the commissioner by the organization demonstrating that the petitioner is certified pursuant to section 179A.12 as the exclusive representative of a majority of the employees included within the unit as of that date. Two or more employee organizations that represent the employees in a unit may petition jointly under this subdivision, provided that any organization may withdraw from a joint certification in favor of the remaining organizations on 30 days' notice to the remaining organizations, the employer, and the commissioner, without affecting the rights and obligations of the remaining organizations or the employer. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(a) If no exclusive representative is certified under subdivision 2, the commissioner shall certify an employee organization as exclusive representative for an appropriate unit established upon a petition filed by the organization within the time period provided in subdivision 2 demonstrating that the petitioner is certified under section 179A.12 as the exclusive representative of fewer than a majority of the employees included within the unit if no other employee organization so certified has filed a petition within the time period provided in subdivision 2 and a majority of the employees in the unit are represented by employee organizations under section 179A.12 on the date of the petition. Two or more employee organizations, each of which represents employees included in the unit may petition jointly under this paragraph, provided that any organization may withdraw from a joint certification in favor of the remaining organizations on 30 days' notice to the remaining organizations, the employer, and the commissioner without affecting the rights and obligations of the remaining organizations or the employer. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(b) If no exclusive representative is certified under paragraph (a) or subdivision 2, and an employee organization petitions the commissioner within 90 days of the creation of the service delivery authority demonstrating that a majority of the employees included within an appropriate unit wish to be represented by the petitioner, where this majority is evidenced by current dues deduction rights, signed statements from employees in counties within the service delivery authority that are not currently represented by any employee organization plainly indicating that the signatories wish to be represented for collective bargaining purposes by the petitioner rather than by any other organization, or a combination of those, the commissioner shall certify the petitioner as exclusive representative of the employees in the unit. The commissioner shall make a determination on a timely petition within 45 days of its receipt.\n(c) If no exclusive representative is certified under paragraph (a) or (b) or subdivision 2, and an employee organization petitions the commissioner subsequent to the creation of the service delivery authority demonstrating that at least 30 percent of the employees included within an appropriate unit wish to be represented by the petitioner, where this 30 percent is evidenced by current dues deduction rights, signed statements from employees in counties within the service delivery authority that are not currently represented by any employee organization plainly indicating that the signatories wish to be represented for collective bargaining purposes by the petitioner rather than by any other organization, or a combination of those, the commissioner shall conduct a secret ballot election to determine the wishes of the majority. The election must be conducted within 45 days of receipt or final decision on any petitions filed pursuant to subdivision 2, whichever is later. The election is governed by section 179A.12, where not inconsistent with other provisions of this section.\nThe commissioner may not consider a petition for decertification of an exclusive representative certified under this section for one year after certification, unless section 179A.20, subdivision 6, applies.\n(a) The terms and conditions of collective bargaining agreements covering the employees of service delivery authorities remain in effect until a successor agreement becomes effective or, if no employee organization petitions to represent the employees of the service delivery authority, until six months after the establishment of the service delivery authority.\n(b) Any accrued leave, including but not limited to sick leave, vacation time, compensatory leave or paid time off, or severance pay benefits accumulated under policies of the previously employing county or a collective bargaining agreement between the previously employing county and an exclusive representative shall continue to apply in the newly created service delivery authority for the employees of the previously employing county. An employee who was eligible for the benefits of the Family and Medical Leave Act at the previously employing county shall continue to be eligible at the newly created service delivery authority.\n(c) If it is necessary, prior to the negotiation of a new collective bargaining agreement, to lay off an employee of a service delivery authority and if two or more employees previously performed the work, seniority based on continuous length of service with a service delivery authority member county shall be the determining factor in determining which qualified employee shall be offered the job by the service delivery authority. An employee whose work is being transferred to the service delivery authority shall have the option of being laid off.\n(a) The exclusive representatives of units of employees certified prior to the creation of the service delivery authority remain responsible for administration of their contracts and for other contractual duties and have the right to dues and fair share fee deduction and other contractual privileges and rights until a contract is agreed upon with the service delivery authority. Exclusive representatives of service delivery authority employees certified after the creation of the service delivery authority are immediately upon certification responsible for bargaining on behalf of employees within the unit. They are also responsible for administering grievances arising under previous contracts covering employees included within the unit that remain unresolved upon agreement with the service delivery authority on a contract. Where the employer does not object, these responsibilities may be varied by agreement between the outgoing and incoming exclusive representatives. All other rights and duties of representation begin upon the creation of a service delivery authority, except that exclusive representatives certified upon or after the creation of the service delivery authority shall immediately, upon certification, have the right to all employer information and all forms of access to employees within the bargaining unit which would be permitted to the current contract holder, including the rights in section 179A.07, subdivision 6. This section does not affect an existing collective bargaining contract. Incoming exclusive representatives are immediately, upon certification, responsible for bargaining on behalf of all previously unrepresented employees assigned to their units.\n(b) Nothing in this section prevents an exclusive representative certified after the effective dates of these provisions from assessing fair share or dues deductions immediately upon certification if the employees were unrepresented for collective bargaining purposes before that certification.",
	"repealed": false
}