{
	"id": "84.0835",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0835",
	"title": "84.0835 DESIGNATION OF EMPLOYEES FOR LIMITED NATURAL RESOURCES LAW ENFORCEMENT.",
	"text": "As provided in this section, the commissioner may designate by written order certain employees to enforce laws governing the use of state parks, state monuments, state recreation areas, state waysides, forest subareas, forest lands under the authority of the commissioner when incidental to trail management or normal forestry duties, and game preserves and other lands administered as wildlife management areas. The designation by the commissioner is not subject to rulemaking under chapter 14 and section 14.386 does not apply.\nAn employee designated under subdivision 1:\n(1) has citizen arrest powers according to sections 629.37 to 629.39;\n(2) may issue citations, on a form prescribed by the commissioner, in lieu of arrest for petty misdemeanor violations and misdemeanor violations, unless the violation occurs in the presence of a conservation officer or other peace officer, as defined under section 626.84, subdivision 1, paragraph (c); and\n(3) may issue a report of violation to be turned over to a conservation officer or other peace officer for possible charges at the peace officer's discretion.\nEmployees designated by the commissioner under subdivision 1 may issue citations, as specifically authorized under this subdivision, for violations of:\n(1) sections 85.052, subdivision 3 (payment of camping fees in state parks), 85.45, subdivision 1 (cross-country-ski pass), 85.46 (horse pass), and 84.9275 (nonresident all-terrain vehicle state trail pass);\n(2) rules relating to hours and days of operation, restricted areas, noise, fireworks, environmental protection, fires and refuse, pets, picnicking, camping and dispersed camping, nonmotorized uses, construction of unauthorized permanent trails, mooring of boats, fish cleaning, swimming, storage and abandonment of personal property, structures and stands, animal trespass, state park individual and group motor vehicle permits, licensed motor vehicles, designated roads, and snowmobile operation off trails;\n(3) rules relating to off-highway vehicle registration, display of registration numbers, required equipment, operation restrictions, off-trail use for hunting and trapping, and operation in lakes, rivers, and streams;\n(4) rules relating to off-highway vehicle and snowmobile operation causing damage or in closed areas within the Richard J. Dorer Memorial Hardwood State Forest;\n(5) rules relating to parking, snow removal, and damage on state forest roads; and\n(6) rules relating to controlled hunting zones on major wildlife management units.",
	"repealed": false
}