{
	"id": "244.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.17",
	"title": "244.17 CHALLENGE INCARCERATION PROGRAM.",
	"text": "(a) The commissioner may select offenders who meet the eligibility requirements of subdivisions 2 and 3 to participate in a challenge incarceration program described in sections 244.171 and 244.172 for all or part of the offender's sentence if the offender agrees to participate in the program and signs a written contract with the commissioner agreeing to comply with the program's requirements.\n(b) The commissioner shall strive to select sufficient numbers of eligible offenders to ensure that the program operates as close to capacity as possible. The commissioner shall include specific information on how close to capacity the program is operating in the department's performance report described in section 241.016.\n(a) The commissioner must limit the challenge incarceration program to the following persons:\n(1) offenders who are committed to the commissioner's custody following revocation of a stayed sentence; and\n(2) offenders who are committed to the commissioner's custody, who have 48 months or less in or remaining in their term of imprisonment, and who did not receive a dispositional departure under the Sentencing Guidelines.\n(b) If there is insufficient space for an eligible person, the commissioner may place the person's name on a waiting list and offer the person the chance to participate when space becomes available if the person is still eligible under this section.\nThe following offenders are not eligible to be placed in the challenge incarceration program:\n(1) offenders who are committed to the commissioner's custody following a conviction for murder, manslaughter, criminal sexual conduct, assault, kidnapping, robbery, carjacking, arson, or any other offense involving death or intentional personal injury;\n(2) offenders who were convicted within the preceding ten years of an offense described in clause (1) and were committed to the custody of the commissioner;\n(3) offenders who have been convicted or adjudicated delinquent within the past five years for a violation of section 609.485;\n(4) offenders who are committed to the commissioner's custody for an offense that requires registration under section 243.166;\n(5) offenders who are the subject of a current arrest warrant or detainer;\n(6) offenders who have fewer than 180 days remaining until their supervised release date;\n(7) offenders who have had disciplinary confinement time added to their sentence or who have been placed in segregation, unless 90 days have elapsed from the imposition of the additional disciplinary confinement time or the last day of segregation;\n(8) offenders who have received a suspended formal disciplinary sanction, unless the suspension has expired; and\n(9) offenders whose governing sentence is for an offense from another state or the United States.",
	"repealed": false
}