{
	"id": "366.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/366.01",
	"title": "366.01 TOWN BOARD POWERS LISTED; FORMAL NAME.",
	"text": "The supervisors of each town constitute a board to be designated \"The Town Board of ..............\" Unless provided otherwise, two supervisors shall be a quorum. In towns operating under option A, three shall be a quorum. The supervisors shall have charge of all town affairs not committed to other officers by law. They shall draw orders on the treasurer to disburse money to pay the town expenses, and to disburse money raised by the town for any other purpose. They may pay the premium upon the bond of a town officer if the surety is a corporation authorized by law to be a surety. In lieu of individual bonds, the town board may provide for a blanket position bond by a surety company if all the obligations required by law or ordinance to be assumed by the principals and the principals' sureties by individual bonds are included in the blanket position bond.\nThey may by ordinance prohibit or license and regulate the keeping of billiard, pool, and pigeonhole tables, games of amusement, games of skill, juke boxes, roller skating rinks, bowling alleys, circuses, shows, and theatrical performances. They may fix the price and duration of the license. When in their opinion the public interest requires it, they may revoke the license. Within any platted residential area of the town, they may license and regulate the presence or keeping of dogs or domestic animal pets and regulate or prohibit the discharge of firearms, when deemed to be in the public interest.\nThey may appropriate out of the general fund of the town and draw orders on the treasurer to disburse money to pay the annual dues in the Minnesota Association of Townships or a county unit that belongs to the association and to pay the actual and necessary expenses of town officers for meetings relating to town business including meetings of town associations.\n(a) They may designate a bank as the depository of town money for a time not extending beyond their official term, after the execution by the bank of a sufficient bond to the town to be approved by the board and filed in the office of the town clerk. They may then require the treasurer to deposit all or part of the town money in that bank. The designation shall be in writing, and set forth all the terms upon which the deposits are made. It shall be signed by the chair and clerk and filed with the clerk. The town treasurer shall not be liable for the loss of money while deposited in the bank. All interest on the money shall belong to the town.\n(b) In addition to the authority for deposit of town money pursuant to paragraph (a) or other provisions of this chapter, the town treasurer may deposit town money in a designated depository in accordance with the following conditions:\n(1) The designated depository is authorized by the town treasurer to (i) arrange for the redeposit of the money into deposit accounts in one or more banks, savings and loan associations, or credit unions that are located in the United States, and (ii) serve as custodian for the town with respect to the money redeposited into such accounts.\n(2) The full amount of the redeposited town funds, plus accrued interest, if any, must be insured by the Federal Deposit Insurance Corporation or the National Credit Union Share Insurance Fund. Any entity serving as subcustodian for the designated depository shall have had at least five years of general custodial experience.\nThey may acquire by gift or purchase, in the name of the town, a tract of land, either within or outside the town for public dumping ground for the use of the inhabitants of the town. No land for public dumping ground may be acquired outside the town without the approval of the governmental unit where the land is located. They may maintain the dumping ground and, by resolution, adopt rules for its use.\nThey may make agreements with other counties, towns, statutory cities, governmental subdivisions, individuals or corporations as they deem necessary to locate, construct, or maintain the dumping ground.\nThey may employ an attorney for town business including the prosecution or defense of actions at law or other proceedings in which the town may be interested.\nThey shall designate one or more places in the town as public places where legal notices shall be posted and provide facilities for posting notices there. In a town located in the geographical limits of a city, one or more notices may be posted in the city. The town board may waive the posted notice requirements of any law but shall then provide for notice to be published once each week for two successive weeks in a newspaper of general circulation in the town.\nThey may sell and convey or lease real or personal property belonging to the town, not required to be held by the town for a special purpose.\nThey may declare that a violation of an ordinance is a penal offense and prescribe penalties for violations, except as otherwise provided by law. No penalty shall exceed that provided by law for a misdemeanor, but the costs of prosecution may be added.\nChapter 13D does not apply to a gathering of town board members to perform on-site inspections, if the town has no employees or other staff able to perform the inspections and the town board is acting essentially in a staff capacity. The town board shall make good faith efforts to provide notice of the inspections to each news medium that has filed a written request for notice if the request includes the news medium's telephone number. The notice shall be given by telephone or by any other method used to notify the members of the public body.\nThe town board may establish an imprest fund for the payment in cash of any proper claim against the town which it is impractical to pay in any other manner, except that no claim for salary or personal expenses of an officer or employee shall be paid from the fund. The town board shall appoint a custodian of the fund who shall be responsible for its safekeeping and disbursement according to law. Money for the operation of the fund shall be secured by a transfer from the general fund. A claim itemizing all the various demands for which disbursements have been made from the fund shall be presented to the town board at the next town board meeting after the disbursements have been made. The town board shall act upon it as in the case of other claims and an order shall be issued to the custodian for the amount allowed. The custodian shall use the proceeds of the order to replenish the fund; and if the town board fails to approve the claim in full for any sufficient reason, the custodian shall be personally responsible for the difference.",
	"repealed": false
}