{
	"id": "383A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.20",
	"title": "383A.20 GOVERNMENT ADMINISTRATION.",
	"text": "MS 1990 [Repealed, 1991 c 51 s 6]\n(a) In the county of Ramsey, the offices of county auditor, county treasurer, court commissioner, and county recorder are not elective but filled by appointment by the Ramsey County Board of Commissioners as provided in subdivisions 1 and 2, unless the office is abolished pursuant to a reorganization or consolidation under paragraph (b).\n(b) The duties, functions and responsibilities which are required by statute to be performed by the various elected officials whose offices are by subdivisions 1 and 2 made appointive are vested in and performed by Ramsey County. Ramsey County may initiate and direct a reorganization, consolidation, reallocation or delegation of these duties, functions, or responsibilities to promote efficiency in county government, and may make the other administrative changes, including the abolishing of the offices of auditor, treasurer and county recorder or the transfer of personnel that the county considers necessary for this purpose. The reorganization, reallocation, or delegation or other administrative change or transfer does not diminish, prohibit or avoid those specific duties required by statute to be performed by those officials whose office is now made appointive.\n(c) The elected county auditor, county treasurer, court commissioner, and county recorder shall serve as the heads of departments created by Ramsey County to perform the functions performed by their offices and shall serve until their terms of office expire; or upon the expiration of their terms until successors are appointed and duly qualify; and shall not prior to age 70 be disqualified from reappointment by reason of age.\nRamsey County shall provide to each employee, including an elected official, who retires, during retirement or to the surviving spouse of the employee, insurance protection in the amount that the county considers proper, providing medical, surgical and hospitalization benefits for the employee and dependent spouse. These benefits may not exceed benefits of similar nature existent and authorized for employees of the county. For these benefits for each retired employee, the average monthly premium cost is limited to $14 and for the spouse of the employee the monthly premium cost is limited to $10. If the revised Consumers' Price Index, as published by the United States Department of Labor, Bureau of Labor Statistics, for the city of Minneapolis, Minnesota (or if no index is published for the city of Minneapolis, for the nearest city to Minneapolis for which an index is published), as of January 15 of each year (or for the date nearest to January 15 if no index is published as of January 15), shall be above 119 (using the average for the year 1967 as a base), the total maximum amounts for average monthly premium cost shall be increased by one percent for each point increase in the index above 119. For purposes of this computation, a fractional point increase shall be disregarded if less than one-half point and treated as one full point if one-half point, or more.\nThe benefits provided in subdivision 3 are available at normal retirement to each employee or elected official who retires at normal retirement; at age 65 to each employee or elected official who retires after 55 years of age or older and has at least 20 years of county service; and at age 62 to each employee or elected official who retires after 62 years of age or older and has at least 30 years of county service.\nRamsey County may insure with an insurance carrier its liability to pay workers' compensation with respect to personnel subject to the authority of its sheriff who are engaged in the furnishing of police service to a city or town pursuant to the provisions of section 436.05. This insurance shall be governed by the provisions of chapter 176. The failure of the county of Ramsey to insure with an insurance carrier its liability to pay workers' compensation to any other employee or group of employees shall not preclude exercise of the authority conferred by this subdivision.\nMS 1990 [Repealed, 1991 c 51 s 6]\nMS 1990 [Repealed, 1991 c 51 s 6]\nMS 1990 [Repealed, 1991 c 51 s 6; 1991 c 326 s 27]\nMS 1990 [Repealed, 1991 c 51 s 6]\n(a) Generally. Ramsey County may provide for the payment of an automobile allowance to a county officer or employee, except a county commissioner, who officially uses a personal automobile in the performance of public duties. The authorization shall include any limitations as to amount and persons qualified for the automobile allowance, the formula to be used for the allowance, and other limitations or safeguards that the county considers to be expedient in the public interest. A county commissioner may receive actual and necessary expenses as provided in the charter.\n(b) Definition. Automobile allowance is defined as the payment of compensation or reimbursement made by the county, through the use of a formula decided upon by the county, to an officer or employee for the use of a personal automobile in the performance of public duty.\n(c) Limitations. Ramsey County shall have full authority and control, free from other limitations except as provided in this subdivision, to provide the method of payment, the formula for payment and the amount of the automobile allowance to be paid. This subdivision, insofar as the county of Ramsey is concerned, is paramount to any other statute of the state of Minnesota now existing.\nMS 1990 [Repealed, 1991 c 51 s 6]\nThe county may establish a cash over and short account within each of its imprest cash funds and cash receipt accounts. This account shall be used to record on a daily basis overages and shortages of cash receipts.\nAt the end of each fiscal year, the county shall credit or debit the overage or shortage from each imprest cash fund and cash receipt account to the county revenue fund.\nIn the instance of a debit balance remaining in the cash over or short account, the county may transfer money sufficient to offset the debit balance from any available fund.\nThe county budget director shall make the appropriate adjustments and entries on the general books of the county.",
	"repealed": false
}