{
	"id": "41B.047",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.047",
	"title": "41B.047 DISASTER RECOVERY LOAN PROGRAM.",
	"text": "The authority shall establish and implement a disaster recovery loan program to help farmers:\n(1) clean up, repair, or replace farm structures and septic and water systems, as well as replace seed, other crop inputs, feed, and livestock;\n(2) purchase watering systems, irrigation systems, other drought mitigation systems and practices, and feed when drought is the cause of the purchase;\n(3) restore farmland;\n(4) replace flocks or livestock, make building improvements, or cover the loss of revenue when the replacement, improvements, or loss of revenue is due to the confirmed presence of a highly contagious animal disease in a commercial poultry or game flock, or a commercial livestock operation, located in Minnesota; or\n(5) cover the loss of revenue when the revenue loss is due to an infectious human disease for which the governor has declared a peacetime emergency under section 12.31.\n[Repealed, 2002 c 220 art 9 s 8]\nTo be eligible for this program, a borrower must:\n(1) meet the requirements of section 41B.03, subdivision 1;\n(2) certify that the damage or loss was (i) sustained within a county that was the subject of a state or federal disaster declaration; (ii) due to the confirmed presence of a highly contagious animal disease in Minnesota; (iii) due to an infectious human disease for which the governor has declared a peacetime emergency; or (iv) due to an emergency as determined by the authority;\n(3) demonstrate an ability to repay the loan; and\n(4) have received at least 25 percent of annual gross income from farming in the past year.\n(a) The authority may participate in a disaster recovery loan with an eligible lender to a farmer who is eligible under subdivision 3. Participation is limited to 45 percent of the principal amount of the loan or $200,000, whichever is less. The interest rates and repayment terms of the authority's participation interest may differ from the interest rates and repayment terms of the lender's retained portion of the loan, but the authority's interest rate must not exceed four percent.\n(b) Standards for loan amortization shall be set by the Rural Finance Authority not to exceed ten years.\n(c) Security for the disaster recovery loans must be a personal note executed by the borrower and whatever other security is required by the eligible lender or the authority.\n(d) The authority may impose a reasonable nonrefundable application fee for a disaster recovery loan. The authority may review the fee annually and make adjustments as necessary. The application fee is initially $50. Application fees received by the authority must be deposited in the Rural Finance Authority administrative account established in section 41B.03.\n(e) Disaster recovery loans under this program will be made using money in the revolving loan account established under section 41B.06.\n(f) Repayments of financial assistance under this section, including principal and interest, must be deposited into the revolving loan account established under section 41B.06.",
	"repealed": false
}