{
	"id": "201.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.121",
	"title": "201.121 ENTRY OF NAMES; MAILED NOTICE.",
	"text": "(a) At the time a voter registration application is properly completed, submitted, and received in accordance with sections 201.061 and 201.071, the county auditor shall enter the information contained on it into the statewide registration system. Voter registration applications completed before election day must be entered into the statewide registration system within ten days after they have been submitted to the county auditor. Voter registration applications completed on election day must be entered into the statewide registration system within 42 days after the election, unless the county auditor notifies the secretary of state before the deadline has expired that the deadline will not be met. Upon receipt of a notification under this paragraph, the secretary of state must extend the deadline for that county auditor by an additional 28 days. The secretary of state may waive a county's obligations under this paragraph if, on good cause shown, the county demonstrates its permanent inability to comply.\nThe secretary of state must post data on each county's compliance with this paragraph on the secretary of state's website including, as applicable, the date each county fully complied or the deadline by which a county's compliance must be complete.\n(b) Upon receiving a completed voter registration application, the secretary of state may electronically transmit the information on the application to the appropriate county auditor as soon as possible for review by the county auditor before final entry into the statewide registration system. The secretary of state may mail the voter registration application to the county auditor.\n(c) Within ten days after the county auditor has entered information from a voter registration application into the statewide registration system, the secretary of state shall compare the voter's name, date of birth, and driver's license number, state identification number, or the last four digits of the Social Security number with the same information contained in the Department of Public Safety database.\n(d) The secretary of state shall provide a report to the county auditor on a weekly basis that includes a list of voters whose name, date of birth, or identification number have been compared with the same information in the Department of Public Safety database and cannot be verified as provided in this subdivision. The report must list separately those voters who have submitted a voter registration application by mail and have not voted in a federal election in this state.\n(e) The county auditor shall compile a list of voters for whom the county auditor and the secretary of state are unable to conclude that information on the voter registration application and the corresponding information in the Department of Public Safety database relate to the same person.\n(f) The county auditor shall send a notice of incomplete registration to any voter whose name appears on the list and change the voter's status to \"challenged.\" A voter who receives a notice of incomplete registration from the county auditor may either provide the information required to clear the challenge at least 21 days before the next election or at the polling place on election day.\nThe county auditor shall mail a notice indicating the individual's name, address, precinct and polling place to each registered voter. The notice shall indicate that it must be returned if it is not deliverable to the voter at the named address. Upon return of the notice by the postal service, the county auditor shall change the registrant's status to \"challenged\" in the statewide registration system. An individual challenged in accordance with this subdivision shall comply with the provisions of section 204C.12, before being allowed to vote.\n(a) Within ten days after an election, the county auditor shall send the notice required by subdivision 2 to a random sampling of the individuals registered on election day. The random sampling shall be determined in accordance with the rules of the secretary of state. As soon as practicable after the election, the county auditor shall mail the notice required by subdivision 2 to all other individuals registered on election day. If a notice is returned as not deliverable, the county auditor shall attempt to determine the reason for the return. A county auditor who does not receive or obtain satisfactory proof of an individual's eligibility to vote shall immediately notify the county attorney of all of the relevant information. By February 15 of each year, the county auditor must notify the secretary of state of the following information for each election held in the previous year by each precinct:\n(1) the total number of all notices that were returned as nondeliverable;\n(2) the total number of nondeliverable notices that the county auditor was able to determine the reason for the return along with the reason for each return; and\n(3) the total number of individuals for whom the county auditor does not receive or obtain satisfactory proof of an individual's eligibility to vote.\n(b) By March 1 of every year, the secretary of state shall report to the chair and ranking minority members of the legislative committees with jurisdiction over elections the following information for each election held in the previous year by each precinct and each county:\n(1) the total number of all notices that were returned as nondeliverable;\n(2) the total number of nondeliverable notices that a county auditor was able to determine the reason for the return along with the reason for each return; and\n(3) the total number of individuals for whom the county auditor does not receive or obtain satisfactory proof of an individual's eligibility to vote.",
	"repealed": false
}