{
	"id": "3.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.85",
	"title": "3.85 LEGISLATIVE COMMISSION ON PENSIONS AND RETIREMENT.",
	"text": "The Legislative Commission on Pensions and Retirement is created to study and investigate public retirement systems.\nThe commission shall make a continuing study and investigation of retirement benefit plans applicable to nonfederal government employees in this state. The powers and duties of the commission include, but are not limited to the following:\n(a) studying retirement benefit plans applicable to nonfederal government employees in Minnesota, including federal plans available to the employees;\n(b) making recommendations within the scope of its study, including attention to financing of the various pension funds and financing of accrued liabilities;\n(c) considering all aspects of pension planning and operation and making recommendations designed to establish and maintain sound pension policy for all funds;\n(d) analyzing each item of proposed pension and retirement legislation, including amendments to each, with particular reference to analysis of their cost, actuarial soundness, and adherence to sound pension policy, and reporting its findings to the legislature;\n(e) creating and maintaining a library for reference concerning pension and retirement matters, including information about laws and systems in other states; and\n(f) studying, analyzing, and preparing reports in regard to subjects certified to the commission for study.\nThe commission consists of seven members of the senate appointed by the Subcommittee on Committees of the Committee on Rules and Administration and seven members of the house of representatives appointed by the speaker. No more than five members from each chamber may be from the majority caucus in that chamber. Members shall be appointed at the commencement of each regular session of the legislature for a two-year term beginning January 16 of the first year of the regular session. Members continue to serve until their successors are appointed. Vacancies that occur while the legislature is in session shall be filled like regular appointments. If the legislature is not in session, senate vacancies shall be filled by the last Subcommittee on Committees of the senate Committee on Rules and Administration or other appointing authority designated by the senate rules, and house of representatives vacancies shall be filled by the last speaker of the house, or if the speaker is not available, by the last chair of the house of representatives Rules Committee.\nThe commission shall maintain an office in the Capitol group of buildings in space which the commissioner of administration shall provide. The commission shall hold meetings at the times and places it may designate. It shall select a chair, a vice-chair, and other officers from its membership as it deems necessary.\nThe commission may employ professional and technical assistants as it deems necessary to perform the duties prescribed in this section.\nThe commission may request information from any state officer or agency or public pension fund or plan as defined in section 356.63, paragraph (b), including a firefighters relief association to which sections 424A.091 to 424A.096 apply, to assist it to carry out the terms of this section. The officer, agency, or public pension fund or plan shall promptly furnish any data requested.\n[Repealed, 1996 c 310 s 1]\nThe members of the commission and its staff shall be reimbursed for all expenses actually and necessarily incurred in the performance of their duties. Reimbursement for expenses incurred shall be made in accordance with policies adopted by the Legislative Coordinating Commission.\nExpenses of the commission shall be approved by the chair or another member as the rules of the commission provide.\nThe commission shall adopt standards prescribing specific detailed methods to calculate, evaluate, and display current and proposed law liabilities, costs, and actuarial equivalents of all public employee pension plans in Minnesota. These standards shall be consistent with chapter 356 and be updated annually. At a minimum, the standards shall contain requirements that comply with generally accepted accounting principles applicable to government pension plans. The standards may include additional financial, funding, or valuation requirements that are not required under generally accepted accounting principles applicable to government pension plans.\n[Repealed, 2004 c 223 s 11]\n[Repealed, 2004 c 223 s 11]",
	"repealed": false
}