{
	"id": "477B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.03",
	"title": "477B.03 CALCULATION OF FIRE STATE AID; APPEAL.",
	"text": "(a) On or before October l, the commissioner must calculate the amount of fire state aid that each municipality or independent nonprofit firefighting corporation is to receive.\n(b) The commissioner must calculate an initial fire state aid allocation amount for each municipality or independent nonprofit firefighting corporation under subdivision 4 and, if applicable, a minimum fire state aid allocation amount for each municipality or independent nonprofit firefighting corporation under subdivision 5. The municipality or independent nonprofit firefighting corporation must be apportioned the greater of the amounts calculated under subdivisions 4 and 5.\n(a) The amount of fire state aid available for apportionment, before the addition of the minimum fire state aid allocation amount under subdivision 5, is equal to 107 percent of the amount of premium taxes paid to the state upon the fire, lightning, sprinkler leakage, and extended coverage premiums reported to the commissioner by companies or insurance companies on the Minnesota Fire Premium Report, except that credits claimed under section 297I.20, subdivisions 3, 4, 5, and 6, do not affect the calculation of the amount of fire state aid available for apportionment. This amount must be reduced by the amount required to pay the state auditor's costs and expenses of the audits or exams of the firefighters' relief associations.\n(b) The total amount available for apportionment must not be less than two percent of the premiums less return premiums reported to the commissioner by companies or insurance companies on the Minnesota Fire Premium Report after subtracting the following amounts:\n(1) the amount required to pay the state auditor's costs and expenses of the audits or exams of the firefighters' relief associations; and\n(2) one percent of the premiums reported by township mutual insurance companies and mutual property and casualty companies with total assets of $5,000,000 or less.\n(c) The commissioner must apportion the fire state aid to each municipality or independent nonprofit firefighting corporation qualified under section 477B.02 relative to the premiums reported on the Minnesota Fire Premium Reports filed under this chapter.\n(d) The commissioner must calculate the percentage of increase or decrease reflected in the apportionment over or under the previous year's available state aid using the same premiums as a basis for comparison.\n(a) The most recent population estimates made by the state demographer pursuant to section 4A.02, paragraph (d), must be used in calculations requiring the use of population figures under this chapter.\n(b) The estimated market value property figures for the assessment year immediately preceding the year the aid is distributed must be used in calculations requiring the use of estimated market value property figures under this chapter.\n(a) The initial fire state aid allocation amount is the amount available for apportionment as fire state aid under subdivision 2, without the inclusion of any additional funding amount to support a minimum fire state aid amount under section 423A.02, subdivision 3. The initial fire state aid allocation amount is allocated one-half in proportion to the population for each fire department service area and one-half in proportion to the estimated market value of each fire department service area, including (1) the estimated market value of tax-exempt property, and (2) the estimated market value of natural resources lands receiving in lieu payments under sections 477A.11 to 477A.14 and 477A.17. The estimated market value of minerals is excluded.\n(b) In the case of a municipality or independent nonprofit firefighting corporation furnishing fire protection to other municipalities as evidenced by valid fire service contracts, joint powers agreements, resolutions, and other supporting documents filed with the commissioner under section 477B.02, subdivision 5, the distribution must be adjusted proportionately to take into consideration the crossover fire protection service. Necessary adjustments must be made to subsequent apportionments.\n(c) In the case of municipalities or independent nonprofit firefighting corporations qualifying for aid, the commissioner must calculate the state aid for the municipality or independent nonprofit firefighting corporation on the basis of the population and the estimated market value of the area furnished fire protection service by the fire department as evidenced by valid fire service contracts, joint powers agreements, resolutions, and other supporting documents filed with the commissioner under section 477B.02, subdivision 5.\n(d) In the case of more than one fire department furnishing contracted fire service to a municipality, the population and estimated market value in the apportionment agreement filed with the commissioner under section 477B.02, subdivision 5, must be used in calculating the state aid.\n(a) The minimum fire state aid allocation amount is the amount derived from any additional funding amount to support a minimum fire state aid amount under section 423A.02, subdivision 3. The minimum fire state aid allocation amount is allocated to municipalities or independent nonprofit firefighting corporations with volunteer firefighters' relief associations or covered by the statewide volunteer firefighter plan. The amount is based on the number of active volunteer firefighters who are (1) members of the relief association as reported to the Office of the State Auditor in a specific annual financial reporting year as specified in paragraphs (b) to (d), or (2) covered by the statewide volunteer firefighter plan as specified in paragraph (e).\n(b) For relief associations established in calendar year 1993 or a prior year, the number of active volunteer firefighters equals the number of active volunteer firefighters who were members of the relief association as reported in the annual financial reporting for calendar year 1993, but not to exceed 30 active volunteer firefighters.\n(c) For relief associations established in calendar year 1994 through calendar year 1999, the number of active volunteer firefighters equals the number of active volunteer firefighters who were members of the relief association as reported in the annual financial reporting for calendar year 1998 to the Office of the State Auditor, but not to exceed 30 active volunteer firefighters.\n(d) For relief associations established after calendar year 1999, the number of active volunteer firefighters equals the number of active volunteer firefighters who are members of the relief association as reported in the first annual financial reporting submitted to the Office of the State Auditor, but not to exceed 20 active volunteer firefighters.\n(e) For a municipality or independent nonprofit firefighting corporation that is providing retirement coverage for volunteer firefighters by the statewide volunteer firefighter plan under chapter 353G, the number of active volunteer firefighters equals the number of active volunteer firefighters of the municipality or independent nonprofit firefighting corporation covered by the statewide plan as certified by the executive director of the Public Employees Retirement Association to the commissioner and the state auditor within 30 days of the date the municipality or independent nonprofit firefighting corporation begins coverage in the plan, but not to exceed 30 active firefighters.\nMS 2022 [Repealed, 2023 c 64 art 17 s 25]\nA municipality, an independent nonprofit firefighting corporation, a fire relief association, or the statewide volunteer firefighter plan may object to the amount of fire state aid apportioned to it by filing a written request with the commissioner to review and adjust the apportionment of funds within the state. The objection of a municipality, an independent nonprofit firefighting corporation, a fire relief association, or the voluntary statewide volunteer firefighter retirement plan must be filed with the commissioner within 60 days of the date the amount of apportioned fire state aid is paid. The decision of the commissioner is subject to appeal, review, and adjustment by the district court in the county in which the applicable municipality or independent nonprofit firefighting corporation is located or by the Ramsey County District Court with respect to the statewide volunteer firefighter plan.",
	"repealed": false
}