{
	"id": "624.731",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.731",
	"title": "624.731 TEAR GAS AND TEAR GAS COMPOUNDS; ELECTRONIC INCAPACITATION DEVICES.",
	"text": "For the purposes of this section:\n(1) \"authorized tear gas compound\" means a lachrymator or any substance composed of a mixture of a lachrymator including chloroacetophenone, alpha-chloroacetophenone; phenylchloromethylketone, orthochlorobenzalmalononitrile or oleoresin capsicum, commonly known as tear gas; and\n(2) \"electronic incapacitation device\" means a portable device which is designed or intended by the manufacturer to be used, offensively or defensively, to temporarily immobilize or incapacitate persons by means of electric pulse or current, including devices operating by means of carbon dioxide propellant. \"Electronic incapacitation device\" does not include cattle prods, electric fences, or other electric devices when used in agricultural, animal husbandry, or food production activities.\n(a) A person may possess and use an authorized tear gas compound in the exercise of reasonable force in defense of the person or the person's property only if it is propelled from an aerosol container, labeled with or accompanied by clearly written instructions as to its use and the dangers involved in its use, and dated to indicate its anticipated useful life.\n(b) A person may possess and use an electronic incapacitation device in the exercise of reasonable force in defense of the person or the person's property only if the electronic incapacitation device is labeled with or accompanied by clearly written instructions as to its use and the dangers involved in its use.\n(a) No person under the age of 16 may possess or use an authorized tear gas compound except by written permission of a parent or guardian, and no person under the age of 18 may possess or use an electronic incapacitation device.\n(b) No person prohibited from possessing a pistol pursuant to section 624.713, subdivision 1, clause (2), may possess or use an authorized tear gas compound or an electronic incapacitation device.\n(c) No person prohibited from possessing a pistol pursuant to section 624.713, subdivision 1, clauses (3) to (5), may possess or use an authorized tear gas compound or an electronic incapacitation device, except that the certificate or other proof required for possession of a handgun shall not apply.\n(d) No person shall possess or use tear gas or a tear gas compound other than an authorized tear gas compound.\n(a) No person shall knowingly, or with reason to know, use tear gas, a tear gas compound, an authorized tear gas compound, or an electronic incapacitation device on or against a peace officer who is in the performance of duties.\n(b) No person shall use tear gas, a tear gas compound, an authorized tear gas compound, or an electronic incapacitation device except as authorized in subdivision 2 or 6.\n(c) Tear gas, a tear gas compound, or an electronic incapacitation device shall legally constitute a weapon when it is used in the commission of a crime.\n(d) No person shall use tear gas or a tear gas compound in an immobilizing concentration against another person, except as otherwise permitted by subdivision 2.\nExcept as permitted by subdivision 6, no person shall knowingly furnish or sell tear gas or a tear gas compound to another person. No person shall knowingly furnish or sell an authorized tear gas compound or an electronic incapacitation device to a person prohibited from possessing it by subdivision 3. No person shall knowingly furnish or sell an authorized tear gas compound or an electronic incapacitation device which fails to meet the requirements of subdivision 2. No tear gas, tear gas compound, authorized tear gas compound, or electronic incapacitation device shall be sold or furnished on premises where 3.2 percent malt liquor as defined in section 340A.101, subdivision 19, is sold on an on-sale basis or where intoxicating liquor as defined in section 340A.101, subdivision 13, is sold on an on-sale or off-sale basis. No person shall sell tear gas, a tear gas compound, authorized tear gas compound, or electronic incapacitation device in violation of local licensing requirements.\nNothing in this section shall prohibit the possession or use of by, or the sale or furnishing of, tear gas, a tear gas compound, an authorized tear gas compound, or electronic incapacitation device to, a law enforcement agency, peace officer, the National Guard or reserves, or a member of the National Guard or reserves for use in their official duties, except that counties and municipalities may impose licensing requirements on sellers pursuant to subdivision 9.\nTear gas, tear gas compounds, and authorized tear gas compounds shall not be classified as an obnoxious or harmful gas, fluid, or substance under section 624.732.\n(a) The following violations of this section shall be considered a felony:\n(1) The possession or use of tear gas, a tear gas compound, an authorized tear gas compound, or an electronic incapacitation device by a person specified in subdivision 3, paragraph (b).\n(2) Knowingly selling or furnishing of tear gas, a tear gas compound, an authorized tear gas compound, or an electronic incapacitation device to a person specified in subdivision 3, paragraph (b).\n(3) The use of an electronic incapacitation device as prohibited in subdivision 4, paragraph (a).\n(4) The use of tear gas or a tear gas compound as prohibited in subdivision 4, paragraph (d).\n(b) The following violations of this section shall be considered a gross misdemeanor: (1) the prohibited use of tear gas, a tear gas compound, or an authorized tear gas compound as specified in subdivision 4, paragraph (a); (2) the use of an electronic incapacitation device except as allowed by subdivision 2 or 6.\n(c) The following violations of this section shall be considered a misdemeanor:\n(1) The possession or use of tear gas, a tear gas compound, an authorized tear gas compound, or an electronic incapacitation device which fails to meet the requirements of subdivision 2 by any person except as allowed by subdivision 6.\n(2) The possession or use of an authorized tear gas compound or an electronic incapacitation device by a person specified in subdivision 3, paragraph (a) or (c).\n(3) The use of tear gas, a tear gas compound, or an authorized tear gas compound except as allowed by subdivision 2 or 6.\n(4) Knowingly selling or furnishing an authorized tear gas compound or an electronic incapacitation device to a person specified in subdivision 3, paragraph (a) or (c).\n(5) Selling or furnishing of tear gas or a tear gas compound other than an authorized tear gas compound to any person except as allowed by subdivision 6.\n(6) Selling or furnishing of an authorized tear gas compound or an electronic incapacitation device on premises where intoxicating liquor is sold on an on-sale or off-sale basis or where 3.2 percent malt liquor is sold on an on-sale basis.\n(7) Selling an authorized tear gas compound or an electronic incapacitation device in violation of local licensing requirements.\n(a) For purposes of this section, \"municipality\" means statutory or home rule charter city or town.\n(b) There is hereby conferred upon the governing body of each county, statutory or home rule charter city and town in the state the authority to license the business of vendors of tear gas, tear gas compounds, authorized tear gas compounds, or electronic incapacitation devices within their respective jurisdictions, to impose a license fee therefor, to impose qualifications for obtaining a license, the duration of licenses and to restrict the number of licenses the governing body will issue.\n(c) Every person desiring a license from a local governing body shall file with the clerk of the municipality or the county board in the case of application to a county, a verified written application in the form to be prescribed by the local governing body.\n(d) The local governing body may establish the grounds, notice and hearing procedures for revocation of licenses issued pursuant to this section. The local governing body may also establish penalties for sale of tear gas, tear gas compounds, authorized tear gas compounds, or electronic incapacitation devices in violation of its licensing requirements.\nThis section shall be the exclusive regulation of the possession, use, and furnishing of tear gas, tear gas compounds, authorized tear gas compounds, and electronic incapacitation devices in Minnesota. This section shall supersede and preempt all regulation of the possession, use, and furnishing of tear gas, tear gas compounds, authorized tear gas compounds, and electronic incapacitation devices by political subdivisions.",
	"repealed": false
}