{
	"id": "144.587",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.587",
	"title": "144.587 REQUIREMENTS FOR SCREENING FOR ELIGIBILITY FOR HEALTH COVERAGE OR ASSISTANCE.",
	"text": "(a) The terms defined in this subdivision apply to this section and sections 144.588 to 144.589.\n(b) \"Charity care\" means the provision of free or discounted care to a patient according to a hospital's financial assistance policies.\n(c) \"Hospital\" means a private, nonprofit, or municipal hospital licensed under sections 144.50 to 144.56.\n(d) \"Insurance affordability program\" has the meaning given in section 256B.02, subdivision 19.\n(e) \"Navigator\" has the meaning given in section 62V.02, subdivision 9.\n(f) \"Presumptive eligibility\" has the meaning given in section 256B.057, subdivision 12.\n(g) \"Revenue recapture\" means the use of the procedures in chapter 270A to collect debt.\n(h) \"Uninsured service or treatment\" means any service or treatment that is not covered by:\n(1) a health plan, contract, or policy that provides health coverage to a patient; or\n(2) any other type of insurance coverage, including but not limited to no-fault automobile coverage, workers' compensation coverage, or liability coverage.\n(i) \"Unreasonable burden\" includes requiring a patient to apply for enrollment in a state or federal program for which the patient is obviously or categorically ineligible or has been found to be ineligible in the previous 12 months.\n(a) A hospital participating in the hospital presumptive eligibility program under section 256B.057, subdivision 12, must determine whether a patient who is uninsured or whose insurance coverage status is not known by the hospital is eligible for hospital presumptive eligibility coverage.\n(b) For any uninsured patient, including any patient the hospital determines is eligible for hospital presumptive eligibility coverage, and for any patient whose insurance coverage status is not known to the hospital, a hospital must:\n(1) if it is a certified application counselor organization, schedule an appointment for the patient with a certified application counselor to occur prior to discharge unless the occurrence of the appointment would delay discharge;\n(2) if the occurrence of the appointment under clause (1) would delay discharge or if the hospital is not a certified application counselor organization, schedule prior to discharge an appointment for the patient with a MNsure-certified navigator to occur after discharge unless the scheduling of an appointment would delay discharge; or\n(3) if the scheduling of an appointment under clause (2) would delay discharge or if the patient declines the scheduling of an appointment under clause (1) or (2), provide the patient with contact information for available MNsure-certified navigators who can meet the needs of the patient.\n(c) For any uninsured patient, including any patient the hospital determines is eligible for hospital presumptive eligibility coverage, and any patient whose insurance coverage status is not known to the hospital, a hospital must screen the patient for eligibility for charity care from the hospital. The hospital must attempt to complete the screening process for charity care in person or by telephone within 30 days after the patient receives services at the hospital or at the emergency department associated with the hospital.\n(a) Upon completion of the screening process in subdivision 2, paragraph (c), the hospital must determine whether the patient is ineligible or potentially eligible for charity care. When a hospital evaluates a patient's eligibility for charity care, hospital requests to the responsible party for verification of assets or income shall be limited to:\n(1) information that is reasonably necessary and readily available to determine eligibility; and\n(2) facts that are relevant to determine eligibility.\nA hospital must not demand duplicate forms of verification of assets.\n(b) If the patient is not ineligible for charity care, the hospital must assist the patient with applying for charity care and refer the patient to the appropriate department in the hospital for follow-up. A hospital may not impose application procedures for charity care that place an unreasonable burden on the individual patient, taking into account the individual patient's physical, mental, intellectual, or sensory deficiencies or language barriers that may hinder the patient's ability to comply with application procedures.\n(c) A hospital may not initiate any of the actions described in subdivision 4 while the patient's application for charity care is pending.\n(a) A hospital must not initiate one or more of the following actions until the hospital determines that the patient is ineligible for charity care or denies an application for charity care:\n(1) offering to enroll or enrolling the patient in a payment plan;\n(2) changing the terms of a patient's payment plan;\n(3) offering the patient a loan or line of credit, application materials for a loan or line of credit, or assistance with applying for a loan or line of credit, for the payment of medical debt;\n(4) referring a patient's debt for collections, including in-house collections, third-party collections, revenue recapture, or any other process for the collection of debt; or\n(5) accepting a credit card payment of over $500 for the medical debt owed to the hospital.\n(b) A violation of section 62J.807 is a violation of this subdivision.\n(a) A hospital must post notice of the availability of charity care from the hospital in at least the following locations: (1) areas of the hospital where patients are admitted or registered; (2) emergency departments; and (3) the portion of the hospital's financial services or billing department that is accessible to patients. The posted notice must be in all languages spoken by more than five percent of the population in the hospital's service area.\n(b) A hospital must make available on the hospital's website the current version of the hospital's charity care policy, a plain-language summary of the policy, and the hospital's charity care application form. The summary and application form must be available in all languages spoken by more than five percent of the population in the hospital's service area.\nA patient may decline to complete an insurance affordability program application to schedule an appointment with a certified application counselor, to schedule an appointment with a MNsure-certified navigator, to accept information about navigator services, to participate in the charity care screening process, or to apply for charity care.\nIn addition to the enforcement of this section by the commissioner, the attorney general may enforce this section under section 8.31.",
	"repealed": false
}