{
	"id": "123A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.33",
	"title": "123A.33 EMPLOYEES OF COOPERATIVE DISTRICTS UPON DISSOLUTION OR WITHDRAWAL.",
	"text": "For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Teacher\" means a teacher who is employed by a district or center listed in subdivision 2, except that it does not include a superintendent.\n(b) \"Cooperative\" means any district or center to which this section applies.\n(c) \"Withdrawal\" means a district's removal of its students from a program of instruction, counseling, or evaluation provided by a cooperative in order to provide the same educational services by other means.\n(d) \"Education support position\" means a position not requiring a teaching license in which an employee assists a teacher by providing instructional, counseling, or evaluative support services directly to students.\n(e) \"Education support employee\" means an employee holding an education support position.\nThis section applies to:\n(1) an education district organized according to sections 123A.15 to 123A.19;\n(2) a cooperative vocational center organized according to section 123A.22;\n(3) a joint powers district or board organized according to section 471.59 which employs teachers to provide instruction;\n(4) an intermediate district organized according to chapter 136D;\n(5) a service cooperative which employs teachers to provide instruction; and\n(6) districts participating in an agreement for the cooperative provision of special education services to children with disabilities according to section 125A.11.\n(a) Upon the termination of an agreement according to section 125A.11, a teacher employed to provide special education services by a district participating in the agreement will be afforded rights to employment by other districts according to subdivisions 4, 5, and 6. Nonlicensed employees of a participating district employed to provide special education services will, upon the agreement's termination, be afforded rights to employment by other participating districts according to subdivision 9.\n(b) Upon a district's withdrawal from the cooperative provision of special education under an agreement according to section 125A.11, a teacher employed to provide special education services by a participating district will be afforded rights to employment by other districts according to subdivisions 4, 7, and 8. Nonlicensed employees of a participating district employed to provide special education services will be afforded rights to employment by the withdrawing district according to subdivision 10.\nIn any year in which a cooperative dissolves or a member withdraws from a cooperative, the governing board of a cooperative must provide all teachers employed by the cooperative written notification by March 10 of:\n(1) the dissolution of the cooperative and the effective date of dissolution; or\n(2) the withdrawal of a member of the cooperative and the effective date of withdrawal.\n(a) This subdivision applies to a teacher previously employed in a member district who:\n(1) had a continuing contract with that member district;\n(2) has been continuously employed immediately after leaving that member district by one or more cooperatives that provided instruction to pupils enrolled in that member district; and\n(3) is either a probationary teacher or has a continuing contract with the cooperative that is dissolving.\n(b) A teacher may elect to resume the teacher's continuing contract with the member district by which the teacher was previously employed by filing a written notice of the election with the member board on or before March 20. Failure by a teacher to file a written notice by March 20 of the year the teacher receives a notice according to subdivision 4 constitutes a waiver of the teacher's rights under this subdivision.\nThe member district must make reasonable realignments of positions to accommodate the seniority rights of a teacher electing to resume continuing contract rights in the member district according to this subdivision.\nUpon returning the teacher shall receive credit for:\n(1) all years of continuous service under contract with the cooperative and the member district for all purposes relating to seniority, compensation, and employment benefits; and\n(2) the teacher's current educational attainment on the member district's salary schedule.\n(c) A teacher who does not elect to return to the member district according to this subdivision may exercise rights under subdivision 6.\n(a) This subdivision applies to a teacher who:\n(1) has a continuing contract with the cooperative; and\n(2) either did not have a continuing contract with any member district or does not return to a member district according to the procedures set forth in subdivision 5, paragraph (b).\n(b) By May 10 of the school year in which the cooperative provides the notice required by subdivision 4, clause (1), the cooperative must provide to each teacher described in subdivision 5 and this subdivision a written notice of available teaching positions in any member district to which the cooperative was providing services at the time of dissolution. Available teaching positions are all teaching positions that, during the school year following dissolution:\n(1) are positions for which the teacher is licensed; and\n(2) are not assigned to a continuing contract teacher employed by a member district after any reasonable realignments which may be necessary under the applicable provisions of section 122A.40, subdivision 10 or 11, to accommodate the seniority rights of teachers employed by the member district.\n(c) On or before June 1 of the school year in which the cooperative provides the notice required by subdivision 4, clause (1), any teacher wishing to do so must file with the board a written notice of the teacher's intention to exercise the teacher's rights to an available teaching position. Available teaching positions must be offered to teachers in order of their seniority within the dissolved cooperative.\n(d) Paragraph (e) applies to:\n(1) a district that was a member of a dissolved cooperative; or\n(2) any other district that, except as a result of open enrollment according to section 124D.03, provides essentially the same instruction provided by the dissolved cooperative to pupils enrolled in a former member district.\n(e) For five years following dissolution of a cooperative, a district to which this paragraph applies may not appoint a new teacher or assign a probationary or provisionally licensed teacher to any position requiring licensure in a field in which the dissolved cooperative provided instruction until the following conditions are met:\n(1) a district to which this paragraph applies has provided each teacher formerly employed by the dissolved cooperative, who holds the requisite license, written notice of the position; and\n(2) no teacher holding the requisite license has filed a written request to be appointed to the position with the board within 30 days of receiving the notice.\nIf no teacher files a request according to clause (2), the district may fill the position as it sees fit. During any part of the school year in which dissolution occurs and the first school year following dissolution, a teacher may file a request for an appointment according to this paragraph regardless of prior contractual commitments with other member districts. Available teaching positions must be offered to teachers in order of their seniority on a combined seniority list of the teachers employed by the cooperative and the appointing district.\n(f) A teacher appointed according to this subdivision is not required to serve a probationary period. The teacher shall receive credit on the appointing district's salary schedule for the teacher's years of continuous service under contract with the cooperative and the member district and the teacher's educational attainment at the time of appointment or shall receive a comparable salary, whichever is less. The teacher shall receive credit for accumulations of sick leave and rights to severance benefits as if the teacher had been employed by the member district during the teacher's years of employment by the cooperative.\n(a) This subdivision applies to a teacher previously employed by a member district who:\n(1) had a continuing contract with the member district which withdraws from a cooperative;\n(2) has been continuously employed immediately after leaving that member district by one or more cooperatives that provided instruction to pupils enrolled in that member district; and\n(3) is either a probationary teacher or has a continuing contract with the cooperative from which the member district is withdrawing.\n(b) A teacher may elect to resume the teacher's continuing contract with the withdrawing district by which the teacher was previously employed by filing a written notice of the election with the withdrawing school board on or before March 20. Failure by a teacher to file written notice by March 20 of the year the teacher receives a notice according to subdivision 4 constitutes a waiver of a teacher's rights under this subdivision.\nThe member district must make reasonable realignments of positions to accommodate the seniority rights of a teacher electing to resume continuing contract rights in the member district according to this subdivision.\nUpon returning, the teacher shall receive credit for:\n(1) all years of continuous service under contract with the cooperative and the member district for all purposes relating to seniority, compensation, and employment benefits; and\n(2) the teacher's current educational attainment on the member district's salary schedule.\n(a) This subdivision applies to a teacher who is placed on unrequested leave of absence, according to section 122A.40, subdivision 10 or 11, in the year in which the cooperative provides the notice required by subdivision 4, clause (2), by a cooperative from which a member district is withdrawing.\nThis subdivision applies to a district that, except as a result of open enrollment according to section 124D.03, provides essentially the same instruction provided by the cooperative to pupils enrolled in the withdrawing district.\n(b) A teacher shall be appointed by a district to which this subdivision applies to an available teaching position which:\n(1) is in a field of licensure in which pupils enrolled in the withdrawing district received instruction from the cooperative; and\n(2) is within the teacher's field of licensure.\nFor the purpose of this paragraph, an available teaching position means any position that is vacant or would otherwise be occupied by a probationary or provisionally licensed teacher.\n(c) A board may not appoint a new teacher to an available teaching position unless no teacher holding the requisite license on unrequested leave from the cooperative has filed a written request for appointment. The request must be filed with the board of the appointing district within 30 days of receiving written notice from the appointing board that it has an available teaching position. If no teacher holding the requisite license files a request according to this paragraph, the district may fill the position as it sees fit. Available teaching positions must be offered to teachers in order of their seniority on a combined seniority list of the teachers employed by the cooperative and the withdrawing member district.\n(d) A teacher appointed according to this subdivision is not required to serve a probationary period. The teacher shall receive credit on the appointing district's salary schedule for the teacher's years of continuous service under contract with the cooperative and the member district and the teacher's educational attainment at the time of appointment or shall receive a comparable salary, whichever is less. The teacher shall receive credit for accumulations of sick leave and rights to severance benefits as if the teacher had been employed by the member district during the teacher's years of employment by the cooperative.\n(a) A nonlicensed employee who is terminated by a cooperative that dissolves shall be appointed by a district that is a member of the dissolved cooperative to a position that is created within 36 months of the dissolution of the cooperative and is created as a result of the dissolution of the cooperative. A position must be offered to a nonlicensed employee, who fulfills the qualifications for that position, in order of the employee's seniority within the dissolved cooperative.\n(b) When an education support employee is terminated by a cooperative that dissolves, a district that is a member of the dissolved cooperative must appoint the employee to an education support position if the position is created within 36 months of the dissolution of the cooperative as a result of the dissolution. An education support position must be offered to an education support employee, who fulfills the qualifications for that position, in order of the employee's seniority within the dissolved cooperative.\n(c) An employee appointed according to this subdivision shall receive credit for the employee's:\n(1) continuous years of service with the cooperative on the appointing district's compensation schedule and seniority list; and\n(2) unused sick leave accumulated while employed by the cooperative.\n(d) Notwithstanding section 179A.12 or Minnesota Rules, part 5510.0510, subparts 1 to 4, a representation petition seeking the exclusive representation of a unit of education support employees employed by a district formerly a member of a dissolved cooperative may be considered by the commissioner of the bureau of mediation services at any time within 11 months of the dissolution of the cooperative.\n(a) A nonlicensed employee of a cooperative whose active employment is discontinued or reduced as a result of the withdrawal of a member district from the cooperative shall be appointed by the withdrawing member district to a position that is created within 36 months of the withdrawal and is created as a result of the withdrawal of the member district. A position must be offered to a nonlicensed employee, who fulfills the qualifications for that position, in order of the employee's seniority within the cooperative from which a member district withdraws.\n(b) When an education support employee of a cooperative has active employment discontinued or reduced as a result of the withdrawal of a member district from the cooperative, the withdrawing member district must appoint the employee to an education support position if the position is created within 36 months of the withdrawal as a result of the withdrawal of the member district. An education support position must be offered to an education support employee, who meets the qualifications for that position, in order of the employee's seniority within the cooperative from which a member district withdraws.\n(c) An employee appointed according to this subdivision shall receive credit for the employee's:\n(1) continuous years of service with the cooperative on the appointing district's compensation schedule and seniority list; and\n(2) unused sick leave accumulated while employed by the cooperative.\n(d) Notwithstanding section 179A.12 or Minnesota Rules, part 5510.0510, subparts 1 to 4, a representation petition seeking the exclusive representation of a unit of education support employees employed by a member district which has withdrawn from a cooperative may be considered by the commissioner of the bureau of mediation services at any time within 11 months of the district's withdrawal from the cooperative.\n(a) Notwithstanding subdivisions 1 to 10, paragraphs (b) and (c) apply to cooperatives that merge.\n(b) If a cooperative enters into an agreement to merge with another cooperative, the boards of the cooperatives and the exclusive representatives of the teachers in the cooperatives and the teachers in each member district may negotiate a plan to assign or employ in a member district or to place on unrequested leave of absence all teachers whose positions are discontinued as a result of the agreement. If plans are negotiated and if the boards determine the plans are compatible, the boards must include the plans in their agreement.\n(c) If compatible plans are not negotiated under paragraph (b) by the March 1 preceding the effective date of the merger of the cooperatives, subdivisions 2 to 10 apply to teachers and nonlicensed employees whose positions are terminated as a result of an agreement to merge cooperatives.",
	"repealed": false
}