{
	"id": "256S.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.02",
	"title": "256S.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms in this section have the meanings given unless otherwise explicitly provided.\n\"Adjusted base wage\" refers to adjusted base wage described in section 256S.214.\n\"Annual average statewide percentage increase in nursing facility operating payment rates\" means the percentage change in the average statewide nursing facility operating payment rate under chapter 256R effective January 1 compared to the average statewide nursing facility operating payment rate that was effective on the previous January 1.\n\"Case mix classification\" is the resident class to which the elderly waiver participant would be assigned under Minnesota Rules, parts 9549.0051 to 9549.0059.\n\"Commissioner\" means the commissioner of the Department of Human Services.\n\"Component service\" means services that collectively comprise customized living services.\n\"Component service rate\" means the rate established for each component service.\n\"Consumer-directed community supports\" refers to a service option available under the elderly waiver that provides a participant with flexibility and responsibility for directing the participant's services and supports, including hiring and managing direct care staff. Consumer-directed community supports may include services, supports, or items currently available under the elderly waiver, and allowable services that provide needed supports to participants.\n\"Customized living monthly service rate limit\" means the monthly dollar limit established by the commissioner for all component services based on a participant's case mix classification.\n\"Customized living service plan\" means the individualized plan for customized living services that details component services to be delivered by the provider under the authorized service rate.\n\"Customized living service rate\" means the rate established for all combined component services based on an individualized customized living service plan approved by the lead agency, not to exceed the customized living monthly service rate limit based on the participant's case mix classification.\n\"Customized living services\" are services comprised of component services that are included in an individually designed plan for the service.\n\"Department\" means the Department of Human Services.\n\"Elderly waiver\" means the federally approved home and community-based services waiver for persons 65 years of age and older, authorized under section 1915(c) of the Social Security Act.\n\"Lead agency\" means a county administering long-term care consultation services as defined in section 256B.0911, subdivision 10, or a tribe or managed care organization under contract with the commissioner to administer long-term care consultation services as defined in section 256B.0911, subdivision 10.\n\"Maintenance needs allowance\" means the dollar amount calculated under section 256S.05, subdivision 3.\n\"Managed care organization\" means a prepaid health plan or county-based purchasing plan with liability for elderly waiver services under sections 256B.69, subdivisions 6b and 23, and 256B.692.\n\"Monthly case mix budget cap\" means the total dollar amount available to support elderly waiver and state plan home care services for a participant based on the participant's case mix classification.\n\"Nursing facility case mix adjusted total payment rate\" refers to \"case mix adjusted total payment rate\" described in section 256R.22.\n\"Nursing facility level of care determination\" refers to determination of institutional level of care described in section 256B.0911, subdivision 26.\n\"Private agency\" means any agency that provides case management but is not a lead agency.\n\"Service rate\" means the rate established by the commissioner for elderly waiver and state plan home care services.\n\"Service rate limit\" means the service rate limit established by the commissioner for certain elderly waiver services.\n\"State plan home care services\" refers to home care services described in section 256B.0651, subdivision 2.\n\"24-hour customized living monthly service rate limit\" means the monthly dollar limit for all component services based on (1) a participant's case mix classification, and (2) eligibility for 24-hour customized living as described in section 256S.20, subdivision 4.",
	"repealed": false
}