{
	"id": "124E.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.25",
	"title": "124E.25 PAYMENT OF AIDS TO CHARTER SCHOOLS.",
	"text": "Notwithstanding section 127A.45, subdivision 3, if the current year aid payment percentage under section 127A.45, subdivision 2, paragraph (d), is 90 or greater, aid payments for the current fiscal year to a charter school shall be of an equal amount on each of the 24 payment dates. Notwithstanding section 127A.45, subdivision 3, if the current year aid payment percentage under section 127A.45, subdivision 2, paragraph (d), is less than 90, aid payments for the current fiscal year to a charter school shall be of an equal amount on each of the 16 payment dates in July through February.\n(a) Notwithstanding subdivision 1 and section 127A.45, for a charter school ceasing operation on or before June 30, for the payment periods occurring after the school ceases serving students, the commissioner shall withhold the estimated state aid owed the school. The charter school board of directors and authorizer must submit to the commissioner a closure plan under chapter 317A, and financial information about the school's liabilities and assets. After receiving the closure plan, financial information, an audit of pupil counts, and documented lease expenditures from the charter school and monitoring special education expenditures, the commissioner may release cash withheld and may continue regular payments up to the current year payment percentages if further amounts are owed. If, based on audits and monitoring, the school received state aid in excess of the amount owed, the commissioner shall retain aid withheld sufficient to eliminate the aid overpayment.\n(b) For a charter school ceasing operations before or at the end of a school year, notwithstanding section 127A.45, subdivision 3, the commissioner may make preliminary final payments after the school submits the closure plan, an audit of pupil counts, documented lease expenditures, and Uniform Financial Accounting and Reporting Standards (UFARS) financial data and the commissioner monitors special education expenditures for the final year of operation. The commissioner may make the final payment after receiving audited financial statements under section 123B.77, subdivision 3.\n(c) Notwithstanding sections 317A.701 to 317A.791, after closing a charter school and satisfying creditors, remaining cash and investment balances shall be returned by the commissioner to the state general fund.\n(a) To receive state aid payments under this section, a charter school in its first three years of operation must submit to the commissioner a school calendar in the form and manner requested by the commissioner and a quarterly report. The quarterly report must list each student by grade, show the student's start and end dates, if applicable, and, for any student participating in a learning year program, the report must list the hours and times of learning year activities. The charter school must submit the report to the commissioner not more than two weeks after the end of the calendar quarter. The commissioner must develop a web-based reporting form for charter schools to use when submitting quarterly enrollment reports.\n(b) To receive state aid payments under this section, a charter school in its fourth and subsequent year of operation must submit a school calendar and enrollment information to the commissioner in the form and manner requested by the commissioner.\n(c) A charter school must have a valid, signed contract under section 124E.10, subdivision 1, on file with the commissioner at least 15 days before the date of first payment of state aid for the fiscal year.\n(d) The commissioner shall compute state aid entitlements for a charter school only for the portion of a school year for which it has a valid, signed contract under section 124E.10, subdivision 1.\n(a) The commissioner may reduce a charter school's state aid under section 127A.42 or 127A.43 if the charter school board fails to correct a violation under this chapter.\n(b) The commissioner may reduce a charter school's state aid by an amount not to exceed 60 percent of the charter school's basic revenue for the period of time a law was violated.\n(a) If a charter school fails to comply with the commissioner's directive to return, for cause, federal or state funds administered by the department, the commissioner may withhold an amount of state aid sufficient to satisfy the directive.\n(b) If after receiving an undisputed invoice for goods and services, a charter school fails to pay the state of Minnesota, a school district, intermediate school district, or service cooperative within the timeline under section 471.425, the commissioner may withhold an amount of state aid sufficient to satisfy the claim and shall distribute the withheld aid to the interested state agency, school district, intermediate school district, or service cooperative. An interested state agency, school district, intermediate school district, or education cooperative shall notify the commissioner when a charter school fails to pay an undisputed invoice within 75 business days of when it received the original invoice.",
	"repealed": false
}