{
	"id": "270C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.02",
	"title": "270C.02 DEPARTMENT OF REVENUE; COMMISSIONER.",
	"text": "The Department of Revenue is under the supervision and control of the commissioner. The commissioner shall be appointed by the governor under the provisions of section 15.06. The commissioner shall be selected on the basis of ability and experience in the field of tax administration and without regard to political affiliations.\n(a) The commissioner may organize the department as the commissioner deems necessary, and appoint one deputy commissioner, a department secretary, directors of divisions, and such other officers, employees, and agents, as the commissioner deems necessary to carry out the duties, responsibilities, and authority entrusted to the commissioner. The commissioner may define the duties of such officers, employees, and agents, and delegate to them any of the commissioner's powers or duties, subject to the commissioner's control and under such conditions as the commissioner may prescribe. Appointments to exercise delegated power to sign documents which require the signature of the commissioner or a delegate by law shall be by written order filed with the secretary of state. The delegations of authority granted by the commissioner remain in effect until revoked by the commissioner or a successor commissioner.\n(b) The commissioner may appoint agents as the commissioner considers necessary to make examinations and determinations. The agents have the rights and powers conferred on the commissioner to subpoena, examine, and copy books, records, papers, or memoranda, subpoena witnesses, administer oaths and affirmations, and take testimony.\nThe commissioner shall appoint and employ additional employees and other agents, purchase supplies or materials, or incur other expenditures in the administration and enforcement of state revenue laws as considered necessary. The salaries of all agents and employees provided for in this chapter shall be fixed by the appointing authority, subject to the approval of the commissioner of management and budget.\nThe commissioner shall be provided with suitable and necessary office furniture, supplies, stationery, books, periodicals, newspapers, maps, and financial and commercial reports; and all necessary expenses therefor shall be audited and paid as other expenses are audited and paid. The actual necessary expenses of the commissioner, the commissioner's employees and agents, and such experts and assistants as may be employed by the commissioner while traveling on the business of the department, shall be paid by the state. The expenditures must be sworn to by the party who incurred the expense and approved by the commissioner.\nThe commissioner is the filing officer and custodian of the books, files, and records of the department. The commissioner may certify copies of the books, files, and records in the custody of the commissioner for all purposes in the same manner as other custodians of public records. The commissioner may authorize other employees of the department to certify books, files, and records in the custody of the commissioner. The authorization must be made by a written order stating the documents that may be certified and must be filed with the secretary of state.\nThe department shall have a seal engraved with the words, \"State of Minnesota, Department of Revenue.\" Such seal may be used to authenticate the official acts of the commissioner or any other employees of the department, but the failure to use the seal shall not invalidate any such acts. Duplicate seals may be provided for the use of directors of divisions or other employees of the department.",
	"repealed": false
}