{
	"id": "92.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.45",
	"title": "92.45 STATE LAND ON MEANDERED LAKES WITHDRAWN FROM SALE.",
	"text": "(a) All state lands, excluding school trust lands, bordering on or adjacent to meandered lakes and other public waters and watercourses, with the live timber growing on them, are withdrawn from sale except as provided in this section. The commissioner of natural resources may sell the timber as otherwise provided by law for cutting and removal under conditions the commissioner prescribes. The conditions must be in accordance with approved, sustained-yield forestry practices. The commissioner must reserve the timber and impose other conditions the commissioner deems necessary to protect watersheds, wildlife habitat, shorelines, and scenic features. Within the area in Cook, Lake, and St. Louis Counties described in the Act of Congress approved July 10, 1930, (Statutes at Large, volume 46, page 1020), the timber on state lands is subject to restrictions like those now imposed by the act on federal lands.\n(b) The following land is reserved for public travel: of all land bordering on or adjacent to meandered lakes and other public waters and watercourses and withdrawn from sale, a strip two rods wide, the ordinary high-water mark being its waterside boundary, and its landside boundary a line drawn parallel to the ordinary high-water mark and two rods distant landward from it. Wherever the conformation of the shore line or conditions require, the commissioner must reserve a wider strip.\n(c) Except for sales under section 282.018, subdivision 1, when a state agency or any other unit of government requests the legislature to authorize the sale of state lands bordering on or adjacent to meandered lakes and other public waters and watercourses, the commissioner shall evaluate the lands and their public benefits and make recommendations on the proposed dispositions to the committees of the legislature with jurisdiction over natural resources. The commissioner shall include any recommendations of the commissioner for disposition of lands withdrawn from sale under this section over which the commissioner has jurisdiction. The commissioner's recommendations may include a public sale, sale to a private party, acquisition by the commissioner for public purposes, retention of a conservation easement for shoreland preservation by the commissioner under chapter 84C, or a cooperative management agreement with, or transfer to, another unit of government.\n(d) The commissioner may sell state lands bordering on or adjacent to the Mississippi River or any lakes, waters, and watercourses in its bottom lands, desired or needed by the United States government for, or in connection with, any project heretofore authorized by Congress, to improve navigation in the Mississippi River at public sale according to law, as in other cases, upon application by an authorized United States official. The application must describe the land and include a map showing its location with reference to adjoining properties.",
	"repealed": false
}