{
	"id": "97C.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.605",
	"title": "97C.605 TURTLES.",
	"text": "(a) A person may not take, possess, or transport turtles without a resident angling license and a recreational turtle license.\n(b) Turtles taken from the wild are for personal use only and may not be resold.\nMS 2022 [Repealed, 2023 c 60 art 4 s 112]\nMS 2022 [Repealed, 2023 c 60 art 4 s 112]\nMS 2022 [Repealed, 2023 c 60 art 4 s 112]\n(a) A person does not need the licenses specified under subdivision 1:\n(1) when buying turtles from a licensed aquatic farm or licensed private fish hatchery for resale at a retail outlet or restaurant;\n(2) when buying a turtle at a retail outlet;\n(3) to take, possess, and rent up to 25 turtles greater than four inches in length for the purpose of providing the turtles to participants at a nonprofit turtle race, if the person is a resident under age 18. The person is responsible for the well-being of the turtles; or\n(4) if under 16 years of age when possessing turtles. Notwithstanding any other law to the contrary, a person under the age of 16 may possess, without a license, up to three snapping or western painted turtles, provided the turtles are possessed for personal use and are within the applicable length and width requirements.\n(b) A person with an aquatic farm license with a turtle endorsement or a private fish hatchery license with a turtle endorsement may sell, obtain, possess, transport, and propagate turtles and turtle eggs without the licenses specified under subdivision 1.\n(c) Turtles possessed under this subdivision may not be released back into the wild.\nA person may not take turtles by using:\n(1) explosives, drugs, poisons, lime, and other harmful substances;\n(2) traps;\n(3) nets other than anglers' fish landing nets;\n(4) commercial equipment;\n(5) firearms and ammunition;\n(6) bow and arrow or crossbow; or\n(7) spears, harpoons, or any other implements that impale turtles.\n[Repealed, 2002 c 351 s 34]\nMS 2022 [Repealed, 2023 c 60 art 4 s 112]\nThe commissioner may adopt rules for taking turtles. The commissioner may prescribe seasons, limits, closed areas, and other restrictions and requirements the commissioner deems necessary for the conservation of turtles.",
	"repealed": false
}