{
	"id": "524.5-420",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-420",
	"title": "524.5-420 REPORTS; APPOINTMENT OF VISITOR; MONITORING; COURT ORDERS.",
	"text": "(a) A conservator shall report to the court for administration of the estate annually unless the court otherwise directs, upon resignation or removal, upon termination of the conservatorship, and at other times as the court directs. An order, after notice and hearing, allowing an intermediate report of a conservator adjudicates liabilities concerning the matters adequately disclosed in the accounting. An order, after notice and hearing, allowing a final report adjudicates all previously unsettled liabilities relating to the conservatorship.\n(b) A report must state or contain a listing of the assets of the estate under the conservator's control and a listing of the receipts, disbursements, and distributions during the reporting period.\n(c) The report must also state an address or post office box and a telephone number where the conservator can be contacted.\n(d) A conservator shall report to the court in writing within 30 days of the occurrence of any of the events listed in this paragraph. The conservator must report any of the occurrences in this paragraph and follow the same reporting requirements in this paragraph for any employee of the conservator responsible for exercising powers and duties under the conservatorship. A copy of the report must be provided to the person subject to conservatorship and to interested persons of record with the court. A conservator shall report when:\n(1) the conservator is removed for cause from serving as a guardian or conservator, and if so, the case number and court location;\n(2) the conservator has a professional license from an agency listed under section 524.5-118, subdivision 2a, denied, conditioned, suspended, revoked, or canceled, and if so, the licensing agency and license number, and the basis for denial, condition, suspension, revocation, or cancellation of the license;\n(3) the conservator is found civilly liable in an action that involves fraud, misrepresentation, material omission, misappropriation, theft, or conversion, and if so, the case number and court location;\n(4) the conservator files for or receives protection under the bankruptcy laws, and if so, the case number and court location;\n(5) a civil monetary judgment is entered against the conservator, and if so, the case number, court location, and outstanding amount owed;\n(6) the conservator is convicted of a crime other than a petty misdemeanor or traffic offense, and if so, the case number and court location; or\n(7) an order for protection or harassment restraining order is issued against the conservator, and if so, the case number and court location.\n(e) A person subject to conservatorship or an interested person of record with the court may submit to the court a written statement disputing account statements regarding the administration of the estate or addressing any disciplinary or legal action that is contained in the reports and may petition the court for any order that is in the best interests of the person subject to conservatorship and the estate or for other appropriate relief.\n(f) An interested person may notify the court in writing that the interested person does not wish to receive copies of reports required under this section after which time neither the court nor any other person is required to give notice to any person who has waived notice.\n(g) The court may appoint a visitor to review a report or plan, interview the person subject to conservatorship or conservator, and make any other investigation the court directs. In connection with a report, the court may order a conservator to submit the assets of the estate to an appropriate examination to be made in a manner the court directs.\n(h) The court shall establish a system for monitoring of conservatorships, including the filing and review of conservators' reports and plans. If an annual report is not filed within 60 days of the required date, the court shall issue an order to show cause. Unless otherwise ordered by the court, a report under this section shall be filed publicly.\n(i) If there is no acting guardian, a conservator that becomes aware of the death of the person subject to conservatorship shall notify in writing; orally; or by phone, text message, email, or electronic service, all known interested persons as defined by section 524.5-102, subdivision 7, clauses (iii), (iv), (v), (vi), (ix), and (xi), and the court as soon as is reasonably practical, that the person subject to conservatorship has died. The conservator may delegate this task under reasonable circumstances.\n(j) If a conservator fails to comply with this section, the court may decline to appoint that person as a guardian or conservator, or may remove a person as guardian or conservator.",
	"repealed": false
}