{
	"id": "501C.0813",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0813",
	"title": "501C.0813 DUTY TO INFORM AND REPORT.",
	"text": "(a) A trustee shall keep the qualified beneficiaries of an irrevocable trust reasonably informed about the administration of the trust and of the material facts necessary to protect their interests. Unless unreasonable under the circumstances, a trustee shall promptly respond to a beneficiary's request for information related to the administration of an irrevocable trust.\n(b) A settlor may provide, by an express provision in the trust instrument, that paragraph (a) shall not apply to the administration of a trust during any period when the trustee is required by the terms of the trust to keep the settlor or another person, including one or more beneficiaries of the trust or a representative of a beneficiary, reasonably informed about the administration of the trust and of the material facts necessary to protect the beneficiaries' interests. A trustee shall promptly respond to such person's requests for information related to the administration of the trust. Unless the terms of the trust provide otherwise, any person to whom trust administration information is furnished shall have standing to enforce the trust but acts in a nonfiduciary capacity and has no duty or responsibility to enforce the trust or to take any other action with respect to the information furnished. If a settlor has, by an express provision in the trust instrument, prohibited a trustee from sharing information with beneficiaries, including but not limited to accountings, a trustee shall have the right to seek judicial approval by filing a petition with the court. Such petition shall comply with the notice provisions of section 501C.0203.\n(c) A beneficiary may waive the right to information otherwise required to be furnished under paragraph (a). A beneficiary may withdraw any such waiver previously given. Any waiver or withdrawal of a waiver must be made by notice delivered to the trustee.",
	"repealed": false
}