{
	"id": "609.891",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.891",
	"title": "609.891 UNAUTHORIZED COMPUTER ACCESS.",
	"text": "A person is guilty of unauthorized computer access if the person intentionally and without authorization attempts to or does penetrate a computer security system or electronic terminal.\n(a) A person who violates subdivision 1 in a manner that creates a grave risk of causing the death of a person is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(b) A person who is convicted of a second or subsequent gross misdemeanor violation of subdivision 1 is guilty of a felony and may be sentenced under paragraph (a).\n(c) A person who violates subdivision 1 by accessing, or attempting to access, an electronic terminal through opening any panel or access door without authorization and placing or attaching, or attempting to place or attach, an electronic device to capture, store, or communicate access device information is guilty of a felony.\n(a) A person who violates subdivision 1 in a manner that creates a risk to public health and safety is guilty of a gross misdemeanor and may be sentenced to imprisonment for a term of not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(b) A person who violates subdivision 1 in a manner that compromises the security of data that are protected under section 609.52, subdivision 2, paragraph (a), clause (8), or are not public data as defined in section 13.02, subdivision 8a, is guilty of a gross misdemeanor and may be sentenced under paragraph (a).\n(c) A person who violates subdivision 1 and gains access to personal data is guilty of a gross misdemeanor and may be sentenced under paragraph (a).\n(d) A person who is convicted of a second or subsequent misdemeanor violation of subdivision 1 within five years is guilty of a gross misdemeanor and may be sentenced under paragraph (a).\n(e) A person who violates subdivision 1 by accessing, or attempting to access, an electronic terminal through opening, or attempting to open, any panel or access door without authorization is guilty of a gross misdemeanor and may be sentenced under paragraph (a).\nA person who violates subdivision 1 is guilty of a misdemeanor and may be sentenced to imprisonment for a term of not more than 90 days or to payment of a fine of not more than $1,000, or both.",
	"repealed": false
}