{
	"id": "626.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.93",
	"title": "626.93 LAW ENFORCEMENT AUTHORITY; TRIBAL PEACE OFFICERS.",
	"text": "As used in this section, \"tribe\" means a federally recognized Indian tribe, as defined in United States Code, title 25, section 450b(e), located within the state of Minnesota, but does not include a tribe, band, or community described in section 626.91 or 626.92, or the Mille Lacs Band of Chippewa Indians for purposes of exercising law enforcement authority in Mille Lacs County only under section 626.90. Tribe includes the Mille Lacs Band of Chippewa Indians for purposes of exercising law enforcement authority on Mille Lacs Band of Chippewa Indians Reservation lands which lie outside of Mille Lacs County.\nA tribe may exercise authority under subdivision 3 only if it satisfies the following requirements:\n(1) the tribe agrees to be subject to liability for its torts and those of its officers, employees, and agents acting within the scope of their employment or duties arising out of a law enforcement agency function conferred by section 626.84, subdivision 1, paragraph (f), to the same extent as a municipality under chapter 466, and the tribe further agrees, notwithstanding section 16C.05, subdivision 7, to waive its sovereign immunity with respect to claims arising from this liability;\n(2) the tribe files with the Board of Peace Officer Standards and Training a bond or certificate of insurance for liability coverage with the maximum single occurrence amounts set forth in section 466.04 and an annual cap for all occurrences within a year of three times the single occurrence amount;\n(3) the tribe files with the Board of Peace Officer Standards and Training a certificate of insurance for liability of its law enforcement officers, employees, and agents for lawsuits under the United States Constitution; and\n(4) if the tribe's governing body has authorized its peace officers to enforce criminal laws within the boundaries of the tribe's reservation, the tribe agrees to be subject to section 13.82 and any other laws of the state relating to data practices of law enforcement agencies.\nIf the requirements of subdivision 2 are met, the Tribe has concurrent jurisdictional authority under this section with the local county sheriff within the geographical boundaries of the Tribe's reservation to enforce state criminal law.\nIn order to coordinate, define, and regulate the provision of law enforcement services and to provide for mutual aid and cooperation, governmental units and the Tribe may enter into agreements under section 471.59. For the purposes of entering into these agreements, the Tribe is considered a \"governmental unit\" as that term is defined in section 471.59, subdivision 1.\nNothing in this section shall be construed to restrict a tribe's authority under federal law.\nThis section is limited to law enforcement authority only, and nothing in this section shall affect any other jurisdictional relationships or disputes involving a tribe or current reservation boundaries.\nMS 2022 [Repealed, 2023 c 52 art 10 s 34]",
	"repealed": false
}