{
	"id": "116A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.11",
	"title": "116A.11 VIEWERS; APPOINTMENT; QUALIFICATION.",
	"text": "Following the filing of the order for a detailed survey the board or court shall make an order appointing as viewers three disinterested resident landowners of the county or counties affected.\nWithin 30 days after the filing of the final report and survey of the engineer, the auditor or court administrator shall make an order designating the time and place of the first meeting of the viewers and shall issue to the viewers a certified copy of the order appointing them and the order designating the time and place of their first meeting. At the meeting and before entering upon their duties, the viewers shall take and subscribe an oath to faithfully perform their duties.\nIf any viewer shall fail to qualify at the meeting, the auditor or court shall designate some other qualified person to take that viewer's place.\nThe viewers, with or without the engineer, shall estimate damages to all lands and properties affected by the proposed system and shall report their findings. The report shall show in tabular form the description of each lot and tract, or fraction thereof, under separate ownership, damaged and the names of the owners as the same appear on the current tax duplicate of the county. Estimated damages shall be reported on all lands owned by the state the same as upon taxable lands. The viewers shall report all estimated damages that will result to all railways and other utilities, including lands and property used for railway or other utility purposes. In case the viewers are unable to agree, each viewer shall state separately that viewer's findings on any matter disagreed upon. A majority of the viewers shall be competent to perform the duties required of them by sections 116A.01 to 116A.26.\nUpon the completion of their work, the viewers shall file their report with the auditor or court administrator. They shall file with the report a detailed statement showing the actual time they were engaged and expenses incurred and shall be reimbursed at such a rate as determined by the board or court. The viewers shall perform their duties and make their report at the earliest possible date following their first meeting. If the report be filed with the court administrator, a copy thereof shall also be filed with the auditor of each county affected.",
	"repealed": false
}