{
	"id": "97A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.56",
	"title": "97A.56 FERAL SWINE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Domestic hogs\" means members of the subspecies Sus scrofa domesticus.\n(c) \"Feral swine\" means an animal of the family Suidae or Tayassuidae that lives in the wild or has lived in the wild during any part of the animal's lifetime. Feral swine includes released domestic hogs, unless the owner satisfies the notification requirements of section 17.457, subdivision 4, and recovers the released domestic hogs within 72 hours of notification.\n(d) \"Release\" has the meaning given under section 17.457, subdivision 1.\n(a) Unless authorized by permit under section 17.457, subdivision 3, a person may not possess or release feral swine or otherwise allow feral swine to run at large.\n(b) A person may not hunt or trap feral swine, except as authorized by the commissioner for feral swine control or eradication. It is not a violation of this section if a person shoots a feral swine and reports the taking to the commissioner within 24 hours. All feral swine taken in this manner must be surrendered to the commissioner.\n(c) A person who violates this subdivision is guilty of a misdemeanor.\n(d) A person who violates this subdivision is liable for the actual costs incurred by the state for the possession or release of the feral swine.\n(e) A person who violates this subdivision is liable for the damages caused by the possession or release of the feral swine.\nA person authorized under game and fish laws to take feral swine is not liable to the owner for the value of the animals.\nThe commissioner, in cooperation with the commissioner of agriculture and the Board of Animal Health, must develop protocols for responding to the release of domestic hogs and feral swine, including reporting requirements, interagency communications, and other actions necessary to resolve the release.",
	"repealed": false
}