{
	"id": "245.4903",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4903",
	"title": "245.4903 CULTURAL AND ETHNIC MINORITY INFRASTRUCTURE GRANT PROGRAM.",
	"text": "The commissioner of human services must establish a cultural and ethnic minority infrastructure grant program to ensure that mental health and substance use disorder treatment supports and services are culturally specific and culturally responsive to meet the cultural needs of communities served.\nAn eligible applicant is a licensed entity or provider from a cultural or ethnic minority population that:\n(1) provides mental health or substance use disorder treatment services and supports to individuals from cultural and ethnic minority populations, including members of those populations who identify as lesbian, gay, bisexual, transgender, or queer;\n(2) provides, or is qualified and has the capacity to provide, clinical supervision and support to members of culturally diverse and ethnic minority communities so they may become qualified mental health and substance use disorder treatment providers; or\n(3) has the capacity and experience to provide training for mental health and substance use disorder treatment providers on cultural competency and cultural humility.\n(a) Grantees must engage in activities and provide supportive services to ensure and increase equitable access to culturally specific and responsive care and build organizational and professional capacity for licensure and certification for the communities served. Allowable grant activities include but are not limited to:\n(1) providing workforce development activities focused on recruiting, supporting, training, and supervising mental health and substance use disorder practitioners and professionals from diverse racial, cultural, and ethnic communities;\n(2) helping members of racial and ethnic minority communities become qualified mental health and substance use disorder professionals, practitioners, clinical supervisors, recovery peer specialists, mental health certified peer specialists, and mental health certified family peer specialists;\n(3) providing culturally specific outreach, early intervention, trauma-informed services, and recovery support in mental health and substance use disorder services;\n(4) providing trauma-informed and culturally responsive mental health and substance use disorder supports and services to children and families, youth, or adults who are from cultural and ethnic minority backgrounds and are uninsured or underinsured;\n(5) expanding mental health and substance use disorder services, particularly in greater Minnesota;\n(6) training mental health and substance use disorder treatment providers on cultural competency and cultural humility;\n(7) providing activities that increase the availability of culturally responsive mental health and substance use disorder services for children and families, youth, or adults, or that increase the availability of substance use disorder services for individuals from cultural and ethnic minorities in the state;\n(8) providing interpreter services at intensive residential treatment facilities, children's residential treatment centers, or psychiatric residential treatment facilities in order for children or adults with limited English proficiency or children or adults who are fluent in another language to be able to access treatment; and\n(9) paying for case-specific consultation between a mental health professional and the appropriate diverse mental health professional in order to facilitate the provision of services that are culturally appropriate to a client's needs.\n(b) The commissioner must assist grantees with meeting third-party credentialing requirements, and grantees must obtain all available third-party reimbursement sources as a condition of receiving grant money. Grantees must serve individuals from cultural and ethnic minority communities regardless of health coverage status or ability to pay.\nGrantees must provide regular data summaries to the commissioner for purposes of evaluating the effectiveness of the cultural and ethnic minority infrastructure grant program. The commissioner must use identified culturally appropriate outcome measures instruments to evaluate outcomes and must evaluate program activities by analyzing whether the program:\n(1) increased access to culturally specific services for individuals from cultural and ethnic minority communities across the state;\n(2) increased the number of individuals from cultural and ethnic minority communities served by grantees;\n(3) increased cultural responsiveness and cultural competency of mental health and substance use disorder treatment providers;\n(4) increased the number of mental health and substance use disorder treatment providers and clinical supervisors from cultural and ethnic minority communities;\n(5) increased the number of mental health and substance use disorder treatment organizations owned, managed, or led by individuals who are Black, Indigenous, or people of color;\n(6) reduced health disparities through improved clinical and functional outcomes for those accessing services; and\n(7) led to an overall increase in culturally specific mental health and substance use disorder service availability.",
	"repealed": false
}