{
	"id": "461.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/461.12",
	"title": "461.12 MUNICIPAL LICENSE OF TOBACCO, TOBACCO-RELATED DEVICES, AND SIMILAR PRODUCTS.",
	"text": "A town board or the governing body of a home rule charter or statutory city may license and regulate the retail sale of tobacco, tobacco-related devices, and electronic delivery devices as defined in section 609.685, subdivision 1, and nicotine and lobelia delivery products as described in section 609.6855, and establish a license fee for sales to recover the estimated cost of enforcing this chapter. The county board shall license and regulate the sale of tobacco, tobacco-related devices, electronic delivery devices, and nicotine and lobelia products in unorganized territory of the county except on the State Fairgrounds and in a town or a home rule charter or statutory city if the town or city does not license and regulate retail sales of tobacco, tobacco-related devices, electronic delivery devices, and nicotine and lobelia delivery products. The State Agricultural Society shall license and regulate the sale of tobacco, tobacco-related devices, electronic delivery devices, and nicotine and lobelia delivery products on the State Fairgrounds. Retail establishments licensed by a town or city to sell tobacco, tobacco-related devices, electronic delivery devices, and nicotine and lobelia delivery products are not required to obtain a second license for the same location under the licensing ordinance of the county.\nIf a licensee or employee of a licensee sells, gives, or otherwise furnishes tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products to a person under the age of 21 years, or violates any other provision of this chapter, the licensee shall be charged an administrative penalty of $300 for the first violation. An administrative penalty of $600 must be imposed for a second violation at the same location within 36 months after the initial violation. For a third or any subsequent violation at the same location within 36 months after the initial violation, an administrative penalty of $1,000 must be imposed, and the licensee's authority to sell tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products at that location must be suspended for not less than seven days and may be revoked. No suspension, revocation, or other penalty may take effect until the licensee has received notice, served personally or by mail, of the alleged violation and an opportunity for a hearing before a person authorized by the licensing authority to conduct the hearing. A decision that a violation has occurred must be in writing.\n(a) A licensee's authority to sell tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products at that location must be suspended for not less than seven days and may be revoked if the licensee:\n(1) holds a license or registration issued pursuant to chapter 342 or section 151.72, subdivision 5b, and the license or registration is revoked;\n(2) is convicted of an offense under section 151.72, subdivision 7; or\n(3) has been convicted under any other statute for the illegal sale of marijuana, cannabis flower, cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or edible cannabinoid products and the sale took place on the premises of a business that sells tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products.\n(b) No suspension, revocation, or other penalty may take effect until the licensee has received notice, served personally or by mail, of the alleged violation and an opportunity for a hearing before a person authorized by the licensing authority to conduct the hearing. A decision that a violation has occurred must be in writing.\nAn individual who sells, gives, or otherwise furnishes tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products to a person under the age of 21 years may be charged an administrative penalty of $50. No penalty may be imposed until the individual has received notice, served personally or by mail, of the alleged violation and an opportunity for a hearing before a person authorized by the licensing authority to conduct the hearing. A decision that a violation has occurred must be in writing.\nThe licensing authority shall consult with interested persons, as applicable, including but not limited to educators, parents, guardians, persons under the age of 21 years, and representatives of the court system to develop alternative penalties for persons under the age of 21 years who purchase, or attempt to purchase, tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products using a driver's license, permit, Minnesota identification card, or any other type of false identification to misrepresent the person's age, in violation of section 609.685 or 609.6855. The licensing authority and the interested persons shall consider a variety of alternative civil penalties, including, but not limited to, tobacco-free education; tobacco cessation programs; notice to schools and parents or guardians; community service; and court diversion programs. Alternative civil penalties developed under this subdivision shall not include fines or monetary penalties.\nA licensing authority shall conduct unannounced compliance checks at least once each calendar year at each location where tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products are sold to test compliance with sections 609.685 and 609.6855. Compliance checks conducted under this subdivision must involve persons at least 17 years of age, but under the age of 21, who, with the prior written consent of a parent or guardian if the person is under the age of 18, attempt to purchase tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products under the direct supervision of a law enforcement officer or an employee of the licensing authority. The age requirements for persons participating in compliance checks under this subdivision shall not affect the age requirements in federal law for persons participating in federally required compliance checks of these locations.\nIt is an affirmative defense to the charge of selling tobacco, tobacco-related devices, electronic delivery devices, or nicotine or lobelia delivery products to a person under the age of 21 years in violation of subdivision 2 or 3 that the licensee or individual making the sale relied in good faith upon proof of age as described in section 340A.503, subdivision 6.\nAny person aggrieved by a decision under subdivision 2 or 3 may have the decision reviewed in the district court in the same manner and procedure as provided in section 462.361.\nThe licensing authority under this section shall, within 30 days of the issuance of a license, inform the commissioner of revenue of the licensee's name, address, trade name, and the effective and expiration dates of the license. The commissioner of revenue must also be informed of a license renewal, transfer, cancellation, suspension, or revocation during the license period.",
	"repealed": false
}