{
	"id": "501B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.40",
	"title": "501B.40 INVESTIGATORY POWERS OF THE ATTORNEY GENERAL; CUSTODIANS TO FURNISH COPIES OF RECORDS.",
	"text": "The attorney general may conduct investigations that are reasonably necessary for: (1) the administration of sections 501B.33 to 501B.45; or (2) determining whether property held for charitable purposes is properly administered. In connection with an investigation under this section, the attorney general may obtain discovery from an agent, trustee, fiduciary, beneficiary, institution, association, corporation, or other person regarding a matter, fact, or circumstance, not privileged, that is relevant to the subject matter involved in the investigation. The discovery may be obtained without commencement of a civil action and without leave of court, except as expressly required by subdivision 2. The applicable protective provisions of rules 26.02, 30.02, and 30.04, of the Rules of Civil Procedure for the District Court apply to discovery procedures instituted under this section. The attorney general or a person to whom discovery is directed may apply to and obtain leave of the district court in order to reduce or extend the time requirements of this subdivision, and, upon a showing of good cause, the district court shall order a reduction or extension. In order to obtain discovery, the attorney general may:\n(1) serve written interrogatories on a person. Within 20 days after service of interrogatories, separate written answers and objections to each interrogatory must be mailed to the attorney general;\n(2) upon reasonable written notice of no less than 15 days, require a person to produce for inspection and copying documents, papers, books, accounts, letters, photographs, objects, or tangible things in the person's possession, custody, or control; and\n(3) upon reasonable written notice of no less than 15 days, take the testimony of a person by deposition as to a fact or opinion relevant to the subject matter involved in the pending investigation.\nIf a person fails or refuses to answer interrogatories, produce materials, or be examined under oath, the attorney general may, upon notice to the person, apply to the district court in the county where the person resides or is found, for an order to compel compliance. On a showing of cause by the attorney general, the court may issue an order to compel compliance with the discovery procedures authorized by this section.\nA custodian of records of a court having jurisdiction of probate matters or of charitable trusts, and a custodian of records of a department, agency, or political subdivision of this state shall, upon request, furnish to the attorney general, free of charge, copies of records relating to the subject of sections 501B.33 to 501B.45.\nEvery officer, agency, board, or commission of this state that receives an application for exemption from taxation from a charitable trust subject to sections 501B.33 to 501B.45 shall annually file with the attorney general a list of all applications received during the year and shall notify the attorney general of the suspension or revocation of a tax-exempt status previously granted.",
	"repealed": false
}