{
	"id": "11A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.24",
	"title": "11A.24 AUTHORIZED INVESTMENTS.",
	"text": "(a) Pursuant to an investment policy adopted by the state board, the state board is authorized to purchase, sell, lend, and exchange the securities specified in this section, for funds or accounts specifically made subject to this section. This authority includes puts and call options, future contracts, and swap contracts marked to market, if these options and contracts are traded on a contract market regulated by a governmental agency or by a financial institution regulated by a governmental agency. These securities may be owned directly or through shares in exchange-traded or mutual funds, or as units in commingled trusts, subject to any limitations as specified in this section.\n(b) Any agreement to lend securities must be concurrently collateralized with cash or securities with a market value of not less than 100 percent of the market value of the loaned securities at the time of the agreement. Any agreement for put and call options and futures contracts may only be entered into with a fully offsetting amount of cash or securities. Only securities authorized by this section, excluding those under subdivision 6, paragraph (a), clauses (1) to (5), may be accepted as collateral or offsetting securities.\nThe state board is authorized to invest funds in governmental bonds, notes, bills, mortgages, and other evidences of indebtedness if the issue is backed by the full faith and credit of the issuer or if the issue is rated among the top four quality rating categories by a nationally recognized rating agency. The obligations in which the board may invest under this subdivision are guaranteed or insured issues of:\n(1) the United States, its agencies, its instrumentalities, or organizations created and regulated by an act of Congress;\n(2) the Dominion of Canada or any of its provinces, provided the principal and interest are payable in United States dollars;\n(3) any of the states or any of their municipalities, political subdivisions, agencies, or instrumentalities; and\n(4) any United States government sponsored organization of which the United States is a member, if the principal and interest are payable in United States dollars.\n(a) The state board is authorized to invest funds in bonds, notes, debentures, transportation equipment obligations, and any other longer term evidences of indebtedness issued or guaranteed by a corporation organized under the laws of the United States or any state of the United States, or the Dominion of Canada or any Canadian province if:\n(1) the principal and interest of obligations of corporations incorporated or organized under the laws of the Dominion of Canada or any Canadian province are payable in United States dollars; and\n(2) the obligations are rated among the top four quality categories by a nationally recognized rating agency.\n(b) The state board may invest in unrated corporate obligations or in corporate obligations that are not rated among the top four quality categories as provided in paragraph (a), clause (2), if:\n(1) the aggregate value of these obligations does not exceed five percent of the market value of the fund for which the state board is investing;\n(2) the state board's participation is limited to 50 percent of a single offering subject to this paragraph; and\n(3) the state board's participation is limited to 25 percent of an issuer's obligations subject to this paragraph.\n(a) The state board is authorized to invest funds in:\n(1) bankers acceptances and deposit notes if issued by a United States bank that is rated in the highest four quality categories by a nationally recognized rating agency;\n(2) certificates of deposit if issued by a United States bank or savings institution that is rated in the top four quality categories by a nationally recognized rating agency or whose certificates of deposit are fully insured by federal agencies, or certificates of deposits issued by a credit union in an amount within the limit of the insurance coverage provided by the National Credit Union Administration;\n(3) commercial paper if issued by a United States corporation or its Canadian subsidiary and if rated in the highest two quality categories by a nationally recognized rating agency;\n(4) mortgage securities and asset-backed securities if rated in the top four quality categories by a nationally recognized rating agency;\n(5) repurchase agreements and reverse repurchase agreements if collateralized with letters of credit or securities authorized in this section;\n(6) guaranteed investment contracts if issued by an insurance company or a bank that is rated in the top four quality categories by a nationally recognized rating agency or alternative guaranteed investment contracts if the underlying assets comply with the requirements of this section;\n(7) savings accounts if fully insured by a federal agency; and\n(8) guaranty fund certificates, surplus notes, or debentures if issued by a domestic mutual insurance company.\n(b) Sections 16A.58, 16C.03, subdivision 4, and 16C.05 do not apply to certificates of deposit and collateralization agreements executed by the state board under paragraph (a), clause (2).\n(c) In addition to investments authorized by paragraph (a), clause (4), the state board is authorized to purchase from the Minnesota Housing Finance Agency all or any part of a pool of residential mortgages, not in default, that has previously been financed by the issuance of bonds or notes of the agency. The state board may also enter into a commitment with the agency, at the time of any issue of bonds or notes, to purchase at a specified future date, not exceeding 12 years from the date of the issue, the amount of mortgage loans then outstanding and not in default that have been made or purchased from the proceeds of the bonds or notes. The state board may charge reasonable fees for any such commitment and may agree to purchase the mortgage loans at a price sufficient to produce a yield to the state board comparable, in its judgment, to the yield available on similar mortgage loans at the date of the bonds or notes. The state board may also enter into agreements with the agency for the investment of any portion of the funds of the agency. The agreement must cover the period of the investment, withdrawal privileges, and any guaranteed rate of return.\nThe state board is authorized to invest funds in stocks or convertible issues of any corporation organized under the laws of the United States or any of its states, the Dominion of Canada or any of its provinces, or any corporation listed on an exchange that is regulated by an agency of the United States or of the Canadian national government.\nAn investment in any corporation must not exceed five percent of the total outstanding shares of that corporation, except that the state board may hold up to 20 percent of the shares of a real estate investment trust and up to 20 percent of the shares of a closed-end mutual fund.\nThe aggregate value of investments under subdivision 5, plus the aggregate value of all investments under subdivision 6, must not exceed 85 percent of the market value of a fund.\n(a) In addition to the investments authorized in subdivisions 1 to 5, and subject to the provisions in paragraph (b), the state board is authorized to invest funds in:\n(1) equity and debt investment businesses through participation in limited partnerships, trusts, private placements, limited liability corporations, limited liability companies, limited liability partnerships, and corporations;\n(2) real estate ownership interests or loans secured by mortgages or deeds of trust or shares of real estate investment trusts through investment in limited partnerships, bank-sponsored collective funds, trusts, mortgage participation agreements, and insurance company commingled accounts;\n(3) resource investments through limited partnerships, trusts, private placements, limited liability corporations, limited liability companies, limited liability partnerships, and corporations;\n(4) investment vehicles that are co-investments or separate accounts;\n(5) liquid alternatives;\n(6) bank loans; and\n(7) international securities.\n(b) The investments authorized in paragraph (a) must conform to the following clauses:\n(1) the aggregate value of all investments made under paragraph (a), clauses (1) to (4), may not exceed 35 percent of the market value of the fund for which the state board is investing;\n(2) there must be at least four unrelated owners of the investment other than the state board for investments made under paragraph (a), clause (1), (2), or (3);\n(3) state board participation in an investment vehicle is limited to 20 percent thereof for investments made under paragraph (a), clause (1), (2), or (3); and\n(4) state board participation in an investment vehicle does not include a general partnership interest or other interest involving general liability. The state board may not participate in any investment vehicle in a manner which creates general liability.\n(c) All financial, business, or proprietary data collected, created, received, or maintained by the state board in connection with investments authorized by paragraph (a), clauses (1) to (6), are nonpublic data under section 13.02, subdivision 9. As used in this paragraph, \"financial, business, or proprietary data\" means data, as determined by the responsible authority for the state board, that is of a financial, business, or proprietary nature, the release of which could cause competitive harm to the state board, the legal entity in which the state board has invested or has considered an investment, the managing entity of an investment, or a portfolio company in which the legal entity holds an interest. As used in this section, \"business data\" is data described in section 13.591, subdivision 1. Regardless of whether they could be considered financial, business, or proprietary data, the following data received, prepared, used, or retained by the state board in connection with investments authorized by paragraph (a), clauses (1) to (6), are public at all times:\n(1) the name and industry group classification of the legal entity in which the state board has invested or in which the state board has considered an investment;\n(2) the state board commitment amount, if any;\n(3) the funded amount of the state board's commitment to date, if any;\n(4) the market value of the investment by the state board;\n(5) the state board's internal rate of return for the investment, including expenditures and receipts used in the calculation of the investment's internal rate of return; and\n(6) the age of the investment in years.\nThere is annually appropriated to the state board, from the assets of the funds for which the state board invests relating to authorized investments under subdivision 6, paragraph (a), sums sufficient to pay the costs for the management of these assets by private management firms.",
	"repealed": false
}