{
	"id": "80C.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/80C.22",
	"title": "80C.22 COMMISSIONER'S DUTIES.",
	"text": "Sections 80C.01 to 80C.22 shall be administered by the commissioner of commerce.\nIt is unlawful for the commissioner or any of the commissioner's officers or employees to use for personal benefit any information which is filed with or obtained by the commissioner and which is not generally available to the public. Nothing in sections 80C.01 to 80C.22 authorizes the commissioner or any of the commissioner's officers or employees to disclose any confidential information except among themselves or to other administrators or regulatory authorities, or when necessary or appropriate in a proceeding or investigation under sections 80C.01 to 80C.22. No provision of sections 80C.01 to 80C.22 either creates any privilege or derogates from any privilege which exists at common law or otherwise, when documentary or other evidence is sought under a subpoena directed to the commissioner or any of the commissioner's officers or employees.\nAll applications, notices, reports and other documents filed with the commissioner under sections 80C.01 to 80C.22 shall be open to public inspection in accordance with rules prescribed by the commissioner. The commissioner may publish information filed with, or obtained by, the commissioner, if, in the judgment of the commissioner, such action is in the public interest.\nA document is filed when it is received by the commissioner.\nThe commissioner shall keep a register of all filings which are or have ever been effective under sections 80C.01 to 80C.22 and all denial, suspension, revocation and other orders which have been entered under sections 80C.01 to 80C.22. The register shall be open for public inspection.\nThe commissioner upon request shall furnish to any person at a reasonable charge photostatic or other copies, certified under seal of office if certification is requested, of any entry in the register or any order or other document on file in the commissioner's office. Any copy so certified is admissible in evidence under section 600.13.\nOrders of the commissioner shall be served by mailing a copy thereof by mail to the most recent address of the recipient of the order as it appears in the files of the commissioner. Subpoenas shall be served in the same manner as provided in civil actions in the district courts.",
	"repealed": false
}