{
	"id": "116P.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.09",
	"title": "116P.09 ADMINISTRATION.",
	"text": "The commission may appoint legal and other personnel and consultants necessary to carry out functions and duties of the commission. Permanent employees shall be in the unclassified service. In addition, the commission may request staff assistance and data from any other agency of state government as needed for the execution of the responsibilities of the commission and an agency must promptly furnish it.\nThe commission may request each department or agency head of all state agencies with a direct interest and responsibility in any phase of environment and natural resources to appoint, and the latter shall appoint for the agency, a liaison officer who shall work closely with the commission and its staff.\nThe commission shall obtain and appraise information available through private organizations and groups, utilizing to the fullest extent possible studies, data, and reports previously prepared or currently in progress by public agencies, private organizations, groups, and others, concerning future trends in the protection, conservation, preservation, and enhancement of the state's air, water, land, forests, fish, wildlife, native vegetation, and other natural resources. Any data compiled by the commission shall be made available to any standing or interim committee of the legislature upon the request of the chair of the respective committee.\nPersons who are employed by a state agency to work on a project and are paid by an appropriation from the trust fund are in the unclassified civil service, and their continued employment is contingent upon the availability of money from the appropriation. When the appropriation has been spent, their positions must be canceled and the approved complement of the agency reduced accordingly. Part-time employment of persons for a project is authorized. The use of classified employees is authorized when approved as part of the work program required by section 116P.05, subdivision 2, paragraph (b).\nThe prorated expenses related to commission administration of the trust fund may not exceed an amount equal to four percent of the amount available for appropriation of the trust fund for the biennium.\n(a) A commission member, a technical advisory committee member, a peer reviewer, or an employee of the commission may not participate in or vote on a decision of the commission, advisory committee, or peer review relating to an organization in which the member, peer reviewer, or employee has either a direct or indirect personal financial interest. While serving on the commission or technical advisory committee or as a peer reviewer or while an employee of the commission, a person must avoid any potential conflict of interest.\n(b) A commission member may not vote on a motion regarding the purchase of land under section 116P.18 or the final recommendations of the commission required under section 116P.05, subdivision 2, paragraph (a), if the motion relates to an organization in which the member has a direct personal financial interest. If a commission member is prohibited from voting under this paragraph, the number of affirmative votes required under section 116P.05, subdivision 2, paragraph (a), or section 116P.18 is reduced by the number of members ineligible to vote under this paragraph.\nThe commission shall, by January 15 of each odd-numbered year, submit a report to the governor, the chairs of the house of representatives appropriations and senate finance committees, and the chairs of the house of representatives and senate committees on environment and natural resources. Copies of the report must be available to the public. The report must include:\n(1) a copy of the current strategic plan;\n(2) a description of each project receiving money from the trust fund during the preceding biennium;\n(3) a summary of any research project completed in the preceding biennium;\n(4) recommendations to implement successful projects and programs into a state agency's standard operations;\n(5) to the extent known by the commission, descriptions of the projects anticipated to be supported by the trust fund during the next biennium;\n(6) the source and amount of all revenues collected and distributed by the commission, including all administrative and other expenses;\n(7) a description of the assets and liabilities of the trust fund;\n(8) any findings or recommendations that are deemed proper to assist the legislature in formulating legislation;\n(9) a list of all gifts and donations with a value over $1,000;\n(10) a comparison of the amounts spent by the state for environment and natural resources activities through the most recent fiscal year; and\n(11) a copy of the most recent compliance audit.\nThe commission shall make use of available public and private expertise on environment and natural resource issues and may appoint necessary technical advisory committees to review funding proposals and evaluate project outcomes. Compensation for technical advisory committee members is governed by section 15.059, subdivision 6.",
	"repealed": false
}