{
	"id": "473.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.641",
	"title": "473.641 NEW AIRPORT; PUBLIC HEARING.",
	"text": "In determining whether a new airport shall be acquired or established or an existing airport expanded by the acquisition of an annexation thereto of additional lands, the corporation shall, before taking any action thereon, hold a public hearing in accordance with the procedure set forth in sections 473.601 to 473.679; and in reaching such determination, the corporation shall take into consideration the objectives of sections 473.601 to 473.679 as set forth in section 473.602; and shall take into consideration the use or uses to be made of the new airport or the use or uses to be made of the lands to be acquired and annexed to an existing airport, and shall take into consideration the effect the acquisition or establishment of the new airport will have upon the residents and properties in the area surrounding such new airport, or, in the case of the acquisition and annexation of lands to an existing airport, the effect such acquisition and annexation will have on residents and properties in the area surrounding such lands; and with respect to the new airport to be acquired or established, the commission shall take into consideration, in addition to the foregoing, the adequacy of present airport facilities in the area over which the corporation has jurisdiction, the nature of the terrain at the site thereof and in the vicinity of such site, whether there are safe areas available for expansion purposes, and whether the adjoining area is free from obstructions based on a proper glide ratio; and to aid the commission in giving consideration to such objectives and factors, and in reaching such determination, evidence may be offered and shall be received as to such objectives and factors at the public hearing herein provided for.\nExcept as provided in subdivision 1, public hearings are not required for alterations, improvements or developments, whether or not contracted for, of any airport under the jurisdiction of the corporation, including but not limited to the addition of structures and facilities for use of or lease to others by the corporation.\nThe Metropolitan Airports Commission shall not initiate land acquisition for a new major airport without explicit authorization from the legislature.\nNotwithstanding any other law, the Metropolitan Airports Commission shall not use revenue from any source, as described by section 473.608, for construction of air facilities to expand or upgrade the use of an existing metropolitan airport from minor use to intermediate use status without approval in a law. For the purposes of this section, a minor use airport is defined as an airport with a runway or runways of length no longer than 5,000 feet.",
	"repealed": false
}