{
	"id": "572B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/572B.15",
	"title": "572B.15 ARBITRATION PROCESS.",
	"text": "(a) The arbitrator may conduct the arbitration in such manner as the arbitrator considers appropriate so as to aid in the fair and expeditious disposition of the proceeding. The authority conferred upon the arbitrator includes the power to hold conferences with the parties to the arbitration proceeding before the hearing and to determine the admissibility, relevance, materiality, and weight of any evidence.\n(b) The arbitrator may decide a request for summary disposition of a claim or particular issue by agreement of all interested parties or upon request of one party to the arbitration proceeding if that party gives notice to all other parties to the arbitration proceeding and the other parties have a reasonable opportunity to respond.\n(c) The arbitrator shall set a time and place for a hearing and give notice of the hearing not less than five days before the hearing. Unless a party to the arbitration proceeding interposes an objection to lack of or insufficiency of notice not later than the commencement of the hearing, the party's appearance at the hearing waives the objection. Upon request of a party to the arbitration proceeding and for good cause shown, or upon the arbitrator's own initiative, the arbitrator may adjourn the hearing from time to time as necessary but may not postpone the hearing to a time later than that fixed by the agreement to arbitrate for making the award unless the parties to the arbitration proceeding consent to a later date. The arbitrator may hear and decide the controversy upon the evidence produced although a party who was duly notified of the arbitration proceeding did not appear. The court, on request, may direct the arbitrator to promptly conduct the hearing and render a timely decision.\n(d) If an arbitrator orders a hearing under subsection (c), the parties to the arbitration proceeding are entitled to be heard, to present evidence material to the controversy, and to cross-examine witnesses appearing at the hearing.\n(e) If there is more than one arbitrator, all of them shall conduct the hearing under subsection (c); however, a majority shall decide any issue and make a final award.\n(f) If an arbitrator ceases, or is unable, to act during the arbitration proceeding, a replacement arbitrator must be appointed in accordance with section 572B.11 to continue the hearing and to decide the controversy.",
	"repealed": false
}