{
	"id": "259.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.10",
	"title": "259.10 GENERAL REQUIREMENTS.",
	"text": "A person who shall have resided in this state for six months may apply to the district court in the county where the person resides to change the person's name, the names of minor children, if any, and the name of a spouse, if the spouse joins in the application, in the manner herein specified. The person shall state in the application the name and age of the spouse and each of the children, if any, and shall describe all lands in the state in or upon which the person, the children and the spouse if their names are also to be changed by the application, claim any interest or lien, and shall appear personally before the court and prove identity by at least two witnesses. If the person be a minor, the application shall be made by the person's guardian or next of kin. The court shall accept the certificate of dissolution prepared pursuant to section 518.148 as conclusive evidence of the facts recited in the certificate and may not require the person to provide the court a copy of the judgment and decree of dissolution. Every person who, with intent to defraud, shall make a false statement in any such application shall be guilty of a misdemeanor provided, however, that no minor child's name may be changed without both parents having notice of the pending of the application for change of name, whenever practicable, as determined by the court.\nIf the court determines that the name change for an individual is made in connection with the individual's participation in a witness and victim protection program, the court shall order that the court records of the name change are not accessible to the public; except that they may be released, upon request, to a law enforcement agency, probation officer, or corrections agent conducting a lawful investigation. The existence of an application for a name change described in this subdivision may not be disclosed except to a law enforcement agency conducting a lawful investigation.",
	"repealed": false
}