{
	"id": "237.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.50",
	"title": "237.50 DEFINITIONS.",
	"text": "The terms used in sections 237.50 to 237.56 have the meanings given them in this section.\n[Repealed, 1995 c 190 s 17]\n\"Communication disability\" means certified as having a hearing loss, speech disability, or physical disability that makes it difficult or impossible to use telecommunications services and equipment.\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n\"Deaf\" means a hearing loss of such severity that the person must depend primarily upon visual communication such as writing, lip reading, sign language, and gestures.\n\"Deafblind\" means any combination of vision and hearing loss which interferes with acquiring information from the environment to the extent that compensatory strategies and skills are necessary to access that or other information.\n\"Discounted telecommunications or Internet services\" means private, nonprofit, and public programs intended to subsidize or reduce the monthly costs of telecommunications or Internet services for a person who meets a program's eligibility requirements.\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n\"Fund\" means the telecommunications access Minnesota fund established in section 237.52.\n\"Hard-of-hearing\" means a hearing loss resulting in a functional limitation, but not to the extent that the person must depend primarily upon visual communication in all interactions.\n\"Interconnectivity product\" means a device, accessory, or application for which the primary function is use with a telecommunications device. Interconnectivity product may include a cell phone amplifier, hearing aid streamer, Bluetooth-enabled device that connects to a wireless telecommunications device, advanced communications application for a smartphone, or other applicable technology.\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n[Repealed by amendment, 2012 c 216 art 10 s 1]\n\"Telecommunications device\" means a device that (1) allows a person with a communication disability to have access to telecommunications services as defined in subdivision 13, and (2) is specifically selected by the Department of Human Services for its capacity to allow persons with communication disabilities to use telecommunications services in a manner that is functionally equivalent to the ability of a person who does not have a communication disability. A telecommunications device may include a ring signaler, an amplified telephone, a hands-free telephone, a text telephone, a captioned telephone, a wireless device, a device that produces Braille output for use with a telephone, and any other device the Department of Human Services deems appropriate.\n\"Telecommunications Relay Services\" or \"TRS\" means the telecommunications transmission services required under Federal Communications Commission regulations at Code of Federal Regulations, title 47, sections 64.604 to 64.606. TRS allows a person who has a communication disability to use telecommunications services in a manner that is functionally equivalent to the ability of a person who does not have a communication disability.\n\"Telecommunications\" means the transmission, between or among points specified by the user, of information of the user's choosing, without change in the form or content of the information as sent and received.\n\"Telecommunications services\" means the offering of telecommunications for a fee directly to the public, or to such classes of users as to be effectively available to the public, regardless of the facilities used.",
	"repealed": false
}