{
	"id": "473.581",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.581",
	"title": "473.581 DEBT OBLIGATIONS.",
	"text": "The council may by resolution authorize the sale and issuance of its bonds for any or all of the following purposes:\n(a) To provide funds for the acquisition or betterment of the Metrodome by the commission pursuant to sections 473.551 to 473.595;\n(b) To refund bonds issued hereunder; and\n(c) To fund judgments entered by any court against the commission or against the council in matters relating to the commission's functions related to the Metrodome and the Met Center.\nThe bonds shall be sold, issued, and secured in the manner provided in chapter 475 for bonds payable solely from revenues, except as otherwise provided in sections 473.551 to 473.595, and the council shall have the same powers and duties as a municipality and its governing body in issuing bonds under that chapter. The bonds may be sold at any price and at public or private sale as determined by the council. They shall be payable solely from tax and other revenues referred to in sections 473.551 to 473.595, excepting only the admissions tax and surcharge related to the basketball and hockey arena provided in section 473.595, subdivision 1a, the taxes for the basketball and hockey arena provided in section 473.592, and other revenues attributable to the basketball and hockey arena. The bonds shall not be a general obligation or debt of the council or of the commission, and shall not be included in the net debt of any city, county, or other subdivision of the state for the purpose of any net debt limitation, provided that nothing herein shall affect the obligation of the city of Minneapolis to levy a tax pursuant to agreements made under the provisions of section 473.592. No election shall be required. The principal amount shall not be limited except as provided in subdivision 3.\nThe principal amount of the bonds issued pursuant to subdivision 1, clause (a), shall not exceed the amounts hereinafter authorized. If the commission's proposal and the construction contracts referred to in clause (g) of this subdivision provide for the construction of a covered multipurpose sports facility, the total cost of constructing the facility under the construction contracts, not including costs paid from funds provided by others, and the principal amount of bonds issued pursuant to subdivision 1, clause (a), shall be limited to $55,000,000. If the commission's proposal and the construction contracts do not provide for the construction of a cover on a proposed multipurpose sports facility and the commission does not otherwise contract for the construction or acquisition of a cover for the sports facility, the principal amount shall be limited to $42,000,000. If the commission's proposal and the construction contracts provide for the construction of a new sports facility for football and soccer and for remodeling the existing metropolitan stadium for baseball, the principal amount shall be limited to $37,500,000. If the commission's proposal and the construction contracts provide for the reconstruction and remodeling of the existing Metropolitan Stadium as an uncovered multipurpose sports facility, the principal amount shall be limited to $25,000,000. The bonds issued pursuant to subdivision 1, clause (a), shall bear an average annual rate of interest, including discount, not in excess of 7-1/2 percent. The proceeds of the bonds issued pursuant to subdivision 1, clause (a), shall be used only for the acquisition and betterment of sports facilities suitable for baseball, football and soccer, with a seating capacity for football and soccer of approximately 65,000 persons. The council shall issue its bonds and construction of sports facilities may commence when the council has made the following determinations:\n(a) The commission has executed agreements with major league professional baseball and football organizations to use the Metrodome for all scheduled regular season home games and play-off home games and, in the case of the football organization, for at least one-half of its exhibition games played each season. The agreements shall be for a period of not more than 30 years nor less than the term of the longest term bonds that in the council's judgment it may find it necessary to issue to finance the acquisition and betterment of the Metrodome. The agreements may contain provisions negotiated between the organizations and the commission which provide for termination upon conditions related and limited to the bankruptcy, insolvency, or financial capability of the organization. The agreements shall provide that, in the event of breach of the agreements, the defaulting organization shall pay damages annually to the commission. The annual payment shall be in an amount equal to the annual average of all revenue derived by the commission from attendance at events and activities of the defaulting organization during the years prior to default, provided that the damages shall not exceed in any year an amount sufficient, with other revenues of the commission but excluding proceeds of the taxes under section 473.592, to pay all expenses of operation, maintenance, administration, and debt service for the use of the Metrodome by the defaulting organization during the same year. The damages shall be payable during the period from the occurrence of the default to the date on which another major league professional baseball or football organization, replacing the defaulting organization, enters into a use agreement with the commission for not less than the then remaining term of the original agreement. The agreements with the teams shall provide that no closed circuit or pay television broadcasting of events in the Metrodome may be allowed without the approval of the commission. The agreements shall include provisions protecting the commission and the council in the event of change in ownership of the professional teams.\n(b) The commission has executed agreements with professional baseball and football major leagues which guarantee the continuance of franchises in the metropolitan area for the period of the agreements referred to in clause (a).\n(c) The proceeds of bonds provided for in this subdivision will be sufficient, together with other capital funds that may be available to the commission for expenditures on the Metrodome, to construct or remodel and to furnish the Metrodome proposed by the commission, including the appropriate professional fees and charges but excluding, except as otherwise provided in this subdivision, the acquisition, clearance, relocation, and legal costs referred to in clauses (d) and (e).\n(d) The commission has acquired, without cost to the commission or the council except as provided in this subdivision, title to all real property including all easements and other appurtenances needed for the construction and operation of the Metrodome or has received a grant of funds or has entered into an agreement or agreements sufficient in the judgment of the council to assure the receipt of funds, at the time and in the amount required, to make any payment upon which the commission's acquisition of title and possession of the real property is conditioned.\n(e) The commission has received a grant of funds or entered into an agreement or agreements sufficient in the judgment of the council to assure the receipt of funds, at the time and in the amount required, to pay all costs, except as provided in this subdivision, of clearing the real property needed for the construction and operation of the Metrodome of all buildings, railroad tracks and other structures, including without limitation all relocation costs, all utility relocation costs, and all legal costs.\n(f) The commission has executed agreements with appropriate labor organizations and construction contractors which provide that no labor strike or management lockout will halt, delay or impede construction.\n(g) The commission has executed agreements which will provide for the construction of the Metrodome for a certified construction price and completion date and which include performance bonds in an amount at least equal to 100 percent of the certified price to cover any costs which may be incurred over and above the certified price, including but not limited to costs incurred by the commission or loss of revenues resulting from incomplete construction on the completion date.\n(h) The environmental impact statement for the Metrodome has been accepted by the Environmental Quality Board, and the Pollution Control Agency and any other department, agency, or unit of government have taken the actions necessary to permit the construction of the Metrodome.\n(i) At least 50 percent of the private boxes provided for in the commission's proposal for the Metrodome are sold or leased for at least five years.\n(j) The anticipated revenue from the operation of the Metrodome plus any additional available revenue of the commission and the revenue from the taxes under section 473.592 will be an amount sufficient to pay when due all debt service plus all administration, operating and maintenance expense.\n(k) The commission has studied and considered the needs of the University of Minnesota for athletic facilities for a prospective 20 year period.\n(l) The city of Minneapolis has entered into an agreement as contemplated in section 473.592 as security for the Metrodome debt service.\n(m) The commission has entered into an agreement or agreements with a purchaser or purchasers of tickets of admission for a period of not less than 20 years which will assure that whenever more than 90 and less than 100 percent of the tickets of admission for seats at any professional football game, which were available for purchase by the general public 120 hours or more before the scheduled beginning time of the game either at the Metrodome where the game is to be played or at the box office closest to the Metrodome, have been purchased 72 hours or more before the beginning time of the game, then all of such tickets which remain unsold will be purchased in sufficient time to permit the telecast to areas within the state which otherwise would not receive the telecast because of the terms of an agreement in which the professional football league has sold or otherwise transferred all or part of the rights of the league's member organizations in the sponsored telecasting of games of the organizations. The party or parties agreeing to the purchase of such unsold tickets shall be obligated for a period of at least 20 years in an amount determined by the council to be sufficient to assure the purchase of all such unsold tickets.\n(n) The council has entered into an agreement with the brokerage firm or brokerage firms to be used in connection with the issuance and sale of the bonds guaranteeing that fees and charges payable to the brokerage firm or firms in connection therewith, including any underwriting discounts, shall not exceed fees and charges customarily payable in connection with the issuance and sale of bonds secured by the pledge of the full faith and credit of the city of Minneapolis.\nThe validity of any bonds issued under subdivision 1, clause (a), and the obligations of the council and commission related thereto, shall not be conditioned upon or impaired by the council's determinations made pursuant to this subdivision. For purposes of issuing the bonds the determinations made by the council shall be deemed conclusive, and the council shall be and remain obligated for the security and payment of the bonds irrespective of determinations which may be erroneous, inaccurate, or otherwise mistaken.\nTo the extent and in the manner provided in sections 473.592 and 473.595, the taxes described in section 473.592 for the Metrodome, the tax and other revenues of the commission described in section 473.595, subdivision 1, and any other revenues of the commission attributable to the Metrodome shall be and remain pledged and appropriated for the payment of all necessary and reasonable expenses of the operation, administration, maintenance, and debt service of the Metrodome until all bonds and certificates issued pursuant to this section are fully paid or discharged in accordance with law. Bonds issued pursuant to this section may be secured by a bond resolution, or by a trust indenture entered into by the council with a corporate trustee within or outside the state, which shall define the tax and other Metrodome and Met Center revenues pledged for the payment and security of the bonds. The pledge shall be a valid charge on the tax and other revenues referred to in sections 473.551 to 473.595 (excepting only the admissions tax and surcharge related to the basketball and hockey arena provided in section 473.595, subdivision 1a, taxes described in section 473.592 for the basketball and hockey arena, and other revenues attributable to the basketball and hockey arena) from the date when bonds are first issued or secured under the resolution or indenture and shall secure the payment of principal and interest and redemption premiums when due and the maintenance at all times of a reserve securing such payments. No mortgage of or security interest in any tangible real or personal property shall be granted to the bondholders or the trustee, but they shall have a valid security interest in all tax and other revenues received and accounts receivable by the commission or council hereunder, as against the claims of all other persons in tort, contract, or otherwise, irrespective of whether such parties have notice thereof, and without possession or filing as provided in the Uniform Commercial Code or any other law. In the bond resolution or trust indenture the council may make such covenants, which shall be binding upon the commission, as are determined to be usual and reasonably necessary for the protection of the bondholders. No pledge, mortgage, covenant, or agreement securing bonds may be impaired, revoked, or amended by law or by action of the council, commission, or city, except in accordance with the terms of the resolution or indenture under which the bonds are issued, until the obligations of the council thereunder are fully discharged.\nAt any time or times after approval by the council and final adoption by the commission of an annual budget of the commission for operation, administration, and maintenance of the Metrodome, and in anticipation of the proceeds from the taxes under section 473.592 for the Metrodome and the revenues of the commission provided for in the budget, but subject to any limitation or prohibition in a bond resolution or indenture, the council may authorize the issuance, negotiation, and sale, in such form and manner and upon such terms as it may determine, of revenue anticipation certificates. The principal amount of the certificates outstanding shall at no time exceed 25 percent of the total amount of the tax and other revenues anticipated. The certificates shall mature not later than three months after the close of the budget year. Prior to the approval and final adoption of the first annual budget of the commission, the council may authorize up to $300,000 in revenue anticipation certificates under this subdivision. So much of the anticipated tax and other revenues as may be needed for the payment of the certificates and interest thereon shall be paid into a special debt service fund established for the certificates in the council's financial records. If for any reason the anticipated tax and other revenues are insufficient, the certificates and interest shall be paid from the first tax and other revenues received, subject to any limitation or prohibition in a bond resolution or indenture. The proceeds of the certificates may be used for any purpose for which the anticipated revenues or taxes may be used or for any purpose for which bond proceeds under subdivision 1 may be used, provided that the proceeds of certificates issued after May 26, 1979, shall not be used to pay capital costs of the Metrodome constructed or remodeled pursuant to sections 473.551 to 473.595.",
	"repealed": false
}