{
	"id": "144G.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.08",
	"title": "144G.08 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms in this section have the meanings given.\n\"Adult\" means a natural person who has attained the age of 18 years.\n\"Advanced practice registered nurse\" has the meaning given in section 148.171, subdivision 3.\n\"Applicant\" means an individual, legal entity, or other organization that has applied for licensure under this chapter.\n\"Assisted living facility campus\" or \"campus\" means:\n(1) a single building having two or more addresses, located on the same property with a single property identification number;\n(2) two or more buildings, each with a separate address, located on the same property with a single property identification number; or\n(3) two or more buildings at different addresses, located on properties with different property identification numbers, that share a portion of a legal property boundary.\n\"Assisted living contract\" means the legal agreement between a resident and an assisted living facility for housing and, if applicable, assisted living services.\n\"Assisted living director\" means a person who administers, manages, supervises, or is in general administrative charge of an assisted living facility, whether or not the individual has an ownership interest in the facility, and whether or not the person's functions or duties are shared with one or more individuals and who is licensed by the Board of Executives for Long Term Services and Supports pursuant to section 144A.20.\n\"Assisted living facility\" means a facility that provides sleeping accommodations and assisted living services to one or more adults. Assisted living facility includes assisted living facility with dementia care, and does not include:\n(1) emergency shelter, transitional housing, or any other residential units serving exclusively or primarily homeless individuals, as defined under section 116L.361;\n(2) a nursing home licensed under chapter 144A;\n(3) a hospital, certified boarding care, or supervised living facility licensed under sections 144.50 to 144.56;\n(4) a lodging establishment licensed under chapter 157 and Minnesota Rules, parts 9520.0500 to 9520.0670, or under chapter 245D, 245G, or 245I;\n(5) services and residential settings licensed under chapter 245A, including adult foster care and services and settings governed under the standards in chapter 245D;\n(6) a private home in which the residents are related by kinship, law, or affinity with the provider of services;\n(7) a duly organized condominium, cooperative, and common interest community, or owners' association of the condominium, cooperative, and common interest community where at least 80 percent of the units that comprise the condominium, cooperative, or common interest community are occupied by individuals who are the owners, members, or shareholders of the units;\n(8) a temporary family health care dwelling as defined in sections 394.307 and 462.3593;\n(9) a setting offering services conducted by and for the adherents of any recognized church or religious denomination for its members exclusively through spiritual means or by prayer for healing;\n(10) housing financed pursuant to sections 462A.37 and 462A.375, units financed with low-income housing tax credits pursuant to United States Code, title 26, section 42, and units financed by the Minnesota Housing Finance Agency that are intended to serve individuals with disabilities or individuals who are homeless, except for those developments that market or hold themselves out as assisted living facilities and provide assisted living services;\n(11) rental housing developed under United States Code, title 42, section 1437, or United States Code, title 12, section 1701q;\n(12) rental housing designated for occupancy by only elderly or elderly and disabled residents under United States Code, title 42, section 1437e, or rental housing for qualifying families under Code of Federal Regulations, title 24, section 983.56;\n(13) rental housing funded under United States Code, title 42, chapter 89, or United States Code, title 42, section 8011;\n(14) a covered setting as defined in section 325F.721, subdivision 1, paragraph (b); or\n(15) any establishment that exclusively or primarily serves as a shelter or temporary shelter for victims of domestic or any other form of violence.\n[See Note.]\n\"Assisted living facility license\" or \"license\" means a certificate issued by the commissioner under section 144G.10 that authorizes the licensee to manage, control, and operate an assisted living facility for a specified period of time and in accordance with the terms of the license, this chapter, and the rules of the commissioner.\n\"Assisted living facility with dementia care\" means a licensed assisted living facility that is advertised, marketed, or otherwise promoted as providing specialized care for individuals with Alzheimer's disease or other dementias. An assisted living facility with a secured dementia care unit must be licensed as an assisted living facility with dementia care.\n\"Assisted living services\" includes one or more of the following:\n(1) assisting with dressing, self-feeding, oral hygiene, hair care, grooming, toileting, and bathing;\n(2) providing standby assistance;\n(3) providing verbal or visual reminders to the resident to take regularly scheduled medication, which includes bringing the resident previously set up medication, medication in original containers, or liquid or food to accompany the medication;\n(4) providing verbal or visual reminders to the resident to perform regularly scheduled treatments and exercises;\n(5) preparing specialized diets ordered by a licensed health professional;\n(6) services of an advanced practice registered nurse, physician assistant, registered nurse, licensed practical nurse, physical therapist, respiratory therapist, occupational therapist, speech-language pathologist, dietitian or nutritionist, or social worker;\n(7) tasks delegated to unlicensed personnel by a registered nurse or assigned by a licensed health professional within the person's scope of practice;\n(8) medication management services;\n(9) hands-on assistance with transfers and mobility;\n(10) treatment and therapies;\n(11) assisting residents with eating when the residents have complicated eating problems as identified in the resident record or through an assessment such as difficulty swallowing, recurrent lung aspirations, or requiring the use of a tube or parenteral or intravenous instruments to be fed;\n(12) providing other complex or specialty health care services; and\n(13) supportive services in addition to the provision of at least one of the services listed in clauses (1) to (12).\n\"Authority having jurisdiction\" means an organization, office, or individual responsible for enforcing the requirements of a code or standard, or for approving equipment, materials, an installation, or a procedure.\n\"Authorized agent\" means the person who is authorized to accept service of notices and orders on behalf of the licensee.\n\"Change of ownership\" means a change in the licensee that is responsible for the management, control, and operation of a facility.\n\"Commissioner\" means the commissioner of health.\n\"Controlled substance\" has the meaning given in section 152.01, subdivision 4.\n(a) \"Controlling individual\" means an owner and the following individuals and entities, if applicable:\n(1) each officer of the organization, including the chief executive officer and chief financial officer;\n(2) each managerial official; and\n(3) any entity with at least a five percent mortgage, deed of trust, or other security interest in the facility.\n(b) Controlling individual does not include:\n(1) a bank, savings bank, trust company, savings association, credit union, industrial loan and thrift company, investment banking firm, or insurance company unless the entity operates a program directly or through a subsidiary;\n(2) government and government-sponsored entities such as the U.S. Department of Housing and Urban Development, Ginnie Mae, Fannie Mae, Freddie Mac, and the Minnesota Housing Finance Agency which provide loans, financing, and insurance products for housing sites;\n(3) an individual who is a state or federal official, a state or federal employee, or a member or employee of the governing body of a political subdivision of the state or federal government that operates one or more facilities, unless the individual is also an officer, owner, or managerial official of the facility, receives remuneration from the facility, or owns any of the beneficial interests not excluded in this subdivision;\n(4) an individual who owns less than five percent of the outstanding common shares of a corporation:\n(i) whose securities are exempt under section 80A.45, clause (6); or\n(ii) whose transactions are exempt under section 80A.46, clause (2);\n(5) an individual who is a member of an organization exempt from taxation under section 290.05, unless the individual is also an officer, owner, or managerial official of the license or owns any of the beneficial interests not excluded in this subdivision. This clause does not exclude from the definition of controlling individual an organization that is exempt from taxation; or\n(6) an employee stock ownership plan trust, or a participant or board member of an employee stock ownership plan, unless the participant or board member is a controlling individual.\n\"Dementia\" means the loss of cognitive function, including the ability to think, remember, problem solve, or reason, of sufficient severity to interfere with an individual's daily functioning. Dementia is caused by different diseases and conditions, including but not limited to Alzheimer's disease, vascular dementia, neurodegenerative conditions, Creutzfeldt-Jakob disease, and Huntington's disease.\n\"Dementia care services\" means ongoing care for behavioral and psychological symptoms of dementia, including planned group and individual programming and person-centered care practices provided according to section 144G.84 to support activities of daily living for people living with dementia.\n\"Dementia-trained staff\" means any staff who have completed the minimum training required under sections 144G.64 and 144G.83 and have demonstrated knowledge and the ability to support individuals with dementia.\n\"Designated representative\" means a person designated under section 144G.50.\n\"Dietary supplement\" means a product taken by mouth that contains a dietary ingredient intended to supplement the diet. Dietary ingredients may include vitamins, minerals, herbs or other botanicals, amino acids, and substances such as enzymes, organ tissue, glandulars, or metabolites.\n\"Dietitian\" means a person licensed as a dietitian under section 148.624.\n\"Direct contact\" means providing face-to-face care, training, supervision, counseling, consultation, or medication assistance to residents of a facility.\n\"Direct ownership interest\" means an individual or legal entity with the possession of at least five percent equity in capital, stock, or profits of the licensee, or who is a member of a limited liability company of the licensee.\n\"Facility\" means an assisted living facility.\n\"Hands-on assistance\" means physical help by another person without which the resident is not able to perform the activity.\n\"'I'm okay' check services\" means having, maintaining, and documenting a system to, by any means, check on the safety of a resident a minimum of once daily or more frequently according to the assisted living contract.\n\"Indirect ownership interest\" means an individual or legal entity with a direct ownership interest in an entity that has a direct or indirect ownership interest of at least five percent in an entity that is a licensee.\n\"Legal representative\" means one of the following in the order of priority listed, to the extent the person may reasonably be identified and located:\n(1) a court-appointed guardian acting in accordance with the powers granted to the guardian under chapter 524;\n(2) a conservator acting in accordance with the powers granted to the conservator under chapter 524;\n(3) a health care agent acting in accordance with the powers granted to the health care agent under chapter 145C; or\n(4) an attorney-in-fact acting in accordance with the powers granted to the attorney-in-fact by a written power of attorney under chapter 523.\n\"Licensed health professional\" means a person, other than a registered nurse or licensed practical nurse, who provides assisted living services within the scope of practice of that person's health occupation license, registration, or certification as a regulated person who is licensed by an appropriate Minnesota state board or agency.\n\"Licensed practical nurse\" has the meaning given in section 148.171, subdivision 8.\n\"Licensed resident capacity\" means the resident occupancy level requested by a licensee and approved by the commissioner.\n\"Licensee\" means a person or legal entity to whom the commissioner issues a license for an assisted living facility and who is responsible for the management, control, and operation of a facility.\n\"Maltreatment\" means conduct described in section 626.5572, subdivision 15.\n\"Management agreement\" means a written, executed agreement between a licensee and manager regarding the provision of certain services on behalf of the licensee.\n\"Manager\" means an individual or legal entity designated by the licensee through a management agreement to act on behalf of the licensee in the on-site management of the assisted living facility.\n\"Managerial official\" means an individual who has the decision-making authority related to the operation of the facility and the responsibility for the ongoing management or direction of the policies, services, or staff of the facility.\n\"Medication\" means a prescription or over-the-counter drug. For purposes of this chapter only, medication includes dietary supplements.\n\"Medication administration\" means performing a set of tasks that includes the following:\n(1) checking the resident's medication record;\n(2) preparing the medication as necessary;\n(3) administering the medication to the resident;\n(4) documenting the administration or reason for not administering the medication; and\n(5) reporting to a registered nurse or appropriate licensed health professional any concerns about the medication, the resident, or the resident's refusal to take the medication.\n\"Medication management\" means the provision of any of the following medication-related services to a resident:\n(1) performing medication setup;\n(2) administering medications;\n(3) storing and securing medications;\n(4) documenting medication activities;\n(5) verifying and monitoring the effectiveness of systems to ensure safe handling and administration;\n(6) coordinating refills;\n(7) handling and implementing changes to prescriptions;\n(8) communicating with the pharmacy about the resident's medications; and\n(9) coordinating and communicating with the prescriber.\n\"Medication reconciliation\" means the process of identifying the most accurate list of all medications the resident is taking, including the name, dosage, frequency, and route, by comparing the resident record to an external list of medications obtained from the resident, hospital, prescriber, or other provider.\n\"Medication setup\" means arranging medications by a nurse, pharmacy, or authorized prescriber for later administration by the resident or by facility staff.\n\"New construction\" means a new building, renovation, modification, reconstruction, physical changes altering the use of occupancy, or addition to a building.\n\"Nurse\" means a person who is licensed under sections 148.171 to 148.285.\n\"Nutritionist\" means a person licensed as a nutritionist under section 148.624.\n\"Occupational therapist\" means a person who is licensed under sections 148.6401 to 148.6449.\n\"Ombudsman\" means the ombudsman for long-term care.\n\"Over-the-counter drug\" means a drug that is not required by federal law to bear the symbol \"Rx only.\"\n\"Owner\" means an individual or legal entity that has a direct or indirect ownership interest of five percent or more in a licensee. For purposes of this chapter, \"owner of a nonprofit corporation\" means the president and treasurer of the board of directors or, for an entity owned by an employee stock ownership plan, means the president and treasurer of the entity. A government entity that is issued a license under this chapter shall be designated the owner.\n\"Person-centered planning and service delivery\" means services as defined in section 245D.07, subdivision 1a, paragraph (b).\n\"Pharmacist\" has the meaning given in section 151.01, subdivision 3.\n\"Physical therapist\" means a person who is licensed under sections 148.65 to 148.78.\n\"Physician\" means a person who is licensed under chapter 147.\n\"Physician assistant\" means a person who is licensed under chapter 147A.\n\"Prescriber\" means a person who is authorized by section 148.235; 151.01, subdivision 23; or 151.37 to prescribe prescription drugs.\n\"Prescription\" has the meaning given in section 151.01, subdivision 16a.\n\"Provisional license\" means the initial license the commissioner issues after approval of a complete written application and before the commissioner completes the provisional license survey and determines that the provisional licensee is in substantial compliance.\n\"Regularly scheduled\" means ordered or planned to be completed at predetermined times or according to a predetermined routine.\n\"Reminder\" means providing a verbal or visual reminder to a resident.\n\"Repeat violation\" means the issuance of two or more correction orders within a 12-month period for a violation of the same provision of a statute or rule.\n\"Resident\" means an adult living in an assisted living facility who has executed an assisted living contract.\n\"Resident record\" means all records that document information about the services provided to the resident.\n\"Respiratory therapist\" means a person who is licensed under chapter 147C.\n\"Secured dementia care unit\" means a designated area or setting designed for individuals with dementia that is locked or secured to prevent a resident from exiting, or to limit a resident's ability to exit, the secured area or setting. A secured dementia care unit is not solely an individual resident's living area.\n\"Serious injury\" has the meaning given in section 245.91, subdivision 6.\n\"Service plan\" means the written plan between the resident and the provisional licensee or licensee about the services that will be provided to the resident.\n\"Social worker\" means a person who is licensed under chapter 148D or 148E.\n\"Speech-language pathologist\" has the meaning given in section 148.512, subdivision 17.\n\"Standby assistance\" means the presence of another person within arm's reach to minimize the risk of injury while performing daily activities through physical intervention or cueing to assist a resident with an assistive task by providing cues, oversight, and minimal physical assistance.\n\"Substantial compliance\" means complying with the requirements in this chapter sufficiently to prevent unacceptable health or safety risks to residents.\n\"Supportive services\" means:\n(1) assistance with laundry, shopping, and household chores;\n(2) housekeeping services;\n(3) provision or assistance with meals or food preparation;\n(4) help with arranging for, or arranging transportation to, medical, social, recreational, personal, or social services appointments;\n(5) provision of social or recreational services; or\n(6) \"I'm okay\" check services.\nArranging for services does not include making referrals, or contacting a service provider in an emergency.\n\"Survey\" means an inspection of a licensee or applicant for licensure for compliance with this chapter and applicable rules.\n\"Surveyor\" means a staff person of the department who is authorized to conduct surveys of assisted living facilities.\n\"Treatment\" or \"therapy\" means the provision of care, other than medications, ordered or prescribed by a licensed health professional and provided to a resident to cure, rehabilitate, or ease symptoms.\n\"Unit of government\" means a city, county, town, school district, other political subdivision of the state, or agency of the state or federal government, that includes any instrumentality of a unit of government.\n\"Unlicensed personnel\" means individuals not otherwise licensed or certified by a governmental health board or agency who provide services to a resident.\n\"Verbal\" means oral and not in writing.",
	"repealed": false
}