{
	"id": "155A.271",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.271",
	"title": "155A.271 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "(a) To qualify for license renewal under this chapter as an individual cosmetologist, hair technician, nail technician, esthetician, advanced practice esthetician, eyelash technician, or salon manager, the applicant must complete four hours of continuing education credits from a board-approved continuing education provider during the three years prior to the applicant's renewal date. One credit hour of the requirement must include instruction pertaining to state laws and rules governing the practice of cosmetology. Three credit hours must include instruction pertaining to health, safety, and infection control matters consistent with the United States Department of Labor's Occupational Safety and Health Administration standards applicable to the practice of cosmetology, or other applicable federal health, infection control, and safety standards, and must be regularly updated so as to incorporate newly developed standards and accepted professional best practices. Credit hours earned are valid for three years and may be applied simultaneously to all individual licenses held by a licensee under this chapter.\n(b) In addition to the hours of continuing education credits required under paragraph (a), to qualify for license renewal under this chapter as an individual cosmetologist, hair technician, nail technician, esthetician, advanced practice esthetician, or salon manager, the applicant must also complete a four credit hour continuing education course from a board-approved continuing education provider based on any of the following within the licensee's scope of practice:\n(1) product chemistry and chemical interaction;\n(2) proper use and maintenance of machines and instruments;\n(3) business management, professional ethics, and human relations; or\n(4) techniques relevant to the type of license held.\nCredits are valid for three years and must be completed with a board-approved provider of continuing education during the three years prior to the applicant's renewal date and may be applied simultaneously to other individual licenses held as applicable, except that credits completed under this paragraph must not duplicate credits completed under paragraph (a).\n(c) Paragraphs (a) and (b) do not apply to an instructor license, a school manager license, or an inactive license.\nThe marketing or sale of any product is prohibited during a continuing education class receiving credit under subdivision 1.\n(a) Only a board-licensed school of cosmetology, a postsecondary institution as defined in section 136A.103, paragraph (a), or a board-recognized professional association organized under chapter 317A may be approved by the board to offer continuing education for credit under subdivision 1, paragraph (a). Continuing education under subdivision 1, paragraph (b), may be offered by a:\n(1) board-licensed school of cosmetology;\n(2) board-recognized professional association organized under chapter 317A; or\n(3) board-licensed salon.\nAn approved school or professional association may offer web-based continuing education instruction to achieve maximum involvement of licensees. Continuing education providers are encouraged to offer classes available in foreign language formats.\n(b) Board approval of any continuing education provider is valid for one calendar year and is contingent upon submission and preapproval of the lesson plan or plans with learning objectives for the class to be offered and the payment of the application fee in section 155A.25, subdivision 1a, paragraph (d), clause (10). The board shall maintain a list of approved providers and courses on the board's website. The board may revoke authorization of a continuing education provider at any time for just cause and the board may demand return of documents required under subdivision 3.\nThe continuing education provider shall provide to licensees documentation establishing completion of the class. Licensees shall retain proof of their continuing education credits for one year beyond the credit's expiration. The continuing education provider shall retain documentation of all licensees completing a class and the licensee's credit hours awarded by them for five years.\nThe board shall conduct random audits of active licensees and continuing education providers to ensure compliance with the requirements of this section. To initiate an audit, the board shall notify an active licensee of the audit and request proof of credits earned during a specified period. The licensee must provide the requested proof to the board within 30 days of an audit notice. The board may request that a continuing education provider verify a licensee's credits. The provider must furnish verification, or a written statement that the credits are not verified, within 15 days of the board's request for verification. If the board determines that a licensee has failed to provide proof of necessary credits earned during the specified time, the board may revoke the individual's license and may deem the individual an expired practitioner subject to penalty under section 155A.25 or 155A.36. The board staff shall have unrestricted free access to any provider's class offerings to verify adherence to the provider's approved lesson plan and overall compliance with this chapter.",
	"repealed": false
}