{
	"id": "299L.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/299L.07",
	"title": "299L.07 GAMBLING DEVICES.",
	"text": "Except as provided in subdivision 2, a person may not (1) manufacture, sell, offer to sell, lease, rent, or otherwise provide, in whole or in part, a gambling device as defined in sections 349.30, subdivision 2, and 609.75, subdivision 4, or (2) operate a testing facility, without first obtaining a license under this section.\nNotwithstanding subdivision 1, a gambling device:\n(1) may be sold by a person who is not licensed under this section, if the person (i) is not engaged in the trade or business of selling gambling devices, and (ii) does not sell more than one gambling device in any calendar year;\n(2) may be sold by the governing body of a federally recognized Indian tribe described in subdivision 2a, paragraph (b), clause (1), which is not licensed under this section, if (i) the gambling device was operated by the Indian tribe, (ii) the sale is to a distributor licensed under this section, and (iii) the licensed distributor notifies the commissioner of the purchase, in the same manner as is required when the licensed distributor ships a gambling device into Minnesota;\n(3) may be possessed by a person not licensed under this section if the person holds a permit issued under section 299L.08; and\n(4) may be possessed by a state agency, with the written authorization of the director, for display or evaluation purposes only and not for the conduct of gambling.\n(a) A manufacturer licensed under this section may sell, offer to sell, lease, or rent, in whole or in part, a gambling device only to a distributor licensed under this section.\n(b) A distributor licensed under this section may sell, offer to sell, market, rent, lease, or otherwise provide, in whole or in part, a gambling device only to:\n(1) the governing body of a federally recognized Indian tribe that is authorized to operate the gambling device under a tribal state compact under the Indian Gaming Regulatory Act, Public Law 100-497, and future amendments to it;\n(2) a person for use in the person's dwelling for display or amusement purposes in a manner that does not afford players an opportunity to obtain anything of value;\n(3) another distributor licensed under this section; or\n(4) a person in another state who is authorized under the laws of that state to possess the gambling device.\n(a) A person holding a license to operate a testing facility may possess a gambling device only for the purpose of performing tests on the gambling device.\n(b) No person may hold a license to operate a testing facility under this section who is licensed as a manufacturer or distributor of gambling devices under this section or as a manufacturer or distributor of gambling equipment under chapter 349.\nThe commissioner may issue a license under this section if the commissioner determines that the applicant will conduct the business in a manner that will not adversely affect the public health, welfare, and safety or be detrimental to the effective regulation and control of gambling.\nAn application for a license under this section must be on a form prescribed by the commissioner and must, at a minimum, contain:\n(1) the name and address of the applicant and, if it is a corporation, the names of all officers, directors, and shareholders with a financial interest of five percent or more;\n(2) the names and addresses of any holding corporation, subsidiary, or affiliate of the applicant, without regard to whether the holding corporation, subsidiary, or affiliate does business in Minnesota; and\n(3) if the applicant does not maintain a Minnesota office, an irrevocable consent statement signed by the applicant, stating that suits and actions relating to the subject matter of the application or acts of omissions arising from it may be commenced against the applicant in a court of competent jurisdiction in this state by service on the secretary of state of any summons, process, or pleadings authorized by the laws of this state. If any summons, process, or pleading is served upon the secretary of state, it must be by duplicate copies. One copy must be retained in the Office of the Secretary of State and the other copy must be forwarded immediately by certified mail to the address of the applicant, as shown on the application.\nBefore a license under this section is granted, the director may conduct a background and financial investigation of the applicant, including the applicant's sources of financing. The director may, or shall when required by law, require that fingerprints be taken and the director may forward the fingerprints to the Federal Bureau of Investigation for a national criminal history check. The director may charge an investigation fee of $15 to cover the cost of the investigation. Of this fee, $7 from each charge shall be deposited in the general fund.\n(a) A license issued under this section is valid for one year.\n(b) For a person who distributes 100 or fewer used gambling devices per year, the fee is $1,500. For a person who distributes more than 100 used gambling devices per year, the fee is $2,000.\n(c) For a person who manufactures or distributes 100 or fewer new, or new and used gambling devices in a year, the fee is $5,000. For a person who manufactures or distributes more than 100 new, or new and used gambling devices in a year, the fee is $7,500.\n(d) For a testing facility, the fee is $5,000.\nMS 1992 [Repealed, 1994 c 633 art 4 s 11]\n(a) The commissioner may not issue or renew a license under this chapter, and shall revoke a license under this chapter, if the applicant or licensee, or a director, officer, partner, governor, person in a supervisory or management position of the applicant or licensee, an employee eligible to make sales on behalf of the applicant or licensee, or direct or indirect holder of more than a five percent financial interest in the applicant or licensee:\n(1) has ever been convicted of a felony, or of a crime involving gambling;\n(2) has ever been convicted of (i) assault, (ii) a criminal violation involving the use of a firearm, or (iii) making terroristic threats;\n(3) is or has ever connected with or engaged in an illegal business;\n(4) owes $500 or more in delinquent taxes as defined in section 270C.72;\n(5) had a sales and use tax permit revoked by the commissioner of revenue within the past two years;\n(6) after demand, has not filed tax returns required by the commissioner of revenue; or\n(7) had a license or permit revoked or denied by another jurisdiction for a violation of law or rule relating to gambling.\nThe commissioner may deny or refuse to renew a license under this chapter, and may revoke a license under this chapter, if any of the conditions in this subdivision is applicable to an affiliate of or a direct or indirect holder of more than a five percent financial interest in the applicant or licensee.\n(b) The commissioner may by order deny, suspend, revoke, refuse to renew a license or premises permit, or censure a licensee or applicant, if the commissioner finds that the order is in the public interest and that the applicant or licensee, or a director, officer, partner, person in a supervisory or management position of the applicant or licensee, or an employee eligible to make sales on behalf of the applicant or licensee:\n(1) has violated or failed to comply with any provision of this chapter, chapter 297E, or 349, or any rule adopted or order issued thereunder;\n(2) has filed an application for a license that is incomplete in any material respect, or contains a statement that, in light of the circumstances under which it was made, is false, misleading, fraudulent, or a misrepresentation;\n(3) has made a false statement in a document or report required to be submitted to the director, the commissioner, or the commissioner of revenue, or has made a false statement in a statement made to the director or commissioner;\n(4) has been convicted of a crime in another jurisdiction that would be a felony if committed in Minnesota;\n(5) is permanently or temporarily enjoined by any gambling regulatory agency from engaging in or continuing any conduct or practice involving any aspect of gambling;\n(6) has had a gambling-related license revoked or suspended, or has paid or been required to pay a monetary penalty of $2,500 or more, by a gambling regulator in another state or jurisdiction, or has violated or failed to comply with an order of such a regulator that imposed those actions;\n(7) has been the subject of any of the following actions by the director or commissioner: (i) had a license under this chapter denied, suspended or revoked, (ii) been censured, reprimanded, has paid or been required to pay a monetary penalty or fine, or (iii) has been the subject of any other discipline by the director;\n(8) has engaged in conduct that is contrary to the public health, welfare, or safety, or to the integrity of gambling; or\n(9) based on the licensee's past activities or criminal record, poses a threat to the public interest or to the effective regulation and control of gambling, or creates or enhances the danger of unsuitable, unfair, or illegal practices, methods, and activities in the conduct of gambling or the carrying on of the business and financial arrangements incidental to the conduct of gambling.\nThe commissioner may impose a civil penalty not to exceed $500 per violation on a person who has violated this chapter, or any rule adopted or order issued under this chapter, unless a different penalty is specified.\n(a) If the commissioner determines that one of the conditions listed in subdivision 8 exists, or that a licensee is no longer conducting business in the manner required by subdivision 2a, the commissioner may issue an order requiring a person to show cause why any or all of the following should not occur: (1) the license be revoked or suspended, (2) the licensee be censured, (3) a civil penalty be imposed, or (4) corrective action be taken.\n(b) The order must give reasonable notice of the time and place for hearing on the matter, and must state the reasons for the entry of the order. The commissioner may by order summarily suspend a license pending final determination of any order to show cause. If a license is suspended pending final determination of an order to show cause, a hearing on the merits must be held within 30 days of the issuance of the order of suspension. All hearings must be conducted in accordance with sections 14.57 to 14.69 of the Administrative Procedure Act.\n(c) After the hearing the commissioner must enter an order disposing of the matter as the facts require. If the licensee fails to appear at a hearing after being notified of the hearing, the person is deemed in default and the proceeding may be determined against the person on consideration of the order to show cause, the allegations of which are deemed to be true.\n(a) When it appears to the commissioner that a license application or renewal should be denied under subdivision 8, the commissioner must promptly give to the applicant a written notice of the denial. The notice must state the grounds for the denial and give reasonable notice of the rights of the applicant to request a hearing. A hearing must be held not later than 30 days after the request for the hearing is received by the commissioner, unless the applicant and the commissioner agree that the hearing may be held at a later date. If no hearing is requested within 30 days of the service of the notice, the denial becomes final. All hearings under this subdivision must be conducted in accordance with sections 14.57 to 14.69 of the Administrative Procedure Act.\n(b) After the hearing, the commissioner shall enter an order making such disposition as the facts require. If the applicant fails to appear at a hearing after being notified of the hearing, the applicant is deemed in default and the proceeding may be determined against the applicant on consideration of the notice denying application or renewal, the allegations of which are deemed to be true. All fees accompanying the initial or renewal application are considered earned and are not refundable.\nIf a license lapses, is surrendered, withdrawn, terminated, or otherwise becomes ineffective, the commissioner may institute a proceeding under this subdivision within two years after the license was last effective and enter a revocation or suspension order as of the last day on which the license was in effect, or impose a civil penalty as provided in subdivision 8a.\nA licensee under this section must notify the commissioner within 30 days of the action whenever any of the actions listed in subdivision 8, paragraph (b), clause (6), have been taken against the licensee in another state or jurisdiction.\nA person to whom a license is issued under this section shall provide, in a manner prescribed by the commissioner, information required by the commissioner relating to the shipment and sale of gambling devices.\nIn addition to the requirements of this section, the transportation of gambling devices into or out of Minnesota must be in compliance with United States Code, title 15, sections 1171 to 1177, as amended.\nThe commissioner, director, and employees of the division may inspect the business premises of a licensee under this section.",
	"repealed": false
}