{
	"id": "290C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.10",
	"title": "290C.10 WITHDRAWAL PROCEDURES.",
	"text": "(a) The current owner of land enrolled under the sustainable forest incentive program for a minimum of one-half the number of years of the covenant's minimum duration may notify the commissioner of the intent to terminate enrollment. Within 90 days of receipt of notice to terminate enrollment, the commissioner shall inform the claimant in writing, acknowledging receipt of this notice and indicating the effective date of termination from the sustainable forest incentive program. Termination of enrollment in the sustainable forest incentive program occurs on January 1 of the calendar year following receipt by the commissioner of the termination notice, but no earlier than January 1 of the fifth, 11th, or 26th calendar year for the eight-, 20-, or 50-year respective minimum covenant, subject to the applicable covenant duration period under section 290C.055. After the commissioner issues an effective date of termination, a claimant wishing to continue the land's enrollment in the sustainable forest incentive program beyond the termination date must apply for enrollment as prescribed in section 290C.04. A claimant who withdraws a parcel of land from this program may not reenroll the parcel for a period of three years. Within 90 days after the termination date, the commissioner shall execute and acknowledge a document releasing the land from the covenant required under this chapter. The document must be mailed to the claimant and is entitled to be recorded.\n(b) Notwithstanding paragraph (a), on request of the claimant, the commissioner may allow early withdrawal from the Sustainable Forest Incentive Act without penalty when the state of Minnesota, any local government unit, or any other entity which has the power of eminent domain acquires title or possession to the land for a public purpose. In the case of an eligible acquisition under this paragraph, the commissioner shall execute and acknowledge a document releasing the land acquired by the state, local government unit, or other entity from the covenant.\n(c) Notwithstanding paragraph (a), upon request of the claimant, the commissioner shall allow early withdrawal from the Sustainable Forest Incentive Act without penalty when a government or nonprofit entity acquires a permanent conservation easement on the enrolled property and the conservation easement is at least as restrictive as the covenant required under section 290C.04. The commissioner of natural resources must notify the commissioner of lands acquired under this paragraph that are eligible for withdrawal. In the case of an eligible easement acquisition under this paragraph, the commissioner shall execute and acknowledge a document releasing the land subject to the easement from the covenant.\n(d) Notwithstanding paragraph (a), upon request of the claimant, the commissioner shall allow early withdrawal from the Sustainable Forest Incentive Act without penalty for land that is subject to fee or easement acquisition or lease to the state of Minnesota or a political subdivision of the state for the public purpose of a paved trail. The commissioner of natural resources must notify the commissioner of lands acquired under this paragraph that are eligible for withdrawal. In the case of an eligible fee or easement acquisition or lease under this paragraph, the commissioner shall execute and acknowledge a document releasing the land subject to fee or easement acquisition or lease by the state or political subdivision of the state.\n(e) All other enrolled land must remain in the program.",
	"repealed": false
}