{
	"id": "256R.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.09",
	"title": "256R.09 REPORTING OF STATISTICAL AND COST REPORTS.",
	"text": "Each nursing facility shall file a statistical and cost report for the prior reporting period by February 1 in a form and manner specified by the commissioner. Notice of rates shall be distributed by November 15.\nAll nursing facilities must provide information annually to the commissioner on a form and in a manner determined by the commissioner. The commissioner may separately require facilities to submit in a manner specified by the commissioner documentation of statistical and cost information included in the report to ensure accuracy in establishing payment rates and to perform audit and appeal review functions under this chapter. The commissioner may also require nursing facilities to provide statistical and cost information for a subset of the items in the annual report on a semiannual basis. Nursing facilities must report only costs directly related to the operation of the nursing facility. The facility must not include costs which are separately reimbursed or reimbursable by residents, medical assistance, or other payors. Allocations of costs from central, affiliated, or corporate office and related organization transactions shall be reported according to sections 256R.07, subdivision 3, and 256R.12, subdivisions 1 to 7. The commissioner shall not grant facilities extensions to the filing deadline.\nFacilities shall retain all records necessary to document statistical and cost information on the report for a period of no less than seven years. The commissioner may amend information in the report according to section 256R.13, subdivision 2. For computerized accounting systems, the records must include copies of electronically generated media and technology to enable access to the records.\nThe commissioner may reject a report filed by a nursing facility under this section if the commissioner determines that the report has been filed in a form that is incomplete or inaccurate and the information is insufficient to establish accurate payment rates. In the event that a complete report is not submitted in a timely manner, the commissioner shall reduce the reimbursement payments to a nursing facility to 85 percent of amounts due until the information is filed. The release of withheld payments shall be retroactive for no more than 90 days. A nursing facility that does not submit a report or whose report is filed in a timely manner but determined to be incomplete shall be given written notice that a payment reduction is to be implemented and allowed ten days to complete the report prior to any payment reduction. The commissioner may delay the payment withhold under exceptional circumstances to be determined at the sole discretion of the commissioner.\n(a) The accrual method of accounting in accordance with generally accepted accounting principles is the only method acceptable for purposes of satisfying the reporting requirements of this chapter. If a governmentally owned nursing facility demonstrates that the accrual method of accounting is not applicable to its accounts and that a cash or modified accrual method of accounting more accurately reports the nursing facility's financial operations, the commissioner shall permit the governmentally owned nursing facility to use a cash or modified accrual method of accounting.\n(b) For reimbursement purposes, a provider must pay an accrued nonpayroll expense within 180 days following the end of the reporting period. A provider must not report on a subsequent cost report an expense disallowed by the commissioner under this paragraph for nonpayment unless the commissioner grants a specific exception to the 180-day rule for a documented contractual arrangement such as receivership, property tax installment payments, or pension contributions.\n(a) Nursing facilities may, within 12 months of the due date of a statistical and cost report, file an amendment when errors or omissions in the annual statistical and cost report are discovered and an amendment would result in a rate increase of at least 0.15 percent of the statewide weighted average operating payment rate and shall, at any time, file an amendment which would result in a rate reduction of at least 0.15 percent of the statewide weighted average operating payment rate.\n(b) The commissioner must calculate the statewide average operating payment rate as follows:\n(1) for each nursing facility reimbursed under this chapter, multiply the number of resident days in each case mix classification the facility has billed to the commissioner under this chapter during the previous reporting year by the facility's corresponding case mix adjusted total payment rates;\n(2) sum the results of clause (1) for all facilities reimbursed under this chapter;\n(3) calculate the total number of resident days billed by all nursing facilities reimbursed under this chapter during the previous reporting year; and\n(4) divide the result of clause (2) by the result of clause (3).\n(c) The commissioner shall make retroactive adjustments to the total payment rate of a nursing facility if an amendment is accepted. When a retroactive adjustment is made as a result of an amended report, audit findings, or other determination of an incorrect payment rate, the commissioner may settle the payment error through a negotiated agreement with the facility and a gross adjustment of the payments to the facility. Retroactive adjustments shall not be applied to private pay residents. An error or omission for purposes of this subdivision does not include a nursing facility's determination that an election between permissible alternatives was not advantageous and should be changed.\nIf the commissioner determines that a nursing facility knowingly supplied inaccurate or false information or failed to file an amendment to a statistical and cost report that resulted in or would result in an overpayment, the commissioner shall immediately adjust the nursing facility's payment rate and recover the entire overpayment. The commissioner may also terminate the commissioner's agreement with the nursing facility and prosecute under applicable state or federal law.",
	"repealed": false
}