{
	"id": "325F.675",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.675",
	"title": "325F.675 FRAUD RELATED TO CONSUMER TELEPHONE RECORDS.",
	"text": "Whoever:\n(1) knowingly procures, attempts to procure, solicits, or conspires with another to procure, a telephone record of any resident of this state without the authorization of the customer to whom the record pertains or by fraudulent, deceptive, or false means;\n(2) knowingly sells, or attempts to sell, a telephone record of any resident of this state without the authorization of the customer to whom the record pertains; or\n(3) receives a telephone record of any resident of this state knowing that such record has been obtained without the authorization of the customer to whom the record pertains or by fraudulent, deceptive, or false means,\nis guilty of a violation of this section.\n(a) A violation of this section is a gross misdemeanor punishable by a sentence of up to 364 days, a fine of $3,000, or both.\n(b) Each subsequent violation is a felony punishable by a sentence of up to five years, a fine of $5,000, or both.\n(c) A violation of this section is subject to a $5,000 civil penalty.\nFor purposes of this subdivision:\n(1) \"Telephone record\" means information retained by a telephone company that relates to a telephone number dialed from the customer's telephone, an incoming call directed to a customer's telephone, or other data related to calls typically contained on a customer's telephone bill, including, but not limited to, the time the call started and ended, the duration of the call, the time of day the call was made, charges applied, and information indicating the location from which or to which calls were made. For purposes of this section, any information collected and retrieved by customers using caller ID or other similar technology is not a telephone record.\n(2) \"Procure\" means to obtain by any means, whether electronically, in writing, or in oral form, with or without consideration.\n(3) \"Telephone company\" means any person or other entity that provides commercial telephone service to a customer, irrespective of the communications technology used to provide the service, including, but not limited to, traditional wireline or cable telephone service; cellular, broadband PCS, or other wireless telephone service; microwave, satellite, or other terrestrial telephone service; and voice over Internet telephone service.\nExcept as otherwise provided by this section, a violation of this section constitutes an unfair or deceptive trade practice under section 325D.44.\n(a) Telephone companies that maintain telephone records of a resident of this state shall establish reasonable procedures to protect against unauthorized or fraudulent disclosure of such records which could result in substantial harm or inconvenience to a customer.\n(b) No private right of action is authorized under this subdivision.\nNo provisions of this section shall be construed to prohibit a telephone company from obtaining, using, disclosing, or permitting access to any telephone record, either directly or indirectly, through its agents:\n(1) unless prohibited by law;\n(2) with the lawful consent of the customer or subscriber;\n(3) as may be necessarily incident to the rendition of the service, to initiate, render, bill, and collect customer charges, or to the protection of the rights or property of the provider of that service, or to protect users of those services and other carriers from fraudulent, abusive, or unlawful use of, or subscription to, such services;\n(4) in connection with the sale or transfer of all or part of a business, or the purchase or acquisition of a portion or all of a business, or the migration of a customer from one carrier to another;\n(5) to a governmental entity, if the telephone company reasonably believes that an emergency involving immediate danger of death or serious physical injury to any person justifies disclosure of the information; or\n(6) to the National Center for Missing and Exploited Children, in connection with a report submitted under section 226 of the federal Victims of Child Abuse Act of 1990, Public Law 101-647.\nViolations of this section are enforced under section 8.31.",
	"repealed": false
}