{
	"id": "16B.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.51",
	"title": "16B.51 AGENCY REPORTS.",
	"text": "The commissioner shall supervise and control the making and distribution of all reports and other publications of all kinds issued by the state and state agencies when not otherwise prescribed by law. The commissioner shall also prescribe the manner and form of issuing reports required by sections 8.08; 16A.50; 35.03; 129D.02, subdivision 5; 256.01; and 299C.18.\nThe commissioner may prescribe fees to be charged for services rendered by the state or an agency in furnishing to those who request them certified copies of records or other documents, certifying that records or documents do not exist and furnishing other reports, publications, data, or related material which is requested. The fees, unless otherwise prescribed by law, may be fixed at the market rate. The commissioner of management and budget is authorized to approve the prescribed rates for the purpose of assuring that they, in total, will result in receipts greater than costs in the fund. Fees prescribed under this subdivision are deposited in the state treasury by the collecting agency and credited to the general services revolving fund. Nothing in this subdivision permits the commissioner of administration to furnish any service which is now prohibited or unauthorized by law.\nThe commissioner may sell official reports, documents, data, and publications of all kinds, may delegate their sale to state agencies, and may establish facilities for their sale within the Department of Administration and elsewhere within the state service. The commissioner may remit a portion of the price of any publication or data to the agency producing the publication or data. Money that is remitted to an agency is annually appropriated to that agency to discharge the costs of preparing the publications or data.\nThis section does not apply to the Regents of the University of Minnesota or to the State Agricultural Society.\nThe commissioner may not adopt rules to prescribe the fees permitted by subdivision 2 or which limit in any way the subject matter of a report or publication which the law requires or authorizes an agency to produce.",
	"repealed": false
}