{
	"id": "60M.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.07",
	"title": "60M.07 OTHER PROVISIONS.",
	"text": "A producer must comply with the Minnesota Court Administrator's Office's bail bond procedures and standards of conduct, including but not limited to while in or on the property of courts, jails, or other detention facilities in Minnesota. A surety or bail bond agency must require the surety or bail bond agency's producers to affirm that the producer complies with any changes to the bail bond procedures and standards of conduct as the changes are posted to the Minnesota state court website or the Minnesota Court Administrator's Office's website.\nA producer is prohibited from soliciting or accepting a waiver of any requirement under this chapter.\n(a) A bail bond agency and producer must maintain the following records on each bond for at least seven years after the date the bond is terminated:\n(1) power of attorney;\n(2) premium receipts;\n(3) the promissory note for unpaid premium, if any;\n(4) the cash bond amount set by the court, if an amount less than the filed rate is accepted for the premium;\n(5) all documents related to any lawsuit filed to collect the premium;\n(6) indemnity agreements;\n(7) collateral receipts, if any;\n(8) proof that collateral was returned, if any;\n(9) proof of bond exoneration or forfeiture payment;\n(10) all records relating to liquidating and converting collateral, including fees or costs; and\n(11) proof of any expenses incurred or losses paid by the surety, bail bond agency, or producer.\n(b) A bail bond agency and producer must maintain all premium account, collateral account, and operating account bank records, including deposit slips, for at least seven years after the records are made available.\n(c) All records that a bail bond agency or producer maintain under this chapter must be kept in the bail bond agency or producer's office or storage location, as applicable. If a bail bond agency or producer's relationship with a surety is terminated, the information and documentation must be immediately transferred to:\n(1) the bail bond agency, if the producer is terminated; or\n(2) the surety, if the bail bond agency is terminated.\n(d) A bail bond agency and producer's records must be available for the commissioner or the surety to inspect, with or without notice.\n(a) During the surety's annual audit of a producer, the producer must sign a compliance certification form that attests to the producer's compliance with this chapter during the previous calendar year.\n(b) Before a producer is appointed by a surety and at each license renewal thereafter, a producer must sign an affidavit of compliance form in which the producer acknowledges the producer is familiar and continually complies with the requirements under this chapter. The surety must retain completed affidavits and send requested affidavits to the commissioner within ten days of the date an affidavit is requested.\n(c) The commissioner must establish the compliance certification and affidavit of compliance forms for use under this subdivision.\n(a) If a producer's relationship with a surety is voluntarily or involuntarily terminated due to a violation of this chapter or because the surety determined the producer violated this chapter during an annual audit, the surety must, within 30 days of the date the producer is terminated, provide the commissioner with the terminated producer's name and the reason the producer was terminated.\n(b) Another surety is prohibited from appointing a producer subject to a termination under paragraph (a) unless the department approves the appointment.\nA surety, bail bonds agency, and producer are considered a government associated entity and are allowed to apply and be granted access to the Minnesota Government Access system under the Court Access Rules.\nThe courts, jails, and sheriff offices in Minnesota must comply with section 629.63, allowing for a principal to be surrendered and received by the jail of the county that the bail bond was originated from and to be held in custody until the principal can have a court hearing where the surety, bail bond agency, or producer can give evidence and make motion for the revocation and discharge of the bail bond.\nThe court must order a bail bond forfeited and send notice to the surety, bail bond agency, or producer no later than 30 days from the date of a principal failing to appear at a scheduled hearing. If a court fails to forfeit a bail bond within 30 days of a principal failing to appear or fail to send notice within seven days of the forfeiture to the surety, bail bond agency, or producer, the court must allow for a reinstatement and discharge of the bail bond without penalty. If a court fails to take action against the bail bond within 30 days of a principal failing to appear at a hearing, the court must allow for revocation and discharge without penalty.",
	"repealed": false
}