{
	"id": "51A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.19",
	"title": "51A.19 RECORDS.",
	"text": "Every association shall keep at the home office correct and complete books of account and minutes of the proceedings of members, directors, stockholders, and the executive committee. Complete records of all business transacted at the home office shall be maintained at the home office. Control records of all business transacted at other offices shall be maintained at the home office.\n[Repealed, 1988 c 666 s 75]\n[Repealed, 1988 c 666 s 75]\nEvery association shall close its books at the close of business on December 31 of each year, or more often if desired by the association.\nThe commissioner may order that assets, individually or in the aggregate, to the extent that such assets are overvalued on an association's books, be charged off, or that a special reserve or reserves equal to such overvaluation be set up by transfers from undivided profits or reserves.\nThe bonds or other interest bearing obligations purchased by an association shall not be carried on its books at more than the cost thereof.\nAn association shall not carry any real estate on its books at a sum in excess of the total amount invested by such association on account of such real estate, including advances, costs, and improvements but excluding accrued but uncollected interest.\nEvery association shall have appraised each parcel of real estate at the time of acquisition. The report of each appraisal shall be kept in the records of the association. In addition to the powers under section 51A.44, subdivision 6, the commissioner may require the appraisal of real estate securing loans which are delinquent more than four months.\nEvery association shall maintain complete loan and investment records, and shall do so in a manner satisfactory to the commissioner. Detailed records necessary to make determinations of compliance by an association with the requirements of sections 47.59 and 51A.35 to 51A.386, and other provisions of sections 51A.01 to 51A.57 shall be maintained consistently and at all times, the record of each real estate loan or other secured loan or investment containing documentation to the satisfaction of the commissioner of the type, adequacy, and complexion of the security.\nEvery mutual association shall maintain membership records, which shall show the name and address of the member, the status of the member as a savings account holder, or an obligor, or a savings account holder and obligor, and the date of membership thereof. In the case of members holding a savings account the mutual association shall obtain a savings account contract containing the signature of each holder of such account or a duly authorized representative, and shall preserve such contract in the records of the association.\nEvery capital stock association shall at all times keep an accurate verified list of all its stockholders with the amount of stock held by each, the type of stock, voting status, the dates of all issuances and transfers, and names of transferees, and shall annually file a copy of the list as it appears on the date of the annual stockholders meeting with the commissioner. A capital stock association has the power to employ the services of a transfer agent to maintain stockholder records and perform stock transfer services. Whenever a change occurs in the outstanding voting stock of any capital stock association which will result in control or in a change in the control of the association it shall promptly report the facts to the commissioner of commerce. As used in this subdivision the term \"control\" means the power to directly or indirectly direct or cause the direction of the management or policies of the association. A change in ownership of capital stock which would result in direct or indirect ownership by a stockholder or an affiliated group of stockholders of less than 25 percent of the outstanding capital stock shall not be considered a change of control. If there is any doubt as to whether a change in the outstanding voting stock is sufficient to result in control thereof or to effect a change in control thereof, the doubt shall be resolved in favor of reporting the facts to the commissioner.\nEvery association shall use the forms and keep the records, including without limitation, those of its members or stockholders, the commissioner from time to time requires.\nAny association may cause any or all records kept by the association to be copied or reproduced by any photostatic, photographic, or microfilming process which correctly and permanently copies, reproduces, or forms a medium for copying or reproducing the original record on a film or other durable material, and the association may thereafter dispose of the original record. Any copy or reproduction shall be deemed to be an original record for all purposes and shall be treated as an original record in all courts or administrative agencies for the purpose of its admissibility in evidence. A facsimile, exemplification, or certified copy of any copy or reproduction reproduced from a film record shall, for all purposes, be deemed a facsimile, exemplification or certified copy of the original record.",
	"repealed": false
}