{
	"id": "373.053",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.053",
	"title": "373.053 WAR MEMORIAL BUILDINGS.",
	"text": "Subject to the limitations of this section, a county may construct and maintain in the county a building, including a hospital, to be erected as a memorial to the men and women who have served in the armed forces of the United States during a time when it was at war, if the construction of the building at a sum not to exceed a specified amount is authorized by a vote of the electors of the county in the manner provided by section 375.20. The cost of the building shall not exceed $250,000.\nThe war memorial building, if not a hospital, shall be under the supervision and control of the county board. The building shall be used as a meeting place for local or county units of any war veterans' organization chartered by the Congress of the United States, and if there is space, for offices of the organizations. The building may also contain the county library and the exhibits of the county historical society and other civic and recreational facilities as determined by the county board. If the memorial is a hospital, it shall be under the control of the county board or a hospital commission to be appointed by the board.\nA city in which the construction of a war memorial building or hospital has been authorized, may acquire and convey to the county without compensation a suitable tract of land upon which to construct the building.\nTo pay the cost of the war memorial building or hospital, the county board, after approval of the project by a vote of the electors of the county, may certify to the county auditor the amount necessary for the construction of the building and the portion of the amount to be levied in each succeeding taxable year, not exceeding five years, until the whole has been raised. The county auditor on receipt of the certification shall levy upon all taxable property in the county a tax in each year certified by the county board sufficient to produce the amount certified. The proceeds of the tax levy shall be deposited in a separate \"War Memorial Building Account.\"\nThe county board may certify to the county auditor the amount necessary each year for the maintenance and operation of the building or hospital. The county auditor upon receipt of the certification shall levy a tax upon all taxable property in the county sufficient to produce the amount certified. The proceeds of the tax levy shall be credited to the War Memorial Building Account and shall be used only for the maintenance and operation of the war memorial building. Any balance remaining in the account at the end of any year shall be available for the next year, and the amount certified by the county board for the maintenance and operation of the war memorial building or hospital shall be reduced by the amount of the balance.\nTo carry out the purposes of this section the county board or hospital commission may accept grants or gifts from the federal government or any of its agencies, or from any person.",
	"repealed": false
}