{
	"id": "123A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.22",
	"title": "123A.22 COOPERATIVE CENTERS FOR VOCATIONAL EDUCATION.",
	"text": "Two or more independent school districts may enter into an agreement to establish a cooperative center to provide for vocational education and other educational services upon the vote of a majority of the full membership of each of the boards of the districts entering into the agreement. The agreement may also provide for membership by cities, counties, and other governmental units as defined in section 471.59. When a resolution approving this action has been adopted by the board of a district, the resolution shall be published once in a newspaper of general circulation in the district. If a petition for referendum on the question of the district entering into the agreement, containing signatures of qualified voters of the district equal to five percent of the number of voters at the last school district general election, is filed with the clerk of the board within 60 days after publication of the resolution, the board must not enter into the agreement until the question has been submitted to the voters of the district at a special election. This election must be conducted and canvassed in the same manner as school district general elections. If a majority of the total number of votes cast on the question within the district is in favor of the proposition, the board may enter into an agreement to establish the center for purposes described in this section.\nA public corporation so created shall be known as ....(insert name).... Cooperative Center No. ..... and shall have an identification number assigned pursuant to section 123A.56.\n(a) The center must be operated by a center board of not less than five members which shall consist of members from boards of each of the participating districts within the center and member cities, counties, and other governmental units, appointed by their respective boards. Each participating district must have at least one member on the center board. The center board must choose an administrative officer to administer center board policy and directives who shall serve as an ex officio member of the board but shall not have a vote.\n(b) The terms of office of the first members of the center board must be determined by lot as follows: one-third of the members for one year, one-third for two years, and the remainder for three years, all terms to expire on June 30 of the appropriate year; provided that if the number of members is not evenly divisible by three, the membership will be as evenly distributed as possible among one, two and three-year terms with the remaining members serving the three-year term. Thereafter the terms shall be for three years commencing on July 1 of each year. If a vacancy occurs on the center board, it must be filled by the appropriate school board within 90 days. A person appointed to the center board shall qualify as a center board member by filing with the chair a written certificate of appointment from the appointing school board.\n(c) The first meeting of a center board must be at a time mutually agreed upon by center board members. At this meeting, the center board must choose its officers and conduct any other necessary organizational business. Thereafter the center board must meet on July 1 of each year or as soon thereafter as practicable pursuant to notice sent to all center board members by the chief executive officer of the center.\n(d) The officers of the center board shall be a chair, vice-chair, clerk and treasurer, no two of whom when possible shall be from the same school district. The chair shall preside at all meetings of the center board except in the chair's absence the vice-chair shall preside. The clerk shall keep a complete record of the minutes of each meeting and the treasurer shall be the custodian of the funds of the center. Insofar as applicable, sections 123B.09, 123B.14, 123B.143, and 123B.147, shall apply to the board and officers of the center.\n(e) Each participating district must have equal voting power with at least one vote. A majority of the center board shall be a quorum. Any motion other than adjournment shall pass only upon receiving a majority of the votes of the entire center board.\n(a) The center board shall have the general charge of the business of the center and the ownership of facilities. Where applicable, sections 123B.51 and 123B.52, subdivision 4, shall apply. The center board may not issue bonds in its behalf. Each participating district may issue its bonds for the purpose of acquisition and betterment of center facilities in the amount certified by the center board to such participating district in accordance with chapter 475.\n(b) The center board (1) may furnish vocational offerings to any eligible person residing in any participating district; (2) may provide special education for the disabled and disadvantaged; and (3) may provide any other educational programs or services defined in section 123A.21, subdivisions 7 and 8, agreed upon by the participating members. Academic offerings shall be provided only under the direction of properly licensed academic supervisory personnel.\n(c) In accordance with subdivision 5, paragraph (b), the center board shall certify to each participating district the amount of funds assessed to the district as its proportionate share required for the conduct of the educational programs, payment of indebtedness, and all other proper expenses of the center.\n(d) The center board must employ and contract with necessary qualified teachers and administrators and may discharge the same for cause pursuant to section 122A.40. The authority for selection and employment of a director shall be vested in the center board. Notwithstanding the provisions of section 122A.40, subdivision 10 or 11, no individual shall have a right to employment as a director based on seniority or order of employment by the center. The center board may employ and discharge other necessary employees and may contract for other services deemed necessary.\n(e) The center board may provide an educational program for secondary and adult vocational phases of instruction. The high school phase of its educational program must be offered as a component of the comprehensive curriculum offered by each of the participating school districts. Graduation must be from the student's resident high school district. Insofar as applicable, sections 120A.22, subdivision 1a, 120B.14, 120B.35, 121A.21, 122A.44, 122A.69, 123A.22, 123A.24, 123B.02, subdivisions 1 to 15 and 17 to 20, 123B.49, 123B.51, 123B.52, 123B.88, 124D.02, 124D.09, and 124D.51, shall apply.\n(f) The center board may prescribe rates of tuition for attendance in its programs by adults and nonmember district secondary students.\n(a) Any center board established pursuant to this section is a public corporation and agency and may receive and disburse federal, state, and local funds made available to it. A participating school district or member must not have any additional individual liability for the debts or obligations of the center except that assessment which has been certified as its proportionate share in accordance with paragraph (b) and subdivision 4, paragraphs (a) and (c). A member of the center board shall have such liability as is applicable to a member of an independent school district board. Any property, real or personal, acquired or owned by the center board for its purposes shall be exempt from taxation by the state or any of its political subdivisions.\n(b) The center board may, in each year, for the purpose of paying any administrative, planning, operating, or capital expenses incurred or to be incurred, assess and certify to each participating school district its proportionate share of any and all expenses. This share must be based upon an equitable distribution formula agreed upon by the participating districts. Each participating district shall remit its assessment to the center board within 30 days after receipt. The assessments shall be paid within the maximum levy limitations of each participating district.\nBefore a center begins operation, the commissioner must approve the agreement establishing the center entered into by participating districts.\nAs of the effective date of the creation of any center as contained in the agreement establishing the center, the organization, operation, maintenance, and conduct of the affairs of the center shall be governed by the general laws relating to independent school districts of the state unless provided otherwise in statute.\nUpon approval by majority vote of a board and of the center board, an adjoining district may become a member in the center and be governed by the provisions of this section and the agreement in effect.\nAny participating district may withdraw from the center and from the agreement in effect by a majority vote of the full board membership of the participating district desiring withdrawal and upon compliance with provisions in the agreement establishing the center. Upon receipt of the withdrawal resolution reciting the necessary facts, the center board must file a certified copy with the county auditors of the counties affected. The withdrawal shall become effective at the end of the next following school year but the withdrawal shall not affect the continued liability of the withdrawing district for bonded indebtedness it incurred prior to the effective withdrawal date.\nThe boards of each participating district may agree to dissolve a center effective at the end of any school year or at an earlier time as they may mutually agree. A dissolution must be accomplished in accordance with any applicable provisions of the agreement establishing the center. Upon receipt of the dissolution resolutions from the boards of the participating districts, the center board shall file a certified copy with the county auditors of the counties affected. The dissolution must not affect the continuing liability of the previously participating districts for bonded indebtedness incurred prior to the dissolution, or for other continuing obligations, including unemployment benefits.\nCenters operating pursuant to section 471.59 which have been approved by the State Board of Education prior to August 1, 1974, shall be subject to its provisions except subdivision 1. Any changes in center agreements necessary to comply with this section shall be completed within 12 months after August 1, 1974, and filed with the commissioner by the administrator of each center. Centers operating pursuant to Laws 1967, chapter 822, as amended, Laws 1969, chapter 775, as amended, and Laws 1969, chapter 1060, as amended, shall not be subject to the provisions of this section.\n[Repealed, 2007 c 146 art 11 s 19]",
	"repealed": false
}