{
	"id": "148E.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.065",
	"title": "148E.065 EXEMPTIONS.",
	"text": "Nothing in this chapter may be construed to prevent members of other professions or occupations from performing functions for which they are qualified or licensed. This exception includes but is not limited to: licensed physicians, registered nurses, licensed practical nurses, licensed psychologists, psychological practitioners, probation officers, members of the clergy and Christian Science practitioners, attorneys, marriage and family therapists, alcohol and drug counselors, professional counselors, school counselors, and licensed occupational therapists or licensed occupational therapist assistants. These persons must not, however, hold themselves out to the public by any title or description stating or implying that they are engaged in the practice of social work, or that they are licensed to engage in the practice of social work. Persons engaged in the practice of social work are not exempt from the board's jurisdiction solely by the use of one of the titles in this subdivision.\nAn internship, externship, or any other social work experience that is required for the completion of an accredited program of social work does not constitute the practice of social work under this chapter. Students exempted under this section may use the title \"social work intern.\"\nMS 2010 [Repealed, 2012 c 197 art 1 s 19]\nMS 2014 [Expired, 2012 c 197 art 1 s 11]\nBeginning July 1, 2016, the licensure of city, county, and state agency social workers is voluntary, except an individual who is newly employed by a city or state agency after July 1, 2016, must be licensed if the individual who provides social work services, as those services are defined in section 148E.010, subdivision 11, paragraph (b), is presented to the public by any title incorporating the words \"social work\" or \"social worker.\"\nMS 2014 [Expired, 2012 c 197 art 1 s 13]\n(a) The licensure of social workers who are employed by federally recognized tribes is voluntary.\n(b) The licensure of private, nonprofit, nontribal agency social workers whose primary service focus addresses ethnic minority populations, and who are themselves members of ethnic minority populations within those agencies, is voluntary until July 1, 2016, when newly employed individuals who practice social work must be licensed as required under section 148E.055, subdivision 1.",
	"repealed": false
}