{
	"id": "322C.1009",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.1009",
	"title": "322C.1009 FILINGS REQUIRED FOR CONVERSION; EFFECTIVE DATE AND TIME.",
	"text": "After a plan of conversion is approved:\n(1) if the converting organization is a converting limited liability company, the converting limited liability company shall file articles of conversion with the secretary of state, together with a total fee of $60, which articles of conversion must be signed as provided in section 322C.0203, subdivision 1, and must include:\n(i) a statement that the limited liability company is converting into another organization;\n(ii) the name and form of the converted organization and the jurisdiction of its governing statute;\n(iii) the time the conversion is effective under the governing statute of the converted organization;\n(iv) a statement that the conversion was approved as required by this chapter;\n(v) a statement that the conversion was approved as required by the governing statute of the converted organization; and\n(vi) if the converted organization is a foreign organization not authorized to transact business in this state, the street address of an office that the secretary of state may use for the purposes of section 322C.1010, subdivision 3; and\n(2) if the converting organization is not a converting limited liability company, the converting organization shall file articles of conversion with the secretary of state, together with a total fee of $60, which articles of conversion must be signed as provided in section 322C.0203, subdivision 1, and must include:\n(i) articles of organization for the limited liability company into which the converting organization is converting, which articles of organization must include the information required by section 322C.0201, subdivision 2, clauses (1) and (2);\n(ii) a statement that the converting organization is converting into a limited liability company from another organization;\n(iii) the name and form of the converting organization and the jurisdiction of its governing statute; and\n(iv) a statement that the conversion was approved in a manner that complied with the converting organization's governing statute.\nA conversion becomes effective:\n(1) if the converted organization is a limited liability company, when the articles of conversion are filed with the secretary of state or on a later date or later time specified in the articles of conversion; and\n(2) if the converted organization is not a limited liability company, as provided by the governing statute of the converted organization.\nThe secretary of state shall issue to the converted organization or its legal representative a certificate of conversion.",
	"repealed": false
}