{
	"id": "462A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.40",
	"title": "462A.40 MINNESOTA HOUSING TAX CREDIT CONTRIBUTION ACCOUNT.",
	"text": "The Minnesota housing tax credit contribution account is created in the housing development fund in the state treasury. The account is administered by the Minnesota Housing Finance Agency. Amounts contributed to the account are appropriated to the agency. The agency may use the amounts appropriated to direct disbursements from the account as loans or grants to eligible recipients as provided in this section.\n(a) The agency may award grants and loans to be used for multifamily and single family developments for persons and families of low and moderate income. Allowable use of the funds include: gap financing, as defined in section 462A.33, subdivision 1; new construction; acquisition; rehabilitation; demolition or removal of existing structures; construction financing; permanent financing; interest rate reduction; and refinancing.\n(b) The agency may give preference for grants and loans to comparable proposals that include regulatory changes or waivers that result in identifiable cost avoidance or cost reductions, including but not limited to increased density, flexibility in site development standards, or zoning code requirements.\n(a) The agency may award a grant or a loan to any recipient that qualifies under subdivision 2. The agency must not award a grant or a loan to a disqualified individual or disqualified business.\n(b) For the purposes of this subdivision disqualified individual means:\n(1) an individual who or an individual whose immediate family member made a contribution to the account in the current or prior taxable year and received a credit certificate;\n(2) an individual who or an individual whose immediate family member owns the housing for which the grant or loan will be used;\n(3) an individual who meets the following criteria:\n(i) the individual is an officer or principal of a business entity; and\n(ii) that business entity made a contribution to the account in the current or previous taxable year and received a credit certificate; or\n(4) an individual who meets the following criteria:\n(i) the individual directly owns, controls, or holds the power to vote 20 percent or more of the outstanding securities of a business entity; and\n(ii) that business entity made a contribution to the account in the current or previous taxable year and received a credit certificate.\n(c) For the purposes of this subdivision disqualified business means a business entity that:\n(1) made a contribution to the account in the current or prior taxable year and received a credit certificate;\n(2) has an officer or principal who is an individual who made a contribution to the account in the current or previous taxable year and received a credit certificate; or\n(3) meets the following criteria:\n(i) the business entity is directly owned, controlled, or is subject to the power to vote 20 percent or more of the outstanding securities by an individual or business entity; and\n(ii) that controlling individual or business entity made a contribution to the account in the current or previous taxable year and received a credit certificate.\n(d) For purposes of this subdivision, \"immediate family\" means the taxpayer's spouse, parent or parent's spouse, sibling or sibling's spouse, or child or child's spouse. For a married couple filing a joint return, the limitations in this subdivision apply collectively to the taxpayer and spouse.\n(e) Before applying for a grant or loan, all recipients must sign a disclosure that the disqualifications under this subdivision do not apply. The Minnesota Housing Finance Agency must prescribe the form of the disclosure. The Minnesota Housing Finance Agency may rely on the disclosure to determine the eligibility of recipients under paragraph (a).\n(f) The agency may award grants or loans to a city as defined in section 462A.03, subdivision 21; a federally recognized American Indian tribe or subdivision located in Minnesota; a tribal housing corporation; a private developer; a nonprofit organization; a housing and redevelopment authority under sections 469.001 to 469.047; a public housing authority or agency authorized by law to exercise any of the powers granted by sections 469.001 to 469.047; or the owner of the housing. The provisions of subdivision 2, and paragraphs (a) to (e) and (g) of this subdivision, regarding the use of funds and eligible recipients apply to grants and loans awarded under this paragraph.\n(g) Eligible recipients must use the funds to serve households that meet the income limits as provided in section 462A.33, subdivision 5.\nA loan or grant awarded under this section is subject to repayment or recapture under rules adopted by the agency. Any amount of a loan or grant that is repaid or recaptured must be redeposited in the account and is not returned to the taxpayer who made the contribution.\nThe agency shall report by January 15 each year to the chairs and ranking minority members of the legislative policy and finance committees with jurisdiction over housing on the tax credits and financing provided in the previous fiscal year. The report shall provide a breakdown of the tax credits, grants, and loans by region of the state. The report shall also include information on planned financing in the current fiscal year.",
	"repealed": false
}