{
	"id": "609.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.135",
	"title": "609.135 STAY OF IMPOSITION OR EXECUTION OF SENTENCE.",
	"text": "(a) Except when a sentence of life imprisonment is required by law, or when a mandatory minimum sentence is required by section 609.11, any court may stay imposition or execution of sentence and:\n(1) may order intermediate sanctions without placing the defendant on probation; or\n(2) may place the defendant on probation with or without supervision and on the terms the court prescribes, including intermediate sanctions when practicable. The court may order the supervision to be under the probation officer of the court, or, if there is none and the conviction is for a felony or gross misdemeanor, by the commissioner of corrections, or in any case by some other suitable and consenting person. Unless the court directs otherwise, state parole and probation agents and probation officers may impose community work service or probation violation sanctions, consistent with section 243.05, subdivision 1, or sections 244.197 to 244.199.\nNo intermediate sanction may be ordered performed at a location that fails to observe applicable requirements or standards of chapter 181A or 182, or any rule promulgated under them.\n(b) For purposes of this subdivision, subdivision 6, and section 609.14, the term \"intermediate sanctions\" includes but is not limited to incarceration in a local jail or workhouse, home detention, electronic monitoring, intensive probation, sentencing to service, reporting to a day reporting center, chemical dependency or mental health treatment or counseling, restitution, fines, day-fines, community work service, work service in a restorative justice program, work in lieu of or to work off fines and, with the victim's consent, work in lieu of or to work off restitution.\n(c) A court may not stay the revocation of the driver's license of a person convicted of violating the provisions of section 169A.20.\n(d) If the court orders a fine, day-fine, or restitution as an intermediate sanction, payment is due on the date imposed unless the court otherwise establishes a due date or a payment plan.\n(e) The court may prohibit a defendant from using adult-use cannabis flower as defined in section 342.01, subdivision 4, or adult-use cannabis products as defined in section 342.01, subdivision 2, if the defendant undergoes a chemical use assessment and abstinence is consistent with a recommended level of care for the defendant in accordance with the criteria under section 254B.04, subdivision 4. The assessment must be conducted by an assessor qualified under section 245G.11, subdivisions 1 and 5.\n(f) A court shall not impose an intermediate sanction that has the effect of prohibiting a person from participating in the registry program as defined in section 342.01, subdivision 63.\nIf the court orders payment of restitution as a condition of probation and if the defendant fails to pay the restitution in accordance with the payment schedule or structure established by the court or the probation officer, the prosecutor or the defendant's probation officer may, on the prosecutor's or the officer's own motion or at the request of the victim, ask the court to hold a hearing to determine whether or not the conditions of probation should be changed or probation should be revoked. The defendant's probation officer shall ask for the hearing if the restitution ordered has not been paid prior to 60 days before the term of probation expires. The court shall schedule and hold this hearing and take appropriate action, including action under subdivision 2, paragraph (h), before the defendant's term of probation expires.\nNothing in this subdivision limits the court's ability to refer the case to collections under section 609.104 when a defendant fails to pay court-ordered restitution.\n[Repealed, 1987 c 384 art 1 s 52]\nIf the court orders a defendant to undergo treatment as a condition of probation and if the defendant fails to successfully complete treatment at least 60 days before the term of probation expires, the prosecutor or the defendant's probation officer may ask the court to hold a hearing to determine whether the conditions of probation should be changed or probation should be revoked. The court shall schedule and hold this hearing and take appropriate action, including action under subdivision 2, paragraph (i), before the defendant's term of probation expires.\n(a) Except as provided in paragraph (b), if the conviction is for a felony, the stay shall be for not more than five years or the maximum period for which the sentence of imprisonment might have been imposed, whichever is less.\n(b) If the conviction is for a felony violation of, or a felony-level attempt or conspiracy to violate, section 609.19; 609.195; 609.20; 609.2112; 609.2113, subdivision 2; 609.2662; 609.2663; 609.2664; 609.268; 609.342; 609.343; 609.344; 609.345; 609.3451; 609.3458; or 609.749; or a felony-level attempt or conspiracy to violate section 609.185 or 609.2661, the stay shall be for not more than four years or the maximum period for which the sentence of imprisonment might have been imposed, whichever is longer.\n(c) If the conviction is for a gross misdemeanor violation of section 169A.20, 609.2113, subdivision 3, or 609.3451, the stay shall be for not more than four years. The court shall provide for unsupervised probation for the last year of the stay unless the court finds that the defendant needs supervised probation for all or part of the last year.\n(d) If the conviction is for a gross misdemeanor not specified in paragraph (c), the stay shall be for not more than two years.\n(e) If the conviction is for any misdemeanor under section 169A.20; 609.746, subdivision 1; 609.79; or 617.23; or for a misdemeanor under section 609.2242 or 609.224, subdivision 1, in which the victim of the crime was a family or household member as defined in section 518B.01, the stay shall be for not more than two years. The court shall provide for unsupervised probation for the second year of the stay unless the court finds that the defendant needs supervised probation for all or part of the second year.\n(f) If the conviction is for a misdemeanor not specified in paragraph (e), the stay shall be for not more than one year.\n(g) The defendant shall be discharged six months after the term of the stay expires, unless the stay has been revoked or extended under paragraph (h), or the defendant has already been discharged.\n(h) Notwithstanding the maximum periods specified for stays of sentences under paragraphs (a) to (g), a court may extend a defendant's term of probation for up to one year if it finds, at a hearing conducted under subdivision 1a, that:\n(1) the defendant has not paid court-ordered restitution in accordance with the payment schedule or structure; and\n(2) the defendant is likely to not pay the restitution the defendant owes before the term of probation expires.\nThis one-year extension of probation for failure to pay restitution may be extended by the court for up to one additional year if the court finds, at another hearing conducted under subdivision 1a, that the defendant still has not paid the court-ordered restitution that the defendant owes.\nNothing in this subdivision limits the court's ability to refer the case to collections under section 609.104.\n(i) Notwithstanding the maximum periods specified for stays of sentences under paragraphs (a) to (g), a court may extend a defendant's term of probation for up to three years if it finds, at a hearing conducted under subdivision 1c, that:\n(1) the defendant has failed to complete court-ordered treatment successfully; and\n(2) the defendant is likely not to complete court-ordered treatment before the term of probation expires.\nThe court shall report to the commissioner of public safety any stay of imposition or execution granted in the case of a conviction for an offense in which a motor vehicle, as defined in section 169.011, subdivision 42, is used.\nThe court may, as a condition of probation, require the defendant to serve up to one year incarceration in a county jail, a county regional jail, a county work farm, county workhouse or other local correctional facility, or require the defendant to pay a fine, or both. The court may allow the defendant the work release privileges of section 631.425 during the period of incarceration.\nIf a person is convicted of assaulting a spouse or other person with whom the person resides, and the court stays imposition or execution of sentence and places the defendant on probation, the court must condition the stay upon the defendant's participation in counseling or other appropriate programs selected by the court.\n(a) Until a judicial district has adopted standards under section 629.72, subdivision 2a, paragraph (b), governing electronic monitoring devices used to protect victims of domestic abuse, a court within the judicial district, as a condition of a stay of imposition or execution of a sentence, may not order an offender convicted of a crime described in paragraph (b) to use an electronic monitoring device to protect a victim's safety.\n(b) This subdivision applies to the following crimes, if committed by the defendant against a family or household member as defined in section 518B.01, subdivision 2:\n(1) violations of orders for protection issued under chapter 518B;\n(2) assault in the first, second, third, or fifth degree under section 609.221, 609.222, 609.223, or 609.224; or domestic assault under section 609.2242;\n(3) criminal damage to property under section 609.595;\n(4) disorderly conduct under section 609.72;\n(5) harassing telephone calls under section 609.79;\n(6) burglary under section 609.582;\n(7) trespass under section 609.605;\n(8) criminal sexual conduct in the first, second, third, fourth, or fifth degree under section 609.342, 609.343, 609.344, 609.345, or 609.3451, or sexual extortion under section 609.3458;\n(9) terroristic threats under section 609.713;\n(10) harassment or stalking under section 609.749;\n(11) violations of harassment restraining orders under section 609.748;\n(12) violations of domestic abuse no contact orders under section 629.75; and\n(13) interference with an emergency call under section 609.78, subdivision 2.\n(c) The location data associated with the victim and offender are security information as defined in section 13.37. Location data maintained by a law enforcement agency, probation authority, prosecutorial agency, or court services department may be shared among those agencies to develop and monitor conditions of a stayed sentence under this section.\n(d) A violation of a location restriction by an offender in a situation involving a victim and offender who are both mobile does not automatically constitute a violation of the conditions of the offender's stayed sentence.\n[See Note.]\nA court staying imposition or execution of a sentence that does not include a term of incarceration as a condition of the stay shall order other intermediate sanctions where practicable.\nAn offender may not demand execution of sentence in lieu of a stay of imposition or execution of sentence if the offender will serve less than nine months at the state institution. This subdivision does not apply to an offender who will be serving the sentence consecutively or concurrently with a previously imposed executed felony sentence.\n[Repealed, 2009 c 83 art 2 s 50]",
	"repealed": false
}