{
	"id": "86A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/86A.12",
	"title": "86A.12 NATURAL RESOURCES CAPITAL IMPROVEMENT PROGRAM.",
	"text": "A natural resources capital improvement program is established to prioritize among eligible public projects to be funded from state bond proceeds appropriated to the commissioner and distinctly specified for the purposes of the program established in this section and in accordance with the standards and criteria set forth in this section.\nThe purpose of the natural resources capital improvement program is to improve the management and conservation of the natural resources of the state, including recreational, scientific and natural areas, and wild game and fish, through the acquisition and betterment of public lands, buildings, and improvements of a capital nature.\nArticle XI, section 5, clause (a), of the constitution provides that state general obligation bonds may be issued to finance the acquisition or betterment, including preservation, of public land, buildings, and improvements of a capital nature and to provide money to be appropriated or loaned to any agency or political subdivision of the state for those purposes. Article XI, section 5, clause (f), of the constitution further provides that state general obligation bonds may be issued to finance the promotion of forestation and prevention and abatement of forest fires, including the compulsory clearing and improving of public and private wild lands. In interpreting these provisions and applying them to the purpose of the program established in this section, the following standards are adopted for determining the priority among eligible natural resources projects to be funded under the program:\n(a) A project will be an expenditure eligible under this program only when it is a capital expenditure on a capital asset owned or to be owned by the state or a political subdivision of the state within the meaning of accepted accounting principles as applied to public expenditures. The legislature assumes that some provisions for the management and conservation of the natural resources of the state constituting acquisition or betterment of land, buildings, or capital improvements within the meaning of the constitution will be sensitive to timing and circumstances and require discretion of the commissioner based on currently available facts and circumstances, particularly projects related to the mitigation of natural disasters and the acquisition of lands as they become available, and so these projects will be financed more efficiently and economically under the program than by separate appropriations for each project.\n(b) The commissioner will review potential eligible projects, will make initial allocations among types of eligible projects within each category enumerated in the act making an appropriation for the program, will determine priorities within each category, and will allocate money as specified in the appropriation act and in priority order within each category until the available appropriation for the category has been committed.\n(a) The following criteria must be considered:\n(1) expansion of the natural resources of the state for the enjoyment and use of the public;\n(2) urgency in providing for the conservation of the natural resources of the state, including protection of threatened and endangered species and waters;\n(3) necessity in ensuring the safety of the public; and\n(4) additional criteria for priorities otherwise specified in state law, statute, rule, or regulation applicable to a category listed in the act making an appropriation for the program.\n(b) Criteria can be stated only in general terms, since it is a purpose of the program to improve the allocation of limited amounts of available funds by enlisting the knowledge and experience of the Department of Natural Resources in determining relative needs as they develop.\n(c) The criteria in paragraph (a) are not listed in a rank order of priority.\n(d) Economy is also to be determined and may even reinforce a decision based on other criteria, if the project would forestall a larger future capital expenditure or would reduce operating expense.\n(e) Absolute cost must also be considered. It may be too high to warrant funding except by an additional appropriation, or so high as to warrant a recommendation to abandon the project. It may be so low as to permit payment out of the department's operating budget.\n[Repealed, 2012 c 272 s 98]",
	"repealed": false
}