{
	"id": "97A.408",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.408",
	"title": "97A.408 ANATOMICAL GIFT OPTION; EDUCATION.",
	"text": "(a) Applications through the Department of Natural Resources' online sales system for a resident license to hunt or fish that is required under this chapter or chapter 97B must allow the applicant to indicate a desire to make an anatomical gift according to paragraph (b).\n(b) The online sales system application must contain statements sufficient to comply with the requirements of the Darlene Luther Revised Uniform Anatomical Gift Act, chapter 525A, so that execution of the application makes the anatomical gift effective for those indicating a desire to make an anatomical gift. The department website must provide a link to a federally designated organ procurement organization website that contains information describing Minnesota laws regarding anatomical gifts, the need for and benefits of anatomical gifts, and the legal implications of making an anatomical gift, including the law governing revocation of anatomical gifts.\n(c) The commissioner must provide education by distributing information about organ and tissue donation and how to register as a donor. The commissioner must distribute the information through Department of Natural Resources print and digital communications targeting those who hunt and fish. The commissioner must prepare the information in conjunction with a Minnesota organ procurement organization.\n(d) The commissioner is not required to keep the physical record of the donor's application after issuing the license in order for the anatomical gift to be valid. When an individual indicates consent on an online sales system transaction to share private data for the record of registered donors, the commissioner must provide the private name and address of the individual to the organ procurement organization designated by the federal government. The names and addresses are classified as private data under section 84.0874 and remain private once provided to the organ procurement organization.\n(e) Chapter 525A applies to anatomical gifts made on an application for a license under this section.\n(f) The department must be reimbursed under section 171.075, subdivision 1, for the reasonable costs of administering an anatomical gift program.",
	"repealed": false
}