{
	"id": "116L.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.18",
	"title": "116L.18 SPECIAL INCUMBENT WORKER TRAINING GRANTS.",
	"text": "The purpose of the special incumbent worker training grants is to expand opportunities for businesses and workers to gain new skills that are in demand in the Minnesota economy. The board shall establish criteria for incumbent worker grants under this section and may encourage creative training models, innovative partnerships, and expansion or replication of promising practices.\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Incumbent worker\" means an individual employed by a qualifying employer.\n(c) \"Qualifying employer\" means a for-profit business or nonprofit organization in Minnesota with at least one full-time paid employee. Public sector organizations are not considered qualifying employers.\n(d) \"Eligible organization\" has the meaning given in section 116L.17.\nA grant to an eligible organization may not exceed $400,000.\nThe board shall require matching funds from qualifying employers in the form of funding, equipment, or faculty.\nEligible organizations shall use funds granted under this section for direct training services to provide a measurable increase in the job-related skills of participating incumbent workers. Eligible organizations may also provide basic assessment, counseling, and preemployment training services requested by the qualifying employer. No funds may be used for support services as described in section 116L.17, subdivision 4, clause (2).\nThe board and the commissioner of employment and economic development shall jointly develop performance outcome measures and standards for this program. The commissioner and board shall consult with eligible organizations in establishing standards. Measures at a minimum must include posttraining retention, promotion, and wage increase. The board and commissioner shall provide a report to the legislature by March 1 of each year on the previous fiscal year's program performance. Eligible organizations must provide performance data in a timely manner for the completion of this report.",
	"repealed": false
}