{
	"id": "256S.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.191",
	"title": "256S.191 ELDERLY WAIVER BUDGET AND RATE EXCEPTIONS; HIGH-NEED PARTICIPANTS.",
	"text": "A participant is eligible to request an elderly waiver budget and rate exception when:\n(1) hospitalization of the participant is no longer medically necessary but the participant has not been discharged to the community due to lack of community care options;\n(2) the participant requires a support plan that exceeds elderly waiver budgets and rates due to the participant's specific assessed needs; and\n(3) the participant meets all eligibility criteria for the elderly waiver.\n(a) A participant eligible under subdivision 1 may request, in a format prescribed by the commissioner, an elderly waiver budget and rate exception when requesting an eligibility determination for elderly waiver services. The participant may request an exception to the elderly waiver case mix caps, the customized living service rate limits, service rates, or any combination of the three.\n(b) The participant must document in the request that the participant's needs cannot be met within the existing case mix caps, customized living service rate limits, or service rates and how an exception to any of the three will meet the participant's needs.\n(c) The participant must include in the request the basis for the underlying costs used to determine the overall cost of the proposed service plan.\n(d) The commissioner must respond to all exception requests, whether the request is granted, denied, or granted as modified. The commissioner must include in the response the basis for the action and provide notification of the right to appeal.\n(e) Participants granted exceptions under this section must apply annually in a format prescribed by the commissioner to continue or modify the exception.\n(f) A participant no longer qualifies for an exception when the participant's needs can be met within standard elderly waiver budgets and rates.",
	"repealed": false
}