{
	"id": "245.8251",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.8251",
	"title": "245.8251 RULES FOR POSITIVE SUPPORT STRATEGIES AND PROHIBITIONS AND LIMITS ON RESTRICTIVE INTERVENTIONS; LICENSED FACILITIES AND PROGRAMS.",
	"text": "The commissioner of human services shall, by August 31, 2015, adopt rules to govern the use of positive support strategies, and ensure the applicability of chapter 245D prohibitions and limits on the emergency use of manual restraint and on the use of restrictive interventions to facilities and services governed by the rules. The rules apply to all facilities and services licensed under chapter 245D, and all licensed facilities and licensed services serving persons with a developmental disability or related condition, except child care is governed by section 142B.63. For the purposes of this section, \"developmental disability or related condition\" has the meaning given in Minnesota Rules, part 9525.0016, subpart 2, items A to E.\n(a) The commissioner shall, with stakeholder input, identify data elements specific to incidents of emergency use of manual restraint and positive support transition plans for persons receiving services from licensed facilities and licensed services under chapter 245D and in licensed facilities and licensed services serving persons with a developmental disability or related condition as defined in Minnesota Rules, part 9525.0016, subpart 2, effective January 1, 2014. Licensed facilities and licensed services shall report the data in a format and at a frequency determined by the commissioner of human services to the commissioner and the Office of the Ombudsman for Mental Health and Developmental Disabilities.\n(b) Beginning July 1, 2013, licensed facilities and licensed services regulated under Minnesota Rules, parts 9525.2700 to 9525.2810, shall submit data regarding the use of all controlled procedures identified in Minnesota Rules, part 9525.2740, in a format and at a frequency determined by the commissioner to the commissioner and the Office of the Ombudsman for Mental Health and Developmental Disabilities.\nRules adopted according to this section shall establish requirements for an external program review committee appointed by the commissioner to monitor the implementation of the rules and make recommendations to the commissioner about any needed policy changes after adoption of the rules.\n(a) The commissioner shall establish an interim review panel by August 15, 2014, for the purpose of reviewing requests for emergency use of procedures that have been part of an approved positive support transition plan when necessary to protect a person from imminent risk of serious injury as defined in section 245.91, subdivision 6, due to self-injurious behavior. The panel must make recommendations to the commissioner to approve or deny these requests based on criteria to be established by the interim review panel. The interim review panel shall operate until the external program review committee is established as required under subdivision 3.\n(b) Members of the interim review panel shall be selected based on their expertise and knowledge related to the use of positive support strategies as alternatives to the use of restrictive interventions. The commissioner shall seek input and recommendations in establishing the interim review panel. Members of the interim review panel shall include the following representatives:\n(1) an expert in positive supports;\n(2) a mental health professional, as defined in section 245.462;\n(3) a licensed health professional as defined in section 245D.02, subdivision 14; and\n(4) a representative of the Department of Health.",
	"repealed": false
}