{
	"id": "272.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.67",
	"title": "272.67 DIVISION OF LAND IN CITIES INTO RURAL AND URBAN DISTRICTS.",
	"text": "Any city however organized, except in those counties situated in a metropolitan area as defined in Minnesota Statutes 1961, section 473.02, subdivision 5, which contain cities of the first class, may by ordinance adopted in the manner provided in this section divide its area into an urban service district and a rural service district, constituting separate taxing districts for the purpose of all municipal property taxes except those levied for the payment of bonds and judgments and interest thereon. In proceedings for annexation, incorporation, or consolidation being conducted pursuant to chapter 414, the chief administrative law judge of the state Office of Administrative Hearings may divide a municipality into an urban service district and a rural service district, such districts to be designated in accordance with the criteria set out in subdivision 2. Thereafter, said urban service district and rural service district may be changed in the same manner that an ordinance or amendment is changed in accordance with this section.\nThe rural service district shall include only such unplatted lands as in the judgment of the governing body at the time of the adoption of the ordinance are rural in character, and are not developed for commercial, industrial, or urban residential purposes, and for these reasons are not benefited to the same degree as other lands by municipal services financed by general taxation. The rural service district may include lands which are not contiguous to one another. The ordinance may designate lands outside the city which, if annexed, shall be included within the rural service district. The urban service district shall include all lands within the boundaries of the city which are not included in the rural service district. The ordinance shall determine the approximate ratio which in the judgment of the governing body exists between the benefits resulting from tax-supported municipal service to parcels of land of like market value, situated in the rural service district and in the urban service district, respectively. By amendment of the ordinance this benefit ratio may be changed, and lands may be added to or removed from the rural service district; but no amendment shall be required to remove lands by the procedure provided in subdivision 5.\nEvery ordinance and amendment introduced under subdivision 2, before final adoption, shall be published in the official newspaper of the city, with notice of the time and place of a hearing thereon which shall be held by the governing body not less than 30 days after the publication. At the hearing, which may be adjourned from time to time by public announcement to those present, the governing body shall give reasonable hearing and consideration to all objections to and comments on the ordinance or amendment, made by or on behalf of any resident or taxpayer of the city or of any outside area described in the ordinance or amendment, whether presented orally or by written communication to the municipal clerk. Objections may be addressed to the establishment or extension of the rural service district as a whole, or to the inclusion or exclusion of any specified lands, or to the benefit ratio proposed to be established by the ordinance. They may be based on the character of the lands included or excluded or on the relative nature and extent of tax-supported municipal service and benefit to lands of rural and urban character.\nAt or after the hearing the governing body shall modify the ordinance in any respect and to any extent which it considers equitable, and shall cause it to be published in the form in which it is finally adopted, and a copy mailed to each person entitled to appear at the hearing who has requested a copy at the hearing or by written notice to the clerk. Within 30 days after the publication of the ordinance or amendment, any person entitled to appear at the hearing may appeal to the district court by serving a notice upon the clerk of the city, stating the grounds for such appeal, specifying the provisions of the ordinance or amendment which are claimed to be unreasonable, and alleging the facts on the basis of which such claim is made. The notice shall be filed with the court administrator of the district court within ten days after its service. It may be filed by the appellant not only for the appellant but also on behalf of all others of the class to which the appellant belongs, as described in the notice of appeal. The clerk of the city shall furnish the appellant certified copies of all proceedings and records in the clerk's custody which are reasonably required to present the appeal. The appeal shall be placed upon the calendar of the next general term commencing more than ten days after the date of serving the notice and shall be tried in accordance with the provisions of the district court Rules of Civil Procedure. If the appellant does not prevail upon the appeal, the costs incurred shall be taxed by the court and judgment entered therefor. All objections to the ordinance or amendment shall be deemed waived unless presented on such appeal; except that any person having any estate, right, title, or interest in or lien upon any parcel of land, who claims that any provision of the ordinance is unreasonable and that, by reason of such provision, any tax upon such parcel exceeds the amount which would be taxable thereon but for such provision, may have the validity of the claim determined by the district court in the manner provided in chapter 278, if the claimant alleges and proves to the satisfaction of the court that the claimant had no actual notice of the hearing held thereon pursuant to this section, and the claimant's rights were not adequately protected as a member of any class of persons for whom an appeal was taken pursuant to this section.\nWhenever any parcel of land, owned by one person or by two or more persons jointly or in common at the time of its inclusion in the rural service district, is platted, in whole or in part, and whenever application is made for a permit for the construction of a commercial, industrial, or urban residential development or improvement to be situated on such parcel or any part thereof, the board or officer approving such plat or building permit shall report this to the governing body, which shall make and enter an order transferring such parcel from the rural service district to the urban service district.\nA certified copy of every ordinance, amendment, and order adopted or entered under this section shall be filed with the county auditor before it becomes effective. For the purposes of taxation, if the ordinance, amendment, or order is certified on or before August 1 of a levy year, it may be implemented that same levy year. If the ordinance, amendment, or order is certified after August 1 of a levy year, it may not be implemented until the following levy year. The amount of taxes levied each year by each city shall be certified to the county auditor in the manner now or hereafter provided by law. Taxes levied for payment of bonds and judgments and interest thereon shall continue to be spread upon all taxable property within the boundaries of the city in proportion to the net tax capacity thereof. The remaining amount of the taxes levied each year shall be allocated by the county auditor to the urban service district and the rural service district in amounts proportionate to the current benefit ratio times the current ratio between the market values of all taxable property within the urban service district and all taxable property within the rural service district. Within each district, the amount so allocated shall be spread upon all taxable property in proportion to the net tax capacity thereof.\nThis section does not affect the classification of individual parcels of land for purposes of taxation under the provisions of section 273.13. No law or charter limiting the incurring of indebtedness or the levy of taxes by any city by reference to its population or the net tax capacity of taxable property therein is amended by this section in its application to any city whose area is divided into urban and rural service districts.\nNotwithstanding the provisions of subdivisions 2 and 5, a rural service district established by any city may include platted parcels of land which the governing body determines to be rural in character and not developed for urban residential, commercial, or industrial purposes. Whenever any lot or portion of a platted parcel which is included in the rural service district is developed for commercial, industrial or urban residential purposes, or basic urban services such as sewer, water, or street improvements are extended to any such lot or portion, the governing body shall transfer the entire platted parcel to the urban service district. The governing body of such city shall annually review the tax ratio applicable to such platted parcels as determined under subdivision 2, and shall annually review the status of all such platted parcels to determine whether such parcels continue to qualify for inclusion in the rural service district.",
	"repealed": false
}