{
	"id": "385.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/385.31",
	"title": "385.31 PAYMENT OF COUNTY ORDERS OR WARRANTS.",
	"text": "When any order or warrant drawn on the treasurer is presented for payment, if there is money in the treasury for that purpose, the county treasurer shall redeem the same, and write across the entire face thereof the word \"redeemed,\" the date of the redemption, and the treasurer's official signature. If there is not sufficient funds in the proper accounts to pay such orders they shall be numbered and registered in their order of presentation, and proper endorsement thereof shall be made on such orders and they shall be entitled to payment in like order. Such orders shall bear interest at not to exceed the rate of six percent per annum from such date of presentment. The treasurer, as soon as there is sufficient money in the treasury, shall appropriate and set apart a sum sufficient for the payment of the orders so presented and registered, and, if entitled to interest, issue to the original holder a notice that interest will cease in 30 days from the date of such notice; and, if orders thus entitled to priority of payment are not then presented, the next in order of registry may be paid until such orders are presented. No interest shall be paid on any order, except upon a warrant drawn by the county auditor for that purpose, giving the number and the date of the order on account of which the interest warrant is drawn. In any county in this state now or hereafter having an estimated market value of all taxable property of not less than $1,033,000,000, the county treasurer, in order to save payment of interest on county warrants drawn upon a fund in which there shall be temporarily insufficient money in the treasury to redeem the same, may borrow temporarily from any other fund in the county treasury in which there is a sufficient balance to care for the needs of such fund and allow a temporary loan or transfer to any other fund, and may pay such warrants out of such funds. Any such money so transferred and used in redeeming such county warrants shall be returned to the fund from which drawn as soon as money shall come in to the credit of such fund on which any such warrant was drawn and paid as aforesaid. Any county operating on a cash basis may use a combined form of warrant or order and check, which, when signed by the chair of the county board and by the auditor, is an order or warrant for the payment of the claim, and, when countersigned by the county treasurer, is a check for the payment of the amount thereof.",
	"repealed": false
}