{
	"id": "16C.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.155",
	"title": "16C.155 JANITORIAL CONTRACTS; REHABILITATION PROGRAMS AND EXTENDED EMPLOYMENT PROVIDERS.",
	"text": "The commissioner of administration shall ensure that a portion of all contracts for janitorial services; document imaging; document shredding; and mailing, collating, and sorting services be awarded by the state to rehabilitation programs and extended employment providers that are certified by the commissioner of employment and economic development, and day services licensed under chapter 245D. The amount of each contract awarded under this section may exceed the estimated fair market price as determined by the commissioner for the same goods and services by up to six percent. The aggregate value of the contracts awarded to eligible providers under this section in any given year must exceed 19 percent of the total value of all contracts for janitorial services; document imaging; document shredding; and mailing, collating, and sorting services entered into in the same year. For the 19 percent requirement to be applicable in any given year, the contract amounts proposed by eligible providers must be within six percent of the estimated fair market price for at least 19 percent of the contracts awarded for the corresponding service area.\n(a) On an annual basis, eligible service providers shall provide the following information to the commissioner in a format prescribed by the commissioner:\n(1) the address for all locations where the service provider operates;\n(2) the name, telephone number, and email address for a contact person at each location;\n(3) the capacity of the organization, by location, to provide the services identified in subdivision 1; and\n(4) the state of Minnesota vendor number for the provider.\n(b) The commissioner shall annually provide notice of the contracting requirements under subdivision 1 to all state authority for local purchasing buyers, as determined by the commissioner. The list shall include the names and principal addresses of the eligible service providers and the information provided to the commissioner by eligible service providers under paragraph (a). The commissioner shall inform each authority for local purchasing buyers of:\n(1) the requirements of subdivision 1;\n(2) the policy adopted by the commissioner to implement subdivision 1;\n(3) the applicable commodity codes for each service identified in subdivision 1;\n(4) the need for each authority for local purchasing buyers to record the applicable commodity code for each contract entered under subdivision 1 and for each contract covering one of the service areas identified in subdivision 1; and\n(5) the authority granted to the authority for local purchasing buyers to contract directly with the eligible providers as provided in section 16C.10.\nThe commissioner shall track, by the commodity code for each service area identified in subdivision 1, each contract entered into pursuant to this section. By February 15 of each year, the commissioner shall submit the following information for the previous fiscal year to the chairs and ranking members of the legislative committees with jurisdiction over workforce development:\n(1) the value of the contracts awarded to eligible service providers for each of the applicable commodity codes; and\n(2) the total value for all contracts awarded in each of the service areas identified in subdivision 1.",
	"repealed": false
}