{
	"id": "245C.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.31",
	"title": "245C.31 INDIVIDUAL REGULATED BY A HEALTH-RELATED LICENSING BOARD; DISQUALIFICATION BASED ON MALTREATMENT.",
	"text": "(a) The commissioner shall notify a health-related licensing board as defined in section 214.01, subdivision 2, if the commissioner determines that an individual who is licensed by the health-related licensing board and who is included on the board's roster list provided in accordance with subdivision 3a is responsible for substantiated maltreatment under section 626.557 or chapter 260E, in accordance with subdivision 2. Except as provided in paragraph (b), the health-related licensing board shall make a determination as to whether to impose disciplinary or corrective action under chapter 214, rather than the commissioner making the decision regarding disqualification.\n(b) The prohibition on disqualification in paragraph (a) does not apply to a background study of an individual regulated by a health-related licensing board if the individual's study is related to child foster care, adult foster care, or family child care licensure.\nThe commissioner shall notify a health-related licensing board:\n(1) of a record showing that the individual licensed by the board was determined to have been responsible for substantiated maltreatment;\n(2) upon the commissioner's completion of an investigation that determined an individual licensed by the board was responsible for substantiated maltreatment; or\n(3) upon receipt from another agency of a finding of substantiated maltreatment for which an individual licensed by the board was responsible.\n(a) When the commissioner or a local agency has reason to believe that the direct contact services provided by an individual may fall within the jurisdiction of a health-related licensing board, the commissioner or local agency shall refer the matter to the board as provided in this section.\n(b) If, upon review of the information provided by the commissioner, a health-related licensing board informs the commissioner that the board does not have jurisdiction to take disciplinary or corrective action, the commissioner shall make the appropriate disqualification decision regarding the individual as otherwise provided in this chapter.\nThe commissioner and each health-related licensing board shall enter into an agreement in order for each board to provide the commissioner with a daily roster list of individuals who have a license issued by the board in active status. The list must include for each licensed individual: the individual's name, aliases, date of birth, and license number; the date the license was issued; status of the license; and the last four digits of the individual's Social Security number.\n(a) The administrative service unit for the health-related licensing boards shall apportion between the health-related licensing boards that are required to submit a daily roster list in accordance with subdivision 3a an amount to be paid through an additional fee collected by each board in accordance with paragraph (b). The amount apportioned to each health-related licensing board must equal the board's share of the annual appropriation from the state government special revenue fund to the commissioner of human services to conduct the maltreatment studies on licensees who are listed on the daily roster lists and to comply with the notification requirement under subdivision 2. Each board's apportioned share must be based on the number of licensees that each health-related licensing board licenses as a percentage of the total number of licensees licensed collectively by all health-related licensing boards.\n(b) Each health-related licensing board may collect an additional fee from a licensee at the time the initial license fee is collected to compensate for the amount apportioned to each board by the administrative services unit. If an additional fee is collected by the health-related licensing board under this paragraph, the fee must be deposited in the state government special revenue fund.\n(a) The commissioner has the authority to monitor the facility's compliance with any requirements that the health-related licensing board places on regulated individuals practicing in a facility either during the period pending a final decision on a disciplinary or corrective action or as a result of a disciplinary or corrective action. The commissioner has the authority to order the immediate removal of a regulated individual from direct contact or access when a board issues an order of temporary suspension based on a determination that the regulated individual poses an immediate risk of harm to persons receiving services in a licensed facility.\n(b) A facility that allows a regulated individual to provide direct contact services while not complying with the requirements imposed by the health-related licensing board is subject to action by the commissioner as specified under sections 245A.06 and 245A.07.\n(c) The commissioner shall notify a health-related licensing board immediately upon receipt of knowledge of a facility's or individual's noncompliance with requirements the board placed on a facility or upon an individual regulated by the board.",
	"repealed": false
}