{
	"id": "148.6402",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6402",
	"title": "148.6402 DEFINITIONS.",
	"text": "For the purpose of sections 148.6401 to 148.6449, the following terms have the meanings given them.\n[Repealed, 1Sp2017 c 6 art 11 s 56]\n\"Biennial licensure period\" means the two-year period for which licensure is effective.\n\"Board\" means the Board of Occupational Therapy Practice established in section 148.6449.\n\"Contact hour\" means an instructional session of 60 minutes, excluding coffee breaks, registration, meals without a speaker, and social activities.\n\"Credential\" means a license, permit, certification, registration, or other evidence of qualification or authorization to engage in the practice of occupational therapy issued by any authority.\n\"Credentialing examination for occupational therapist\" means the examination sponsored by the National Board for Certification in Occupational Therapy for credentialing as an occupational therapist, registered.\n\"Credentialing examination for occupational therapy assistant\" means the examination sponsored by the National Board for Certification in Occupational Therapy for credentialing as a certified occupational therapy assistant.\n\"Delegate\" means to transfer to an occupational therapy assistant the authority to perform selected portions of an occupational therapy evaluation or treatment plan for a specific patient.\nMS 2018 [Repealed, 2020 c 79 art 2 s 26]\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\n\"Licensed health care professional\" means a person licensed in good standing in Minnesota to practice medicine, osteopathic medicine, chiropractic, podiatry, advanced practice registered nursing, or dentistry, or is a person registered as a physician assistant in Minnesota.\n\"Occupational therapist\" means an individual who meets the qualifications in sections 148.6401 to 148.6449 and is licensed by the board.\nMS 2018 [Repealed, 2020 c 79 art 2 s 26]\n\"Occupational therapy assistant\" means an individual who meets the qualifications for an occupational therapy assistant in sections 148.6401 to 148.6449 and is licensed by the board.\n\"Occupational therapy practitioner\" means any individual licensed as either an occupational therapist or occupational therapy assistant under sections 148.6401 to 148.6449.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\n[Repealed, 2001 c 7 s 91]\n\"License\" or \"licensed\" means the act or status of a natural person who meets the requirements of sections 148.6401 to 148.6449.\n\"Licensee\" means a person who meets the requirements of sections 148.6401 to 148.6449.\n\"Licensure by equivalency\" means a method of licensure described in section 148.6412 by which an individual who possesses a current credential from the National Board for Certification in Occupational Therapy may qualify for licensure.\n\"Licensure by reciprocity\" means a method of licensure described in section 148.6415 by which an individual who possesses a credential from another jurisdiction may qualify for Minnesota licensure.\n\"Limited license\" means a license issued according to section 148.6425, subdivision 3, paragraph (c), to persons who for two years or more did not apply for a license after meeting the requirements in section 148.6408 or 148.6410 or who allowed their license to lapse for four years or more.\n(a) \"Service competency\" of an occupational therapy assistant in performing evaluation tasks means the ability of an occupational therapy assistant to obtain the same information as the supervising occupational therapist when evaluating a client's function.\n(b) \"Service competency\" of an occupational therapy assistant in performing treatment procedures means the ability of an occupational therapy assistant to perform treatment procedures in a manner such that the outcome, documentation, and follow-up are equivalent to that which would have been achieved had the supervising occupational therapist performed the treatment procedure.\n(c) \"Service competency\" of an occupational therapist means the ability of an occupational therapist to consistently perform an assessment task or intervention procedure with the level of skill recognized as satisfactory within the appropriate acceptable prevailing practice of occupational therapy.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\n\"Temporary licensure\" means a method of licensure described in section 148.6418, by which an individual who (1) has completed an approved or accredited education program but has not met the examination requirement; or (2) possesses a credential from another jurisdiction or the National Board for Certification in Occupational Therapy but who has not submitted the documentation required by section 148.6420, subdivisions 3 and 4, may qualify for Minnesota licensure for a limited time period.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]",
	"repealed": false
}