{
	"id": "403.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.03",
	"title": "403.03 911 SERVICES TO BE PROVIDED.",
	"text": "(a) Services available through a 911 system must include police, firefighting, and emergency medical and ambulance services. Other emergency and civil defense services may be incorporated into the 911 system at the discretion of the public agency operating the public safety answering point.\n(b) In addition to ensuring an appropriate response under paragraph (a), the 911 system shall include a referral to mental health crisis teams, where available.\n(a) Every public safety answering point must maintain a telephone cardiopulmonary resuscitation program by either:\n(1) providing each 911 telecommunicator with training in cardiopulmonary resuscitation; or\n(2) transferring callers to another public safety answering point with 911 telecommunicators that have received training in cardiopulmonary resuscitation.\n(b) Training in cardiopulmonary resuscitation must, at a minimum, include:\n(1) use of an evidence-based protocol or script for providing cardiopulmonary resuscitation instruction that has been recommended by an academic institution or a nationally recognized organization specializing in medical dispatch and, if the public safety answering point has a medical director, approved by that medical director; and\n(2) appropriate continuing education, as determined by the evidence-based protocol for providing cardiopulmonary resuscitation instruction and, if the public safety answering point has a medical director, approved by that medical director.\n(c) A public safety answering point that transfers callers to another public safety answering point must, at a minimum:\n(1) use an evidence-based protocol for the identification of a person in need of cardiopulmonary resuscitation;\n(2) provide each 911 telecommunicator with appropriate training and continuing education to identify a person in need of cardiopulmonary resuscitation through the use of an evidence-based protocol; and\n(3) ensure that any public safety answering point to which calls are transferred uses 911 telecommunicators who meet the training requirements under paragraph (b).\n(d) Each public safety answering point shall conduct ongoing quality assurance of its telephone cardiopulmonary resuscitation program.\nThe Statewide Emergency Communications Board shall adopt protocols to ensure that operators of every public safety answering point comply with subdivision 2.\n(a) If a caller refuses or is otherwise unwilling or unable to provide cardiopulmonary resuscitation or receive telephone cardiopulmonary resuscitation instruction, the 911 telecommunicator is not required to provide cardiopulmonary resuscitation instruction and is immune from civil liability for any damages resulting from the fact that such instruction was not provided.\n(b) Telephone cardiopulmonary resuscitation instruction is a general duty to the public rather than a special duty owed to individuals, and a 911 telecommunicator must exercise judgment and discretion in performing actions including but not limited to:\n(1) determining whether a particular situation requires instituting the cardiopulmonary resuscitation program;\n(2) determining whether a caller refuses or is otherwise unable or unwilling to provide cardiopulmonary resuscitation or receive telephone cardiopulmonary resuscitation instruction;\n(3) using and appropriately adapting an evidence-based protocol or script for providing cardiopulmonary resuscitation instruction based on individual callers and emergency situations presented by callers; and\n(4) determining when to transfer a caller to another public safety answering point with 911 telecommunicators that have received training in cardiopulmonary resuscitation.",
	"repealed": false
}