{
	"id": "62S.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.25",
	"title": "62S.25 REPORTING REQUIREMENTS.",
	"text": "Each insurer shall maintain records for each agent of that agent's amount of replacement sales as a percent of the agent's total annual sales and the amount of lapses of long-term care insurance policies sold by the agent as a percent of the agent's total annual sales.\nEach insurer shall report annually by June 30 the ten percent of its agents with the greatest percentages of lapses and replacements as measured under subdivision 1.\nReported replacement and lapse rates do not alone constitute a violation of insurance laws or necessarily imply wrongdoing. The reports are for the purpose of reviewing more closely agent activities regarding the sale of long-term care insurance.\nEach insurer shall report annually by June 30 the number of lapsed long-term care insurance policies as a percent of its total annual sales and as a percent of its total number of long-term care insurance policies in force as of the end of the preceding calendar year.\nEach insurer shall report annually by June 30 the number of replacement long-term care insurance policies sold as a percent of its total annual sales and as a percent of its total number of long-term care insurance policies in force as of the preceding calendar year.\nEach insurer shall report annually by June 30 the number of claims denied for any reason during the reporting period for each class of business, expressed as a percentage of claims denied, other than claims denied for failure to meet the waiting period or because of any applicable preexisting condition. For purposes of this subdivision, \"claim\" means a request for payment of benefits under an in-force policy regardless of whether the benefit claimed is covered under the policy or any terms or conditions of the policy have been met.\nReports under this section shall be done on a statewide basis and filed with the commissioner. They shall include, at a minimum, the information in the format contained in Appendix E (Claim Denial Reporting Form) and in Appendix G (Replacement and Lapse Reporting Form) of the Long-Term Care Model Regulation adopted by the National Association of Insurance Commissioners.",
	"repealed": false
}