{
	"id": "145.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.94",
	"title": "145.94 EXPOSURE TO HAZARDOUS SUBSTANCE.",
	"text": "To determine hazardous substance exposure to the community, the commissioner of health may enter the premises of any employer as defined in section 182.651, subdivision 7, including the University of Minnesota, to investigate the actual, suspected, or potential release of a hazardous substance if there is evidence or risk of exposure to the community. Before entering the commissioner shall present to the employer a statement of the reason, nature, and scope of the investigation at a particular location. As part of the investigation, and upon request to the employer, the commissioner must be allowed access to information required under the Employee Right-To-Know Act to determine if there are existing or potential health hazards to the community from the release of any hazardous substance originating in the workplace of the employer.\nThe commissioner may disclose to individuals or to the community, information including data made nonpublic by law, relating to the hazardous properties and health hazards of hazardous substances released from a workplace if the commissioner finds:\n(1) evidence that a person requesting the information may have suffered or is likely to suffer illness or injury from exposure to a hazardous substance; or\n(2) evidence of a community health risk and if the commissioner seeks to have the employer cease an activity which results in release of a hazardous substance.\nNonpublic data obtained under subdivision 1 is subject to handling, use, and storage according to established standards to prevent unauthorized use or disclosure. If the nonpublic data is required for the diagnosis, treatment, or prevention of illness or injury, a personal physician, advanced practice registered nurse, or physician assistant may be provided with this information if the physician, advanced practice registered nurse, or physician assistant agrees to preserve the confidentiality of the information, except for patient health records subject to sections 144.291 to 144.298. After the disclosure of any hazardous substance information relating to a particular workplace, the commissioner shall advise the employer of the information disclosed, the date of the disclosure, and the person who received the information.",
	"repealed": false
}