{
	"id": "142B.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.46",
	"title": "142B.46 REDUCTION OF RISK OF SUDDEN UNEXPECTED INFANT DEATH IN LICENSED PROGRAMS.",
	"text": "(a) When a license holder is placing an infant to sleep, the license holder must place the infant on the infant's back, unless the license holder has documentation from the infant's physician, advanced practice registered nurse, or physician assistant directing an alternative sleeping position for the infant. The physician, advanced practice registered nurse, or physician assistant directive must be on a form developed by the commissioner and must remain on file at the licensed location. An infant who independently rolls onto its stomach after being placed to sleep on its back may be allowed to remain sleeping on its stomach if the infant is at least six months of age or the license holder has a signed statement from the parent indicating that the infant regularly rolls over at home.\n(b) The license holder must place the infant in a crib directly on a firm mattress with a fitted sheet that is appropriate to the mattress size, that fits tightly on the mattress, and overlaps the underside of the mattress so it cannot be dislodged by pulling on the corner of the sheet with reasonable effort. The license holder must not place anything in the crib with the infant except for the infant's pacifier, as defined in Code of Federal Regulations, title 16, part 1511. The pacifier must be free from any sort of attachment. The requirements of this section apply to license holders serving infants younger than one year of age. Licensed child care providers must meet the crib requirements under section 142B.45. A correction order shall not be issued under this paragraph unless there is evidence that a violation occurred when an infant was present in the license holder's care.\n(c) If an infant falls asleep before being placed in a crib, the license holder must move the infant to a crib as soon as practicable, and must keep the infant within sight of the license holder until the infant is placed in a crib. When an infant falls asleep while being held, the license holder must consider the supervision needs of other children in care when determining how long to hold the infant before placing the infant in a crib to sleep. The sleeping infant must not be in a position where the airway may be blocked or with anything covering the infant's face.\n(d) When a license holder places an infant under one year of age down to sleep, the infant's clothing or sleepwear must not have weighted materials, a hood, or a bib.\n(e) A license holder may place an infant under one year of age down to sleep wearing a helmet if the license holder has signed documentation by a physician, advanced practice registered nurse, physician assistant, licensed occupational therapist, or licensed physical therapist on a form developed by the commissioner.\n(f) Placing a swaddled infant down to sleep in a licensed setting is not recommended for an infant of any age and is prohibited for any infant who has begun to roll over independently. However, with the written consent of a parent or guardian according to this paragraph, a license holder may place the infant who has not yet begun to roll over on its own down to sleep in a swaddle. A swaddle is defined as a one-piece sleepwear that wraps over the infant's arms, fastens securely only across the infant's upper torso, and does not constrict the infant's hips or legs. If a swaddle is used by a license holder, the license holder must ensure that it meets the requirements of paragraph (d) and is not so tight that it restricts the infant's ability to breathe or so loose that the fabric could cover the infant's nose and mouth. Prior to any use of swaddling for sleep by a provider licensed under this chapter, the license holder must obtain informed written consent for the use of swaddling from the parent or guardian of the infant on a form developed by the commissioner.\n(g) A license holder may request a variance to this section to permit the use of a cradleboard when requested by a parent or guardian for a cultural accommodation. A variance for the use of a cradleboard may be issued only by the commissioner licensing the program. The variance request must be submitted on a form developed by the commissioner in partnership with Tribal welfare agencies and the Department of Health.",
	"repealed": false
}