{
	"id": "60A.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.081",
	"title": "60A.081 AIRCRAFT INSURANCE.",
	"text": "(a) No policy of insurance issued or delivered in this state covering any loss, damage, expense, or liability arising out of the ownership, maintenance, or use of an aircraft, shall exclude or deny coverage because the aircraft is operated in violation of federal or civil air regulations, state law or rules, or local ordinances. This section does not prohibit the use of specific exclusions or conditions in the policy which relate to:\n(1) certification of an aircraft in a stated category by the federal aviation administration;\n(2) certification of a pilot in a stated category by the federal aviation administration;\n(3) establishing requirements for pilot experience; or\n(4) establishing limitations on the use of the aircraft.\n(b) An insured's action or failure to act is not a basis for denial of a claim, unless the insured's action or failure to act had a direct causal connection to the loss upon which the claim is based. For purposes of this paragraph, \"denial of a claim\" includes refusal to pay a claim due to a retroactive termination of the policy on the basis of the insured's action or failure to act.\nExcept as provided in subdivision 1, no policy of insurance issued or delivered in this state covering an aircraft equipped with passenger seats and covering liability hazards shall be issued excluding coverage for injury to or death of passengers or nonpassengers except as to a policy of insurance exclusively covering \"commercial operations\" as defined by section 360.013, subdivision 45, where the pilot of the aircraft has in force a separate policy of insurance providing for coverage on the aircraft as required by section 360.59, subdivision 10.\nThe provisions of this section shall not apply as to any policy issued covering aircraft being used in air commerce as defined by section 360.511, subdivision 4.",
	"repealed": false
}