{
	"id": "175.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/175.45",
	"title": "175.45 STANDARDS FOR DUAL TRAINING.",
	"text": "The commissioner of labor and industry shall convene industry representatives, identify occupational competency standards, and provide technical assistance to develop dual-training programs. The competency standards shall be identified for employment in occupations in advanced manufacturing, health care services, information technology, agriculture, transportation, child care, and the legal cannabis industry. Competency standards are not rules and are exempt from the rulemaking provisions of chapter 14, and the provisions in section 14.386 concerning exempt rules do not apply.\nFor purposes of this section, the following terms have the meanings given them:\n(1) \"competency standards\" means the specific knowledge and skills necessary for a particular occupation; and\n(2) \"dual-training program\" means an employment-based earn-as-you-learn program where the trainee is employed by a participating employer and receives structured on-the-job training and technical instruction in accordance with the competency standards.\nIn identifying competency standards, the commissioner shall consult with the commissioner of the Office of Higher Education and the commissioner of employment and economic development and convene recognized industry experts, representative employers, higher education institutions, representatives of the disabled community, and representatives of labor to assist in identifying credible competency standards. Competency standards must be consistent with, to the extent available and practical, recognized international and national standards.\nThe commissioner shall:\n(1) convene industry representatives to identify, develop, and implement dual-training programs;\n(2) identify competency standards for entry-level and higher skill levels;\n(3) verify the competency standards and skill levels and their transferability by subject matter expert representatives of each respective industry;\n(4) develop models for Minnesota educational institutions to engage in providing education and training to meet the competency standards established;\n(5) encourage participation by employers and labor in the competency standard identification process for occupations in their industry;\n(6) align dual-training programs with other workforce initiatives; and\n(7) provide technical assistance to develop dual-training programs.\nThe commissioner must communicate identified competency standards to the commissioner of the Office of Higher Education for the purpose of the dual-training competency grant program under section 136A.246. The commissioner of labor and industry shall maintain the competency standards on the department's website.",
	"repealed": false
}