{
	"id": "360.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.021",
	"title": "360.021 STATE AIRPORT.",
	"text": "The commissioner is authorized and empowered, on behalf of and in the name of this state, within the limitation of available appropriations, to acquire, by purchase, gift, devise, lease, condemnation proceedings, or otherwise, property, real or personal, for the purpose of establishing and constructing restricted landing areas and other air navigation facilities and to acquire in like manner, own, control, establish, construct, enlarge, improve, maintain, equip, operate, regulate, and police such restricted landing areas and other air navigation facilities, either within or without this state; and to make, prior to any such acquisition, investigations, surveys, and plans. The commissioner may maintain, equip, operate, regulate, and police airports, either within or without this state. The operation and maintenance of airports is an essential public service. The commissioner may maintain at such airports facilities for the servicing of aircraft and for the comfort and accommodation of air travelers. The commissioner may dispose of any such property, airport, restricted landing area, or any other air navigation facility, by sale, lease, or otherwise, in accordance with the laws of this state governing the disposition of other like property of the state. The commissioner may not acquire or take over any restricted landing area, or other air navigation facility without the consent of the owner. The commissioner shall not acquire any additional state airports nor establish any additional state-owned airports. The commissioner may erect, equip, operate, and maintain on any airport buildings and equipment necessary and proper to maintain, and conduct such airport and air navigation facilities connected therewith. The commissioner shall not expend money for land acquisition, or for the construction, improvement, or maintenance of airports, or for air navigation facilities for an airport, unless the municipality, county, or joint airport zoning board involved has or is establishing a zoning authority for that airport, and the authority has made a good-faith showing that it is in the process of and will complete with due diligence, an airport zoning ordinance in accordance with sections 360.061 to 360.074. The commissioner may provide funds to support airport safety projects that maintain existing infrastructure, regardless of a zoning authority's efforts to complete a zoning regulation. The commissioner may withhold funding from only the airport subject to the proposed zoning ordinance. Notwithstanding the foregoing prohibition, the commissioner may continue to maintain the state-owned airport at Pine Creek.\nWhere necessary in order to provide unobstructed air space for the landing and takeoff of aircraft utilizing airports and restricted landing areas acquired or operated under the provisions of sections 360.011 to 360.076, the commissioner is hereby granted authority to acquire, in the same manner as is provided for the acquisition of property for airport purposes, easements through or other interests in air space over land or water, interests in airport hazards outside the boundaries of the airports or restricted landing areas, and such other airport protection privileges as are necessary to insure safe approaches to the landing areas of said airports and restricted landing areas, and the safe and efficient operation thereof. The commissioner is also hereby authorized to acquire, in the same manner, the right of easement, for a term of years or perpetually, to place or maintain suitable marks for the daytime marking and suitable lights for the nighttime marking of airport hazards, including the right of ingress and egress to or from such airport hazards for the purpose of maintaining and repairing such lights and marks. This authority shall not be so construed as to limit the right, power, or authority of the state or any municipality to zone property adjacent to any airport or restricted landing area pursuant to any law of this state. The commissioner shall make maximum use of zoning and easements to eliminate runway and other potential airport hazards rather than land acquisition in fee.\nThis state, acting through the commissioner, may engage in all such activities jointly with the United States, other states, and with municipalities or other agencies of this state and, subject to the approval of the United States government, jointly with the Dominion of Canada or its governmental subdivisions. Such joint operations may be conducted pursuant to an agreement as described in section 360.042 and other applicable law.\nThe commissioner may exercise the power of eminent domain, in the name of the state, in the manner provided by the laws of this state for the acquisition of real property for public purposes, for the purpose of acquiring any property which the commissioner is herein authorized to acquire by condemnation. The fact that the property so needed has been acquired by the owner under power of eminent domain shall not prevent its acquisition by the exercise of the power of eminent domain herein conferred. For the purpose of making surveys and examinations relative to any condemnation proceedings, it shall be lawful to enter upon any land, doing no unnecessary damage. Notwithstanding the provisions of any other statute, or the charter of any municipality, the commissioner may take possession of any such property so to be acquired at any time after the filing of the petition describing the same in condemnation proceedings. The commissioner shall not be precluded from abandoning the condemnation of any such property in any case where possession thereof has not been taken.\nThe commissioner may lease for a term not exceeding 30 years such airports, or other air navigation facilities or real property acquired or set apart for airport purposes, to private parties, any municipal or state government or the national government, or any department of either thereof, for operation; and may lease or assign for a term not exceeding 30 years to private parties, any municipal or state government or the national government, or any department of either, for operation or use consistent with the purposes of this chapter, space, area, improvements, or equipment on such airports; may sell any part of such airports, other air navigation facilities, or real property to any municipal or state government, or to the United States or any department or instrumentality thereof, for aeronautical purposes or purposes incidental thereto; and may confer the privilege of concessions of supplying upon the airports goods, commodities, things, services, and facilities; provided that in each case in so doing the public is not deprived of its rightful, equal, and uniform use thereof.\nThe commissioner shall have the authority to determine the charges or rental for the use of any properties and the charges for any service or accommodations under the commissioner's control and the terms and conditions under which such properties may be used; provided that in all cases the public is not deprived of its rightful, equal, and uniform use of such property. Charges shall be reasonable and uniform for the same class of service and established with due regard to the property and improvements used and the expenses of operation to the state. The state shall have and the commissioner may enforce liens, as provided by law for liens and the enforcement thereof, for repairs to or improvement or storage or care of any personal property, to enforce the payment of any such charges.\nThe commissioner may contract with the owners of existing privately owned airports for the use, equipment, improvement, maintenance, management, and operation by the commissioner of such airports, and thereafter use, equip, improve, maintain, manage, operate, regulate, and police them.",
	"repealed": false
}