{
	"id": "256R.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.07",
	"title": "256R.07 ADEQUATE DOCUMENTATION.",
	"text": "A nursing facility must keep adequate documentation. In order to be adequate, documentation must:\n(1) be maintained in orderly, well-organized files;\n(2) not include documentation of more than one nursing facility in one set of files unless transactions may be traced by the commissioner to the nursing facility's annual cost report;\n(3) include a paid invoice or copy of a paid invoice with date of purchase, vendor name and address, purchaser name and delivery destination address, listing of items or services purchased, cost of items purchased, account number to which the cost is posted, and a breakdown of any allocation of costs between accounts or nursing facilities. If any of the information is not available, the nursing facility must document its good faith attempt to obtain the information;\n(4) include contracts, agreements, amortization schedules, mortgages, other debt instruments, and all other documents necessary to explain the nursing facility's costs or revenues;\n(5) include signed and dated position descriptions; and\n(6) be retained by the nursing facility to support the five most recent annual cost reports. The commissioner may extend the period of retention if the field audit was postponed because of inadequate record keeping or accounting practices as in section 256R.13, subdivisions 2 and 4, the records are necessary to resolve a pending appeal, or the records are required for the enforcement of sections 256R.04; 256R.05, subdivision 2; 256R.06, subdivisions 2, 6, and 7; 256R.08, subdivisions 1 and 3; and 256R.09, subdivisions 3 and 4.\nCompensation for personal services, regardless of whether treated as identifiable costs or costs that are not identifiable, must be documented on payroll records. Payrolls must be supported by time and attendance or equivalent records for individual employees. Salaries and wages of employees which are allocated to more than one cost category must be supported by time distribution records. Salary allocations are allowable using the Medicare-approved allocation basis and methodology only if the salary costs cannot be directly determined, including when employees provide shared services to noncovered operations.\nPayroll records supporting compensation costs claimed by nursing facilities must be supported by affirmative time and attendance records prepared by each individual at intervals of not more than one month. The requirements of this subdivision are met when documentation is provided under either clause (1) or (2):\n(1) the affirmative time and attendance record must identify the individual's name; the days worked during each pay period; the number of hours worked each day; and the number of hours taken each day by the individual for vacation, sick, and other leave. The affirmative time and attendance record must include a signed verification by the individual and the individual's supervisor, if any, that the entries reported on the record are correct; or\n(2) if the affirmative time and attendance records identifying the individual's name, the days worked each pay period, the number of hours worked each day, and the number of hours taken each day by the individual for vacation, sick, and other leave are stored electronically, equipment must be made available for viewing and printing the records.\nExcept for vehicles used exclusively for nursing facility business, the nursing facility or related organization must maintain a motor vehicle log that shows nursing facility mileage for the reporting period. Mileage paid for the use of a personal vehicle must be documented.\nComplete and orderly records must be maintained for cost allocations made to cost categories.\nFor documentation requiring a signature under this chapter or section 256B.431 or 256B.434, use of an electronic signature as defined under section 325L.02, paragraph (h), is allowed.",
	"repealed": false
}