{
	"id": "256B.6927",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.6927",
	"title": "256B.6927 QUALITY ASSESSMENT AND PERFORMANCE.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Access\" means the availability and timely use of services to achieve optimal outcomes as required under Code of Federal Regulations, part 42, sections 438.68 and 438.206.\n(c) \"External quality review\" means the analysis and evaluation by an external quality review organization of the aggregated information on quality, timeliness, and access to the health care services that a managed care organization or the managed care organization's contractor provides to enrollees.\n(d) \"External quality review organization\" means an organization that meets the competence and independence requirements under Code of Federal Regulations, part 42, section 438.354, and performs external quality review and may perform other external quality review-related activities as required under Code of Federal Regulations, part 42, section 438.358.\n(e) \"Quality\" means the degree that a managed care organization increases the likelihood of desired outcomes of a managed care organization's enrollees through:\n(1) a managed care organization's structural and operational characteristics;\n(2) the provision of services that are consistent with current professional, evidence-based knowledge; and\n(3) interventions for performance improvement.\n(f) \"Validation\" means the review of information, data, and procedures to determine the extent that information, data, and procedures are accurate, reliable, free from bias, and according to standards for data collection and analysis.\n(a) The commissioner shall implement a written quality strategy for assessing and improving the quality of health care and other services provided by managed care organizations. At a minimum, the quality strategy must include:\n(1) defined network adequacy requirements and availability of services standards for managed care organizations, including examples of evidence-based clinical practice guidelines;\n(2) measurable goals and objectives for continuous quality improvement that consider the health status of all populations served by the managed care organization;\n(3) a description of:\n(i) the quality metrics and performance targets used in measuring the performance and improvement of each managed care organization; and\n(ii) performance improvement projects, including a description of any intervention proposed by the commissioner to improve access, quality, or timeliness of care for enrollees;\n(4) annual, external independent reviews of quality outcomes, and the timeliness of and access to services covered by the managed care organization;\n(5) a description of the managed care organization's transition of care policy;\n(6) a plan to identify, evaluate, and reduce health disparities based on an enrollee's age, race, ethnicity, sex, primary language, or disability status, and provide this demographic information to the managed care organization at the time of enrollment;\n(7) appropriate use of intermediate sanctions to be imposed on a managed care organization;\n(8) the mechanisms implemented to identify enrollees who need long-term services and supports or enrollees with special health care needs; and\n(9) information related to nonduplication of the external quality review activities in accordance with Code of Federal Regulations, part 42, section 438.360, paragraph (c).\n(b) In developing the initial quality strategy, the commissioner shall:\n(1) obtain input from the Medicaid Citizens' Advisory Committee, enrollees, and other interested stakeholders;\n(2) consult with the tribes according to the tribal consultation policy;\n(3) consider recommendations from the external quality review organization identified under subdivision 3, for improving the quality of health care services furnished by the managed care organization; and\n(4) make the strategy available for public comment.\n(c) The commissioner shall submit a copy of the initial quality strategy to the Centers for Medicare and Medicaid Services for comments and feedback. If significant changes are made based on the comments and feedback received, the commissioner shall publish the revised quality strategy on the department's website. The commissioner shall make the final quality strategy available on the department's website.\n(d) The commissioner shall review and update the quality strategy at least every three years or more frequently, if needed. The review shall include an evaluation of the effectiveness of the quality strategy conducted within the previous three years. The results of the review and any updates shall be published on the department's website.\n(a) The commissioner shall contract with an external quality review organization in accordance with Code of Federal Regulations, part 42, section 438.354, to conduct an annual external quality review of each managed care organization. The commissioner shall ensure that all necessary information is provided to the external quality review organization for analysis and inclusion in the external quality review technical report required under paragraph (g). The information provided must be obtained in accordance with Code of Federal Regulations, part 42, section 438.352.\n(b) The commissioner shall follow an open, competitive procurement process according to state and federal law for any contract with an external quality review organization. The external quality review organization may use a subcontractor if the subcontractor meets the requirements for independence. The external quality review organization is accountable for and must oversee all functions performed by the subcontractor.\n(c) The following mandatory external quality review related activities must be performed for each managed care organization:\n(1) validation of performance improvement projects, performance measures, and meeting network adequacy requirements for the 12 months preceding the most recently completed contract period; and\n(2) review of the managed care organization's compliance with Code of Federal Regulations, part 42, subpart D, and section 438.330 for the preceding three years.\n(d) The commissioner may elect to incorporate any of the optional activities listed in Code of Federal Regulations, part 42, section 438.358, paragraph (c), as part of the external quality review.\n(e) To avoid duplication, the commissioner may use information from a Medicare or private accreditation review to provide information for a managed care organization's annual external quality review instead of conducting one or more of the mandatory external quality review activities. The information used must satisfy Code of Federal Regulations, part 42, section 438.360, paragraph (a).\n(f) If the conditions in Code of Federal Regulations, part 42, section 438.362, are satisfied, the commissioner may accept the data, correspondence, information, and findings regarding the managed care organization's compliance with a Medicare quality review in lieu of performing an external quality review. For each managed care organization exempt from an external quality review, the commissioner shall obtain the most recent Medicare review findings or Medicare information from a private national accrediting organization that the Centers for Medicare and Medicaid Services approves and recognizes for Medicare Advantage Organization deeming.\n(g) The qualified external quality review organization must produce an annual external quality review technical report in accordance with Code of Federal Regulations, part 42, section 438.364. The technical report must summarize findings on access and quality of care. The commissioner may revise the final external quality review technical report if there is evidence of error or omission. The final external quality review technical report must be published on the department's website by April 30 of each year and copies of the report must be made available upon request and in alternative formats. Information in the technical report must not disclose the identity or other protected patient identifying health information.",
	"repealed": false
}