{
	"id": "122A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.41",
	"title": "122A.41 TEACHER TENURE ACT; CITIES OF THE FIRST CLASS; DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of the following subdivisions in this section shall be defined as follows:\n(a) Teachers. The term \"teacher\" includes every person regularly employed, as a principal, or to give instruction in a classroom, or to superintend or supervise classroom instruction, or as placement teacher and visiting teacher. Persons regularly employed as counselors and school librarians shall be covered by these sections as teachers if licensed as teachers or as school librarians.\n(b) School board. The term \"school board\" includes a majority in membership of any and all boards or official bodies having the care, management, or control over public schools.\n(c) Demote. The word \"demote\" means to reduce the compensation a person actually receives in the new position.\n(d) Nonprovisional license. For purposes of this section, \"nonprovisional license\" shall mean an entrance, continuing, or life license.\n(a) The first three consecutive years of a teacher's first teaching experience in Minnesota in a single district are deemed to be a probationary period of employment, and the probationary period in each district in which the teacher is thereafter employed shall be one year. The school site management team or the school board if there is no school site management team, shall adopt a plan for a written evaluation of teachers during the probationary period according to subdivisions 3 and 5. Evaluation by the peer review committee charged with evaluating probationary teachers under subdivision 3 shall occur at least three times periodically throughout each school year for a teacher performing services during that school year; the first evaluation must occur within the first 90 days of teaching service. Days devoted to parent-teacher conferences, teachers' workshops, and other staff development opportunities and days on which a teacher is absent from school shall not be included in determining the number of school days on which a teacher performs services. The school board may, during such probationary period, discharge or demote a teacher for any of the causes as specified in this code. A written statement of the cause of such discharge or demotion shall be given to the teacher by the school board at least 30 days before such removal or demotion shall become effective, and the teacher so notified shall have no right of appeal therefrom.\n(b) A probationary teacher whose first three years of consecutive employment are interrupted for active military service and who promptly resumes teaching consistent with federal reemployment timelines for uniformed service personnel under United States Code, title 38, section 4312(e), is considered to have a consecutive teaching experience for purposes of paragraph (a).\n(c) A probationary teacher whose first three years of consecutive employment are interrupted for maternity, paternity, or medical leave and who resumes teaching within 12 months of when the leave began is considered to have a consecutive teaching experience for purposes of paragraph (a) if the probationary teacher completes a combined total of three years of teaching service immediately before and after the leave.\n(d) A probationary teacher must complete at least 90 days of teaching service each year during the probationary period. Days devoted to parent-teacher conferences, teachers' workshops, and other staff development opportunities and days on which a teacher is absent from school do not count as days of teaching service under this paragraph.\n(e) Notwithstanding any law to the contrary, a teacher who has taught for three consecutive years in a single school district or single charter school in Minnesota or another state must serve a probationary period of no longer than one year in a Minnesota school district.\nA board and an exclusive representative of the teachers in the district must develop a probationary teacher peer review process through joint agreement that is consistent with subdivision 5. The process may include having trained observers serve as mentors or coaches or having teachers participate in professional learning communities.\n(a) After the completion of such probationary period, without discharge, such teachers as are thereupon reemployed shall continue in service and hold their respective position during good behavior and efficient and competent service and must not be discharged or demoted except for cause after a hearing. The terms and conditions of a teacher's employment contract, including salary and salary increases, must be based either on the length of the school year or an extended school calendar under section 120A.415.\n(b) A probationary teacher is deemed to have been reemployed for the ensuing school year, unless the school board in charge of such school gave such teacher notice in writing before July 1 of the termination of such employment.\n(c) A teacher electing to have an employment contract based on the extended school calendar under section 120A.415 must participate in staff development training under subdivision 4a and shall receive an increased base salary.\n(a) A teacher electing to have a continuing contract based on the extended school calendar under section 120A.415 must participate in a total number of staff development days where the total number of such days equals the difference between the total number of days of student instruction and 240 days. Staff development includes peer mentoring, peer gathering, continuing education, professional development, or other training. A school board may schedule such days throughout the calendar year. Staff development programs provided during such days shall enable teachers to achieve the staff development outcomes under section 122A.60, subdivision 3.\n(b) A public employer and the exclusive representative of the teachers must include terms in the collective bargaining agreement for all teachers who participate in additional staff development days under paragraph (a) that increase base salaries.\n(a) To improve student learning and success, a school board and an exclusive representative of the teachers in the district, consistent with paragraph (b), may develop an annual teacher evaluation and peer review process for probationary and nonprobationary teachers through joint agreement. If a school board and the exclusive representative of the teachers in the district do not agree to an annual teacher evaluation and peer review process, then the school board and the exclusive representative of the teachers must implement the state teacher evaluation plan developed under paragraph (c). The process must include having trained observers serve as peer coaches or having teachers participate in professional learning communities, consistent with paragraph (b).\n(b) To develop, improve, and support qualified teachers and effective teaching practices and improve student learning and success, and provide all enrolled students in a district or school with improved and equitable access to more effective and diverse teachers, the annual evaluation process for teachers:\n(1) must, for probationary teachers, provide for all evaluations required under subdivision 2;\n(2) must establish a three-year professional review cycle for each teacher that includes an individual growth and development plan, a peer review process, and at least one summative evaluation performed by a qualified and trained evaluator such as a school administrator;\n(3) must include a rubric of performance standards for teacher practice that: (i) is based on the standards of effective practice in Minnesota Rules, part 8710.2000; (ii) includes culturally responsive methodologies; and (iii) provides common descriptions of effectiveness using at least three levels of performance;\n(4) must coordinate staff development activities under sections 122A.60 and 122A.61 with this evaluation process and teachers' evaluation outcomes;\n(5) may provide time during the school day and school year for peer coaching and teacher collaboration;\n(6) may include job-embedded learning opportunities such as professional learning communities;\n(7) may include mentoring and induction programs for teachers, including teachers who are members of populations underrepresented among the licensed teachers in the district or school and who reflect the diversity of students under section 120B.35, subdivision 3, paragraph (b), clause (2), who are enrolled in the district or school;\n(8) must include an option for teachers to develop and present a portfolio demonstrating evidence of reflection and professional growth, consistent with section 122A.187, subdivision 3, and include teachers' own performance assessment based on student work samples and examples of teachers' work, which may include video among other activities for the summative evaluation;\n(9) must use data from valid and reliable assessments aligned to state and local academic standards and must use state and local measures of student growth and literacy that may include value-added models or student learning goals to determine 35 percent of teacher evaluation results;\n(10) must use longitudinal data on student engagement and connection and other student outcome measures explicitly aligned with the elements of curriculum for which teachers are responsible, including academic literacy, oral academic language, and achievement of English learners;\n(11) must require qualified and trained evaluators such as school administrators to perform summative evaluations and ensure school districts and charter schools provide for effective evaluator training specific to teacher development and evaluation;\n(12) must give teachers not meeting professional teaching standards under clauses (3) to (11) support to improve through a teacher improvement process that includes established goals and timelines; and\n(13) must discipline a teacher for not making adequate progress in the teacher improvement process under clause (12) that may include a last chance warning, termination, discharge, nonrenewal, transfer to a different position, a leave of absence, or other discipline a school administrator determines is appropriate.\nData on individual teachers generated under this subdivision are personnel data under section 13.43. The observation and interview notes of peer coaches may only be disclosed to other school officials with the consent of the teacher being coached.\n(c) The department, in consultation with parents who may represent parent organizations and teacher and administrator representatives appointed by their respective organizations, representing the Professional Educator Licensing and Standards Board, the Minnesota Association of School Administrators, the Minnesota School Boards Association, the Minnesota Elementary and Secondary Principals Associations, Education Minnesota, and representatives of the Minnesota Assessment Group, the Minnesota Business Partnership, the Minnesota Chamber of Commerce, and Minnesota postsecondary institutions with research expertise in teacher evaluation, must create and publish a teacher evaluation process that complies with the requirements in paragraph (b) and applies to all teachers under this section and section 122A.40 for whom no agreement exists under paragraph (a) for an annual teacher evaluation and peer review process. The teacher evaluation process created under this subdivision does not create additional due process rights for probationary teachers under subdivision 2.\n(d) Consistent with the measures of teacher effectiveness under this subdivision:\n(1) for students in kindergarten through grade 4, a school administrator must not place or approve the placement of a student in the classroom of a teacher who is in the improvement process referenced in paragraph (b), clause (12), or has not had a summative evaluation if, in the prior year, that student was in the classroom of a teacher who received discipline pursuant to paragraph (b), clause (13), unless no other teacher at the school teaches that grade; and\n(2) for students in grades 5 through 12, a school administrator must not place or approve the placement of a student in the classroom of a teacher who is in the improvement process referenced in paragraph (b), clause (12), or has not had a summative evaluation if, in the prior year, that student was in the classroom of a teacher who received discipline pursuant to paragraph (b), clause (13), unless no other teacher at the school teaches that subject area and grade.\nAll data created and used under this paragraph retains its classification under chapter 13.\n[See Note.]\nA board and the exclusive representative of the school principals in the district may negotiate a plan for a probationary period of up to two school years for licensed teachers employed by the board who are subsequently employed by the board as a licensed school principal or assistant principal and an additional probationary period of up to two years for licensed assistant principals employed by the board who are subsequently employed by the board as a licensed school principal.\n(a) Except as otherwise provided in paragraph (b), causes for the discharge or demotion of a teacher either during or after the probationary period must be:\n(1) immoral character, conduct unbecoming a teacher, or insubordination;\n(2) failure without justifiable cause to teach without first securing the written release of the school board having the care, management, or control of the school in which the teacher is employed;\n(3) inefficiency in teaching or in the management of a school, consistent with subdivision 5, paragraph (b);\n(4) affliction with a communicable disease must be considered as cause for removal or suspension while the teacher is suffering from such disability; or\n(5) discontinuance of position or lack of pupils.\nFor purposes of this paragraph, conduct unbecoming a teacher includes an unfair discriminatory practice described in section 363A.13.\n(b) A probationary or continuing-contract teacher must be discharged immediately upon receipt of notice under section 122A.20, subdivision 1, paragraph (b), that the teacher's license has been revoked due to a conviction for child abuse, as defined in section 609.185; sex trafficking in the first degree under section 609.322, subdivision 1; sex trafficking in the second degree under section 609.322, subdivision 1a; engaging in hiring or agreeing to hire a minor to engage in prostitution under section 609.324, subdivision 1; sexual abuse under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 617.23, subdivision 3; solicitation of children to engage in sexual conduct or communication of sexually explicit materials to children under section 609.352; interference with privacy under section 609.746 or harassment or stalking under section 609.749 and the victim was a minor; using minors in a sexual performance under section 617.246; possessing pornographic works involving a minor under section 617.247; or any other offense not listed in this paragraph that requires the person to register as a predatory offender under section 243.166, or a crime under a similar law of another state or the United States.\n(c) When a teacher is discharged under paragraph (b) or when the commissioner makes a final determination of child maltreatment involving a teacher under section 260E.35, subdivision 5, the school principal or other person having administrative control of the school must include in the teacher's employment record the information contained in the record of the disciplinary action or the final maltreatment determination, consistent with the definition of public data under section 13.41, subdivision 5, and must provide the Professional Educator Licensing and Standards Board and the licensing division at the department with the necessary and relevant information to enable the Professional Educator Licensing and Standards Board and the department's licensing division to fulfill their statutory and administrative duties related to issuing, renewing, suspending, or revoking a teacher's license. Information received by the Professional Educator Licensing and Standards Board or the licensing division at the department under this paragraph is governed by section 13.41 or other applicable law governing data of the receiving entity. In addition to the background check required under section 123B.03, a school board or other school hiring authority must contact the Professional Educator Licensing and Standards Board and the department to determine whether the teacher's license has been suspended or revoked, consistent with the discharge and final maltreatment determinations identified in this paragraph. Unless restricted by federal or state data practices law or by the terms of a collective bargaining agreement, the responsible authority for a school district must disseminate to another school district private personnel data on a current or former teacher employee or contractor of the district, including the results of background investigations, if the requesting school district seeks the information because the subject of the data has applied for employment with the requesting school district.\nThe charges against a teacher must be in writing and signed by the person making the same and then filed with the secretary or clerk of the school board having charge of the school in which the teacher is employed. Before the school board discharges or demotes a teacher, the board must notify the teacher in writing and state in reasonable detail its grounds for the proposed discharge or demotion, together with a statement that the teacher may request in writing within ten days after receiving the notice a hearing before the board. The board may have the notice served personally or may send it by certified mail addressed to the teacher at the teacher's last known post office address. The teacher, under subdivision 13, also may elect a hearing before an arbitrator instead of the school board. Within ten days after receiving the notice the teacher may request in writing a hearing before the board or an arbitrator and it shall be granted. The teacher must be given reasonable notice of the time and place of the hearing before final action is taken. A teacher who fails to request a hearing within ten days is considered to acquiesce in the board's action. If the charge is made by a person not connected with the school system the charge may be disregarded by the school board. If the grounds are those specified in subdivision 6, clause (1), (2), (3), or (4), the notice must also state a teacher may request arbitration under subdivision 13. At the hearing, the school board or arbitrator shall hear all evidence that may be adduced in support of the charges and for the teacher's defense to the charges. Either party has the right to have a written record of the hearing at the expense of the board and to have witnesses subpoenaed and all witnesses so subpoenaed must be examined under oath. Any member of the school board conducting such a hearing has authority to issue subpoenas and to administer oaths to witnesses.\nEach party appearing before the school board has the right to be represented by counsel, and such counsel may examine and cross-examine witnesses and present arguments.\nAll hearings before the school board must be private or may be public at the decision of the teacher against whom such charges have been filed.\nThe hearing must be concluded and a decision in writing, stating the grounds on which it is based, rendered within 25 days after giving of such notice. Where the hearing is before a school board the teacher may be discharged or demoted upon the affirmative vote of a majority of the members of the board. If the charges, or any of such, are found to be true, the board conducting the hearing must discharge, demote, or suspend the teacher, as seems to be for the best interest of the school. A teacher must not be discharged for either of the causes specified in subdivision 6, clause (3), except during the school year, and then only upon charges filed at least four months before the close of the school sessions of such school year.\nIn all cases where the final decision is in favor of the teacher the charge or charges must be physically expunged from the records.\nAfter charges are filed against a teacher, the school board may suspend the teacher from regular duty. If the teacher is suspended or removed after the final decision, the board may in its discretion determine the teacher's salary or compensation as of the time of filing the charges. If the final decision is favorable to the teacher, the board must not abate the teacher's salary or compensation.\nA teacher against whom charges have been filed alleging any cause for discharge or demotion specified in subdivision 6, clause (1), (2), (3), or (4), may elect a hearing before an arbitrator instead of the school board. The hearing is governed by this subdivision.\n(a) The teacher must make a written request for a hearing before an arbitrator within ten days after receiving a written notice of the filing of charges required by subdivision 7. Failure to request a hearing before an arbitrator during this period is considered acquiescence to the board's action.\n(b) If the teacher and the school board are unable to mutually agree on an arbitrator, the board must request from the Bureau of Mediation Services a list of five persons to serve as an arbitrator. If the teacher and the school board are unable to mutually agree on an arbitrator from the list provided, the parties shall alternately strike names from the list until the name of one arbitrator remains. The person remaining after the striking procedure must be the arbitrator. If the parties are unable to agree on who shall strike the first name, the question must be decided by a flip of a coin. The teacher and the board must share equally the costs and fees of the arbitrator.\n(c) The arbitrator shall determine, by a preponderance of the evidence, whether the causes specified in subdivision 6, clause (1), (2), (3), or (4), exist to support the proposed discharge or demotion. A lesser penalty than discharge or demotion may be imposed by the arbitrator only to the extent that either party proposes such lesser penalty in the proceeding. In making the determination, the arbitration proceeding is governed by sections 572B.15 to 572B.28 and by the collective bargaining agreement applicable to the teacher.\n(d) An arbitration hearing conducted under this subdivision is a meeting for preliminary consideration of allegations or charges within the meaning of section 13D.05, subdivision 3, paragraph (a), and must be closed, unless the teacher requests it to be open.\n(e) The arbitrator's decision is final and binding on the parties, subject to sections 572B.18 to 572B.28.\nMS 2018 [Repealed, 1Sp2017 c 5 art 2 s 58]\nThe school board and the exclusive bargaining representative of the teachers must negotiate a plan providing for unrequested leave of absence without pay or fringe benefits for as many teachers as may be necessary because of discontinuance of position, lack of pupils, financial limitations, or merger of classes caused by consolidation of districts.\nAll evaluations and files generated within a district relating to each individual teacher must be available to each individual teacher upon the teacher's written request. Effective January 1, 1976, all evaluations and files, wherever generated, relating to each individual teacher must be available to each individual teacher upon the teacher's written request. The teacher has the right to reproduce any of the contents of the files at the teacher's expense and to submit for inclusion in the file written information in response to any material contained therein.\nA district may destroy the files as provided by law and must expunge from the teacher's file any material found to be false or substantially inaccurate through the grievance procedure required pursuant to section 179A.20, subdivision 4. The grievance procedure promulgated by the director of the Bureau of Mediation Services, pursuant to section 179A.04, subdivision 3, clause (h), applies to those principals and supervisory employees not included in an appropriate unit as defined in section 179A.03. Expungement proceedings must be commenced within the time period provided in the collective bargaining agreement for the commencement of a grievance. If no time period is provided in the bargaining agreement, the expungement proceedings must commence within 15 days after the teacher has knowledge of the inclusion in the teacher's file of the material the teacher seeks to have expunged.\nA school district must annually report to the Professional Educator Licensing and Standards Board: (1) all new teacher hires and terminations, including layoffs, by race and ethnicity; and (2) the reasons for all teacher resignations and requested leaves of absence. The report must not include data that would personally identify individuals.",
	"repealed": false
}