{
	"id": "12.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.381",
	"title": "12.381 SAFE DISPOSITION OF DEAD HUMAN BODIES.",
	"text": "Notwithstanding chapter 149A, in connection with deaths related to a declared emergency, the governor may:\n(1) direct measures to provide for the safe disposition of dead human bodies as may be reasonable and necessary for emergency response. Measures may include, but are not limited to, transportation, preparation, temporary mass burial and other interment, disinterment, and cremation of dead human bodies. Insofar as the emergency circumstances allow, the governor shall respect the religious rites, cultural customs, family wishes, and predeath directives of a decedent concerning final disposition. The governor may limit visitations or funeral ceremonies based on public health risks;\n(2) consult with coroners and medical examiners, take possession or control of any dead human body, and order an autopsy of the body; and\n(3) request any business or facility authorized to embalm, bury, cremate, inter, disinter, transport, or otherwise provide for disposition of a dead human body under the laws of this state to accept any dead human body or provide the use of its business or facility if the actions are reasonable and necessary for emergency management purposes and are within the safety precaution capabilities of the business or facility.\n(a) A person in charge of the body of a person believed to have died due to a declared emergency shall maintain a written record of the body and all available information to identify the decedent, the circumstances of death, and disposition of the body. If a body cannot be identified, a qualified person shall, prior to disposition and to the extent possible, take fingerprints and one or more photographs of the remains and collect a DNA specimen from the body.\n(b) All information gathered under this subdivision, other than data required for a death certificate under Minnesota Rules, part 4601.2550, shall be death investigation data and shall be classified as nonpublic data according to section 13.02, subdivision 9, or as private data on decedents according to section 13.10, subdivision 1. Death investigation data are not medical examiner data as defined in section 13.83. Data gathered under this subdivision shall be promptly forwarded to the commissioner of health. The commissioner may only disclose death investigation data to the extent necessary to assist relatives in identifying decedents or for public health or public safety investigations.",
	"repealed": false
}