{
	"id": "302A.417",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.417",
	"title": "302A.417 SHARE CERTIFICATES; ISSUANCE AND CONTENTS; UNCERTIFICATED SHARES.",
	"text": "The shares of a corporation shall be either certificated shares or uncertificated shares. Each holder of certificated shares issued in accordance with section 302A.405, subdivision 3, paragraph (a) is entitled to a certificate of shares.\nCertificates shall be signed by an agent or officer authorized in the articles or bylaws to sign share certificates or, in the absence of an authorization, by an officer.\nIf a person signs or has a facsimile signature placed upon a certificate while an officer, transfer agent, or registrar of a corporation, the certificate may be issued by the corporation, even if the person has ceased to have that capacity before the certificate is issued, with the same effect as if the person had that capacity at the date of its issue.\nA certificate representing shares of a corporation shall contain on its face:\n(a) the name of the corporation;\n(b) a statement that the corporation is incorporated under the laws of this state;\n(c) the name of the person to whom it is issued; and\n(d) the number and class of shares, and the designation of the series, if any, that the certificate represents.\nA certificate representing shares issued by a corporation authorized to issue shares of more than one class or series shall set forth upon the face or back of the certificate, or shall state that the corporation will furnish to any shareholder upon request and without charge, a full statement of the designations, preferences, limitations, and relative rights of the shares of each class or series authorized to be issued, so far as they have been determined, and the authority of the board to determine the relative rights and preferences of subsequent classes or series.\nA certificate signed as provided in subdivision 2 is prima facie evidence of the ownership of the shares referred to in the certificate.\nUnless uncertificated shares are prohibited by the articles or bylaws, a corporation may provide that some or all of any or all classes and series of its shares will be uncertificated shares. Such an action does not apply to shares represented by a certificate until the certificate is surrendered to the corporation. Within a reasonable time after the issuance or transfer of uncertificated shares, the corporation shall send to the new shareholder the information required by this section to be stated on certificates. This information is not required to be sent to the new shareholder by a publicly held corporation that has adopted a system of issuance, recordation, and transfer of its shares by electronic or other means not involving an issuance of certificates if the system complies with section 17A of the Securities Exchange Act of 1934. Except as otherwise expressly provided by statute, the rights and obligations of the holders of certificated and uncertificated shares of the same class and series are identical.",
	"repealed": false
}