{
	"id": "151.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.74",
	"title": "151.74 INSULIN SAFETY NET PROGRAM.",
	"text": "(a) By July 1, 2020, each manufacturer must establish procedures to make insulin available in accordance with this section to eligible individuals who are in urgent need of insulin or who are in need of access to an affordable insulin supply.\n(b) For purposes of this section, the following definitions apply:\n(1) \"manufacturer\" means a manufacturer engaged in the manufacturing of insulin that is self-administered on an outpatient basis;\n(2) \"MNsure\" means the Board of Directors of MNsure established in chapter 62V;\n(3) \"navigator\" has the meaning provided in section 62V.02; and\n(4) \"pharmacy\" means a pharmacy located in Minnesota and licensed under section 151.19 that operates in the community or outpatient license category under Minnesota Rules, part 6800.0350.\n(c) Any manufacturer with an annual gross revenue of $2,000,000 or less from insulin sales in Minnesota is exempt from this section. To request a waiver under this paragraph, the manufacturer must submit a request to the Board of Pharmacy that includes documentation indicating that the manufacturer is eligible for an exemption.\n(d) An insulin product is exempt from this section if the wholesale acquisition cost of the insulin is $8 or less per milliliter or applicable National Council for Prescription Drug Plan billing unit, for the entire assessment time period, adjusted annually based on the Consumer Price Index.\n(a) To be eligible to receive an urgent-need supply of insulin under this section, an individual must attest to:\n(1) being a resident of Minnesota;\n(2) not being enrolled in medical assistance or MinnesotaCare;\n(3) not being enrolled in prescription drug coverage that limits the total amount of cost-sharing that the enrollee is required to pay for a 30-day supply of insulin, including co-payments, deductibles, or coinsurance, to $75 or less, regardless of the type or amount of insulin prescribed;\n(4) not having received an urgent-need supply of insulin through this program within the previous 12 months, unless authorized under subdivision 9; and\n(5) being in urgent need of insulin.\n(b) For purposes of this subdivision, \"urgent need of insulin\" means having readily available for use less than a seven-day supply of insulin and in need of insulin in order to avoid the likelihood of suffering significant health consequences.\n(a) MNsure shall develop an application form to be used by an individual who is in urgent need of insulin. The application must ask the individual to attest to the eligibility requirements described in subdivision 2. The form shall be accessible through MNsure's website. MNsure shall also make the form available to pharmacies and health care providers who prescribe or dispense insulin, hospital emergency departments, urgent care clinics, and community health clinics. By submitting a completed, signed, and dated application to a pharmacy, the individual attests that the information contained in the application is correct.\n(b) If the individual is in urgent need of insulin, the individual may present a completed, signed, and dated application form to a pharmacy. The individual must also:\n(1) have a valid insulin prescription; and\n(2) present the pharmacist with identification indicating Minnesota residency in the form of a valid Minnesota identification card, driver's license or permit, individual taxpayer identification number, or Tribal identification card as defined in section 171.072, paragraph (b). If the individual in urgent need of insulin is under the age of 18, the individual's parent or legal guardian must provide the pharmacist with proof of residency.\n(c) Upon receipt of a completed and signed application, the pharmacist shall dispense the prescribed insulin in an amount that will provide the individual with a 30-day supply. The pharmacy must notify the health care practitioner who issued the prescription order no later than 72 hours after the insulin is dispensed.\n(d) The pharmacy may submit to the manufacturer of the dispensed insulin product or to the manufacturer's vendor a claim for payment that is in accordance with the National Council for Prescription Drug Program standards for electronic claims processing, unless the manufacturer agrees to send to the pharmacy a replacement supply of the same insulin as dispensed in the amount dispensed. If the pharmacy submits an electronic claim to the manufacturer or the manufacturer's vendor, the manufacturer or vendor shall reimburse the pharmacy in an amount that covers the pharmacy's acquisition cost.\n(e) The pharmacy may collect an insulin co-payment from the individual to cover the pharmacy's costs of processing and dispensing in an amount not to exceed $35 for the 30-day supply of insulin dispensed.\n(f) The pharmacy shall also provide each eligible individual with the information sheet described in subdivision 7 and a list of trained navigators provided by the Board of Pharmacy for the individual to contact if the individual needs to access ongoing insulin coverage options, including assistance in:\n(1) applying for medical assistance or MinnesotaCare;\n(2) applying for a qualified health plan offered through MNsure, subject to open and special enrollment periods;\n(3) accessing information on providers who participate in prescription drug discount programs, including providers who are authorized to participate in the 340B program under section 340b of the federal Public Health Services Act, United States Code, title 42, section 256b; and\n(4) accessing insulin manufacturers' patient assistance programs, co-payment assistance programs, and other foundation-based programs.\n(g) The pharmacist shall retain a copy of the application form submitted by the individual to the pharmacy for reporting and auditing purposes.\n(h) A manufacturer may submit to the commissioner of administration a request for reimbursement in an amount not to exceed $35 for each 30-day supply of insulin the manufacturer provides under paragraph (d). The commissioner of administration shall determine the manner and format for submitting and processing requests for reimbursement. After receiving a reimbursement request, the commissioner of administration shall reimburse the manufacturer in an amount not to exceed $35 for each 30-day supply of insulin the manufacturer provided under paragraph (d).\n(a) Each manufacturer shall make a patient assistance program available to any individual who meets the requirements of this subdivision. Each manufacturer's patient assistance programs must meet the requirements of this section. Each manufacturer shall provide the Board of Pharmacy with information regarding the manufacturer's patient assistance program, including contact information for individuals to call for assistance in accessing their patient assistance program.\n(b) To be eligible to participate in a manufacturer's patient assistance program, the individual must:\n(1) be a Minnesota resident with a valid Minnesota identification card that indicates Minnesota residency in the form of a Minnesota identification card, driver's license or permit, individual taxpayer identification number, or Tribal identification card as defined in section 171.072, paragraph (b). If the individual is under the age of 18, the individual's parent or legal guardian must provide proof of residency;\n(2) have a family income that is equal to or less than 400 percent of the federal poverty guidelines;\n(3) not be enrolled in medical assistance or MinnesotaCare;\n(4) not be eligible to receive health care through a federally funded program or receive prescription drug benefits through the Department of Veterans Affairs; and\n(5) not be enrolled in prescription drug coverage through an individual or group health plan that limits the total amount of cost-sharing that an enrollee is required to pay for a 30-day supply of insulin, including co-payments, deductibles, or coinsurance to $75 or less, regardless of the type or amount of insulin needed.\n(c) Notwithstanding the requirement in paragraph (b), clause (4), an individual who is enrolled in Medicare Part D is eligible for a manufacturer's patient assistance program if the individual has spent $1,000 on prescription drugs in the current calendar year and meets the eligibility requirements in paragraph (b), clauses (1) to (3).\n(d) An individual who is interested in participating in a manufacturer's patient assistance program may apply directly to the manufacturer; apply through the individual's health care practitioner, if the practitioner participates; or contact a trained navigator for assistance in finding a long-term insulin supply solution, including assistance in applying to a manufacturer's patient assistance program.\n(a) Upon receipt of an application for the manufacturer's patient assistance program, the manufacturer shall process the application and determine eligibility. The manufacturer shall notify the applicant of the determination within ten business days of receipt of the application. If necessary, the manufacturer may request additional information from the applicant. If additional information is needed, the manufacturer must notify the applicant within five business days of receipt of the application as to what information is being requested. Within three business days of receipt of the requested information, the manufacturer must determine eligibility and notify the applicant of the determination. If the individual has been determined to be not eligible, the manufacturer must include the reasons for denying eligibility in the notification. The individual may seek an appeal of the determination in accordance with subdivision 8.\n(b) If the individual is determined to be eligible, the manufacturer shall provide the individual with an eligibility statement or other indication that the individual has been determined eligible for the manufacturer's patient assistance program. An individual's eligibility is valid for 12 months and is renewable upon a redetermination of eligibility.\n(c) If the eligible individual has prescription drug coverage through an individual or group health plan, the manufacturer may determine that the individual's insulin needs are better addressed through the use of the manufacturer's co-payment assistance program, in which case, the manufacturer shall inform the individual and provide the individual with the necessary coupons to submit to a pharmacy. In no instance shall an eligible individual be required to pay more than the co-payment amount specified under subdivision 6, paragraph (e).\n(a) The individual shall submit to a pharmacy the statement of eligibility provided by the manufacturer under subdivision 5, paragraph (b). Upon receipt of an individual's eligibility status, the pharmacy shall submit an order containing the name of the insulin product and the daily dosage amount as contained in a valid prescription to the product's manufacturer.\n(b) The pharmacy must include with the order to the manufacturer the following information:\n(1) the pharmacy's name and shipping address;\n(2) the pharmacy's office telephone number, fax number, email address, and contact name; and\n(3) any specific days or times when deliveries are not accepted by the pharmacy.\n(c) Upon receipt of an order from a pharmacy and the information described in paragraph (b), the manufacturer shall send to the pharmacy a 90-day supply of insulin as ordered, unless a lesser amount is requested in the order, at no charge to the individual or pharmacy.\n(d) Except as authorized under paragraph (e), the pharmacy shall provide the insulin to the individual at no charge to the individual. The pharmacy shall not provide insulin received from the manufacturer to any individual other than the individual associated with the specific order. The pharmacy shall not seek reimbursement for the insulin received from the manufacturer or from any third-party payer.\n(e) The pharmacy may collect a co-payment from the individual to cover the pharmacy's costs for processing and dispensing in an amount not to exceed $50 for each 90-day supply if the insulin is sent to the pharmacy.\n(f) The pharmacy may submit to a manufacturer a reorder for an individual if the individual's eligibility statement has not expired. Upon receipt of a reorder from a pharmacy, the manufacturer must send to the pharmacy an additional 90-day supply of the product, unless a lesser amount is requested, at no charge to the individual or pharmacy if the individual's eligibility statement has not expired.\n(g) Notwithstanding paragraph (c), a manufacturer may send the insulin as ordered directly to the individual if the manufacturer provides a mail order service option.\n(h) A manufacturer may submit to the commissioner of administration a request for reimbursement in an amount not to exceed $105 for each 90-day supply of insulin the manufacturer provides under paragraphs (c) and (f). The commissioner of administration shall determine the manner and format for submitting and processing requests for reimbursement. After receiving a reimbursement request, the commissioner of administration shall reimburse the manufacturer in an amount not to exceed $105 for each 90-day supply of insulin the manufacturer provided under paragraphs (c) and (f). If the manufacturer provides less than a 90-day supply of insulin under paragraphs (c) and (f), the manufacturer may submit a request for reimbursement not to exceed $35 for each 30-day supply of insulin provided.\n(a) The Board of Pharmacy shall develop an information sheet to post on its website and provide a link to the information sheet on the board's website for pharmacies, health care practitioners, hospital emergency departments, urgent care clinics, and community health clinics. The information sheet must contain:\n(1) a description of the urgent-need insulin safety net program, including how to access the program;\n(2) a description of each insulin manufacturer's patient assistance program and cost-sharing assistance program, including contact information on accessing the assistance programs for each manufacturer;\n(3) information on how to contact a trained navigator for assistance in applying for medical assistance, MinnesotaCare, a qualified health plan, or an insulin manufacturer's patient assistance programs;\n(4) information on how to contact the Board of Pharmacy if a manufacturer determines that an individual is not eligible for the manufacturer's patient assistance program; and\n(5) notification that an individual in need of assistance may contact their local county social service department for more information or assistance in accessing ongoing affordable insulin options.\n(b) The board shall also inform each individual who accesses urgent-need insulin through the insulin safety net program or accesses a manufacturer's patient assistance program that the individual may participate in a survey conducted by the Department of Health regarding satisfaction with the program. The board shall provide contact information for the individual to learn more about the survey and how to participate. This information may be included on the information sheet described in paragraph (a).\n(c) MNsure, in consultation with the Board of Pharmacy and the commissioner of human services, shall develop a training program for navigators to provide navigators with information and resources necessary to assist individuals in accessing appropriate long-term insulin options.\n(d) MNsure, in consultation with the Board of Pharmacy, shall compile a list of navigators who have completed the training program and who are available to assist individuals in accessing affordable insulin coverage options. The list shall be made available through the board's website and to pharmacies and health care practitioners who dispense and prescribe insulin.\n(e) If a navigator assists an individual in accessing an insulin manufacturer's patient assistance program, MNsure, within the available appropriation, shall pay the navigator a onetime application assistance bonus of no less than $25. If a navigator receives a payment per enrollee of an assistance bonus under section 62V.05, subdivision 4, or 256.962, subdivision 5, the navigator shall not receive compensation under this paragraph.\n(a) If an individual disagrees with a manufacturer's determination of eligibility under subdivision 5, the individual may contact the Board of Pharmacy to request the use of a three-person panel to review eligibility. The panel shall be composed of three members of the board. The individual requesting the review shall submit to the board, with the request, all documents submitted by the individual to the manufacturer. The board shall provide the panel with the documents submitted by the individual. The panel shall render a decision within ten business days of receipt of all the necessary documents from the individual. The decision of the panel is final.\n(b) If the panel determines that the individual is eligible, the manufacturer shall provide the individual with an eligibility statement in accordance with subdivision 5.\n(a) If an individual has applied for medical assistance or MinnesotaCare but has not been determined eligible or has been determined eligible but coverage has not become effective or the individual has been determined ineligible for the manufacturer's patient assistance program by the manufacturer and the individual has requested a review pursuant to subdivision 8 but the panel has not rendered a decision, the individual may access urgent-need insulin under subdivision 3 if the individual is in urgent need of insulin as defined under subdivision 2, paragraph (b).\n(b) To access an additional 30-day supply of insulin, the individual must attest to the pharmacy that the individual meets the requirements of paragraph (a) and must comply with subdivision 3, paragraph (b).\n(a) If a manufacturer fails to comply with this section, the board may assess an administrative penalty of $200,000 per month of noncompliance, with the penalty increasing to $400,000 per month if the manufacturer continues to be in noncompliance after six months, and increasing to $600,000 per month if the manufacturer continues to be in noncompliance after one year. The penalty shall remain at $600,000 per month for as long as the manufacturer continues to be in noncompliance.\n(b) In addition, a manufacturer is subject to the administrative penalties specified in paragraph (a) if the manufacturer fails to:\n(1) provide a hotline for individuals to call or access between 8 a.m. and 10 p.m. on weekdays and between 10 a.m. and 6 p.m. on Saturdays; and\n(2) list on the manufacturer's website the eligibility requirements for the manufacturer's patient assistance programs for Minnesota residents.\n(c) Any penalty assessed under this subdivision shall be deposited in a separate insulin assistance account in the special revenue fund.\n(a) Any data collected, created, received, maintained, or disseminated by the Board of Pharmacy, the legislative auditor, the commissioner of health, MNsure, or a trained navigator under this section related to an individual who is seeking to access urgent-need insulin or participate in a manufacturer's patient assistance program under this section is classified as private data on individuals as defined in section 13.02, subdivision 12, and may not be retained for longer than ten years.\n(b) A manufacturer must maintain the privacy of all data received from any individual applying for the manufacturer's patient assistance program under this section and is prohibited from selling, sharing, or disseminating data received under this section unless required to under this section or the individual has provided the manufacturer with a signed authorization.\n(a) The conduct of any person or entity participating in or administering the insulin safety net program under this section is not subject to liability under section 62J.23, subdivisions 1 and 2.\n(b) No person or entity, including but not limited to any drug manufacturer, pharmacy, pharmacist, or third-party administrator, as part of the person's or entity's participation in or administration of the insulin safety net program established under this section, shall request or seek, or cause another to request or seek, any reimbursement or other compensation for which payment may be made in whole or in part under a federal health care program, as defined in United States Code, title 42, section 1320a-7b(f).\n(a) By February 15 of each year, beginning February 15, 2021, each manufacturer shall report to the Board of Pharmacy the following:\n(1) the number of Minnesota residents who accessed and received insulin on an urgent-need basis under this section in the preceding calendar year;\n(2) the number of Minnesota residents participating in the manufacturer's patient assistance program in the preceding calendar year, including the number of Minnesota residents who the manufacturer determined were ineligible for their patient assistance program; and\n(3) the value of the insulin provided by the manufacturer under clauses (1) and (2).\nFor purposes of this paragraph, \"value\" means the wholesale acquisition cost of the insulin provided.\n(b) By March 15 of each year, beginning March 15, 2021, the Board of Pharmacy shall submit the information reported in paragraph (a) to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance. The board shall also include in the report any administrative penalties assessed under subdivision 10, including the name of the manufacturer and amount of the penalty assessed.\n(a) The legislative auditor is requested to conduct a program review to determine:\n(1) whether the manufacturers are meeting the responsibilities required under this section, including but not limited to:\n(i) reimbursing pharmacies for urgent-need insulin dispensed under subdivision 3;\n(ii) determining eligibility in a timely manner and notifying the individuals as required under subdivision 5; and\n(iii) providing pharmacies with insulin product under the manufacturers' patient assistance programs; and\n(2) whether the training program developed for navigators is adequate and easily accessible for navigators interested in becoming trained, and that there is a sufficient number of trained navigators to provide assistance to individuals in need of assistance.\n(b) The legislative auditor may access application forms retained by pharmacies under subdivision 3, paragraph (g), to determine whether urgent-need insulin is being dispensed in accordance with this section.\n(a) The commissioner of health, in consultation with the Board of Pharmacy and individuals who are insulin-dependent, shall develop and conduct a survey of individuals who have accessed urgent-need insulin through the program and who are accessing or have accessed a manufacturer's patient assistance program since the commencement of the insulin safety net program; and a survey of pharmacies that have dispensed insulin on an urgent-need basis under the program and have participated in the manufacturers' patient assistance programs under this section.\n(b) The survey for individuals shall cover overall satisfaction with the program, including but not limited to:\n(1) accessibility to urgent-need insulin;\n(2) adequacy of the information sheet and list of navigators received from the pharmacy;\n(3) whether the individual contacted a trained navigator and, if so, if the navigator was helpful and knowledgeable;\n(4) whether the individual accessed the manufacturer's patient assistance program and, if so, how easy it was to access application forms, apply to the manufacturer's programs, and receive the insulin product from the pharmacy; and\n(5) whether the individual is still in need of a long-term solution for affordable insulin.\n(c) The survey for the pharmacies shall include, but is not limited to:\n(1) timeliness of reimbursement from the manufacturers for urgent-need insulin dispensed by the pharmacy;\n(2) ease in submitting insulin product orders to the manufacturers; and\n(3) timeliness of receiving insulin orders from the manufacturers.\n(d) The commissioner may contract with a nonprofit entity to develop and conduct the survey and to evaluate the survey results.\n(e) By January 15, 2022, the commissioner shall submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance containing the results of the surveys.\nMS 2022 [Repealed, 2024 c 127 art 56 s 8]",
	"repealed": false
}