{
	"id": "181.722",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.722",
	"title": "181.722 MISCLASSIFICATION OF EMPLOYEES.",
	"text": "(a) A person shall not:\n(1) fail to classify, represent, or treat an individual who is the person's employee pursuant to subdivision 3 as an employee in accordance with the requirements of any applicable local, state, or federal law. A violation under this clause is in addition to any violation of local, state, or federal law;\n(2) fail to report or disclose to any person or to any local, state, or federal government agency an individual who is the person's employee pursuant to subdivision 3 as an employee when required to do so under any applicable local, state, or federal law. Each failure to report or disclose an individual as an employee shall constitute a separate violation of this clause; or\n(3) require or request an individual who is the person's employee pursuant to subdivision 3 to enter into any agreement or complete any document that misclassifies, misrepresents, or treats the individual as an independent contractor or otherwise does not reflect that the individual is the person's employee pursuant to subdivision 3. Each agreement or completed document constitutes a separate violation of this provision.\n(b) An owner, partner, principal, member, officer, or agent, on behalf of the person, who knowingly or repeatedly engaged in any of the prohibited activities in this subdivision may be held individually liable.\n(c) An order issued by the commissioner to a person for engaging in any of the prohibited activities in this subdivision is in effect against any successor person. A person is a successor person if the person shares three or more of the following with the person to whom the order was issued:\n(1) has one or more of the same owners, members, principals, officers, or managers;\n(2) performs similar work within the state of Minnesota;\n(3) has one or more of the same telephone or fax numbers;\n(4) has one or more of the same email addresses or websites;\n(5) employs or engages substantially the same individuals to provide or perform services;\n(6) utilizes substantially the same vehicles, facilities, or equipment; or\n(7) lists or advertises substantially the same project experience and portfolio of work.\n(a) \"Person\" means any individual, sole proprietor, limited liability company, limited liability partnership, corporation, partnership, incorporated or unincorporated association, joint stock company, or any other legal or commercial entity.\n(b) \"Department\" means the Department of Labor and Industry.\n(c) \"Commissioner\" means the commissioner of labor and industry or a duly designated representative of the commissioner who is either an employee of the Department of Labor and Industry or a person working under contract with the Department of Labor and Industry.\n(d) \"Individual\" means a human being.\n(e) \"Knowingly\" means knew or could have known with the exercise of reasonable diligence.\nMS 2022 [Repealed by amendment, 2024 c 127 art 10 s 7]\nFor purposes of this section, the nature of an employment relationship is determined using the same tests and in the same manner as employee status is determined under the applicable workers' compensation and unemployment insurance program laws and rules.\n(a) The following damages and penalties may be imposed for a violation of this section:\n(1) compensatory damages to the individual the person has failed to classify, represent, or treat as an employee pursuant to subdivision 3. Compensatory damages includes but is not limited to the value of supplemental pay including minimum wage; overtime; shift differentials; vacation pay, sick pay, and other forms of paid time off; health insurance; life and disability insurance; retirement plans; savings plans and any other form of benefit; employer contributions to unemployment insurance; Social Security and Medicare; and any costs and expenses incurred by the individual resulting from the person's failure to classify, represent, or treat the individual as an employee;\n(2) a penalty of up to $10,000 for each individual the person failed to classify, represent, or treat as an employee pursuant to subdivision 3;\n(3) a penalty of up to $10,000 for each violation of subdivision 1; and\n(4) a penalty of $1,000 for each person who delays, obstructs, or otherwise fails to cooperate with the commissioner's investigation. Each day of delay, obstruction, or failure to cooperate constitutes a separate violation.\n(b) This section may be investigated and enforced under the commissioner's authority under state law.\nAny court finding that a violation of this section has occurred shall transmit a copy of its findings of fact and conclusions of law to the commissioner of labor and industry. The commissioner of labor and industry shall report the finding to relevant local, state, and federal agencies, including the commissioner of commerce, the commissioner of employment and economic development, the commissioner of revenue, the federal Internal Revenue Service, and the United States Department of Labor.",
	"repealed": false
}