{
	"id": "626.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.87",
	"title": "626.87 LAW ENFORCEMENT BACKGROUND INVESTIGATIONS.",
	"text": "(a) A law enforcement agency shall conduct a thorough background investigation on an applicant for employment as a licensed peace officer or an applicant for a position leading to employment as a licensed peace officer before the applicant may be employed. The background investigation must determine at a minimum whether the candidate meets the following standards:\n(1) standards established by the Minnesota Board of Peace Officer Standards and Training; and\n(2) established security standards for access to state and national computerized record and communication systems.\n(b) This requirement does not prevent a law enforcement agency from establishing higher standards for law enforcement employees if those standards are not contrary to applicable law.\n(a) The law enforcement agency must request a criminal history background check from the superintendent of the Bureau of Criminal Apprehension on an applicant for employment as a licensed peace officer or an applicant for a position leading to employment as a licensed peace officer within the state of Minnesota to determine eligibility for licensing. Applicants must provide, for submission to the superintendent of the Bureau of Criminal Apprehension:\n(1) an executed criminal history consent form, authorizing the dissemination of state and federal records to the law enforcement agency and the Board of Peace Officer Standards and Training and fingerprints; and\n(2) a money order or cashier's check payable to the Bureau of Criminal Apprehension for the fee for conducting the criminal history background check.\n(b) The superintendent of the Bureau of Criminal Apprehension shall perform the background check required under paragraph (a) by retrieving criminal history data as defined in section 13.87 and shall also conduct a search of the national criminal records repository. The superintendent is authorized to exchange the applicant's fingerprints with the Federal Bureau of Investigation to obtain their national criminal history record information. The superintendent must return the results of the Minnesota and federal criminal history records checks to the law enforcement agency who is authorized to share with the Board of Peace Officer Standards and Training to determine if the individual is eligible for licensing under Minnesota Rules, chapter 6700.\nUpon request of a law enforcement agency, an employer shall disclose or otherwise make available for inspection employment information of an employee or former employee who is the subject of an investigation under subdivision 1 or who is a candidate for employment with a law enforcement agency in any other capacity. The request for disclosure of employment information must be in writing, must be accompanied by an authorization and release signed by the employee or former employee, and must be signed by an authorized representative of the law enforcement agency conducting the background investigation.\nIf an employer refuses to disclose employment information in accordance with this section, upon request the district court may issue an ex parte order directing the disclosure of the employment information. The request must be made by an authorized representative from the law enforcement agency conducting the background investigation and must include a copy of the request for disclosure made upon the employer or former employer and the authorization and release signed by the employee or former employee. The request must be signed by the person requesting the order and an attorney representing the state or the political subdivision on whose behalf the background investigation is being conducted. It is not necessary for the request or the order to be filed with the court administrator. Failure to comply with the court order subjects the person or entity who fails to comply to civil or criminal contempt of court.\nIn the absence of fraud or malice, an employer is immune from civil liability for employment information released to a law enforcement agency under this section, or for any subsequent publication made by the employee or former employee of employment information released to a law enforcement agency under this section.\nUpon initiation of a background investigation for a person described in subdivision 1, the law enforcement agency shall give written notice to the Peace Officer Standards and Training Board of:\n(1) the candidate's full name and date of birth; and\n(2) the candidate's peace officer license number, if known.\nThe initiation of a background investigation does not include the submission of an application for employment. Initiation of a background investigation occurs when the law enforcement agency begins its determination of whether an applicant meets the agency's standards for employment as a law enforcement employee.\nIf employment information is subject to a confidentiality agreement between the employee or former employee and the employer, the employer shall disclose the fact that such an agreement exists. If the employee or former employee has authorized the release of employment information without regard to any previous agreement to the contrary, the employer shall also disclose the employment information in accordance with subdivision 2. If employment information is sealed or otherwise subject to a nondisclosure order by a court of competent jurisdiction, the employer shall disclose the fact that such an order exists, along with information identifying the court and court's file number.\nFor purposes of this section, \"employment information\" means written information in connection with job applications, performance evaluations, attendance records, disciplinary actions, and eligibility for rehire.\nFor purposes of this section, \"employer\" does not include an entity that is subject to chapter 13.",
	"repealed": false
}