{
	"id": "142A.412",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.412",
	"title": "142A.412 TRUST FUND.",
	"text": "A children's trust fund for the prevention of child abuse is established as an account in the state treasury. The commissioner of management and budget shall credit to the trust fund all amounts received under sections 142A.415 and 144.226, subdivision 3, and shall ensure that trust fund money is invested under section 11A.25. All money earned by the trust fund must be credited to the trust fund. The trust fund earns its proportionate share of the total annual state investment income.\nUntil the total amount of assets in the trust fund exceeds $20,000,000, not more than 60 percent of the gross amount contributed to the trust fund each year under section 144.226, subdivision 3, plus 100 percent of all earnings credited to the trust fund the previous fiscal year, are available for disbursement. When the commissioner of management and budget certifies that the assets in the trust fund exceed $20,000,000, only the annual earnings and the funds received under section 142A.415 that are credited to the trust fund are available for disbursement.\nNotwithstanding subdivision 2, money received under section 142A.415 may be disbursed in its entirety. This money must not be taken into account when calculating the annual contributions to the trust fund under this section.\nThe commissioner may disburse trust fund money to any public or private nonprofit agency to fund a child abuse prevention program. State funds appropriated for child maltreatment prevention grants may be transferred to the children's trust fund special revenue account and are available to carry out this section.\nThe commissioner shall develop a plan to disburse money from the trust fund. The plan must ensure that all geographic areas of the state have an equal opportunity to establish prevention programs and receive trust fund money.\n$120,000 each year is appropriated from the children's trust fund to the special revenue fund for administration and indirect costs of the children's trust fund program.\n(a) The commissioner shall:\n(1) provide for the coordination and exchange of information on the establishment and maintenance of prevention programs;\n(2) develop and publish criteria for receiving trust fund money by prevention programs;\n(3) review, approve, and monitor the spending of trust fund money by prevention programs;\n(4) provide statewide educational and public informational seminars to develop public awareness on preventing child abuse; to encourage professional persons and groups to recognize instances of child abuse and work to prevent them; to make information on child abuse prevention available to the public and to organizations and agencies; and to encourage the development of prevention programs, including programs that provide support for adolescent parents, fathering education programs, and other prevention activities designed to prevent teen pregnancy;\n(5) establish a procedure for an annual, internal evaluation of the functions, responsibilities, and performance of the commissioner in carrying out sections 142A.41 to 142A.416 and 144.226, subdivision 3;\n(6) provide technical assistance to local councils and agencies working in the area of child abuse prevention; and\n(7) accept and review grant applications.\n(b) The commissioner shall recommend to the governor changes in state programs, statutes, policies, budgets, and standards that will reduce the problems of child abuse, improve coordination among state agencies that provide prevention services, and improve the condition of children, parents, or guardians in need of prevention program services.",
	"repealed": false
}