{
	"id": "148B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.33",
	"title": "148B.33 REQUIREMENTS FOR LICENSURE.",
	"text": "An applicant for a license shall furnish evidence that the applicant:\n(1) has attained the age of majority;\n(2) is of good moral character;\n(3) is a citizen of the United States, or is lawfully entitled to remain and work in the United States;\n(4) has at least two years of supervised postgraduate experience in marriage and family therapy satisfactory to the board;\n(5)(i) has completed a master's or doctoral degree in marriage and family therapy from a program in a regionally accredited educational institution or from a program accredited by the Commission on Accreditation for Marriage and Family Therapy Education of the American Association for Marriage and Family Therapy; or (ii) has completed a master's or doctoral degree from a regionally accredited educational institution in a related field for which the course work is considered by the board to be equivalent to that provided in clause (5)(i);\n(6) will agree to conduct all professional activities as a licensed marriage and family therapist in accordance with a code of ethics for marriage and family therapists to be adopted by the board; and\n(7) has passed an examination approved by the board by rule.\nThe board must allow an applicant to satisfy the requirement for supervised postgraduate experience in marriage and family therapy with all required hours of supervision provided through real-time, two-way interactive audio and visual communication.\nEach applicant shall pay an application fee as specified under section 148B.392.\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) A qualified applicant under this subdivision must provide evidence of:\n(1) a current valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(c) A temporary license issued under this subdivision is effective for six months from the initial temporary licensure date.\n(d) During the temporary license period, the individual shall complete the licensed marriage and family therapist application for licensure.\n(e) In order to remain licensed after the expiration of the temporary license, an individual must meet the requirements in subdivisions 1 and 2.",
	"repealed": false
}