{
	"id": "116O.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116O.03",
	"title": "116O.03 CORPORATION; BOARD OF DIRECTORS; POWERS.",
	"text": "Enterprise Minnesota, Inc. is established as a public corporation of the state and is not subject to the laws governing a state agency except as provided in this chapter. The business of the corporation must be conducted under the name \"Enterprise Minnesota, Inc.\"\nThe purpose of the corporation is to foster long-term economic growth and job creation by stimulating innovation and the development of new products, services, and production processes through energy conservation, technology application and utilization, and financial assistance. The corporation's purpose is not to create new programs or services but to build on the existing educational, business, and economic development infrastructure. The primary focus of the corporation's activities must be to benefit new or existing small and medium-sized businesses in greater Minnesota.\nThe corporation is governed by a board of directors. The selection, membership terms, compensation, removal, and filling of vacancies of members of the board are as provided in the corporation's bylaws.\n[Repealed, 1991 c 322 s 20]\nThe board of directors shall adopt bylaws necessary for the conduct of the business of the corporation, consistent with this chapter. The corporation must publish the bylaws and amendments to the bylaws in the State Register.\nThe board shall locate and maintain the corporation's places of business within the state.\nThe board shall meet at least twice a year and may hold additional meetings upon giving notice in accordance with the bylaws of the corporation. Board meetings are subject to chapter 13D, except when data described in subdivision 7 is discussed.\nThe board of directors may by a majority vote in a public meeting decide to hold a closed meeting authorized under subdivision 5. The time and place of the closed meeting must be announced at the public meeting. A written roll of members present at the closed meeting must be made available to the public after the closed meeting. The proceedings of a closed meeting must be tape recorded at the expense of the board and must be preserved by the board for two years. The data on the tape is nonpublic data under section 13.02, subdivision 9.\nThe following data is classified as private data with regard to data on individuals under section 13.02, subdivision 12, or as nonpublic data with regard to data not on individuals under section 13.02, subdivision 9, whichever is applicable:\n(1) financial data, statistics, and information furnished in connection with assistance or proposed assistance under section 116O.061, including credit reports, financial statements, statements of net worth, income tax returns, either personal or corporate, and any other business and personal financial records; or\n(2) security information, trade secret information, or labor relations information, as defined in section 13.37, subdivision 1, disclosed to members of the corporation board or employees of the corporation under section 116O.061.\nA director, employee, or officer of the corporation may not participate in or vote on a decision of the board relating to an organization in which the director has either a direct or indirect financial interest.\nMS 2020 [Repealed, 2021 c 31 art 4 s 33]\nThe corporation is a state agency for purposes of section 3.736.\nDirectors and officers of the corporation are public officials for the purpose of section 10A.09, and must file statements of economic interest with the Campaign Finance and Public Disclosure Board.",
	"repealed": false
}