{
	"id": "260E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.02",
	"title": "260E.02 MULTIDISCIPLINARY CHILD PROTECTION TEAM.",
	"text": "A county shall establish a multidisciplinary child protection team that may include but is not limited to the director of the local welfare agency or designees, the county attorney or designees, the county sheriff or designees, representatives of health and education, representatives of mental health, representatives of agencies providing specialized services or responding to youth who experience or are at risk of experiencing sex or labor trafficking or sexual exploitation, or other appropriate human services, children's services, or community-based agencies, and parent groups. As used in this section, a \"community-based agency\" may include, but is not limited to, schools, social services agencies, family service and mental health collaboratives, children's advocacy centers, early childhood and family education programs, Head Start, or other agencies serving children and families. A member of the team must be designated as the lead person of the team responsible for the planning process to develop standards for the team's activities with battered women's and domestic abuse programs and services.\n[See Note.]\nA multidisciplinary child protection team may provide public and professional education, develop resources for prevention, intervention, and treatment, and provide case consultation to the local welfare agency or other interested community-based agencies. The community-based agencies may request case consultation from the multidisciplinary child protection team regarding a child or family for whom the community-based agency is providing services. As used in this section, \"case consultation\" means a case review process in which recommendations are made concerning services to be provided to the identified children and family. Case consultation may be performed by a committee or subcommittee of members representing human services or children's services, including mental health and substance use disorder providers; law enforcement, including probation and parole; the county attorney; a children's advocacy center; health care; education; community-based agencies and other necessary agencies; and persons directly involved in an individual case as designated by other members performing case consultation.\nA multidisciplinary child protection team may assist the local welfare agency, local law enforcement agency, or an appropriate private organization in developing a program of outreach services for sexually exploited youth, including homeless, runaway, and truant youth who are at risk of sexual exploitation. For the purposes of this subdivision, at least one representative of a youth intervention program or, where this type of program is unavailable, one representative of a nonprofit agency serving youth in crisis shall be appointed to and serve on the multidisciplinary child protection team in addition to the standing members of the team. These services may include counseling, medical care, short-term shelter, alternative living arrangements, and drop-in centers. A juvenile's receipt of intervention services under this subdivision may not be conditioned upon the juvenile providing any evidence or testimony.\n(a) The local welfare agency may make available to the case consultation committee or subcommittee all records collected and maintained by the agency under this chapter and in connection with case consultation. A case consultation committee or subcommittee member may share information acquired in the member's professional capacity with the committee or subcommittee to assist in case consultation.\n(b) Case consultation committee or subcommittee members must annually sign a data sharing agreement, approved by the commissioner of children, youth, and families, assuring compliance with chapter 13. Not public data, as defined in section 13.02, subdivision 8a, may be shared with members appointed to the committee or subcommittee in connection with an individual case when the members have signed the data sharing agreement.\n(c) All data acquired by the case consultation committee or subcommittee in exercising case consultation duties are confidential as defined in section 13.02, subdivision 3, and shall not be disclosed except to the extent necessary to perform case consultation, and shall not be subject to subpoena or discovery.\n(d) No members of a case consultation committee or subcommittee meeting shall disclose what transpired at a case consultation meeting, except to the extent necessary to carry out the case consultation plan. The proceedings and records of the case consultation meeting are not subject to discovery, and may not be introduced into evidence in any civil or criminal action against a professional or local welfare agency arising out of the matter or matters which are the subject of consideration of the case consultation meeting. Information, documents, or records otherwise available from original sources are not immune from discovery or use in any civil or criminal action merely because they were presented during a case consultation meeting. Any person who presented information before the consultation committee or subcommittee or who is a member shall not be prevented from testifying as to matters within the person's knowledge. However, in a civil or criminal proceeding a person shall not be questioned about the person's presentation of information before the case consultation committee or subcommittee or about opinions formed as a result of the case consultation meetings.\n(e) A person who violates this subdivision is subject to the civil remedies and penalties provided under chapter 13.\n(a) For purposes of this section, \"children's advocacy center\" means an organization using a multidisciplinary team approach whose primary purpose is to provide children who have been the victims of abuse and their nonoffending family members with:\n(1) support and advocacy;\n(2) specialized medical evaluation;\n(3) trauma-focused mental health services; and\n(4) forensic interviews.\n(b) Children's advocacy centers provide multidisciplinary case review and the tracking and monitoring of case progress.",
	"repealed": false
}