{
	"id": "169.4503",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.4503",
	"title": "169.4503 ADDITIONAL MINNESOTA SCHOOL BUS BODY STANDARDS.",
	"text": "The bus body standards contained in this section are required in addition to those required by sections 169.4501 and 169.4502. When a Minnesota standard contained in this section conflicts with a national standard adopted in section 169.4501, the Minnesota standard contained in this section is controlling.\nAn automatic audible back-up alarm may be installed. A spring-loaded button in the driver's compartment that will temporarily disable the back-up alarm is allowed for usage in school bus overnight parking lots and repair facilities.\n[Repealed, 1Sp1997 c 4 art 12 s 34]\nUpon request, a body manufacturer or school bus dealer must provide preliminary certification to the Department of Public Safety that the product meets Minnesota standards.\nFenderettes may be black. The beltline may be painted yellow over black or black over yellow. The rub rails adjacent to the beltline may be black or yellow. All other rub rails must be black. The area around the lenses of alternately flashing signal lamps extending outward from the edge of the lamp three inches, plus or minus one-quarter inch, to the sides and top and at least one inch to the bottom, must be black. Visors or hoods, black in color, with a minimum of four inches may be provided.\nAll buses manufactured after January 1, 1995, shall have a two-way voice communications system.\nThe metal floor must be covered with plywood. The plywood must be five-ply nominal five-eighths inches thick, and must equal or exceed properties of exterior-type softwood plywood, grade C-D, as specified in the standard issued by the United States Department of Commerce. All of the plywood's exposed edges must be sealed. Type A-I buses must be equipped with nominal one-half inch thick plywood or an equivalent material that meets the requirements of this subdivision. Equivalent material may be used to replace plywood, provided it has insulation R-value, deterioration, sound abatement, and moisture resistance properties that are equal to or exceed the properties of the plywood it is replacing. The floor must be level from front to back, and side to side, except in wheel housing, toe board, and driver's seat platform areas.\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n(a) Each bus must, in the beltline, identify the school district serviced, or company name, or owner of the bus. Numbers necessary for identification must appear on the sides and rear of the bus. Symbols or letters may be used on the outside of the bus near the entrance door for student identification. A manufacturer's nameplate or logo may be placed on the bus.\n(b) All type A, B, C, and D buses sold must display lettering \"Unlawful to pass when red lights are flashing\" on the rear of the bus. The lettering must be in two-inch black letters on school bus yellow background. This message must be displayed directly below the upper window of the rear door. On rear engine buses, it must be centered at approximately the same location. Only signs and lettering approved or required by state law are permitted to be displayed.\n(c) The requirements of paragraph (b) do not apply to a type A, B, C, or D school bus that is equipped with a changeable electronic message sign on the rear of the bus that:\n(1) displays one or more of the messages: \"Caution / stopping,\" \"Unlawful to pass,\" \"Stop / do not pass,\" or similar messages approved by the commissioner;\n(2) displays messages in conjunction with bus operation and activation of prewarning flashing amber signals, flashing red signals, or stop-signal arm, as appropriate; and\n(3) is a supplemental warning system under subdivision 31.\nThermal insulation is required. It shall be fire-resistant, UL approved, with minimum R-value of 5.5. Insulation shall be installed so as to prevent sagging.\nInterior speakers, except in the driver's compartment, must not protrude more than one-half inch from the mounting surface.\n(a) If installed, a white flashing strobe shall be of a double flash type. No roof hatch can be mounted behind the strobe light.\n(b) All lamps on the exterior of the vehicle must conform with and be installed as required by federal motor vehicle safety standard number 108, Code of Federal Regulations, title 49, part 571.\n(c) A type A, B, C, or D school bus manufactured for use in Minnesota after December 31, 1994, may not be equipped with red turn-signal lenses on the rear of the bus.\n[Repealed, 2007 c 146 art 8 s 15]\n[Repealed, 2007 c 146 art 8 s 15]\nThere shall be one rub rail at the base of the skirt of the bus on all type A, excluding van conversions, B, C, and D buses.\nAll restraining barriers and passenger seats shall be covered with a material that has fire retardant or fire block characteristics.\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 1Sp1997 c 4 art 12 s 34]\n(a) Windshield, entrance, and rear emergency exit doors must be of approved safety glass. Laminated or tempered glass (AS-2 or AS-3) is permitted in all other windows. All glass shall be federally approved and marked as provided in section 169.74. The windshield may be of uniform tint throughout or may have a horizontal gradient band starting slightly above the line of vision and gradually decreasing in light transmission to 20 percent or less at the top of the windshield.\n(b) The use of tinted glass, as approved by section 169.71, is permitted on side windows and rear windows except for the entrance door and the window to the left of the driver. The window to the left of the driver and the upper service door windows must be thermal glass. Regardless of a bus's date of manufacture, the window immediately behind the entrance door does not need to be made of thermal glass. The window to the left of the driver for type A buses need not be thermal glass.\nIf a master cutoff switch is used, it shall not be wired as to kill power to the electric brake system.\n[Repealed, 2004 c 294 art 2 s 34]\n[Repealed, 2007 c 146 art 8 s 15]\nMS 2012 [Expired, 2009 c 96 art 8 s 6]\nAll buses manufactured for use in Minnesota after January 1, 2013, shall be equipped with a crossing control arm mounted at the right front corner of the front bumper. The crossing control arm shall be automatically activated whenever the bus is stopped with the flashing red signals in use.\nAdditional auxiliary fans are required for school buses manufactured on or after December 31, 2012, and shall meet the following requirements:\n(a) Fans for the left and right sides of the windshield shall be placed in a location where they can be adjusted for maximum effectiveness and where they do not obstruct vision to any mirror. Type A buses may be equipped with one fan.\n(b) Fans shall be a minimum of six inches in diameter.\n(c) Fan blades shall be covered with a protective cage. Each fan shall be controlled by a separate switch.\nCamera heads for video or mobile surveillance may be mounted in the driver compartment area, midbus, or on a rear interior bulkhead in the student passenger area. For buses manufactured or retrofitted with a surveillance system after December 31, 2012, cameras mounted midbus must be parallel to a seat back, must not have any sharp edges, must not extend outward more than 3-1/2 inches, and must be located within 24 inches of the top of the side window of the bus.\nType A, B, C, or D school buses may be equipped with a supplemental warning system.\nA supplemental warning system must:\n(1) use amber and red signal colors;\n(2) use supplemental amber warning lights activated only in conjunction with activated overhead amber warning lights and supplemental red warning lights activated only in conjunction with activated overhead red flashing lights;\n(3) be wired so the supplemental warning system is automatically activated in conjunction with activation of prewarning flashing amber signals, stop-signal arm, and flashing red signals;\n(4) be programmed to flash at a rate of 60 to 120 flashes per minute by either:\n(i) using a randomized flash pattern; or\n(ii) alternating with the corresponding overhead light; and\n(5) use lights installed in pairs and mounted on the same level and placed as wide as practicable on the body above the bumper level.",
	"repealed": false
}